{
  "id": "pk-abandoned-properties-management-act-1975",
  "type": "statute",
  "title": "Abandoned Properties (Management) Act, 1975",
  "title_en": "Abandoned Properties (Management) Act, 1975",
  "short_name": "APA",
  "status": "in_force",
  "issued_date": "1975-02-16",
  "in_force_date": "1975-02-16",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2Fp-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Abandoned Properties (Management) Act, 1975 (XX of 1975) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This act may be called the Abandoned\nProperties (1[* * *] Management) Act, 1975.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(a)        “abandoned property” means any property, movable or immovable (including\nshare in industrial units and firms, investments, deposits, policies of insurance\nand all other interests and rights in or to or arising out of any such property),\nbelonging to a specified person and includes any such property sold or\ntransferred to, or placed under the supervision or control of, any other person\non or after the sixteenth day of December, 1971, but does not include any\nornaments or wearing apparel or any cooking vessels or other house-hold effects\nin the immediate possession of a specified person, not exceeding a total of\nrupees one thousand;\n(b)        “Administrator” means the Administrator appointed under section 5, and\nincludes a Deputy Administrator;\n(c)        “Board” means the Board of Trustees constituted under section 4;\n(d)        “prescribed” means prescribed by rules;\n(e)        “rules” means rules made under this Act;\n________________________________________________________________________________\n1\nOmitted by Act No. XLV of 1976, (w. e. f 12-2-75) ss. 2-3.\n1\n[(f)    “specified person” means a person who, at any time before the sixteenth day of\nDecember, 1971, was a citizen of Pakistan domiciled in the territories which\nbefore the said day constituted the Province of East Pakistan and who, on or\nafter that day, has ceased or ceases to be a citizen of Pakistan, and includes a\ncompany registered in the said territories the registered office of which has not\nbeen shifted in pursuance of the Companies (Shifting of Registered Office)\nOrdinance, 1972 (V of 1972).]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Vesting of abandoned property in Government",
      "content": "All abandoned property shall vest and\nshall be deemed always to have vested in the Federal Government on and from the sixteenth day of\nDecember, 1971."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Board of Trustees",
      "content": "(1) As soon as may be after the commencement of this Act, the Federal\nGovernment shall, by notification in the official Gazette, constitute a Board of Trustees consisting of\na Chairman and such number of other Trustees as the Federal Government may specify in the\nnotification, for the control and management of abandoned property.\n(2) In discharging its functions, the Board shall be guided on questions of policy by the\ninstructions, if any, given to it by the Federal Government which shall be the sole judge as to whether\na question is a question of policy.\n(3) The meetings of the Board shall be held at such intervals and at such time and place as the\nChairman of the Board may determine.\n(4) Subject to the rules, the Board may, with the previous approval of the Federal Government\nand by notification to the official Gazette, make regulations for regulating its procedure.\n(5) At any time when the office of Chairman is vacant or the Chairman is absent or is unable\nto perform the functions of his office due to any other cause, the Federal Government may appoint any\nmember of the Board to act as Chairman until a Chairman is appointed or, as the case may be, the\nChairman resumes his functions."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Appointment of Administrator and Deputy Administrators",
      "content": "(1) For the purpose of\ncarrying the provisions of this Act into effect, the Federal Government may, by notification in the\nofficial Gazette, appoint an Administrator for Pakistan and one or more Deputy Administrators for\nsuch areas as may be specified in the notification.\n(2) The Administrator shall exercise his powers and perform his functions subject to the general\nsupervision and control of the Board and shall be guided by any general or special order made by the\nBoard.\n________________________________________________________________________________\n1Subs. by Act No. XLV of 1976, s. 4 (w. e. f. 12-2-1975)."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Holding of abandoned property and its surrender, etc",
      "content": "(1) Every person who is, or has\nat any time after the sixteenth day of December ,1971, been in possession, supervision or management\nof any abandoned property shall be deemed to hold or to have held, as the case may be, such property\non behalf of the Board.\n(2) As soon as may be, but not later than such date as may be notified by the Federal\nGovernment in the official Gazette, every person who is, or has at any time after the sixteenth day of\nDecember 1971, been in possession, supervision or management of any abandoned property or\nproperty which he knows or has reason to believe to be abandoned property, and whose authority or\nright to hold, occupy, supervise or manage such property has not been accepted or approved by the\nAdministrator, shall submit to the Administrator, or to any person authorised by him in this behalf,—\n(a)     full information relating to such property, including the date since when, or the\nperiod for which, he had been in possession, supervision or management\nthereof; and\n(b)     a detailed account of the rents, profits, income and other moneys received or\nbenefits derived from such property since the sixteenth day of December, 1971,\nor for the period he has been in possession, supervision or management thereof.\n(3) Every person as aforesaid shall, as soon as may be, but not later than such date as may be\nnotified by the Federal Government in the official Gazette, intimate to the Administrator in writing his\nwillingness to surrender such property to the Administrator or to any person authorised by the\nAdministrator in this behalf, and shall surrender the same if called upon by the Administrator or any\nperson authorised as aforesaid."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power of Administrator to take possession of abandoned property",
      "content": "If any person who\nhas purchased any abandoned property the sale of which has not been confirmed by the Administrator\nunder section 13, or who is in possession, supervision or management of any abandoned property or\nproperty which he knows or has reason to believe to be abandoned property does not surrender such\nproperty to the Administrator or the person authorised by him in this behalf, then, without prejudice to\nany other action or penalty to which such person may otherwise be liable, the Administrator may use\nsuch force as is necessary for taking possession of such property and may for this purpose, after giving\nreasonable warning and facility to any woman not appearing in public to withdraw, remove or break\nopen any lock, bolt or door, or do any other act necessary for the said purpose."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Payment to Administrator",
      "content": "(1) Any amount due to a specified person or payable in\nrespect of any abandoned property or property of which the Administrator has taken possession shall\nbe paid to the Administrator by the person liable to pay the same.\n(2) Any person who makes a payment under sub-section (1) shall be discharged from further\nliability to pay to the extent of the payment made."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Recovery of damages for unauthorised possession",
      "content": "Any person who has been in\npossession or occupation of abandoned property in an unauthorised manner or is found to have\nmisappropriated or unlawfully converted abandoned property to his own use or caused loss to it by his\nact or omission shall, without prejudice to any other action or penalty to which he may otherwise be\nliable, pay such damages as may be assessed by the Administrator:\nProvided that no such damages shall be assessed by the Administrator without giving notice to\nsuch person and affording him an opportunity of being heard."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Exemption from legal process",
      "content": "(1) Property which has vested in the Federal\nGovernment or of which possession has been taken by the Administrator shall be exempted from all\nlegal process, including seizure, distress, ejectment, attachment or sale by any officer of a Court or any\nother authority, and no injunction or other order of whatever kind in respect of such property shall be\ngranted or made by any Court or any other authority, and the Federal Government shall not be divested\nand the Administrator shall not be dispossessed of such property by operation of any law for the time\nbeing in force.\n(2) Upon the commencement of this Act, any such legal process as aforesaid subsisting\nimmediately before such commencement shall cease to have effect and all abandoned property in\ncustody of any Court, or receiver, guardian or other officer or person appointed by it, shall, upon\ndelivery of the same being called for by the Administrator, be delivered to the Administrator."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Publication of list of abandoned property",
      "content": "The Administrator shall publish, by\nnotification in the official Gazette, a list of abandoned property in any area."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Prohibition of transfers of property generally",
      "content": "The Federal Government may, by\nnotification in the official Gazette, declare that in such area with a view to preventing the unauthorised\nor surreptitious transfer of abandoned properties in any area in which a considerable number of such\nproperties is believed to be situated, for such period as may be specified in the notification, the transfer\nof any property or class of property, or the creation of any right or interest therein or encumbrance\nthereon, shall be prohibited, and where any such declaration has been made, no such transfer or\ncreation shall be made during that period in that area except with the previous approval in writing of\nthe Administrator."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Confirmation of transfers by specified persons",
      "content": "(1) No creation or transfer of any right\nor interest in or encumbrance upon any property made in any manner whatsoever on or after the\nsixteenth day of December, 1971, by or on behalf of a specified person shall be effective so as to confer\nany right or remedy on any party thereto or on any person claiming under any such party, unless it is\nconfirmed by the Administrator.\n(2) An application for confirmation of such creation of any right or encumbrance or transfer as\naforesaid as may be made to the Administrator within the prescribed period by any party thereto, or by\nany person claiming under or lawfully authorised by such party.\n(3) The Administrator shall hold a summary inquiry into the application in the prescribed\nmanner and may reject the application if he is of opinion that the creation or transfer—\n(i)     was not or has been entered into in good faith or for adequate\nconsideration; or\n(ii)    ought for any other reason not to be confirmed.\n(4) If the application is not rejected under sub-section (3), the Administrator may, with the prior\napproval of the Board, confirm the creation or transfer either unconditionally or subject to such terms\nand conditions as he thinks fit to impose."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Claims by interested persons",
      "content": "(1) Any person claiming any right or interest in any\nproperty treated by the Administrator as abandoned property may prefer a claim to the Administrator\non the ground that—\n(a)     the property is not abandoned property ; or\n(b)     his interest in the property has not been affected by the provisions of this\nAct.\n(2) An application under sub-section (1) shall be made within the prescribed period being a\nperiod of not less than thirty days from the prescribed date.\n(3) On receiving an application under sub-section (2), the Administrator shall hold a summary\ninquiry in the prescribed manner and, after taking such evidence as may be produced, shall pass an\norder stating the reasons therefor, rejecting the application or allowing it wholly or in part on such\nterms and conditions as he thinks fit to impose."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Appeal and revision",
      "content": "(1) Any person aggrieved by an order or decision of the\nAdministrator may, within the prescribed period, which shall not be less than twenty-one days, prefer\nan appeal to the Board.\n(2) The Board may, after giving the appellant an opportunity of being heard, pass such order\nas it thinks fit.\n(3) The Board may, at any time, either of its own motion or on the application of any person\nmade within the prescribed period, call for the record of any proceeding under this Act which is\npending before, or has been disposed of by the Administrator, for the purpose of satisfying itself as to\nthe legality or propriety of any order passed in the said proceeding and may after perusal of the record\npass such order in relation thereto as it thinks fit:\nProvided that the Board shall not, under this sub-section, pass an order revising or modifying\nan order affecting any person without giving such person an opportunity of being heard.\n(4)     An order of the Board in an appeal or revision shall be final."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Powers and duties of the Administrator generally",
      "content": "(1) The Administrator may take\nsuch measures as he considers necessary or expedient for the purpose of securing, administering and\nmanaging any abandoned property or property of which possession has been taken by him and may,\nfor and such purpose as aforesaid, do all acts and incur all expenses necessary or incidental thereto.\n(2)     Without prejudice to the generality of the provisions contained it sub-section (1), the\nAdministrator may—\n(a)        carry on the business or undertaking of a specified person ;\n(b)        enter or authorise any person to enter on any land or premises to inspect any\nabandoned property;\n(c)        take all such measures as may be necessary to keep any abandoned property in\ngood repair ;\n(d)        direct any person, notwithstanding anything contained in any other law for the\ntime being in force relating to the disclosure of any information by a public\nservant or any other person, to furnish such return, account or other\ninformation in relation to any property and to produce such documents as the\nAdministrator considers necessary for the discharge of his duties under this\nAct ;\n(e)        search, or authorise any other person to search, any building or place in which\nthe Administrator has reason to believe that any abandoned property or any\ndocument tending to show that any person is a specified person or that any\nproperty is abandoned property is being kept or concealed and take possession\nthereof ;\n(f)        determine the rent to be recovered from a person found in unauthorised\noccupation of abandoned property for the period of such occupation ;\n(g)        create a charge on abandoned property ;\n(h)        incur or allow any expenditure to be incurred in the prescribed manner including\nthe payment of taxes, duties, cesses and rates to the Government or to any local\nauthority or of any debt due by a specified person or any claim against him after\nsatisfying himself as to the genuineness of such due or claim;\n(i)        demolish or dismantle any abandoned property which in the opinion of the\nAdministrator cannot be repaired ;\n(j)        evict with such force as may be necessary an unauthorised occupant of\nabandoned property or an occupant of such property to whom it has been let out\nby or on behalf of the Administrator and who makes default in paying the rent\nfor such property or otherwise commits a breach of the terms on which it is\nlet out ;\n1\n(k)            [*    *          *      *      *       *   *]\n2\n[(l)   invest in any security approved by the Federal Government in the manner as\nmay be prescribed.]\n(3)     The Administrator shall exercise the powers and perform the functions assigned to him\nby or under this Act under the general supervision and control of the Board."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Evaluation of abandoned property",
      "content": "(1) The Administrator may determine the value of\nany property of which possession has been taken by him or empower any officer to do so.\n1\nOmitted by Finance Act, 2019 (Act No. V of 2019), s. 8.\n2\nAdded by the Finance Act, 2024 (Act No. X of 2024), s. 6.\n(2) If it appears to the Board in any case that the value of any property determined under sub-\nsection (1) is not proper, it may make necessary enquiry an the matter and pass such orders as it may\nthink proper and the orders so passed shall be final."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Expenditure by Administrator how to be recouped",
      "content": "Subject to the provisions of\nsection 14, any expenditure incurred by the Administrator in the exercise of any power conferred by\nthis Act shall, in relation to any abandoned property in respect of which it has been incurred, be a\ncharge on such property and shall have priority over all other charges on the property and such\nexpenditure may be met or recouped by the Administrator out of the income accruing from such\nproperty."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Maintenance of accounts by Administrator",
      "content": "(1) The Administrator shall maintain a\nseparate account of each abandoned property of which he has taken possession, and shall cause to be\nmade therein entries of all receipts and expenditure in respect thereof 1[Any surplus of receipts over\nthe actual expenditure in a year shall be remitted to the Federal Consolidated Fund.].\n(2) The account shall be maintained in such form and in such manner as the Federal\nGovernment may direct.\n(3) The Federal Government shall cause the account to be inspected and audited at such interval\nand by such persons as it may, in consultation with the Auditor General of Pakistan, determine."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Powers of Board and Administrator when holding an inquiry, etc",
      "content": "(1) When holding\nan inquiry or hearing an appeal or revision under this Act, the Administrator, or as the case may be,\nthe Board shall have the same powers as are vested in a Court under the Code of Civil Procedure, 1908\n(Act V of 1908), when trying a suit, in respect of the following matters, namely:—\n(a)        enforcing the attendance of any person and examining him on oath or\naffirmation ;\n(b)        compelling the discovery and production of documents, articles and things ;\n(c)        issuing a commission for the examination of witnesses ;\n(d)        any prescribed matter.\n(2) Every proceeding before the Administrator or the Board under this Act shall be deemed to\nbe judicial proceeding within the meaning of sections 193 and 228 of the Pakistan Penal Code (Act\nXLV of 1860), and for the purposes of section 196 of that Code, the Administrator or the Board shall\nbe deemed to be a Court within the meaning of sections 480 and 482 of the Code of Criminal\nProcedure, 1898 (Act V of 1898).\n1\nAdded by Finance Act, 2019 (Act No. V of 2019), s. 8."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Recovery of arrears",
      "content": "When any person is in default in making payment of any amount\npayable to the Administrator and under this Act or in pursuance of any rule, regulation or agreement\nmade or entered into thereunder, the Administrator may, in accordance with the rules recover the -\namount 1[, alongwith interest thereon at such rate as the Federal Government may, by notification in\nthe official Gazette, specify,], by one or more of the following modes, namely:\n(a)         attachment and sale, or sale without attachment, of any movable and\nimmovable property of such person ; and\n(b)         appointment of a receiver for the management of the movable and immovable\nproperties of such person."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Penalty and procedure",
      "content": "(1) Any person who\n(a)        contravenes, or resists or interferes with the enforcement of the provisions of\nthis Act or any rule or order made thereunder; or\n(b)        in an application or in any proceedings under this Act, furnishes or abets the\nfurnishing of any information which he knows or has reason to believe to be\nfalse, or fraudulantly conceals or mis-represents facts, or abets such\nconcealment or mis-representation,\nshall be punishable with rigorous imprisonment for a term which may extend\nto three years, or with fine or with both.\n(2) No Court shall take cognizance of any offence punishable under this Act save upon a\ncomplaint is writing made by an officer appointed under this Act and authorised by the Board in this\nbehalf."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Bar of jurisdiction",
      "content": "No court shall grant any injunction or make any order, nor shall any\ncourt entertain any proceeding, in relation to anything done under this Act."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Indemnity",
      "content": "No suit, prosecution or other legal proceeding shall lie against the Federal\nGovernment, the Board, the Administrator, a Deputy Administrator or any other person for anything\nin good faith done or intended to be done under this Act."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Delegation of powers",
      "content": "The Federal Government may, by notification in the official\nGazette, direct that all or any of its powers under this Act shall, subject to such conditions, if any, as\nmay be specified in the notification, be exercised also by such officer or authority as may be so\nspecified."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Officers and servants",
      "content": "The Board may appoint or employ such officers and servants as\nit considers necessary for the efficient performance of its functions, on such terms and conditions as it\nmay determine.\n1\nIns. by Act No. XLV of 1976, s. 5 (w. e. f 12-2-1975)."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Act to override other laws",
      "content": "The provisions of this Act or any order or rule made\nthereunder shall have effect notwithstanding anything inconsistent therewith contained in any other\nlaw for the time being in force or in any instrument having effect by virtue of any such law and nothing\ncontained in any law relating to the determination of the rent of any immovable property shall apply\nto any abandoned property."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Power to exempt",
      "content": "The Federal Government may by notification in the official Gazette,\nexempt any person or class of persons or any property or class of property from the operation of all or\nany of the provisions of this Act."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Power of Federal Government to take action with regard to abandoned property",
      "content": "1\n[(1)] Federal Government may, for the purpose of regulating the administration 2[, or disposal in the\npublic interest, by the way of transfer or otherwise,] of any abandoned property, make such orders or\ndirect such action to be taken in relation thereto as in its opinion the circumstances of the case require\nand as is not inconsistent with any of the provisions of this Act.\n(2) 3[*               *          *          *           *      *       *]"
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Power to make rules",
      "content": "(1) The Federal Government may, by notification in the official\nGazette, make such rules as appear to it to be necessary for carrying out the purposes of this Act.\n(2) In particular, and without prejudice to the generality of the foregoing power, such rules\nmay provide for all or any of the following matters, namely:—\n(a)        the terms and conditions of service of the Administrator and Deputy\nAdministrators ;\n(b)        the functions to be performed by the Administrator and the Deputy\nAdministrators ;\n(c)        the manner in which entry or search under clause (b) or clause (e) of sub-section\n(2) of section 16 may be made or possession of any abandoned property may be\ntaken by the Administrator ;\n(d)        the manner in which inquiries under this Act may be held ;\n(e)        the time within which application for confirmation under section 13 or\npreferring claim under section 14 may be made ;\n(f)        the income-tax authority who may issue a no-objection certificate under section\n13 ;\n_________________________________________________________________________________\n1\nRe-numbered by the Finance Act, 2019 (Act No. V of 2019), s. 8.\n2\nIns. by Act No. XLV of 1976, s. 6 (w. e. f. 12-2-75).\n3\nOmitted by the Finance Act, 2024 (Act No. X of 2024), s. 6.\n(g)        the powers vested in a civil court which may be exercised by the Administrator\nwhen holding any inquiry under this Act ;\n(h)        the fees payable to the Administrator for the administration of abandoned\nproperty ; and\n(i)        the delegation of powers and functions of the Administrator to a Deputy\nAdministrator or any other officer appointed under this Act."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. 1[Omitted]",
      "content": "___________\nRGN Date: 05-09-2024\n1\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch. II."
    }
  ],
  "definitions": [
    {
      "term": "abandoned property",
      "definition": "any property, movable or immovable (including share in industrial units and firms, investments, deposits, policies of insurance and all other interests and rights in or to or arising out of any such property), belonging to a specified person and includes any such property sold or transferred to, or placed under the supervision or control of, any other person on or after the sixteenth day of December, 1971, but does not include any ornaments or wearing apparel or any cooking vessels or other house-hold effects in the immediate possession of a specified person, not exceeding a total of rupees one thousand;",
      "source_provision": "sec2"
    },
    {
      "term": "Administrator",
      "definition": "the Administrator appointed under section 5, and includes a Deputy Administrator;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of Trustees constituted under section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act; ________________________________________________________________________________ 1 Omitted by Act No. XLV of 1976, (w. e. f 12-2-75) ss. 2-3. 1 [(f) “specified person” means a person who, at any time before the sixteenth day of December, 1971, was a citizen of Pakistan domiciled in the territories which before the said day constituted the Province of East Pakistan and who, on or after that day, has ceased or ceases to be a citizen of Pakistan, and includes a company registered in the said territories the registered office of which has not been shifted in pursuance of the Companies (Shifting of Registered Office) Ordinance, 1972 (V of 1972).]",
      "source_provision": "sec2"
    }
  ]
}
