{
  "id": "pk-acceding-state-property-order-1961",
  "type": "statute",
  "title": "Acceding State (Property) Order, 1961",
  "title_en": "Acceding State (Property) Order, 1961",
  "short_name": "ASO",
  "status": "in_force",
  "issued_date": "1961-08-21",
  "in_force_date": "1961-08-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5plag%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Acceding State (Property) Order, 1961 (12 of 1961) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. In this Order, references to a State shall be construed as references to a State which has at",
      "content": "any time after the 14th day of August 1947 been in accession with Pakistan, and references to a Ruler\nshall be construed as including references to the Ruler of such a State and to the person recognized for\nthe time being under the Rulers (Recognition of Successors) Order, 1960, as successor of the Ruler."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Where any question arises directly or indirectly between persons claiming to be the heirs",
      "content": "and successors of the Ruler of a state or claiming to succeed to the State, concerning the devolution\nand distribution of any property of that State or of the Ruler, the question shall be decided by an order\nof the 1[Federal Government]."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. A question whether any disposition of property, whether purporting to be the property of the",
      "content": "State or of the Ruler, has been made in the due exercise of power to make it or ought for any reason to\nbe undone shall be deemed to be a question falling under the preceding Article.\n5.—(1) Where the decision requires the recovery of a sum of money the order shall direct that\nthe sum be recovered as an arrear of land revenue, and where it requires the recovery of any other\nproperty it shall direct the attachment of such property by seizure, and upon the sum being recovered\nor the property being attached, the same shall forthwith be at the disposal of the 1[Federal Government]\nand shall be disposed of by the 1[Federal Government] by direction in such a way as may best give\neffect to the decision.\n(2) An order requiring recovery shall be directed to the Deputy Commissioner, and an order\nrequiring attachment shall be directed to the District Magistrate, of the district concerned and he shall\ncause it to be executed according to its tenor.\n(3) Where the property is other than money, and has been lost or destroyed or otherwise\ndisposed of and is irrecoverable the 1[Federal Government] may assess its value in money and order\nthe recovery of an equivalent sum as an arrear of land revenue as provided in clause (1)."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. All expenses incurred by the 1[Federal Government] in determining any question referred to",
      "content": "it under Article 3 and all expenses incidental or consequential thereto shall be recoverable from the\nproperty to which the dispute relates, and shall be the first charge thereon."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. No Court shall have jurisdiction to entertain any such question as is referred to in Article 3,",
      "content": "and no Court shall call in question any order of the 1[Federal Government] made under that Article or\nArticle 5 or any proceedings connected therewith.\n1\nSubs. by Ord. III of 2000, s.2, for “Provincial Government”, which previously subs. by F.A.O., 1975, Art. 2 & Sch. for “Central Government”."
    }
  ],
  "definitions": []
}
