{
  "id": "pk-access-to-the-media-deaf-persons-act-2022",
  "type": "statute",
  "title": "Access to the Media (Deaf) Persons Act, 2022",
  "title_en": "Access to the Media (Deaf) Persons Act, 2022",
  "short_name": "ATTMP",
  "status": "in_force",
  "issued_date": "2022-12-29",
  "in_force_date": "2022-12-29",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5lqZw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Access to the Media (Deaf) Persons Act, 2022 (XL of 2022) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act shall be called the Access to the\nMedia (Deaf) Persons Act, 2022.\n(2) It extend to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the subject or context,—\n(a)     “Authority”   means    the    Pakistan Electronic     Media Regulatory\nAuthority established under section 3 of the Pakistan Electronic\nMedia Regulatory Authority Ordinance, 2002 (XIII of 2002);\n(b)     “Board” means        the National      Policy    Board     established    under\nsection 5;\n(c)     “broadcast media” means such media which originate and\npropagate broadcast and prerecorded signals by terrestrial means or\nthrough satellite for television and includes teleporting, provision of\naccess to broadcast signals by channel providers and such other\nforms of broadcast media as the Authority may, with the approval\nof the Government, by notification in the official Gazette, specify;\n(d)     “Cable TV” means reception of broadcast and prerecorded signals\nfrom different channels and their distribution to subscribers through\na set of closed transmission;\n(e)     “channel” means the set of frequencies that a broadcast station\noccupies for broadcasting;\n(f)     “Division concerned” means the Division to which the business of this Act shall\nstands allocated;\n(g)         “electronic media” includes the broadcast           media   and distribution\nservices;\n(h)         “Government” means the Federal Government;\n(i)         “media” means communication used regularly for broadcasting of information\nand expression of views and opinions through electronic media including\nstate sponsored and private television channels for the purpose of this Act;\n(j)         “member” means           a   member   of   the   Board   and    includes   the\nChairperson;\n(k)         “national broadcaster” means the Pakistan Broadcasting Corporation, the\nPakistan Television Corporation and the Shalimar Recording and Broadcasting\nCompany;\n(1)         “Pakistan sign language” is the preferred language of Pakistan’s deaf\npopulation holding the same status as minority spoken languages;\n(m)         “prescribed” means prescribed by the rules or regulations made under this Act;\n(n)         “regulations” means the regulations made under this Act; and\n(o)         “rules” means the rules made under this Act.\n(2) The words and expressions used herein and not defined but defined in the Pakistan\nElectronic Media Regulatory Authority Ordinance, 2002 (XIII of 2002) or in any other law for the\ntime being enforced shall have the same meanings as assigned to them in the respective laws and rules\nmade thereunder."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Responsibility of the Authority",
      "content": "(1) After six months of the commencement of this Act,\nthe Government shall not allow to broadcast any news bulletin on the national broadcaster, state or\nprivate run electronic media, private television channels, Cable TV or any other broadcast media\nwithout Pakistan sign language interpreters.\n(2) After one year of the commencement of this Act, the Government shall not allow to\nbroadcast any program, entertainment, advertisement, talk show, drama, film or any other pictorial\nsegment on the national broadcaster, media, private television channels, Cable TV or any other\nbroadcast media without Pakistan sign language interpreters."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Appointment of the Pakistan sign language interpreters",
      "content": "The Government and private\nowned media houses, within six months, shall appoint and Pakistan sign language interpreters for\ncarrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Establishment of National Policy Board",
      "content": "(1) The Government, after the commencement\nof this Act, within three months, shall constitute a Board to be known as the National Policy Board\nfor the purposes of the access of media through Pakistan sign language to deaf persons.\n(2)   The Board shall consist of —\nChairperson\n(a)     Minister-in-Charge;\nMember\n(b)    Secretary of the Division concerned;\ntwo members from the Senate, one each from              Members\n(c)    government and opposition;\ntwo members from the National Assembly,                 Members\n(d)    one each from government and opposition;\nChief Executive or head of National Institute           Members\n(e)    of Rehabilitation Medicine (NIRM);\none representative from Division concerned                 Member\n(f)    not below the rank of Joint Secretary;\nChairman of the Pakistan Electronic Media                  Member\n(g)    Regulatory Authority;\none representative from Ministry of Federal                Member\n(h)    Education and Professional Training not\nbelow the rank of Joint Secretary;\none representative of the Division concerned               Member\n(i)    not below the rank of Joint Secretary (BPS-\n20);\nrepresentative from the Deaf community in                  Member\n(j)    Pakistan, as nominated by the deaf;\nrepresentatives from organizations serving              Members\n(k)    the Deaf community. Number of hearing\nrepresentatives from these organization\nshould not exceed 10% of the number of deaf\nrepresentatives allocated in clause (j).\n(3) The member at clause (i) shall act as secretary of the Board as well.\n(4) The Board shall co-opt any person as member.\n(5) The secretariat of the Board shall be at main office of the Authority."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Procedure for transaction of business",
      "content": "(1) The Board shall meet regularly at such time\nas the Chairperson thinks fit, but at least once in every six months.\n(2) All decisions at a meeting shall be taken by majority:\nProvided that in the case of equality of votes, the Chairperson or in his absence the person\npresiding shall have and can exercise a second or casting vote.\n(3) If for any reason, the Chairperson is unable to attend a meeting of the Board, any member\nchosen by the members present from amongst themselves at the meeting shall preside.\n(4) Quorum of the meeting shall not be less than fifty percent of its total membership at the\ntime of such meeting.\n(5) In the event of a requisition signed and presented by one-fourth of the members, the\nChairperson shall call a meeting of the Board within seven days of such requisition, presented to the\nChairperson."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Officers and other employees of the Board",
      "content": "(1) The Authority after approval of the\nGovernment shall appoint officers and other employees of the Board on such terms and conditions as\nmay be prescribed.\n(2) The Secretary shall be responsible for proper administration of affairs of the Board and its\nday-to-day management and shall exercise and discharge such other-powers and perform such other\nfunctions as may be prescribed."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Function of the Board",
      "content": "The Board shall have the responsibility to achieve and\nimplement objectives of this Act and to assist the government on all matters for the access of media\nto deaf persons."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Procedure of the Board",
      "content": "(1) The Board shall regulate its own procedure.\n(2) All orders and decisions of the Board shall be authenticated by the Secretary or any other\nofficer of the Board duly authorized by the Chairperson in this behalf.\n(3) The quorum for a meeting of the Board shall not be less than one half of the total\nmembership of the Board.\n(4) The decision of the Board shall be taken by the majority of its members present and, in\ncase of a tie, the member presiding the meeting shall have a casting vote."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Annual reports of the Board",
      "content": "(1) The Board shall prepare an annual report on the access\nof media to deaf persons and shall lay the report before each House of Majlis-e-Shoora (Parliament).\n(2) The Board may at arty time submit special report, before each House of Majlis-e-Shoora,\non any matter which, in its opinion, is of such urgency or importance that it should not be deferred till\nsubmission of the annual report.\n(3) The Board shall assist the Government in preparation of its periodic report in accordance\nwith international declarations, conventions, treaties, covenants and agreements relating to the access\nof media to deaf persons."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Funds of the Board",
      "content": "(1) There shall be established by the Government a fund to be\nknown as the access of media to deaf persons fund, which shall vest in the Board and shall be used by\n(2) The sources of the Fund, amongst other moneys, may be the following, namely:—\n(a)     such fund as the Government shall allocate each year as a non-\nlapsable grant in annual budget of the fund;\n(b)     such voluntary donations, contributions or subscriptions as be made\nby Provincial Governments;\n(c)     donations, if any, made by private                individuals,    national   and\ninternational natural and juristic persons;\n(d)     income from investment by the Board as may be prescribed; and\n(e)     all other sums or properties or assets which may in any manner\nbecome payable to or vest in the Board in respect of any matter.\n(3) The Board shall, while performing its functions and exercising its powers under this Act,\nensure highest sense of prudence in respect of expenditures incurred from the Fund.\n(4) The Fund shall be expended for the purposes of access of media to deaf persons and for\nsuch other activities which fall within purview of the Board.\n(5) The Board may invest money from the Fund in accordance with instructions of the\nGovernment."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Accounts and audit of Board",
      "content": "(l) The Board shall maintain proper accounts and other\nrelevant records and prepare an annual statement of accounts in such form as may be prescribed by\nthe Government.\n(2) The Secretary of the Board shall be the Principal Accounting Officer of the Board and the\naccounts of the Board shall be audited by the Auditor General at such intervals as may be specified by\nhim.\n(3) The accounts of the Board, as certified by the Auditor General or any other person\nappointed in his behalf, together with the audit report thereon shall be forwarded annually to the\nGovernment by the Board and the Government shall cause the audit report to be laid, as soon as may\nbe after it is received, before each House of the Parliament."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Power of the Government to issue directives",
      "content": "The Government may, as and when it\nconsiders necessary, issue directives to the Board on matters of policy and such directives shall be\nbinding on the Board and if a question arises as to whether any matter is a matter of policy or not, the\ndecision of the Government thereon shall be final."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Returns or information",
      "content": "The Board shall furnish to the Government such returns\nor other information with respect to its activities as the Government may, from time to time, require."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Offences",
      "content": "(1) Any broadcast media, house, person, national broadcaster, media, state,\nprivate run media, private television channels, Cable TV or any other broadcast media violates or abets\nto violate any of the provision of this Act shall be guilty of an offence under this Act and shall be\npunished with fine which may extend to twenty thousand rupees per day but shall not be below three\nthousand rupees per day.\n(2) In case of continuous violation of more than six months, shall be punished with\nimprisonment of either description for a term which may extend to five years, or with fine which shall\nnot be below one hundred thousand rupees per month or both."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Power to make rules",
      "content": "Within two months of the commencement of this Act, the\nGovernment shall, in consultation with the Authority and by notification in the official Gazette, make\nrules to carryout purposes of this Act."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Power to make regulations",
      "content": "The Authority with the approval of the Board, may by\nnotification in the official Gazette, make regulations for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Power to remove difficulties and doubts",
      "content": "If any difficulty or doubt arises in giving\neffect to the provisions of this Act, the Government may, by order in writing published in the official\nGazette, make such provision as may appear to it to be necessary for removing the difficulty or doubt:\nProvided that no order shall be made under this section after expiry of a period of three years\nfrom commencement of this Act."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Act to override other laws",
      "content": "The provisions of this Act shall have overriding effect not\nwithstanding anything contained in any other law for the time being in force.\nRGN- Dated.22-10-2025"
    }
  ],
  "definitions": [
    {
      "term": "Authority",
      "definition": "the Pakistan Electronic Media Regulatory Authority established under section 3 of the Pakistan Electronic Media Regulatory Authority Ordinance, 2002 (XIII of 2002);",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the National Policy Board established under section 5;",
      "source_provision": "sec2"
    },
    {
      "term": "broadcast media",
      "definition": "such media which originate and propagate broadcast and prerecorded signals by terrestrial means or through satellite for television and includes teleporting, provision of access to broadcast signals by channel providers and such other forms of broadcast media as the Authority may, with the approval of the Government, by notification in the official Gazette, specify;",
      "source_provision": "sec2"
    },
    {
      "term": "Cable TV",
      "definition": "reception of broadcast and prerecorded signals from different channels and their distribution to subscribers through a set of closed transmission;",
      "source_provision": "sec2"
    },
    {
      "term": "channel",
      "definition": "the set of frequencies that a broadcast station occupies for broadcasting;",
      "source_provision": "sec2"
    },
    {
      "term": "Division concerned",
      "definition": "the Division to which the business of this Act shall stands allocated;",
      "source_provision": "sec2"
    },
    {
      "term": "electronic media",
      "definition": "the broadcast media and distribution services;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "media",
      "definition": "communication used regularly for broadcasting of information and expression of views and opinions through electronic media including state sponsored and private television channels for the purpose of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of the Board and includes the Chairperson;",
      "source_provision": "sec2"
    },
    {
      "term": "national broadcaster",
      "definition": "the Pakistan Broadcasting Corporation, the Pakistan Television Corporation and the Shalimar Recording and Broadcasting Company; (1) “Pakistan sign language” is the preferred language of Pakistan’s deaf population holding the same status as minority spoken languages;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by the rules or regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "the regulations made under this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "the rules made under this Act. (2) The words and expressions used herein and not defined but defined in the Pakistan Electronic Media Regulatory Authority Ordinance, 2002 (XIII of 2002) or in any other law for the time being enforced shall have the same meanings as assigned to them in the respective laws and rules made thereunder.",
      "source_provision": "sec2"
    }
  ]
}
