{
  "id": "pk-agricultural-pesticides-ordinance-1971",
  "type": "statute",
  "title": "Agricultural Pesticides Ordinance, 1971",
  "title_en": "Agricultural Pesticides Ordinance, 1971",
  "short_name": "APO",
  "status": "in_force",
  "issued_date": "1971-01-24",
  "in_force_date": "1971-01-24",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2Fq-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Agricultural Pesticides Ordinance, 1971 (II of 1971) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Definitions",
      "content": "IMPORT, MANUFACTURE, FORMULATION, SALE, DISTRIBUTION"
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Delegation of powers",
      "content": "1\nORDINANCE No. II of 1971\n[25th January, 1971]\nAn Ordinance to regulate the import, manufacture, formulation, sale, distribution and use of\npesticides.\nWHEREAS it is expedient to regulate the import, manufacture, formulation, sale, distribution\nand use of pesticides and for matters ancillary thereto;\nAND whereas the national interest of Pakistan in relation to the achievement of uniformity\nrequires Central legislation in the matter;\nNOW, THEREFORE, in pursuance of the Proclamation of the 25th day of March, 1969,\nread with the Provisional Constitution Order, and in exercise of all powers enabling him in that\nbehalf, the President is pleased to make and promulgate the following Ordinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title extent and commencement",
      "content": "(1) This Ordinance may be called the\nAgricultural Pesticides Ordinance, 1971.\n(2) It stands to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Application of other laws not barred. The provisions of tins Ordinance shall be in",
      "content": "addition to, and not in derogation of the provisions of the Pension Act, 1919 (XII of 1919), and any\nother law for the time being in force."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Application for registration of pesticide",
      "content": "(1) Any person intending to import,\nmanufacture, formulate, sell, offer for sale, hold in stock for sale or advertise any 6* * * pesticide\nmay apply to the 7[Federal Government] for the registration of the 8[pesticide] under such name as\nhe may indicate in the application.\n(2) An application under sub-section (1) shall be in such i form, be accompanied by such fee\nand contain such statements ! and information as may be prescribed.\n(3) Where the person making an application under subsection (1) is not domiciled in Pakistan, the\napplication shall, besides such person, be signed by his agent or representative in Pakistan.\n1\nSubs, by F.A.O., (P. O. No. 4 of 1975) Art. 2 and Table, for \"Central Government\".\n2\nThe words \"brand of omitted by the Agricultural Pesticides (Amdt.) Act, 1992 (J9 of 1992), s. 2.\n3\nThe word \"and\" omitted by the Agricultural Pesticides (Amdt) Act 1997. (39 of 1997) s. 2, \"\n4\nNew clause (rr) ins. ibid.,\n5\nSubs. by Act 19 of 1992, s. 3, for section 4.\n6\nThe words \"brand of a\" omitted by the Agricultural Pesticides (Amdt) Act, 1992 (19 ofl992), s. 4.\n7\nSubs. by F.A.O., 1975 (P.O. No. 4 of 1975), Art. 2 and Table, for \"Central Government\".\n8\nSubs, by Act 19 of 1992,\" s. 4 for \"brand\"\n(4) Upon the receipt of an application under sub-section (1), the 1[Federal Government] may\nregister 2* * * pesticide by the name indicated in the application, if it is satisfied that—\n(a)        the 3[\"name of the pesticide\"] is not such as would tend to deceive or\nmislead the purchaser with respect to the guarantee relating to the pesticide or\nits ingredients or the method of its preparation; or\n(b)        the guarantee relating to the pesticide or its ingredients is not the same as that\nof another registered 3 '[pesticide] 4[by the same manufacturer] or is not so\nsimilar thereto as to be likely to deceive; or\n(c)        it is effective for the purpose for which it is sold or represented to be\neffective; or\n(d)        it is not generally detrimental or injurious to vegetation, except weeds, or to\nhuman or animal health, even when applied according to directions.\n(5)    When it registers a 2* * * pesticide on the application of any person, the 1[Federal\nGovernment] shall grant to him a certificate of registration in such form as may be prescribed."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Period for which registration shall be effective. The registration of a 5* * *",
      "content": "pesticide shall be effective from the date of its registration until the thirtieth day of June of the\nthird year following the year of registration."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Cancellation of registration. If, at any time after the registration of 5* * * a pesticide, the",
      "content": "1\n[Federal Government] is of opinion that the registration has been secured in violation of any of the\nprovisions of this Ordinance or the rules or that the pesticide is ineffective against pests of\nhazardous to vegetation, other than weeds, or to human or animal life, the 1[Federal Government]\nmay, after giving to the person on whose application it had been registered an opportunity of being\nheard, cancelled the registration."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Renewal of registration",
      "content": "(1) The 1[Federal Government] may, on the application of the\nimporter, manufacturer, formulator, vendor or stock holder of a registered 6* * * pesticide in the\nguarantee or ingredients of which no change has taken place since the date of its registration, renew\nthe registration of the 4[pesticide] for a further period of three years.\n(2) An application under sub-section (1) shall be in such form and be accompanied by such fee as\nmay be prescribed and shall be made before the expiration of the period for which the registration of\n4\n[pesticide] is effective.\n1\nSubs. by F.A.O., 1975 (P.O. No. 4 of 1975), Art. 2 and Table, for \"Central Government\".\n2\nThe words \"brand of omitted by the Agricultural Pesticides (Amdt.) Act, 1992 (J9 of 1992), s. 2.\n3\nSubs, by Act 19 of 1992,\" s. 4 for \"brand\"\n4\nIns.by the Agricultural Pesticides (Amdt.) Ordinance, 1979 (12 of 1979), s. 2.\n5\nThe words \"band of a omitted by the Agricultural Pesticides (Amdt.) Act, 1992 (19 of 1992), s. 5.\n6\nThe words \"the band of omitted ibid., s. 6."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Importation may be prohibited",
      "content": "If any pesticide imported into Pakistan\nis found to be adulterated or incorrectly or misleadingly tagged, labelled or named, or if its sale in\nany way contravenes any of the provisions of this Ordinance, the 1[Federal Government] may, by\nnotification in the official Gazette, prohibit the further import of the pesticide into Pakistan."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Labelling of packages",
      "content": "_ 2[(1)] No person shall sell or offer or expose for sale, or\nadvertise or hold in stock for sale any pesticide unless each package containing the pesticide, and\nevery tage or label durably attached thereto is 3* * marked in printed characters in such form and in\nsuch manner as may be prescribed.\n4\n[(2) Any dealer wholeseller, retailer or an agent, who has been convicted of not less than\noffences under this Ordinance shall be black listed by the importer, manufacturer, distributor or\nformulator of the pesticide in question.]."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Shortage and use of pesticides. No person shall store or use of any pesticide",
      "content": "save in accordance with rules made under this Ordinance.\nTHE AGRICULTURE PESTICIDE TECHNICAL ADVISORY COMMITTEE, ETC."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. The Agriculture Pesticide Technical Advisory Committee",
      "content": "(1) As soon as\nmay be after the commencement of this Ordinance, the 1[Federal Government] shall constitute a\ncommittee, to be called the Agriculture Pesticides Technical Advisory Committee, to advise the\n1\n[Federal Government] on technical matters arising out of the administration of this Ordinance and\nto perform any other functions assigned to it by or under this Ordinance.\n(2)     The commitee shall consist of a Chairman and such number of Vice-Chairman and\nother members, being officers of the 1[Federal Government] or a Provincial Government or persons\nrepresenting trade and industry engaged in pesticide business, as the 1[Federal Government] may\nappoint:\nProvided that no officer of a Provincial Government and no person representing trade and\nindustry so engaged in a Province shall be appointed otherwise than on the recommendation of the\nGovernment of the Province concerned.\n(3)     The names of the Chairman, the Vice-Chairman and the other members of the\nCommittee shall be published in the official Gazette.\n(4)    The 1[Federal Government] shall appoint one of the members of the Committee,\nbeing an officer of that Government, to be the Secretary of the Committee for the period for which\nhe is such a member.\n(5)      The non-official members of the Committee shall hold office for a term of three years\nand shall be eligible for re- appointment\n____________________________________________________________________________________________\n1\nSubs. by F.A.O., 1975 (P.O. No. 4 of 1975), Art. 2 and Table, for \"Central Government\".\n2\nRe-numbered by the Agricultural Pesticides (Amdt.) Act 1997, (39 of 1997) s. 3.\n3\nThe words \"brnaded or\" omitted ibid..\n4\nNew sub-section (2) added by the Agricultural Pesticide (Amdt.) Act 1997 (39 of 1997) s. 3. .\n(6)    A member of the Committee may, at any time, resign his office by writing under his\nhand addressed to the Chairman; but the seat of such member shall not be deemed to have fallen\nvacant unless the registration has been accepted by the Chairman with the previous approval of the\n1\n[Federal Government.]\n(7)     A person appointed to fill a vacancy created by the registration or death of a member\nshall hold office for the residuce of the term of his predecessor.\n(8)    The Functions of the Committee may be exercised not-withstanding any vacancy in\nthe membership thereof.\n(9)    The Committee shall have the power to regulate with the prior approval of the\n1\n[Federal Government] the procedure for the conduct of its business.\n(10) The Committee may appoint sub-committees consisting of specialists for the\nconsideration of particular matters for such periods, not exceeding three years, as it may consider\nnecessary."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Pesticide Laboratory",
      "content": "(1) As soon as may be after the commencement of this\nOrdinance, the 1[Federal Government] shall set up a Pesticide laboratory 2[or, in consultation with\nthe Provincial Government, declare a Provincial laboratory as Pesticide Laboratory which may\nbe] suitably equipped to carry out the functions entrusted to it by or under this Ordinance.\n(2)      The Functions of the Pesticide Laboratory and the mode of submission of samples for\nanalysis or test to the Laboratory shall be such as may be prescribed.\n(3)   The secrecy of the formulae of 3* * pesticides, samples of which are submitted to the\nPesticide Laboratory for analysis or test, shall be duly safeguarded in the manner prescribed."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Government Analyst. The 1[Federal Government] may, by notification in the",
      "content": "official Gazette, appoint as many persons as it deems fit to be Government Analysts for pesticides\nand, where it appoints more than one persons to be Government Analysts, shall specify in the\nnotification the local limits within which each one of them shall perform the functions of\nGovernment Analyst."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Inspectors. The 1[Federal Government] may, by notification in the official Gazette,",
      "content": "appoint from amongst the officers of the 1'[Federal Government] or a Provincial Government\nemployed for work relating to plant protection such number as it deems fit to be Inspectors within\nsuch local limits as may be specified in the notification.\n1\nSubs, by F.A.O., 1975 (P.O. No. 4 of 1975), Art, 2 and Table, for \"Central \" Government\"\n2\nIns. by the Agriculture Pesticide (Amdt) Act 1992 (19 of 1992), s. 8.\n3\nThe words \"brands of' omitted ibid.,"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Powers of Inspectors. An Inspector may, within the local limits for which he is",
      "content": "appointed, enter upon any premises where pesticides are kept or stored, whether in containers or in\nbulk, by or on behalf of the owner, including premises belonging to a bailee, such as a railway, a\nshipping company or any other carrier, and may take samples therefrom for examination. No\ncompensation shall be payable for a reasonable quantity taken as a sample.—"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Procedure of Inspectors",
      "content": "(1) Where an Inspector takes a sample of a pesticide\nfor the purpose of test or analysis under section 16, he shall intimate such purpose in writing in the\nprescribed form to the person from whose possession he takes it and, in the presence of such person\n(unless he wilfully absents himself), shall divide the sample into three portions and effectively seal\nand suitably mark the same and permit such person to add his own seal and mark to all or any of the\nportions so sealed and marked ;\nProvided that, where the pesticide is made up in containers of small volume, instead of\ndividing a sample as aforesaid, the Inspector may, and if the pesticide be such that it is likely to\ndeteriorate or be otherwise damaged by exposure shall, take three of the said containers after\nsuitably marking the same and, where necessary, sealing them.\n(2) The Inspector shall restore one portion of a sample so divided or one container, as the\ncase may be, to the person from Whom he takes it, and shall retain the remainder and dispose of the\nsame as follows:—\n(i)     he shall forthwith send one portion or container to the Government Analyst\nfor test or analysis; and\n(ii)    he shall send the second portion or container to the 1[Federal Government]."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Report of Government Analyst",
      "content": "(1) The Government Analyst to whom a sample\nof any pesticide has been forwarded by an Inspector under sub-section (2) of section 17 deliver to\nthe Inspector, in triplicate in the prescribed form assigned report of the result of the test or analysis\nconducted by him.\n(2)    The Inspector shall deliver one copy of the report received by him to the person from\nwhose possession the sample was taken and shall send one copy to the 1[Federal Government].\n(3)    Any document purporting to be a report signed by the Government Analyst of an\nanalysis conducted by him under this Chapter shall be conclusive evidence of the particulars stated\ntherein unless the person to whom the report has been delivered under sub-section (2) disputes the\ncorrectness of the analysis conducted by the Government Analyst and, within thirty days of the\ndelivery of the report to him, places before the 1[Federal Government] evidence which in his\nopinion controverts the correctness of such analysis.\n(4)   Where the evidence placed before the 1[Federal Government] under sub-section (3)\nis such as would in its opinion justify a further investigation, it may cause a second part of the same\nsample to be analysed at the Pesticide Laboratory.\n1\nSubs, by F.A.O., 1975 (P.O. No. 4 of 1975), Art. 2 and Table, for \"Central Government”.\n(5)    After the sample forwarded to it by the 1[Federal Government] has been analysed by\nthe Pesticide Laboratory, the Laboratory shall record the result of the analysis in a certificate of\nanalysis and forward the certificate to the 1[Federal Government].\n(6)     A certificate of analysis prepared by the Pesticide Laboratory shall be conclusive\nevidence of the facts stated therein."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Publication of results of test and analysis. The 1[Federal Government] may",
      "content": "publish in such manner as it may deem fit the result of the test and analysis of a pesticide made\nby a Government Analyst or the Pesticide Laboratory under section 18 together with such other\ninformation relating thereto if any as it may consider necessary."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Purchaser of pesticide may have it tested or analysed",
      "content": "(1) Any person who\nhas purchased a pesticide may apply to a Government Analyst to conduct a test or analysis of the\npesticide.\n(2)    An application under sub-section (1) shall be made in such form and manner and be\naccompanied by such fee as may be prescribed.\n(3)    The Government Analyst to whom an application is made in accordance with sub-\nsection (2) shall conduct the test or analysis and issue to the applicant a report signed by him of the\ntest or analysis.\nMISCELLANEOUS.\n2\n[21. Offences and penalties.—(1) Any person who imports, manufactures, formu lates,\nsells, offers or exposes for sale, holds in stock for sale or advertises for sale an adulterated or sub-\nstandard pesticide shall be guilty of an offence.\n(2)        The person guilty of an offence under sub-section (1) shall be punished,—\n(a)        in the case of an adulterated pesticide, in relation to a first offence with\nimprisonment for a term which shall not be less than one year or more than\nthree years and with fine amounting to five hundred thousand rupees and for\nevery subsequent offence with imprisonment for a term which shall not be\nless than two years or more than three years and with fine which shall not be\nless than five hundred thousand rupees or more than one million rupees; and\n1\nSubs, by F.A.O., 1975 (P.O. No. 4 of 1975), Art. 2 and Table, for \"Central Government.\"\n2\nSubs, by the Agricultural Pesticides (Amdt.) Act 1997, (39 of 1997) s. 3. for section 21, which was previously amended by Act 19 of 1992, s. 9.\n(b)         in the case of a sub-standard pesticide, in relation to a first offence with\nimprisonment for a term which shall not be less than six months or more than\ntwo years and with fine which may extend to five hundred thousand\nrupees and for every subsequent offence with imprisonment which may\nextend to three years and with fine but shall not be less than the punishment\ngiven for the first offence.]\n1\n[21A. Punishment for offences not provided for in section 2. Any person who\ncontravenes any of the provisions of this Ordinance or the rules for the contravention of which\nno other punishment is provided in this Ordinance, shall be punishable with fine which may extend\nto one hundred thousand rupees].\n2\n[22. Manufacturer’s warranty to dealers. Whoever gives a false warranty to a dealer or\npurchaser in respect of adulterated or sub-standard pesticide shall, unless he proves that when he\ngave the warranty, he had good reason to believe the same to be true, be guilty of an offence\npunishable in the same manner and to the same extent as provided for under section 21.]"
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Unlawful use of registration number lowering of pesticidal value or hindering",
      "content": "the Inspector from performing his duty. Any person who—\n(a)         unlawfully uses any registration number assigned or as if it had been assigned\nunder this Ordinance, or\n(b)         wilfully alters the composition of a pesticide by mixing any other substance\ntherewith after the said pesticide has been placed on the market by the\nmanufacturer, importer or vendor, or\n(c)         wilfully obstructs, hinders, resists, or in any way opposes any Inspector in\nperforming his duties under this Ordinance,\n3\n[shall be punishable,—\n(i)        in the case of an offence under clause (a) or (b) with imprisonment\nfor a term which shall not be less than two years or more than three\nyears and with fine which may extend to one million rupees; and\n(ii)       in the case of an offence under clause (c) with imprisonment for a\nterm which may extend to six months and with fine which may extend\nto one hundred thousand rupees]:"
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Entry and seizure",
      "content": "(1) If an Inspector has reason to believe that an offence\npunishable under this Ordinance or the rules made thereunder has been, is being or is about to be\ncommitted at any time or place, he may enter and search, such place and seize any pesticide, article\nor thing to which the offence relates found therein.\n1\nNew section 21A ins. by the Agricultural Pesticides (Amdt.) Act 1997, (39 of 1997) s. 5.\n2\nSubs, ibid:, s. 6, for section 22, which was previously amended by Act 19 of 1992, s. 11\n3\nSubs, by the Agricultural Pesticides (Amdt.) Act 1997 (39 of 1997), s. 7,for \"certain words\".\n(2)     Any pesticide, article or thing seized under sub-section (1) shall be disposed of in\naccordance with the decision of the Court before which the offender is prosecuted for a\ncontravention of any of the provisions of this Ordinance or the rules.\n1\n[(3) An Inspector may apply to the District Magistrate, Additional District Magistrate, Sub-\nDivisional Magistrate of the District or Sub-Division or Tehsil or Taluka, as the case may be, for\npolice assistance and such Magistrate may direct that an executive Magistrate shall accompany the\nInspector alongwith a police party for the purpose of collecting sample for examination.]."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Power of Court to order forfeiture. If any person is convicted of an offence",
      "content": "punishable under this Ordinance committed by him in respect of any pesticide, article or thing,\nthe Court convicting him may further direct that the pesticide, article or thing shall be forfeited to\nthe 2[Federal Government.]"
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Cognizance of offences, etc",
      "content": "(1) No court inferior to that of a Magistrate of the first\nclass shall try an offence punishable under this Ordinance (Act V of 1898).\n(2)     Notwithstanding anything contained in section 32 of the Code of Criminal Procedure,\n1898(Act V of 1898)., it shall be lawful for any Magistrate of the first class to pass any sentence\nauthorised by this Ordinance even if such sentence exceeds his powers under the said section 32.\n3\n[26A. Cognizance and prosecution of offences. The offences punishable under this\nOrdinance shall be cognizable and non-bailable but a police officer shall not register or investigate a\ncase relating to an offence under this Ordinance except on a complaint by the Inspector and the\nPublic Prosecutor shall be responsible for conducting prosecution of offences under this Ordinance.]"
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Power to try offences summarily. Any Magistrate of the first class or any bench of",
      "content": "Magistrates invested with the powers of a Magistrate of the first class empowered for the time being\nto try in a summary way the offences specified in sub-section (1) of section 260 of the Code of\nCriminal procedure, 1898(Act V of 1898), may, on application, in this behalf being made by the\nprosecution, try in accordance with the provisions contained in sections 262 to 265 of that Code,\nany offence punishable under section 21."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Indemnity. No suit, prosecution or other legal proceeding shall lie against any person for",
      "content": "anything which is in good faith done or intended to be done under this Ordinance or the rules."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Power to make rules",
      "content": "(1) The 2[Federal Government] may, in consultation with the\nAgriculture Pesticide Technical Advisory Committee and after previous publication in the official\nGazette, make rules for carrying the provisions of this Ordinance into effect.\n(2)    In particular and without prejudice to the generality of the foregoing power, such\nrules may provide for all or any of the following matters, namely :—\n_________________________________________________________________________________\n1\nNew sub-section (3) added by the Agricultural Pesticides (Amdt.) Act, 1997 (39 of 1997) s. 8.\n2\nSubs. by F.A'.O., 1975 (P.O. No. 4 of 1975), Art. 2 and Table, for \"Central Government.\" ,\n3\nNew section 26A ins. by Act 39 of 1997. s. 9.\n(a)        the nomenclature of every form of plant and animal. life that shall be deemed\nto be insects, fungi or other plant or animal pests;\n(b)        the form in which an application for the registration of a 1* * * pesticide or\nfor the renewal of registration shall be made, the, information that shall be\nfurnished therewith and the fee that shall accompany it;\n(c)        the procedure for the grant of certificates of registration of 2[pesticides\nnot having a trade name or otherwise] and renewal of such registration and the\nform of such certificates;\n(d)        the language of the tags or label to be attached to the containers and packages\ncontaining pesticides and the character and location of the printing to be\nmarked on such tags, labels and containers;\n(e)        the functions of the Pesticides Laboratory and the procedures to be followed\nby it in the performance of such functions, including—\n(i)        safeguarding of the secrecy of the formulae of any 3* *\n*pesticides disclosed to it;\n(ii)       collection of samples of pesticides for test or analysis; and\n(iii)      the form in which its reports of tests or analysis shall be\nwritten;\n(f)        the methods of analysis to be followed, and the limits of variability to be\nallowed, by the Government Analyst as between the information marked on\nthe container or on a label attached thereto or supplied to the purchaser when\nsold in bulk, and the results of the analysis;\n(g)        the qualifications and duties of the Government Analysts;\n(h)        the form in which an intimation of the purpose for which a sample is taken by\nan Inspector shall be given by him to the person from whose possession the\nsample is taken, the instruments to be employed, and the quantities to be\ntaken, by an Inspector while taking samples for test or analysis and the\nmanner in which they should be preserved and sent to the Government\nAnalyst and the 4[Federal Government];\n(i)        the form in which an application shall be made by the purchaser of a pesticide\nto a Government Analyst for test or analysis of the pesticide, the manner in\nwhich a purchaser may send a pesticide for test or analysis to the Government\nAnalyst, the information that shall be furnished with such application and\nthe fee that shall accompany it;\n1\nThe words 'brand of a\" omitted by the Agricultural Pesticides (Amdt.) Act 1992, (19 of 1992) s. 12.\n2\nSubs, by the Agricultural Pesticides (Amdt.) Act. 1992 (19 of 1992), s: 12, for \"brands of pesticides\".\n3\nThe words \"brands of\" omitted ibid. 3See foot-note I. on page 930 supra.\n4\nSubs. by F.A'.O., 1975 (P.O. No. 4 of 1975), Art. 2 and Table, for \"Central Government.\"\n(j)        the pesticides that are generally detrimental or injurious to vegetation,\ndomestic animals or public health even when used according to directions;\n(k)        the pesticides that are to be labelled \"Poison\" and their antidotes;\n(l)        the requirements for the safe storage of pesticides ;\n(m)        the quantities of different 1 * * pesticides which a person may hold in stock\nat any one time and the premises in which, and the conditions subject to\nwhich, he may hold them in stock;\n(n)        the precautions for the protection of workers against risk of poisoning by\npesticides arising from their working—\n(i)         in connection with the use of such pesticides in agriculture; or\n(ii)        on land on which such pesticides are being or have been used in\nagriculture;\n(o)        the restrictions or conditions as to the purposes for which, the circumstances\nin which, or the methods or means by which, a pesticide may be used;\n(p)        the restrictions or conditions involving a general prevention or limitation of\nthe use of any pesticide in agriculture;\n(q)        the provision, and keeping available and in good order, of facilities for\nwashing and cleaning and of other things needed for protecting persons,\nclothing, equipment and appliances from contamination with pesticides or for\nremoving sources of contamination therefrom;\n(r)        the observance of precautions against poisoning by pesticides including the\nuse of things provided in pursuance of the rules, and abstentions from eating,\ndrinking and smoking in circumstances involving risk of poisoning by\npesticides;\n(s)        intervals between, or limitations of, periods of exposure to risk of poisoning\nby pesticides;\n(t)        the observance of special precautions in the case of persons who, by reason\nof their state of health, age, or other circumstances, are subject to particular\nrisk of poisoning by pesticides or of injury therefrom, or imposing, in case of\npersons so subject, prohibitions or restrictions on employment of workers ;\n(u)        the measures for detecting and investigating cases in which poisoning by\npesticides has occurred;\n1\nThe words \"brands of by the Agricultural Pesticides (Amdt) Act, 1992 (19 of 1992) s. 12.\n(v)        the provisions of effective facilities for prevention of poisoning by\npesticides and first aid treatment; and\n(w)        the provision of instruction and training in the use of things provided in\npursuance of the rules and in the observance of precautions against poisoning\nby pesticides."
    }
  ],
  "definitions": []
}
