{
  "id": "pk-agricultural-produce-grading-and-marketing-act-1937",
  "type": "statute",
  "title": "Agricultural Produce (Grading and Marketing) Act, 1937",
  "title_en": "Agricultural Produce (Grading and Marketing) Act, 1937",
  "short_name": "APAMA",
  "status": "in_force",
  "issued_date": "1937-02-23",
  "in_force_date": "1937-02-23",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-b56d-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Agricultural Produce (Grading and Marketing) Act, 1937 (I of 1937) published by The Pakistan Code (Land/Property Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent.",
      "content": "_ (1) This Act may be called the Agricultural Produce (Grading and\nMarking) Act, 1937.\n3\n[(2) It extends to the whole of Pakistan.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Explanations",
      "content": "_In this Act, unless the contrary appears from the subject or context,___\n(a)         “agricultural produce” includes all produce of agriculture or horticulture and all\narticles of food or drink wholly or partly manufactured from any such produce,\nand fleeces and the skins of animals ;\n4\n[(aa)    “appropriate Government” means, in relation to the grading and marking of\nagricultural produce intended for consumption within a Province, the Provincial\nGovernment, and in relation to the grading and marking of agricultural produce\nintended for export or for trade between the Provinces, the Federal Government;\n]\n(b)         “counterfeit” has the meaning assigned to that word by section 28 of the\nPakistan Panel Code (XLV of 1860);\n(c)         “covering” includes any vessel, box, crate, wrapper, tray or other container ;\n(d)         “grade designation” means a designation prescribed as indicative of the quality\nof any scheduled article ;\n(e)         “grade designation mark” means a mark prescribed as representing a particular\ngrade designation ;\n(f)         “quality”, in relation to any article, includes the state and condition of the article;\n(g)         “prescribed” means prescribed by rules made under this Act;\n(h)         “scheduled article” means an article included in the Schedule; and\n(i)         an article is said to be marked with a grade designation mark, if the article itself\nis marked with a grade designation mark or any covering containing or label\nattached to such article is so marked.\n1\nThe Act has been extended to the Leased Areas of Balochistan, see the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950) ; and applied in the\nFederal Areas of Balochistan, see Gazette of India, 1937. Pt. I., p. 1499.\nIt has also been extended to the State of Bahawalpur by the Bahawalpur (Extension of Federal Laws) Order, 1953 (G. G. O. 11 of 1953), as amended.\n2\nIns. by Act No. XIII of 1942, s. 2.\n3\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (Ordinance No. XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955).\n4\nIns. by Act No. XX of 1972, s. 3."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Prescription of grade designations",
      "content": "_The 1[appropriate Government] may, after previous\npublication by notification in the 2[official Gazette], make rules___\n(a)        fixing grade designations to indicate the quality of any scheduled article ;\n(b)        defining the quality indicated by every grade designation ;\n(c)        specifying grade designation marks to represent particular grade designations ;\n(d)        authorising a person or a body of persons, subject to any prescribed conditions,\nto mark with a grade designation mark any article in respect of which such mark\nhas been prescribed or any covering containing or label attached to any such\narticle ;\n(e)        specifying the conditions referred to in clause (d) including in respect of any\narticle conditions as to the manner of marking, the manner in which the article\nshall be packed, the type of covering to be used, and the quantity by weight,\nnumber or otherwise to be included in each covering;\n(f)        providing for the payment of any expenses incurred in connection with the\nmanufacture or use of any implement necessary for the reproduction of a grade\ndesignation mark or with the manufacture or use of any covering or label marked\nwith a grade designation mark 3[or with measures for the control of the quality\nof articles marked with grade designation marks including testing of samples\nand inspection of such articles or with any publicity work carried out to promote\nthe sale of any class of such articles] ; and\n(g)        providing for the confiscation and disposal of produce marked otherwise than\nin accordance with the prescribed conditions with a grade designation mark."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Penalty for unauthorised or incorrect marking with grade designation mark",
      "content": "_\n1\n[Whoever marks any schedule article with a grade designation mark, not being authorised to do so by\nrule made under section 3, or being so authorised marks any scheduled article with a grade designation\nmark which does not indicate the grade designation of the article correctly, shall be punishable with\nrigorous imprisonment for a term which may extend to three years, or with fine, or with both.]"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Penalty for counterfeiting grade designation mark",
      "content": "_Whoever counterfeits any grade\ndesignation mark or has in his possession any die, plate or other instrument for the purpose of\ncounterfeiting a grade designation mark shall be punishable with imprisonment which may extend to\ntwo years, or with fine, or with both."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Extension of application of Act",
      "content": "_The 1[appropriate Government], after such consultation\nas 2[it] thinks fit of the interests likely to be affected, may by notification in the 2[official Gazette]\ndeclare4 that the provisions of this Act shall apply to an article of agriculture produce not included in\nthe Schedule 4[or to an article other than an article of agricultural produce], and on the publication of\nsuch notification such article shall be deemed to be included in the Schedule.\n1\nSubs. by Act No. XX of 1972, ss. 2 and 3.\n2\nSubs. by A. O., 1937.\n3\nIns. by Act No. XX of 1943, s. 2.\n4\nIns. by Act No. XIII of 1942, s. 3 (with effect from the 24th February 1937).\n(See section 2)"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Rice]",
      "content": "2\n[14.Lac].\n3\n[15.Wheat].\n4\n[16.Sann Hemp].\n5\n[17.Sugarcane gur (jaggery)].\n6\n[18.Myrobalans.]\n7\n[19. Bura.]\n8\n[20. Wool.]\n1\nAdded by Govt. of I., Deptt. Of Edn. Health and Lands Notifin. No. F. 357-3/39-A, dated the 23rd March, 1939.\n2\nAdded by Govt. of I., Deptt. Of Edn., Health and Lands Notifin. No. F. 57-18/59-A, dated the 10th October, 1939.\n3\nAdded by Govt. of I., Deptt. Of Edn. Health and Lands Notifin. F. 3-9(1) 41-A, dated the 17th March, 1941.\n4\nAdded by Govt. of I., Deptt. Of Edn., Health and Lands Notifin.No. F.3-9(3)/41-A, dated 21st April, 1941.\n5\nAdded by Govt. of I., Deptt. Of Edn., Health and Lands Notifin.No. F.3-26(5)/41-A, dated 16th February, 1942.\n6\nAdded by Govt. of I., Deptt. Of Edn., Health and Lands Notifin.No. F.3-26(5)/41-A, dated 16th February, 1962.\n7\nAdded by Govt. of I., Deptt. Of Edn., Health and Lands Notifin.No. F.3-26/41-A, dated 5th June, 1942.\n8\nAdded by Notification. No. F.11-3/53-CS, dated 12th Nov., 1953. see Gaz. Of P, 1953, Pt.I, p.252.\n1\n[* * *]\n2\n[24.Animal Hair.]\n1\n[* * *]\n3\n[26.Oilcakes.]"
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Casings",
      "content": "4\n[30.Fish and fish products.]\n5\n[31. All spices and condiments.]\n_________\n51323                                                                                                                 Date: 20-01-2025\n1\nThe entries “21. Chillies (Powdered form), 22. Turmeric (Powdered form) and 23. Cooriander-seed (Powdered form)” added by Notification No.4-2/58\nC&M dated 9th January, 1959 and “25. Corriander Seed (Whole)” added by Notification. S.R.O. 1275 (K)/62, dated 29th Novermber, 1962 superseded\nby entry 31, see S.R.O. 104(I)/69, dated 25th June, 1969, Gaz. Of P., 1969, Ext. P. 395.\n2\nAdded by Notification No.4-17/50-MPP, dated 10th June, 1959. see Gaz. Of P., 1959, Pt.I, p.275.\n3\nAdded by Notification No. S.R.O. 490(K)/66, dated 24th May, 1966, see Gaz. of P., 1959, Pt.I, p.255.\n4\nAdded by Notification No. S.R.O 84(K)/68, dated 13th Jan., 1968, see, Gaz., of P.,1968, Pt.I.,p.55.\n5\nAdded by Notification No.S.R.O. 104(I)/69, dated 25th June, 1969, see, Gaz., of P., 1969, Ext., p.395."
    }
  ],
  "definitions": []
}
