{
  "id": "pk-agricultural-produce-cess-act-1940",
  "type": "statute",
  "title": "Agricultural Produce Cess Act, 1940",
  "title_en": "Agricultural Produce Cess Act, 1940",
  "short_name": "APCA",
  "status": "in_force",
  "issued_date": "1940-04-14",
  "in_force_date": "1940-04-14",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJac-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Agricultural Produce Cess Act, 1940 (XXVII of 1940) published by The Pakistan Code (Land/Property Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent",
      "content": "(1) This Act may be called the Agricultural Produce Cess Act,\n1940.\n2\n[(2) It extends to the whole of Pakistan.]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Imposition of cess",
      "content": "(1) A customs duty at the rate of one-half of one per cent. ad\nvalorem shall be levied on all articles included in the Schedule which are exported from 2[Pakistan]:\nProvided that the said duty shall not be levied on articles proved to the satisfaction of the\nCollector not to have been produced in 4[Pakistan]:\n4\n[Provided further that the 5[Federal Government] may, by notification in the Official\nGazette, vary the rate at which customs duty shall be levied.]\n(2) The 5[Federal Government] may, by notification in the official Gazette, fix for the\npurposes of levying the said duty tariff values of any articles included in the Schedule, and may alter\nany tariff values for the time being in force.\n1\nSubs. by the Acts relating to Cesses on Agricultural Products (Amdt) Ordinance, 1982 (X of 1982), s. 2 and Sch.\n2\nSubs. by the Central Laws (Statue Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955).\n3\nOmitted by the Acts relating to the Cesses on Agricultural Products (Amendment) Ordinance, 1982 (X of 1982), s. 2 and Sch.\n4\nSubs. and added by Act No. XII of 1950, s.5.\n5\nSubs. by F. A. O., 1975 (P.O. No. 4), Art. 2 and Table."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to exclude articles from Schedule",
      "content": "The 1[Federal Government] may, 2* * *, by\nnotification in the official Gazette, direct that any article specified in the Schedule shall cease to be\nsubject to the duty imposed by section 3, and thereupon, so long as the notification remains in force,\nthat article shall be deemed not to be included in the Schedule."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Refund of, and exemption from, cess",
      "content": "The 1[Federal] Board of Revenue may make\nrules providing, on such conditions as may be specified in the rules, for—\n(a)        the refund of duty levied where articles are exported by land and subsequently\nimported into 2[Pakistan], and\n(b)        the export by land, without payment of the duty of articles, which are\nsubsequently to be imported into 2[Pakistan].\n3"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. [Omitted]",
      "content": "4\n[10. Power to make rules.__ (1) The 1[Federal Government] may, after previous publication,\nmake rules for the purpose of carrying into effect the provisions of this Act.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules\nmay provide for all or any of the following matters, namely :__\n5\n*             *                  *                *                 *                *                  *"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Rules and regulations to be published",
      "content": "All rules made under section 10 3* * * shall\nbe published in the official Gazette.]\n1\nSubs by F. A. O., 1975 (P.O. No. 4 of 1975), Art. 2 and Table.\n2\nOmitted by Act No. XII of 1950, s. 6.\n3\nOmitted by the Acts relating to Cesses on Agricultural Products (Amendment) Ordinance, 1982 (X of 1982), s. 2 and Sch.\n4\nOmitted and added by Act No. XII of 1950, ss. 11-12.\n5\nCls. (a) to (s) omitted by the Acts relating to Cesses on Agricultural Products (Amendment) Ordinance, 1982 (X of 1982), s. 2 and Sch.\n(See section 3)"
    }
  ],
  "definitions": []
}
