{
  "id": "pk-airports-security-force-act-1975",
  "type": "statute",
  "title": "Airports Security Force Act, 1975",
  "title_en": "Airports Security Force Act, 1975",
  "short_name": "ASFA",
  "status": "in_force",
  "issued_date": "1975-12-12",
  "in_force_date": "1975-12-12",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2Fr-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Airports Security Force Act, 1975 (LXXVII of 1975) published by The Pakistan Code (Police Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, application and commencement. (1) This Act may be",
      "content": "called the Airports Security Force Act, 1975.\n(2) It extends to all aerodromes and airports, all civil aviation stations, centres or offices\nin Pakistan, all Pakistan air services and activities relating to civil aviation.\n(3) It shall apply to all members and officers of the Force wherever they may be.\n(4) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.―In this Act, unless there is anything repugnant in the subject or",
      "content": "context,\n(a)         “aerodrome” means any area of land or water designed, equipped, set apart or\ncommonly used or intended to be used, either wholly or in part, for affording\nfacilities for the landing, departure and movement of aircraft and includes all\nbuildings, sheds, vessels, piers, installations and equipments, and other\nstructures thereon or appertaining thereto, but does not include any\naerodrome which is exclusively used by the Pakistan Air Force or any portion\nof an aerodrome which is used by the Pakistan Air Force ;\n(b)         “aircraft” means any machine which can derive support in the atmosphere\nfrom the reactions of the air, other than the reactions of the air against the earth's\nsurface, and includes balloons, whether captive or free, airships, kites, gliders\nand flying machines ;\n1\nFor Statement of Objects and Reasons, see Gaz. of P., 1975, Ext., Pt.III, p.1027.\n(c)       “airport” means an aerodrome at which facilities have, in the opinion of the\nFederal Government, been sufficiently developed to be of importance to civil\naviation;\n(d)      “air service” means a service of aircraft for any purpose of civil aviation,\nwhether aerial work, public transport or otherwise ;\n(e)        “air side” means the movement area of an aerodrome, adjacent terrain and buildings\nor portions thereof, access to which is controlled by the 1[force];\n(f)            “competent authority” means any officer or authority designated as such by\nthe Federal Government ;\n1\n*            *          *                     *                      *                     *       *\n(h)           “Force” means the Airports Security Force constituted under section 3 ;\n2\n(i)              [Director General] means the Commander incharge of the Force;\n1\n*                  *        *              *            *              *                             *\n(k)           “member” means a person, other than an officer, who is appointed to the\nForce and has signed an affirmation in the form set out in the First Schedule ;\n(1)           “officer” means a person who is so appointed to the Force and has signed an\naffirmation in the form set out in the First Schedule ;\n(m)          “operator” means a person, organisation or enterprise engaged in or offering to\nengage in aircraft operation ;\n(n)           “prescribed” means prescribed by rules or regulations ;\n(o)         “purposes of civil aviation” include all purposes connected with civil aviation and\nwith air navigation, except purposes of defence by air ;\n(p)           “regulations” means regulations made under this Act ; and\n(q)           “rules” means rules made under this Act.\n1\nSubs. and omitted by the Air Ports Security Force (Amdt.) Ordinance, 1984 (35 of 1984), s.3\n2\nSubs by Act No.XXV of 2012, s 2\n3"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Power to constitute and maintain the Airports Security Force and its",
      "content": "functions. (1) The Federal Government may constitute and maintain a force to be called\nthe Airport Security Force for performing the following functions, namely :\n(a)        ensuring security of all airports, aerodromes, aircraft and civil Aviation\ninstallations 1[within the limits of airports and aerodromes] and for\nsafeguarding civil aviation against acts of unlawful interference or threats of\nsuch interference ;\n(b)       ensuring security of all structures, equipments, material and installations\nbelonging to operators and other Government or non-Government\norganisations within the limits of airports and aerodromes ;\n1\n*            *            *                      *                     *                     *                     *\n1\n*              *       *              *               *              *                *\n1\n(e)      ensuring the proper conduct of persons at airports and aerodromes * * *\nincluding control of surface vehicles and drivers within the limits of airports and\naerodromes ;\n(f)      ensuring security of aircraft passengers, baggage, cargo and mail within the\nlimits of airports and aerodromes ;\n(g)      general maintenance of law and order within the limits of airports and aerodromes\nin conjunction with the police and taking cognizance of all offences committed at\nthe airports and aerodromes under any law for the time being in force ; and\n(h)     such other functions as the Federal Government may, by notification in the official\nGazette, require the Force to perform.\n(2) In the discharge of their functions, the officers and members shall be guided by,\nand act in accordance with, this Act, 2* * * and the rules and regulations."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Constitution of the Airports Security Force",
      "content": "(1) The head of the Force shall be\na 3[Director General] appointed by the Federal Government.\n(2) The Force shall consist of such ranks and number of officers and members and shall\nbe constituted in such manner as may be prescribed by rules.\n(3) The officers and members shall receive such pay, pension, allowances and other\nremuneration and shall enjoy such leave and other privileges as may be prescribed by rules\nfrom time to time.\n1\nIns. and omitted by the Air Ports Security Force (Amdt.) Ordinance, 1984 (35 of 1984),s.4.\n2\nCertain words which were previously subs. by Ord. 27 of 1981, s.3 and Sch.II have been omitted by the Airports Security Force\n(Amdt.) Ordinance, 1984 (35 of 1984),s.4\n3\nSubs by Act No XXV of 2012, S.2.\n3\n(4) Every officer and member shall receive on his appointment a certificate in the\nform set out in the Second Schedule under the seal of the 1[Director General] or such other\nofficer as the 1[Director General] may authorise in this behalf and by virtue of holding\nsuch certificate he shall be vested with the powers, functions and privileges of an officer or\nmember.\n(5) Any person who ceases, for any reason, to be an officer or member shall\nforthwith surrender the certificate referred to in subsection (4) to any officer authorised by\nthe 1[Director General] in this behalf.\n(6) Officers and members of the Force shall wear such uniforms as may be\nprescribed by regulations."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Administration of the Force. (1) The administration of the Force shall vest in",
      "content": "the 1[Director General] who shall administer it in accordance with the provisions of this Act,\nrules and such orders and instructions as may be made or issued by the Federal Government\nfrom time to time.\n(2) The 1[Director General] shall exercise his powers and perform his functions under\nthe general supervision 2[and direction of the Federal Government]."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Powers and duties of officers and members",
      "content": "(1) An officer or member shall\n(a)            take effective measures for ensuring security of all airports, aerodromes,\naircraft and civil aviation installations 3[within the limits of airports and\naerodromes] and for safeguarding civil aviation against acts of unlawful\ninterference;\n(b)             safeguard aircraft passengers, baggage, cargo and mail within the limits of\naerodromes and airports ;\n(c)            prevent unauthorised persons and vehicles from access to the air-side or other\nareas important to the security of the aerodromes of airports ;\n(d)             require the operations of aircraft registered in Pakistan to conform to the\nprescribed civil aviation security requirements ;\n3\n[(e)        take effective measures for preventing hijacking, sabotage, placement of car\nbombs, letter bombs and dangerous articles and carriage of arms and\nammunitions into the restricted areas of the airports, aerodromes and aircraft\nexcept as authorised by him, and shall, as soon as he detects any contraband\non the person or in the baggage of any person checked by him, notify it to the\ncustoms staff available at the airport or aerodrome for appropriate action\nunder the Customs Act, 1969 (IV of 1969);]\n1\nSubs by Act No XXV of 2012, S.2.\n2\nSubs by the Airports Security Force (Amdt.) Ordinance, 1984,s.5.\n3\nIns .and subs ibit., s.6.\n4\n(f)        use such arms and ammunition and equipment as may be authorised by the\n1\n[Director General] 2[or an officer authorised by him] for the purposes of this\nAct ;\n(g)         search and arrest without warrant any person who he suspects of endangering,\nor attempting to endanger, or having endangered, the safety of an aerodrome\nor airport or an aircraft or a civil aviation installation and may use such force\nas may be necessary in the discharge of his duties aforesaid ; and\n(h)      perform such other functions as the competent authority may require him to\nperform.\n3\n[1A) The 1[Director General] may, with the previous approval of the Federal\nGovernment, call for military assistance in connection with post-landing and anti-hijacking\noperations at an airport or aerodrome; and, when he does so, all officers and members and\nall civil agencies operating at the airport or aerodrome shall function in accordance with the\ndirections of the military authority rendering such assistance.]\n(2) An officer, for the purpose of this Act, shall exercise, within the areas in which this\nAct applies, all the powers conferred on an officer-in-charge of a police station under the 1[\nPolice Order, 2002 (Chief Executive’s Order No. 22 of 2002)], and the Code of Criminal\nProcedure, 1898 Act (V of 1898)."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Liabilities of officers and members. (1) It shall be the duty of every officer and",
      "content": "member promptly to obey and execute all orders and instructions issued to him by any\ncompetent authority.\n(2) Every officer and member shall be liable to serve wherever he is required to serve by\nthe competent authority.\n4\n*       *                   *                     *                     *             *   *\n1\nSubs by Act No XXV of 2012, S.2.\n2\nIns. Ibid\n3\nIns. by the Airports Security Force (amdt.) Ordinance 1984 (35 of 1984 ), s.6.\n4\nOmitted ibid. , s.7.\n5\n1\n[CHAPTER IV]"
    },
    {
      "provision_ref": "sec7a",
      "section": "7A",
      "title": "Section 7A. Officers and members to be subject to the Pakistan Army Act, 1952",
      "content": "(1)\nEvery officer and member of the Force shall, unless he is already so subject, be subject to\nAct.\n(2) The 2[Director General] shall, in respect of all officers and members of the Force,\nhave all the powers conferred by or under the Act on an officer empowered to convene a\ngeneral court martial.\n(3) Subject to sub-section (2), the Federal Government may, by general or special\norder, direct by what authority any jurisdiction, powers or duties incidental to the operation\nof the provisions of the Act shall be exercised or performed in respect of the Force.\n3\n[(4) Notwithstanding anything contained in any other law for the time being in\nforce, except the authorities specified in sub-sections (1) and (2) of section 7F, no other\nauthority, tribunal or court shall have jurisdiction to vary, modify; alter, annual, set aside,\nrevise or review any order passed by any officer of the Force, authorised under the Pakistan\nArmy Act, 1952 (XXXIX of 1952)."
    },
    {
      "provision_ref": "sec7b",
      "section": "7B",
      "title": "Section 7B. Consequence of sentence of imprisonment. An officer or member of the Force",
      "content": "who is sentenced to imprisonment for a term which is not less than ninety days shall be deemed\nto have been dismissed from the Force."
    },
    {
      "provision_ref": "sec7c",
      "section": "7C",
      "title": "Section 7C. Suspension. Any officer shall be competent to suspend in the prescribed manner",
      "content": "a member of the Force working under him for any mis-conduct, remissness or negligence in\nthe discharge of his duties."
    },
    {
      "provision_ref": "sec7d",
      "section": "7D",
      "title": "Section 7D. Place of imprisonment. If a member of the Force sentenced under the Act to",
      "content": "imprisonment for a term shorter than ninety days is also dismissed from service, he shall be\nimprisoned in the nearest prison or such other prison as the Federal Government may, by\ngeneral or special order, direct; but if he is not so dismissed, he may be confined in a quarter\nguard or such other place as the 2[Director General] may consider suitable."
    },
    {
      "provision_ref": "sec7e",
      "section": "7E",
      "title": "Section 7E. Capture of deserters",
      "content": "(1) Whenever any person subject to the Act deserts, the\nChief Security Officer shall give written information of the desertion to such civil authorities\nas in his opinion may be able to afford assistance towards the capture of the deserter and\nsuch authorities shall thereupon take steps for the apprehension of the said deserter in like\nmanner as if he were a person for whose apprehension a warrant had been issued by a\nMagistrate, and shall deliver the deserter, when apprehended, into the custody of the Force.\n1\nIns. ibid., s. 8.\n2\nSubs by Act No XXV of 2012, S.2.\n3\nNew sub-section (4) added by the Airports Security Force (Amdt.) Act 1994, (16 of 1994),s.2.\n6\n(2) Any police officer may arrest without warrant any person whom he reasonably\nbelieves to be subject to the Act and a deserter or absentee without leave and bring him without\ndelay before the nearest Magistrate to be dealt with according to law."
    },
    {
      "provision_ref": "sec7f",
      "section": "7F",
      "title": "Section 7F. Appeal and revision",
      "content": "(1) In all cases decided by the 1 [Director], a Chief Security\nOfficer or any other officer, a person aggrieved may, within thirty days of the order, appeal to\nthe officer higher than the one awarding the punishment.\n(2) A person aggrieved by an order of the 1[Director General] awarding any punishment\nmay, within thirty days of the order, apply to the Federal Government for revision."
    },
    {
      "provision_ref": "sec7g",
      "section": "7G",
      "title": "Section 7G. Appointment of officers and other members of the Force",
      "content": "1[(1) The Federal\nGovernment may, by notification in the official Gazette, appoint a Deputy Director-General\n(Coordination) and such number of Directors, Deputy Directors, Assistant Directors and\nDeputy Assistant Directors as it may think fit.]\n(2) The 1 [Director General] may appoint, within the cadre strength sanctioned by the\nFederal Government, such number of Inspectors, Sub-Inspectors, Assistant Sub-Inspectors,\n1\n[Sergeants] and 1[Corporals] as he may consider necessary for the efficient performance of\nthe functions of the Force.\n(3) The rank structure of the officers and other members of the Force vis-a-vis the\nPakistan Army shall be such as may be prescribed by rule.]\n1\nSubs by Act No XXV of 2012, SS.2.4.5.\n7\n1\n[CHAPER V]"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Indemnity. No suit, prosecution or other legal proceeding shall lie against any",
      "content": "person for anything which is in good faith done, or intended to be done, under this Act or the\nrules or regulations."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Delegation of powers by the Federal Government. The Federal Government",
      "content": "may, by notification in the official Gazette, delegate all or any of its powers under this Act,\nexcept those under section 11, to the 2[3[Director General] or such officer as it may deem fit.]"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Delegation of powers by the Director",
      "content": "General. The 3[Director General] may, by\nnotification in the official Gazette and with the prior approval in writing of the Federal\nGovernment, delegate all or any of his powers under the rules for the efficient functioning of\nthe Force to any officer or authority subordinate to him."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Power to make rules. The Federal Government may, by notification in the official",
      "content": "Gazette, make 4rules\n(a)           regulating the functions and powers of the officers;\n(b)           regulating the classes and grades of, and the remuneration and rewards to be\npaid to, the officers and members of the Force and their conditions of service;\n5\n*        *          *                     *                     *                      *                     *\n5\n*       *       *              *               *               *               *\n(e)           generally for the purpose of carrying into effect the provisions of this Act."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to make regulations. The 3[Director General] may, by notification in the",
      "content": "official Gazette and with the prior approval in writing of the Federal Government, make\nregulations consistent with this Act and the rules for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. [Repeal] Omitted by the Federal Laws (Revision and Declaration) Ordinance,",
      "content": "1981 (XXVII of 1981), s.3 and Sch.,II.\n1\nIns. by the Airport Security Force (Amdt.) Ordinance 1984 (35 of 1984) S.9.\n2\nSubs. ibid., s. 2.\n3\nSubs by Act No XXV of 2012, S.5.\n4\nFor the Air Ports Security Force (Discipline) Rules, 1977, see S.R.O. No. 1027(l)/77, dated the 28th October. 1977 vide\nGaz. of P., 1977\nExt.. (Islamabad), Pt. II. pp. 1783—1787.\n5\nOmitted by the Air Ports Security Force (Amdt.) Ordinance, 1984 (35 of 1984), s.11\n8\n[See section 2 (k) and (1)]\nI,………………………………………………solemnly affirm in the presence of\nAlmighty Allah that I will bear true faith and allegiance to Pakistan and that I will, as in duty\nbound, honestly and faithfully serve in the Airports Security Force and go wherever I may\nbe ordered by air, land or sea, and that I will observe and obey all commands of any officer set\nover me even to the peril of my life.\nSigned in acknowledgement of the above having been read out to me.\nPerson Enrolled\nDate…………\nSigned in my presence after I had ascertained that the person understood the purpose\nof what he signed.\n1\n[Director General]\nor\nother Enrolling Officer.\nMain………………………………………………Khuda-e-Taala ko Hazir-o-Nazir\nJanker iman se iqrar karta hun key main Pakistan ka sache dil se wafadar rahunga aur Airports\nSecurity Force men imandari aur wafadari se khidmat ka farz baja launga, aur hawa,\nkhushki ya tari ke raste jahan bhi jane ka hukam melega jaonga aur jise mera afsar muqarar kia\njaega uskey har hukam ki tamil aur pairwi karunga, khah usmen jan ka khatra ho.\n[See section 4(4)]\nMr……………………………has been appointed as officer/member of the Airports Security\nForce under the Airports Security Force Act, 1975 (………..of 1975), and is vested with the\npowers, functions and privileges of an officer/member of the Force.\n1\nSubs by Act No XXV of 2012, S.2.\n9"
    }
  ],
  "definitions": [
    {
      "term": "aerodrome",
      "definition": "any area of land or water designed, equipped, set apart or commonly used or intended to be used, either wholly or in part, for affording facilities for the landing, departure and movement of aircraft and includes all buildings, sheds, vessels, piers, installations and equipments, and other structures thereon or appertaining thereto, but does not include any aerodrome which is exclusively used by the Pakistan Air Force or any portion of an aerodrome which is used by the Pakistan Air Force ;",
      "source_provision": "sec2"
    },
    {
      "term": "aircraft",
      "definition": "any machine which can derive support in the atmosphere from the reactions of the air, other than the reactions of the air against the earth's surface, and includes balloons, whether captive or free, airships, kites, gliders and flying machines ; 1 For Statement of Objects and Reasons, see Gaz. of P., 1975, Ext., Pt.III, p.1027.",
      "source_provision": "sec2"
    },
    {
      "term": "airport",
      "definition": "an aerodrome at which facilities have, in the opinion of the Federal Government, been sufficiently developed to be of importance to civil aviation;",
      "source_provision": "sec2"
    },
    {
      "term": "air service",
      "definition": "a service of aircraft for any purpose of civil aviation, whether aerial work, public transport or otherwise ;",
      "source_provision": "sec2"
    },
    {
      "term": "air side",
      "definition": "the movement area of an aerodrome, adjacent terrain and buildings or portions thereof, access to which is controlled by the 1[force];",
      "source_provision": "sec2"
    },
    {
      "term": "competent authority",
      "definition": "any officer or authority designated as such by the Federal Government ; 1 * * * * * * *",
      "source_provision": "sec2"
    },
    {
      "term": "Force",
      "definition": "the Airports Security Force constituted under section 3 ; 2 (i) [Director General] means the Commander incharge of the Force; 1 * * * * * * *",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a person, other than an officer, who is appointed to the Force and has signed an affirmation in the form set out in the First Schedule ; (1) “officer” means a person who is so appointed to the Force and has signed an affirmation in the form set out in the First Schedule ;",
      "source_provision": "sec2"
    },
    {
      "term": "operator",
      "definition": "a person, organisation or enterprise engaged in or offering to engage in aircraft operation ;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules or regulations ;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Act ; and",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act. 1 Subs. and omitted by the Air Ports Security Force (Amdt.) Ordinance, 1984 (35 of 1984), s.3 2 Subs by Act No.XXV of 2012, s 2 3",
      "source_provision": "sec2"
    }
  ]
}
