{
  "id": "pk-allopathic-system-prevention-of-misuse-ordinance-1962",
  "type": "statute",
  "title": "Allopathic System (Prevention of Misuse) Ordinance, 1962",
  "title_en": "Allopathic System (Prevention of Misuse) Ordinance, 1962",
  "short_name": "ASOMO",
  "status": "in_force",
  "issued_date": "1962-06-06",
  "in_force_date": "1962-06-06",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJ%2BW-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Allopathic System (Prevention of Misuse) Ordinance, 1962 (LXV of 1962) published by The Pakistan Code (Criminal Laws).",
  "provisions": [
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Rule",
      "content": "making powers of the Provincial Government"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Protection",
      "content": "1962\nORDINANCE NO. LXV OF 1962\n[7th June, 1962]\nAn Ordinance to prevent the misuse of the allopathic system of medicine and to provide for matters\nconnected therewith.\nWHEREAS it is expedient to prevent the misuse of the allopathic system of medicine and to\nprovide for matters connected therewith;\nNow, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958,\nand in exercise of all powers enabling him in that behalf, the President is pleased to make and\npromulgate the following Ordinance: ___"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Ordinance may be called the\nAllopathic System (Prevention of Misuse) Ordinance, 1962.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definition",
      "content": "_In this Ordinance, unless there is anything repugnant in the subject or\ncontext, “registered medical practitioner” means a person registered under the 1[Medical and Dental\nCouncil Ordinance, 1962 (XXXII of 1962)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Prohibition of the use of the word “doctor” and its variations, etc",
      "content": "_No person\npractising the allopathic, homoeopathic, ayurvedic, unani or any other system of medicine shall use\nwith his name or address or with the name or address of his business the word “doctor” or any of its\ngrammatical variations, cognate expressions or abbreviations so as to give out that he is entitled to\npractise medicine unless he is a registered medical practitioner:\nProvided that nothing in this section shall apply to a person on whom a Doctor’s degree other\nthan medical degree has been conferred by any university in or outside Pakistan."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Prohibition of the use of medical degrees or diplomas",
      "content": "_No person shall use a medical\ndegree or a medical diploma to give out that he is a qualified medical practitioner or for any purpose\nconnected with medical practice, unless such degree or diploma has been conferred or awarded by a\nuniversity or institution in or outside Pakistan recognized under the 1[Medical and Dental Council\nOrdinance, 1962] (XXXII of 1962)."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Prohibition of performing surgical operations by unqualified persons",
      "content": "_No person\nother than a registered medical practitioner shall perform any surgical operation other than\ncircumcision, incision of boils and administration of injections.\n1\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and Sch. II."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Prohibition for prescribing certain drugs",
      "content": "_No person other than a registered medical\npractitioner or a person authorized in this behalf by the 1[Provincial Government] shall prescribe any\nantibiotic or dangerous drug specified in the rules made under this Ordinance."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Restriction on the sale of patent and proprietory medicines",
      "content": "_No person shall sell in\nthe market any patent or proprietory medicine of the unani, ayurvedic, homoeopathic or biochemic\nsystem of medicine unless there is displayed, in a conspicuous and readily intelligible manner, on the\nlabel or container thereof and also on the outer cover of the container (other than ordinary wrapper)\nthe true formula of the medicine contained in it."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Penalty",
      "content": "_Whoever contravenes the provisions of section 3 or section 4 or section 5 or\nsection 6 or section 7 shall be punishable with imprisonment which may extend to one year or with\nfine not exceeding two thousand rupees, or with both."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Jurisdiction",
      "content": "_(1) No prosecution shall be instituted under this Ordinance except by an\nInspector appointed under the 2[Drugs Act, 1976 (XXXI of 1976)] or by a person specially\nempowered by the 1[Provincial Government] in this behalf.\n(2) No court inferior to that of a Magistrate of the first class shall try an offence punishable\nunder this Ordinance and notwithstanding anything contained in section 32 of the Code of Criminal\nProcedure, 1898 (Act V of 1898), it shall be lawful for such Magistrate to pass any sentence of fine\nto the extent provided for by this Ordinance in excess of his powers under the said section 32."
    }
  ],
  "definitions": []
}
