{
  "id": "pk-anand-marriage-act-1909",
  "type": "statute",
  "title": "Anand Marriage Act, 1909",
  "title_en": "Anand Marriage Act, 1909",
  "short_name": "AMA",
  "status": "in_force",
  "issued_date": "1909-10-21",
  "in_force_date": "1909-10-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apeX-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Anand Marriage Act, 1909 (VII of 1909) published by The Pakistan Code (Family Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent",
      "content": "_(1) This Act may be called the Anand Marriage Act, 1909 ; and\n2\n[(2) It extends to the whole of Pakistan.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Validity of Anand marriage. All marriages which may be or may have been duly",
      "content": "solemnized according to the Sikh marriage ceremony called Anand shall be, and shall be deemed to\nhave been with effect from the date of the solemnization of each respectively, good and valid in law."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Exemption of certain marriage from Act. Nothing in this Act shall apply to–",
      "content": "(a)        any marriage between persons not professing the Sikh religion, or\n(b)         any marriage which has been judicially declared to be null and void."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Saving of marriages solemnized according to other ceremonies. Nothing in this Act shall",
      "content": "affect the validity of any marriage duly solemnized according to any other marriage ceremony\ncustomary among the Sikhs."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Non",
      "content": "validation of marriages within prohibited degrees. Nothing in this Act shall be\ndeemed to validate any marriage between persons who are related to each other in any degree of\nconsanguinity or affinity which would, according to the customary law of the Sikhs, render a marriage\nbetween them illegal.\n__________\nDate: 11-09-2024\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1908, Pt. V, p. 357; for Report of Select Committee, see ibid., 1909, Pt. V,p. 1034; and for\nProceedings in Council, see ibid., 1908, Pt. VI, p. 156, and ibid., 1909 Pt. VI, pp. 156, 161 and 165.\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for the original\nsub-section (2) as amended by A.O., 1949."
    }
  ],
  "definitions": []
}
