{
  "id": "pk-anti-narcotics-force-act-anf-1997",
  "type": "statute",
  "title": "Anti Narcotics Force Act (ANF 1997)",
  "title_en": "Anti Narcotics Force Act (ANF 1997)",
  "short_name": "ANFA",
  "status": "in_force",
  "issued_date": "1997-11-30",
  "in_force_date": "1997-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apqXZA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Anti Narcotics Force Act (ANF 1997) (III of 1997) published by The Pakistan Code (Criminal Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Act may be called the Anti Narcotics Force Act,"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(a)     “Code” means the Code of Criminal Procedure, 1898 (Act V of 1898);\n(b)     “Director-General” means the Director General of the Force;\n(c)     “Force” means the Anti Narcotics Force constituted under section 3;\n(d)     “narcotics” includes narcotic drugs, psychotropic substances and controlled\nsubstances as defined in the Control of Narcotic Substances Ordinance, 1996\n(XCIV of 1996);\n(e)      “police” means a police-force constituted by the Federal Government        or\nProvincial Government under the Police Act, 1861 (V of 1861);\n(f)     “prescribed” means prescribed by rules under this Act; and\n(g)     “rules” means rules made under this Act.\n(2) The words and expressions used but not defined herein shall have the same\nmeaning as assigned to them in the Control of Narcotic Substances Ordinance, 1996 (XCIV of 1996)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Constitution of the Force",
      "content": "(1) Notwithstanding anything contained in any other\nlaw for the time being in force, the Federal Government may constitute a Force to be called the Anti-\nNarcotics Force.\n(2) The Force shall consist of a Director-General to be appointed by the Federal Government\nand such number of other officials as the Federal Government may, from time to time, appoint to be\nmembers of the Force.\n(3) On commencement of this Act, the Pakistan Narcotics Control Board constituted under\nthe Government of Pakistan, Planning Division’s Resolution, dated the 8th March, 1973, and Anti-\nNarcotics Task Force constituted under the Anti-Narcotics Task Force Ordinance, 1994 (LXXVI of\n1994), shall stand merged and all personnels, including officers, ministerial staff and the contingent staff\nof the said Board and Task Force shall, subject to the provisions of section 11 become members of the\nForce and be governed in accordance with this Ordinance and the rules made thereunder.\n(4) The Force shall for all intents and purposes be successor of Pakistan Narcotics Control\nBoard and Anti-Narcotics Task Force in respect of all cases, inquiries, investigation, assets, liabilities,\nrights, obligations and privileges and matters related thereto or connected therewith.\n(5) Notwithstanding anything contained in the General Clauses Act, 1897 (IV of 1897),\nanything done or action taken before the commencement of this Acts, under the Anti-Narcotics Task\nForce Ordinance, 1994 (LXXVI of 1994), or otherwise by the Pakistan Narcotics Control Board in so\nfar it is not inconsistant with the provisions of this Act shall be deemed to have been done or taken\nunder this Act."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Superintendence and administration of the Force",
      "content": "(1) The superintendence of the Force\nshall vest in the Federal Government.\n(2) The Administration of the Force shall vest in the Director-General who shall exercise in\nrespect of the Force all powers of an Inspector-General of Police under the Police Act, 1861 (V of 1861);\nand all other powers under the Act.\n(3) In case of any officers and members from the Armed Forces, the Director-General shall have\nall powers conferred by or under the Pakistan Army Act, 1952 (XXXIX of 1952), the Pakistan Air Force\nAct, 1953 (VI of 1953), and the Pakistan Navy Ordinance, 1961 (XXXVI of 1961), respectively as an\nofficer empowered to convene a General Court Martial:\nProvided that such powers shall be exercised only by the Director-General who is in\nthe regular service of any of the Armed Forces."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Functions of the Force",
      "content": "The Force shall\n(a)     inquire into, investigate and prosecute all offences relating to, or connected with,\npreparation,     production, manufacture, transportation, illicit trafficking or\nsmuggling of intoxicants, narcotics and chemical precursors or reagents used in\ntransaction under any law for the time being in force, including an attempt or\nconspiracy to commit, or any abetment of, any such offence, or any offence\ncommitted under the Control of Narcotics Substances Ordinance, 1996 (XCIV\nof 1996), or the Prohibition (Enforcement of Hadd) Order, 1979 (P.O.4 of 1979).\n(b)     trace and freeze the assets;\n(c)     provide assistance and advice to other enforcement agencies on all matters in the\nfield of narcotics and to collect information from all national and international\nenforcement agencies about illicit narcotic traffic and traffickers;\n(d)     maintain liaison with all national or international narcotics authorities,\norganisations, bodies, associations and societies and represent Pakistan in such\nconferences, seminars and workshops arranged by any such organization on\nnarcotics related matters;\n(e)     arrange and co-ordinate training of own staff and members of other enforcement\nagencies in various aspects of narcotics enforcement;\n(f)     co-ordinate the project and schemes for elimination and destruction of poppy\ncultivation; and\n(g)     perform any other related functions which may be assigned to it by the Federal\nGovernment."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power of the members of the Force",
      "content": "(1) The members of the Force shall, for the purpose of any\ninquiry or investigation under this Act, have throughout Pakistan such powers, including the powers relating\nto search, arrest of persons and seizures of property, and such duties, privileges and liabilities as a police-\nofficer has in respect of offences under the Code or any other law for the time being in force.\n(2) Save when the Director-General otherwise direct, a member of the Force, not below the rank of\nan Inspector may, for the purpose of any inquiry or investigation under this Act, exercise all the powers of\nan officer-in-charge of a police-station in any area in which he is for the time being and, when so exercising\nsuch powers, shall be deemed to be the officer-in-charge of a police-station discharging his functions as such\nwithin the limits of his station.\n(3) Without prejudice to the generality of te provisions of sub-section (1) and sub-section (2), any\nmember of the Force not below the rank of Inspector, authorized by the Director-General in this\nbehalf, may arrest without warrant any person who has committed or against whom a reasonable\nsuspicion exists that he has committed any of the offences relating to narcotics referred to in clause (a) of\nsection 5.\n(4) Notwithstanding anything contained in any other law for the time being in force, a member of\nthe Force not below the rank of Inspector authorised by the Director-General, may inquire, investigate and\ntrace the assets of a person who has committed an offence referred to in clause (a) of section 5 or when in\nhis opinion, there is a reasonable suspicion that the said assets were acquired through illicit involvement\nin narcotics; and may, for this purpose, require a bank or other financial institution or departments, whether\nunder the control of Government or otherwise to furnish such information as he may specify.\n(5) If in the opinion of a member of the Force, conducting an inquiry investigating or tracing any\nassets under sub-section (4), which is likely to be removed, transferred or otherwise disposed of, such\nmember may, notwithstanding anything contained in any other law for the time being in force, by order\nin writing direct the owner or any person who is for the time being in possession thereof, not to remove,\ntransfer, or otherwise dispose of such property in any manner except with the previous permission of that\nmember and such order shall be subject to any order made by the Court having jurisdiction in the\nmatter.\n(6) any contravention of any order made under sub-section (4) or (5) shall be punishable with\nrigorous imprisonment for a term which may extend to three years, or with fine, or with both.\n(7) Any member of the Force may, in performance of its functions and exercise of powers as\nmay be prescribed, seek assistance from all officers of police, customs, excise, Federal Investigation\nAgency or any other investigation agency or authority or civil armed forces.\n(8) Notwithstanding anything contained in any other law for the time being in force, the Federal\nGovernment may, in respect of any case registered by, or under investigation of, police, customs, excise,\nFederal Investigation Agency or any other investigation agency or authority, by order in writing, entrust\ninquiry or such investigation to the Force, and thereupon the police, customs, excise, Federal Investigation\nAgency or any other investigation agency or authority shall transfer the record of the case to the Force.\n(9) The Force may, in accordance with the law, establish as many police-stations as are required\nfor the efficient functioning of the Force and all police-stations of Anti-Narcotics Task Force and Pakistan\nNarcotics Control Board shall be deemed to be the police stations of the Force.\nExplanation,—For the purpose of this Act, the expression “police station” means and includes any\nplace declared as such, by the Federal Government or a Provincial Government to be a police station\nwithin the meaning of the Code."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Wearing of Uniform",
      "content": "All members, excluding ministerial staff of the Force, employed on\nenforcement duties shall wear such uniform as may be prescribed."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Punishment",
      "content": "(1) The following minor and major punishments shall be awarded to the officers\nand members of staff of the Force, namely:—\n(a)     Minor Punishments:\n(i)       Censure;\n(ii)      forfeiture of approved service upto two years;\n(iii)     withholding of promotion upto one year;\n(iv)      stoppage of increment for a period not exceeding three years without\ncumulative effect;\n(v)       fine to any amount not exceeding one month’s pay;\n(vi)      confinement to quarters for a term not exceeding fifteen days, with or\nwithout punishment, drill, extra guard, fatigue or other duty; and\n(vii)      extra drill not exceeding fifteen days, fatigue or other duties.\n(b)         Major Punishments:\n(i)           Reduction in rank;\n(ii)          compulsory retirement;\n(iii)         removal from service; and\n(iv)          dismissal from service.\n(2) Removal from service does not, but dismissal from service does, disqualify for future\nemployment.\n(3) In this section, removal or dismissal from service does not include the discharge of person—\n(a)         appointed on probation, during the period of probation, or in accordance with\nprobation or training rules applicable to him; or\n(b)         appointed, otherwise than under a contract, to hold a temporary appointment on\nthe expiration of the period of appointment; or\n(c)         engaged under a contract, in accordance with the terms of the contract."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Grounds of punishment",
      "content": "Where, a member, in the opinion of the Authority:—\n(a)         is inefficient or has ceased to be efficient; or\n(b)         is guilty of misconduct; or\n(c)         is corrupt or may reasonably be considered corrupt because—\n(i)     he is, or any of his dependents or any other person claiming\nthrough him, or on his behalf is, in possession (for which he cannot\nreasonably account) of pecuniary resources or any property\ndisproportionate to his known sources of income; or\n(ii)    he has assumed a style of living beyond his ostensible means; or\n(iii)   he has a reputation of being corrupt; or\n(d)he is engaged, or is reasonably suspected of being engaged in subversive or\nnarcotics activities, or is reasonably suspected of being associated with those\nengaged in subversive or narcotics activities or is guilty of disclosure of official\nsecrets to any unauthorised person, and his retention in service is, therefore,\nprejudicial to national security and interest of State,\nthe authority may impose on him one or more punishments specified in sub-section (1) of section 8."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Authority to award punishment",
      "content": "The authorities to award punishment under section 8\nare specified in the Schedule to this Act."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Terms of Service",
      "content": "(1) All personnels upto the rank of Inspector and their equivalent in the\nministerial staff of the Force may elect to be governed by the existing terms of service applicable to them\nand such option shall be sent to the Director-General, of the Force within such period as may be decided\nby the Director-General failing which they shall be deemed to have opted to serve under this Act.\n(2) The personnels not opting to serve in accordance with the terms of this Act may, at the\ndiscretion, of the Director-General, be placed at the disposal of Federal Government for adjustment\nelsewhere."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Conduct and Discipline",
      "content": "(1) The police Act, 1861 (V of 1861), the Police Rules, 1934, and\nthe Punjab Police (Efficiency and Discipline) Rules, 1975, shall, mutatis mutandis, be applicable to all\nmembers upto the rank of an Inspector, if not inconsistent with the provisions of this Act or where\noperation of any provision thereof is excluded by the Director-General by a specific order made in this\nbehalf.\n(2) Subject to subsection (1), all members of the Force including the ministerial staff except those\non deputation from the armed forces shall be governed by the Civil Servants Act, 1973 (LXXI of 1973),\nand rules made thereunder."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Members to serve anywhere",
      "content": "Every member of the Force shall be deemed to be always\non duty and be liable to serve anywhere within or without Pakistan."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Members as public prosecutors",
      "content": "Notwithstanding anything contained in the Code, all\nDirectors, Deputy Directors and Assistant Directors of the Force, shall be ex-officio public prosecutors\nin respect of all offences relating to narcotic and specified in clause (a) of section 5, for trial before the\nSpecial Court or any other court when so directed by the Director-General and may conduct the\nproceedings in the said Court and deal with any matter connected therewith or ancillary thereto."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Delegation of powers",
      "content": "The Director-General may, by order in writing, direct that all or any\nof his powers under this Act or the rules shall, subject to such conditions, if any, as may be specified\nin the order, be exercisable by any member of the Force."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Indemnity",
      "content": "No suit, prosecution, or other proceedings shall lie against the Federal\nGovernment, Provincial Government, Director-General or any member of the Force or any other person\nexercising any power or performing any function under this Act or the rules made thereunder for anything\nwhich is done is good faith or intended to be done under this Act or the rules."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Power to make rules",
      "content": "(1) The Federal Government may, by notification in the Official\nGazette, make rules for carrying out the purposes of this Act.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules may\nprovide for all or any of the following matters, namely:—\n(a)   the terms and conditions of service of the Director-General and other\nmembers of the Force and the qualifications for recruitment to various posts;\n(b)   the powers and functions of the members of the Force in relation to the\nconduct of inquiries and investigations; and\n(c)   the manner in which rewards may be given to the members of the Force or   to\nthe public for rendering commendable service.\n(Section 9)\nAuthorities to Award Punishment\n_______________________________________________________________________\nS. No.   Punishment      Inspector or   Sub-Inspector/\nHead          Constable\nequivalent     Assistant Sub-\nConstable or  or\ngrade          Inspector or\nequivalent    equivalen\nequivalent or a\ngrade or a    t or\ngrade between\ngrade         Lower\nASI/ Head-between       grade\nConstable Head\nConstable\nand\nConstable\n________________________________________________________________________"
    }
  ],
  "definitions": [
    {
      "term": "Code",
      "definition": "the Code of Criminal Procedure, 1898 (Act V of 1898);",
      "source_provision": "sec2"
    },
    {
      "term": "Director-General",
      "definition": "the Director General of the Force;",
      "source_provision": "sec2"
    },
    {
      "term": "Force",
      "definition": "the Anti Narcotics Force constituted under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "narcotics",
      "definition": "narcotic drugs, psychotropic substances and controlled substances as defined in the Control of Narcotic Substances Ordinance, 1996 (XCIV of 1996);",
      "source_provision": "sec2"
    },
    {
      "term": "police",
      "definition": "a police-force constituted by the Federal Government or Provincial Government under the Police Act, 1861 (V of 1861);",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules under this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act. (2) The words and expressions used but not defined herein shall have the same meaning as assigned to them in the Control of Narcotic Substances Ordinance, 1996 (XCIV of 1996).",
      "source_provision": "sec2"
    }
  ]
}
