{
  "id": "pk-anti-rape-investigation-and-trial-act-2021",
  "type": "statute",
  "title": "Anti-Rape (Investigation and Trial) Act, 2021",
  "title_en": "Anti-Rape (Investigation and Trial) Act, 2021",
  "short_name": "AATA",
  "status": "in_force",
  "issued_date": "2021-11-30",
  "in_force_date": "2021-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5hm-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Anti-Rape (Investigation and Trial) Act, 2021 (XXX of 2021) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, and commencement",
      "content": "(1) This Act may be called the Anti-Rape\n(Investigation and Trial) Act, 2021.\n(2)    It extends to the whole of Pakistan.\n(3)    It shall come into force on such date as the Federal Government may appoint."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the subject or\ncontext,—\n(a)    “anti-rape crisis cell” is a cell appointed under section 4 of this Act;\n(b)    “child” means any male or female, who has not attained the age of\neighteen years;\n(c)    “Code” means the Code of Criminal Procedure, 1898 (Act V of 1898);\n(d)    “Government” means the Federal Government;\n(e)    “independent support adviser” means a person appointed, enlisted or\nrecognized as such under section 11 of this Act;\n(f)    “Schedule” means a Schedule annexed to this Act; and\n(g)    “scheduled offences” means offences as set out in the Schedules against a\n“victim” or a “child” as defined in this Act;\n(h)    “sex offender” means and includes any person convicted under sections\n292A, 292B, 292C, 371A, 371B, 375, 375A, 376, 377, 377A, 377B of the\nPakistan Penal Code, 1860 (XLV of 1860) or sections 21 and 22 of the\nPrevention of Electronic Crimes Act, 2016 (Act XL of 2016);\n(i)    “special committee” means the Committee set up under section 15 of this\nAct;\n(j)    “Special Court” means the Court established under section 3 of this Act;\n(k)    “victim” means a woman or child who has been subjected to scheduled\noffences;\nExplanation.— It is clarified that where the Scheduled offences are committed against\npersons who do not qualify to be categorized as “victim” or “child” as defined under this Act, the\noffences shall be tried through procedure, rules of evidence and courts, functioning prior to this\nAct coming into effect.\n(2) All other terms and expressions used but not defined in this Act shall have the same\nmeanings as are assigned thereto them in the Pakistan Penal Code, 1860 (Act XLV of 1860) or in\n(P.O. No. 10 of 1984)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of Special Courts, etc",
      "content": "(1) The Federal Government, in consultation\nwith the Chief Justice of the High Court concerned, shall establish as many Special Courts\nthroughout the country, as it may deem necessary, to try the scheduled offences.\n(2) The Federal Government, in consultation with the Chief Justice of the High Court\nconcerned, shall appoint any person as a Judge of the Special Court, who is or has been a\nSessions Judge or Additional Sessions Judge, or has been an advocate of the High Court for a\nperiod of not less than ten years, and is not more than sixty-eight years of age at the time of\nappointment.\n(3) In addition to or in lieu of the establishment of Special Courts under sub-section (1),\nthe Federal Government may, in consultation with the Chief Justice of the High Court concerned,\ndesignate, throughout the country, as many Courts of Additional Sessions Judges or such other\ncourts as Special Courts, as it may deem fit:\nProvided that where gender based violence (GBV) courts or juvenile courts or child\nprotection courts have already been designated, they shall be deemed to be the Special Courts\nunder this Act:\nProvided further that where more than one Special Court is designated or established in\none jurisdiction, the concerned Courts of Sessions shall allocate the case.\n(4) A Judge of the Special Court shall have the same powers and jurisdiction as are\nvested in the Court of Sessions under the Code.\n(5) A Judge of the Special Court shall be appointed for a period of three years on such\nterms and conditions as may be determined by the Federal Government.\n(6) A Judge of a Special Court shall only be removable before the expiry of his tenure if\nhe is found guilty of misconduct.\n(7) The disciplinary proceedings against a Judge of a Special Court shall be conducted in\nthe same manner and under the same legal provisions and rules as prescribed for a District and\nSessions Judge.\n(8) During his tenure, a Judge of a Special Court may be transferred to another Special\nCourt within the same Province, by the Chief Justice of the High Court concerned, for reasons to\nbe recorded in writing.\n(9) The trial of scheduled offences shall ordinarily be conducted in the Special Court\nwithin whose territorial jurisdiction the offences are committed."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Anti",
      "content": "rape crisis cells.— (1) The secretary, ministry of law and\njustice, in consultation with the chief secretary of the province or the chief commissioner of the\nIslamabad Capital Territory (ICT), as the case may be, shall establish or designate as many anti-\nrape crisis cells throughout the country in relation to offences mentioned in Schedule-II, in such\npublic hospitals with adequate medical facilities, as he may deem fit.\n(2) The anti-rape crisis cells shall be headed by the concerned commissioner or deputy\ncommissioner of the area, as deemed fit by the secretary, ministry of law and justice, in\nconsultation with the chief secretary of the province, or the chief commissioner ICT, as the case\nmay be, and shall also comprise the medical superintendent of the public hospital designated\nunder sub-section (1), preferably one independent support adviser, a police officer as deemed fit\nby the secretary, ministry of law and justice, in consultation with the chief secretary of the\nprovince, or the chief commissioner ICT, as the case may be:\nProvided that at least one member of the anti-rape crisis cell shall preferably be a woman."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power, duties and functions etc. of the Anti",
      "content": "Rape Crisis Cell.— (1) As soon as an\nanti-rape crisis cell receives information from any source, on its own accord or upon application\nby any person, orally or in writing, of an offence mentioned in Schedule II, it shall without any\ndelay ensure the following, namely:—\n(a)    conduct of a medico-legal examination without any delay;\n(b)    securing, collection and gathering of such evidence as may be expedient;\n(c)    conduct of a forensic analysis or examination;\n(d)    registration of an first information report (FIR) by the police; and\n(e)    performing of any other action as may be necessary.\n(2) The actions mentioned in sub-section (1) may be taken without any preferred order,\nhowever, all the said actions are required to be taken up expeditiously.\n(3) As soon as an officer-in-charge of a police station receives any information with\nregard to the commission of an offence mentioned in Schedule-II, he shall, without any delay,\ntransmit such information to the anti-rape crisis cell.\n(4) The secretary, of the ministry of law and justice, in consultation with chief secretary\nof the province or the chief commissioner ICT, as the case may be from time to time, upon\nrecommendations of the special committee, issue guidelines for the anti-rape crisis cells to\nefficaciously carry out their powers, duties and functions."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Legal assistance",
      "content": "(1) The legal aid and justice authority established under the Legal\nAid and Justice Authority Act, 2020 (Act XVI of 2020) shall provide legal assistance to victims\nof scheduled offences. In addition, the Fund established under this Act shall also be utilized for\nlegal assistance under this Act.\n(2) In addition to the legal assistance under sub-section (1), the special committee shall in\nconsultation with the ministry of human rights, approve panels of advocates and volunteers in\neach district or, if necessary, in any tehsil, for the provision of legal, financial or other assistance\neither on pro bona or on fee basis, for which the Fund under this Act and under the Legal Aid\nand Justice Authority Act, 2020 (Act XVI of 2020) shall be utilized."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Prosecutor general and special prosecutors",
      "content": "(1) The ministry of law and justice\nmay designate or appoint a prosecutor general and special prosecutors in a manner as may he\nprescribed by rules notified by the ministry of law and justice.\n(2) The prosecutor general and special prosecutors shall prosecute the scheduled\noffences."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Victim and witness protection",
      "content": "(1) In addition to the existing laws, a victim and\nwitness protection system may be established as prescribed in the rules notified by the ministry\nof law and justice and shall, with a view to carrying out the purposes of this Act and without\ngenerality of the aforesaid, include the following, namely:—\n(i)      special security arrangements for witnesses and victims;\n(ii)     concealment of identity;\n(iii)    distance recording of testimonies through video-conferencing, audio-video\nlinks and by the use of modern devices;\n(iv)     re-location of victims and witnesses;\n(v)      provision of reasonable financial assistance;\n(vi)    compensation to legal heirs of protected victims and witnesses;\n(vii)   safe-houses, dar-ul-amans, etc.;\n(viii) such other measures as may be necessary and ancillary.\n(2) Till such time the rules envisaged in sub-section (1) are prescribed, provincial or ICT\nwitness protection laws as the case may be, shall be applicable to both victims and witnesses\nunder this Act, mutatis mutandis."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Investigation in respect of scheduled offences",
      "content": "(1) For the purposes of\ninvestigation under this Act, special sexual offences investigation units (SSOIUs) shall be\nestablished in every district by the provincial governments and for the purposes of the Islamabad\nCapital Territory by the Federal Government.\n(2) The SSOIU shall comprise police officers who have received training on investigation\nin relation to sexual offences and preferably one member of the unit shall be a female police\nofficer.\n(3) The investigation in respect of offences mentioned under this Act shall be carried out\nas follows:__\n(i)     for offences mentioned in Schedule-I, by the SSOIU; and\n(ii)    for offences mentioned in Schedule-II, by SSOIU under the supervision of\na police officer not below the rank of BPS-17.\n(4) In case the complainant in relation to an offence under Schedule-II expresses\ndissatisfaction which is based on reasonable grounds, the investigation shall be transferred to the\ndistrict head of investigation of the police.\n(5) The officers of the SSOIUs shall ordinarily be from the area in which the occurrence\nof the offence has taken place:\nProvided that in exceptional circumstances, and where the dictates of fair, accurate and\ntechnical investigation warrant otherwise, officers from areas other than the area of occurrence,\nmay be deputed in the SSOIUs.\n(6) Upon completion of investigation, the SSOIU shall, through the prosecutor general or\nspecial prosecutors, submit the final report under section 173 of the Code before the Special\nCourt."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Connected offences not in the Schedules",
      "content": "The investigation officer or the joint\ninvestigation team (JIT), as the case may be, under section 9, may also take cognizance of\noffences, not listed in the schedules, committed in connection with the scheduled offences, as if\nthose offences were scheduled offences."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Independent support advisers",
      "content": "(1) If so determined by the anti-rape crisis cell, an\nindependent support adviser shall accompany the victim during Court proceedings, in order to\nreduce the risk of duress, victimization of any nature, or any adversity afflicted or likely to be\nafflicted upon the victim.\n(2) The special committee, in consultation with the ministry of human rights, shall\nprepare a list of independent support advisers at district or tehsil levels.\n(3) For the purposes of sub-section (2), the special committee shall, in consultation with\nthe ministry of human rights, enlist a civil society or a non-governmental organization, whose\nmembers or nominees may act as independent support advisers.\n(4) An independent support adviser shall be a person having skills to deal with victims of\nscheduled offences, who may be a psychologist, or a doctor, or a lawyer, or a para-legal, or a\nlady-health worker, or a social worker, or a person who is a member or nominee of a civil society\nor a non-governmental organization enlisted under sub-section (3)."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. In",
      "content": "camera trial.— (1) The trial of scheduled offences shall be conducted in-camera:\nProvided that the Court, if it thinks fit, on its own or on an application made by either of\nparties, allow any particular person to have access to court proceedings, or remain in the Court.\n(2) Notwithstanding anything contained in any other law for the time being in force,\nwhere any proceedings are held under sub-section (1), the Court may adopt appropriate\nmeasures, including holding of the trial through video-link or usage of screens, for the protection\nof the victims and the witnesses.\n(3) Where any proceedings are held under sub-section (1), it shall not be lawful for any\nperson to publish or broadcast any matter or information in relation to any such proceedings,\nexcept with the permission of the Court."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Evidence and guidelines.__ (1) The two",
      "content": "finger virginity testing, for the purposes of\nmedico-legal examination of a victim relating to scheduled offences, shall be strictly prohibited\nand no probative value shall be attached thereto.\n(2) In respect of any scheduled offence, any evidence to show that the victim is generally\nof immoral character, shall be inadmissible:\nProvided that the right of an accused to a fair trial shall not be prejudiced.\n(3) The testimonies and evidence of victims, accused and witnesses in Court shall be\nvideo-recorded, preserved and reduced in writing."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Statement under section 164 of the Code",
      "content": "(1) Notwithstanding anything\ncontained in any other law for the time being in force, as soon as practicable, a statement of the\nvictim shall be recorded under section 164 of the Code only once.\nExplanation:— The statement under this sub-section shall be video-recorded, preserved\nand reduced in writing.\n(2) An opportunity of cross examining the victim shall be given to the counsel for the\naccused and not the accused himself, or the Court may itself put questions to the victim or any\nquestions framed by the accused may be given to the presiding officer of the Court who may put\nsuch questions, as found appropriate by him, to the victim."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Special Committee",
      "content": "(1) The ministry of law and justice shall appoint a special\ncommittee comprising such members and in such numbers as it may deem fit on pro bono or\nhonorary basis.\n(2) Chief secretaries and the finance secretaries of the provincial governments and the\nICT shall assist the special committee to ensure reasonable funding for the performance of duties\nunder this Act. The special committee will set standards, key performance indicators and conduct\nperformance measurement.\n(3) The special committee shall take all steps, including reaching out to any Federal or\nprovincial ministry, division, department, office, agency or authority, for the purposes of\neffectual compliance of this Act.\n(4) The special committee may comprise individuals from any Federal or Provincial\nministry, division, department, authority or office, or from members of the legal or medical\nprofession, legislators, retired judges, serving or retired public servants, civil society or non-\ngovernmental organizations, as deemed fit by the ministry of law and justice.\n(5) For the purposes of effective compliance and proper working of this Act, the special\ncommittee, from time to time, may seek information or require the performance of actions by\nofficers of the Federal or provincial ministries, divisions, departments, offices, agencies or\nauthorities.\n(6) If any person refuses or fails to comply with the directions issued by the special\ncommittee under this section, the special committee may refer the matter to the appropriate\nauthority for taking disciplinary action against the person who disregards the directions."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Trial",
      "content": "(1) The Court upon taking cognizance of a case, under this\nAct shall decide the case expeditiously, preferably within four months.\n(2) A Special Court shall not grant more than two adjournments during the trial of a case,\nout of which one adjournment shall be upon payment of costs by the person seeking\nadjournment. Where the defense counsel does not appear after two consecutive adjournments,\nthe Court may appoint another defense counsel with at least seven years standing in criminal\nmatters for the defense of the accused from the panel of advocates maintained by the special\ncommittee.\n(3) If, in the course of a trial, the Court is of the opinion that any of the offences which\nthe accused is alleged to have committed is not a scheduled offence, the Court shall record such\nopinion and try the accused only for such offences, which are scheduled offences.\n(4) A Special Court may also try offences, not listed in the schedules, committed in\nconnection with the scheduled offences, as if those offences were scheduled offences.\nExplanation.— It is clarified that sub-section (4) shall also be applicable where the\nprovisions of the Anti-Terrorism Act, 1997 (Act XXVII of 1997) are invoked or invokable in\nrespect of offences under this Act."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Compensation to the victim",
      "content": "On conclusion of the trial, the Court may order the\nconvict to pay compensation to the victim, in addition to the penalty of fine, if any."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Appeal",
      "content": "(1) Any person aggrieved by the final judgment of a Special Court may\nfile an appeal to a High Court in whose jurisdiction the Special Court tendering the impugned\njudgment, is situated.\n(2)     Copies of the judgment of the Special Court shall be supplied to the accused and\nthe prosecution, free of cost, on the day the judgment is pronounced, whereafter the record of the\ntrial shall be transmitted to the concerned High Court within three days of the decision.\n(3)     An appeal under sub-section (1) may be preferred within thirty days of the final\njudgment by the Special Court.\n(4)    An appeal preferred under sub-section (1) shall be decided by a division bench of\n(5)    While hearing an appeal, the High Court shall not grant more than two\nconsecutive adjournments.\n(6)   Pending appeal, the High Court shall not release a person convicted by the trial\ncourt."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Rules",
      "content": "(1) The ministry of law and justice may prescribe rules, upon the\nrecommendations of the special committee, for the purposes of carrying out the purposes of this\nAct.\n(2) Without prejudice to the generality of the foregoing powers, such rules may provide\nguidelines,—\n(i)    for the purposes of medico-legal examination of the victims;\n(ii)    in respect of the investigation and prosecution of scheduled offences;\nincluding the collection and gathering of evidence;\n(iii)   in relation to the rehabilitation of the victim, offender, suspect or a\nmember of the society;\n(iv)    pertaining to gender and children sensitization and training of all relevant\nstakeholders, including Judges, police-officers, prosecutors, medico-legal\nofficers and staff and other duty officers or personnel, both at the time of\ninduction and subsequently; and\n(v)     for providing special trial court rooms; or special rooms or facilities for\nthe victims, especially children, near the trial court rooms, for a conducive\nenvironment.\n(3)    The special committee, in formulating its recommendations under sub-section (1),\nmay consult any ministry, division, office, department, agency or authority in the Federal or\nprovincial government and shall take into account modern techniques and devices, as it may\nconsider appropriate."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Fund",
      "content": "(1) The Prime Minister shall establish a Fund to carry out the purposes of\nthis Act.\n(2)     The purposes of the Fund shall include the meeting of any expenses—\n(a)     towards the establishment of Special Courts; or\n(b)     with regard to the exercise of any other power, duty or function mentioned\nin this Act; or\n(c)     in respect of anything which is ancillary or sundry for the purposes of this\nAct.\n(3)     The Fund shall consist of the following sources, namely:—\n(a)     grants from the Federal Government and provincial governments;\n(b)     aid and assistance from local, national and international agencies;\n(c)     contributions from statutory bodies, corporations, private organizations\nand individuals; and\n(d)     income and earnings from moveable and immoveable properties acquired\nor leased by the Fund.\n(4)     The amount credited to the Fund shall not lapse by the end of a financial year and\nshall be available for utilization at any time."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Preventive action by police",
      "content": "If any police officer receives information in relation\nto the commission or threat of commission of a scheduled offence, he shall immediately\ninterpose, act and take such action as may be necessary including and not limited to the\nexercising of powers under the Code, in particular sections 149 and 151 thereof, to prevent the\ncommission of such offences, notwithstanding that the offence reported has been committed in\nan area not within the jurisdiction of such police officer."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. False investigation or complaint",
      "content": "(1) Whoever, being a public servant,\nentrusted to investigate scheduled offences, fails to carry out the investigation properly or\ndiligently or causes the conductor false investigation or fails to pursue the case in any court of\nlaw properly and in breach of duties, shall be guilty of an offence punishable with imprisonment\nof either description which may extend to three years and with fine.\n(2)     Whoever gives to any public servant any information in relation to scheduled\noffences which he knows or believes to be false, intending thereby to cause, or knowing it to be\nlikely that he will thereby cause, such public servant—\n(a)    to do or omit anything which such public servant ought not to do or omit if\nknown by him; or\n(b)    to use the lawful power of such public servant to the injury or annoyance\nof any person,\nshall be punished with imprisonment of either description for a term which may extend to three\nyears and with fine."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Jurisdiction and transfer of cases, etc",
      "content": "(1) The scheduled offences shall be\nexclusively triable by the Special Court.\n(2) Subject to sub-section (3), upon commencement of this Act, the trial of scheduled\noffences pending in any court shall stand transferred to the Special Court having jurisdiction\nunder this Act and such Court shall proceed with the case from the stage at which it was pending\nimmediately before such transfer and it shall not be bound to recall or re-hear any witness who\nhas given evidence and may act on the evidence and procedures already recorded and complied\nwith, respectively.\n(3) Each time when a new offence is inserted into any of the Schedules to this Act, sub-\nsection (2) shall come into operation, mutatis mutandis, from the date of such insertion."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Register of sex offenders",
      "content": "(1) The National Data-Base and Registration Authority\n(NADRA) shall prepare a register of sex offenders.\nExplanation.— “sex offender” means a person convicted of a scheduled offence.\n(2) Notwithstanding the aforesaid, the ministry of law and justice may prescribe rules,\nupon the recommendations of the special committee, for the release of such data of the register\nof sex offenders to any person, agency, authority, court of law or segment of the society in public\ninterest and safety.\n(3) The special committee may require the NADRA to prepare different categories of sex\noffenders in the register under this section.\n(4) For the purposes of this section, the special committee may require the NADRA, the\nNational Police Bureau and the forensic science laboratories, to prepare different categories of\nsex offenders in the register."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Public reporting mechanism",
      "content": "The ministry of law and justice, upon\nrecommendations of the special committee, frame rules for establishing a reporting mechanism\nfor receiving information from the public about suspicious persons or those suspected to have\ncommitted the scheduled offences."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Non",
      "content": "disclosure of identity of victims, etc.— (1) No person shall disclose or reveal\nthe identity of any victim or victim’s family in respect of the scheduled offences, without prior\nwritten permission of the victim or victim’s guardian where the victim is a minor or the victim’s\nfamily, as the case may be.\n(2) Any person contravening the provisions of sub-section (1) shall be guilty of an\noffence punishable in the same manner and to the same extent as provided under section 376A of"
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Act not to derogate from other law",
      "content": "In respect of offences mentioned in Schedule-\nI, the provisions of this Act shall be in addition to and not in derogation of any other law for the\ntime being in force."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Overriding effect",
      "content": "In respect of offences mentioned in Schedule-II, the provisions\nof this Act shall have effect notwithstanding anything inconsistent contained in any other law for\nthe time being in force."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Application of Code",
      "content": "The provisions of the Code, to the extent not inconsistent\nwith anything contained in this Act, shall apply mutatis mutandis."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Amendment in the Schedule",
      "content": "The ministry of law and justice may, by notification\nin the official Gazette, amend the Schedules under this Act so as to include or exclude any\noffence or explanation."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Removal of difficulties",
      "content": "Where any difficulty arises in giving effect to any of the\nprovisions of this Act, the President may, by notification in the official Gazette, make such order,\nnot inconsistent with the provisions of this Act, as may appear to be necessary for the purpose of\nremoving the difficulty."
    }
  ],
  "definitions": [
    {
      "term": "child",
      "definition": "any male or female, who has not attained the age of eighteen years;",
      "source_provision": "sec2"
    },
    {
      "term": "Code",
      "definition": "the Code of Criminal Procedure, 1898 (Act V of 1898);",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "independent support adviser",
      "definition": "a person appointed, enlisted or recognized as such under section 11 of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Schedule",
      "definition": "a Schedule annexed to this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "scheduled offences",
      "definition": "offences as set out in the Schedules against a “victim” or a “child” as defined in this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "sex offender",
      "definition": "and includes any person convicted under sections 292A, 292B, 292C, 371A, 371B, 375, 375A, 376, 377, 377A, 377B of the Pakistan Penal Code, 1860 (XLV of 1860) or sections 21 and 22 of the Prevention of Electronic Crimes Act, 2016 (Act XL of 2016);",
      "source_provision": "sec2"
    },
    {
      "term": "special committee",
      "definition": "the Committee set up under section 15 of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Special Court",
      "definition": "the Court established under section 3 of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "victim",
      "definition": "a woman or child who has been subjected to scheduled offences; Explanation.— It is clarified that where the Scheduled offences are committed against persons who do not qualify to be categorized as “victim” or “child” as defined under this Act, the offences shall be tried through procedure, rules of evidence and courts, functioning prior to this Act coming into effect. (2) All other terms and expressions used but not defined in this Act shall have the same meanings as are assigned thereto them in the Pakistan Penal Code, 1860 (Act XLV of 1860) or in (P.O. No. 10 of 1984).",
      "source_provision": "sec2"
    }
  ]
}
