{
  "id": "pk-apostille-act-2024",
  "type": "statute",
  "title": "Apostille Act, 2024",
  "title_en": "Apostille Act, 2024",
  "short_name": "Apostille Act, 2024",
  "status": "in_force",
  "issued_date": "2024-09-05",
  "in_force_date": "2024-09-05",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pqZw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Apostille Act, 2024 (XXI of 2024) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, application and commencement.―(1) This Act shall be called the",
      "content": "Apostille Act, 2024.\n(2) It shall extend to the whole of Pakistan.\n(3) It shall apply to foreign public documents and other public documents as specified from time\nto time in the official Gazette by the Federal Government.\n(4) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.―(1) In this Act, unless the context or subject otherwise requires,―",
      "content": "(a)      “certification” means certification that authenticates the origin of the documents and\nnot the contents;\n(b)      “competent authority” means the division to which business of this Act stands\nallocated or any other authority declared by the Federal Government to be a\ncompetent authority required under the Convention;\n(c)      “Convention” or “Apostille Convention” means the Hague Convention Abolishing\nthe requirement of legalization for foreign public documents, done at the Hague on\nthe 5th day of October 1961, the english text of which is set out in the First Schedule\nand includes any ratified protocols;\n(d)      ”Convention State” means a state party to the Convention other than Pakistan, but\ndoes not include.—\n(i)       any state party that objected to Pakistan's accession to the Convention; and\n(ii)      any state party whose accession to the Convention Pakistan objected to; and\n(e)      “model certificate” or “apostille certificate” means the model certificate set out in\nthe Annexure to the Convention."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Conferment of certification.―(1) Notwithstanding anything to the contrary contained in any",
      "content": "other law, the provisions of the Convention shall have the force of law in Pakistan.\n(2) The Federal Government may, by notification in the official Gazette, amend the Schedule in\nconformity with any amendment made and adopted in the Convention, provided that such amendments\nshall be adopted and ratified by the Government of Pakistan."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Fees.―The competent authority may, by notification in the official Gazette, determine fees in",
      "content": "relation to the issuance of apostille certificates from time to time."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power not to recognize certain documents in Pakistan.―The application of those foreign",
      "content": "documents shall be in-effective, which fall within the ambit of Apostille Convention but are against\nthe glory of Islam and national interests, sovereignty and integrity of Pakistan."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Overriding effect.―The provisions of this Act shall have effect notwithstanding anything to",
      "content": "the contrary contained in any other law, for the time being in force."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Indemnity.―No suit, prosecution or other legal proceeding shall lie against any person for",
      "content": "anything which is done or intended to be done in good faith in pursuance of this Act."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Power to make rules.―The Federal Government may, by notification in the official Gazette,",
      "content": "make rules for carrying out the purposes of this Act.\nTHE SCHEDULE NO.I\n(Sec sections 2 and 3)\nArticle-1"
    }
  ],
  "definitions": [
    {
      "term": "certification",
      "definition": "certification that authenticates the origin of the documents and not the contents;",
      "source_provision": "sec2"
    },
    {
      "term": "competent authority",
      "definition": "the division to which business of this Act stands allocated or any other authority declared by the Federal Government to be a competent authority required under the Convention;",
      "source_provision": "sec2"
    }
  ]
}
