{
  "id": "pk-asaan-karobar-act-2025",
  "type": "statute",
  "title": "Asaan Karobar Act, 2025",
  "title_en": "Asaan Karobar Act, 2025",
  "short_name": "AKA",
  "status": "in_force",
  "issued_date": "2025-11-24",
  "in_force_date": "2025-11-24",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5toZg%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Asaan Karobar Act, 2025 (XXXVIII of 2025) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act shall be called the Asaan Karobar\nAct, 2025.\n(2) It shall extend to the whole of Pakistan.\n(3) It shall come into force at once,"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context, __\n(a)     “BOI” means the Board of Investment established under the Board of Investment\nOrdinance, 2001 (XV of 2001);\n(b)    “burden” means any or all of the following:__\n(i)     financial costs, including compliance, time, and administrative costs; or\n(ii)    requirements, processes and procedures determined through the final decision\nof the Cabinet under section 13, as causing administrative inconvenience,\nuncertainty, delays and adversely affecting consumer choice, efficiency,\nproductivity and profitability.\n(c)    “business” includes any lawful enterprise, trade, whether or not incorporated or\nregistered;\n(d)    “Cabinet Committee” means the Cabinet Committee on Regulatory Reforms\n(CCoRR) constituted by the Prime Minister through Notification No. F.5/24/2024-\nCom. dated the 18th September, 2024 or any other cabinet committee designated by the\nPrime Minister to perform functions under this Act;\n(e)   “electronic document” includes documents, records, information. communication,\npayments, or transactions in electronic form;\n(f)   “Government Agency” means__\n(i)     a ministry, division, department, or sub-ordinate office of the Federal\nGovernment:\n(ii)    an authority, agency, undertaking, business, or other entity or body established\nby or under a Federal statute or controlled directly or indirectly by the Federal\nGovernment; and\n(iii)   an authority, agency, undertaking, business or other entity or body that is subject\nto Federal law or operates in Federal territory;\nthat is or may be charged with the function of administering or enforcing any laws, or\nissuing, administering or enforcing RLCO.\n(g)   “Portal” means the Pakistan Business Portal established under section16;\n(h)   “prescribed” means prescribed by rules or regulations, as the case may be, made under\nthis Act;\n(i)   “Registry” means the Pakistan Regulatory Registry established under section 7;\n(j)   “Regulatory Impact Assessment (RIA) Tool and Guidelines” or “RIA” means the\nevidence-based approach approved by the BOI to critically assess policy options and\nthe consequences of Government Agency’s actions to support policy decisions;\n(k)   “Regulatory Management System” or “RMS” means the set of policies, procedures,\nprocesses, IT systems, and tools employed to pursue and maintain good quality\nregulatory and other policy functions of Government Agencies;\n(1)   “RLCO” means any rules, licenses, circulars, orders, regulations, SROs, by-laws,\nnotifications, certificates, office memoranda, permits, instructions, forms,\nauthorizations, directives, resolution or other instruments made, issued or enforced by\na Government Agency with regulatory effect and functions, and includes such other\ninstruments as may be notified by the Federal Government;\n(m)   “Schedule” means Schedule to this Act;\n(n)   “Secretary” means the Secretary of the Board of Investment;\n(o)   “System” means an electronic system for creating, generating, sending, receiving,\nstoring, reproducing, displaying, recording or processing information; and\n(p)   “Unit” means the Asaan Karobar Technical Unit established under section 5."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Application of the Act",
      "content": "Notwithstanding anything contained in any other law, the\nprovisions of this Act shall apply in relation to the matters contained herein, including, but not limited\nto, the powers and functions of the BOI, Government Agencies, and the Cabinet Committee."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Certain provisions not to apply",
      "content": "The provisions of this Act relating to regulatory reform\nshall not apply to__\n(a)     offices, bodies, or institutions, created or existing by or under the Constitution of the\nIslamic Republic of Pakistan 1973;\n(b)     the Supreme Court of Pakistan, the High Courts, the Federal Shariat Court and all other\ncourts created by the Constitution or the law;\n(c)     criminal law, criminal procedure, the police and other law enforcement agencies, not\nincluding procedural and regulatory matters relating thereto;\n(d)     imposition and collection of taxes not including procedural and regulatory matters\nrelating thereto;\n(e)     foreign relations and foreign policy, not including procedural matters or matters relating\nto the regulation of trade;\n(f)     national security, strategic installations and matters pertaining to the armed forces, and\nthe defence of Pakistan; and\n(g)     any other entity or subject included in the Schedule."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Asaan Karobar Technical Unit",
      "content": "(1) Not later than thirty days from the coming into force\nof this Act, the Secretary shall establish the Asaan Karobar Technical Unit.\n(2) Head of the Unit to be appointed by the Government shall be a grade-20 officer of the\nFederal Government or a person from private sector having relevant qualifications as may be\nprescribed under the rules.\n(3) For the performance of the functions of the Unit, Head of the Unit may with the approval\nof the Federal Government, appoint such persons including technical experts as may be required from\namongst the officers of Federal Government or Private Sector on such terms and conditions as may be\nprescribed."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Functions and powers of the Asaan Karobar Technical Unit.__(1) Subject to sub",
      "content": "section\n(2), the Unit shall__\n(a)     oversee and monitor the process of regulatory reform under this Act;\n(b)     establish and maintain an online Registry to catalogue, describe, and map relevant laws\nand RLCOs;\n(c)   review proposals for legislation relating to regulation of matters affecting business,\ntrade and investment and to propose changes thereto prior to their being placed before\nthe Cabinet;\n(d)   review proposals for issuance of or amendments to RLCOs and propose changes\nthereto;\n(e)   co-ordinate with Government Agencies and Provincial Governments for uniformity and\nharmonization of laws and policies having impact on matters affecting business, trade\nand investment throughout Pakistan;\n(f)   require Government Agencies, to enter on the Registry, all laws and RLCOs pertaining\nto them that are in force, with such description as may be consistent with guidelines\nissued by it in this regard, and within such period as it may stipulate;\n(g)   require Government Agencies to review existing laws and RLCOs and to propose\nretention, amendment or repeal thereof in order that they may be consistent with the\nparameters stated in section 8;\n(h)   review proposals received from Government Agencies and the general public, as the\ncase may be, for retention, amendment or repeal of laws and RLCOs;\n(i)   prescribe codes, principles, guidelines and standards for strengthening regulatory\ngovernance to be adhered to by Government Agencies during the process of regulatory\nreform under this Act;\n(j)   prescribe the manner in which new laws and RLCOs may be entered on the Registry;\n(k)   conduct or commission studies, inter alia, for identification of investment constraints\nfor small and medium enterprises and women entrepreneurs and to take such steps as\nare necessary to eliminate such identified constraints through the process of regulatory\nreform under this Act;\n(1)   issue clarifications, notifications, instructions, guidelines. SOPs and other instruments\nfor carrying out the objects of this Act;\n(m)   undertake awareness campaigns, market regulatory reforms initiatives, and collaborate\nwith stakeholders, Government Agencies, civil society, academia experts, donor\nagencies, development partners, at both national and international level for\nidentification and implementation of regulatory reform process;\n(n)   conduct training and capacity building exercises for Government Agencies for the\npurposes of their functions under this Act; and\n(o)   perform any other functions assigned to it by the Cabinet Committee or the Federal\nGovernment and to take such steps as are necessary or ancillary to the performance of\nfunctions under this Act.\n(2) The functions and powers of the Unit shall be performed and exercised by the Head of the\nUnit who may, subject to such conditions and limitations as he may determine, delegate the same to\npersons appointed under sub-section (3) of section 5 and may also constitute committees from amongst\nsuch persons for the said purpose."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Establishment of Pakistan Regulatory Registry",
      "content": "(1) The Unit shall establish and maintain\nan electronic registry to be known as the Pakistan Regulatory Registry for cataloguing and mapping\nof laws and RLCOs.\n(2) The Unit may procure requisite software, hardware, systems, codes, data, infrastructure or\nother material to effectively manage and operate the Registry and for its future expansion and such\nsoftware, hardware, systems, codes, data, infrastructure or other material shall, at all times, be\naccessible to and remain the property of the Unit."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Parameters for review of laws and RLCOs",
      "content": "(1) The review of laws and RLCOs shall be\ncarried out in order to determine:__\n(a)     whether the laws and RLCOs are necessary and consistent with the objects of this Act\nas well as regulators’ codes, internationally recognized regulatory quality principles,\nRIA, RMS, smart regulations, risk-based regulations, Pakistan regulators principles and\ncode of practice and guidelines issued by the Unit;\n(b)     the expected burdens on businesses for compliance with the laws and RLCOs;\n(c)     whether a law or RLCO is to be retained with or without amendment or repealed.\n(2) The Unit may issue a checklist or other instructions to be followed for the purpose of the\nreview of laws and RLCOs in terms of sub-section (1)."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Entering laws and RLCOs on the Registry",
      "content": "(1) The Unit shall direct Government\nAgencies to make available on the Registry, all laws and RLCO applicable to or being administered\nby them as well as any other information specified by the Unit within such time as it may determine.\n(2) Every Government Agency shall nominate a representative to co-ordinate with the Unit for\n(3) The head of each Government Agency, by whatever name called, shall transmit to the Unit\na certificate on the schedule set by the Unit to the effect that sub-section (1) stands complied with.\n(4) Upon the transmission of the certificate referred to in sub-section (3), the RLCOs entered\non the Registry by a Government Agency shall he deemed to be the only RLCOs in force and all other\nRLCOs pertaining to such Government Agency shall cease to be effective."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Public comments",
      "content": "The laws and RLCOs entered on the Registry shall be made accessible\nto the public for a period of not less than thirty days, inviting comments in the manner specified on the\nRegistry, and public awareness in this regard shall be ensured by publicity through electronic, digital\nand print media."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Review by Government Agencies",
      "content": "On expiry of the period referred to in section 10, and\nwithin such time as the Unit may determine, each Government Agency shall review the laws and\nRLCOs relating to it in terms of the parameters stated in section 8 and submit to the Unit, proposals\nregarding retention, with or without amendment, or repeal of such laws and RLCOs."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Review by the Asaan Karobar Technical Unit",
      "content": "(1) The Unit shall review the laws,\nRLCOs, and proposals entered or submitted under sections 9, 10 and 11 and make a determination as\nto retention of a law or RLCO without change, amendment or repeal.\n(2) The laws and RLCOs approved by the Unit to be retained shall continue to be in force.\n(3) The laws and RLCOs approved by the Unit for amendment or repeal shall be transmitted\nby the Head of the Unit to the Secretary for submission to the Cabinet Committee."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Decision by Cabinet",
      "content": "(1) The proposals relating to laws and RLCOs shall be considered\nby the Cabinet Committee.\n(2) A Minister-in-charge in respect of whose ministry or division reform has been proposed by\nthe Unit and who holds a position opposed to such reform or any part thereof shall be invited to justify\nhis position before the Cabinet Committee.\n(3) The Cabinet Committee shall consider the proposed reform and the opposition by a\nMinister-in-charge, if any, and proceed to take a decision in such terms as it may deem fit and transmit\nthe same to the Cabinet for ratification."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Repeal and amendment of laws and RLCOs",
      "content": "(1) The proposals for amendment to or\nrepeal of laws ratified by the Cabinet under sub-section (3) of section 13 shall be transmitted to the\nMajlis-e-Shoora (Parliament) for legislation.\n(2) Notwithstanding anything contained in any other law, amendments to or repeal of RLCOs\nas ratified by the Cabinet under sub-section (3) of section 13 shall he notified in the official Gazette\nand shall come into force upon such notification."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Phases of Regulatory Reform",
      "content": "(1) The process of regulatory reform under sections 9, 10,\n11, 12, 13 and 14 may be carried out in phases, and proposals for amendment or repeal made by the\nUnit under sub-section (3) of section 12 may be submitted to the Cabinet Committee separately or in\nthe form of a single summary.\n(2) The Unit shall ensure that all laws and RLCOs in force appear on the Registry and that the\nRegistry is kept updated and accessible to the general public until such time that its control is\ntransferred under sub-section (3).\n(3) The control and management of the Registry shall be transferred to such Ministry or\nDivision of the Federal Government as and when the Unit may specify, whereafter such Ministry or\nDivision shall ensure that, within such time as may be specified by the Federal Government, the\nRegistry becomes a complete and updated code of all laws and RLCOs in force in Pakistan.\n(4) The Federal Government may determine the date, after which, a Government Agency shall\nsubmit to the Unit in continuum, proposals for amendment to or promulgation of a new law or RLCO\nfor its review in terms of the parameters stated in section 8 before being submitted to the Cabinet or to\nthe authority competent to issue, amend or rescind the same."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Pakistan Business Portal",
      "content": "(1) Not later than two years from the coming into force of this\nAct, the Federal Government shall, by notification in the Official Gazette, establish an online portal to\nbe known as the Pakistan Business Portal to be operated and maintained by the BOI.\n(2) The Portal shall provide a one window facility for access to information regarding\nregulatory requirements and shall also facilitate compliance with the said requirements and matters\nancillary thereto.\n(3) Without prejudice to the generality of the preceding sub-section, the Portal shall:__\n(a)     provide necessary facilities to enable submission and processing of applications or\ndocuments for registrations, licenses, certificates, permits, approvals and permissions;\n(b)     provide mechanisms for online payment of fees, duties, levies, taxes and other charges\nand issuance of receipts thereof;\n(c)     issue online registrations, licenses, certificates, permits, approvals and permissions; and\n(d)     provide any other service ancillary to the above or that may be prescribed.\n(4) The Portal shall be the country’s only one window facility and all other such facilities,\nhowever established, shall be integrated with the Portal within a period to be notified by the Federal\nGovernment:\nProvided that a one window created by a Province may be integrated with the Portal subject to\nthe concurrence of the concerned Provincial Government.\n(5) Any electronic exchange of information, declaration, document or record, transaction,\naccounts, offer or acceptance of an offer, notice, order, payment, authentication, authorization or\ninformation required, delivered or provided, by any person, or by an authorized officer of a\nGovernment Agency, organization or department shall be deemed to have been required, delivered or\nprovided, in accordance with law when communicated electronically through the Portal or its allied\nsystems and shall be admissible as evidence in any court, tribunal, judicial or quasi-judicial body or\ncommission of inquiry.\n(6) The Federal Government may prescribe the mode and manner in which a Government\nAgency may require documents, records or transmissions from the Portal for any purpose including\naudit, and be allowed access to its premises, computer system or any other systems where data may be\nstored, recorded or retained.\n(7) Any law requiring documents to be created, retained, notarized, duplicated, submitted,\ndelivered, authenticated, authorized, transmitted, received, stored, processed, approved or evidenced\nshall be deemed to have been complied with if such documents are available and retrievable in\nelectronic form from the Portal.\n(8) The provisions of the Electronic Transactions Ordinance, 2002 (LI of 2002) and the\nPrevention of Electronic Crimes Act, 2016 (XL of 2016), to the extent not inconsistent with the\nprovisions of this Act, shall, mutatis mutandis, apply to electronic submission of documents, data\nretention or storage, copyrights, legal recognition and presumption, certification, notarization,\nregistration, offences and other matters, in as much as they relate to the object of, and operations under\nthis Act.\n(9) An authorization or approval required to be given or issued under any law in respect to any\nmatter to which this Act relates, when issued electronically through the Portal, shall be deemed to have\nbeen lawfully issued.\n(10) All Government Agencies shall work in aid of the BOI for the purposes of establishing\nthe Portal and its functioning.\n(11) The BOI shall prescribe fees and charges for services provided through the Portal."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Source of funds",
      "content": "(1) The Federal Government shall provide financial resources and funds\nfor carrying out the purposes of this Act including the establishment, functioning, and expansion of\nthe Unit, Registry and the Portal.\n(2) The BOI and the Unit may also apply for and arrange funds for carrying out the purposes\nof this Act through the following sources:\n(a)     grants and borrowing of money;\n(b)     sums or property which may become payable to or vest in them in respect of any matter\nincidental to the exercise of their powers and the performance of their functions;\n(c)     income generated from levy of fees and service charges under this Act;\n(d)     income generated from investments, sale of products and services; and\n(e)     any other source, approved by the Federal Government."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Budget and accounts",
      "content": "(1) In respect of each financial year, by such date as may be\nspecified by the Finance Division, the BOI and the Unit shall submit, through the said Division, for\napproval of the Federal Government, a statement showing their estimated receipts and expenditure,\nrespectively, and the sums that are likely to be required from the Federal Government during the next\nfinancial year, and the accounts of the BOI and the Unit shall be kept in such form and in accordance\nwith such principles and methods as may be determined by the Auditor-General of Pakistan.\n(2) Subject to the Public Finance Management Act, 2019, the BOI and the Unit may open\naccounts with the State Bank of Pakistan or with any scheduled bank in Pakistan for carrying out the\npurposes of this Act.\n(3) Audit of all accounts under this Act shall be conducted at the close of each financial year\nby the Auditor-General of Pakistan."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Assistance",
      "content": "All Government Agencies shall provide aid and assistance to the BOI and the\nUnit for achieving the objects of this Act."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Prohibition of publication or disclosure of information to unauthorized persons",
      "content": "(1)\nNo person shall, without the consent of the Secretary or other than in the course of their duties under\nthis Act, publish or disclose to an unauthorized person, the contents of any document or\ncommunication or any other information that relates to any matter under this Act whether or not the\nsame has come to that person’s knowledge in the course of his duties under this Act.\n(2) Any person who contravenes the provisions of sub-section (1) shall be liable to pay fine,\nnot exceeding three hundred thousand Rupees and such other penalties as may be prescribed, including\ntermination of appointment."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Schedule",
      "content": "(1) There shall be a schedule to this Act containing a list of Government\nAgencies, other entities and subjects exempted from the provisions of this Act relating to regulatory\nreform under section 4.\n(2) The Federal Government may, by notification in the Official Gazette, amend the Schedule\nby adding, omitting, amending or substituting entries thereof."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Indemnity",
      "content": "No suit, prosecution or other legal proceedings shall lie against any person for\nanything done or intended to be done in his official capacity and in good faith under this Act or the\nrules, notifications, instructions or directions made or issued thereunder."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Power to make rules",
      "content": "The Federal Government may, by notification in the official\nGazette, make rules for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Power to make regulations",
      "content": "Subject to the provisions of this Act and the Rules made\nhereunder, the Secretary may, by notification in the Official Gazette, make regulations for performance\nof functions by the Unit under this Act."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Removal of difficulties",
      "content": "If a difficulty arises in giving effect to a provision of this Act,\nis not inconsistent with the provisions of this Act and as it considers necessary for removal of the\ndifficulty.\n[see sections 4(g) and 21(1&2)]\n_______\nRGN Date: 12-12-2025"
    }
  ],
  "definitions": [
    {
      "term": "BOI",
      "definition": "the Board of Investment established under the Board of Investment Ordinance, 2001 (XV of 2001);",
      "source_provision": "sec2"
    },
    {
      "term": "burden",
      "definition": "any or all of the following:__ (i) financial costs, including compliance, time, and administrative costs; or (ii) requirements, processes and procedures determined through the final decision of the Cabinet under section 13, as causing administrative inconvenience, uncertainty, delays and adversely affecting consumer choice, efficiency, productivity and profitability.",
      "source_provision": "sec2"
    },
    {
      "term": "business",
      "definition": "any lawful enterprise, trade, whether or not incorporated or registered;",
      "source_provision": "sec2"
    },
    {
      "term": "Cabinet Committee",
      "definition": "the Cabinet Committee on Regulatory Reforms (CCoRR) constituted by the Prime Minister through Notification No. F.5/24/2024- Com. dated the 18th September, 2024 or any other cabinet committee designated by the Prime Minister to perform functions under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "electronic document",
      "definition": "documents, records, information. communication, payments, or transactions in electronic form;",
      "source_provision": "sec2"
    },
    {
      "term": "Portal",
      "definition": "the Pakistan Business Portal established under section16;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules or regulations, as the case may be, made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Registry",
      "definition": "the Pakistan Regulatory Registry established under section 7;",
      "source_provision": "sec2"
    },
    {
      "term": "Schedule",
      "definition": "Schedule to this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Secretary",
      "definition": "the Secretary of the Board of Investment;",
      "source_provision": "sec2"
    },
    {
      "term": "System",
      "definition": "an electronic system for creating, generating, sending, receiving, storing, reproducing, displaying, recording or processing information; and",
      "source_provision": "sec2"
    },
    {
      "term": "Unit",
      "definition": "the Asaan Karobar Technical Unit established under section 5.",
      "source_provision": "sec2"
    }
  ]
}
