{
  "id": "pk-associated-cement-vesting-act-1974",
  "type": "statute",
  "title": "Associated Cement (Vesting) Act, 1974",
  "title_en": "Associated Cement (Vesting) Act, 1974",
  "short_name": "ACA",
  "status": "in_force",
  "issued_date": "1975-01-12",
  "in_force_date": "1975-01-12",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2Fx-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Associated Cement (Vesting) Act, 1974 (VII of 1975) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "_(1) This Act may be called the Associated Cement\n(Vesting) Act, 1974.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,___\n(a)        “Associated Cement” means the undertakings known as Associated Cement\nwhich immediately before the commencing day vested in the Federal\nGovernment, together with all lands, buildings, machinery, appliances, fixtures\nand funds appertaining thereto;\n(b)        “commencing day” means the day on which this Act comes into force; and\n(c)        “Corporation” means the State Cement Corporation of Pakistan Limited\nformed and registered under the Companies Act, 1913 (VII of 1913)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Vesting of Associated Cement in Corporation",
      "content": "As from the commencing day,—\n(a)        the Associated Cement shall vest in the Corporation and all powers which\nimmediately before that day were exerciseable by the Federal Government in\nrelation to the Associated Cement shall be exerciseable by the Corporation ;\n(b)        all rights, properties, assets, liabilities, debts and obligations of the Federal\nGovernment relating to the Associated Cement shall be the rights, properties,\nassets, liabilities, debts and obligations of the Corporation;\n(c)        any contract made, or deemed to have been made, on behalf of the President\nfor the purposes of the Associated Cement shall be deemed to have been\nmade on behalf of the Corporation;\n(d)        all suits and other legal proceedings in relation to the Associated Cement\ninstituted, or deemed to have been instituted, by or against the Federal\nGovernment shall be deemed to be suits and proceedings instituted by or\nagainst the Corporation and may be proceeded with accordingly ; and\n1\nFor Statement of Objects and Reasons, see Gaz. of P., 1974, Ext., Pt.III, p.1357.\n(e)     all orders and instructions issued by the President or the Federal Government\nbefore the commencing day in relation to the Associated Cement shall, to the\nextent they are not inconsistent with the provisions of this Act, be deemed to\nbe orders and instructions issued by the Corporation."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Continuance in service of employees, etc",
      "content": "_ (1) Every officer and employee\nemployed for the purposes of the Associated Cement shall, on the commencing day, become an\nofficer or employee, as the case may be, of the Corporation and shall hold office therein on such\nterms and conditions, which are not less favourable than those to which he was entitled immediately\nbefore the commencing day, as the Corporation may determine:\nProvided that an officer or employee of the Corporation shall, unless his services are earlier\nterminated in accordance with the terms and conditions applicable to him, retire from service on the\ncompletion of the fifty-eighth year of his age.\n(2) Any officer or employee who becomes an officer or employee of the Corporation under\nsub-section (1) may be transferred—\n(a)     by the Corporation, to any company or project set up by it, or\n(b)     by the Federal Government, to any other corporation, company or industrial\nunit controlled by it,\nand shall hold office therein on terms and conditions which are not less favourable than those to\nwhich he was entitled immediately before such transfer.\n(3) Any officer or employee who becomes an officer or employee of the Corporation under\nsub-section (1), or is transferred under sub-section (2), shall not be entitled to any compensation or to\nthe designation which he was holding immediately before the commencing day or, as the case may\nbe, the date of such transfer, and no claim for such compensation or designation shall be entertained\nby any court, tribunal or other authority.\n(4) If any question arises as to whether any person was, immediately before the commencing\nday, an officer or employee employed for the purposes of the Associated Cement, the question shall\nbe referred to the Federal Government whose decision shall be final."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Administration, etc., of the Associated Cement",
      "content": "_ (1) The Corporation shall, subject to\ndispose of the Associated Cement in such manner as it deems fit.\n(2) In particular and without prejudice to the generality of the foregoing provision, the\nCorporation may, with the approval of the Federal Government, transfer the management of the\nAssociated Cement to one or more companies sponsored by the Corporation and registered under the\nCompanies Act, 1913 (VII of 1913)."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Provident Fund",
      "content": "_ (1) Notwithstanding anything contained in the rules relating to the\nProvident Fund of the Staff of the Associated Cement and the Provident Fund of the Workers of\nAssociated Cement, the accumulated balance standing to the credit of every officer or employee\nreferred to in sub-section (1) of section 4 in either of those Funds immediately before the\ncommencing day shall be paid to the Corporation.\n(2) An officer or employee referred to in sub-section (1) of section 4 shall be deemed to have\nbecome as from the commencing day a member of the Provident Fund established, by the\nCorporation and, in the records of such Provident Fund, a separate account shall be opened for such\nofficer or employee and be credited with the amount of the accumulated balance standing to the\ncredit of such officer or employee in the Provident Fund of the Staff of the Associated Cement or, as\nthe case may be, the Provident Fund of the Workers of the Associated Cement immediately before\nthe commencing day.\n(3) Where the services of any officer or employee referred to in sub-section (1) of section 4\nare transferred to any other corporation or company, the accumulated balance standing to the credit\nof every such officer or employee in the Provident Fund of the Corporation immediately before such\ntransfer shall be paid to such other corporation or company and, in the records of the Provident Fund\nof the corporation or company, a separate account shall be opened for such officer or employee and\nbe credited with the amount of the accumulated balance standing to his credit in the Provident Fund\nof the Corporation immediately before such transfer."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Investment by the Federal Government",
      "content": "_ (1) The investment made by the Federal\nGovernment in the Associated Cement before the commencing day shall be deemed to be the\nFederal Government's equity in the Corporation:\nProvided that the loans advanced for the expansion of the factories of the Associated Cement\nand the interest thereon shall be repayable by the Corporation.\n(2) The amount of equity referred to in sub-section (1) shall be determined by the\nFederal Government in consultation with the Corporation."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Indemnity",
      "content": "No suit, prosecution or other legal proceeding shall lie against the Federal\nGovernment, the Corporation or any other person for anything in good faith done or intended or\npurported to be done under this Act."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Bar of jurisdiction",
      "content": "_ (1) No court shall call in question, or permit to be called in\nquestion any provision of this Act, or of any rule or order made or anything done or any action\ntaken or purporting to be made, done or taken thereunder.\n(2) No court shall grant any injunction, make any order or entertain any proceedings in\nrelation to anything done or intended or purporting to be done under this Act."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Power to make rules",
      "content": "The Federal Government may, by notification in the official\nGazette, make such rules as appear to it to be necessary or expedient for carrying out the purposes of\nthis Act."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to any provision of\nthis Act, the Federal Government may make such order or issue such directive, not inconsistent with\nremoving the difficulty:\nProvided that no such order shall be made after the expiry of one year from the commencing\nday."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. [Repeal]",
      "content": "Omitted by the Federal Laws (Revision and Declaration) Ordinance,\n1981 (XXVII of 1981),s.3 and Sch.,II.\n______________      Uploaded on 26.12.2023"
    }
  ],
  "definitions": [
    {
      "term": "Associated Cement",
      "definition": "the undertakings known as Associated Cement which immediately before the commencing day vested in the Federal Government, together with all lands, buildings, machinery, appliances, fixtures and funds appertaining thereto;",
      "source_provision": "sec2"
    },
    {
      "term": "commencing day",
      "definition": "the day on which this Act comes into force; and",
      "source_provision": "sec2"
    },
    {
      "term": "Corporation",
      "definition": "the State Cement Corporation of Pakistan Limited formed and registered under the Companies Act, 1913 (VII of 1913).",
      "source_provision": "sec2"
    }
  ]
}
