{
  "id": "pk-associated-press-of-pakistan-corporation-ordinance-2002",
  "type": "statute",
  "title": "Associated Press of Pakistan Corporation Ordinance, 2002",
  "title_en": "Associated Press of Pakistan Corporation Ordinance, 2002",
  "short_name": "APOPC",
  "status": "in_force",
  "issued_date": "2002-10-18",
  "in_force_date": "2002-10-18",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Jvb5Y%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Associated Press of Pakistan Corporation Ordinance, 2002 (LXXX of 2002) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Removal of difficult",
      "content": "ORDINANCE, 2002\nORDINANCE LXXX OF 2002\n[19th October, 2002]\nAn Ordinance to provide for reconstitution of the Asociated Press of Pakistan\nWHEREAS it is expedient to ensure effective operation and to streamline, improve, and\nenlarge Associated Press of Pakistan as a public information medium;\nAND WHEREAS it is expedient to take steps for adding greater professionalism to the\nAssociated Press of Pakistan and make its management more broad based allowing its\nprofessionalism independence autonomy with a view to enabling it to obtain from international news\nagencies services and create greater trust of its secrecy and credibility amongst people, and for\nmatters connected thereto or incidental thereof;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary to\ntake immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the Fourteenth day of\nOctober, 1999, the Provisional Constitution Order No. 1 of 1999, read with the Provisional\nConstitution (Amendment) Order No. 9 of 1999, and in exercise of all powers enabling him in that\nbehalf the President of the Islamic Republic of Pakistan is pleased to make and promulgate the\nfollowing Ordinance:―"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "_(1) This Ordinance may be called the Associated Press\nof Pakistan Corporation Ordinance, 2002;\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.― In this Ordinance, unless there is anything repugnant in the subject or",
      "content": "context,―\n(a)     “Board” means the Board of Directors of the Corporation;\n(b)     “Bureau” means any news receiving or transmitting unit so designated by the\ncorporation;\n(c)     “Chairman” means the Chairman of the Board;\n(d)     “Corporation” means the Associated Press of Pakistan Corporation established\nunder section 3;\n(e)     “Federal Government” means the Ministry of Information and Media\nDevelopment;\n(f)     “Managing Director” means the Managing Director of the Corporation;\n(g)    “member” means member of the Board;\n(h)    “prescribed” means prescribed by rules or regulations made under this\nOrdinance;\n(i)    “regulations” means regulations made under this Ordinance:\n(j)    “rules” means rules made under this Ordinance; and\n(k)    “subscriber” means a person or body whether private or public receiving\nservices from the Corporation;"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Corporation",
      "content": "_ The Associated Press of Pakistan as reconstituted in\naccordance with the provisions of this Ordinance shall be a corporation to be called the Associated\nPress of Pakistan Corporation which shall be a body corporate having perpetual succession and a\ncommon seal with powers to acquire, hold and dispose of property both movable and immovable and\nshall by the said name sue and be sued."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Headquarters of the Corporation",
      "content": "_ The headquarters of the corporation shall be at\nIslamabad and the corporation may establish its Bureaus or constitute its Stations at such places, both\nwithin and abroad as the Board may, with the approval of the Federal Government, decide."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Functions of the Corporation",
      "content": "_ The functions of the Corporation shall be to―\n(a)    undertake the work of a news agency or news agencies in any part of the\nworld and in particular to collect, transmit, circulate in Pakistan and abroad\nsuch news, features, photographs, videos or any such material, for distribution\nto such person or corporations, newspapers or organizations desirous of\nobtaining such news and material or any part thereof on such terms and\nconditions as the Board may, from time to time determine;\n(b)    carry on all or any of the activities which help in news gathering and its\ndissemination through print, cyber-net, audio, video, still and any other\nmethods of photography required for this purpose;\n(c)    enter into any arrangements and to take all necessary or proper step, with\nGovernments or with other authorities, persons, bodies, of organizations,\ninternational, national, local, municipal or otherwise of any place in which the\nCorporation may have interests and to carry on any negotiations or operations\nfor the purpose of directly or indirectly carrying out its objects affecting any\nmodification in its functioning;\n(d)    advance, deposit or land money, acquire securities and property or receive\nloans, grantsin-aid, subsidy, subscription fee, assistance or deposits from the\nGovernment and other authorities or bodies or organizations;\n(e)    invest any moneys of the corporation not for the time being required for any of\nthe purposes of the Corporation in such investments (other than shares or\nstock) as may be in the interest of the Corporation;\n(f)    establish, provide, maintain and conduct research and training activities for the\ntraining, education and instruction of employees, students and others who may\ndesire to avail themselves of the same;\n(g)    compile, prepare, produce, print, publish, issue, circulate and distribute, with\nor without charge such papers, magazines, periodicals, books, circulars and\nother such matter as may be conducive to tiny of the functions of the\nCorporation;\n(h)    carry out instructions of the Federal Government with regard to general\npattern of policies in respect of announcements, news and views to be\ndisseminated from time to time;\n(i)    sign agreements with international news agencies, national news agencies of\nother countries for securing and disseminating the same to end-users in and\noutside Pakistan; and\n(j)    sell news, features, photos, audios and videos to mass media, news agencies\nand any other organization within and outside Pakistan."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Management of the Corporation",
      "content": "_(1) The General directions and administration of the\naffairs of the corporation shall vest in the Board which may exercise all powers and do all acts and\nthings which may be exercised or done by the Corporation.\n(2) In discharge of its functions the Corporation shall be bound by such directives and order,\nif any, as may be given to it on any question of policy by the Federal Government which shall be the\nsole Judge as to whether a question is a question of policy."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Constitution of the Board",
      "content": "_(1) The Board shall consist of eleven members including the\nChairman, consisting of___\n(a)    Secretary, Ministry of                                               Chairman\nInformation and Media Development.\n(b)    Managing Director; Associated                                Member ex-officio\nPress of Pakistan Corporation.\n(c)    Managing Director P.T. V. Corporation                        Member ex-officio\n(d)    Director General, Pakistan Broadcasting Corporation          Member ex-officio\n(e)    Principal Information Officer,                               Member ex-officio\nPress Information Department,\nGovernment of Pakistan\n(f)    the President, Council of Pakistan                           Member ex-officio\nNewspaper's Editors (CPNE).\n(g)    the Financial Adviser, Ministry of                           Member ex-officio\nInformation and Media Development\n(h)    the Chairman, Department of Mass                            Member ex-officio\nCommunication, Karachi University, Punjab ; and\n(i)    the Chairman, Department of Mass Communication,             Member ex-officio\nUniversity of Karachi, and\n(j)    two renowned media persons from private sector to be                Members\nMembers nominated by the Federal Government\n(2) A member, other than the Financial Adviser, shall be a person with adequate experience\nin the field of information and mass communication."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Terms or office or the Chairman and members",
      "content": "_(1)Save as otherwise provided a\nmember shall hold office during the pleasure of the President.\n(2). An ex-officio member shall hold office as member till such time he holds the office by\nvirtue of which he is a member and upon his transfer therefrom or retirement, resignation or removal\nfrom office, the person appointed in such member's place shall be the member.\n(3). The Chairman, and other ex-officio members shad serve on the Board in honorary\ncapacity but shall be entitled to travelling allowance and other such expenses when engaged on\nbusiness of the Board as may be prescribed.\n(4). The members from the private sector shall be entitled to such terms and condition as the\nFederal Government may determine."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Meeting of the Board",
      "content": "_(1) The Board shall meet at such time and such place as the\nChairman may decide:\nProvided that not less than three meetings of the Board shall be held in a year including one\nmandatory meeting to be held in the month of December each year.\n(2) To constitute a quorum at the meeting of the Board not less than six members including\nthe Chairman shall be present.\n(3) The Chairman and in his absence, any member so authorized by him, shall preside at the\nmeeting of the Board.\n(4) All matters or agenda to be taken up at the meeting of the Board shall be decided by the\nChairman subject to the condition that any matter not borne on the agenda of a meeting may be taken\nup if the majority of the members present in the meeting so decide.\n(5) All questions at the meeting of the Board shall be decided by majority vote and in case of\nequality of votes the person presiding shall have a casting vote."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Managing Director",
      "content": "_ There shall be a Managing Director of the Corporation who shall\nbe appointed by the Federal Government on such terms and conditions as the Federal Government\nmay determine."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Recruitment of officers etc",
      "content": "_ (1) The Corporation may, from time to time, appoint such\nofficers and servants as it may consider necessary for performance of its functions.\n(2) The Corporation shall prescribe by regulations the procedure for appointment of its\nofficers and employees and the terms and conditions of their service."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Members, officers etc. to be public servants.― The Chairman, Members, the Managing",
      "content": "Director and other officers and servants of the Corporation shall, when acting or purporting to act in\npursuance of any of the provisions of this Ordinance or the rules or regulations made thereunder, be\ndeemed to be public servant within the meaning of section 21 of the Pakistan Penal Code (Act XLV\nof 1860)."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Transfer of officers, servants etc., to the Corporation",
      "content": "_(1) Notwithstanding anything\ncontained in any law, contract or agreement or in the conditions of service, every officer, servant or\nemployee of the Associated Press of Pakistan existing immediately before the establishment of the\nCorporation shall, on such establishment, stand transferred to, and became an employee of the\nCorporation on such terms and conditions as may be prescribed by regulations:\nProvided that the pay and allowances to which an officer and servant of the Corporation shall\nbe entitled shall not be less favorable than those to which he was entitled immediately before such\ntransfer.\n(2) No person who stands transferred to, the Corporation by virtue of sub-section (1) shall,\nnotwithstanding anything contained in any law, contract or agreement, be entitled to any\ncompensation because of such transfer."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Budget",
      "content": "_ The Corporation shall, in respect of each financial year, submit for the\napproval of the Federal Government by such date and in such form as may be specified by the\nFederal Government a statement showing the estimated receipts for current and development\nexpenditure and the sums which are likely to be required from the Federal Government during the\nnext financial year."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Maintenance of Accounts",
      "content": "_ The accounts of the Corporation shall be maintained in\nsuch form and manner as the Federal Government may, in consultation with the Controller-General\nof Accounts, determined."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Audit",
      "content": "_(1) The accounts of the Corporation shall be audited by an Auditor appointed by\nthe Corporation who is a Chartered Accountant within the meanings of the Chartered Accountants\nOrdinance, 1961 (X of 1961) to be appointed by the Board with the prior approval of the Federal\nGovernment:\nProvided that the Auditor-General of Pakistan shall have the power to audit or cause to be\naudited the accounts of the Corporation.\n(2) Copies of the audit report shall be placed before the Board for approval and the report\nshall be made available for public inspection.\n(3) Copies of the audit report, together with the report of the Board thereon shall be submitted\nto the Federal Government within six months of the close of every financial year by the Corporation."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Associated Press of Pakistan Corporation Fund",
      "content": "_ (1) There shall be a fund to be\nknown as the “Associated Press of Pakistan Corporation Fund” which shall vest in the Corporation\nand shall be utilized by the Corporation to meet charges in connection with its functions under this\nOrdinance including payment of salaries and other remuneration to the Managing Director,\nnon-official Members, officers and employees of the Corporation.\n(2) The Associated Press of Pakistan Corporation Fund shall consist of:―\n(a)    grants made by the Federal Government;\n(b)    loans obtained from the banks and other financial institutions as may be\napproved by the Federal Government;\n(c)    subscription fee from the subscribers of the Associated Press of Pakistan;\n(d)    sale proceeds, royalties of the newspapers items, features, photos, cyber-nets,\naudios, videos etc.;\n(e)    gifts, endowment, grants and other contributions from philanthropists,\nagencies, foundations or organizations; and\n(f)    other sums received from other sources approved by the Board."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Delegation of powers",
      "content": "_ The Board may, from time to time, by general or special order,\ndelegate to the Managing Director or any other Member or an officer of the Corporation any of its\npowers, duties or functions under this Ordinance, subject to such conditions as it may think fit to\nimpose."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Indemnity",
      "content": "_ No suit or other legal proceedings shall be against the Corporation, the\nManaging Director, or any Member, officer or employee of the Corporation in respect of anything\ndone or intended to be done in good faith under this Ordinance."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Winding up of the Corporation",
      "content": "_No provision of law relating to winding up of bodies\ncorporate shall apply to the Corporation and the Corporation shall not be wound up except by the\norder of the Federal Government in such manner as the Federal Government may determine."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Power to make rules",
      "content": "_ The Federal Government may, by notification in the official\nGazette, make rules for carrying out the purposes of this Ordinance."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Power to make regulations",
      "content": "_ The Corporation may, by notification in the official\nGazette, make regulation not inconsistent with this Ordinance and the rules made thereunder to\nprovide for all matters for which provision is necessary or expedient for carrying out the purposes of\nthis Ordinance."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Repeal and savings",
      "content": "_(1) The Associated Press of Pakistan (Taking over) Ordinance,\n1961 (XX of 1961) is hereby repealed.\n(2) Upon the commencement of this Ordinance―\n(a)    all funds, properties, rights and interests of whatsoever kind issued and used,\nenjoyed possessed, owned or vested in the Associated Press of Pakistan in\nexistence immediately before such commencement and all liabilities, legally\nsubsisting against the said APP shall pass to the Corporation as established\nunder this Ordinance;\n(b)    everything done, action taken, obligation or liabilities incurred, rights and\nassets acquired, persons appointed, or authorised jurisdiction or power\nconferred, endowment, bequests, funds or trust created, donations or grants\nmade or issued under any provision of the repealed Ordinance, rule or\nregulations, applicable to the said APP shall remain in force and be continued\nand, be deemed to have been respectively done, taken, incurred, appointed,\nauthorized, conferred, created, made, or issued under this Ordinance and\nreference to any document to any provision of the said Ordinance or rules or\nregulations made thereunder shall, so far as may be deemed to be reference to\nmade or deemed to have been made thereunder;\n(c)    any rule or regulation made under the repealed Ordinance shall, in so far as\nthey are not inconsistent with the provisions of this Ordinance or the rules or\nregulations made thereunder having recourse to the various matter which by\nthis Ordinance have to be regulated or prescribe by rules or regulations\nrespectively shall continue be in force until they are repealed, replaced,\nrescinded or modified in accordance with the provision of this Ordinance; and\n(d)    all contracts and working arrangements made and incurred by the APP before\nthe establishment of the Corporation and having effect accordingly."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Board of Directors of the Corporation;",
      "source_provision": "sec2"
    },
    {
      "term": "Bureau",
      "definition": "any news receiving or transmitting unit so designated by the corporation;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "Corporation",
      "definition": "the Associated Press of Pakistan Corporation established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Federal Government",
      "definition": "the Ministry of Information and Media Development;",
      "source_provision": "sec2"
    },
    {
      "term": "Managing Director",
      "definition": "the Managing Director of the Corporation;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "member of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules or regulations made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Ordinance:",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Ordinance; and",
      "source_provision": "sec2"
    },
    {
      "term": "subscriber",
      "definition": "a person or body whether private or public receiving services from the Corporation;",
      "source_provision": "sec2"
    }
  ]
}
