{
  "id": "pk-banks-nationalization-act-1974",
  "type": "statute",
  "title": "Banks (Nationalization) Act, 1974",
  "title_en": "Banks (Nationalization) Act, 1974",
  "short_name": "Banks (Nationalization) Act, 1974",
  "status": "in_force",
  "issued_date": "1974-03-03",
  "in_force_date": "1974-03-03",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npaplp-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Banks (Nationalization) Act, 1974 (XIX of 1974) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Banks\n(Nationalization) Act, 1974.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once and shall be deemed to have taken effect on the\n1st day of January, 1974."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Act to override other laws. This Act shall have effect notwithstanding anything",
      "content": "contained in any other law for the time being in force or in any agreement, contract, award,\nmemorandum or articles of association or other instrument."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Definitions. In this Act, unless there is anything repugnant in the subject or",
      "content": "context,—\n(1) “bank” means—\n(a)         a company registered under the Companies Act, 1913 (VII of 1913.) and\ntransacting, in or outside Pakistan, the business of banking as\ndefined in clause (b) of section 5 of the Banking Companies Ordinance,\n1962 (LVII of 1962.) in respect of which no proceedings under Part III\nor Part IV of the said Ordinance have been taken or are pending\nimmediately before the commencing day; and\n(b)         a banking company incorporated by or under any law within the\nlegislative competence of parliament, including the State Bank, the\nNational Bank of Pakistan, the Industrial Development Bank of Pakistan\nand the Agricultural Development Bank of Pakistan, but does not\ninclude—\n(i)        a bank which is an enemy firm within the meaning of the\nDefence of Pakistan Rules, or\n(ii)       a banking company incorporated outside Pakistan and transacting\nbanking business in Pakistan, or\n1\nFor Statement of Objects and Reasons, see Gaz. of P., 1974, Ext., Pt. III, P. 79.\n(iii)      a cooperative bank registered under the Cooperative Societies\nAct, 1925 (VII of 1925.) or any other law for the time being in\nforce relating to cooperative societies, not being a cooperative\nbank which is a scheduled bank, or\n(iv)       a Government Savings Bank to which the Government Savings\nBank Act, 1873 (V of 1873.) applies, or\n(v)        a corporation or company owned or controlled by a Province and\ncarrying on banking business only within that Province 1[,or]\n2\n[(vi) a corporation or company established in Pakistan in pursuance of\nan agreement between the Government of Pakistan and a foreign\nGovernment or institution for transacting banking business in or\noutside Pakistan;]\n3\n[(1A) “Board” means Board of Directors constituted under this Act;]\n(2) “commencing day” means the 1st day of January, 1974;\n4\n[(3) *          *          *         *          *            *       *\n(4) *               *          *         *          *            *       *]\n5\n[(4A) “loans and advances” means “loans, advances and credit” as defined in the\nBanking Companies Ordinance, 1962 (LVII of 1962.);]\n(5) “prescribed” means prescribed by rules made under this Act;\n(6) “State Bank” means the State Bank of Pakistan established under the State Bank of\nPakistan Act, 1956 (XXXIII of 1956); and\n(7) other words and expressions used but not defined in this Act shall have the same\nmeaning as in the Banking Companies Ordinance, 1962 (LVII of 1962)."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Punishment for contravention of section 3, etc. [Exclusive right to establish bank]",
      "content": "omitted by the Banks (Nationalization) (Amdt.) Act 1997, (XVIII of 1997) s. 3.]"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Transfer and vesting of ownership, etc. of banks",
      "content": "(1)The ownership,\nmanagement and control of all banks shall stand transferred to, and vest in, the Federal\nGovernment on the commencing day.\n(2) All shares in the capital of a bank held by persons other than the Federal\nGovernment, a Provincial Government, a corporation owned or controlled by the Federal\nGovernment or the State Bank shall stand transferred to, and vest in, the Federal Government\non the Commencing day, free of all trusts, liabilities and encumbrances.\n1\nSubs. by the Banks (Nationalization) (Amdt.) Ordinance, 1977 (46 of 1977), s. 2, for full-stop.\n2\nNew sub-clause (vi) added ibid.,\n3\nIns. by the Banks (Nationalization) (Third Amdt.) Act, 1991 (15 of 1991), s. 2 (w.e.f. 30-6-1990).\n4\nSub-sections (3) and (4) omitted by the Banks (Nationalization) (Amdt.) Act 1997, (18 of 1997) s. 2, which was previously\namended byAct (15 of 1991), s. 2.\n5\nIns. by the Banks (Nationalization) (Amdt.) Ordinance, 1980 (59 of 1980), s. 2.\n1\n[(2A) If any bank issues any additional share capital after the commencing day,\nthen, without prejudice to the provisions of sub-section (1), a Provincial Government, a\ncorporation owned or controlled by the Federal Government and the State Bank may contribute\nto the share capital so issued.]\n(3) The vesting of any shares in the Federal Government under sub-section (2) shall not\neffect the rights inter se of a shareholder and any other person who may have an interest in such\nshares and such other person shall be entitled to enforce his interest against the compensation\nawarded to the shareholder under section 6.\n(4) The safety of all deposits in banks shall stand guaranteed by the Federal\nGovernment.\n(5) The provisions of this Act and the vesting of the shares of the banks in the\nFederal Government thereunder shall not in any way affect the status of the banks as bodies\ncorporate under the Companies Act, 1913 (VII of 1913).\n2\n[(6) The Federal Government or a corporation owned or controlled by the Federal\nGovernment may, from time to time, sell all or any of its shares in the capital of a bank,\nother than the State Bank, to such persons, and on such terms and conditions, as it may\ndetermine] 3[;and]\n3\n[(a)    where 4[upto forty-nine] of the shares in the capital of a bank are so sold,\nto such bank shall stand suspended for such period, and on such terms, as\nthe Federal Government may, by notification in the official Gazette,\nspecify; and\n(b)         where not less than fifty-one per cent of the shares are so sold, the\nprovisions of this Act shall cease to apply to such bank.].\n5\n[5A. Sale of shares. —(1) Notwithstanding anything contained in this Act or any other\nlaw for the time being in force, the Federal Government or a corporation owned or controlled\nby the Federal Government may, from time to time sell all or any of its shares in the capital of\na bank and transfer management and control of a bank other than the State Bank, to such\npersons, and on such terms and conditions, as the Federal Government may determine; and\n(a)         where 4[upto forty-nine] of the shares in the capital of a bank are so\nsold, the application of the provisions of this Act, other than this sub-\nsection, including provisions relating to ownership of shares and\nmanagement and control of banks, to such bank shall stand suspended for\nsuch period, and on such terms, including terms guaranteeing the security\nof deposits and terms relating to sound management of the bank, as the\nFederal Government may, by notification in the official Gazette, specify;\nand\n1\nIns. by the Banks (Nationalization) (Amdt.) Ordinance, 1981 (45 of 1981), s. 2.\n2\nAdded by the Finance Act, 1990 (7 of 1990) s. 14.\n3\nSubs. and added by the Banks (Nationalization) (Second Amdt.) Act, 1991 (4 of 1991), s. 2.\n4\nSubs. by Act No IV of 2007, s. 11.\n5\nIns. by the Banks (Nationalization) (Third Amdt.) Act, 1991 (15 of 1991), s. 3, (w.e.f. 30.06.1990).\n(b)        where not less than fifty-one percent of the shares are so sold, the\nprovisions of this Act shall cease to apply to such bank.\n(2) The Federal Government shall have, and be deemed always to have had, the\npower to determine and lay down the terms and conditions subject to which shares in the capital\nof a bank are to be sold and its management and control is to be transferred to any person under\nsub-section (1).\n(3) The power referred to in sub-section (1) may be exercised by the Federal\nGovernment at any time either before or after a decision is taken by the Federal Government to\nsell the shares and transfer the management of a bank as aforementioned, and the Federal\nGovernment shall be competent to vary, modify, review or annul any or all of the terms and\nconditions referred to in sub-section (2) at any time it deems fit to do so in the public\ninterest, until the sale of the shares and transfer of management and control are completed, and\nsuch variation, modification, review or annulment shall not be called in question in any Court,\nor before any authority, on any ground whatsoever."
    },
    {
      "provision_ref": "sec5b",
      "section": "5B",
      "title": "Section 5B. Section 5A to have effect notwithstanding any other law, etc. The provisions of",
      "content": "section 5A shall have effect notwithstanding anything contained in this Act or any other law for\nthe time being in force, any agreement of contract, or any judgment of any Court.]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Compensation for transfer of ownership of shares in a bank",
      "content": "(1) Every\nperson who stands registered as the holder of any share of a bank the ownership,\nmanagement and control of which stands transferred to the Federal Government by virtue of\nsection 5 shall be entitled to receive from the Federal Government by way of compensation per\nshare an amount determined in accordance with the provisions of section 7 in the form of bonds\nof the Federal Government, repayable at par at any time within a period of fifteen years in\naccordance with a redemption programme formulated by the Federal Government and bearing\ninterest at the rate of one per cent above the bank rate notified by the State Bank from time to\ntime:\nProvided that, in formulating the redemption programme, the Federal Government may\nmake provision for preferential redemption of the bonds of such class of persons who are of\nmeagre means such as orphans, widows and pensioners, and the amount of compensation\npayable to whom does not exceed such maximum amount, as the Federal Government may\ndeem fit:\nProvided further that, where the amount so determined is not an exact multiple of\none hundred rupees, the amount in excess of the nearest lower multiple of one hundred\nrupees shall be paid in cash.\n(2) The bonds shall be negotiable and eligible as security for advances.\n1\n[6A. Registration of certain shares.—(1) Any person who holds any share of a bank\nthe ownership, management and control of which stands transferred to the Federal Government\nby virtue of section 5 which was bought by him on a recognised Stock Exchange in Pakistan\nbefore the first day of January, 1974, but was not registered in his name in the books of the\ncompany by that day may make an application for registration to such bank.\n1\nIns. by the Banks (Nationalization) (Amdt.) Ordinance, 1978 (17 of 1978), s. 2.\n(2) An application under sub-section (1) shall be made within such time and in such\nmanner, and shall be accompanied by such documentary evidence, as may be prescribed.\n(3) The bank to which an application is made may on being satisfied after such scrutiny\nor verification by such authority as may be prescribed, that the applicant is the holder of\nthe share, register him as such; and a person so registered shall be entitled to receive the\ncompensation provided for in sub-section (1) of section 6.]"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Assessment of compensation. The amount of the compensation shall be the amount",
      "content": "equal to the break-up value of the share as determined by an auditor appointed by the Federal\nGovernment from the balance sheet of the bank as on the 31st December, 1973, according to the\nprinciples laid down in rule 8 of the Wealth Tax Rules, 1963;\nProvided that in case of a share of the State Bank the amount of the compensation shall\nbe the average of the closing quotations during six working days immediately preceding\nthe commencing day on the Karachi Stock Exchange:\nProvided further that, in respect of any share obtained at par from the Federal\nGovernment by any directors of the Central Board of Directors of the State Bank or a\nmember of the Local Board of that Bank under the provisions of sub-section (3) of section 13\nof the State Bank of Pakistan Act, 1956 (XXXIII of 1956) the amount of compensation shall\nbe calculated at the rate of one hundred rupees per share."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Removal of previous management",
      "content": "(1) Every person holding office in any\nbank as chairman, director or chief executive by whatever name called, other than a person who\nholds such office by virtue of his appointment or nomination by the Federal Government\nor the State Bank, shall stand removed from his office on the commencing day and this removal\nshall not entitle him to any compensation and no such claim shall be entertained by any court,\ntribunal or other authority.\n(2) The vacation of his office by a chairman, director or chief executive under sub-\nsection (1) or otherwise shall not in any way absolve him of his liability, if any, under any law,\ncontract or otherwise howsoever subsisting immediately before the commencing day or the day\non which he ceases to hold such office.\n(3) A chairman, director or chief executive by whatever name called ceasing to hold\noffice under any of the aforesaid provisions shall entrust or cause to be entrusted to the\nperson succeeding him in that office, intact and in as good order as they existed on the day\nimmediately preceding the commencing day all properties, all books of accounts and other\nrecords and documents belonging to or in the custody or control or pertaining to the affairs, of\nthe bank.\n(4) Central Boards of the banks mentioned in the Schedule, and all local bodies, area\nboards, managing committees, executive committees and similar other bodies for the\nmanagement of any bank shall stand dissolved, and all members of such bodies shall stand\nremoved from office on the commencing day.\n1\n[(5) *              *         *          *          *             *        *]\n2\n[9. Dissolution of the Pakistan Banking Council.—(1) The Pakistan Banking\nCouncil (hereinafter referred to as the Council) shall stand dissolved forthwith.\n(2) All assets, properties and rights of the Council shall stand transferred to and vest in,\nand all liabilities and other encumbrances of the Council shall stand transferred to and become\nthe liabilities and encumbrances of, the State Bank.\n(3) Employees of the Council, including its members, —\n(a)        who are on deputation or secondment from any public sector financial\ninstitution shall revert to, and continue to be employed by, their parent\ninstitutions on terms and conditions governing their employment in\ntheir parent institutions ; and\n(b)        who do not fall in clause (a) shall become employees of the State Bank\non terms and conditions governing their employment with the Council.\n(4) Every contract or instrument to which the Council is a party shall continue to be in\nforce and effective as if the State Bank had been a party thereto instead of the Council.\n(5) Any legal proceedings or, as the case may be, any application pending before any\nauthority by or against the Council may be continued by or against the State Bank.\n(6) Where under any statute or statutory instrument, the Chairman or a member of\nthe Council is nominated for a specified assignment or task, the vacancy caused by the\noperation of this section shall be filled by a person nominated by the State Bank.]\n3\n[10. Transfer and using of funds. All sums standing to the credit of the Council in the\nfund constituted heretofore shall stand transferred to, and vest in, the State Bank.]\n4\n[11. General provisions pertaining to management of banks.—(1) Subject to\nsub-section (2), a bank shall have a Board consisting of—\n(a)        a President, who shall be its Chief Executive; and\n5\n[(b)   not less than five and not more than seven other members including one\nor more directors whose election by the private shareholders, removal\nand other matters shall be governed by the Companies Ordinance,\n1984 (XLVII of 1984).]\n(2) The Federal Government may, if it deems necessary, appoint a Chairman of the\nBoard in respect of a bank.\n1\nSub-section (5) omitted by the Banks (Nationalization) (Amdt.) Act, 1997, (18 of 1997), s. 4.\n2\nSubs. by the Banks (Nationalization) (Amdt.) Act, 1997, (18 of 1997), s. 5, for section 9, which was previously amended by\nvarious enactments.\n3\nSubs. ibid. s. 6, for section 10.\n4\nSubs. by the Banks (Nationalization) (Amdt.) Act, 1997, (18 of 1997), s. 7, for section 11, which was previously amended by\nvarious enactments.\n5\nSubs. by Act, 2016 (41 of 2016), s. 2.\n(3) The Chairman, the President, and other members of the Board 1 [ representing the\nFederal Government’s direct and indirect shareholding].___\n(a)       shall be appointed by the Federal Government, in consultation with the\nState Bank, for a term of three years, on such terms and conditions as\nmay be fixed by the General Meeting of the bank: provided that the\nChairman and the President shall be appointed from amongst professional\nbankers whose names are included in a panel of bankers qualified to be\nthe Chairman or the President, which panel shall be determined,\nmaintained and varied, from time to time, by the State Bank ;\n(b)        may be removed for misconduct or physical and mental incapacity\nbefore the expiry of the three years term by the Federal Government in\nconsultation with the State Bank;\n(c)        shall stand removed if he becomes ineligible on any of the grounds\nspecified in sub-section (12); and\n1\n[(d)   may be re-appointed for second and final term by the Federal\nGovernment, in consultation with the State Bank of Pakistan, for a\nfurther period of three years.]\n(4) The general direction and superintendence of the affairs and business of a bank, and\noverall policy making in respect of its operations, shall vest in its Board.\n(5) The Board shall determine—\n(i)         the credit policies of the banks ;\n(ii)       evaluation criteria for the performance of the employees of the bank\nother than the President;\n(iii)      personnel policies of the bank, including appointment and removal\nof officers and employees ;\n(iv)       guidelines for entering into any compromise with borrowers and other\ncustomers of the bank ; and\n(v)        any other policy matter.\n(6) The Chief Executive and other officers of the bank shall act in accordance with\nthe policies, criteria and guidelines determined by the Board.\n(7) The Board shall appoint committees from amongst the executives of the bank,\nand determine the powers, functions and duties of such committees.\n(8) Where the Federal Government has appointed a Chairman, he shall preside over the\nmeetings of the Board, and in case a Chairman has not been appointed, then the\nPresident shall preside over the meetings of Board. In the absence of the Chairman or the\nPresident, as the case may be, the directors may elect one of the member to preside over the\nmeetings.\n1\nAdded and Subs. by Act, 2016 (41 of 2016), s. 2.\n(9) The President, subject to the control and directions of the Board, shall exercise\npowers of management of the affairs of the bank.\n(10) All selections, promotions and transfer of employee of banks except the\nPresident and decisions as to their remuneration and benefits shall be made by the President in\naccordance with the evaluation criteria and personnel policies determined by the Board.\n(11) The Board, the President and other officers shall exercise their powers and\ndischarge their duties in accordance with sound banking principles and prudent banking\npractices and shall ensure compliance with regulations and directions that may be issued by the\nState Bank from time to time.\n(12) No person shall be eligible for appointment as the Chairman, the President, or a\nmember of the Board if—\n(a)        he is or has at any time been adjudged insolvent or has suspended\npayment or has compounded with his creditors ; or\n(b)        he is a minor or is found a lunatic or of unsound mind ; or\n(c)        he is not citizen of Pakistan ; or\n(d)        he was at any time in the service of the Federal Government or a\ncorporation controlled by any such Government or in the service of a\nbank and was dismissed ; or\n(e)        he is a person against whom any action has been taken or any\nproceedings are pending under section 412 of the Companies\nOrdinance, 1984, (XLVII of 1984) or section 83 of the Banking\nCompanies Ordinance, 1962 (LVII of 1962) ; or\n(f)        he is, or has been, convicted for tax evasion under any law for the time\nbeing in force ; or\n(g)        he is a member of the Senate, National Assembly, any Provincial\nAssembly or an elected Member of a local council constituted under any\nlaw relating to local councils ; or\n(h)        he is holding an office in a political party. ]\n1\n[11A. Provisions pertaining to management of banks to apply to certain financial\ninstitutions. Notwithstanding anything to the contrary contained in any other law for the time\nbeing in force, or in any agreement, contract, award, memorandum and article of associations or\nany other instruments, the provision of section 11 shall apply to—\n2\n[(i)* *            *           *          *         *      *\n(ii)*      *           *           *          *         *      *]\n1\nNew section 11A ins. by the Banks (Nationalization) (Amdt.) Act, 1997 (18 of 1997), s. 8.\n2\nClauses (i and ii) omitted by Act, 2011 (24 of 2011), s. 2.\n4\n[(iii) *           *           *           *          *           *            *    *]\n1\n[(iv)*             *           *           *          *           *            *    *]\n4\n[(v) *             *           *           *          *           *            *    *\n(vi) *                 *           *           *          *           *            *    *]\n(vii)          First Women Bank Limited, and\n2\n[(viii) Agricultural Development Bank of Pakistan (ADBP).\n(ix)           Industrial Development Bank of Pakistan (IDBP).]\nSuch other financial institutions as the Federal Government may, by notification in the official\ngazette, specify.]"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Fidelity and secrecy",
      "content": "(l) The Chairman and members of the Council, every bank,\n3\n[the President, members of the Board, and members of the Executive Committee] and chief\nexecutive, by whatever name called, shall observe, except as otherwise required by law, the\npractices and usages customary among bankers and, in particular, shall not divulge any\ninformation relating to the affairs of its constituents except in circumstances in which it is, in\naccordance with law or practice and usages customary among bankers, necessary or appropriate\nfor a bank to divulge such information.\n(2) The Chairman and members of the Council, 3[the President, members of the Board,\nand members of the executive committee] of every bank, every administrator, auditor,\nadviser, officer or other employee of the Council or a bank shall, before entering upon his\noffice, make a declaration of fidelity and secrecy in such form as may be prescribed.\nExplanation.—In the case of any such person employed in connection with the affairs\nof a bank as is not required by any provision of this Act to vacate any office held by him, the\nrequirements of this sub-section shall be deemed to be satisfied if such person has already filed\nwith the bank a declaration more or less to the effect of the prescribed form.\n3\n[(3) Notwithstanding anything contained in sub-sections (1) and (2), every balance\nsheet and profit and loss account prepared by a bank under any law for the time being in\nforce shall include a statement in the form and manner specified by the State Bank of written\noff loans or any other financial relief of five hundred thousand rupees or above allowed to a\nperson.\n1 Clauses (iv), omitted by Act, 2011 (24 of 2011), s. 2.\n2\nAdded by Notification. No. F. 1 (3)/Inv-II/81-91, dt. 13-1-2001, Pt.- III Ext. Ibd- P. 11.\n3\nSubs. and added by the Banks (Nationalization (Third Amdt.) Act, 1991 (15 of 1991), s. 6, (w.e.f 30.06.1990).\n4\nClauses (iii, v and vi), omitted by Act (IX of 2020), s.2.\n(4) Notwithstanding anything contained in sub-sections (1) and (2), the State Bank shall\nprepare, and submit to the Federal Government, a special report every year on cases of write off\nof loans, mark-up and other dues, or financial relief through rescheduling and restructuring of\nloans and subsidized loans provided by the nationalized commercial banks, in which\nestablished banking practices or authorized procedures have been departed from with a view to\ncausing wrongful loss to the bank or conferring wrongful gain on any constituent or such\ndeparture has caused wrongful loss to the bank or conferred wrongful gain on any\nconstituent. If the matters raised in the report relate to public interest, the Federal\nGovernment may submit the report, or such part of it as relates to public interest, to the\nParliament or to the Standing Committee or a House of Parliament dealing with Finance.]"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Provisions regarding staff",
      "content": "(1) Save as otherwise provided in this Act, all\nofficers and other employees of a bank shall continue in their respective offices and\nemployments on the same terms and conditions, including remuneration and rights as to pension\nand gratuity, as were applicable to them immediately before the commencing day.\n(2) Notwithstanding any law or any provision contained in a contract, agreement, letter\nof appointment rules or regulations of a bank, every officer and employee of a bank shall be\nliable to transfer to any of its branches in or outside Pakistan or to any other bank:\nProvided that his status and emoluments shall not be adversely affected."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Certain claims for compensation barred. No person including a chairman,",
      "content": "director, chief executive by whatever name called, a shareholder, a constituent or an officer or\nemployee of a bank shall have any right, whether in contract or otherwise, to any\ncompensation other than that expressly provided for by this Act, for any loss or damage\ndirectly or indirectly incurred by reason of the operation of any of the provisions of this Act or\nany rule or order made or direction issued thereunder."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. [Schemes for reorganisation of banks, etc.] omitted by the Banks",
      "content": "(Nationalization) (Amdt.) Act 1997, (XVIII of 1997) s.9."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Removal of doubts. For the removal of doubts, it is hereby declared that",
      "content": "(a)        all assets, rights, powers, authorities and privileges and all property,\nmovable or immovable, cash balances, reserve funds, investments and all\nother rights and interests arising out of such property as were\nimmediately before the commencing day in the ownership, possession,\npower or control of a bank, whether within or outside Pakistan, shall 1[*\n* *] continue to vest in that bank, and all borrowings, liabilities,\nincluding contingent liabilities, and obligations of a bank of whatever\nkind subsisting immediately before the commencing day shall, unless\nother provisions as aforesaid are made for their discharge or\nperformance, continue to be the borrowings, liabilities and obligations of\nthat bank ;\n(b)        all contracts, deeds, bonds, agreements, powers of attorney, other than\nthose in favour of a person vacating his office under this Act, grant of\nlegal representation and other instruments of whatever kind subsisting or\nhaving effect immediately before the commencing day to which a bank is\na party or which are in favour of a bank shall be of as full force and effect\nagainst or in favour of a bank as they were immediately before the\ncommencing day; and\n1\n(c)        if, on the commencing day, any suit, appeal or other legal proceeding of\nwhatever nature which is by or against the bank or to which the bank\nis a party is pending in any court or before a tribunal or other authority,\nthe same shall not abate, be discontinued or be in any way,\nprejudicially affected by any provision of this Act."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Disposal of profits. Subject to the provisions of the law by or under which a",
      "content": "bank has been established and the provisions of the State Bank Act, 1956 (XXXIII of 1956),\nand the Banking Companies Ordinance, 1962 (LVII of 1962), a bank shall not declare any\ndividend on its share capital unless—\n(a)        it has drawn up its annual balance sheet and profit and loss account and\nhas its accounts audited by an auditor qualified to act as such under the\nBanking Companies Ordinance, 1962 (LVII of 1962);\n(b)        it has made adequate provision for bad and doubtful debts, depreciation\nin assets, contributions to staff and superannuation funds and all other\ncontingencies for which provision is necessary under any law or which\nare usually provided for by bankers; and\n(c)        a copy of the balance sheet and profit and loss account along with the\naudit report has been supplied to the State Bank and the Federal\nGovernment and the latter has approved the declaration of such dividend:\nProvided that, before according such approval, the Federal Government may, of\nits own motion or on the recommendation of the State Bank, order a second audit\nof the accounts of the bank and appoint such auditor for the purpose as it thinks fit.\n1\n[18. Indemnity. No suit, prosecution, or other legal proceedings shall lie against the\nFederal Government, the State Bank, the President or directors of the Board, of a bank or\nany officer of the Federal Government or the State Bank or a bank for anything in good faith\ndone or purporting to be done under this Act or any rule or order made or direction issued\nthereunder or for any damage caused or likely to be caused by anything done or purporting to\nbe done as aforesaid.]"
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Bar of jurisdiction. No provision of this Act or of any rule or order made or",
      "content": "direction issued thereunder shall be called in question by or before any court or other authority."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Power to make rules. The Federal Government may, by notification in the official",
      "content": "Gazette, make rules2 to provide for all matters for which provision in necessary or expedient for\n1\nSubs. by the Banks (Nationalization) (Amdt.) Act, 1997 (18 of 1997), s. 11, for section 18, which was previously subs, by Act 15 of\n1991 s. 7.\n2\nFor the Banks (Nationalization) (Payment of Compensation) Rules, 1974 see S.R.O. No. l284(l)/74, dated 7-10-1974. Gaz. of P.,\n1974, Ext., (Islamabad), Pt. II. pp. 1800—1803."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Adaptation of laws. Any court, tribunal or authority required or empowered to",
      "content": "enforce the 1[Companies Ordinance, 1984] or the memorandum or articles of association of a\nbank registered thereunder, or any other law for the time being in force shall construe the said\nAct, memorandum or articles of association or such other law with such adaptations as are\nnecessary to bring the same into accord with the provisions of this Act."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Penalty",
      "content": "(1) Whoever contravenes any of the provisions of this Act or the rules\nmade thereunder shall be punishable with imprisonment for a term which may extend to five\nyears, or with fine or with both.\n(2) No person shall be prosecuted under this Act except with the sanction of the\nFederal Government or an officer authorised by it in this behalf."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Removal of difficulties. If any difficulty arises in giving effect to any provision of",
      "content": "this Act the Federal Government may make such order not inconsistent with the\nprovisions of this Act as may appear to it to be necessary for the purpose of removing the\ndifficulty."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. [Repeal of Ordinance I of 1974.] Omitted by the Federal Laws (Revision and",
      "content": "Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch., II.\n_________\n[See sections 8 and 9]\n(1)          Australasia Bank Limited.\n(2)          Bank of Bahawalpur Limited.\n(3)          Commerce Bank Limited.\n(4)          Habib Bank Limited.\n(5)          Lahore Commercial Bank Limited.\n(6)          Muslim Commercial Bank Limited.\n(7)          National Bank of Pakistan.\n(8) 2*                  *                     *                     *                     *                     *\n(9)          Standard Bank Limited.\n(10)         United Bank Limited.\n(11)         Sarhad Bank Limited.\n(12)         Premier Bank Limited.\n(13)         Pak Bank Limited.\n(14)         Habib Bank (Overseas) Limited.\n1\nSubs. by the Finance Act, 1990 (7 of 1990), s. 14.\n2\nEntry (8) omitted by the Federal Bank for Cooperatives and Regulation of Cooperative Banking Act, 1977 (9 of 1977), s. 49."
    }
  ],
  "definitions": []
}
