{
  "id": "pk-biological-and-toxin-weapons-convention-implementation-act-2026",
  "type": "statute",
  "title": "Biological and Toxin Weapons Convention (Implementation) Act, 2026",
  "title_en": "Biological and Toxin Weapons Convention (Implementation) Act, 2026",
  "short_name": "BATWC",
  "status": "in_force",
  "issued_date": "2025-12-18",
  "in_force_date": "2025-12-18",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5toag%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Biological and Toxin Weapons Convention (Implementation) Act, 2026 (II of 2026) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and application",
      "content": "(1) This Act shall be called the.\n(2) It extends to the whole of Pakistan and applies to -\n(a)     all citizens of Pakistan wherever they may be;\n(b)     any person who has committed an offence under this Act while in the territory of\nPakistan or if the offence is committed against Pakistan or a citizen of Pakistan\nfrom within Pakistan or anywhere else;\n(c)     any foreign national while in the territory of Pakistan; or\n(d)     any conveyance registered in Pakistan wherever it may be, or any conveyance\nregistered anywhere else but present within the territories of Pakistan."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,-\n(a)     “aid and abetment” means acts as defined under section 107 of the Pakistan Penal\nCode (Act XLV of 1860);\n(b)     “biological agents” means any micro-organism; bacteria, virus, fungus, prion or\nother infectious substance or their biological products, genetically modified\norganisms, capable of causing death, disease or other biological malfunction and\nincapacitation of human beings, animals or plants;\n(c)   “biological weapons” means-\n(i)    microbial or other biological agents, or toxins whatever their origin or\nmethod of production, or types and in quantities that have no justification\nfor prophylactic, protective or other peaceful purposes; or\n(ii)   weapons, equipment or means of delivery designed to use such agents or\ntoxins for hostile purposes;\n(d)   “Convention” means the Convention on the Prohibition of the Development,\nProduction and Stockpiling of Bacteriological (Biological) and Toxin Weapons\nand on their Destruction, 1972;\n(e)   “conveyance” means any means of transport used on land, air, or the sea;\n(f)   “development” includes any activity or phase prior to production, or relates to\ndesign research, design analysis, design concept, assembly and testing of\nprototypes, pilot production schemes, design data, the process of transforming\ndesign data into product, configuration design and integration design or layout;\n(g)    “central authority” means the authority notified by the minister for foreign affairs\nto the convention secretariat for the purpose of implementation of the Convention;\n(h)   “enforcement agency” means any agency or agencies designated by the Federal\nGovernment under section 11;\n(i)   “equipment” includes any assembly which may comprise electrical, electronic,\nmechanical, chemical and metallurgical components, used in manufacturing,\nproduction and stockpiling of biological weapons;\n(j)   “export” includes-\n(i)    shipment, transfer or transmission of goods or technology out of Pakistan;\nand\n(ii)   a transfer of goods and technology within Pakistan with the knowledge or\nintent that the goods or technology shall be shipped, transferred or\ntransmitted to an unauthorized recipient outside Pakistan;\n(k)   “oversight committee” means committee constituted under section 10;\n(l)   “import” includes shipment, transfer or transmission of biological weapons or\nrelated technology into Pakistan;\n(m)   “material” includes materials used in the production of biological weapons and\ntheir delivery systems;\n(n)   “means of delivery” includes missiles or any other delivery system designed and\nadapted to deliver biological weapons;\n(o)   “permitted purpose” includes-\n(i)     industrial, agricultural, research, medical, pharmaceutical or other\npeaceful purposes; and\n(ii)    protective purposes that are designed to protect humans, plants and\nanimals against the use of biological and toxin weapons;\n(p)       “person” includes an individual who may or may not be a citizen of Pakistan, a\ncompany, an association, a body of individuals, whether incorporated or not;\n(q)       “technology” means any documents including blueprints, plans, diagrams,\nmodels, formulas, tables, engineering designs or specifications, manuals or\ninstructions, necessary for the development and production of biological weapons,\nand their delivery systems, including on the job training, expert advice and\nservices attached therewith, except-\n(i)     any document or information that is in public domain or is related to basic\nscientific research or other peaceful applications of such technology\nincluding that related to its application for protective purposes; and\n(ii)    any application of the grant of a patent or any other form of protection for\ninventions or for the registration of a design in each case under the law of\nPakistan or any other country or under any treaty or international\nconventions to which Pakistan is a party or any document necessary to\nenable any such application to be filed, made or pursued; and\n(r)       “toxin” means any toxic material derived from plants, animals, micro-organisms\nincluding bacteria, viruses, fungi, or other infectious substances or their products,\nwhatever may be their origin or method of production."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Prohibition of biological weapons",
      "content": "(1) No person shall, for purpose prohibited under the\nConvention,-\n(a)         develop, manufacture, design, produce, stockpile, transport, import, export, sell,\ntransfer or otherwise acquire, possess, control or retain a biological weapon;\n(b)         knowingly manufacture, develop, design, produce, stockpile, transport, transfer or\notherwise acquire or retain any material, equipment, or technologies which are intended\nto be used in the preparation of a biological weapon;\n(c)         knowingly develop, design, produce, stockpile, transport, or otherwise, acquire, retain,\nimport, export, sell, transfer any means of delivery designed to use biological agents or\ntoxins for hostile purposes or use in armed conflict; or\n(d)          knowingly provide technical, financial, logistical or any other assistance directly or\nindirectly by any means for the acts mentioned hereinabove.\n(2) Whosoever contravenes, or attempts to contravene, the provisions of clause (a) of sub-section\n(1) shall be liable to punishment of imprisonment of either description for a term which may extend to\ntwenty-five years but not less than ten years and also liable to fine up to ten million rupees and all\nmaterials, equipments, technologies, etc. relating to biological weapons, recovered or found along with\nconveyance and movable and immovable property of the offender shall be liable to forfeiture to the\nFederal Government.\n(3) Whosoever contravenes, or attempts to contravene, the provisions of clauses (b), (c) or (d) of\nsub-section (1) shall be liable to punishment of imprisonment of either description for a term which may\nextend to twenty-five years and also liable to fine up to ten million rupees and all materials, equipments,\ntechnologies, etc. relating to biological weapons, recovered or found along with conveyance and movable\nand immovable property of the offender shall be liable to forfeiture to the Federal Government."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Prohibition of use of biological weapons, etc",
      "content": "(1) No person shall use or attempt to use\nbiological weapons in Pakistan, or anywhere outside Pakistan.\n(2) Whosoever contravenes, or attempts to contravene, any provision of sub-section (1) shall be\npunished with imprisonment for life and shall also be liable to fine not less than ten million rupees and\nmaterials, equipments, technologies as well as all movable and immovable property of such an offender\nshall be liable to be forfeited to the Federal Government."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Control of import and export",
      "content": "(1) The central authority, in consultation with the division to\nwhich business of import and export stands allocated, shall exercise power to control or restrict or lay\ndown conditions in respect of import and export of any biological agent, equipments, materials, or\ntechnologies and their means of delivery.\n(2) For the purposes of sub-section (1), the word “control” refers to “control list of such biological\nagents or technologies” notified under the Export Control on Goods, Technologies, Material and\nEquipment related to Nuclear and Biological Weapons and their Delivery System Act, 2004 (V of 2004)\nand the rules made thereunder.\n(3) Whosoever contravenes, or attempts to contravene, the provisions of the control or restriction\nunder this section shall be liable to punishment of imprisonment for a term which may extend to fourteen\nyears or with fine not exceeding five million rupees or with both, and on conviction, offender’s property\nand assets, wherever they may be, shall be forfeited to the Federal Government.\n(4) Whoever commits breach of any restriction or conditions specified in sub-section (1) that\nconstitutes an offence under section 3 or section 4 shall also be punishable under the aforesaid sections."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Biological defence research",
      "content": "Nothing in this Act shall prohibit any programme or activity\ncarried out or authorized by the Federal Government that is specifically designed to protect or defend\nhumans, animals or plants against the use of biological agents or toxins for hostile purposes or in armed\nconflict, or to detect or assess the impact of such use."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Other offences",
      "content": "(1) Any person who is found to have been abetting or aiding or assisting the\ncommission of any act that constitutes an offence under the Act or its attempt, shall be liable to\npunishment of imprisonment of either description for life or for a term which may extend to fourteen\nyears and shall also be liable to fine and his movable and immovable property shall also be liable to\nforfeiture to the Federal Government.\n(2) Any person who is found to have, or attempted to have, in any way financed the commission\nof any act that constitutes an offence under this Act shall be liable to punishment of imprisonment of\neither description for life or for a term which may extend to fourteen years and shall also be liable to fine\nand his movable and immovable property shall be liable to forfeiture to the Federal Government.\n(3) Any person who is found to harbour any offender, who has committed an offence under this\nAct, shall be liable to punishment of imprisonment of either description for life or for a term which may\nextend to fourteen years and shall also be liable to fine and his movable and immovable property shall\nbe liable to forfeiture to the Federal Government.\n(4) Any person who knowingly violates the rules made under this Act shall be liable to\npunishment of imprisonment for a term which may extend to five years, or shall also be liable to fine\nwhich may extend to one million rupees or with both."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Offences, etc. to be tried by Court of Sessions",
      "content": "Any person who contravenes any provision\nof this Act and rules made thereunder shall be tried by Court of Sessions only upon a complaint in writing\nmade by an officer authorized by the central authority for purpose of this Act. The provisions of the Code\nof Criminal Procedure, 1898 (Act V of 1898) shall mutatis mutandis be applicable for the purpose of trial\nand other proceedings."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Permissible uses",
      "content": "(1) The central authority shall facilitate and have the right to participate in\nthe fullest possible exchange of equipment, materials and scientific and technological information, for\n(2) The central authority shall cooperate in contributing individually or collectively with other\nstates or international organizations to the development and application of scientific discoveries in the\nfield of bacteriology (biology) for prevention of disease, or for other peaceful purposes.\n(3) Nothing in this Act shall be implemented in a manner to hamper the economic or technological\ndevelopment or international cooperation in respect of peaceful bacteriological (biological) activities\nincluding the exchange of bacteriological (biological) agents and toxins and equipment for the\nprocessing, use or production of bacteriological (biological) agents and toxins for peaceful purposes."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Oversight committee",
      "content": "(1) The secretary, ministry of foreign affairs shall constitute an\noversight committee consisting of such members as may be notified in the official Gazette.\n(2) The oversight committee shall ensure the effective implementation of the Convention and the\nprovisions of this Act and rules made thereunder.\n(3) The oversight committee shall follow such procedure as may be prescribed."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Enforcement agency",
      "content": "(1) The secretary, ministry of foreign affairs shall designate any law\nenforcement agency or agencies for the enforcement of this Act, or it may entrust any of its functions\nunder this Act to any government body, agency or entity.\n(2) The enforcement agency shall have the powers to carry out necessary acts including collection\nof information, inquiry, investigation, search, seizure, arrests and prosecution of the individuals, entities\nand organizations, as the case may be, that are suspected to have committed an offence under this Act\nor any violation of rules, control list and any other direction, order or instruction issued for the purpose\nof implementation of this Act.\n(3) The enforcement agency shall also be entitled to seek assistance from the law enforcement\nbodies and judicial bodies in other states, for the purpose of investigation under this Act."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. International cooperation",
      "content": "The central authority, upon receiving a request from any state\nparty to the Convention, may extend possible cooperation in respect of matters covered by this Act."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Power to make rules",
      "content": "The Federal Government may, on recommendations of the central\nauthority and by notification in the official Gazette, make rules for the purpose of implementation of this\nAct."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Act not to derogate from other laws",
      "content": "The provisions of this Act shall be in addition to and\nnot in derogation of any law or rules, orders or notifications for the time being in force."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Removal of difficulties",
      "content": "If a difficulty arises in giving effect to any provision of this Act,\nappear to be necessary for the purpose of removing the difficulty.\n______________\nRGN Date: 22-01-2026"
    }
  ],
  "definitions": [
    {
      "term": "aid and abetment",
      "definition": "acts as defined under section 107 of the Pakistan Penal Code (Act XLV of 1860);",
      "source_provision": "sec2"
    },
    {
      "term": "biological agents",
      "definition": "any micro-organism; bacteria, virus, fungus, prion or other infectious substance or their biological products, genetically modified organisms, capable of causing death, disease or other biological malfunction and incapacitation of human beings, animals or plants;",
      "source_provision": "sec2"
    },
    {
      "term": "Convention",
      "definition": "the Convention on the Prohibition of the Development, Production and Stockpiling of Bacteriological (Biological) and Toxin Weapons and on their Destruction, 1972;",
      "source_provision": "sec2"
    },
    {
      "term": "conveyance",
      "definition": "any means of transport used on land, air, or the sea;",
      "source_provision": "sec2"
    },
    {
      "term": "development",
      "definition": "any activity or phase prior to production, or relates to design research, design analysis, design concept, assembly and testing of prototypes, pilot production schemes, design data, the process of transforming design data into product, configuration design and integration design or layout;",
      "source_provision": "sec2"
    },
    {
      "term": "central authority",
      "definition": "the authority notified by the minister for foreign affairs to the convention secretariat for the purpose of implementation of the Convention;",
      "source_provision": "sec2"
    },
    {
      "term": "enforcement agency",
      "definition": "any agency or agencies designated by the Federal Government under section 11;",
      "source_provision": "sec2"
    },
    {
      "term": "equipment",
      "definition": "any assembly which may comprise electrical, electronic, mechanical, chemical and metallurgical components, used in manufacturing, production and stockpiling of biological weapons;",
      "source_provision": "sec2"
    },
    {
      "term": "oversight committee",
      "definition": "committee constituted under section 10;",
      "source_provision": "sec2"
    },
    {
      "term": "import",
      "definition": "shipment, transfer or transmission of biological weapons or related technology into Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "material",
      "definition": "materials used in the production of biological weapons and their delivery systems;",
      "source_provision": "sec2"
    },
    {
      "term": "means of delivery",
      "definition": "missiles or any other delivery system designed and adapted to deliver biological weapons;",
      "source_provision": "sec2"
    },
    {
      "term": "person",
      "definition": "an individual who may or may not be a citizen of Pakistan, a company, an association, a body of individuals, whether incorporated or not;",
      "source_provision": "sec2"
    },
    {
      "term": "technology",
      "definition": "any documents including blueprints, plans, diagrams, models, formulas, tables, engineering designs or specifications, manuals or instructions, necessary for the development and production of biological weapons, and their delivery systems, including on the job training, expert advice and services attached therewith, except- (i) any document or information that is in public domain or is related to basic scientific research or other peaceful applications of such technology including that related to its application for protective purposes; and (ii) any application of the grant of a patent or any other form of protection for inventions or for the registration of a design in each case under the law of Pakistan or any other country or under any treaty or international conventions to which Pakistan is a party or any document necessary to enable any such application to be filed, made or pursued; and",
      "source_provision": "sec2"
    },
    {
      "term": "toxin",
      "definition": "any toxic material derived from plants, animals, micro-organisms including bacteria, viruses, fungi, or other infectious substances or their products, whatever may be their origin or method of production.",
      "source_provision": "sec2"
    }
  ]
}
