{
  "id": "pk-board-of-investment-ordinance-2001",
  "type": "statute",
  "title": "Board of Investment Ordinance, 2001",
  "title_en": "Board of Investment Ordinance, 2001",
  "short_name": "BOIO",
  "status": "in_force",
  "issued_date": "2001-03-21",
  "in_force_date": "2001-03-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cp%2BUY2Fv-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Board of Investment Ordinance, 2001 (XV of 2001) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Removal of difficulties",
      "content": "ORDINANCE No. XV OF 2001\n[22nd March, 2001]\nAn Ordinance to provide for the establishment of the Board of Investment as an apex agency to\npromote, encourage and facilitate both local and foreign investment\nWHEREAS it is expedient to provide for the establishment of Board of Investment to promote,\nencourage and facilitate local and foreign investment, and for matters connected therewith and\nancillary thereto;\nAND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the\nProclamation of Emergency of the fourteenth day of October, 1999, and the Provisional Constitution\nOrder No. l of 1999;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of\nOctober, 1999, and the Provisional Constitution Order No. l of 1999, read with the Provisional\nConstitution (Amendment) Order No.9 of 1999, and in exercise of all powers enabling him in that\nbehalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the\nfollowing Ordinance:__\nCHAPTER.__ I"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Ordinance may be called the Board\nof Investment Ordinance, 2001.\n(2)    It extends to the whole of Pakistan.\n(3)    It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Ordinance, unless there is anything repugnant in the subject or\ncontext,__\n(a)    \"Board\" or \"BOI\" means the Board of Investment established under section 3;\n(b)    \"Chairman\" means the Chairman of the Board;\n(c)    \"CCOI\" means the Cabinet Committee on Investment constituted by\nNotification No.38(Cab)/97, dated 13th September, 1997;\n(d)    \"Investment Policy\" means the investment policy, the CCOI may, from time to\ntime, approve;\n(e)    \"member\" means the member of the Board;\n(f)     \"National Industrial Zone\" means an industrial estate, an export processing\nzone, a free industrial zone and export oriented unit or a free trade zone, notified\nas such by the Federal Government;\n(g)     \"President\" means President of the Board;\n(h)     \"Provincial Investment Committee\" means any Provincial Investment\nCommittee established under section 16;\n(i)     \"regulations\" means regulations made under this Ordinance;\n(j)     \"rules\" mean rules made under this Ordinance;\n(k)     \"Secretary\" means the Secretary of the BOI; and\n(l)     \"Vice-President\" means the Vice-President of the Board.\nCHAPTER.__ II"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Board of Investment",
      "content": "(1) There is hereby established a Board\nto be called the Board of Investment (BOI) for carrying out the purposes of this Ordinance.\n(2)     The Board shall consist of__\n(a)     the Chief Executive of the Islamic Republic of Pakistan who shall be its\nPresident;\n(b)     Federal Minister in Charge of the Division, to which the business relating to the\nBOI is allocated, who shall be its Vice-President;\n(c)     Chairman of the BOI; and\n(d)     not less than seven and not more than twenty-five ex-officio members and non-\nofficial members, provided that not less than three non-official members shall\nbe appointed from private sector from amongst persons of renowned integrity,\nexpertise, experience and knowledge including, inter alia, academia, science,\nagriculture, banking, business, commerce, economic, engineering, finance,\nindustry, investment, law, marketing, mathematics, statistics and technology.\n(3)   The ex officio and the non-official members shall be appointed by the Federal\nGovernment and the terms and conditions of non-official members shall be such as the Federal\nGovernment may determine by notification in the official gazette.\n(4)    An ex officio member shall hold office as member till such time he holds the office by\nvirtue of which he is a member and upon his transfer, retirement, resignation, or removal from office,\nthe person appointed in such person's place shall be the member.\n(5)     The headquarters of the Board shall be at Islamabad and it may, with the approval of\nthe President, establish its regional offices or sub-offices within Pakistan and abroad."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Chairman",
      "content": "The Chairman shall__\n(a)     be appointed by the Federal Government on such terms and conditions as it may\ndetermine by notification in the official Gazette; and\n(b)     exercise such powers and perform such functions as may be assigned to him by\nthe Board."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Secretary",
      "content": "(l) The Federal Government may, either from the Federal Government or\nfrom the private sector, appoint a Secretary who shall attend meetings of the Board and perform such\nfunctions as the Chairman may assign.\n(2)     The Secretary shall be the principal staff officer and principal accounting officer of the\nBOI and shall have the status of a Secretary to the Federal Government."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Non",
      "content": "official members.__ (1) The members of the Board who are not appointed ex-\nofficio by the Federal Government hereinafter referred to as non-official members, shall hold office\nfor a term of two years and shall be eligible for re-appointment.\n(2)    A non-official member may, by writing under his hand addressed to the Federal\nGovernment, resign his office.\n(3)   A casual vacancy of any non-official member shall be filled in by appointment of\nanother member for the residue of the term of his predecessor.\n(4)    A non-official member shall hold office during the pleasure of the Federal Government,\nand may be removed from office if such member has, in the opinion of the Federal Government, so\nabused the position as to render his continuance in office detrimental to public interest:\nProvided that no member shall be removed from office until he has been given a reasonable\nopportunity of being heard."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Meetings of the Board",
      "content": "(1) Except as hereinafter provided, the Board shall regulate\nthe procedure for its own meetings.\n(2)     The Board shall meet at least once every three months.\n(3)     Meetings of the Board shall be presided__\n(a)     by the President;\n(b)     in the absence of the President, by the Vice-President;\n(c)     in the absence of both the President and the Vice-President by the Chairman, or\n(d)     in the absence of the President, the Vice-President and the Chairman, by a\nmember nominated by the President.\n(4)     The quorum for meeting shall be one-third of the total membership of the Board.\n(5)     All questions in the meetings of the Board shall be decided by a majority of the\nmembers present and voting; and in case of equality of votes, the person presiding over the meeting\nshall have a second or casting vote.\n(6)    Any urgent business of the Board may be transacted by circulation among all its\nmembers and any proposal so circulated and approved by a majority of the members shall be as\neffective and binding as if such proposal had been passed at a regular meeting of the Board."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Validity of proceedings",
      "content": "No act, proceedings, decision or order of the Board or a\nCommittee thereof shall be invalid by reason only of existence of any vacancy or defect in the\nconstitutional of the Board or, as the case may be, a Committee of the Board."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Functions of BOI",
      "content": "(1) Notwithstanding anything contained in any law the BOI shall__\n(a)    from time to time, review the national investment policy and laws, and propose\nany amendments, modifications and relaxations therein it may deem appropriate\nto the Cabinet for approval;\n(b)    initiate and consider sectoral investment proposals and categories of investment\nwhich may require specific treatment and propose such sectoral incentives or\nconditions or criteria requiring rationalization of existing policies; and\n(c)    be associated by the Federal Government in the formulation of all policies that\nmay have an impact on investment in Pakistan, including inter alia, economic,\nfiscal and trade policies;\n(d)    identify and promote the investment opportunities in different sectors and their\npromotion in Pakistan and abroad;\n(e)    co-ordinate with concerned Ministries, Departments, agencies and Provincial\nGovernments with regard to policies and their implementation having impact\non investment;\n(f)    provide one window facilities for provision of all services and utilities to\ninvestors by concerned Federal and Provincial Agencies;\n(g)    deal with matters relating to National Industrial Zones as may be referred to it\nby the Federal Government;\n(h)    monitor the progress of investment programmes and projects at all stages and\nensure, through inter-agency and inter-provincial coordination, prompt\nimplementation and operation;\n(i)    review investment promotion plans, formulate institutional arrangements, make\ntransparent and simplified procedures and guidelines for investment promotion;\n(j)    appraise, evaluate and process all investment proposals and projects received\nfrom the investors for submission to the Cabinet or a Committee of the Cabinet\nor the Board;\n(k)    appoint commissions, expert bodies and consultants to study various aspects of\nattracting investment in all sectors and improving the investment climate,\nprocedures and other related matters;\n(l)        maintain a data-base of investment projects in the private sector that involve\nlocal and foreign capital;\n(m)        negotiate and finalize agreements for protection and promotion of investment\nwith other countries and represent Pakistan on regional and international\norganizations pertinent to investment promotion;\n(n)        liaise with private sector trade bodies and associations for their active\nparticipation in promotion of investment;\n(o)        collect, compile, analyze, maintain and distribute investment-related\ninformation and, from time to time publish periodical analytical reports in\ninvestment trends;\n(p)        promote a congenial environment for investment by ensuring de-regulation and\nother measures to remove obstacles to investment;\n(q)        develop a marketing, image-building and public relations strategy to generate\ninterest in the potential and opportunities of the Pakistani market, and publicize\nits activities;\n(r)        communicate all major important administrative, financial and policy matters to\nthe management of business undertakings falling within the purview of the\ninvestment policy approved by the Government;\n(s)        establish Overseas Commissions consisting of prominent overseas Pakistani\nentrepreneurs and other individuals to act as investment promotion counsellors\npurely in an honorary capacity;\n(t)        consider individual investment proposals and categories of investment which\nrequire special treatment and recommend, where appropriate, additional\nincentives or relaxation of conditions or criteria required under existing policies;\n(u)        from time to time, determine and review the scale of fees and charges for\nservices provided to the investors by it; and\n(v)        any other function assigned by the Cabinet and the CCOI."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Directive of the Federal Government",
      "content": "For furthering the functions of the BOI, the\nFederal Government may, as arid when it considers necessary, issue directives to the BOI on matters\nof policy, and such directives shall be binding on the BOI. If a question arises whether any matter is a\nmatter of policy or not, the decision of the Federal Government shall be final.\n1[CHAPTER.__ IIA\nSPECIAL INVESTMENT FACILITATION COUNCIL (SIFC)"
    },
    {
      "provision_ref": "sec10a",
      "section": "10A",
      "title": "Section 10A. Establishment of a Special Investment Facilitation Council",
      "content": "(1) The Federal\nGovernment shall, by notification in the official gazette, establish a Special Investment Facilitation\nCouncil (SIFC), for carrying out the purposes envisioned under this Chapter of the Ordinance.\n1\nIns. by Act XLI of 2023, s.2.\n(2)     The SIFC shall consist of a Secretary, who shall also serve as the Principal Accounting\nOfficer, and such members, as may be notified by the Federal Government, from time to time.\n(3)     The President of the SIFC shall be the Prime Minister of Pakistan.\n(4)     The President of the SIFC may co-opt any person as a member, or may require\nattendance of any person by special invitation, as deemed appropriate."
    },
    {
      "provision_ref": "sec10b",
      "section": "10B",
      "title": "Section 10B. Scope of work of the Special Investment Facilitation Council",
      "content": "(1) The SIFC shall\nfacilitate investment and privatization in areas, including, but not limited to, Defence, agriculture,\ninfrastructure development, strategic initiatives, logistics, minerals, information technology,\ntelecommunication and energy (hereinafter referred to as the ‘Relevant Fields’) , and shall take all\nnecessary measures in order to establish, facilitate, encourage and promote opportunities for\ninvestment, as well as, inter alia, business in and for Pakistan.\n(2)      The Federal Government may notify any other area, sector, industry or projects as\nRelevant Field through a notification in the official Gazette to be processed under this Chapter.\n(3)    The Provincial Government or an entity authorized by the said Government in this\nbehalf may also refer any sector, industry or project to SIFC to be processed under this Chapter."
    },
    {
      "provision_ref": "sec10c",
      "section": "10C",
      "title": "Section 10C. Functions of the Special Investment Facilitation Council",
      "content": "(1) Without prejudice to\nthe generality of section 10B, the SIFC shall, inter alia.__\n(a)    act as Single Window for multi-domain cooperation in Relevant Fields with\nGCC countries, in particular, and other countries in general, for facilitation of\ninvestment and development of an enabling policy environment;\n(b)    recommend approvals, execute commercial transactions, and/or enter into\narrangements and agreements, directly or indirectly, with local and foreign\ninvestors;\n(c)    enter into commercial engagements and transact with governmental as well as\ncorporate entities, for the purposes envisioned under this Chapter of the\nOrdinance;\n(d)    prepare long-term road-map for growth, development and investment in the\n'Relevant Fields', while capitalizing on fast track initiatives;\n(e)    enhance awareness of Pakistan's latent potential in the 'Relevant Fields';\n(f)    improve ease of doing business by, inter alia, facilitating timely decision\nmaking, avoiding duplication of effort, fast-tracking investment and projects\nimplementations, etc.;\n(g)    monitor the progress of investment programs projects at all stages and ensure,\nthrough inter-agency and inter-provincial coordination, prompt implementation\nand operations thereof;\n(h)    review investment promotion plans, formulate institutional arrangements, make\ntransparent and simplified procedures and guidelines for investment\npromotion;\n(i)    appraise, evaluate and process all investment proposals and projects received\nfrom the investors;\n(j)    appoint commissions, expert bodies and consultants to study various aspects of\nattracting investment in all sectors;\n(k)    promote an enabling environment for investment by encouraging deregulation\nand other measures to remove unnecessary obstacles in the process;\n(l)    consider individual investment proposals as well as categories of investments\nthat require special treatment, and recommend, where appropriate, additional\nincentives or relaxation in the regulatory and policy framework; and\n(m)    perform any other function assigned by the Federal Government.\n(2)     In order to carry out its functions, the SIFC may adopt any procedure or process, with\nthe approval of the Federal Government."
    },
    {
      "provision_ref": "sec10d",
      "section": "10D",
      "title": "Section 10D. Formation of Committees",
      "content": "(1) For implementation of provision of this Chapter,\nSIFC may constitute executive and implementation committees.\n(2)     The committees shall perform such functions as may be assigned to them by SIFC, in\naddition to facilitation and supervision of projects, transactions, arrangements and agreements made\nor carried out under this Chapter of the Ordinance."
    },
    {
      "provision_ref": "sec10e",
      "section": "10E",
      "title": "Section 10E. Power to issue directions",
      "content": "(1) For furthering the objectives of this Chapter, the SIFC\nmay, as and when it considers necessary, issue recommendation, advice of directions to the respective\nregulatory bodies, authorities public sector entities, divisions and departments of the Federal\nGovernment, on matters within their respective domains, which shall, to the extent not inconsistent\nwith applicable law be binding.\n(2)      SIFC shall have powers to summon any regulatory bodies, authorities, public sector\nentities, divisions and departments of the Federal Government, or a representative thereof, in case\nrequisite regulatory licenses, certificates and/or any other legal permits and permissions required to\ncommence, foster or grow investment operations are delayed unnecessarily which may hamper\ninvestor (s) sentiment and inflow of investment\n(3)    Powers specified in sub-sections (1) and (2) shall mutatis mutandis be exercisable by\nSIFC in respect of projects referred to the SIFC by the Provincial Government."
    },
    {
      "provision_ref": "sec10f",
      "section": "10F",
      "title": "Section 10F. Power to relax or exempt from regulatory compliance",
      "content": "The Federal Government,\nupon recommendation of the SIFC, by notification in the official Gazette and subject to such\nconditions, limitations or restriction’s if any as may be specified therein, may relax or exempt from\na regulatory requirement or operation necessitated by any law for the time being in force for\nimplementing projects, transactions, arrangements and agreements under this Chapter:\nProvided that the relaxation or exemption, granted under this section, shall be granted in\naccordance with the provisions of the respective laws."
    },
    {
      "provision_ref": "sec10g",
      "section": "10G",
      "title": "Section 10G. Immunity",
      "content": "(1) No suit, prosecutions or any other legal proceedings or action, in\ndamages or otherwise shall lie against SIFC or any of its members or consultants for any act done,\nprocedural lapse sufferd, or omission made, in exercise or performance of any functions, power or duty\nconferred or imposed by or under this Chapter.\n(2)     Notwithstanding anything contained in any other law for the time being inforce, as\ninvestigating agency, anti-graft agency, law enforcement agency or a court shall not inquire into or\ninitiate investigation in relation to, inter alia, any commercial transaction, arrangement or agreement\nmade under this chapter, unless there exists material evidence of mala fides or bad faith on part of any\nperson involved in the said commercial transaction, arrangement or agreement.\n(3)     No person shall be liable in his personal capacity for any action taken in his official\ncapacity.\n(4)      Any procedural irregularity or lapse shall not affect, vitiate, set-aside, annul or\nrescind, inter alia, any transaction, arrangement or agreement under this Chapter."
    },
    {
      "provision_ref": "sec10h",
      "section": "10H",
      "title": "Section 10H. Overriding effect",
      "content": "The provisions of this Chapter shall have effect notwithstanding\nanything contrary contained in any other law or instrument having the force of law for time being in\nforce and in the event of any inconsistency between the provisions of this Chapter and any other law\nwhether enacted prior or subsequent to the commencement of the Board of Investment (Amendment)\nAct, 2023, the provisions of this Chapter shall prevail."
    },
    {
      "provision_ref": "sec10i",
      "section": "10I",
      "title": "Section 10I. Power to make rules",
      "content": "The SIFC may with prior approval of the Federal Government\nand by notification in the official Gazette, make rules for carrying out the purposes of this Chapter."
    },
    {
      "provision_ref": "sec10j",
      "section": "10J",
      "title": "Section 10J. Removal of difficulties",
      "content": "Where any difficulty arises in giving effect to any provision\nof this Chapter, the Federal Government may by notification in the official Gazette, make an order for\nthe removal of the difficulty.]\nCHAPTER.__ III"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Grants",
      "content": "The Federal Government may, from time to time, place annual grants at the\ndisposal of the BOI for the smooth discharge of its affairs."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Fund",
      "content": "(1) There shall be constituted a fund to be called the BOI Fund to which shall\nbe credited all sums received by the BOI and out of which shall be defrayed all its expenditure.\n(2) The Fund shall consist of__\n(a)     grants made by the Federal Government;\n(b)     foreign aid or loans obtained or raised by the BOI with the special or general\nsanction of the Federal Government; and\n(c)     all other sums including fees and charges receivable by the BOI."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Budget and accounts",
      "content": "(1) In respect of each financial year, the BOI shall submit for\napproval of the Federal Government, by such date and in such form as may be specified by the Federal\nGovernment, a statement showing the estimated receipts and expenditure and the sums which are likely\nto be required from the Federal Government during the next financial year.\n(2)     The BOI may open accounts with the State Bank of Pakistan or with any scheduled\nbank in Pakistan.\n(3)   The accounts of the BOI shall be maintained in such form and manner as the Federal\nGovernment may, in consultation with the Auditor-General of Pakistan, determine.\n(4)     The accounts of the BOI shall be audited every year by the office of the Auditor-General\nof Pakistan.\n(5)     The accounts of the BOI shall be expended for the purposes of__\n(a)     paying any expenditure lawfully incurred by it including the remuneration and\nallowances of the Chairman, the members, employees, advisers and consultants,\naccountants, lawyers, valuers, and other experts appointed and employed by its\nprovident fund contributions, superannuation allowances or gratuities, legal fees\nand costs, and other fees and costs, if any;\n(b)     paying for expenditure incurred on__\n(i)     marketing and publicity; and\n(ii)    seminars and conferences;\n(c)     purchasing or hiring equipment, machinery and any other materials, acquiring\nland, erecting buildings and conducting other work and undertakings in the\nperformance of its functions or the exercise of its powers under this Ordinance;\nand\n(d)     paying any other expenses, costs or expenditure properly incurred or accepted\nby the BOI in the performance of its functions or the exercise of its powers\nunder this Ordinance."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Annual Report",
      "content": "(1) The BOI shall prepare and submit to the Federal Government, as\nsoon as possible after the end of each financial year but not later than the last day of December of the\nnext year, a report on the conduct of its affairs for that year.\n(2)     The report shall include__\n(a)     an audited statement of income and expenditure;\n(b)     an audited balance sheet;\n(c)     a short financial statement of the preceding financial year;\n(d)     activities of the BOI during the preceding financial year;\n(e)     an outline of the investment programme for the year ahead; and\n(f)     any other matter which the Federal Government may direct or the BOI may\nconsider appropriate.\nCHAPTER.__ IV"
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Provincial Investment Committees",
      "content": "(1) The Provincial Government shall, by\nNotification in the official Gazette, establish a Committee to be called the Provincial Investment\nCommittee.\n(2)      The Provincial Investment Committee shall consist of such members as the Provincial\nGovernment may appoint, by Notification in the Official Gazette and the Chairman and the Secretary\nshall be its ex-officio members.\n(3)     Subject to any directions given by the BOI, the Provincial Investment Committee shall\nperform the following functions, namely:__\n(a)     encourage and promote investment, including joint ventures in the Province, in\ncollaboration with the BOI;\n(b)     assist the BOI to discharge its functions;\n(c)     maintain a continuing working relationship and coordination with the BOI to\nfacilitate and promote local and foreign investment in the Province;\n(d)     help and facilitate effective implementation of investment policies of the\nFederal Government including the speedy development of National Industrial\nZones;\n(e)     identify investment opportunities and priority areas for investment in the\nProvince, and assist the BOI in marketing those opportunities to prospective\ninvestors; and\n(f)     ensure infrastructure facilities such as roads, water and drainage in the existing\nand future industrial estates and National Industrial Zones in the Province.\nCHAPTER.__ V"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Delegation of powers",
      "content": "The BOI may by general or special order, delegate to the\nChairman, the Secretary or any officer of the BOI, any of its powers or functions subject to such\nconditions as it may deem fit to impose."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Recruitment etc",
      "content": "(1) The BOI may appoint such officers, advisers, consultants and\nemployees as it considers necessary for the efficient performance of its functions on such terms and\nconditions as may be prescribed under the rules made with the prior approval of the Federal\nGovernment:\nProvided that all appointments shall be made in accordance with the prescribed educational,\ntechnical or professional qualifications and experience.\n(2)    The age of superannuation shall be sixty years for the employees of the BOI."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Members, officers, staff, etc. deemed to be public servants",
      "content": "Subject to other\nprovisions of this Ordinance, every officer and employee of the BOI shall be deemed to be a public\nservant within the meaning of section 21 of the Pakistan Penal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Assistance from other agencies",
      "content": "(1) The BOI may require any information from all\nsources including private sector organizations and agencies, any Ministry, Division Department,\nstatutory body, corporation, agency of the Federal Government or a Provincial Government which, in\nits opinion, concerns any matter relating to the BOI, and the requisite information shall be provided to\nthe BOI within a fortnight of the receipt of such request.\n(2)    The BOI may request any Ministry, Division Department, statutory body, corporation,\nagency of the Federal Government or a Provincial Government, to review such proposals, policies,\ndirections, guidelines, notifications, circulars, orders, regulations and rules, which, in its opinion,\nconcern any matter relating to the BOI, and the concerned Ministry, Division, Department, statutory\nbody, corporation, agency of the Federal Government or a Provincial Government shall give its\ndecision in writing based on sound reasons within a fortnight of such request.\n(3)     Subject to subsection (4), if, upon receiving the decision under subsection (2), the BOI\nis of opinion that the decision adversely affects any policy relating to its working, it may request the\nconcerned Ministry, Division, Department, statutory body, corporation, agency of the Federal\nGovernment or a Provincial Government to review such decision in consultation with it or its\nauthorized officer.\n(4)     In case the BOI is not satisfied with the revised decision of the Ministry, Division,\nDepartment, statutory body, corporation, agency of the Federal Government or a Provincial\nGovernment under subsections (2) and (3), the unresolved issue shall be placed before the CCOI or\nthe BOI wherein the representative from the concerned Ministry, Division, Department, statutory\nbody, corporation etc., would be invited by special invitation to assist the CCOI or the BOI to arrive\nat a final decision."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Indemnity",
      "content": "No suit, prosecution, or other legal proceeding shall lie against the BOI,\nthe Chairman, the Secretary, the members, the employees and consultants of the BOI for anything\ndone in good faith or intended to be done under this Ordinance or any rule or regulation made\nthereunder."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Transfer of employees and assets",
      "content": "(1) Notwithstanding anything contained in any\nlaw, contract or agreement or in the terms and conditions of service, every person, other than\nemployees of other Departments and members of regularly constituted Service Groups posted on\ndeputation or employed in the Board of Investment and serving in or under it immediately before the\ncommencement of this Ordinance including employees of the BOI on deputation to other\norganizations, shall cease to be civil servants and stand transferred to and become employees of the\nBOI on such terms and conditions as may be prescribed by rules to be made under section 23:\nProvided the terms or conditions of the persons so transferred shall not be less favourable than\nthose applicable to them before the commencement of this Ordinance.\n(2)     Notwithstanding anything contained in any other law for the time being in force, no\nperson who has been transferred to the BOI under subsection (1) shall be entitled to any compensation\non account of such transfer.\n(3)      All funds, properties, rights and interests of whatsoever kind issued, used, enjoyed,\npossessed, owned or vested in the BOI, in existence before the commencement of this Ordinance, and\nall liabilities legally subsisting against the said Board shall vest in and become the liabilities of the\nBOI established under this Ordinance.\n(4)     All suits, other legal proceedings instituted by or against the BOI in existence\nimmediately before the commencement of this Ordinance and all orders issued, instructions executed,\nmeasures taken, etc., in relation thereto, shall be deemed to pertain to the BOI established under this\nOrdinance, and may proceed and be dealt with accordingly.\n(5)     All debts and liabilities incurred, contracts entered into or rights acquired and all matters\nand all things, engaged to be done, by with or for the BOI, in existence before the commencement of\nthis Ordinance, shall be deemed to have been incurred, entered into, acquired or engaged to be done\nby, with or for the BOI established under this Ordinance."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Committees",
      "content": "To assist it in the performance of its functions, the BOI may constitute\nsuch committees consisting of such persons as it may deem fit."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Power to make rules",
      "content": "(1) The BOI may, with the prior approval of the Federal\nGovernment, make rules for carrying out the purposes of this Ordinance and to regulate appointments\nand conditions of service of officers and employees in the service of the BOI; and\n(2)      Until the rules referred to in subsection (1) are made, the officers and employees of the\nBOI shall continue to be governed, in respect of the matters terms and conditions of service by rules\napplicable to them immediately before the commencement of this Ordinance."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Power to make regulations",
      "content": "The BOI may, by Notification in the Official Gazette,\nmake regulations, not inconsistent with the provisions of this Ordinance or the rules, for carrying out"
    }
  ],
  "definitions": [
    {
      "term": "Chairman",
      "definition": "the Chairman of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "CCOI",
      "definition": "the Cabinet Committee on Investment constituted by Notification No.38(Cab)/97, dated 13th September, 1997;",
      "source_provision": "sec2"
    },
    {
      "term": "Investment Policy",
      "definition": "the investment policy, the CCOI may, from time to time, approve;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "the member of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "National Industrial Zone",
      "definition": "an industrial estate, an export processing zone, a free industrial zone and export oriented unit or a free trade zone, notified as such by the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "President",
      "definition": "President of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "Provincial Investment Committee",
      "definition": "any Provincial Investment Committee established under section 16;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "Secretary",
      "definition": "the Secretary of the BOI; and",
      "source_provision": "sec2"
    },
    {
      "term": "Vice-President",
      "definition": "the Vice-President of the Board. CHAPTER.__ II",
      "source_provision": "sec2"
    }
  ]
}
