{
  "id": "pk-bonded-labour-system-abolition-act-1992",
  "type": "statute",
  "title": "Bonded Labour System (Abolition) Act, 1992",
  "title_en": "Bonded Labour System (Abolition) Act, 1992",
  "short_name": "BLSA",
  "status": "in_force",
  "issued_date": "1992-03-10",
  "in_force_date": "1992-03-10",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apmYag%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Bonded Labour System (Abolition) Act, 1992 (III of 1992) published by The Pakistan Code (Labour Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Bonded Labour\nSystem (Abolition) Act, 1992.\n(2)    It extends to the whole of Pakistan.\n(3)    It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,__\n(a)     “advance (peshgi)” means an advance (peshgi), whether in cash or in kind, or partly\nin cash or partly in kind, made by one person (hereinafter referred to as the creditor)\nto another person (hereinafter referred to as the debtor);\n(b)     “bonded debt” means an advance (peshgi) obtained, or presumed to have been\nobtained, by a bonded labourer under, or in pursuance of, the bounded labour\nsystem ;\n(c)     “bonded labour” means any labour or service rendered under the bonded labour\nsystem ;\n(d)     “bonded labourer” means a labour who incurs, or has, or is presumed to have,\nincurred, a bonded debt;\n(e)     “bonded labour system” means the system of forced, or partly forced, labour under\nwhich a debtor enters, or has, or is presumed to have, entered into an agreement\nwith the creditor to the effect that,—\n(i)     in consideration of advance (peshgi) obtained by him or by any of the\nmembers of his family [whether or not such advance (peshgi) is evidence\nby any document] and in consideration of the interest, if any, due on such\nadvance (peshgi), or\n(ii)    in pursuance of any customary or social obligation, or\n(iii)   for any economic consideration received by him or by any of the members\nof his family ;\nhe would—\n(1)     render, by himself or through any member of his family, or any person dependent\non him, labour or service to the creditor, or for the benefit of the creditor, for a\nspecified period or for an unspecified period, either without wages or for nominal\nwages, or\n(2)     forfeit the freedom of employment or adopting other means of livelihood for a\nspecified period or for an unspecified period, or\n(3)     forfeit the right to move freely from place to place, or\n(4)     forfeit the right to appropriate or sell at market value any of his property or product\nof his labour or the labour of a member of his family or any person dependent on\nhim,\nand includes the system of forced, or partly forced, labour under which a surety for a debtor enters,\nor has or is presumed to have, entered, into an agreement with the creditor to the effect that, in the\nevent of the failure of the debtor to repay the debt, he would render the bonded labour on behalf\nof the debtor ;\n(f)     “family” means,—\n(i)     in the case of a male bonded labourer, the wife or wives, and in the case of\na female bonded labourer, the husband of the bonded labourer; and\n(ii)    the parents, children, minor brother, and unmarried, divorced or widowed\nsisters of the bonded labourer wholly dependent on him ;\n(g)     \"nominal wages’, in relation to any labour, means a wage which is less than,—\n(a)     the minimum wages fixed by the Government, in relation to the same or\nsimilar labour, under any law for the time being in force ; and\n(b)     where no such minimum wage has been fixed in relation to any form of\nlabour, the wages that are normally paid, for the same or similar labour, to\nthe labourers working in the same locality ; and\n(h)     “prescribed” means prescribed by rules made under this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Act to override other laws, etc. The provisions of this Act shall have effect",
      "content": "notwithstanding anything contained in any other law for the time being in force or in any instrument\nhaving effect by virtue of any such law."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Abolition of bonded labour system",
      "content": "(1) On the commencement of this Act, the bonded\nlabour system shall stand abolished and every bonded labourer shall stand freed and discharged from any\nobligation to render any bonded labour.\n(2)     No person shall make any advance under, or in pursuance, of, the bonded labour system or\ncompel any person to render any bonded labour or other form of forced labour."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Agreement, custom, etc., to be void. Any custom or tradition or practice or any contract,",
      "content": "agreement or other instrument, whether entered into or executed before or after the commencement of this\nAct, by virtue of which any person, or any member of his family, is required to do any work or render any\nservice as a bonded labourer, shall be void and inoperative."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Liability to repay bonded debt to stand extinguished",
      "content": "(1) On the commencement of\nthis Act, every obligation of a bonded labourer to repay any bonded debt, or such part of any bonded debt\nas remains unsatisfied immediately before such commencement, shall stand extinguised.\n(2)     After the commencement of this Act, no suit or other proceeding shall lie in any civil court,\ntribunal or before any other authority for the recovery of any bonded debt or any part thereof.\n(3)    Every decree or order for the recovery of bonded debt, passed before the commencement\nof this Act and not fully satisfied before such commencement, shall be deemed, on such commencement,\nto have been fully satisfied.\n(4)     Where, before the commencement of this Act, possession of any property belonging to a\nbonded labourer or a member of his family was forcibly taken by any creditor for the recovery of any\nbonded debt, such property shall be restored, within ninety days of such commencement, to the possession\nof the person from whom it was sized.\n(5)    Every attachment made before the commencement of this Act for the recovery of any\nbonded debt shall, on such commencement, stand vacated; and, where, in pursuance of such attachment,\nany movable property of the bonded labourer was seized and removed from his custody and kept in the\ncustody of any court, tribunal or other authority pending sale thereof, such movable property shall be\nrestored, within ninety days of such commencement, to the possession of the bonded labourer :\nProvided that, where any attached property was sold before the commencement of this Act, in\nexecution of a decree or order for the recovery of a bonded debt such sale shall not be affected by any\nvision of this Act.\n(6)    Subject to the proviso to sub-section (5), any sale, transfer or assignment of any property\nof a bonded labourer made in any manner whatsoever before the commencement of this Act for recovery\nof bonded debt shall not be deemed to have created or transferred any right, or interest in or encumbrance\nupon any such property and such property shall be restored, within ninety days of such commencement,\nto the possession of the bonded labourer.\n(7)     If restoration of the possession of any property referred to in sub-section (4) or sub-section\n(5) or sub-section (6) is not made within ninety days from the commencement of this Act, the aggrieved\nperson may, within such time as may be prescribed, apply to the prescribed authority for the restoration\nof the possession of such property and the prescribed authority may, after giving the creditor a reasonable\nopportunity of being heard, direct the creditor to retore to the applicant the possession of the said property\nwithin such time as may be specified in the order.\n(8)     An order made by any prescribed authority under sub-section (7) shall be deemed to be an\norder made by a civil court and may be executed by the court of the lowest pecuniary jurisdiction within\nthe local limits of whose jurisdiction the creditor voluntarily resides or carries on business or personally\nworks for gain.\n(9)     Where any suit or proceeding for the enforcement of any obligation under the bonded\nlabour system, including a suit or proceeding for the recovery of any advance (peshgi) made to a bonded\nlabourer, is pending at the commencement of this Act, such suit or other proceeding shall, on such\ncommencement, stand dismissed.\n(10) On the commencement of this Act, every bonded labourer who has been detained in civil\nprison, whether before or after judgement, shall be released from detention forthwith."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Property of bonded labour to be freed from mortgage, etc",
      "content": "(1) All property vested in\na bonded labouer which was, immediately before the commencement of this Act, under any mortgage,\ncharge, lien or other encumbrance in connection with any bonded debt shall, in so far as it is relatable to\nthe bonded debt, stand freed and discharged from such mortgage, charge, lien or other encumbrance ; and\nwhere any such property was immediately before the commencement of this Act, in the possession of the\nmortgagee or the holder of the charge, lien or encumbrance, such property shall, except where it was\nsubject to any other charge, on such commencement, be restored to the possession of the bonded labourer.\n(2)     If any delay is made in restoring any property referred to in sub-section (1) to the possession\nof the bonded labourer, such labourer shall be entitled, on and from the date of such commencement, to\nrecover from the mortgagee or holder of the lien, charge or encumbrance, such mesne profits as may be\ndetermined by the civil court of the lowest pecuniary jurisdiction within the local limits of whose\njurisdiction such property is situated."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Creditor not to accept payment against extinguished debt",
      "content": "(1) No creditor shall\naccept any payment against any bonded debt which has been extinguished or deemed to have been\nextinguished or fully satisfied by virtue of the provisions of this Act.\n(2)    Whoever contravenes the provisions of sub-section (1), shall be punishable with\nimprisonment for a term which may extend to three years, or with fine which shall not be less than fifteen\nthousand rupees, or with both.\n(3)    The court convicting any person under sub-section (2) may, in addition to the penalties\nwhich may be imposed under that sub-section, direct such person to deposit, in court, the amount accepted\nin contravention of the provisions of sub-section (1), within such period as may be specified in the order,\nfor being refunded to the bonded labourer."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Authorities who may be specified for implementing the provisions of this Act. The",
      "content": "Provincial Government may confer such powers and impose such duties on a District Magistrate as may\nbe necessary to ensure that the provisions of this Act are properly carried out and the District Magistrate\nmay designate an officer subordinate to him to exercise all or any of the powers, and perform all or any\nof the duties, so conferred or imposed and specify the local limits within which such powers or duties\nshall be carried out by such officer."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Duty of District Magistrate and other officers designated by him",
      "content": "(1) The District\nMagistrate authorised by the Provincial Government under section 9, and the officer designated by the\nDistrict Magistrate under that section, shall, as far as practicable, try to promote the welfare of the freed\nbonded labourer by securing and protecting the economic interests of such bonded labourer so that he may\nnot have any occasion or reason to contract any further bonded debt.\n(2)     It shall be the duty of every District Magistrate and every officer designated by him under\nsection 9 to inquire whether, after the commencement of this Act, any bonded labour system or any other\nform of forced labour is being enforced by, or on behalf of, any person resident within the local limits of\nhis jurisdiction and if, as a result of such inquiry, any person is found to be enforcing the bonded labour\nsystem or any other system of forced labour, he shall forthwith take such action as may be necessary to\nimplement the provisions of this Act."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Punishment for enforcement of bonded labour. Whoever, after the commencement of",
      "content": "this Act compels any person to render any bonded labour shall be punishable with imprisonment for a\nterm which shall not be less than two years nor more than five years, or with fine which shall not be less\nthan fifty thousand rupees, or with both."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Punishment for extracting bonded labour under the bonded labour system. Whoever",
      "content": "enforces, after the commencement of this Act any custom, tradition, practice, contract, agreement or other\ninstrument, by virtue of which any person or any member of his family is required to render any service\nunder the bonded labour system, shall be punishable with imprisonment for a term which shall not be less\nthan two years nor more than five years or with fine which shall not be less than fifty thousand rupees, or\nwith both ; and out of the fine, if recovered, payment shall be made to the bonded labourer at the rate of\nnot less than fifty rupees for each day for which bonded labour was extracted from him."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Punishment for omission or failure to restore possession of property to, bonded",
      "content": "labourer. Whoever, being required by this Act to restore any property to the possession of any bonded\nlabour, omits or fails to do so, within a period of ninety days from the commencement of this Act shall be\npunishable with imprisonment for a term which may extend to one year, or with fine which may extend\nto one thousand rupees, or with both ; and out of the fine, if recovered, payment shall be made to the\nbonded labourer at the rate of ten rupees for each day during which possession of the property was not\nrestored to him."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Abetment to be an offence. Whoever abets any offence punishable under this Act shall,",
      "content": "whether or not the offence abetted is committed, be punishable with the same punishment as is provided\nfor the offence which has been abetted.\nExplanation.— For the purpose of this section, “abetment” has the same meaning as is assigned to\nit in the Pakistan Penal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Vigilance Committees",
      "content": "(1) Vigilance Committees shall be set up at the District level in\nthe prescribed manner, consisting, of elected representatives of the area, representatives of the District\nAdministration, Bar associations, Press, recognized Social Services and Labour Departments of the\nFederal and Provincial Governments.\n(2)     The following shall be the functions of the Vigilance Committees, namely:—\n(a)     to advise the District Administration on matters relating to the effective\nimplementation of the law and to ensure its implementation in a proper manner ;\n(b)     to help in the rehabilition of the freed bonded labourer ;\n(c)     to keep an eye on the working of the law ; and\n(d)     to provide the bonded labourers such assistance as may be necessary to achieve the\nobjectives of the law."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Offences to be tried by the Magistrate",
      "content": "(1) A Magistrate of the first class empowered\nin this behalf by the Provincial Government may try any offence under this Act.\n(2)     An offence under this Act may be tried summarily."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Offences by companies",
      "content": "(1) Where an offence under this Act has been committed by a\ncompany, every person who, at the time the offence was committed, was in charge of, and was responsible\nto, the company for the conduct of the business of the company, as well as the company, shall be deemed\nto be guilty of the offence and shall be liable to be proceeded against and punished accordingly.\n(2)     Notwithstanding anything contained in sub-section (1), where any offence under this Act,\nhas been committed by a company and it is proved that the offence has been committed with the consent\nor connivance of, or is attributable to, any neglect on the part of any director, manager or other officer of\nthe company, such director, manager or other officer shall be deemed to be guilty of that offence and shall\nbe liable to be proceeded against and punished accordingly.\nExplanation.— For the purposes of this section,—\n(a)     “company” means any body corporate, and includes a firm or other association of\nindividuals ; and\n(b)     “director”, in relation to a firm, means a partner in the firm."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Protection of action taken in good faith. No suit, prosecution or other legal proceeding",
      "content": "shall lie against Government or any officer of the Government for anything which is in good faith done\nor intended to be done under this Act."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Jurisdiction of courts barred. Save as otherwise provided in this Act no court shall have",
      "content": "jurisdiction in respect of any matter to which any provision of this Act applies and no injunction shall be\ngranted by any court in respect of anything which is done or intended to be done under this Act."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Power to make rules. The Federal Government may, by notification in the official",
      "content": "Gazette, make rules for carrying out the purposes of this Act."
    }
  ],
  "definitions": [
    {
      "term": "advance (peshgi)",
      "definition": "an advance (peshgi), whether in cash or in kind, or partly in cash or partly in kind, made by one person (hereinafter referred to as the creditor) to another person (hereinafter referred to as the debtor);",
      "source_provision": "sec2"
    },
    {
      "term": "bonded debt",
      "definition": "an advance (peshgi) obtained, or presumed to have been obtained, by a bonded labourer under, or in pursuance of, the bounded labour system ;",
      "source_provision": "sec2"
    },
    {
      "term": "bonded labour",
      "definition": "any labour or service rendered under the bonded labour system ;",
      "source_provision": "sec2"
    },
    {
      "term": "bonded labourer",
      "definition": "a labour who incurs, or has, or is presumed to have, incurred, a bonded debt;",
      "source_provision": "sec2"
    },
    {
      "term": "bonded labour system",
      "definition": "the system of forced, or partly forced, labour under which a debtor enters, or has, or is presumed to have, entered into an agreement with the creditor to the effect that,— (i) in consideration of advance (peshgi) obtained by him or by any of the members of his family [whether or not such advance (peshgi) is evidence by any document] and in consideration of the interest, if any, due on such advance (peshgi), or (ii) in pursuance of any customary or social obligation, or (iii) for any economic consideration received by him or by any of the members of his family ; he would— (1) render, by himself or through any member of his family, or any person dependent on him, labour or service to the creditor, or for the benefit of the creditor, for a specified period or for an unspecified period, either without wages or for nominal wages, or (2) forfeit the freedom of employment or adopting other means of livelihood for a specified period or for an unspecified period, or (3) forfeit the right to move freely from place to place, or (4) forfeit the right to appropriate or sell at market value any of his property or product of his labour or the labour of a member of his family or any person dependent on him, and includes the system of forced, or partly forced, labour under which a surety for a debtor enters, or has or is presumed to have, entered, into an agreement with the creditor to the effect that, in the event of the failure of the debtor to repay the debt, he would render the bonded labour on behalf of the debtor ;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act.",
      "source_provision": "sec2"
    }
  ]
}
