{
  "id": "pk-cantonments-house-accommodation-act-1923",
  "type": "statute",
  "title": "Cantonments (House-Accommodation) Act, 1923",
  "title_en": "Cantonments (House-Accommodation) Act, 1923",
  "short_name": "Cantonments (House-Accommodation) Act, 1923",
  "status": "in_force",
  "issued_date": "1923-03-04",
  "in_force_date": "1923-03-04",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apyc-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Cantonments (House-Accommodation) Act, 1923 (VI of 1923) published by The Pakistan Code (Rent Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Act may be called the Cantonments\n(House Accommodation) Act, 1923.\n1\n[(2) It extends to the whole of Pakistan.]\n(3) It shall come into force on the first day of April, 1923, but it shall not become operative in\nany cantonment or part of a cantonment until the issue, or otherwise than in pursuance, of a notification\nas hereinafter provided by section 3:\nProvided that any notification made under section 3 of the Cantonments (House-\nAccommodation) Act, 1902 (II of 1902), which is in force at the commencement of this Act, shall be\ndeemed to be a notification made under section 3 of this Act."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_(1) In this Act, unless there is anything repugnant in the subject or context, ___\n(a)        “Brigade area” means one of the Brigade areas, whether occupied by a brigade\nor not, into which 2[Pakistan] is for military purposes for the time being divided,\nand includes any area which the 3[Federal Government] may, by notification in\nthe 3[official Gazette], declare to be a Brigade area for all or any of the purposes\nof this Act;\n4\n(b)            [*     *          *          *          *          *          *]\n[ [(b)] “Cantonment Board” means a Cantonment Board constituted under the\n5 4\nCantonments Act, 1924; (II of 1924)]\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s. 3.\n2\nSubs. by the Adaptation of Central Acts & Ordinances Order, 1949 (Order No. 1 of 1949), s. 3 and Sch.\n3\nSubs. by Federal Adaption of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table.\n4\nOmitted and re-lettered by Act No. IX of 1930, s. 2.\n5\nIns. by Act No. X of 1925, s. 2.\n(c)        “Command” means one of the Commands into which 1[Pakistan] is for military\npurposes for the time being divided, and includes any area which the 2[Federal\nGovernment] may, by notification in the 2[official Gazette], declare to be a\nCommand for all or any of the purposes of this Act;\n(d)        “3[Officer Commanding the station]” means the Officer for the time being in\ncommand of the forces in a cantonment 4[or, if that officer is the Officer\nCommanding the District, the military officer who would be in command of\nthose forces in the absence of the Officer Commanding the District];\n(e)        “District” means one of the Districts into which 5[Pakistan] is for military\npurposes for the time being divided; it includes a Brigade area which does not\nform part of any such District and any area which the 2[Federal Government]\nmay, by notification in the 2[official Gazette], declare to be a District for all or\nany of the purposes of this Act;\n(f)        “house” means a house suitable for occupation by a military officer or a military\nmess, and includes the land and buildings appurtenant to a house;\n(g)        “military officer” means a commissioned or warrant officer of 6[the military or\nair forces of Pakistan] on military or air-force duty in a cantonment, and\nincludes a Chaplain on duty with troops in a cantonment, 3[an officer of the\nCantonments Department] and any person in Army departmental employment\nwhom the Officer Commanding the District may at any time, by an order in\nwriting, place on the same footing as a military officer for the purposes of this\nAct;\n(h)        “owner” includes the person who is receiving, or is entitled to receive, the rent\nof a house, whether on his own account or on behalf of himself and others or as\nan agent or trustee, or who would so receive the rent, or be entitled to receive it,\nif the house were let to a tenant; and\n(i)        a house is said to be in a state of reasonable repair when___\n(i)        all floors, walls, pillars and arches are sound and all roofs sound and\nwatertight,\n(ii)       all doors and windows are intact, properly painted or oiled, and provided\nwith proper locks or bolts or other secure fastenings, and\n(iii)      all rooms, out-houses and other appurtenant buildings are properly\ncolour-washed or white-washed.\n1\nSubs. by Federal Laws (Revision and Declaration) Act, 1951 (XXVI of 1951), s. 4 and Sch. III.\n2\nSubs. by Adaptation Order, 1937.\n3\nSubs. by Act No. X of 1925, ss. 2 and 6.\n4\nIns. by Act No. IX of 1930, s. 2.\n5\nSubs. by the Adaptation of Central Acts & Ordinances Order, 1949 (Order No. 4 of 1949), Art. 3 and Sch.\n6\nSubs. by the Central Laws (Adaptation) Order, 1961 (P.O. No. 1 of 1961), Art. 2 and Sch.\n(2) If any question arises whether any land or building is appurtenant to a house, it shall be\ndecided by the 1[Officer Commanding the station] whose decision thereon shall, subject to revision by\nthe 2[Collector], be final.\n__________"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Cantonments or parts of cantonments in which Act to be operative",
      "content": "_(1) The 3[Federal\nGovernment], 3[* * *] may, by notification in the 4[official Gazette], declare this Act to be operative\nin any cantonment or part of a cantonment 3[* * *], 4[* * *].\n(2) Before issuing a notification under sub-section (1) in respect of any cantonment or part of\na cantonment, the 3[Federal Government] shall cause local inquiry to be made with a view to\ndetermining whether it is expedient to issue such notification, and what portion (if any) of the area\nproposed to be included therein should be excluded therefrom.\n4\n[4. Saving of written instruments. Nothing in this Act shall affect the provisions of any\n6\nwritten [Government] contract unless all the parties to that contract consent in writing to be bound by\nthe terms of this Act.]\n________"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Liability of houses to appropriation. Every house situate in a cantonment or part of a",
      "content": "cantonment in respect of which a notification under sub-section (1) of section 3 is for the time being\nin force shall be liable to appropriation by 4[the 3[Federal Government]] on a lease in the manner and\nsubject to the conditions hereinafter provided.\n2\n[6. Conditions on which houses may be appropriated.___(1) Where___\n(a)        a military officer who is stationed in or has been posted to the cantonment, or a\nPresident of a military mess in the cantonment, applies in writing to the Officer\nCommanding the Station stating that he is unable to secure suitable\naccommodation in the cantonment for himself or the mess on reasonable terms\nby private agreement, and that no suitable house or quarter 4[belonging to the\nGovernment] is available for his occupation or for the occupation of the mess,\nand the Officer Commanding the Station is satisfied on inquiry of the truth of\nthe facts so stated ; or\n1\nSubs. by Act No. X of 1925, s. 6.\n2\nSubs. by Act No. IX of 1930, ss. 2-3.\n3\nSubs. and omitted by Federal Adaptation of Laws Order, 1975 (P.O. No. 4 of 1975), Art. 2 and Table.\n4\nSubs. by Adaptation Order, 1937.\n5\nOmitted by the Adaptation of Central Acts & Ordinances Order, 1949 (Order No. 4 of 1949), Art. 3 and Sch.\n6\nSubs. by Central Laws (Adaptation) Order, 1961 (P.O. No. 1 of 1961), Art. 2 and Table.\n(b)       the Officer Commanding the Station is satisfied on inquiry that there is not in\nthe cantonment a sufficient and assured supply of houses available at reasonable\nrates of rent by private agreement to meet the requirements of the military\nofficers and military messes whose accommodation in the cantonment is in his\nopinion necessary or expedient,\nthe Officer Commanding the Station may, with a view to enforcing the liability under section 5, serve\na notice on the owner of any house which appears to him to be suitable for occupation by a military\nofficer or a military mess, as the case may be, within the cantonment, or, if this Act is in force in part\nonly of the cantonment, within that part, requiring the owner to permit the house to be inspected,\nmeasured and surveyed by such person and on such date, not being less than three clear days form the\nservice of the notice, and at such time between sunrise and sunset, as may be specified in the notice.\n(2) On the date and at the time so specified the owner shall be bound to afford all reasonable\nfacilities to the person specified in the notice for the purpose of the inspection, measurement and survey\nof the house and if he refuses or neglects to do so, such person may, subject to any rules made under\nthis Act, enter on the premises and do all such things as may be reasonably necessary for the said\npurpose.]"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Procedure for taking house on lease",
      "content": "_(1) If, on the report of such person as aforesaid, the\n1\n[Officer Commanding the station] is satisfied that the house is suitable for occupation by a military\nofficer or a military mess, he may, 2[* * *] by notice___\n(a)        require the owner to execute a lease of the house to 3[the 4[Federal\nGovernment]] for a specified period which shall not be less than five years;\n(b)        require the existing occupier, if any, to vacate the house; and\n(c)        require the owner to execute within such time as may be specified in the notice\nsuch repairs as may, in the opinion of the 1[Officer Commanding the station],\nbe necessary for the purpose of putting the house into a state of reasonable\nrepair.\n(2) Every notice issued under sub-section (1) shall state the amount of the annual rent proposed\nas reasonable for the house, calculated on the assumption that the owner will carry out the required\nrepairs, if any. It shall also contain an estimate of the cost of such repairs.\n(3) The following shall be deemed to be conditions of every lease executed under sub-section\n(1), namely:___\n(a)        that the house shall, on the expiration of the lease, be re-delivered to the owner\nin a state of reasonable repair, and\n(b)        that the grounds and the garden, if any, appertaining to the house shall be\nmaintained in the condition in which they are at the time at which the lease is\nexecuted:\n1\nSubs. by Act No. X of 1925, s. 6.\n2\nOmitted by Act No. IX of 1930, s. 4.\n3\nSubs. by A.O., 1937.\n4\nSubs. by the Federal Adaptation of Laws Order, 1975 (P.O. No. 4 of 1975), Art. 2 and Table.\n1\n[Provided that nothing in this sub-section shall be deemed to affect the right of 2[the 3[Federal\nGovernment]] to avoid the lease in any such event as is specified in clause (e) of section 108 of the\nTransfer of Property Act, 1882 (IV of 1882).]\n8. 1[*           *        *         *          *         *         *]"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Sanction to be obtained before a house is occupied as a hospital, etc. No house in any",
      "content": "cantonment or part of a cantonment in which this Act is operative shall, unless it was so occupied at\nAct, 1902 (II of 1902), as the case may be, to be operative, be occupied for the purposes of a hospital,\nschool, school hostel, bank, hotel, or shop, or by a railway administration, a company or firm engaged\nin trade or business or a club, without the previous sanction of the Officer Commanding the District\ngiven with the concurrence of the Commissioner or, in a Province where there are no Commissioners,\nof the Collector."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Houses not to be appropriated in certain cases. No notice shall be issued under section",
      "content": "7 if the house___\n(a)        was, at the date of the issue of the notification declaring this Act or the\nCantonments (House-Accommodation) Act 1902 (II of 1902), as the case may\nbe, to be operative in the cantonment or part of the cantonment, or is, with such\nsanction as is required by section 9, occupied as a hospital, school, school hostel,\nbank, hotel or shop, and has been so occupied continuously during the three\nyears immediately preceding the time when the occasion for issuing the notice\narises, or\n(b)        was, at the date of such a notification as is referred to in clause (a), or is, with\nsuch sanction as aforesaid, occupied by a railway administration or by a\ncompany or firm engaged in trade or business or by a club, or\n(c)        is occupied by the owner, or\n(d)        has been appropriated by the 2[Provincial Government] with the concurrence of\nthe Officer Commanding the District, or by the 3[Federal Government], for use\nas a public office or for any other purpose."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Time to be allowed for giving possession of house",
      "content": "_(1) If a house is unoccupied, a notice\nissued under section 7 may require the owner to give possession of the same to the 4[Officer\nCommanding the station] within twenty-one days from the service of the notice.\n(2) If a house is occupied, a notice issued under section 7 shall not require its vacation in less\nthan thirty days from the service of the notice.\n1\nIns. and omitted by Act No. IX of 1930, ss. 4-5.\n2\nSubs. by Adaptation Order, 1937.\n3\nSubs. by Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table.\n4\nSubs. by Act No. X of 1925, s. 6.\n(3) where a notice has been issued under section 7 and the house has been vacated in pursuance\nthereof, the lease shall be deemed to have commenced on the date on which the house was so vacated."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Surrender of house when to be enforced. If the owner fails to give possession of a house",
      "content": "1\nto the [Officer Commanding the station] in pursuance of a notice issued under section 7, or if the\nexisting occupier fails to vacate a house in pursuance of such a notice, the District Magistrate, by\nhimself or by another person generally or specially authorised by him in this behalf, shall enter on the\npremises and enforce the surrender of the house.\n13. 2[*          *       *          *          *         *        *]"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Provision where house is held on long lease by a tenant",
      "content": "_(1) If a house, in respect of\nwhich a notice is issued under section 7, is occupied by a tenant holding in good faith and for valuable\nconsideration under a registered lease for any term exceeding one year, 3[the 4[Federal Government]]\nshall, for the term of one year from the date on which the house is vacated in pursuance of the notice,\nor for the unexpired term of the lease whichever is the shorter, be liable to the owner for the rent fixed\nby the registered lease instead of for the rent payable under this Act if the rent so fixed exceeds the\nrent so payable.\n(2) If a house, in respect of which a notice is issued under section 7, is occupied by a tenant\nholding in good faith and for valuable consideration under a registered lease from year to year, 3[the\n4\n[Federal Government]] shall be liable as aforesaid for the term of six months from the date on which\nthe house is vacated in pursuance of the notice.\n(3) Nothing in this section shall be deemed___\n(a)        to render 3[the 4[Federal Government]] so liable unless an application in writing\nin this behalf is made by the owner to the 1[Officer Commanding the station]\nwithin fifteen days from the service of the notice; or\n(b)        to limit or otherwise affect any agreement between 5[the Government] and the\nowner."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Power for owner to refer to Civil Court on question of rent",
      "content": "_(1) lf the owner considers\nthat the rent stated in a notice issued under section 7 is not reasonable, he may, within a period of\n6\n[thirty] days from the service of such notice, 1[refer the matter to a Civil Court, in accordance with\nthe provisions of Chapter IV]:\n1\nSubs. by Act No. X of 1925, s. 6.\n2\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch. II.\n3\nSubs. by Adaptation Order, 1937.\n4\nSubs.by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table.\n5\nAmended by the Central Laws (Adaptation) Order, 1961 (P. O. No. 1 of 1961), Art. 2 (w. e. f. 23rd March, 1956).\n6\nSubs. by Act No. IX of 1930, s. 7.\n1\n[Provided that where an appeal has been made to the Officer Commanding the District under\nsection 30, the period of thirty days shall be reckoned from the date on which the owner received notice\nof the result of the appeal under sub-section (2) of section 32.]\n(2) If the owner does not make such a 2[reference] within the said period, he shall be deemed\nto have accepted the rent so offered."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Power for owner to refer to Civil Court on question of repairs",
      "content": "_(1) If the owner fails\nto execute any repairs to a house as required by a notice issued to him under section 7, the 3[Officer\nCommanding the station] may by notice require the owner to execute the repairs within such period,\nnot being less than 2[thirty] days, as may be specified in the notice.\n(2) If the owner objects to any requisition contained in a notice issued under sub-section (1),\nhe may, within 2[thirty] days from the service of the notice, 2[refer the matter to a Civil Court in\naccordance with the provisions of Chapter IV]:\n1\n[Provided that where an appeal has been made to the Officer Commanding the District under\nsection 30, the period of thirty days shall be reckoned from the date on which the owner received notice\nof the result of the appeal under sub-section (2) of section 32.]\n2\n[(3) Every reference under sub-section (2) shall be accompanied by an estimate of the repairs,\nif any, which the owner considers necessary in order to put the house into a state of reasonable repair.]\n2\n[17. Power to have repairs executed and recover cost. If the owner fails to comply with a\nnotice issued under sub-section (1) of section 16, the Military Engineer Services or the Public Works\nDepartment may, with the previous sanction of the Officer Commanding the station and\nnotwithstanding any right of reference conferred by that section, cause the repairs specified in the\nnotice to be executed at the expense of 4[the 5[Federal Government]], and the cost thereof, or, where a\nreference has been made, the amount finally determined by the Civil Court, may be deducted from the\nrent payable to the owner.]"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Notice to be given of devolution of interest in house in cantonment. Every person on",
      "content": "whom devolves, by transfer, by succession or by operation of law, the interest of an owner in any\nhouse, or in any part of any house, situate in a cantonment or part of a cantonment in respect of which\na notification under sub-section (1) of section 3 is for the time being in force, shall be bound to give\nnotice of the fact to the 3[Officer Commanding the station] within one month from the date of such\ndevolution, and, if he, without reasonable cause, fails to do so, he shall be punishable with fine which\nmay extend to fifty rupees.\n1\nAdded by Act No. XXII of 1933, ss. 2-3.\n2\nSubs. and added by Act No. IX of 1930, ss. 7-9.\n3\nSubs. by Act No. X of 1925, s. 6.\n4\nSubs. by Adaptation Order, 1937.\n5\nSubs. by Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table.\n1\n[CHAPTER IV"
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Jurisdiction in references. All references under this Act shall be made by application, to",
      "content": "and tried by, the Court of the District Judge."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Procedure and powers of the Court. References under this Act shall be deemed to be",
      "content": "proceedings within the meaning of section 141 of the Code of Civil Procedure, 1908 (V of 1908), and\nin the trial thereof the Court may exercise any of its powers under that Code."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Restriction of scope of inquiry. The scope of the inquiry in a reference under this Act",
      "content": "shall be restricted to a consideration of the matters referred to the Court in accordance with the\nprovisions of this Act.]\n1\n[29. Appeal to High Court.___(1) An appeal shall lie to the High Court against the decision\nof the Court of the District Judge upon a reference tried by it.\n(2) No appeal under this section shall be admitted unless it is made within thirty days from the\ndate of the decision against which it is preferred.\n(3) An appeal preferred under this section shall be deemed to be an appeal from an order within\nthe meaning of section 108 of the Code of Civil Procedure, 1908 (V of 1908).]\n1\n[30. Appeal to Officer Commanding the District. The owner or any tenant of a house in\nrespect of which a notice has been issued under section 7 may, within a period of 2[ten days] from the\ndate of the service thereof, appeal to the Officer Commanding the District against the decision of the\nOfficer Commanding the Station to appropriate the house.]"
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Petition of appeal",
      "content": "_(1) Every petition of appeal under section 30 shall be in writing and\naccompanied by a copy of the notice appealed against.\n(2) Any such petition may be presented to the 3[Officer Commanding the station] and that\nofficer shall be bound to forward it to the authority empowered by section 30 to hear the appeal, and\nmay attach thereto any report which he may desire to make in explanation of the notice appealed\nagainst.\n(3) If any such petition is presented direct to the Officer Commanding the District and an\nimmediate order on the petition is not necessary, the Officer Commanding the District may refer the\npetition to the 3[Officer Commanding the station] for report.\n1\nSubs. by Act No. IX of 1930, ss. 10-12.\n2\nSubs. by Act No. X of 1925, s. 6.\n3\nSubs. by Act No. XXII of 1933, s. 4."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Order in appeal final",
      "content": "_ 1[(1)] The decision on any such appeal of the Officer\nCommanding the District 2[* * *] shall be final, and shall not be questioned in any Court otherwise\nthan on the ground that the house is situate in a cantonment, or part of a cantonment, in which this Act\nis not operative:\nProvided that no appeal shall be decided until the appellant has been heard or has had a\nreasonable opportunity of being heard in person or through a legal practitioner 2[and in giving a\ndecision the Officer Commanding the District shall record briefly the grounds therefore].\n1\n[(2) Notice of the result of the appeal shall be given to the appellant as soon as may be, and,\nwhere the appellant is a tenant of the house, to the owner of the house also.]"
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Suspension of action pending appeal. Where an appeal has been presented under section",
      "content": "30 within the period prescribed 2[therein], all action on the notice shall, on the application of the\nappellant, be held in abeyance pending the decision of the appeal.\n__________"
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Service of notice and requisitions. Every notice or requisition prescribed by this Act shall",
      "content": "be in writing, signed by the person by whom it is given or made or by his duly appointed agent, and\nmay be served by post on the person to whom it is addressed, or, in the case of an owner who does not\nreside in or near the cantonment, on his agent appointed 3[in accordance with a bye-law made under\nclause (29) of section 282 of the Cantonment Act, 1924].\n2\n[34A. Computation of periods of limitation. The period prescribed for making any reference\nor preferring any appeal under this Act shall be computed in accordance with the provisions of the\nLimitation Act, 1908.]"
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Power for Federal Government to make rules",
      "content": "_(1) The 4[Federal Government] may\nmake rules to carry out the purposes and objects of this Act.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules\nmay___\n2\n(a)            [*     *          *           *          *          *       *]\n(b)        define the powers of entry, inspection, measurement or survey which may be\nexercised in carrying out the purposes and objects of this Act or of any rule\nmade hereunder.\n1\nRe-numbered and added by Act No. XXII of 1933, s. 5.\n2\nOmitted, added, subs. and ins. by Act, 1930 (IX of 1930), ss. 13-16.\n3\nSubs. by Act No. X of 1925, s. 4.\n4\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Further provisions respecting rules",
      "content": "_(1) The power to make rules under section 35\nshall be subject to the condition of the rules being made after previous publication and of their not\ntaking effect until they have been published in the 1[official Gazette] and in such other manner (if any)\nas the 2[Federal Government] may direct.\n(2) Any rule under section 35 may be general for all cantonments or parts of cantonments in\n3\n[Pakistan] in which this Act is for the time being operative, or may be special for any of such\ncantonments or parts as the 2[Federal Government] may direct.\n(3) A copy of the rules under section 35 for the time being in force in a cantonment shall be\nkept open to inspection free of charge at all reasonable times in the office of the Cantonment 4[Board].\n(4) In making any rule under clause (b) of sub-section (2) of section 35, the 2[Federal\nGovernment] may direct that whoever obstructs any person, not being a public servant within the\nmeaning of section 21 of the Pakistan Penal Code (XLV of 1860), in making any entry, inspection,\nmeasurement or survey, shall be punishable with fine which may extend to fifty rupees, and, in the\ncase of a continuing offence, with fine which, in addition to such fine as aforesaid, may extend to five\nrupees for every day after the first during which such offence continues."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Inapplicability of section 556 of the Code of Criminal Procedure, 1898, to trials of",
      "content": "offences. No Judge or Magistrate shall be deemed, within the meaning of section 556 of the Code of\nCriminal Procedure 1898 (V of 1898), to be a party to, or personally interested in, any prosecution for\nan offence constituted by or under this Act merely because he is a member of the Cantonment 5[Board]\nor has ordered or approved the prosecution."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Protection to persons acting under Act. No suit or other legal proceeding shall lie against",
      "content": "any person for anything in good faith done, or intended to be done, under this Act or in pursuance of\nany lawful notice or order issued under this Act.\n39. 6[*               *          *          *          *           *          *]\nTHE SCHEDULE. ___ 6[*                       *          *           *          *          *          *]\n___________\n124892                                                                                                                    Date: 29-01-2025\n1\nSubs. by Adaptation Order, 1937.\n2\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table.\n3\nSubs. by the Central Laws (Statue Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch. (w. e. f the 14th October, 1955).\n4\nSubs. by the Repealing and Amending Act, 1940 (XXXII of 1940), s. 3 and Sch. II.\n5\nSubs. by Act No. X of 1925, s. 5.\n6\nRep. by the Repealing Act, 1927 (XII of 1927), s. 2 and Schedule."
    }
  ],
  "definitions": [
    {
      "term": "Brigade area",
      "definition": "one of the Brigade areas, whether occupied by a brigade or not, into which 2[Pakistan] is for military purposes for the time being divided, and includes any area which the 3[Federal Government] may, by notification in the 3[official Gazette], declare to be a Brigade area for all or any of the purposes of this Act; 4 (b) [* * * * * * *] [ [(b)] “Cantonment Board” means a Cantonment Board constituted under the 5 4 Cantonments Act, 1924; (II of 1924)] 1 Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s. 3. 2 Subs. by the Adaptation of Central Acts & Ordinances Order, 1949 (Order No. 1 of 1949), s. 3 and Sch. 3 Subs. by Federal Adaption of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table. 4 Omitted and re-lettered by Act No. IX of 1930, s. 2. 5 Ins. by Act No. X of 1925, s. 2.",
      "source_provision": "sec2"
    },
    {
      "term": "Command",
      "definition": "one of the Commands into which 1[Pakistan] is for military purposes for the time being divided, and includes any area which the 2[Federal Government] may, by notification in the 2[official Gazette], declare to be a Command for all or any of the purposes of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "3[Officer Commanding the station]",
      "definition": "the Officer for the time being in command of the forces in a cantonment 4[or, if that officer is the Officer Commanding the District, the military officer who would be in command of those forces in the absence of the Officer Commanding the District];",
      "source_provision": "sec2"
    },
    {
      "term": "District",
      "definition": "one of the Districts into which 5[Pakistan] is for military purposes for the time being divided; it includes a Brigade area which does not form part of any such District and any area which the 2[Federal Government] may, by notification in the 2[official Gazette], declare to be a District for all or any of the purposes of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "house",
      "definition": "a house suitable for occupation by a military officer or a military mess, and includes the land and buildings appurtenant to a house;",
      "source_provision": "sec2"
    },
    {
      "term": "military officer",
      "definition": "a commissioned or warrant officer of 6[the military or air forces of Pakistan] on military or air-force duty in a cantonment, and includes a Chaplain on duty with troops in a cantonment, 3[an officer of the Cantonments Department] and any person in Army departmental employment whom the Officer Commanding the District may at any time, by an order in writing, place on the same footing as a military officer for the purposes of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "owner",
      "definition": "the person who is receiving, or is entitled to receive, the rent of a house, whether on his own account or on behalf of himself and others or as an agent or trustee, or who would so receive the rent, or be entitled to receive it, if the house were let to a tenant; and (i) a house is said to be in a state of reasonable repair when___ (i) all floors, walls, pillars and arches are sound and all roofs sound and watertight, (ii) all doors and windows are intact, properly painted or oiled, and provided with proper locks or bolts or other secure fastenings, and (iii) all rooms, out-houses and other appurtenant buildings are properly colour-washed or white-washed. 1 Subs. by Federal Laws (Revision and Declaration) Act, 1951 (XXVI of 1951), s. 4 and Sch. III. 2 Subs. by Adaptation Order, 1937. 3 Subs. by Act No. X of 1925, ss. 2 and 6. 4 Ins. by Act No. IX of 1930, s. 2. 5 Subs. by the Adaptation of Central Acts & Ordinances Order, 1949 (Order No. 4 of 1949), Art. 3 and Sch. 6 Subs. by the Central Laws (Adaptation) Order, 1961 (P.O. No. 1 of 1961), Art. 2 and Sch. (2) If any question arises whether any land or building is appurtenant to a house, it shall be decided by the 1[Officer Commanding the station] whose decision thereon shall, subject to revision by the 2[Collector], be final. __________",
      "source_provision": "sec2"
    }
  ]
}
