{
  "id": "pk-capital-development-authority-amendment-ordinance-2025",
  "type": "statute",
  "title": "Capital Development Authority (Amendment) Ordinance, 2025",
  "title_en": "Capital Development Authority (Amendment) Ordinance, 2025",
  "short_name": "CDAO",
  "status": "in_force",
  "issued_date": "2025-05-01",
  "in_force_date": "2025-05-01",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tjaw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Capital Development Authority (Amendment) Ordinance, 2025 (III of 2025) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Amendment of section 27, Ordinance XXIII of 1960",
      "content": "In the\nCapital Development Authority Ordinance, 1960 (XXIII of 1960), herein after\nreferred to as “the said Ordinance”, in section 27, in sub-section (2), the words\n“and the amount” shall be omitted. -"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Amendment of section 28, Ordinance XXIII of 1960",
      "content": "In the\nsaid Ordinance, in section 28, the existing provision shall be re-numbered as\nsub-section (I) of that section and after sub-section (1), as re-numbered\nhereinbefore, the following new sub-section (2) shall be added, namely: —\n“(2) Notwithstanding anything contained in this Ordinance, where\nland includes a building or build up property, the Deputy Commissioner\nmay issue two separate awards one for the land and another for the\nbuilding or build up property.”"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Amendment of section 29, Ordinance XXIII of 1960",
      "content": "In the\nsaid Ordinance, in section 29, for the words “the amount of which shall be\ndetermined by the Deputy Commissioner who shall be guided by the provisions\nof section 30 and 31” the words, commas, full stop and figures “ in the form of\nmonetary payment, land sharing, or any other form as may be determined by the\nAuthority. The Deputy Commissioner shall announce the award and shall be\nguided by the provisions of section 30 and 31” shall be substituted."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Insertion of section 29A, Ordinance XXIII of 1960",
      "content": "In the said\nOrdinance, after section 29, the following new section 29A shall be inserted,\nnamely: — ;\n“29A. Rehabilitation and resettlement benefits.- The pending cases\nfor grant of rehabilitation and resettlement benefits in lieu of any award :\nof land and built-up property, pending on the 30th October, 2025 shall be\ngoverned and processed in accordance with the provisions of the\napplicable Rehabilitation Policy in force at the relevant time.”.\nPART I] THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 145"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Amendment of section 30, Ordinance XXIII of 1960",
      "content": "In the a\nsaid Ordinance, in section 30,—\n(a) in sub-section (1), the words “amount of” shall be omitted; and\n(b) after sub-section (3), the following mew sub-section shall be\ninserted, namely:—\n(4) Where compensation is provided through land sharing,\nrehabilitation benefits, resettlement benefits, or any other form as\ndetermined by the Authority, it shall ensure that the,— :\n(a) allotted land is of equivalent value, utility and accessibility as the\nacquired land;\n(b) rehabilitation and resettlement benefits are provided where required\nensuring the restoration of livelihood and standard of living; and\n(c) compensation package aligns with principles of equity ensuring that\naffected persons are not placed at a disadvantage due to the\nacquisition.”."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Amendment of section 32, Ordinance XXIII of 1960",
      "content": "In the\nsaid Ordinance, in section 32, for the full stop, at the end, a colon shall be\nsubstituted and thereafter the following proviso shall be added, namely:—\n“Provided that in case of a separate award for land and the buildings\nthereon, the land or the building, as the case may be, shall vest in the Authority\nfree from all encumbrances upon the making of the respective award.”."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Substitution of section 32A, Ordinance XXIII of 1960",
      "content": "In the\nsaid Ordinance, for section 32A, the following shall be substituted, namely: —\n“32A, Additional Compensation.—When the compensation is\ndetermined under section 29 and sub-sections (3) and (4) of section 30, is\nnot paid, deposited or tendered with the Deputy Commissioner on or\nbefore taking possession of the land, the Deputy Commissioner shall, in\naddition to such compensation, pay additional compensation computed at\nthe rate of eight per centum per annum on such compensation from the\ntime of so taking the possession until it has been so paid or deposited.”."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Amendment of section 33A, Ordinance XXIII of 1960",
      "content": "In the\nsaid Ordinance, in section 33A, for sub-section (3), the following shall be\nsubstituted, namely: —\n146 THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 [PART |\n—_—\n“(3) The Deputy Commissioner shall, after giving the person having |\ninterest in the land an opportunity of being heard, determine the compensation |\nfor the temporary occupation and use of the land at the rate at which it was rented |\nduring the preceding agricultural year and, if it was not so rented, at such rate as |\nhe may consider fair and gquitable, and make an award specifying the,— |\n(a) area and description of the land;\n(b) purpose and the period for which the land is required;\n(c) compensation and shares therein of the persons, if there be more\nthan one, entitled thereto; and\n(d) mode of compensation.”."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Amendment of section 33B, Ordinance XXIII of 1960",
      "content": "In the |\nsaid Ordinance, in section 33B,— |\n(a) in the head note, for the words, “Payment of compensation” the\nword “Compensation” shall be substituted;\n(b) for sub-section (1) the following shall be substituted, namely: —\n“(1) If any person entitled to the compensation under this\nOrdinance is a minor or of unsound mind or otherwise under a legal\ndisability to receive and administer the compensation the\nDeputy Commissioner may, by order, direct that the compensation shall\nbe made to the person applying for it on behalf of the person entitled\nthereto, if the Deputy Commissioner, after making such enquiry as he\nmay deem fit, is satisfied that the person so applying is the proper person\nto receive and administer the compensation for the benefit of the person\nentitled to compensation.”; and\n(c) for sub-section (3), the following shall be substituted, namely:—\n“(3) Any compensation provided under sub-section (1) or\nsub-section (2) shall afford full indemnity to the Authority for the\ncompensation made but shall not affect the liability of the person who\nhas received the compensation to account therefore to the person\nlawfully entitled thereto.”"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Amendment of section 36, Ordinance XXIII of 1960",
      "content": "In the\nsaid Ordinance, in section 36,—\nPART 1) THE GAZETTE OF PAKISTAN, EXTRA, MAY 2, 2025 147\nEE\n(2) in sub-section (3), in the proviso, after “compensation” the comma\nand words “, rehabilitation and resettlement” shall be inserted; and ~~\n(b) for the words “amount paid”, the words “compensation awarded,\nshall be substituted.\nASIF ALI ZARDARI,\nPresident. |\nRAJA NAEEM AKBAR,\nSecretary."
    }
  ],
  "definitions": []
}
