{
  "id": "pk-capital-development-authority-ordinance-cda-1960",
  "type": "statute",
  "title": "Capital Development Authority Ordinance (CDA), 1960",
  "title_en": "Capital Development Authority Ordinance (CDA), 1960",
  "short_name": "CDAO",
  "status": "in_force",
  "issued_date": "1960-06-26",
  "in_force_date": "1960-06-26",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-a5aabA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Capital Development Authority Ordinance (CDA), 1960 (XXIII of 1960) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Declaration of Capital Site.⎯ (1) The 1 [Federal Government] may, from time to",
      "content": "time, by notification in the official Gazette, declare any part or parts of the Specified Areas\nto be the site for the Pakistan Capital.\n(2) Notwithstanding anything contained in this Ordinance or in any other law any such\nnotification as aforesaid may be made so as to be retrospective to any day not earlier than the first\nday of June,1959, and where a notification is so made, the provisions of the Ordinance shall, in so far\nas they affect the Capital Site, apply as if this Ordinance were promulgated on the day to which the\nnotification is made retrospective.\n_____________\nCHAPTER II.⎯ CONSTITUTION OF THE AUTHORITY"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Constitution of the Authority.⎯ (1) There shall be established an authority to be known",
      "content": "as the Capital Development Authority for carrying out the purposes of this Ordinance.\n(2) The Authority shall be a body corporate, having perpetual succession and a common\nseal, with power, subject to the provisions of this Ordinance, to acquire and hold property, both\nmovable and immovable, and shall by the said name sue and be sued."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Management.⎯ (1) The general direction and administration of the Authority and its",
      "content": "affairs shall vest in the Board which may exercise all powers and do all acts and things which may be\nexercised or done by the Authority.\n(2) The Board in discharging its functions shall act on sound principles of development, town\nplanning and housing, and shall be guided on questions of policy by such directions as the 1 [Federal\nGovernment] may from time to time give.\n(3) If any question arises as to whether any matter is a matter of policy or not the decision of\n1\nthe [Federal Government] shall be final."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Constitution of the Board.⎯ (1) The Board shall consist of not less than three members,",
      "content": "to be appointed by the 1[Federal Government].\n(2) The 1 [Federal Government] shall appoint a Chairman, a Vice Chairman and a\nFinancial Advisor from amongst the members.\n(3) The Chairman and other members shall hold office during the pleasure of the 1 [Federal\nGovernment] and unless sooner removed the Chairman and the Financial Adviser shall hold office for\na period of five years and other members shall hold office for a period of four years.\n(4) Any person ceasing to be Chairman, Vice Chairman or member of the Board, by reason\nof the expiry of the term of his office, shall be eligible for reappointment for another term or for such\nshorter term as the 1[Federal Government] may decide.\n(5) No act or proceeding of the Board shall be invalid merely on the ground of the existence\nof any vacancy in, or any defect in the constitution of the Board.\n________________________________________________________________________________________________\n1\nSubs. by Federal Adaptation of Laws Order, 1975 Art. II and Table.\n(6) The Chairman or any member may at any time resign:\nProvided that his resignation shall not take effect until accepted by the 1[Federal\nGovernment]."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Remuneration and conditions of service. The Chairman and each member shall receive",
      "content": "such salary and allowances and shall be subject to such conditions of service as may be determined\nby the 1[Federal Government]."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Disqualification of the members. No person shall be or shall continue to be a",
      "content": "member who⎯\n(a)         is or, at any time, has been, convicted of an offence involving moral turpitude; or\n(b)         is or, at any time, has been adjudicated insolvent; or\n(c)         is found to be a lunatic or of unsound mind ;or\n(d)         is a minor; or\n(e)         has a financial interest in any scheme or a conflicting interest directly or\nindirectly between his interests as a member and his private interests and has\nfailed to disclose such interest in writing to the 1[Federal Government];\n2\n[(f)    *           *           *           *          *    *   *]"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Duties and functions o f Chairman and other members.⎯(1) The Chairman and",
      "content": "other members   shall discharge such duties and perform such functions as are assigned to them by or\nunder this Ordinance.\n(2) Until the Board is duly constituted, the Chairman shall, subject to such directions as\nthe 1[Federal Government] may from time to time give, exercise the powers, discharge the duties\nand perform the functions of the Board.\n(3) The Vice-Chairman shall have such powers, duties and functions as may be delegated to\nhim by the Chairman."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Headquarters of the Authority and m e e t i n g s o f the B o a r d .⎯ (1) Until the",
      "content": "Authority establishes its headquarters elsewhere within the Specified Areas, its headquarters shall be\nsituated at Rawalpindi.\n(2) The meetings of the Board shall be held at such times and places and in such manner as\nthe regulations may provide;\nProvided that until regulations are made in this behalf, the meetings of the Board shall\nbe held as and when convened by the Chairman.\n_________________________________________________________________________________________________\n1\nSubs. by Federal Adaptation of Laws Order, 1975, Art. II and Table.\n2\nOmitted by Act. No IX of 2023 s. 2.\nCHAPTER III.⎯ POWERS AND DUTIES OF THE AUTHORITY"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Master",
      "content": "plan and master programme.⎯ The Authority shall prepare a master-plan\nand a phased master-programme for the development of the Capital Site, a n d may prepare a similar\nplan and programme for the rest of the Specified Areas, and all such plans and programmes shall\nbe submitted to the 1[Federal Government] for approval."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Preparation of schemes by local bodies or agencies.⎯ (1) The Authority may,",
      "content": "pursuant to the master plan and the master-programme, call upon any local body or agency operating\nin the Specified Areas to prepare, in consultation with the Authority, a scheme or schemes in respect\nof matters ordinarily dealt with by such local body or agency, and thereupon the local body or agency\nshall be responsible for the preparation of the scheme or schemes within a reasonable time.\n(2) Such schemes, may relate to⎯\n(a)         land use, zoning and land reservation;\n(b)         public buildings;\n(c)         industry;\n(d)         transportation and communications; highway, roads, streets, railways,\naerodromes;\n(e)         tele-communications, including wireless, television, radio, telephone;\n(f)         utilization of water, power and other natural resources;\n(g)         community planning, housing, slum clearance, amelioration;\n(h)         community facilities including water supply, sewerage, drainage, sewage\ndisposal, electricity supply, gas supply and other public utilities;\n(i)         preservation of objects or places of historical or scientific interest or natural\nbeauty.\n(3) The 1[Federal Government] may, by notification in the official Gazette, add to, alter or\namend the list of subjects given in sub-section (2), and any such addition, alteration or\nmodification shall take effect as if it had been enacted in this Ordinance.\n(4) The expenditure incurred on the preparation of any such schemes as aforesaid shall be\nborne as agreed to between the Authority and the local body or agency, and in the event of\ndisagreement between them as may be determined by the 1[Federal Government].\n2\n[(5) No planning or development scheme shall be prepared by any person or by any local\nbody or agency except with the concurrence of the Authority.]"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Preparation of schemes by Authority.⎯ The Authority may, pursuant to the master",
      "content": "programme, itself prepare, when it considers it desirable to do so in the public interest, schemes\nfor the Specified Areas relating to the matters enumerated in sub-section (2) of section 12.\n_________________________________________________________________________________________________\n1\nSubs. by Federal Adaptation of Laws Order, 1975 Art. II and Table.\n2\nSubs. by Act No. XXII of 1966, s. 3."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Manner and form etc., of scheme.⎯ All schemes under section 12 and section 13",
      "content": "shall be prepared in such manner and form as the 1 [Federal Government] may specify, and shall\ncontain among other things the following information, namely:⎯\n(a)         description of the scheme and the manner of its execution;\n(b)         estimate of costs and benefits;\n(c)         allocation of costs to the various purposes to be served by the scheme."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Power of the Authority.⎯ (1) Subject to the other provisions of this Ordinance",
      "content": "and the rules, the Authority may take such measures and exercise such powers as may be necessary\nfor the carrying out of the purposes of this Ordinance.\n(2) Without prejudice to the generality of powers conferred by sub-section (1), the\nAuthority may⎯\n(i)         acquire any land in the Specified Areas in accordance with the procedure\nlaid down in Chapter IV;\n(ii)        undertake any works in the Specified Areas in pursuance of any scheme\nprepared under Section 13;\n(iii)       incur any expenditure;\n(iv)        procure plant, machinery, instruments and materials required for its use;\n(v)         enter into and perform all such contracts 2[including but not limited to joint\nventures, public private partnerships, concession agreements, etc.] as it may\nconsider necessary;\n(vi)        cause studies, surveys, experiments and technical researches to be made or\ncontribute towards the cost of any such studies, surveys, experiments or\ntechnical researches made by any other agency at the request of the Authority;\n(vii)       issue interim development orders for areas for which a master-plan is under\npreparation and restrict or prohibit by general or special order any change in\nthe use of land and alteration in buildings, structures and installations;\n(viii) cause removal of any works obstructing the execution of its schemes;\n(ix)        seek and obtain advice and assistance for the preparation of any planning\nscheme or for the execution of any schemes from any local body or agency\nand such local body or agency shall give the advice and assistance sought by\nthe Authority to the best of its ability, knowledge and judgment, and the\nadditional expenditure, if any, involved in giving such advice or assistance shall\nbe borne by the Authority.\n3\n[15A *     *     *     *     *     *     *     ]\n_________________________________________________________________________________\n1\nSubs. by Federal Adaptation of Laws Order, 1975 Art. II and Table.\n2\nIns. by Act No. IX of 2023 by s.3.\n3\nOmitted by Islamabad Capital Territory Local Govt. Act,2015 (X of 2015), s.132."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Borrowing powers.⎯ (1) The Authority may, with the previous approval in writing",
      "content": "of the 1[Federal Government], raise funds for the purpose or raising its working capital by issuing\nbonds and debentures carrying interest at such rates as may be approved by the 1[Federal Government].\n(2) The repayment of the principal and the payment of interest due on the bonds and\ndebentures issued by the Authority shall be guaranteed by the 1[Federal Government]."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Execution of schemes etc., through local bodies and agencies.⎯ (1) The Authority",
      "content": "may require a local body or agency within whose jurisdiction any particular area covered by a\nscheme lies⎯\n(a)         to execute a scheme in consultation with the Authority;\n(b)         to take over and maintain any of the works and services in that area;\n(c)         to enforce regulations, on behalf of the Authority.\n(2) The expenditure incurred on the execution of any scheme, or on the taking over or\nmaintenance of any work, or the enforcement of regulations, under this section, shall be borne as\nmay be agreed to between the Authority and the local body or agency, and, in the event of\ndisagreement, as may be determined by the 1[Federal Government].\n2\n[18. Utilisation of building material. Notwithstanding anything contained in any other law\nfor the time being in force or in any contract or agreement, no person shall, without the prior\nconcurrence of the Authority, allocate, exploit or in any manner utilise, except for the purpose of his\nown personal use, such natural resources used as building material as the Authority may, by\nnotification in the official Gazette, specify in this behalf.]"
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Amendment of schemes.⎯ Any scheme prepared under section 12 or section 13 may at",
      "content": "any time be amended or modified⎯\n(a)         in cases where the amended or modified scheme should exceed the financial\npowers of the Authority, by the Authority with the previous approval in writing\nof the 1[Federal Government], and\n(b)         in other cases, by the Authority 2[.]\n2\n[    *                       *                        *                *   *        * ]"
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Removal, etc., of buildings after hearing. ― The Authority shall not order or cause",
      "content": "any building in the Specified Areas, excluding the Capital Site, to be removed or demolished unless\nan opportunity of being heard has been given to the owner or occupier thereof, and his objections, if\nany, have been duly considered, and the Authority is satisfied that removal or demolition of the\nbuilding is essential to the execution of its schemes."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Schemes to be executed after calling objections.⎯ The Authority shall not execute",
      "content": "or cause to be executed any scheme in the Specified Areas, excluding the Capital Site, unless the\npersons whose rights and interests are thereby affected have been given a reasonable opportunity to\nfile their objection to such execution, and the Authority has heard such of them as it considers\nnecessary.\n_________________________________________________________________________________________________\n1\nSubs. by Federal Adaptation of Laws Order, 1975 Art. II and Table.\n2\nSubs. and omitted by Act No XXII of 1966, ss. 5 and 6.\nCHAPTER IV.⎯ ACQUISITION OF LAND"
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Liability to acquisition.⎯ All land within the Specified Areas shall be liable to",
      "content": "acquisition at any time in accordance with the provisions of this Chapter."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Entry upon land, preliminary survey, etc.⎯ (1) It shall be lawful for the A uthority,",
      "content": "and any  member thereof, and for the Deputy Commissioner, and any such person as may either\ngenerally or specially be authorised by the Authority, in this behalf,\n(a)    to enter upon and survey and take levels of any land;\n(b)    to dig or bore into the subsoil;\n(c)    to do all other acts necessary to ascertain whether land is adapted for the\npurposes of this Ordinance;\n(d)    to set out the boundaries of the land proposed to be acquired and the intended\nline of the work, if any, proposed to be made thereon;\n(e)    to mark such levels, boundaries and line by placing marks and cutting trenches;\nand\n(f)    where it is necessary for the purposes of the survey, taking of levels or marking\nof line, to cut down and clear away any part of any standing crop, fence or\njungle.\n(2) No person shall enter into any building or upon any enclosed court or garden attached to a\ndwelling house (unless with the consent of the occupier thereof) without previously giving such\noccupier at least twenty-four hours' notice in writing of his intention to do so."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Compensation for damage.⎯ Where any damage is caused to any land in consequence",
      "content": "of anything done in pursuance of section 23, there shall be paid compensation, the amount of which\nshall be determined in the manner and in accordance with the provisions hereinafter set out, that is to\nsay,\n(a)    where the amount of compensation can be fixed by agreement, it shall be fixed\nin accordance with such agreement; and\n(b)    where no such agreement can be reached, it shall be fixed by the Deputy\nCommissioner."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Power to acquire land.⎯ (1) Subject to the other provisions of this Ordinance, the",
      "content": "rules made thereunder, and the directions of the Authority, the Deputy commissioner may, by\norder in writing, acquire any land for the purposes of this Ordinance.\n(2) No order under sub-section (1) shall be issued except on the receipt by the Deputy\nCommissioner of specified directions from the Authority."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Land to be marked out measured and planned.⎯ Where any land is proposed to be",
      "content": "acquired under Section 25, the Deputy Commissioner shall cause the land (unless it has been already\nmarked out) to be marked out and measured, and if no plan has been made thereof, a plan to be made\nof the same."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Notice to persons interested.⎯ (1) The Deputy Commissioner shall then cause",
      "content": "public notice to be given at convenient places on or near the land to be taken, stating that the 1 [Federal\nGovernment] intends to take possession of the land, and that claims to compensation for all interests\nin such land may be made to him.\n(2) Such notice shall state the particulars of the land so needed, and shall require all persons\ninterested in the land to appear personally or by agent before the Deputy Commissioner at a time and\nplace therein mentioned (such time not being earlier than ten days after the date of publication of the\nnotice), and to state the nature of their respective interests in the land 2[***] and particulars of their\nclaims to compensation for such interests, and their objections, if any, to the measurements made under\nsection 23, and the Deputy Commissioner may require any such statement to be made in writing\nand signed by the party or his agent.\n(3) The Deputy Commissioner shall also serve notice to the same effect on the occupier, if\nany, of such land and on all such persons known or believed to be interested therein, or to be entitled\nto act for persons so interested."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Enquiry and award of Deputy Commissioner.⎯ 2 [(1)] On the day so fixed, or on",
      "content": "any other day to which the enquiry has been adjourned, the Deputy Commissioner shall proceed to\nenquire into the objections, if any, which any person interested has stated pursuant to the notice\ngiven under section 27, and into the market value of the land and into the respective interests of the\npersons claiming the compensation, and shall make an award of⎯\n(i)      the true area of the land;\n(ii)     the compensation which in his opinion should be allowed for the land; and\n(ii)     the apportionment of such compensation among all the persons known or\nbelieved to be interested in the land of whom, or of whose claims, he has\ninformation, whether or not they have appeared before him.\n2\n[(2) Notwithstanding anything contained in this Ordinance, where land includes a building or\nbuild up property, the Deputy Commissioner may issue two separate awards one for the land and\nanother for the building or build up property.]"
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Compensation.⎯ where any land is acquired under this Ordinance there shall be paid",
      "content": "compensation, 2 [in the form of monetary payment, land sharing, or any other form as may be\ndetermined by the Authority. The Deputy Commissioner shall announce the award and shall be\nguided by the provisions of sections 30 and 31].\n2\n[29A. Rehabilitation and resettlement benefits.⎯ The pending cases for grant of\nrehabilitation and resettlement benefits in lieu of any award of land and build-up property, pending\non the 30th October, 2024 shall be governed and processed in accordance with the provisions of\nthe applicable Rehabilitation Policy in force at the relevant time.]\n___________________________________________________________________________________________________________________\n1\nSubs. by Federal Adaptation of Laws Order, 1975, Art. II and Table.\n2\nOmitted, re-numbered, added, subs., and ins by Act No. I of 2026, ss. 2, 3, 4 and 5."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Matter to be considered in determining compensation.⎯ (1) In determining the",
      "content": "1\n[**] compensation to be awarded for land acquired under this Ordinance the Deputy Commissioner\nshall take into consideration,\nfirst,                    the market value of land 2[on the date of order of its acquisition made under\nsection 25];\nsecondly,                 the damage sustained by the person interested, by reason of dispossession of\nany standing crops or trees which may be on the land;\nthirdly,                  the damage, if any sustained by the person interested at the time of taking\npossession of the land by reason of severing such land from his other land;\nfourthly,                 the damage, if any, sustained by the person interested at the time of taking\npossession of the land by reason of the acquisition injuriously affecting his other\nproperty, movable or immovable, in any other manner, or his earnings; and;\nfifthly,                  if, in consequence of the acquisition of the land the person interested is\ncompelled to change his residence or place of business, the reasonable expenses,\nif any, incidental to such change.\n(2) In addition to the value of the land determined as aforesaid, the Deputy Commissioner shall\nin every case award a sum of fifteen per centum on such value in consideration of the compulsory\nnature of the acquisition.\n2\n[(3) In relation to land acquired on or after the first day of January, 1996, in addition to\nthe value of the land determined as aforesaid, the Deputy Commissioner shall in every case award a\nsum of twenty per centum on such value in consideration of the compulsory nature of the acquisition.]\n1\n[(4) Where compensation is provided through land sharing, rehabilitation benefits,\nresettlement benefits, or any other form as determined by the Authority, it shall ensure that the,⎯\n(a) allotted land is of equivalent value, utility and accessibility as the acquired land;\n(b) rehabilitation and resettlement benefits are provided where required ensuring the\nrestoration of livelihood and standard of living; and\n(c) compensation package aligns with principles of equity ensuring that affected\npersons are not placed at a disadvantage due to the acquisition.]"
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Factors to be ignored in determing compensation.⎯ In determining compensation",
      "content": "as aforesaid, the Deputy Commissioner shall not take into consideration⎯\nfirst,                    the degree of urgency which has led to the acquisition;\nsecondly,                 any disinclination of the person interested to part with the land acquired;\nthirdly,                  any damage sustained by him which, if caused by a private person would\nnot render such person liable to a suit;\n1\nOmitted and ins. by Act No. I of 2026, s. 6.\n2\nAdded by Act No. III of 1999, s.3.\nfourthly,             any increase likely to accrue to the value of the land acquired from the use\nto which such land will be put on acquisition; and\nfifthly,              any increase likely to accrue to the value of the other land of the person\ninterested from the use to which the land acquired will be put."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Vesting of land in the Authority.⎯ Immediately on the making of the award under section",
      "content": "28, the land shall vest in the Authority free from all encumbrances 1[and thereupon the Deputy\nCommissioner may, after giving reasonable notice to the occupier, enter upon and take possession of\nthe same] 2[:]\n2\n[Provided that in case of a separate award for land and the buildings thereon, the land or the\nbuilding, as the case may be, shall vest in the Authority free from all encumbrances upon the making\nof the respective award.]\n2\n[32A. Additional Compensation.⎯ When the compensation is determined under section\n29 and sub-sections (3) and (4) of section 30, is not paid, deposited or tendered with the Deputy\nCommissioner on or before taking possession of the land, the Deputy Commissioner shall, in addition\nto such compensation, pay additional compensation computed at the rate of eight per centum per\nannum on such compensation from the time of so taking the possession until it has been so paid or\ndeposited.]"
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Acquisition in cases of urgency.⎯ In cases of urgency, the Deputy Commissioner",
      "content": "may immediately after the publication of the notice mentioned in sub section (1) of section 27 enter\nupon and taken possession of the land which shall thereupon vest absolutely in the 1 [Authority]\nfree from all encumbrances:\nProvided that the Deputy Commissioner shall not take possession of any building or\npart of building under this section without giving to the occupier thereof at least twenty-four hours’\nnotice of his intention so to do, or such longer notice as may be reasonably sufficient to enable such\noccupier to remove his movable property from such building without unnecessary inconvenience.\n1\n[33A.Temporary occupation and use of land.⎯ (1) Where the Authority requires any\nland for temporary occupation and use for the purposes of this Ordinance for a period not exceeding\nfive years, it may direct the Deputy Commissioner to take possession of the land in accordance with\nthe provisions of this section for such occupation and use.\n(2) Upon a direction under sub-section (1) in respect of any land, the Deputy Commissioner\nshall give the persons having interest in the land notice in writing of his intention to take possession\nof the same for the purpose and period specified therein calling upon such persons to submit within\nten days of the receipt of the notice written statements describing the nature and extent of their interest\nin such land.\n2\n[(3) The Deputy Commissioner shall, after giving the person having interest in the land\nan opportunity of being heard, determine the compensation for the temporary occupation and use\nof the land at the rate at which it was rented during the preceding agricultural year and, if it was\nnot so rented, at such rate as he may consider fair and equitable, and make an award specifying\nthe,⎯\n(a)        area and description of the land;\n1\nAdded, subs. and ins. by Act No. XXII of 1966, ss. 7, 8 and 9.\n2\nSubs. and added by Act No. I of 2026, ss. 7, 8 and 9.\n3\nAdded by Act No. III of 1999, s. 4.\n(b)         purpose and the period for which the land is required;\n(c)         compensation and shares therein of the persons, if there be more than one,\nentitled thereto; and\n(d)         mode of compensation.]\n(4) After making an award under sub section (3) in respect of any land, the Deputy\nCommissioner may enter upon and take possession of such land for the purpose and the period specified\nin the notice under sub-section (2).\n(5) If it appears that as a result of the occupation and use as aforesaid any land proposed to\nbe taken possession of under this section is likely to be permanently unfit for the use for which it is\nfor the time being used and the owner applies for its acquisition under this Ordinance, the\nDeputy Commissioner shall report the fact to the Authority and shall, if the Authority so direct,⎯\n(a)         acquire the land under this Ordinance; or\n(b)         assess the damage likely to be caused to the land and make an award for\nreasonable compensation for such damage; or\n(c)         terminate the proceedings for taking possession of the land."
    },
    {
      "provision_ref": "sec33b",
      "section": "33B",
      "title": "Section 33B. 1[Compensation] to persons under disability and heirs of deceased persons.⎯",
      "content": "1\n[(1) If any person entitled to the compensation under this Ordinance is a minor or of unsound mind\nor otherwise under a legal disability to receive and administer the compensation the Deputy.\nCommissioner may, by order, direct that the compensation shall be made to the person applying for\nit on behalf of the person entitled thereto, if the Deputy Commissioner, after making such enquiry as\nhe may deem fit, is satisfied that the person so applying is the proper person to receive and administer\nthe compensation for the benefit of the person entitled to compensation.]\n(2) Where a person entitled to receive compensation under the Ordinance dies after the making\nof an award, the Deputy Commissioner may, to provide relief in suitable cases, on the application of\nthe heirs or legal representatives of such person and after holding an enquiry into the title of the\napplicants, direct, that compensation shall be paid to the applicants on such terms and conditions as\nthe Deputy Commissioner may deem fit to impose.\n1\n[(3) Any compensation provided under sub-section (1) or sub-section (2) shall afford full\nindemnity to the Authority for the compensation made but shall not affect the liability of the person\nwho has received the compensation to account therefore to the person lawfully entitled thereto.]]"
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Power of Deputy Commissioner to call for information.⎯ With a view to acquiring",
      "content": "any land or determining any compensation therefor or to carrying out any other purpose of this\nOrdinance, the Deputy Commissioner may―\n(a)         require any person, by order in writing, to furnish such information in his\npossession relating to any land as may be specified in the order;\n(b)         enter or authorize any person to enter upon any land and take such action\nas may be necessary.\n1\nSubs. by Act No. I of 2026, s. 10."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Power of Authority to give directions to Deputy Commissioner.⎯ The Authority",
      "content": "may give direction to the Deputy Commissioner as respects the exercise of his powers and the\ndischarge of his functions under this Chapter and the Deputy Commissioner shall be guided by, and\nact in accordance with, such directions.\n1\n[36. Appeal and review.⎯(1) The Authority or any person aggrieved by an award or final\norder of the Deputy Commissioner may, within fifteen days of such award or order, appeal to the\nCommissioner.\n(2) The Commissioner may, after giving the Authority and the persons affected by the award\nor order appealed against an opportunity of submitting any objection to the appeal and of being heard,\npass such orders thereon as he may think fit.\n(3) The Deputy Commissioner or the Commissioner, either of his own motion or on an\napplication made in this behalf, at any time within five years from the date of an award or order made\nor passed by himself or by any of his predecessors in office, including an award or order made or\npassed before the commencement of the Capital Development Authority (Amendment) Act, 1966,\nmay, after giving the parties concerned a notice and an opportunity of being heard, review the\naward or order and pass such order thereon as he may deem fit:\nProvided that an order under this sub-section shall not, except in so far as it corrects an\narithmetical, clerical or patent error or mistake in the award or order under review, enhance the amount\nof compensation 2[, rehabilitation and resettlement] awarded.\n(4) Any 2 [compensation awarded] to any person which is found, for any reason including\nfraud or misrepresentation, not to be due or in excess of the amount he is entitled to under the award\nor order, as reviewed under sub-section (3), shall be recoverable by the Authority and the Deputy\nCommissioner shall call upon such person to refund it.\n(5) Subject to the provision of sub-section (3), the order of the Commissioner passed on\nany appeal shall be final and shall not be called in question in any court.]\n1\n[36A. Deputy Commissioner and Commissioner to have powers of civil court, etc.⎯\n(1) The Deputy Commissioner making any enquiry, or conducting any proceedings for an award under\nthis Ordinance, or the Commissioner hearing an appeal or holding a review under section 36, shall\nhave the same powers in respect of the following matters as are vested in a civil court, when trying a\nsuit, under the Code of Civil Procedure, 1908 (Act V of 1908), namely:⎯\n(a)        summoning and enforcing attendance of any person and examining him an\noath or affirmation;\n(b)        requiring the discovery and production of any document;\n(c)        requisitioning any record from any court or office;\n(d)        issuing commissions for examination of witnesses, inspection of property or\nmaking any local investigations;\n(e)        appointing guardian ad litem or next friends;\n1\nSubs. and ins. by Act No. XXII of 1966, ss. 10 and 11.\n2\nIns. and Subs. by Act No. I of 2026, s. 11.\n(f)        adding or substituting representatives of deceased parties to proceedings ;\n(g)         adding or dropping parties from pending proceedings ;\n(h)         restoration of cases dismissed for default ;\n(i)         consolidating and splitting up cases; and\n(j)         any other matter connected with the holding of an inquiry or hearing of an\nappeal.\n(2) The Deputy Commissioner or the Commissioner exercising powers under this Ordinance\nshall be deemed to be a court for the purposes of sections 480 and 482 of the Code of Criminal\nProcedure, 1898 (V of 1898), and a proceeding before him shall be deemed to be a judicial proceeding\nwithin the meaning of sections 193 and 228 of the Pakistan Penal Code (XLV of 1860)."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Appointment of officers and servants, etc.⎯ (1) The Authority may, from time to",
      "content": "time, appoint such officers, servants, experts or consultants as it may consider necessary for the\nperformance of its functions, on such terms and conditions as it may deem fit:\nProvided that salaried officers and servants whose remuneration exceeds two thousand\nand five hundred rupees per mensem shall not be appointed except with the previous approval in\nwriting of the 1[Federal Government].\n(2) Subject to the proviso to sub-section (1), the Chairman may, in cases of urgency, appoint\nsuch officers, servants, experts or consultants and on such terms and conditions as he deems fit:\nProvided that every appointment made under this sub-section shall be reported to the\nAuthority without unreasonable delay."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Recruitment, conditions of service and disciplinary powers.⎯ The Authority shall",
      "content": "lay down the procedure for the appointment of its officers, servants, experts and consultants, and the\nterms and conditions of their service including the constitution and management of provident fund for\nthem, and shall be competent to take disciplinary action against them."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Members, officers, experts–public servants.⎯ The Chairman, members, officers,",
      "content": "servants, experts and consultants of the Authority shall, when acting or purporting to act in pursuance\nof any of the provisions of this Ordinance be deemed to be public servants within the meaning of\nsection 21 of the Pakistan Penal Code (Act XLV of 1860).\n_________________________________________________________________________________\n1\nSubs. by Federal Adaptation of Laws Order, 1975 Art. II and Table."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Indemnity.⎯ No suit, prosecution or other legal proceedings shall lie against the",
      "content": "Authority, the Chairman, any member, officer, servant, expert or consultant of the Authority in respect\nof anything done or intended to be done, in good faith under this Ordinance."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Delegation of powers to Chairman, etc. The Authority may, by general or special",
      "content": "order, delegate to the Chairman, or a member, or an officer of the Authority, any of its powers, duties\nor functions under this Ordinance, subject to such conditions as it may think fit to impose.\n_____________\nCHAPTER VI.⎯FINANCE"
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Capital Development Authority Fund.⎯ (1) There shall be formed a fund to be known",
      "content": "as the “Capital Development Authority Fund” which shall vest in the Authority and shall be utilized\nby the Authority to meet charges in connection with its functions under this Ordinance including\nthe payment of salaries and other remuneration to the Chairman, members, officers, servants,\nexperts, and consultants of the Authority.\n(2) To the credit of Capital Development Authority Fund shall be placed,⎯\n(a)       grants made by the 1[Federal Government];\n(b)       loans obtained from the 1[Federal Government];\n(c)       grants made by local bodies;\n(d)       sale proceeds of movable and immovable property and receipts for services\nrendered;\n(e)       loans obtained by the Authority with the special or general sanction of the\n1\n[Federal Government];\n(f)       foreign aid and loans obtained from the International Bank of Reconstruction\nand Development or from any other source outside Pakistan, with the\nsanction of, and on such terms as may be approved by, the 1[Federal\nGovernment]; and\n(g)       all other sums receivable by the Authority."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Budget.⎯ (1) In the month of February each year the Authority shall submit to the",
      "content": "1\n[Federal Government] for approval a statement of the estimated receipts and expenditure in rupees\nin respect of the next financial year.\n(2) In the manner prescribed by the 1 [Federal Government] the Authority shall also submit to\nthe 1[Federal Government] for approval a statement of the estimated receipts and expenditure in\nforeign exchange in respect of the next financial year.\n(3) The Authority shall obtain specific sanction of the 1 [Federal Government] in respect of\neach individual scheme costing rupees twenty-five lacs or more to be financed out of the Capital\nDevelopment Authority Fund.\n1\nSubs. by Federal Adaptation of Laws Order, 1975 Art. II and Table.\n44.Audit and account.⎯ (1) The accounts of the Authority shall be audited by not less than\ntwo auditors holding certificates under section 144 of the Companies Act, 1913 (VII of 1913), who\nshall be appointed by the 1[Federal Government], in consultation with the 1 [Auditor General] of\nPakistan (hereinafter referred to as the Auditor-General) on such remuneration, to be paid by the\nAuthority, as the 1 [Federal Government] may fix, and the Auditor-General shall have the power to\ngive directions to the auditors in regard to the extent and method of their audit subject to the provisions\nof the Companies Act, and to prescribe the forms of accounts to be maintained by the Authority\nconsistent with the requirements of this Ordinance.\n(2) Notwithstanding the provisions of the preceding sub-section, the Auditor General, may\neither of his own motion or upon a request received in this behalf from the 1 [Federal\nGovernment], undertake such audit of the accounts of the Authority at such time as may be considered\nnecessary, and the Authority shall, at the time of such audit, produce the account books and\nconnected documents at such place or places as the Auditor-General may fix, and furnish such\nexplanations and information as the Auditor-General or an officer or officers authorized by him in this\nbehalf may ask for.\n(3) Every auditor appointed under sub-section (1) shall be given a copy of annual\nbalance-sheet of the Authority, and shall examine it together with the accounts and vouchers relating\nthereto, and shall have a list delivered to him of all books kept by the Authority, and shall at all\nreasonable times have access to the books, accounts and other documents of the Authority, and may\nin relation to such accounts examine any member or officer of the Authority.\n(4) The auditors shall report to the 1 [Federal Government] upon the annual balance-sheet and\naccounts and in their report they shall state whether in their opinion the balance-sheet is a full and\nfair balance-sheet containing all necessary particulars and properly drawn up so as to exhibit a true\nand correct view of the state of the Authority’s affairs, and in case they have called for any\nexplanation or information from the Board, whether it has been given and whether it is satisfactory.\n(5) The 1 [Federal Government] may at any time issue directions to the auditors requiring them\nto report to it upon the adequacy of measures taken by the Authority for the protection of the interests\nof the 1[Federal Government] and of the creditors of the Authority or upon the sufficiency of their\nprocedure in auditing the affairs of the authority, and may at any time enlarge or extend the scope of\nthe audit or direct that a different procedure in audit be adopted or that any other examination be made\nby the auditor if in its opinion the public interest so requires.\n(6) The Authority shall comply with every direction issued by the 1 [Federal Government] for\nthe rectification of matters objected to in audit."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Consultation with the Financial Advisor.⎯ Save as provided in the rules or",
      "content": "regulations, the Financial Advisor shall be consulted on every proposal of expenditure.\n__________________\nCHAPTER VII.⎯PENALTY AND PROCEDURE"
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Penalty.⎯ Whoever contravenes any provision of this Ordinance or of any rules or",
      "content": "regulations made or scheme sanctioned thereunder shall, if no other penalty is provided for such\ncontravention, be punishable with imprisonment which may extend to six months or fine or with both.\n1\nSubs. by Federal Adaptation of Laws Order, 1975 Art. II, Table and Sch.\n1\n[46A. Causing damage to property.⎯ Whoever willfully causes damage or allows damage\nto be caused to any property which vests in the Authority or unlawfully converts it to his own use or\nto that of any other person shall be punishable with imprisonment for a term which may extend to\none year, or with fine, or with both."
    },
    {
      "provision_ref": "sec46b",
      "section": "46B",
      "title": "Section 46B. Disobedience of orders.⎯ Whoever, without lawful excuse, fails or refuses to comply",
      "content": "with any direction or order issued by the Authority under this Ordinance shall be guilty of an offence\npunishable under section 46."
    },
    {
      "provision_ref": "sec46c",
      "section": "46C",
      "title": "Section 46C. Attempts and abetments.⎯ Whoever attempts to commit or abets the commission",
      "content": "of an offence punishable under this Ordinance shall be deemed to have committed that offence."
    },
    {
      "provision_ref": "sec46d",
      "section": "46D",
      "title": "Section 46D. Summary trial of offences.⎯ Any Magistrate or Bench of Magistrates empowered",
      "content": "for the time being to try in a summary way the offences specified in sub-section (1) of section 260\nof the Code of Criminal Procedure, 1898 (Act V of 1898), may, if such Magistrate or Bench of\nMagistrates thinks fit, on application being made in this behalf by the prosecution, try any offence\npunishable under this Ordinance in accordance with the provisions contained in sections 262 to 265 of\nthe said Code.]"
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Cognizance of offences by Courts.⎯ No court shall take cognizance of any offence",
      "content": "punishable under this Ordinance except on a complaint in writing made by the Authority or by an\nofficer authorized for the purpose by the Authority.\n_____________\nCHAPTER VIII.⎯MISCELLANEOUS"
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Submission of Yearly reports and returns, etc.⎯ (1) The Authority shall submit to",
      "content": "2\nthe [Federal Government], as soon as possible after the end of every financial year but before the\nlast day of December next following, a report on the conduct of its affairs for that year.\n(2) The 2 [Federal Government] may, after giving sufficient notice to the Authority, require it\nto furnish the Government with⎯\n(i)        any return, statement, estimate, statistics, or other information on regarding any\nmatter under the control of the Authority, or\n(ii)       a report on any subject with which the Authority is concerned, or\n(iii)      a copy of any document in the charge of the Authority; and the Authority shall\ncomply with every such requisition."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Power to dispose of land. ⎯ The Authority may retain, or may lease, sell, exchange,",
      "content": "rent or otherwise dispose of any land vested in it.\n1\n[49A. Recovery of dues, etc.⎯ Any sum due to the Authority from, or any sum wrongly\npaid to, any person under this Ordinance shall be recoverable as arrears of land revenue.\n_________________________________________________________________________________________________\n1\nIns. by Act No. XXII of 1966, ss. 12 and 13.\n2\nSubs. by Federal Adaptation of Laws Order, 1975 Art. II and Table."
    },
    {
      "provision_ref": "sec49b",
      "section": "49B",
      "title": "Section 49B. Summary ejectment of unauthorised occupants.⎯ The Deputy Commissioner or any",
      "content": "person authorized by him or the Authority in this behalf may, after giving fifteen days notice,\nsummarily eject any person in unauthorised occupation of any land or property vested in the Authority\nand may, for such ejectment, use such force including police force as may be necessary."
    },
    {
      "provision_ref": "sec49c",
      "section": "49C",
      "title": "Section 49C. Removal of building, etc., erected or used in contravention of this",
      "content": "Ordinance.⎯(1) If any building, structure, work or land is erected, constructed or used in\ncontravention of the provisions of this Ordinance or of any rule, regulation or order made thereunder,\nthe Deputy Commissioner, or any person empowered in this behalf by the Authority, may, by order\nin writing, require the owner, occupier, user or person in control of such building, structure, work or\nland to remove, demolish or so alter the building, structure or work, or to desist from using or to so\nuse the land, as to be in accordance with the said provisions.\n(2) If an order under sub-section (1) in respect of any building, structure, work or land is not\ncomplied with within such time as may be specified therein, the Deputy Commissioner, or any person\nempowered in this behalf by the Authority, may, after giving the person affected by the order an\nopportunity of being heard, remove, demolish or alter the building, structure or work, or stop the use\nof the land and, in so doing, may use such force including police force as may be necessary and may\nalso recover the cost therefor from the person responsible for the erection, construction or use of the\nbuilding, structure, work or land in contravention of the provisions as aforesaid."
    },
    {
      "provision_ref": "sec49d",
      "section": "49D",
      "title": "Section 49D. Police assistance. ⎯ The officer",
      "content": "in-charge of a police-station shall render such\npolice assistance as the Deputy Commissioner may require in the discharge of his functions under\nthis ordinance."
    },
    {
      "provision_ref": "sec49e",
      "section": "49E",
      "title": "Section 49E. Jurisdiction of courts barred.⎯ Save as otherwise provided by this Ordinance no",
      "content": "court or other authority shall have jurisdiction to question the legality of anything done or any action\ntaken under this Ordinance by or at the instance of the Authority.]\n1\n[49F. Admissibility of document or entry as evidence.⎯ A copy of any receipt,\napplication, plan, notice, order or other document or of any entry in a register, in the possession of the\nAuthority shall, if duly certified by the legal keeper thereof or other person authorized by the\nAuthority in this behalf, be admissible in evidence of the existence of the document or entry, and\nshall be admitted as evidence of the matters and transactions therein recorded in every case where,\nand to the same extent to which, the original document or entry would, if produced, have been\nadmissible to prove such matters.]\n2\n[49G. Ordinance to override other laws. ⎯ he Provisions of this Ordinance shall have\neffect notwithstanding anything to the contrary contained in any other law for the time being in force\nand such law shall, to the extent of any inconsistency , cease to have effect.]"
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Power to make rules. The 3[Federal Government] may, by notification in the",
      "content": "official Gazette, make rules to carry out the purposes of this Ordinance:\nProvided that no rules shall be made on any of the matters specified in section 38.\n__________________________________________________________________________________________________________________\n1\nIns. by Act No. XVI of 1968, s. 2.\n2\nIns. by Act. No IX of 2023, s. 4.\n3\nSubs. by Federal Adaptation of Laws Order, 1975 Art. II and Table.\n1\n[51. Power to make regulations.⎯ The Authority may make regulations, not inconsistent\nwith the rules, if any, on all matters for which regulations are necessary or expedient; and such\nregulations shall be published in the official Gazette.]"
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Dissolution of Authority and transfer of its assets and liabilities to the",
      "content": "2\n[Federal Government] and other agency determined by that Government.⎯ (1) The\n2\n[Federal Government] may, by notification in the official Gazette, declare that the Authority shall be dissolved\non such date as may be specified in such notification, and the Authority shall stand dissolved accordingly.\n(2) On and from the said date⎯\n(a)        (i)        all properties, funds and dues placed at the disposal of the Authority by\nthe 2 [FederalGovernment] ; and\n(ii)       all properties, funds and dues exchanged for, derived from, or otherwise\nattributable to the properties, funds and dues referred to in sub-clause\n(i), which, immediately before the said date, were held by or were\nrealisable by the Authority shall vest in, and be realisable by, the\n2\n[Federal Government] ;\n(b)        all properties, funds and dues, other than those referred to in cause (a),\nwhich, immediately before the said date, were vested in or were realisable by\nthe Authority shall vest in and be realisable by such agency as the 2 [Federal\nGovernment] may determine, and its decision thereon shall be final ;\n(c)        all liabilities which, immediately before the said date, were enforceable against\nthe Authority shall be assumed by and be enforceable against the\n2\n[Federal Government]or such agency as the 2 [Federal Government]\ndetermines under clause (b), as the case may be;\n(d)        for the purpose of completing the execution of any scheme which has not been\nfully executed by the Authority and of realizing properties, funds and dues\nreferred to in clause (a) and (b), the functions of the Authority under this\nOrdinance shall be discharged by the 2[Federal Government] or by the agency\ndetermined by the 2 [Federal Government] under clauses (b) and (c), as the case\nmay be; and\n(e)        the agency referred to in clauses (b), (c) and (d) shall keep such accounts of all\nmoneys respectively received and expended by it under this Ordinance, as the\n2\n[Federal Government] may prescribe.\n_________________________________________________________________________________\n1\nSubs. by Act No. XXII of 1966, s. 14.\n2\nSubs. by Federal Adaptation of Laws Order, 1975 Art. II and Table.\n[See section 2(p)]\nFrom Triangulation Point 5264 (near Village Nilan Bhotu), Map Ref.191698 (Survey of Pakistan map,\nscale 1 in. to 1 mile, sheet No.43 G-/1) north-east along the Rawalpindi tehsil boundary to spot height\n4949 Map Ref. 223713 (Survey of Pakistan map, scale 1 in. to 1 mile, sheet 43 G/1); then south-east\nagain along Rawalpindi tehsil boundary to the tehsil boundary and Nala junction at Map Ref. 227707\n(Survey of Pakistan map, scale 1 in. to 1 mile, sheet No.33 G/1); from here south-east along the Nala\nto the junction in the Nala at Map Ref. 250701 (Survey of Pakistan map, scale 1 in. to 1 mile, sheet\nNo.43 G/1). From this junction south-east across the range of hills and via Village Mangial (Map\nRef. 268696) to Village Karlot Map Ref. 287693 (Survey of Pakistan map, scale 1 in. to 1 mile,\nsheet No.43 G/1). From Village Karlot south-east along the Nala to Nala and Kurang Nala junction\nand along Kurang Nala to junction of Kurang Nala and Murree Road near Village Chatter Parao at\nmile-stone 18 and 6 furlongs, Map Ref. 304685 (Survey of Pakistan map, scale 1 in. to 1 mile sheet\nNo.43 G/1). From here due east across country to the Rawalpindi tehsil boundary at Map Ref. 310683\n(Survey of Pakistan map, scale 1 in. to 1 mile, sheet No.43 G/5) and south-east along the tehsil\nboundary to the junction of the tehsil boundary and Kurang Nala at Map Ref. 315676, then north-\neast along the Kurang Nala to the junction of the nala and tehsil boundary at Map Ref. 327678\n(Survey of Pakistan map, scale 1 in. to 1 mile, sheet No.43 G/5). From this junction south-east\nacross country via spot height 2954 Map Ref. 345664 (Survey of Pakistan map, scale 1 in. to 1 mile,\nsheet No.43 G/5) across the range south-east to spot height 2276 Map Ref. 358655 (Survey of Pakistan\nmap, scale 1 in. to 1 mile, sheet No.43 G/5 ), located near Rawalpindi tehsil boundary then south-east\nalong the Rawalpindi tehsil boundary to junction of boundary and Gumrah Kas at Map Ref. 369636\n(Survey of Pakistan map, scale 1 in. to 1 mile, sheet No.43 G/6). From this junction south-east across\ncountry to Village Sambli Tijal on the River Soan, Map Ref. 405615; then along River Soan and\nRawalpindi tehsil boundary east up to Map Ref. 457595 (bend in the boundary) and south-west again\nalong tehsil boundary to a point at Map Ref. 424541 (Survey of Pakistan map, scale 1 in. to 1 mile,\nsheet No.43 G/6) 400 yards south of the Lehtrar Road. Then west along a line parallel to Lehtrar\nRoad (400 yards south of the road ) to a point on Malal Nala at Map Ref. 302523 (Survey of Pakistan\nmap, scale 1 in. to 1 mile, sheet No. 43 G-/2). Then south-west along the Malal Kas to junction\nMalal Kas and River Kurang Map Ref. 225455 (Survey of Pakistan map, scale 1 in. to 1 mile, sheet\nNo.43 G/2). From here north- west along River Kurang to the junction of River Kurang and Nala at\nMap Ref. 172528 (Survey of Pakistan map, scale 1 in. to 1 mile, sheet No.43 G/2); then north-west\nalong this Nala via Village Sohan Map Ref. 166528 (Survey of Pakistan map, scale 1 in. to 1\nmile, sheet No.43 G/2) to the junction of Nala and Muree Road near Milestone 6, map Ref. 154537\n(Survey of Pakistan map, scale 1 in. to 1 mile, sheet No.43 G/2); from this junction south-west across\ncountry to the bend in Lei Nala (near village Narala) at Map Ref. 138530 (Survey of Pakistan map,\nscale 1 in. to 1 mile, sheet No.43 G/2). Then south-west along Lei Nala to junction of Lei Nala and\nBedara wali Kas, Map Ref. 119510 (Survey of Pakistan map, scale 1 in. to 1 mile, sheet No.43 G/2).\nThen south along Leh Nala to a point map Ref. 117479 being junction of Leh Nala and a tributary\n(Survey of Pakistan map, scale 1 in. to 1 mile, sheet No. 43 G/2.) Then north-west and west to the\nsource of this tributary near a point map Ref. 047477 (Survey of Pakistan map, scale 1 in. to 1 mile,\nsheet No.43 C/14); from this point north-west along the Kutcha road to the junction of this Kutcha\nroad a and track at Map Ref. 044480 (Survey of Pakistan map, scale 1 in. to 1 mile, sheet No.43,\nC/14). From here, south-west across country to a point 100 yards west of G.T.Road, Map Ref. 040478\n(Survey of Pakistan map, scale 1 in. to 1 mile, sheet No.43 C/14); then north-west along a line parallel\nto the G. T. Road, and at a distance of 100 yards from it to Nicholson Monument at map. Ref. 884568\n(Survey of Pakistan map, scale 1 in. to 1 mile, sheet No.43 C/14). Then east along the ridge of\nMaragala Range via spot heights 2613, 2981, 3371 and 3338 to triangulation point height 3352 map\nRef. 979604 on the boundary line of districts Hazara and Rawalpindi (Survey of Pakistan map, scale\n1 in to 1 mile, sheet No.43 C/14). Then east along this boundary line back to the starting point\ntriangulation height 5264.\nStarting from a point, map reference 534125 (sheet 43 F/8, 1 in. to 1 mile map of G.T.S.) nearly 2\nmiles North of Kohala on Azad Kashmir 1[Pakistan] border running south along River Jhelum\n(boundary of Azad Kashmir and 1[Pakistan] up to a point, Map, Ref. 641678 (sheet 43 G/9) being the\njunction of boundaries of Murree Tehsil, Kahuta Tehsil and Azad Kashmir. Then along the southern\nboundary of Murree Tehsil up to junction of Khad Nala and Murree Tehsil boundary Map Ref.\n568699 (sheet 43 G/9). Then south-west along Khad Nala to a point Map Ref. 504608 (sheet 43 G/6)\nbeing the junction of Khad Nala and a Tributary. Then south-east along the tributary via Village\nLehtrar Nala to Nala and track junction at map reference 518594 (sheet 43 G/6). Then along this\ntrack via village Marhiman south-west to the track and a nala junction at map reference 506571\n(sheet 43 G/6). Then south-west along this Nala via Village Jambhiri and Pihar to this Nala and River\nLing junction at map reference 463483 (sheet 43 G/6). From here south-west along River Ling to the\njunction of Rawalpindi Tehsil boundary and River Ling at map reference 369382 (sheet 43 G/6).\nThen along eastern, southern and western boundary of Rawalpindi Tehsil up to bend at map reference\n910683 (sheet 43 C/13), about a mile south of Village Salargah. Then follow along River Harro north\neast up to a point map Ref. 168810 (sheet 43 G/1) near spot height 2518, which is the junction of\nRiver Harro and boundary line of Haripur and Abbottabad Tehsils of Hazara District. Then along\nsouthern boundary of Abbottabad Tehsil of Hazara District up to point map reference 253833 (sheet\n43 G/1) at the intersection of Abbottabad Tehsil boundary and River Karral Harroo; along River\nKarral Harro due north-east to point map reference 344933 (sheet 43 G/5) being junction of Karral,\nHarro and Samundar Katha near spot height 3730 and then along Samundar Katha. Stream up to point\nMap Ref. 381017 (sheet 43 F/8) on junction of Samundar Katha Stream and boundary line between\nVillages Tatrila and Nagribala of Tehsil Abbottabad. Then running along the boundary line between\nVillages Tatrila and Nagribala (near spot height 7799 ), Bagh and Nagribala, Bagnotar and Bara Gali,\nNamli Mira, Phalkot and Bakot and Mulia and Bakot including Villages Nagribala, Bara Gali, Namli\nMira and Bakot back to the starting point map reference 534125 (sheet 43 F/8).\nDated. 12-01-2026\n_________________________________________________________________________________________________________________\n1\nSubs. by Federal Adaptation of Laws Order, 1975 Art. II and Sch."
    }
  ],
  "definitions": []
}
