{
  "id": "pk-capital-territory-local-government-ordinance-1979-repealed-by-act-x-at-2015",
  "type": "statute",
  "title": "Capital Territory Local Government Ordinance, 1979(Repealed by Act,X at 2015)",
  "title_en": "Capital Territory Local Government Ordinance, 1979(Repealed by Act,X at 2015)",
  "short_name": "CTLGO",
  "status": "repealed",
  "issued_date": "1979-08-19",
  "in_force_date": "1979-08-19",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NpbJ0%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Capital Territory Local Government Ordinance, 1979(Repealed by Act,X at 2015) (XXXIX of 1979) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.",
      "content": "(1) This Ordinance may be called the\nCapital Territory Local Government Ordinance, 1979.\n(2) It extends to the rural areas of the Capital Territory.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions._(1) In this Ordinance, unless there is anything repugnant in the subject",
      "content": "or context,-\n(a)    “animal” means cows, buffaloes, bulls, ox-.n, bullocks, heifers, calves, camels,\nsheep and goats ;\n(b)    “Authority” means the Capital Development Authority constituted under section\n4 of the Capital Development Authority Ordinance, 1960 (XXIII of 1960) ;\n(c)    “bey-laws” means bye-laws made under this Ordinance,;\n(d)    “Capital Territory” means the Islamabad Capital Territory referred to in\nparagraph (b) of clause (1) of Article 1 of the Constitution ;\n(e)    “Chairman” means Chairman of a Union Council ;\n(f )   “Election Authority” means an authority constituted or officer appointed as\nElection Authority under section 17 ;\n(g)     “elected member” means a member elected to a Union Council ;\n(h)     “electoral roll” means the electoral roll prep-red under section 4 of the Electoral\nRolls Act, 1974 (XXI of 1974) ;\n(i)     “local area” means an area the limits of which have been declared under section\n8;\n(j)     “Local Fund” means the fund of a Union Council ;\n(k)     “member” means a member of a Union Council ;\n(l)     “official” means a person who is in receipt of salary from the revenues of the\nFederation or of a Province or out of the fund of a local authority;\n(m) “Order” means the Basic Democracies Order, 1959 (P. O. No. 18 of 1959) ;\n(n)     “Panchayat” means a Village Panchayat constituted under section 81 ;\n1\n[(nn) “peasant” means a person who is owner of not more than five acres of\nagricultural and engages himself personally in the cultivation land;]\n(o) “prescribed” means prescribed by rule ;\n(p) “rules” means rules made under this Ordinance ;\n(q)     “rural area” means any area of the Capital Territory which the Federal\nGovernment may, by notification in the official Gazette, declare to be rural area\nfor the purposes of this Ordinance ;\n(r)     “specified” means specified by standing orders of the Federal Government ;\n(s)     “tax” includes any cess, fee, rate, toll or other impost leviable under this\nOrdinance ;\n(t)     “Union Council” means a Union Council constituted under this Ordinance ;\n(u)     “Vice-Chairman” means a Vice-Chairman of a Union Council ;\n(v)     “village,” means the area comprising a revenue estate ;\n1Cl. (nn) ins. by the Capital Territory Local Government (Second Amdt.) Ordinance, 1979 (69 of 1979), s. 2 (w.e.f 18 -8-79).\n(w) “voter” means a person whose name for the time being appears on the\nelectoral roll of the local area [; and]1\n2\n[(x) “worker” has the same meaning as in the Industrial Relations Ordinance,\n1969, and includes a self employed craftsman like blacksmith, carpenter,\ntailor and shoemaker].\n(2) The words and expressions ‘complaint’, ‘cognizable offence’, ‘officer--\nin-charge of a police-station’ and ‘police-station’ shall have the same meaning as are\nrespectively assigned to them in section 4 of the Code of Criminal Procedure, 1898\n(Act V of 1898), and the words ‘decree’ and ‘movable property’ shall have the same\nmeaning as are respectively assigned to them in section 2 of the Code of Civil\nProcedure, 1908 (Act V of 1908)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Power to except local areas.",
      "content": "(1) The Federal Government may, by\nnotification in the official Gazette, except any rural area or part thereof from the\noperation of all or any of the provisions of this Ordinance.\n(2) While a notification under subsection (1) is in force, the Federal\nGovernment may make rules for the regulation of the matters so excepted."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Repeals and savings.",
      "content": "(1) On the assumption of office by a Union Council\nin any local area, the Order 3[and the Conciliation Courts Ordinance, 1961 (XLIV of\n1961)], shall, in so far as applicable to that area, stand repealed.\n(2) Where an enactment stands repealed under subsection (1), any appointment,\nrule, regulation or bye-law made, notification, order or notice issued, scheme framed,\nrights acquired, claims preferred, tax imposed or assessed, contract entered into, suit\ninstituted or action taken under such enactment shall, so far as it not inconsistent with\nmade, issued, framed, acquired, preferred, imposed or assessed, entered into, instituted\nor taken under this Ordinance.\n1Subs. by the Capital Territory Local Government (Second Amdt.) Ordinance, 1979 (69 of 1979), for full-stop, s. 2 (w.e.f. 18-8-79).\n2Added ibid., (w.e.f. 18-8-79).\n3The words in crotchets have been omitted to the extent of rural areas of the Capital Territory by Ordinance 19 of 1982, s. 2."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Succession. A Union Council constituted under this Ordinance for a local area shall",
      "content": "be the successor of such Union Council as was constituted for that area under the Order."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Ordinance to override other laws. The provisions of this Ordinance shall have",
      "content": "effect notwithstanding anything contained in any other law relating to Local Government."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Certain matters to be prescribed. Where this Ordinance makes any provision for",
      "content": "anything to be done but no provision has been made as respects the authority by whom, or the\nmanner in which, it shall be done, then it shall be done by such authority and in such manner\nas may be prescribed."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Declaration of limits of local areas. The Federal Government shall, by",
      "content": "notification in the official Gazette, declare the limits of each local area:\nProvided that, as far as may be, a local area shall be a territorial unit and fulfil the\nrequirements of becoming a unit of planning and development.\n_______"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Constitution of Union Councils",
      "content": "(1) For each local area, a Union Council shall\nbe constituted in accordance with the provisions of this Ordinance.\n(2) Each Union Council shall be a body corporate having perpetual succession and a\ncommon seal with power, subject to the provisions of this Ordinance and the rules, to acquire,\nhold and transfer property, both movable and immovable, and shall, by its name, sue and be\nsued.\n(3) The Federal Government may, by notification in the official Gazette, specify the\nname by which any Union Council shall be known and, unless the name of a Union Council\nis so specified it shall be known as the Union Council of the place where its office is situated."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Division, amalgamation and reconstitution of Union Council.",
      "content": "(1) The Federal\nGovernment may, by notification in the official Gazette, divide a Union Council into two or\nmore Union Councils or alter the limits of any Union Council or amalgamate to or Union\nCouncils and may specify in the notification the consequences which shall ensue upon the\npublication of such notification.\n(2) When, as a result of such division, alteration or amalgamation, any new Union\nCouncil is constituted in accordance with the provisions of this Ordinance or in the manner\nspecified fn the notification, the existing members of any such Union Council so divided,\naltered or amalgamated shall become the members of such Union Council or Councils as the\nFederal Government may, by notification in the official Gazette, specify as if such members\nhad been elected to that Council.\n_______"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Union Councils. A Union Council shall consist of such number of members as",
      "content": "may be specified keeping in view the population of the local area for which it is constituted."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Representation of minorities. A Union Council may, in addition to the number",
      "content": "of members specified under section 11, have such number of members from the minority\ncommunities as the Federal Government may, by notification in the official Gazette, fix."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Representation of peasants, workers and women.",
      "content": "(1) A Union Council may\nhave such number of members representing peasants, workers and women as may be fixed by\nthe Federal Government and such members shall be elected by the elected members of each\nUnion Council in the prescribed manner.\n(2) Nothing contained in subsection (1) shall prevent the peasants, workers and\nwomen from being elected to a general seat in a Union Council.\n_______"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Elections of Chairman and Vice",
      "content": "Chairman of Union Councils. Subject to the\nprovisions of this Ordinance, the Chairman and Vice-Chairman of a Union Council shall be\nelected in the prescribed manner."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Mode of elections.",
      "content": "(1) Save as otherwise provided, election of members of\nUnion Councils shall be on the basis of adult franchise through ballot.\n(2) The electoral unit may be mufti-member or single-member.\n(3) In any mufti-member electoral unit the candidates securing the highest numbers of\nvotes shall be declared as elected.\n(4) Every voter within an electoral unit shall have only one vote irrespective of the\nnumber of members to be elected from that electoral unit."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Election of members from minority communities. Members from the minority",
      "content": "communities shall be elected by the voters enrolled on the electoral roll of a local area for\nnon-Muslims and the provisions of section 15 shall mutatis mutandis apply to their election."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Election Authority",
      "content": "(1) The Federal Government may appoint an Election\nAuthority for holding elections to the Union Councils.\n(2) The Election Authority shall exercise such powers and perform such functions as\nmay be prescribed.\n(3) It shall be the duty of the Election Authority to ensure that the elections are\nconducted honestly, justly, fairly and in accordance with the law and that corrupt practices\nare guarded against."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Delimitation of electoral units. The electoral units for all the Union Councils",
      "content": "shall be delimited by the Election Authority and notified in the prescribed manner."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Number of members in electoral units. The number of members to be elected",
      "content": "from each electoral unit shall be fixed by the Election Authority in accordance with the\nprovisions of this Ordinance."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Right of vote. Every person enrolled as a voter on the electoral roll shall have the",
      "content": "right to vote:\nProvided that, if a person is enrolled twice, whether in the same electoral unit or in\nmore than one electoral units, he shall be eligible to vote only once."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Qualifications of candidates and members. A person who is not less than",
      "content": "twenty-one years of age on the last day fixed for filing the nomination papers shall be\nqualified to be elected as a member of a Union Council if for the time being his name appears\non the electoral roll of the local area of that Council and is not subject to any disqualification\nspecified in section 22."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Disqualifications of candidates and members. A person shall be disqualified",
      "content": "from being elected as, and from being, a member of a Union Council if he__\n(a)   has ceased to be citizen of Pakistan ;\n(b)   is an undischrged insolvent ;\n(c)   is of unsound mind and has been so declared by a competent Court;\n(d)   has been on conviction for an offence involving moral turpitude sentenced to\nimprisonment for a term of not less than six months, unless three years, or such\nless period at the Federal Government in any case may specify, have elapsed\nfrom the date of expiration of the period of sentence ;\n(e)   is in the service of Pakistan or of a public statutory corporation, a Union Council\nor other local authority ;\n(f)   is under contract for work to be done or goods to be supplied to the Union\nCouncil concerned or has otherwise any pecuniary interest in its affairs ; or .\n(g)   fails to take oath or to declare his properties as required under this Ordinance.\n1\n[22A. Candidate not to contest election on political party basis. __ (1) No person\ncontesting election to a Union Council shall, directly or indirectly, __\n(a)        give himself out as a candidate or nominee of a political party ;\n(b)        claim, draw or receive any financial or other assistance from any political\nparty for the purpose of the election;\n(c)        bear, display or carry any document, sign, insignia, flag or any other thing\nindicating his association with, or affiliation to, a political party;\n(d)        seek the votes or sympathies of the people on party basis or on the basis of the\nmanifesto of any political party; or\n(e)        seek the votes or support of the people by attributing direct or indirect party\naffiliations to any of his opponents.\n(2) Whoever__\n(a)        is found by the Election Authority to have contravened the provisions of sub-\nsection (1) shall stand disqualified from being a candidate for election to a\nUnion Council for a period of four years; or\n(b)        having been elected as a member of a Union Council is found by the Election\nAuthority to have contravened the provisions of sub-section (1) shall cease\nforthwith to hold the office of such member and stand disqualified from being\na candidate for election to a Union Council for a period of four years. ]"
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Conduct of elections. Elections to Union Councils shall be conducted in the",
      "content": "prescribed manner.\n_______\nTERM OF OFFICE, ETC."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Term of office.",
      "content": "(1) The term of office of a Union Council shall be four years\ncommencing on the date on which it holds its first meeting :\nProvided that, on the expiry of the term of office of a Union Council, the Federal\nGovernment may extend the term of office for a period not exceeding six months or appoint\nany person for the like period to perform such functions of the Union Council as may be\nspecified.\n1Section 22A ins. by the Capital Territory Local Government (Amdt.) Ordinance, 1979 (45 of 1979), s. 2.\n(2) A Union Council shall elect one of its members as Chairman and another as\nVice-Chairman in its first meeting and to the exclusion of any other business :\nProvided that the first meeting shall be held not later than thirty days from the day on\nwhich the names of its members are notified.\n(3) The term of office of a Chairman and a Vice-Chairman shall be the same as that of\na Union Council."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Oath of office. A member, Chairman and Vice",
      "content": "Chairman shall, before he enters\nupon his office, make and subscribe to an oath in such form as may be prescribed."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Declaration of properties. Every Chairman, Vice",
      "content": "Chairman and member shall,\nbefore he enters upon his office, submit to an officer authorised by the Federal Government\nin this behalf and in such manner as the Federal Government may direct, a declaration in\nwriting of properties, both movable and immovable, whether within or outside Pakistan,\nwhich he or any member of his family owns or has in his possession or under his control or in\nwhich he or any member of his family has any beneficial interest.\nExplanation.-For the purposes of this section, the expression “member of his family”, in\nrelation to a person, means__\n(a)   the spouse of such person, and\n(b)   such of the children, parents, brothers and sisters as reside with, and are wholly\ndependent upon, such person."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Casual vacancy.",
      "content": "(1) If the office of a member or a Chairman or a\nVice-Chairman for any reason falls vacant during the term of office of a Union Council, a\nnew member or Chairman, or Vice-Chairman, as the case may be, shall be elected in the\nprescribed manner and he shall hold office for the residue of such term:\nProvided that, if the vacancy in the office of a member occurs within four months of\nthe expiry of the term of a Union Council, the vacancy shall not be filled.\n(2) Notwithstanding anything contained in sub-section (1), unless the time is extended\nby the Federal Government, the vacancy in the office of the Chairman or Vice-Chairman\nshall be filled within fifteen days from the date such vacancy is notified."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Removal.",
      "content": "(1) The Federal Government may, after giving him an opportunity of\nbeing heard, remove a Chairman or a Vice-.Chairman or a member from office in the\nprescribed manner if he-\n(a)   has incurred any of the disqualifications enumerated in section 22 ;\n(b)   absents himself without reasonable cause from three consecutive meetings of the\nUnion Council ; or\n(c)   is guilty of abuse of power or misconduct.\nExplanation.-For the purposes of this subsection, `misconduct includes bribery,\ncorruption, jobbery, favourtism, nepotism or wilful diversion of the funds of the Union\nCouncil or any attempt at, or abetment of such misconduct.\n(2) A Chairman, a Vice-Chairman or a member removed under subsection (1) may\nprefer an appeal in the prescribed manner to the officer or authority appointed for the purpose\nby the Federal Government.\n(3) A Chairman or a Vice-Chairman removed from office shall cease to be a member."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Resignation. A Chairman, a Vice",
      "content": "Chairman or a member may resign his office by\nwriting under his hand addressed to the Union Council of which he is the Chairman,\nVice-Chairman or member."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Vote of no confidence. A Chairman or Vice",
      "content": "Chairman shall vacate office if a\nvote of no-confidence is passed against him in the prescribed manner by two-third majority of\nthe total number of members of the Union Council holding office for the time being:\nProvided that__\n(a)   a motion of no-confidence shall not be moved by less than one-fourth of the\ntotal number of members ;\n(b)   a motion of no-confidence shall not be moved before the expiry bf six months of\nhis assumption of office as Chairman or Vice-Chairman ; and\n(c)   where a motion of no-confidence against a Chairman or Vice-Chairman has\nbeen moved and as failed to secure the requisite majority of votes in its favour at\nthe meeting, no similar motion shall be moved against him before the expiry of\ntwelve months from the date such motion was moved."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Bar against re",
      "content": "election. When a Chairman or a Vice-Chairman is removed from\noffice under section 30, he shall not, during the unexpired period of the term of his office, be\neligible for re-election to the said office."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Honorarium. Every Chairman and Vice",
      "content": "Chairman shall be part-time functionary\nof the Union Council and shall be paid such honorarium or allowance as may be prescribed."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Notification of election, resignation and removal of Chairman, Vice",
      "content": "Chairman and members. Every election, resignation or removal of the Chairman,\nVice-Chairman or a member, or the vacation of office by a Chairman, Vice-Chairman or a\nmember, shall be notified in the official Gazette.\n_______"
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Executive authority and conduct of business.",
      "content": "(1) The executive authority of a\nUnion Council shall extend to the doing of all acts necessary for the due discharge of its\nfunctions under this Ordinance.\n(2) Save as otherwise provided, the executive authority of a Union Council shall vest\nin and be exercised by its Chairman.\n(3) All acts of a Union Council, whether executive or not, shall be expressed to be\ntaken in the name of the Union Council and shall be authenticated by any officer authorised\nby the Council."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Duties of the Chairman. It shall be the duty of the Chairman",
      "content": "(a)   to preside, unless prevented by reasonable cause, at all meetings of the Union\nCouncil, and, subject to the provisions of the rules for the time being in force, to\nregulate the conduct of business at such meetings ;\n(b)   to watch over the financial and executive matters of the Union Council and to\nperform such executive function as may be allotted to him by or under this\nOrdinance ;\n(c)   to exercise supervision and control over the acts and proceedings of all officers\nand servants of the Union Council in matters of executive administration and in\nmatters concerning the accounts and records of the Union Council ; and to\ndispose of all questions relating to the service of the said officers and servants\nand their pay, privileges and allowances:\nProvided that the service matters of officers belonging to any cadre\nconstituted under section 41 shall be referred to the Federal Government ;\n(d)   to direct in cases of emergency the execution or stoppage of any work or the\ndoing of any act which requires the sanction of the Federal Government of the\nUnion Council, and the immediate execution or doing of which is, in his\nopinion, necessary for the service or safety of the public, and to direct that the\nexpenses of executing such work of doing such act shall be paid from the Local\nFund:\nProvided that he shall-\n(i)    not act under this section in contravention of any order of the Federal\nGovernment or the Union Council prohibiting the execution of any\nparticular work or the doing of any particular act, and\n(ii)   report . forthwith the action taken under this section and the reason\ntherefor to the Federal Government and to the Union Council at its next\nmeeting."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Secretary of Council. There shall be a Secretary in every Union Council who will",
      "content": "perform such functions as may be delegated to him by the Council."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Disposal of business",
      "content": "(1) The business of a Union Council to the extent and in\nmeetings, or at the meetings of its subcommittees, or by its Chairman or servants or other\nfunctionaries.\n(2) No proceedings of a Union Council shall be invalid by reason only of the\nexistence of any vacancy in, or any defect in the constitution of, the Council, or by reason\nonly that some person who was not entitled to do so set or voted or otherwise took part in its\nproceedings.\n(3) A Union Council may appoint sub-committees consisting of such number of its\nmembers and other persons, if any, to perform such functions in such manner as may be\nprescribed.\n(4) All decisions taken by a Union Council shall be reported to the Federal\nGovernment within the prescribed time.\n(5) All questions shall be decided by a majority of the members present and voting ;\nthe person presiding having a second or casting vote in case of equality of votes."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Meetings.",
      "content": "(1) A Union Council shall within three months of the assumption of\noffice frame bye-laws for the conduct of its meetings which may, besides other matters,\nprovide for___\n(a)    the types of meeting, that is to say, ordinary, special or emergent ;\n(b)    the types of business to be conducted in different types of meetings ;\n(c)    the place of meetings ;\n(d)      notices required for different meetings ;\n(e)    authority to call meetings ;\n(f )   notice of agenda for the meetings ;\n(g)    quorum for different meetings ;\n(h)    order of business to be conducted in meetings ;\n(i)    the manner of asking questions ;\n(j)    motion and amendments and their withdrawal for discussions on them ;\n(k)    speeches to be delivered ;\n(l)   training, discourses or discussions to be arranged at the meetings ;\n(m)   preservation of order ;\n(n)   decision by votes ;\n(o)   language to be used ;\n(p)   adjournments or postponements ;\n(q)   co-opting of other members or officials ;\n(r)   re-consideration of the matters. once disposed of ; and\n(s)   suspension of meetings.\n(2) All meetings of a Union Council shall be presided over by its Chairman, and, in his\nabsence, by the Vice-Chairman and, in the absence of both, by a member chosen for that purpose by\nthe members present.\n(3) A Union Council shall hold at least one meeting during a month.\n(4) A member shall not be liable to any proceedings in any Court in respect of anything said\nby him or any vote given by him in the meeting of a Union Council so long as the action does not\nundermine the ideology, integrity or solidarity of Pakistan.\n(5) All meetings shall be public except when a Union Council by a majority vote\ndecides to consider any matter m a session attended exclusively by its members.\n(6) Minutes of the names of members present and of the proceedings at each meeting\nshall be drawn up and recorded in a book to be kept for the purpose which shall be signed by\nthe person presiding at the meeting and shall at all reasonable times and without charge be\nopen to inspection by members; provided that no member shall be entitled to object to the\nminutes of any meeting in which he was present.\n(7) A member who, directly or indirectly, by himself or by any partner, employer or\nemployee has any share or interest in respect of any matter, or has acted professionally in\nrelation to any matter on behalf of any person having therein any such share or interest as\naforesaid, shall not vote or take part in any proceedings relating to a matter aforesaid of a\nUnion Council or any of its committees."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Contracts. __ (1) All contracts made by or on behalf of a Union Council shall be",
      "content": "(a)   in writing and expressed to be made in the name of the Union Council ; and\n(b)   executed in such manner as may be prescribed.\n(2) No contract executed otherwise than in conformity with the provisions of this\nsection shall be binding on the Union Council.\n(3) Any person who has, directly or indirectly, by himself or by any partner, any share\nor interest in any contract with, by or on behalf of a Union Council or in any employment\nwith, under, by or on behalf of the Union Council, other than as an officer or servant of a\nUnion Council, shall be disqualified for being an officer or servant of such Union Council.\n(4) Any officer or servant of a Union Council who acquires, directly or indirectly, by\nhimself or by his partner, any interest in any such contract or employment as aforesaid shall,\nafter enquiry in the prescribed manner, cease to be a Union Council officer or servant."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Works. The Federal Government may, by rules, provide for",
      "content": "_\n(a)   the preparation of plans and estimates for works to be executed by a Union\nCouncil;\n(b)   the authority by whom and the conditions subject to which such plans and\nestimates shall be technically approved and estimates administratively\nsanctioned ; and\n(c)   the agency by which such plans and estimates shall be prepared and such works\nshall be executed.\n______"
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Cadres of functionaries.",
      "content": "(1) The Federal Government may constitute one or\nmore cadres of functionaries of Union Councils comprising such pay scales and grades and in\nsuch manner and subject to such conditions as may be prescribed.\n(2) The Federal Government may, from time to time, specify the posts in the Union\nCouncils which shall be filled by persons belonging to these cadres.\n(3) Notwithstanding the provisions of subsection (1) members of the Local Councils\nService constituted under the Order, may be absorbed in a cadre constituted under that\nsubsection, if they possess qualifications prescribed therefor."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Servants of Union Councils.",
      "content": "(1) A Union Council may, and if so required by\nthe Federal Government shall, on the prescribed terms and conditions, employ such servants\nas are deemed necessary for the efficient performance of its functions under this Ordinance.\n(2) If, in the opinion of the Federal Government, the number of servants employed by a Union\nCouncil under subsection (1) or the remuneration fixed for any of them is excessive, the Union\nCouncil shall, on being required by the Federal Government to do so, reduce the number of its\nservants or the remuneration of any of them, as the case may be.\n(3) Pending constitution of a cadre of functionaries of Union Councils, and notwithstanding\nanything contained in any other law, rule or instruction, the Local Councils Service constituted under\nthe Order is declared to be a Service of Pakistan and a person who, being a member of the Local\nCouncils Service, was serving a Local Council in the rural area immediately before the\ncommencement of this Ordinance shall be deemed to be a civil servant for the purposes of the Service\nTribunals Act, 1973 (LXX of 1973)."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Disciplinary action and transfer.",
      "content": "(1) Subject to the provisions of this Ordinance and\nthe rules, the appointing authority or an officer authorised in this behalf may suspend, remove,\ndismiss, reduce in rank or otherwise punish any person belonging to a cadre of functionaries and the\nother servants of a Union Council;\nProvided that no such person or servant shall be dismissed, removed from service or reduced\nin rank by an authority subordinate to that by which he was appointed.\n(2) Notwithstanding anything contained in any other law, rule, contract or judgment or decree\nof any Court, persons belonging to a cadre of functionaries and all other servants of Union Councils\nshall be liable to transfer by the Federal Government or any officer or authorised by the Federal\nGovernment in this behalf from one Union Council to another Union Council in any capacity:\nProvided that on transfer a servant of a Union Council shall be entitled to draw pay in\nthe same National Pay Scale plus special pay or allowances, if any, attached to the post to\nwhich he is transferred irrespective of any special pay or allowances he was drawing at the\ntime of his transfer:\nProvided further that on transfer of a servant of a Union Council, the lien and all\nservice benefits including pensionary rights accrued to or earned by him shall stand\ntransferred to and be the liability of the Union Council to which he is transferred and he shall\nbe deemed to be its servant Provided further that leave salary and pension contribution for the\nperiod for which he has already served shall be paid by the Union Council from which he is\ntransferred to the other Union Council:\nProvided further that leave salary and pension contribution for the period for wwhich\nhe has already served shall be paid by the Union Council from which he is transferred to the\nother Union Council."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Provident Fund, pension and other facilities.",
      "content": "(l) A Union Council may\nestablish and maintain a Provident Fund and require any of its servants to contribute to such\nfund, any may itself contribute to it in such manner and in such proportion as may be\nprescribed.\n(2) A Union Council may, in the prescribed manner, and with the previous sanction of the\nFederal Government, provide for the payment of pension to its servants after retirement.\n(3) A Union Council may, with the previous sanction of the Federal Government, grant a\nspecial pension or gratuity to the family of a servant who dies of disease or injury contacted or\nsuffered in the discharge of his official duties.\n(4) A Union Council may, in the prescribed manner, operate a scheme of group insurance for\nits employees and require its employees to subscribe to it.\n(5) The Federal Government may, in the prescribed manner, establish and maintain__\n(a)   a Fund for a cadre of functionaries for maintenance of such cadre ;\n(b)   a Provident Fund and require persons belonging to a cadre functionaries to subscribe to\nsuch Fund ; and\n(c)   a Pension Fund out of which shall be paid any pension, family pension or gratuity to\npersons belonging to a cadre of functionaries.\n(6) Every Union Council shall contribute to the funds established and maintained\nunder subsection (5) in such proportion and in such manner as may be specified by the\nFederal Government.\n(7) The Federal Government may, in the manner prescribed, operate a scheme of\ngroup insurance for persons belonging to a cadre of functionaries and require them to\nsubscribing to it."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Service rules",
      "content": "(1) Subject to the provisions of this Ordinance, the Federal\nGovernment may, by rules, __\n(a)   prescribe the conditions of service of the servants of the Union Councils;\n(b)   prescribe the scales or grades of pay for the servants of the Union Councils;\n(c)   prescribe a schedule of establishment for the staff that shall be employed by a\nUnion Council ;\n(d)   prescribe the qualifications for various posts under Union Councils ;\n(e)   prescribe the principles to be followed in making appointments to various posts\nunder the Union Councils ;\n(f)   prescribe the method for the holding of enquiries in cases where disciplinary\naction is proposed to be taken against servants of the Union Councils and\nprovide for penalties and appeals against orders imposing penalties ; and\n(g)   provide for other matters necessary for the efficient discharge of duties by the\nservants of the Union Councils.\n(2) Subject to the provisions of this Ordinance, the Federal Government may make\nrules in respect of any or all matters mentioned in subsection (1) for persons belonging to a\ncadre of functionaries."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Training and training institutions.",
      "content": "(l) The Federal Government may__\n(a)   set up institutions or make such other arrangements as may be necessary for-\n(i)    the pre-service and in-service training of the functionaries of the Union\nCouncils, Government departments and other interested agencies;\n(ii)   the training of Chairman, Vice-Chairman and members ;\n(iii) organizing conferences and seminars on local Government and related\nsubjects ; and\n(iv) undertake research in local Government and allied subjects independently\nor in collaboration with the Universities or research institutions ; and\n(b)    provide for__\n(i)    the administration of institutions ;\n(ii)   the compulsory training of members and staff of Union Councils ;\n(iii) the courses to be studied ;\n(iv) the holding of examinations and award of diplomas and certificates to successful\ncandidates ;\n(v)    affiliating institutions with a University ; and\n(vi) associating with such universities, colleges or training institutes as may be\nnecessary for the training of staff of the engineering, education, public health\nand other departments of Union Councils.\n(2) A Union Council may be required to pay towards the cost of institutions set up or\nfor other arrangements made under subsection (1) in such proportion as the Federal\nGovernment may, from time to time, determine.\n______"
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Functions of Union Councils. A Union Council may, and if the Federal",
      "content": "Government so directs shall, perform all or any of the functions specified in the First\nSchedule.\n______"
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Encroachment.",
      "content": "(1) No person shall make an encroachment, movable or\nimmovable, on an open space or land vesting in, or managed, maintained or controlled by, a\nUnion Council, or on, over or under a street, road graveyard, or drain within the local area\nof a Union Council except under a licence granted by the Union Council and to the extent\npermitted by such licence.\n(2) A Union Council may, without any notice, remove the encroachment mentioned in\nsubsection (I) with such force as may be necessary.\n(3) Whoever trespasses into, or is in wrongful occupation of, a building or property\nother than those mentioned in subsection (1) which vests in or is managed, maintained or\ncontrolled by a Union Council may, in addition to any penalty to which he may be liable\nunder this Ordinance or any other law for the time being in force, after such notice as may\nbe provided by the Union Council, be ejected from such building or property by the Union\nCouncil with such force as may be necessary.\n(4) Notwithstanding anything contained in any other law for the time being in force,\nno compensation shall be payable for any encroachment removed or ejectment carried out\nunder this section."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Subsisting leases and licences.",
      "content": "(1) If on the expiry of the period of any lease of\nlicence in respect of land or building or any other property of which a Union Council is the\nlessor or licensor, or on the determination or cancellation of such lease or licence or on the\nbreach of any of the terms and conditions of the lease or licence, any lessee or licensee holds\nor continues in possession of the demised land or building or property, or if such land or\nbuilding or property is required for any public purpose, the lessee or licensee, on being\nrequired to hand over vacant possession within the specified time, refuses or fails to vacate\nthat land or building or property, the Union Council or any officer authorised by it in this\nbehalf may, notwithstanding anything contained in any other law, judgment, order or decree\nfor the time being in force or in any contract, at any time, enter upon the licensed or demised\nland or building or property and recover vacant possession of the land or building or other\nproperty by evicting the lessee or licensee and may also demolish and remove the structures,\nif any, erected or built thereon.\n(2) The cost of demolition and removal of structures under subsection (1) shall be\npayable to the Union Council by the lessee or licensee, as the case may be, and if .the cost is\nnot paid on demand, the Union Council may cause the material of the structures demolished\nand removed to be sold in auction, and if the proceeds of the sale are not sufficient to cover\nthe cost, the balance shall be recoverable as arrear of land revenue, but if such proceed:\nexceed the cost, the excess shall be paid to the lessee or the licensee, as the case may be.\nExplanation. __ For the purposes of section (1) and subsection (2), and terms “lessee”\nand “licensee” include the person in whom the ownership of the structures is vested at the\ntime of removal or demolition and also any person in possession thereof on his account or\nwith his permission or connivance.\n(3) Notwithstanding anything contained in any other law for the time being in force or\nin any contract, where the lessee or the licensee of land or building or other property is or has\nbeen a functionary of a Union Council or has been posted in a Union Council, the lease or the\nlicence in respect of such land or building or property shall, in addition to the grounds\nmentioned in section 62 of the Easements Act, 1882 (Y of 1882), stand determined or\nrevoked on the discharge, removal dismissal, resignation, retirement or death of such lessee\nor licensee or on his transfer from the said Union Council.\n(4) On the determination or revocation of a lease or licence in respect of land or\nbuilding or other property, the lessee or the licensee referred to in subsection (3) shall,\nnotwithstanding anything contained in any other law for the time being in force or in any\ncontract, forth with put the Union Council into possession of such land or building or\nproperty, failing which the Union Council or any officer authorised by it in this behalf may\nevict the lessee or licensee and any other person, whether in occupation on behalf of the\nlessee or the licensee or otherwise.\n(5) For the purpose of eviction of lessees or licensees under the provisions of this\nsection, an officer authorised by the Union Council in this behalf may use or cause to be used\nsuch force as may be necessary and, if he requires magisterial or Police assistance in the\nexercise of his powers, he may send requisition to the District Magistrate or the\nofficer-in-charge of a police-station who shall on such requisition render the assistance\nrequired.\n(6) If any sum is payable as rent or fee in respect of any land or building or other\nproperty on the day of recovery of possession of such land or building or property, the same,\nwith interest, if any, accrued thereon, shall be recoverable as arrear of land revenue.\n______"
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Development Plans.",
      "content": "(1) Subject to the development schemes of the Authority,\na Union Council may prepare development plans relating to any matter specified in the First\nSchedule which may among other details of the plans, include the following :-\n(a)    nature and location of the scheme or schemes ;\n(b)    total estimated cost ;\n(c)    sources of finances ;\n(d)    date of commencement ;\n(e)    date of completion ;\n(f )   manner of execution ;\n(g)    agencies responsible for maintenance ;\n(h)    benefits, tangible or intangible to accrue ; and\n(i)    such other matters as may be necessary.\n(2) The development plan of a Union Council shall be sanctioned in its ordinary\nmeeting.\n(3) As far as may be, the schemes included in the development plan shall be included\nin the budget.\n(4) The Federal Government may direct that any specified items of income shall\nwholly or in part be earmarked for and applied in the implementation of a development plan."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Social Welfare projects. A Union Council may sponsor or promote social",
      "content": "welfare through community development projects for its local area or any part thereof and\nmay in this behalf, subject to the approval of the Federal Government, perform such functions\nas may be necessary."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Commercial schemes. A Union Council may, with the previous sanction of the",
      "content": "Federal Government, promote, administer, execute and implement schemes for undertaking\nany commercial or business enterprise.\n_______"
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Constitution of local and special funds.",
      "content": "(1) For every Union Council there\nshall be formed a Local Fund.\n(2) To the credit of the local Fund formed under subsection (1) shall be placed__\n(a)   the balance of such fund as, on the coming into force of this Ordinance, is at the\ndisposal of a Union Council as constituted under the Order of which the Union\nCouncil concerned is declared to be successor under section 5 ;\n(b)   proceeds of all taxes, tolls, fees, rates and other charges levied by the Union\nCouncil under this Ordinance ;\n(c)   all rents and profits payable or accruing to a Union Council from the property\nvested in or managed by it ;\n(d)   all sums received from sale of blood of cattles slaughtered in the Union Council\nslaughter house ;\n(e)   all sums received by the Union Council in the performance of its functions\nunder this Ordinance or under any other law for the time being in force ;\n(f)   all sums contributed by individuals or institutions or other Union Council or\nother local authorities ;\n(g)   all receipts accruing from trusts placed under the management of the Union\nCouncil ;\n(h)   all grants made by the Federal Government or other authorities ;\n(i)    all loans raised and all profits or interest accruing from investment ;\n( j)   all fines imposed under this Ordinance ;\n(k)    all fines awarded to the Union Council under any law ; and\n(1)    such proceeds from such sources of income as the Federal Government may\ndirect to be placed at the disposal of the Union Council."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Custody and investment. The money credited to a local Fund shall be kept or",
      "content": "invested in such manner as may be specified by the Federal Government from time to time."
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Application of the Local Fund. The moneys from time to time credited to the",
      "content": "Local Fund shall be applied in the following order of preference, namely__\n(a)    in the payment of salaries and allowances to the staff of the Union Council ;\n(b)    in the payment of the honoraria and allowances ;\n(c)    in the repayment of loans ;\n(d)    in meeting the expenditure charged in the Local Fund under this Ordinance ;\n(e)     in the fulfilment of any obligation and in the discharge of any duty imposed on\nUnion Council under this Ordinance or under any other law for the time being\nin force ;\n(f)    in meeting the expenditure declared by the Union Council, with the previous\nsanction of the Federal Government, to be an appropriate charge on the local\nFund ; and\n(g)    in meeting the expenditure declared by the Federal Government to be an\nappropriate charge of the Fund."
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. The charged expenditure.",
      "content": "(1) The following expenditure shall be compulsorily\ncharged on the local Fund that is to say__\n(a)    such sums as are required for repayment of loans ;\n(b)    any sum required to satisfy and judgment, decree or award against the Union\nCouncil by any Court of Tribunal ;\n(c)    such sums as may be payable to the Chairman and Vice-Chairman under section\n32 ;\n(d)    such sums at the Union Council may be required by the Federal Government to\ncontribute towards the conduct of elections and the auditing of accounts ; and\n(e)    any expenditure declared by the Federal Government to be so charged.\n(2) If any expenditure is a compulsory charge on the Local Fund and is not paid, the\nFederal Government may, by order, direct the person having the custody of the Local Fund to\npay such amount, or much thereof as may be possible from time to time, from the balance of\nthe Local Fund."
    },
    {
      "provision_ref": "sec57",
      "section": "57",
      "title": "Section 57. Budget.",
      "content": "(1) Every Union Council shall, in the prescribed manner, prepare and\nsanction, before the commencement of each financial year, a statement of its estimated\nreceipts and expenditure for that year and forward a copy thereof to the Federal Government.\n(2) If the budget is not prepared or sanctioned by a Union Council before the\ncommencement of any financial year, the Federal Government may have the necessary\nstatement prepared and certify it, and such certified statement shall be deemed to be the\nsanctioned budget of the Union Council.\n(3) At any time before the expiry of the financial year to which a budget relates, a\nrevised budget for the year may, if necessary, be prepared and sanctioned and such revised\nbudget shall, so far as may be subject to the provisions of this section.\n(4) If an officer at whose disposal funds have been placed by a Union Council\nconsiders it necessary to incur expenditure on a sanctioned item in excess of the amount duly\nsanctioned or provided for in the budget by way of re-appropriation, he shall submit such\nproposal for decision of the Union Council:\nProvided that no expenditure on any item shall be incurred by re-appropriation if it\nwas specially reduced by the Union Council at the time of sanctioning the budget."
    },
    {
      "provision_ref": "sec58",
      "section": "58",
      "title": "Section 58. Accounts.",
      "content": "(1) Accounts of the receipts and expenditure of a Union Council\nshall be kept in the prescribed manner and form.\n(2) An annual statement of the accounts shall be prepared after the close of every\nfinancial year and shall be transmitted to the Federal Government by such date as may be\nspecified.\n(3) A copy of the annual statement of accounts and such other statements as may be\nprescribed shall be displayed at a conspicuous place in the office of the Union Council\nconcerned for public inspection, and all objections or suggestions concerning such accounts\nreceived from the public shall be considered by the Union Council and brought to the notice\nof audit authority referred in section 59."
    },
    {
      "provision_ref": "sec59",
      "section": "59",
      "title": "Section 59. Audit.",
      "content": "(1) The accounts of a Union Council shall be audited periodically in such\nmanner and after such interval and by such authority as may be prescribed.\n(2) The audit authority shall have access to all the books and other documents\npertaining to accounts and may also examine the Chairman, Vice-Chairman or any member\nor servant of the Union Council.\n(3) On the completion of audit, the audit authority shall, in the prescribed manner,\nsubmit to the Federal Government and to the Union Council an audit report which shall,\namong other things, mention__\n(a)   cases of embezzlement, if any ;\n(b)   cases of loss, misappropriation, waste or misapplication of Local Fund ; and\n(c)   cases of other irregularities in the maintenance of accounts.\n(4) The audit report shall be published by every Union Council and displayed at a\nconspicuous place for information of the public.\n(5) The Federal Government may constitute a Union Council’s Accounts Committee\nconsisting of official and non-official members to review audit reports made under this\nsection and to perform such other functions as may be prescribes."
    },
    {
      "provision_ref": "sec60",
      "section": "60",
      "title": "Section 60. Loans",
      "content": "(1) Subject to the provisions of this Ordinance or any other law for the\ntime being m force, a Union Council may, with the previous sanction of the Federal\nGovernment and subject to such conditions as it may consider necessary, raise loans.\n(2) The loans may be raised by the issue of bills or promissory notes or on the security\nof immovable property vested in a Union Council or of all or any of the taxes and dues\nauthorised by this Ordinance:\nProvided that the bills or promissory notes so issued shall be payable within a period\nnot exceeding twenty-four months.\n(3) The loans raised by a Union Council may be spent on the carrying out of any\nworks which it is legally authorised to carry out, or on acquisition of land or the running o f\ncommercial scheme or for payment of a loan raised under this Ordinance or any loan or debt\nfor the repayment of which a Union Council is liable.\n(4) If any .money borrowed in accordance with the provisions of this Ordinance or\nany interest or cost due in respect thereof is or are not repaid according to the conditions of\nthe loans, the Federal Government may attach the funds on the security of which the loan was\nmade, and after such attachment, no person except an officer appointed in this behalf by the\nFederal Government shall in any way deal with the attached funds, but such officer may do\nall acts in respect thereof which the borrowers might have done ;f such attachment had not\ntaken place, and may apply the proceeds in satisfaction of the loan and of all interests and\ncosts due in respect thereof and of all expenses caused by the attachment and subsequent\nproceedings:\nProvided that no such attachment shall defeat or prejudice any debt for which the\nfunds attached were previously pledged in accordance with this Ordinance but all such prior\ncharges shall be paid out of the proceeds or the funds before any part of the proceeds is\napplied to the satisfaction of the liability in respect of which such attachment is made.\n(5) The Federal Government may establish a Union Council’s Development Loan\nFund and may require Union Councils to contribute to such fund and may regulate the\noperation of such Fund by rules."
    },
    {
      "provision_ref": "sec61",
      "section": "61",
      "title": "Section 61. Property of Union Councils",
      "content": "(1) A Union Council may acquire and hold\nproperty, both movable and immovable, whether within or without the limits of the local area\nof the Union Council.\n(2) Subject to any reservation made, or any conditions imposed, by the Federal\nGovernment, all property specified hereunder shall vest in a Union Council, that is to say__\n(a)   all property which vested in any Union Council constituted under the Order of\nwhich the Union Council is the successor ;\n(b)   all property acquired by a Union Council by gift, purchase or otherwise ;\n(c)   all public buildings including Union halls, Union walls and gates, which have\nbeen constructed or are maintained out of the Local Fund ;\n(d)   all lands, open spaces, playgrounds, gardens, parks and other places of public\nresort transferred to a Union Council by the Federal Government or acquired by\na Union Council by gift, purchase or otherwise for a public purpose ;\n(e)   all public streets, bridges and other means of public communication and parking\nmeters as are maintained out of the Local Fund ;\n(f)   all drains, sewers, culverts, and other channels for sullage as are maintained out\nof the Local Fund ;\n(g)   all refuse collected by a Union Council, or deposited at places fixed by a Union\nCouncil and any sullage flowing in any drain, sewer or channel;\n(h)   all works for the disposal of refuse and night-soil including septic tanks, night-\nsoil depots, trenching grounds and incinerators maintained out of the Local Fund\n;\n(i)   all waterworks, water mains and pipes, standposts, hydrants, water troughs and\nhand-pumps maintained out of the Local Fund ;\n(j)   all public lamps, lamp posts and other appliances for street lighting maintained\nout of the Local Fund ;\n(k)   all trees, plants and flowers on road-sides and other places maintained out of the\nLocal Fund ;\n(l)   all the property which may vest in a Union Council under any law or under any\norder passed by the Federal Government.\n(3) A Union Council may__\n(a)   manage, maintain, inspect, develop or improve any property which is owned by\nit or vests in it or is placed under its charge ;\n(b)   apply such property for the purposes of this Ordinance ; and\n(c)   acquire or transfer by grant, gift, sale, mortgage, lease, exchange or otherwise\nany property in the prescribed manner.\n(4) The Federal Government may by rules__\n(a)   provide for the management, maintenance, improvement and development of the\nproperty belonging to or vesting in the Union Councils ;\n(b)   regulate the alienation of such property ; and\n(c)   provide for the compulsory acquisition of such immovable property as may be\nacquired by a Union Council for the purposes of this Ordinance."
    },
    {
      "provision_ref": "sec62",
      "section": "62",
      "title": "Section 62. Surcharge.",
      "content": "(1) Every member, official or servant of a Union Council and every\nperson charged with the administration of its affairs or acting on its behalf shall be\nresponsible for any loss, waste, misappropriation or misapplication of money or property\nbelonging to it which is a direct consequence of his negligence or misconduct and shall be\nliable to pay such surcharge as may be determined by the Rural Areas Co-ordination\nCommittee set up under section 94, and such amount shall be recoverable as an arrear of land\nrevenue.\n(2) Any person aggrieved by the imposition of surcharge under subsection (i may\nprefer an appeal to the Federal Government whose decision shall be final.\n_______"
    },
    {
      "provision_ref": "sec63",
      "section": "63",
      "title": "Section 63. Local rate.",
      "content": "(1) All lands situated within the rural areas, other than those show\nas ‘Gher Mumkin’ or ‘Banjar Kadim’ in the revenue record, shall be subject to the payment\nof a rate to be known as local rate.\n(2) The rate at which the local rate in respect of land holdings shall be levied or\ncharged shall be such as the Federal Government may, by notification in the official Gazette,\nfix from time to time.\n(3) The rate shall be assessed and collected in the prescribed manner and shall be\ncredited to the Fund of the Union Council where the land is situate."
    },
    {
      "provision_ref": "sec64",
      "section": "64",
      "title": "Section 64. Taxes to be levied. A Union Council, subject to the provisions of any other law,",
      "content": "may, and if directed by the Federal Government shall, levy all or any of the taxes, tolls, rates\nand fees enumerated in the Second Schedule."
    },
    {
      "provision_ref": "sec65",
      "section": "65",
      "title": "Section 65. Notification and enforcement of taxes.",
      "content": "(1) All taxes levied by a Union\nCouncil shall be notified and shall, unless otherwise directed by the Federal Government, be\nsubject to previous publication.\n(2) Where a tax is levied or modified, the, Union Council shall specify the date for the\nenforcement thereof and such tax or the modification shall come into force on such date."
    },
    {
      "provision_ref": "sec66",
      "section": "66",
      "title": "Section 66. Directions with regard to levy of tax, etc.",
      "content": "(1) The Federal Government may\ndirect a Union Council__\n(a)   to levy a tax which a Union Council is competent to levy under section 64 ;\n(b)   to increase or reduce any such tax or the assessment thereof to such extent as\nmay be specified ; or\n(c)   to suspend or abolish the levy of any such tax.\n(2) If a direction issued under subsection (1) is not complied within the specified time,\nif any, the Federal Government may make an order giving effect to the direction."
    },
    {
      "provision_ref": "sec67",
      "section": "67",
      "title": "Section 67. Liability on account of taxes.",
      "content": "(1) A Union Council may, by notification, call\nupon any person to furnish such information, produce such record or accounts or to present\nsuch goods or animals liable to any tax as may be necessary for the purpose of determining\nthe liability of such person, goods or animals to a tax.\n(2) Any official of a Union Council authorised in this behalf may, after due notice,\nenter upon any building or premises for the purposes of assessing the liability of such\nbuilding or premises to any tax, or inspecting any goods or animals therein liable to any tax.\n(3) Any official of a Union Council authorised in this behalf may, in the prescribed\nmanner, seize and dispose of goods or animals on which any tax is due and is not paid."
    },
    {
      "provision_ref": "sec68",
      "section": "68",
      "title": "Section 68. Collection and recovery of taxes, etc.",
      "content": "(1) All arrears of taxes, rents and other\nmoneys payable to a Union Council under this Ordinance shall be recoverable as an arrear of\nland revenue.\n(2) Notwithstanding the provisions of sub-section (1), the Federal Government may\nempower any Union Council to recover arrears of taxes and any other moneys payables to the\nUnion Council under this Ordinance by distress and sale of the movable property belonging\nto the person concerned or by attachment and sale of the immovable property belonging to\nhim.\n(3) The Federal Government may, by rules, specify the officials or classes of officials\nby whom the power under sub-section (2) shall be exercised and prescribe the manner in\nwhich it shall be exercised."
    },
    {
      "provision_ref": "sec69",
      "section": "69",
      "title": "Section 69. Deduction of taxes from salaries. If a Union Council levies a tax on professions,",
      "content": "trades or callings, it may require the employer of the person liable to such tax to deduct the\ntax from the salary or wages payable to such person, and on such requisition the amount of\nthe tax due shall be deducted from the salary or wages of the person concerned and credited\nto the Local Fund of the Union Council."
    },
    {
      "provision_ref": "sec70",
      "section": "70",
      "title": "Section 70. Petitions against valuations assessment, etc. No assessment of a tax under this",
      "content": "Ordinance or valuation therefor or the liability of a person to be so taxed shall be called in\nquestion except by a petition presented to such authority, in such manner and within such\nperiod as may be prescribed."
    },
    {
      "provision_ref": "sec71",
      "section": "71",
      "title": "Section 71. Taxation rules.",
      "content": "(1) All taxes and other charges levied by a Union Council shall\nbe imposed, assessed, leased, compounded, administered and regulated in such manner as\nmay be prescribed.\n(2) Rules framed under this section may, among other matters, provide for the\nobligation of the tax-payer and the duties and powers of the officials and other agencies\nresponsible for the assessment and collection of taxes.\n______"
    },
    {
      "provision_ref": "sec72",
      "section": "72",
      "title": "Section 72. Pounds.",
      "content": "(1) There shall be established one or more animal pounds in every\nlocal area as may be considered necessary by the Union Council.\n(2) The Union Council may fix, from time to time, the location of the animal pounds\nand the rates of feeding, watering and accommodating the impounded animals."
    },
    {
      "provision_ref": "sec73",
      "section": "73",
      "title": "Section 73. Pound",
      "content": "keepers. The Union Council may appoint pound-keepers on whole-time or\npart-time basis on such terms and conditions as may be fixed by it."
    },
    {
      "provision_ref": "sec74",
      "section": "74",
      "title": "Section 74. Registers and returns. __ (1) A pound",
      "content": "keeper shall keep such registers and\nfurnish such returns as may be specified from time to time.\n(2) When animals are brought to the pound, the pound-keeper shall enter in the\nregister the number and description of the animals, the day and hour on which they were so\nbrought, the name and residence of the seizurer and of the owner, if known, and shall give the\nseizurer or his agent a copy of such entry."
    },
    {
      "provision_ref": "sec75",
      "section": "75",
      "title": "Section 75. Possession and feeding. The pound",
      "content": "keeper shall take charge of, feed and water,\nthe animals until they are disposed of in the manner hereinafter provided."
    },
    {
      "provision_ref": "sec76",
      "section": "76",
      "title": "Section 76. Power to seize.",
      "content": "(1) A cultivator, tenant or occupier of any land or the vendee or\nmortgagee of any land or crop or produce or any part thereof may seize or cause to be seized\nany animal trespassing on such land and doing damage thereto, or any crop or produce\nthereon, and send them or cause them to be sent within twenty-four hours to a pound\nestablished under this Ordinance.\n(2) Persons incharge of public roads, playgrounds, plantations, canals, drainage\nworks, embankments and other public places and the officers of police may seize or cause to\nbe seized any animals doing damage thereto and shall send them or cause them to be sent,\nwithin twenty-four hours of the seizure, to the nearest pound.\n(3) All officers of the police shall, when required, aid in preventing resistance to such\nseizures and rescues from persons making such seizure."
    },
    {
      "provision_ref": "sec77",
      "section": "77",
      "title": "Section 77. Fines for impounded animals. For every animal impounded as aforesaid, the",
      "content": "pound-keeper shall levy a fine in accordance with the scale fixed by the Union Council and\nthe fines so charged shall form part of and be deposited in the Local Fund."
    },
    {
      "provision_ref": "sec78",
      "section": "78",
      "title": "Section 78. Delivery or sale of animals.",
      "content": "(1) If the owner or his agent appears and claims\nthe animals, the pound-keeper shall -deliver them to him on payment of the fine and charges\nincurred in respect of such animals under proper receipt to be recorded by owner or his agent\nin the register.\n(2) If the animals be not claimed within seven days of impounding, the pound-keeper\nshall inform the officer-in-charge of the police-station who shall thereupon display at a\nconspicuous place in his office a notice stating the number and description of animals and\nplaces of seizure and impounding and a similar notice shall be displayed at a conspicuous\nplace in the office of the Union Council.\n(3) If the animals be not claimed within seven days of the notice, they shall be sold by\nthe Chairman or by his agent by open auction after giving sufficient publicity in the local\narea:\nProvided that the person auctioning the animals or the pound-keeper or his relatives\nshall not bid for or purchase the impounded animals.\n(4) The proceeds of the sale of animals shall be paid to the owner if he later on\nappears, after deducting the fines and feeding and other charges."
    },
    {
      "provision_ref": "sec79",
      "section": "79",
      "title": "Section 79. Illegal seizures. If the owner of an animal appears but considers the seizure to be",
      "content": "illegal, be may, upon the payment of fines and charges incurred in respect of the animal, take\ndelivery of the animal and may, within seven days of taking such delivery, institute\nproceedings in a Court for damages.\n______"
    },
    {
      "provision_ref": "sec80",
      "section": "80",
      "title": "Section 80. Dangerous and offensive articles and trades.",
      "content": "(1) The articles and trades given\nin the Third Schedule shall be deemed to be dangerous or offensive for the purposes of this\nsection.\n(2) Except under, and in conformity with the conditions of, a licence granted by the\nUnion Council__\n(a)    no person shall carry on any dangerous or offensive trade ;\n(b)    no premises shall be used or suffered to be used for any dangerous or offensive\ntrade ; and\n(c)    no person shall store or keep in any premises__\n(i)    any dangerous or offensive article except for domestic use ; or\n(ii)   any dangerous or offensive articles in excess of such limits as may be fixed by\nbye-laws.\n(3) A Union Council may, with the previous sanction of the Federal Government,\nprepare and enforce a scheme providing for the prohibition of dangerous and offensive trades\nin specified areas within its local area and for restriction of such trades in any area not so\nspecified."
    },
    {
      "provision_ref": "sec81",
      "section": "81",
      "title": "Section 81. Composition.",
      "content": "(1) A Panchayat for a village or a group of villages shall be\nconstituted on the basis of consensus in such manner as may be prescribed.\n(2) The number of members of a Panchayat, including its Chairman, shall be as\nfollows namely, __\n(a)    if the population does not exceed 2000…………………..               5\n(b)    if the population exceeds 2000 ………………………….                    7\n(3) The mode of election of the members and Chairman of a Panchayat, their tenure,\nvacation, and removal from office shall be such as may be prescribed."
    },
    {
      "provision_ref": "sec82",
      "section": "82",
      "title": "Section 82. Functions. A Panchayat shall undertake all or any of the following functions,",
      "content": "__\nnamely\n(a)    Management of mosques ;\n(b)    Pursuasion for praying and fasting ;\n(c)    Establishing mosque schools ;\n(d)    Teaching of Quran ;\n(e)    Adult education;\n(f)    Care of orphans and destitutes ;\n(g)    Arrangement for Eid prayers and other religious gatherings;\n(h)   Settlement of minor disputes;\n(i)   Eradication of social evils and prevention of juvenile delinquency;\n(j)   Keeping record of persons residing in the Panchayat area.\n(k)   Social boycott of habitual criminals;\n(l)   Maintaining records of marriages and divorces;\n(m) Dissuading people from lavish spending or marriages .and other ceremonies;\n(n)   Maintenance of ration depots ;\n(o) Management of irrigation watercourses ;\n(p)   Watch and ward of the village ;\n(q)   Maintenance of vital statistics ; and\n(r)   Any other functions entrusted to Panchayats by the Union Councils or the\nFederal Government."
    },
    {
      "provision_ref": "sec83",
      "section": "83",
      "title": "Section 83. Application of certain sections to Panchayats. The Federal Government may,",
      "content": "by notification in the official Gazette, declare that certain sections of this Ordinance\npertaining to Union Councils shall be applicable to Panchayats as they apply to the Union\nCouncils.\n_______"
    },
    {
      "provision_ref": "sec84",
      "section": "84",
      "title": "Section 84. Supervision of Union Councils.",
      "content": "(1) The Federal Government shall exercise\ngeneral supervision and control over the Union Councils in order to ensure that their activities\nconform to the provisions of this Ordinance.\n(2) The Federal Government may call for any paper, document, register or record\nfrom a Union Council to see that its activities are in conformity with the provisions of this\nOrdinance and may wake any order to ensure compliance with the provisions."
    },
    {
      "provision_ref": "sec85",
      "section": "85",
      "title": "Section 85. Inspections of Union Councils.",
      "content": "(1) The working of the Union Councils shall be\ninspected at least once in a financial year by officers to be specified who shall be known as\nInspecting Officers.\n(2) An Inspecting Officer shall have the power__\n(a)    to enter on, inspect and survey, or cause to be entered on, inspected and\nsurveyed, any immovable property occupied by a Union Councils or any\ninstitution maintained by, or any work in progress under the directions of, a\nUnion Council ;\n(b)    to call for and inspect or cause to be inspected files, registers, books or\ndocuments in the possession, or under the control, of a Union Council ;\n(c)    to require the production of such statements, accounts, reports, documents and\ncopies of documents relating to the proceedings of a Union Council as the\nInspecting Officer may think fit ;\n(d)    to attend meetings of a Union Council, but not the power to take part in\ndiscussions and other proceedings or to vote ; and\n(e)    to inquire generally into the affairs of a Union Council."
    },
    {
      "provision_ref": "sec86",
      "section": "86",
      "title": "Section 86. Inspection Reports and action thereon.",
      "content": "(1) The inspection reports shall be\nprepared on such form as may be specified and shall be forwarded to the Union Council\nconcerned within thirty days of the completion of inspection.\n(2) An inspection report forwarded to a Union Council, it shall be placed before the\nnext meeting of the Union Council for its information and compliance.\n(3) Within thirty days of the meeting under sub-section (2), the Union Council shall\nannotate the inspection report and forward it to the Inspecting Officer who may issue such\nfurther directions and advice to the Union Council as may be necessary.\n(4) If there is any dispute or difference of opinion between the Inspecting Officer and\nthe Union Council, it shall be referred to the Federal Government whose decision shall be\nfinal."
    },
    {
      "provision_ref": "sec87",
      "section": "87",
      "title": "Section 87. Safeguards. If, in the opinion of the Federal Government, anything done or",
      "content": "intended to be done by or on behalf of a Union Council is not in conformity with any\nprovision of this Ordinance, it may, for reasons to be recorded-\n(a)    quash the proceedings relating thereto ;\n(b)    suspend the execution of any resolution passed or order made by the Union\nCouncil ; and\n(c)    prohibit the doing of anything proposed to be done."
    },
    {
      "provision_ref": "sec88",
      "section": "88",
      "title": "Section 88. Powers to give directions.",
      "content": "(1) The Federal Government may direct a Union\nCouncil or its Chairman to take within such period as may be specified in the direction such\naction as may be necessary for carrying out the purposes of this Ordinance.\n(2) Where, after due enquiry, the Federal Government is satisfied that a Union\nCouncil has failed to comply with any direction given under sub-section (1), it may appoint a\nperson or persons to give effect to such directions and may further direct that the expenses\nincurred in connection therewith shall be borne by the Union Council.\n(3) If the Union Council fails to pay the expenses referred to in sub-section (2), the\nFederal Government may make an order directing the person having the custody of the\nbalance of the Local Fund of the Union Council to pay the expenses, or so much thereof as\nmay, from time to time, be possible."
    },
    {
      "provision_ref": "sec89",
      "section": "89",
      "title": "Section 89. Inquiries.",
      "content": "(1) The Federal Government may, whether suo motu or on an\napplication made to it by any person, cause an enquiry to be made by such person as may be\nauthorised by it in this behalf into the affairs of a Union Council either generally or with\nreference to any particular matter and take such remedial measures as may be warranted by\nthe findings of such inquiry.\n(2) Such person shall, for the purposes of the inquiry, have the powers of a Court\nunder the Code of Civil Procedure, 1908 (Act V of 1908), to take evidence and to compel the\nattendance of witnesses and the production of documents.\n(3) The Federal Government may make an order as to the cost of the inquiry and the\nparties by whom it shall be paid.\n(4) Any amount payable under sub-section (3) by any person not being a Union\nCouncil shall be recoverable as an arrear of land revenue."
    },
    {
      "provision_ref": "sec90",
      "section": "90",
      "title": "Section 90. Suspension of a particular department or institution.",
      "content": "(1) If after such\nenquiry as may, be necessary, the Federal Government is of the opinion that a Union Council\nis not able to run a particular department or institution efficiently, it may, by notification in\nthe official Gazette, suspend the authority of the Union Council over such department or\ninstitution for such period as may be specified.\n(2) Where the authority of a Union Council over any department or institution is\nsuspended under sub-section (1), the Federal Government may itself take over the\nmanagement of such department or institution or make such other arrangements for its\nmanagement as it thinks fit, and may require the Union Council to place such amount as may\nbe necessary for the management of such department or institution at its disposal and, in case\nthe Council fails to comply with the requisition, it may direct the treasury, bank or person\nholding the funds of the Union Council to place the said amount at its disposal, and the\nbudget of the Union Council shall be deemed to have been revised to that extent."
    },
    {
      "provision_ref": "sec91",
      "section": "91",
      "title": "Section 91. Suspension and dissolution.",
      "content": "(1) The Federal Government may, by notification\nin the official Gazette, suspend a Union Council if there are reasons to believe that the Union\nCouncil__\n(a)   is unable to discharge or persistently fails to discharge its duties ; or\n(b)   is unable to administer its affairs or meet its financial obligations ; or\n(c)   generally acts in a manner contrary to public interest ; or\n(d)   otherwise exceeds or abuses its powers.\n(2) On the publication of a notification under sub-section (1) __\n(a)   the persons holding offices as Chairman, Vice-Chairman and members of the\nUnion Council shall cease to hold offices;\n(b)   all functions of the Union Council shall, during the period of suspension, be\nperformed by such person or authority as the Federal Government may appoint\nin this behalf ; and\n(c)   all funds and property belonging to the Union Council shall, during the period of\nsuspension, vest in the Federal Government.\n(3) The Federal Government shall hold or cause to be held an inquiry into the grounds\non which a Union Council is suspended under sub-section (1) and if, within a period of two\nmonths from the date of the suspension of the Union Council, the inquiry is not completed,\nthe Union Council shall stand revived.\n(4) If, as a result of the inquiry, the charges against the Union Council are proved, the\nFederal Government may dissolve the Union Council.\n(5) When a Union Council is dissolved__\n(a)   the Federal Government shall order fresh elections if the remaining term of the\nUnion Council is not less than nine months and the term of office of the Union\nCouncil so reconstituted shall be the residue of the original term, and\n(b)   if the remaining term is less than nine months, the person or authority referred to\nin sub-section (2) shall continue to perform the functions of the Union Council\nand its funds shall continue to vest in the Federal Government till the\nreconstituted Union Council assumes office."
    },
    {
      "provision_ref": "sec92",
      "section": "92",
      "title": "Section 92. Reporting and evaluation. A Union Council shall",
      "content": "(a)   maintain such record of its working as may be required by the Federal\nGovernment;\n(b)   prepare and publish such periodical reports and returns as may be required by\nthe Federal Government ; and\n(c)    adopt such other measures as may be necessary or may be specified by the\nFederal Government from time to time for the publication of information about\nthe working of the Union Councils."
    },
    {
      "provision_ref": "sec93",
      "section": "93",
      "title": "Section 93. Bar of suits. No suit or other legal proceedings shall lie against the Federal",
      "content": "Government or any person or authority for any loss or damage of any kind caused by the\nsuspension or dissolution of any Union Council.\n_______"
    },
    {
      "provision_ref": "sec94",
      "section": "94",
      "title": "Section 94. Co",
      "content": "ordination Committee. __ (1) The Federal Government may set up a\nCo-ordination Committee for the rural areas to be called the Rural Areas Co-ordination\nCommittee, hereafter in this Chapter referred to as the Committee.\n(2) The Committee shall consist of__\n(a)    all Chairmen of the Union Councils ; and\n(b)    such number of official members as the Federal Government may nominate.\n(3) The non-official members of the Committee shall elect from among themselves a\nChairman for a period of one year and, if for any reason the Chairman of the Committee is\nunable to attend a meeting of the Committee, the non-official members present shall elect a\nChairman to preside at such meeting."
    },
    {
      "provision_ref": "sec95",
      "section": "95",
      "title": "Section 95. Functions. The Committee may, among others, perform the following functions,",
      "content": "namely__\n(i)    co-ordination of activities of all Union Councils and of all Government and\nsemi-Government departments or institutions in the rural areas ;\n(ii)   settlement of Disputes among the Union Councils ;\n(iii) co-ordination in matters like planning and implementation of local development\nschemes and the provisions of public services ;\n(iv) levy of surcharge under section 62 ; and\n(v)    such other functions as the Federal Government may entrust to it from time to\ntime."
    },
    {
      "provision_ref": "sec97",
      "section": "97",
      "title": "Section 97. Punishments",
      "content": "(1) Whoever commits any of the offences mentioned in Part I of\nthe Fourth Schedule shall be punishable with imprisonment for a term which may extend to\nsix months, or with fine which may extend to one thousand rupees, or with both, and if the\noffence is a continuing one, with an additional fine which may extend to one hundred rupees\nfor every day after the first during which the offence continues.\n(2) Whoever commits any of the offences mentioned in Part II of the Court Schedule\nshall be punishable with fine which may extend to five hundred rupees, and, if the offence is\na continuing one, with an additional fine which may extend to fifty rupees for every day after\nthe first during which the offence continues.\n(3) The fine imposed under subsection (1) or sub-section (2) shall be credited to the\nLocal Fund of the Union Council within whose jurisdiction the offence has been committed."
    },
    {
      "provision_ref": "sec98",
      "section": "98",
      "title": "Section 98. Compounding of offences",
      "content": "(1) The Chairman or any person generally or\nspecially authorized by a Union Council in this behalf may, at any time after the commission\nof an offence and before the conclusion of proceedings in the Court, compound any offence\nunder this Ordinance.\n(2) Where an offence has been compounded under sub-section (1), the offender, if in\ncustody, shall be discharged and no further proceedings shall be taken against him in respect\nof the offence so compounded."
    },
    {
      "provision_ref": "sec99",
      "section": "99",
      "title": "Section 99. Cognizance of offences. No Court shall take cognizance of any offence under this",
      "content": "Ordinance except on a complaint in writing made by the Chairman or a person generally or\nspecially authorized by the Union Council in this behalf."
    },
    {
      "provision_ref": "sec100",
      "section": "100",
      "title": "Section 100. Summary disposal of cases",
      "content": "(1) A Court taking cognizance of any offence\npunishable under this Ordinance, other than an offence mentioned in Part I of the Fourth\nSchedule, may state upon the summons to be served on the accused person that he may__\n(a)   appear through pleader and not in person ; or\n(b)   by a specified date, prior to the hearing of the charge, plead guilty by registered\nletter and remit to the court such amount, not exceeding one hundred rupees, as\nthe court may specify.\n(2) Where the accused person pleads guilty and remits the sum specified, no further\nproceedings in respect of the offence shall be taken against him.\n_______"
    },
    {
      "provision_ref": "sec101",
      "section": "101",
      "title": "Section 101. Appeals.",
      "content": "(1) Any person aggrieved by an order passed by a Union Council or\nits Chairman in pursuance of this Ordinance or the rules or byelaws may appeal to such\nauthority, in such manner and within such period as may be prescribed.\n1\n[(1A) An order in appeal shall not be passed without affording to the appellant an\nopportunity of being heard.]\n(2) Any order passed in appeal shall be final."
    },
    {
      "provision_ref": "sec103",
      "section": "103",
      "title": "Section 103. Bye",
      "content": "laws.__(1) A Union Council may, and if required by the Federal\nGovernment shall, make bye-laws not inconsistent with this Ordinance and the rules to carry\nout the purposes of this Ordinance.\n(2) Any regulations and bye-laws made by any Local Council under the Order, if not\ninconsistent with this Ordinance or the rules, shall be deemed to be bye-laws made under this\nOrdinance."
    },
    {
      "provision_ref": "sec104",
      "section": "104",
      "title": "Section 104. General provisions relating to rules, etc. __ (1) All bye",
      "content": "laws shall be made\nsubject to the condition of previous publication.\n(2) All rules and bye-laws shall be notified.\n(3) Copies of rules and of bye-laws pertaining to a Union Council shall be kept\navailable at the office of the Union Council for inspection and sale."
    },
    {
      "provision_ref": "sec105",
      "section": "105",
      "title": "Section 105. Delegation of powers.",
      "content": "(1) The Federal Government may, by notification in the\nofficial Gazette, delegate any of its powers under this Ordinance or the rules to any officer\nsubordinate to it or to a Union Council:\nProvided that an order passed by an officer to whom, or the Union Council to which,\npowers have been delegated under this subsection may be set aside or modified by the\nFederal Government if it is not in conformity with the provisions of this Ordinance or the\nrules or is against public interest.\n1Ins. by the Capital Territory Government (Amdt.) Act, 1988 (4 of 1988), s. 2.\n2For such rules, see the following notifications : __\n(i)         S.R.O. 758(I)/79,dated 28-8-79, Gaz. of P., 1979, Extra, Pt. II, pp 1316-55.\n(ii)        S.R.O. 821(I)/79,dated 15-2-79, Gaz. of P., 1979, Extra, Pt. II, pp 1467-70.\n(iii)       S.R.O. 822(I)/79,dated 15-2-79, Gaz. of P., 1979, Extra, Pt. II, pp 1470-71.\n(iv)        S.R.O. 959(I)/79,dated 18-10-79, Gaz. of P., 1979, Extra, Pt. II, pp 1735-38.\n(2) A Union Council may, with the previous sanction of the Federal Government,\ndelegate any of its powers under this Ordinance or the rules or bye-laws to its Chairman or\nsub-committee or any of its officers or members.\n(3) A Chairman may, with the previous sanction of the Union Council concerned,\ndelegate all or any of his powers under this Ordinance or the rules or bye-laws, not being\npowers delegated to him under subsection (2), to any member of the Union Council or any its\nofficers."
    },
    {
      "provision_ref": "sec106",
      "section": "106",
      "title": "Section 106. Transfer of institutions or service. Notwithstanding anything contained in this",
      "content": "Ordinance or in any other law for the time being in force, the Federal Government may from\ntime to time direct that subject to such terms and conditions as may be specified in the\ndirection__\n(a)   any institution or service maintained by a Union Council shall be transferred to\nthe management and control of the Federal Government ; or\n(b)   any institution or service maintained by the Federal Government shall be\ntransferred to the management and control of a Union Council:\nProvided that no direction regarding the transfer of any institution or\nservice from a Union Council to the Federal Government or vice versa shall be\ngiven without the consent of the Union Council concerned."
    },
    {
      "provision_ref": "sec107",
      "section": "107",
      "title": "Section 107. Licences and sanctions",
      "content": "(1) Wherever it is provided in this Ordinance or the\nrules or bye-laws that the permission or sanction of a Union Council shall be necessary to the\ndoing of any act such permission or sanction shall be in writing.\n(2) Every licence sanctioned or permission granted by or under the authority of a Union\nCouncil shall be signed by the Chairman or by such Official’s of the Union Council as may\nbe authorised in this behalf by the Union Council."
    },
    {
      "provision_ref": "sec108",
      "section": "108",
      "title": "Section 108. Institution of suits against Union Council, etc.",
      "content": "(1) A suit maybe instituted\nagainst a Union Council or against any member, official or servant of a Union Council in\nrespect of any act done or purported to have been done in his official capacity after the\nexpiration of one month next after a notice in writing has been, in the case of a Union\nCouncil, delivered or left at its office, and in the case of a member, official or servant,\ndelivered to him or left at his office or residence, stating the cause of action, the name,\ndescription of place of residence of the intending plaintiff and the relief which he claims and\nthe plaint shall contain a statement that such notice has been so delivered or left.\n(2) Where any such suit is instituted without delivering or leaving such notice as\naforesaid or before the expiration of the said period of one month or, where the plaint does\nnot contain a statement that such notice has been so delivered or left, or if settlement as\nregards the subject-matter of the suit is reached or the Union Council or the member or\nofficial or servant, as the case may be, concedes the plaintiff’s claim within the period of one\nmonth from the date of institution of the suit, the plaintiff shall not be entitled to any cost:\nProvided that, in a suit instituted without such notice, the Court shall allow not less\nthan one month to the defendant to submit a written statement."
    },
    {
      "provision_ref": "sec109",
      "section": "109",
      "title": "Section 109. Notice and service thereof",
      "content": "(1) Where anything is required to be done or not to\nbe done by any person under this Ordinance or the rules or bye-laws, a notice shall be served\non the person concerned specifying the time within which the requirements shall be complied\nwith.\n(2) No notice shall be invalid for defect of form.\n(3) Every notice shall, unless otherwise provided, be served or presented by giving or\ntendering the notice or sending it by post to the person for whom it is intended or by affixing\nit on some conspicuous part of his residence or place of business.\n(4) A notice intended for the public in general shall be deemed to have been\nsufficiently served if a copy thereof is affixed in such public place as may be determined by\nthe Union Council."
    },
    {
      "provision_ref": "sec110",
      "section": "110",
      "title": "Section 110. Records to be public documents. All records prepared or registers maintained",
      "content": "under this Ordinance shall be deemed to be public documents within the meaning of the\nEvidence Act, 1872 (I of 1872)."
    },
    {
      "provision_ref": "sec111",
      "section": "111",
      "title": "Section 111. Members and servants of Union Councils to be public servants. Every",
      "content": "member and every servant of a Union Council and every other person duly empowered to act\non behalf of a Union Council shall be deemed to be a public servant within the meaning of\nsection 21 of the Pakistan Penal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec112",
      "section": "112",
      "title": "Section 112. Bar against employment. A Chairman or a member of a Union Council shall not be",
      "content": "employed under that Union Council for a period of one year from the date on which he ceases to be a\nChairman or member, as the case may be."
    },
    {
      "provision_ref": "sec113",
      "section": "113",
      "title": "Section 113. Protection of action taken in good faith. No suit, prosecution or other legal proceeding",
      "content": "shall lie against the Federal Government or any Union Council or against any person authorised by\neither of them for anything in good faith done or intended to be done under this Ordinance or for any\ndamage caused or likely to be caused by any such action."
    },
    {
      "provision_ref": "sec114",
      "section": "114",
      "title": "Section 114. Bar of Jurisdiction. No civil Court shall have jurisdiction to entertain, hear or",
      "content": "adjudicate upon any suit, appeal or other proceedings, grant any injunction, issue any process or make\nany order in relation to anything done or intended to be done by a Union Council or any\nauthority or officer authorised by it, under the provisions of sections 48, 49, 68 and 80.\n_______"
    },
    {
      "provision_ref": "sec115",
      "section": "115",
      "title": "Section 115. Interim authorities. In any area within the jurisdiction of a Union Council",
      "content": "constituted under the Order in which the provisions of this Ordinance are brought into force\nbut a Union Council is not constituted under this Ordinance or has been dissolved, then,\nnotwithstanding anything contained in this Ordinance, the Federal Government may, by\norder, empower a person or persons to perform all or any of the functions of such Union\nCouncil as had jurisdiction therein immediately before such enforcement or dissolution, as\nspecified in the Order, until a Union Council under this Ordinance for the area assumes office\nin accordance with the provisions of this Ordinance."
    },
    {
      "provision_ref": "sec116",
      "section": "116",
      "title": "Section 116. Interim maintenance of institutions. Where, on the enforcement of this",
      "content": "Ordinance in any local area, any service undertaken or institution maintained by the Federal\nGovernment is required under any of the provisions of this Ordinance to be undertaken or\nmaintained by a Union Council, such service or institution shall, notwithstanding anything\ncontained in this Ordinance, continue to be undertaken or maintained by the Federal\nGovernment until the management thereof is duly transferred to the Union Council."
    },
    {
      "provision_ref": "sec117",
      "section": "117",
      "title": "Section 117. Interim budgets. Where a Union Council assumes office under this Ordinance",
      "content": "for the first time, its budget for the financial year during which it assumes office shall relate\nto the remaining period of that year and the provisions, regarding budget under this\nOrdinance shall mutatis mutandis apply to such budget.\n(Section 47)\nGeneral"
    }
  ],
  "definitions": [
    {
      "term": "animal",
      "definition": "cows, buffaloes, bulls, ox-.n, bullocks, heifers, calves, camels, sheep and goats ;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "the Capital Development Authority constituted under section 4 of the Capital Development Authority Ordinance, 1960 (XXIII of 1960) ;",
      "source_provision": "sec2"
    },
    {
      "term": "bey-laws",
      "definition": "bye-laws made under this Ordinance,;",
      "source_provision": "sec2"
    },
    {
      "term": "Capital Territory",
      "definition": "the Islamabad Capital Territory referred to in paragraph (b) of clause (1) of Article 1 of the Constitution ;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "Chairman of a Union Council ;",
      "source_provision": "sec2"
    },
    {
      "term": "Election Authority",
      "definition": "an authority constituted or officer appointed as Election Authority under section 17 ;",
      "source_provision": "sec2"
    },
    {
      "term": "elected member",
      "definition": "a member elected to a Union Council ;",
      "source_provision": "sec2"
    },
    {
      "term": "electoral roll",
      "definition": "the electoral roll prep-red under section 4 of the Electoral Rolls Act, 1974 (XXI of 1974) ;",
      "source_provision": "sec2"
    },
    {
      "term": "local area",
      "definition": "an area the limits of which have been declared under section 8;",
      "source_provision": "sec2"
    },
    {
      "term": "Local Fund",
      "definition": "the fund of a Union Council ;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of a Union Council ;",
      "source_provision": "sec2"
    },
    {
      "term": "official",
      "definition": "a person who is in receipt of salary from the revenues of the Federation or of a Province or out of the fund of a local authority;",
      "source_provision": "sec2"
    },
    {
      "term": "Order",
      "definition": "the Basic Democracies Order, 1959 (P. O. No. 18 of 1959) ;",
      "source_provision": "sec2"
    },
    {
      "term": "Panchayat",
      "definition": "a Village Panchayat constituted under section 81 ; 1 [(nn) “peasant” means a person who is owner of not more than five acres of agricultural and engages himself personally in the cultivation land;]",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rule ;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Ordinance ;",
      "source_provision": "sec2"
    },
    {
      "term": "rural area",
      "definition": "any area of the Capital Territory which the Federal Government may, by notification in the official Gazette, declare to be rural area for the purposes of this Ordinance ;",
      "source_provision": "sec2"
    },
    {
      "term": "specified",
      "definition": "specified by standing orders of the Federal Government ;",
      "source_provision": "sec2"
    },
    {
      "term": "tax",
      "definition": "any cess, fee, rate, toll or other impost leviable under this Ordinance ;",
      "source_provision": "sec2"
    },
    {
      "term": "Union Council",
      "definition": "a Union Council constituted under this Ordinance ;",
      "source_provision": "sec2"
    },
    {
      "term": "Vice-Chairman",
      "definition": "a Vice-Chairman of a Union Council ;",
      "source_provision": "sec2"
    },
    {
      "term": "village,",
      "definition": "the area comprising a revenue estate ; 1Cl. (nn) ins. by the Capital Territory Local Government (Second Amdt.) Ordinance, 1979 (69 of 1979), s. 2 (w.e.f 18 -8-79).",
      "source_provision": "sec2"
    },
    {
      "term": "voter",
      "definition": "a person whose name for the time being appears on the electoral roll of the local area [; and]1 2 [(x) “worker” has the same meaning as in the Industrial Relations Ordinance, 1969, and includes a self employed craftsman like blacksmith, carpenter, tailor and shoemaker]. (2) The words and expressions ‘complaint’, ‘cognizable offence’, ‘officer-- in-charge of a police-station’ and ‘police-station’ shall have the same meaning as are respectively assigned to them in section 4 of the Code of Criminal Procedure, 1898 (Act V of 1898), and the words ‘decree’ and ‘movable property’ shall have the same meaning as are respectively assigned to them in section 2 of the Code of Civil Procedure, 1908 (Act V of 1908).",
      "source_provision": "sec2"
    }
  ]
}
