{
  "id": "pk-carriage-of-goods-by-sea-act-1925",
  "type": "statute",
  "title": "Carriage of Goods by Sea Act, 1925",
  "title_en": "Carriage of Goods by Sea Act, 1925",
  "short_name": "COGBS",
  "status": "in_force",
  "issued_date": "1925-09-20",
  "in_force_date": "1925-09-20",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap6Y-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Carriage of Goods by Sea Act, 1925 (XXVI of 1925) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent",
      "content": "_(1) This Act may be called the 2[*] Carriage of Goods by Sea\nAct, 1925.\n1\n[(2) It extends to the whole of Pakistan.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Application of Rules",
      "content": "_Subject to the provisions of this Act, the rules set out in the\nschedule (hereinafter referred to as “the Rules”) shall have effect in relation to and in connection\nwith the carriage of goods by sea in ships carrying goods from any port in 1[Pakistan] to any other\nport whether in or outside 1[Pakistan]."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Absolute warranty of sea worthiness not to be implied in contracts to which Rules",
      "content": "___\napply. There shall not be implied in any contract for the carriage of goods by sea to which the\nRules apply any absolute undertaking by the carrier of the goods to provide a seaworthy ship."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Statement as to application of Rules to be included in bills of lading.",
      "content": "_Every bill of\nlading, or similar document of title, issued in 1[Pakistan] which contains or is evidence of any\ncontract to which the Rules apply, shall contain an express statement that it is to have effect subject\nto the provisions of the said Rules as applied by this Act.\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (Ordinance No. XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955).\n2\nOmitted by the Adaptation of Central Acts and Ordinances Order, 1949 (Order No. 4 of 1949), Art. 3 and Sch."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Modification of Article VI of Rules in relation to goods carried in sailing ships and by",
      "content": "prescribed routes.___Article VI of the Rules shall, in relation to ___\n(a)        the carriage of goods by sea in sailing ships carrying goods from any port in\n1\n[Pakistan] to any other port whether in or out side 1[Pakistan], and\n(b)        the carriage of goods by sea in ships carrying goods from a port in 1[Pakistan]\nnotified in this behalf in the 2[official gazette] by the 3[Federal Government] to\na port 4[in] 5[India or Ceylon] specified in the said notification,\nhave effect as though the said Article referred to goods of any class instead of to particular goods and\nas though the proviso to the second paragraph of the said Article were omitted."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Modification of Rules 4 and 5 of Article III in relation to bulk cargoes",
      "content": "_Where under\nthe custom of any trade the weight of any bulk cargo inserted in the bill of lading is a weight\nascertained or accepted by a third party other than the carrier or the shipper and the fact that the\nweight is so ascertained or accepted is stated in the bill of lading, then, notwithstanding anything in\nthe Rules, the bill of lading shall not be deemed to be prima facie evidence against the carrier of the\nreceipt of goods of the weight so inserted in the bill of lading, and the accuracy thereof at the time of\nshipment shall not be deemed to have been guaranteed by the shipper."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Saving and operation",
      "content": "_ (1) Nothing in this Act shall affect the operation of sections four\nhundred and forty six to four hundred and fifty, both inclusive, five hundred and two, and five\nhundred and three of the Merchant Shipping Act, 1894 (57 & 58 Vict, c. 60.), as amended by any\nsubsequent enactment, or the operation of any other enactment for the time being in force limiting\nthe liability of the owners of sea-going vessels.\n(2) The Rules shall not by virtue of this Act apply to any contract for the carriage of goods by\nsea, before such day, not being earlier than the first day of January, 1926, as the 3[Federal\nGovernment] may, by notification in the 2[official Gazette], appoint, nor to any bill of lading or\nsimilar document of title issued, whether before or after such day as aforesaid, in pursuance of any\nsuch contract as aforesaid.\n________\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (Ordinance No. XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955).\n2\nSubs. by Adaptation Order, 1937.\n3\nSubs. by the Federal Adaptation of laws Order, 1975 (P. O. No. 4 of 1975), Art. 2and Table.\n4\nIns. by Adaptation Order, 1961, Art. 2 and Sch. (with effect from the 23rd march, 1956).\n5\nSubs. by the Adaptation of Central Acts and Ordinances Order, 1949 (Order No. 4 of 1949).\nDefinitions\nIn these Rules the following expressions have the meanings hereby assigned to them\nrespectively, that is to say___\n(a)     “Carrier” includes the owner or the charterer who enters into a contract of\ncarriage with a shipper :\n(b)     “Contract of carriage” applies only to contracts of carriage covered by a bill of\nlading or any similar document of title, in so far as such document relates to\nthe carriage of goods by sea including any bill of lading or any similar\ndocument as aforesaid issued under or pursuant to a charter party from the\nmoment at which such bill of lading or similar document of title regulates the\nrelation between a carrier and a holder of the same :\n(c)     “Goods” includes goods, wares, merchandises, and articles of every kind\nwhatsoever, except live animals and cargo which by the contract of carriage is\nstated as being carried on deck and is so carried:\n(d)     “Ship” means any vessel used for the carriage of goods by sea :\n(e)     “Carriage of goods” covers the period from the time when the goods are\nloaded on to the time when they are discharged from the ship.\nRisks\nSubject to the provisions of Article VI, under every contract of carriage of goods by sea the\ncarrier, in relation to the loading, handling, stowage, carriage, custody, care, and discharge of such\ngoods, shall be subject to the responsibilities and liabilities, and entitled to the rights and immunities\nhereinafter set forth.\nResponsibilities and Liabilities"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Any clause, covenant or agreement in a contract of carriage relieving the carrier or the ship",
      "content": "from liability for loss or damage to or in connection with goods arising from negligence, fault or\nfailure in the duties and obligations provided in this Article or lessening such liability otherwise than\nas provided in these Rules, shall be null and void and of no effect.\nA benefit of insurance or similar clause shall be deemed to be a clause relieving the carrier\nfrom liability.\nRights and Immunities"
    }
  ],
  "definitions": []
}
