{
  "id": "pk-cattle-trespass-act-1871",
  "type": "statute",
  "title": "Cattle-trespass Act, 1871",
  "title_en": "Cattle-trespass Act, 1871",
  "short_name": "Cattle-trespass Act, 1871",
  "status": "in_force",
  "issued_date": "1871-01-12",
  "in_force_date": "1871-01-12",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-a5g%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Cattle-trespass Act, 1871 (I of 1871) published by The Pakistan Code (Criminal Laws).",
  "provisions": [
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Interpretation",
      "content": "clause: In this Act,—\n\"officer of police\" includes also village-watchmen, and\" cattle\" includes also elephants,\ncamels, buffaloes, horses, mares, geldings, ponies, colts, fillies, mules, asses, pigs, rams, ewes,\nsheep, lambs, goats, and kids, 8[and 9\"local authority\" means anybody of persons for the time being\ninvested by law with the control and administration of any matters within a specified local area, and\n\"local fund\" means any fund under the control or management of a local authority.]\n4.Establishment of pounds: Pounds shall be established at such places as the Magistrate of\nthe District, subject to the general control of the 6[Provincial Government], from time to time directs.\nThe village by which every pound is to be used shall be determined by the Magistrate of the District.\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1870, Pt. V. P. 310, for Proceedings in Council, see ibid., Supplement, pp. 1150, 1200,"
    },
    {
      "provision_ref": "sec1290",
      "section": "1290",
      "title": "Section 1290. and Supplement, 1871, P. 178",
      "content": "It has been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.W.F.P., subject to certain modifica-\ntions; and extended to the Excluded Area of Upper Tanawal (N.W.F.P.) other than Phulera with effect from such date and subject to such\nmodifications as may be notified-see N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950.\nIt has also been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950) ; and applied in the\nFederated Areas of Baluchistan, see Gazette of India, 1937, Pt. I, P. 1499.\n2\nSubs. by the Cattle-trespass Act (1871) Amendment Act, 1891 (1 of 1891),s. I, for original s. 1.\n3\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for\" all the\nProvinces and the Capital of the Federation\" which was subs. for \" the whole of British India\" by A. 0., 1949, Arts. 3(2) and 4.\n4\nThis Act has been declared in force in Baluchistan by the British Baluchistan Laws Regulation, 1913 (2 of 1913), s. 3.\n5\nThe words\" the presidency-towns and\" omitted by A. 0., 1949, Sch.\n6\nsubs. by A.O., 1937, for \"L.G.\".\n7\nSub-scction (3) of s. 1 rep. by the Repealing and Amending Act, 1914 (10 of 1914), s. 3 and 2nd Sch.\n8\nIns. by Act 1 of 1891, s. 2.\n9\nCf. definition in section 3 (28) of the General Clauses Act, 1897 (10 of 1897), which read with s. 4 (2) of that Act applies, to all Acts passed after the\n14th January, 1887.\n5.Control of pounds. Rates of charge for feeding impounded cattle: The pounds shall be\nunder the control of the Magistrate of the District; and he shall fix, and may from time to time alter,\nthe rates of charge for feeding and watering impounded cattle."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Appointment of Pound keepers 1[The 2Provincial Government shall appoint a pound",
      "content": "keeper for every pound.\nPound-keepers may hold other offices: Any pound-keeper may hold simultaneously any\nother office under the 3[Government].\nPound-keepers to be public servants: Every pound-keeper shall be deemed to be a public\nservant within the meaning of the Pakistan Penal Code (XLV of 1860).]"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. To keep registers and furnish returns. Every pound",
      "content": "keeper shall keep such registers and\nfurnish such returns as the 4[Provincial Government] from time to time directs."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. To register seizures. When cattle are brought to a pound, the pound",
      "content": "keeper shall enter in\nhis register,—\n(a)        the number and description of the animals,\n(b)        the day and hour on and at which they were so brought,\n(c)        the name and residence of the seizer, and\n(d)        the name and residence of the owner, if known, and shall give the seizer or his\nagent a copy of the entry."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. To take charge of and feed cattle. The pound",
      "content": "keeper shall take charge of, feed and water\nthe cattle until they are disposed of as hereinafter directed."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Cattle damaging land. The cultivator or occupier of any land,",
      "content": "or any person who has advance cash for the cultivation of the crop or produce on any land,\nor the vendee or mortgagee of such crop or produce or any part thereof,\nmay seize or cause to be seized any cattle trespassing on such land. and doing damage thereto or to\nany crop or produce thereon, and 5[send them or cause them to be sent within twenty-four hours] to\nthe pound established for the village in which the land is situate.\nPolice to aid seizures: All officers of police shall, when required, aid in preventing (a)\nresistance to such seizures, and (b) rescues from persons making such seizures.\n1\nSubs. by the Suppl. A.O., 1937, for the original section 6.\n2\nThis expression includes also such person as the Provincial Government may direct under s. 241 (1) (b) of the G. of I Act, 1935, see, the General\nClauses ,Act, 1897, s. 4A (2).\n3\nSubs. by A.O., 1961, Art. 2, for \"Crown\" (with effect from the 23rd March. 1956).\n4\nSubs. by A. O. 1937, for \"L.G.\".\n5\nSubs. by the Cattle-trespass Act (1871) Amendment Act. 1891 (1 of 1891) s. 3. for \"take them or cause them to be taken without unnecessary delay\".\n1\n11 Cattle damaging public roads, canals and embankments. Persons in charge of public\nroads, pleasure-grounds, plantations, canals, drainage-works, embankments and the like and officers\nof police, may seize or cause to be seized any cattle doing damage to such roads, grounds,\nplantations, canals, drainage-works, embankments and the like, or the sides or slopes of such roads,\ncanals, drainage-works or embankments or found straying thereon, and shall 2[send them or cause\nthem to be sent within twenty-four hours] to the nearest pound.\n3\n[12 . Fines for cattle impounded: For every head of cattle impounded as aforesaid, the\npound-keepers shall levy a fine in accordance with the scale for the time being prescribed by the\n4\n[Provincial Government] in this behalf by notification in the official Gazette. Different scales may\nbe prescribed for different local areas.\nAll fines so levied shall be sent to the Magistrate of the District through such officer as the\n4\n[Provincial Government] may direct.\nList of fines and charges for feeding. A list of the fines and of the rates of charge for\nfeeding and watering cattle shall be posted in a conspicuous place on or near to every pound.]"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Procedure when owner claims the cattle and pays fines and charges. If the owner of",
      "content": "the impounded cattle or his agent appear and claim the cattle, the pound-keeper shall deliver them to\nhim on payment of the fines and charges incurred in respect of such cattle.\nThe owner or his agent, on taking back the cattle, shall sign a receipt for them in the register\nkept by the pound-keeper."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Procedure if cattle be not claimed within a week. If the cattle be not claimed within",
      "content": "seven days from the date of their being impounded, the pound-keeper shall report the fact to the\nofficer in charge of the nearest police-station, or to such other officer as the Magistrate of the District\nappoints in this behalf.\nSuch officer shall thereupon stick up in a conspicuous part of his office a notice stating____\n(a)        the number and description of the cattle,\n(b)        the place where they were seized,\n(c)        the place where they are impounded,\nand shall cause proclamation of the same to be made by beat of drum in the village and at the\nmarket-place nearest to the place of seizure.\n1\nAs to the application of s. 11 to forests, see the Forest Act, 1927 (16 of 1927), s. 70; and to railways, see the Railways Act, 1890 (9 of\n1890), s. 125(4).\n2\nSubs. by Act 1 of 1891, s. 4, for \"take them without unnecessary delay\".\n3\nSubs. by the Cattle-trespass (Amendment) Act, 1921 (17 of 1921), s. 2, for the originals. 12. See s. 71 of the Forest Act, 1927 (16 of 1927) under\nwhich the Provincial Government may fix a different scale of fines for cattle impounded under s. 70 of that Act.\n4\nSubs. by A. O., 1937, for \" L.G.\".\nIf the cattle be not claimed within seven days from the date of the notice, they shall be sold\nby public auction by the said officer, or an officer of his establishment deputed for that purpose, at\nsuch place and time and subject to such conditions as the Magistrate of the District by general or\nspecial order from time to time directs:\n1\nProvided that, if any such cattle are, in the opinion of the Magistrate of the District, not\nlikely to fetch a fair price if sold as aforesaid, they may be disposed of in such manner as he thinks\nfit."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Delivery to owner disputing legality of the seizure but making deposits. If the owner",
      "content": "or his agent appear and refuse to pay the said fines and expenses, on the ground that the seizure was\nillegal and that the owner is about to make a complaint under section 20, then, upon deposit of the\nfines and charges incurred in respect of the cattle, the cattle shall be delivered to him."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Procedure when owner refuses or omits to pay the fines and expenses. If the owner or",
      "content": "his agent appear and refuse or omit to payor (in the case mentioned in section 15) to deposit the said\nfines and expenses, the cattle, or as many of them as may be necessary, shall be sold by public\nauction by such officer at such place and time, and subject to such conditions, as are referred to in\nsection 14.\nDeduction of fines and expenses. The fines leviable and the expenses of feeding and\nwatering, together with the expenses of sale, if any, shall be deducted from the proceeds of the sale.\nDelivery of unsold cattle and balance of proceeds. The remaining cattle and the balance of\nthe purchase-money, if any, shall be delivered to the owner or his agent, together with an account\nshowing___\n(a)        the number of cattle seized,\n(b)        the time during which they have been impounded,\n(c)        the amount of fines and charges incurred,\n(d)        the number of cattle sold,\n(e)        the proceeds of sale, and\n(f)        the manner in which those proceeds have been disposed of.\nReceipt. The owner or his agent shall give a receipt for the cattle, delivered to him and for\nthe balance of the purchase-money (if any) paid to him according to such account."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Disposal of fines, expenses and surplus proceeds of sales. The officer by whom the sale",
      "content": "was made shall send to the Magistrate of the District the fines so deducted.\nThe charges for feeding and watering deducted under section 16 shall be paid over to the\npound-keeper, who shall also retain and appropriate all sums received by him on account of such\ncharges under section 13.\n1\nThe surplus unclaimed proceeds of the sale of cattle shall be sent to the Magistrate of the\nDistrict, who shall hold them in deposit for three months, and, if no claim thereto be preferred and\nestablished within that period, shall, at its expiry, l[be deemed to hold them as part of the revenues of\nthe Province]."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Officers and pound",
      "content": "keepers not to purchase cattle at sale under Act. No officer of\npolice or other officer or pound-keeper appointed under the provisions herein contained shall,\ndirectly or indirectly, purchase any cattle as a sale under this Act.\nPound-keepers when not to release impounded cattle. No pound-keeper shall release or\ndeliver any impounded cattle otherwise than in accordance with the former part of this Chapter,\nunless such release or delivery is ordered by a Magistrate or Civil Court.\n2\n[CHAPTER V"
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Power to make complaints. Any person whose cattle have been seized under this Act,",
      "content": "or, having been so seized, have been detained in contravention of this Act, may, at any time within\nten days from the date of the seizure, make a complaint3 to the Magistrate of the District or any\nMagistrate authorized to receive and try charges without reference by the Magistrate of the District."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Procedure on complaints. The complaint shall be made by the complainant in person, or",
      "content": "by an agent personally acquainted with the circumstances. It may be either in writing or verbal. If it\nbe verbal, the substance of it shall be taken down in writing by the Magistrate.\nIf the Magistrate, on examining the complainant or his agent, sees reason to believe the\ncomplaint to be well founded, he shall summon the person complained against, and make an enquiry\ninto the case.\n22.Compensation for illegal seizure or detention. If the seizure or detention be adjudged\nillegal, the Magistrate shall award to the complainant, for the loss caused by the seizure or detention,\nreasonable compensation, not exceeding one hundred rupees, to be paid by the person who made the\nseizure or detained the cattle together with all fines paid and expenses incurred by the complainant in\nprocuring the release of the cattle,\nRelease of cattle. and, if the cattle have not been released, the Magistrate shall, besides\nawarding such compensation, order their release and direct that the fines and expenses leviable under\nthis Act shall be paid by the person who made the seizure or detained the cattle."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Recovery of compensation. The compensation, fines and expenses mentioned in section",
      "content": "22 may be recovered as if they were fines imposed by the Magistrate4].\n1\nSubs. by A. O., 1937, for \"dispose of them as hereinafter provided\".\n2\nSubs. for the original Ch. V by the Cattle-trespass Act (1871) Amendment Act, 1891 (1 of 1891), s. 6.\n3\nThe term \"offence\" as defined by s. 4 (0) of the Code of Criminal Procedure, 1898 (5 of 1898), includes any act in respect of which complaint may\nbe made under this section.\nOffences under this section may be tried in a summary way, see Act 5 of 1898, s. 260 (1) (m).\n4\nSee ss. 63 to 70 of the Pakistan Penal Code (45 of 1860), and s. 386 of the Code of Criminal Procedure, 1898 (5 of 1898); c. also, s.25 of the General\nClauses Act, 1897 (10 of 1897)."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Penalty for forcibly opposing the seizure of cattle or rescuing the same. Whoever",
      "content": "forcibly opposes the seizure of cattle liable to be seized under this Act,\nand whoever rescues the same after seizure, either from a pound, or from any person taking\nor about to take them to a pound, such person being near at hand and acting under the powers\nconferred by this Act,\nshall, on conviction before a Magistrate, be punished with imprisonment for a period not\nexceeding six months, or with fine not exceeding five hundred rupees, or with both.\n1"
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Recovery of penalty for mischief committed by causing cattle to trespass. Any fine",
      "content": "imposed 2[under the next following section or] for the offence of mischief by causing cattle to\ntrespass on any land may be recovered by sale of all or any of the cattle by which the trespass was\ncommitted, whether they were seized in the act of trespassing or not, and whether they are the\nproperty of the person convicted of the offence, or were only in his charge when the trespass was\ncommitted."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Penalty for damages caused to land or crops or public roads by pigs. Any owner or",
      "content": "keeper of pigs who, through neglect or otherwise, damages or causes or permits to be damaged any\nland, or any crop or produce of land, or any public road,3 by allowing such pigs to trespass thereon,\nshall, on conviction before a Magistrate, be punished with fine not exceeding ten rupees.\n4\n[The 5[Provincial Government], by notification in the official Gazette, may from time to\ntime, with respect to any local area specified in the notification, direct that the foregoing portion of\nthis section shall be read as if it had reference to cattle generally, or to cattle of a kind described in\nthe notification, instead of to pigs only, or as if the words \"fifty rupees\" were substituted for the\nwords \"ten rupees,\" or as if there were both such reference and such substitution.] .\n6* * * * * * *"
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Penalty on pound",
      "content": "keeper failing to perform duties. Any pound-keeper releasing or\npurchasing or delivering cattle contrary to the provisions of section 19, or omitting to provide any\nimpounded cattle with sufficient food and water, or failing to perform any of the other duties\nimposed upon him by this Act, shall, over and above any other penalty to which he may be liable, be\npunished, on conviction before a Magistrate, with fine not exceeding fifty rupees. Such fines may be\nrecovered by deductions from the pound-keeper's salary."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Application of fines recovered under sections 25, 26 or 27. All fines recovered under",
      "content": "section 25, section 26 or section 27 may be appropriated in whole or in part as compensation for loss\nor damage proved to the satisfaction of the convicting Magistrate.\n1\nAs to the application of s. 25 in the case of cattle-trespassing on a railway, see the Railways Act, 1890 (9 of 1890), s. 125 (3).\n2\nIns. by the Cattle-trespass Act (1871) Amendment Act, 1891 (1 of 1891), section 7.\n3\n“Public Road\" in section 26 includes a railway-see Act 9 of 1890, section 125 (4).\n4\nIns. by the Cattle-trespass Act (1871) Amendment Act, 1891 (1 of 1891), section 8.\n5\nSubs. by A. O., 1937, for\" L. G.\".\n6\nLast paragraph of s. 26 rep. by the Repealing and Amending Act, 1914 (10 of 1914)."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Saving of right to sue for compensation. Nothing herein contained prohibits any person",
      "content": "whose crops or other produce of land have been damaged by trespass of cattle from suing for\ncompensation in any competent Court."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Set",
      "content": "off. Any compensation paid to such person under this Act by order of the convicting\nMagistrate shall be set-off and deducted from any sum claimed by or awarded to him as\ncompensation in such suit.\n1\n[CHAPTER VIII"
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Power for Provincial Government to transfer certain functions to local authority",
      "content": "and direct credit of surplus receipts to local fund. The 2[Provincial Government] may, from time\nto time, by notification in the official Gazette,\n(a)        transfer to any local authority3 within any part of the territories under its\nadministration in which this Act is in operation, all or any of the functions of\nthe 2[Provincial Government] or the Magistrate of the District under this Act,\nwithin the local area subject to the jurisdiction of the local authority, 4* * *.]\nSCHEDULE.—[Rep. by the Repealing Act, 1938 (I of 1938).]\n___________\nDate: 16-09-2024\n1\nCh. VIII was added by Act 1 of 1891, s.9.\n2\nSubs. by A.O., 1937, for \"L.G.\".\n3\nFor special enactment as to the Punjab, see the Punjab District Boards Act, 1883 (20 of 1883), s. 20, clause (n).\n4\nOriginally there were the following words: -\"or (b) direct that the whole or any part of the surplus accruing in any district under s. 18 of this Act shall\nbe placed to the credit of such local fund or funds as may be formed for any local area or local areas comprised in that district, [and may from, time to\ntime, by notification in the official Gazette, cancel or vary any notification under this section]\". The bracketed words were rep.by the Repealing and\nAmending Act, 1914 (10 of 1914) and the rest by A.O., 1937."
    }
  ],
  "definitions": []
}
