{
  "id": "pk-charitable-endowments-act-1890",
  "type": "statute",
  "title": "Charitable Endowments Act, 1890",
  "title_en": "Charitable Endowments Act, 1890",
  "short_name": "CEA",
  "status": "in_force",
  "issued_date": "1890-03-06",
  "in_force_date": "1890-03-06",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJY%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Charitable Endowments Act, 1890 (VI of 1890) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Title, extent and commencement",
      "content": "(1) This Act may be called the Charitable\nEndowments Act, 1890.\n2\n[(2) It extends to the whole of Pakistan]; and\n(3) It shall come into force on the first day of October, 1890."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definition. In this Act, “charitable purpose” includes relief of the poor, education, medical",
      "content": "relief and the advancement of any other object of general public utility, but does not include a\npurpose which relates exclusively to religious teaching or worship3."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Appointment and incorporation of Treasurer of Charitable Endowments",
      "content": "4[(1) The\n5\n[Federal Government] may appoint an officer of the Government by the name of his office to be\nTreasurer of Charitable Endowments for 6[ Pakistan], and the Government of any Province may\nappoint an officer of the Government by the name of his office to be Treasurer of Charitable\nEndowments for the Province.]\n(2) Such Treasurer shall, for the purposes of taking, holding and transferring moveable or\nimmoveable property under the authority of this Act, be a corporation sole by the name of the\nTreasurer of Charitable Endowments for 7[8[ Pakistan] or, as the case may be, the Province], and, as\nsuch treasurer, shall have perpetual succession and a corporate seal, and may sue and be sued in his\ncorporate name.\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1889, Pt. V, p. 137; for Report of the Select Committee, see ibid.. 1890, p. 65;\nand for Proceedings in Council, see ibid., 1889, Pt. VI, pp. 117 and 190, and ibid., 1890, Pt. VI, p. 37.\nIt has been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.W.F.P. subject to certain\nmodifications and also extended to the Excluded Area of Upper Tanawal (N. W.F.P.) other than Phulera with effect from such date and\nsubject to such modifications as may be notified, see N. W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950.\nThis Act has been repealed in so far as it relates to charitable endowments the objects of which do not extend beyond the N.W.F.P. see the\nNorth- West Frontier Province Muslim Waqf Act, 1947 (22 of 1947), s. 37 and Sch.\nIt has been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950); and applied in the\nFederated Areas of Baluchistan, see Gazette of India, 1937, Pt. I, p. 1499.\nSee also s. 8 of. the Charitable Funds (Regulation of Collections) Act, 1953 (31 of 1953).\n2\nAct (26 of 1951), s. 8, has been subs. by Ordinance 21 of 1960, s. 3 and 2nd Sch., (with effect from 14th October, 1955).\n3\nSee also s. 8 of the Charitable Funds (Regulation of Collections) Act, 1953 (31 of 1953).\n4\nSubs. by A. O., 1937, for the original sub-section (1).\n5\nSubs. by F. A. O., 1975, Art. 2 and Table, for “Central Government”.\n6\nSubs. by A. O., 1949, Sch., for “India”.\n7\nSubs. by A. O., 1937, for “the territories subject to the L.G.”.\n8\nSubs. by A. O., 1949, Sch; for “India”.\n1[3A. Definition of “appropriate Government”, etc. In the subsequent provisions of this\nAct “the appropriate Government” means, as respects a charitable endowment, the objects of which\ndo not extend beyond a single Province and are not objects to which the executive authority of the\n2\n[Federal Government] extends, the Government of the Province, and as respects any other charitable\nendowment the 2[Federal Government.]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Orders vesting property in Treasurer",
      "content": "(1) Where any property is held or is to be\napplied in trust for a charitable purpose, the 3[appropriate Government], if it thinks fit, may, on\napplication made as hereinafter mentioned, and subject to the other provisions of this section, order,\nby 4notification in the official Gazette, that the property be vested in the Treasurer of Charitable\nEndowments on such terms as to the application of the property or the income thereof as may be\nagreed on between the 3[appropriate Government] and the person or persons making the application,\nand the property shall thereupon so vest accordingly.\n(2) When any property has vested under this section in a Treasurer of Charitable\nEndowments, he is entitled to all documents of title relating thereto.\n5\n[*     *          *          *          *          *          *]\n(4) An order under this section vesting property in a Treasurer of Charitable Endowments\nshall not require or be deemed to require him to administer the property, or impose or be deemed to\nimpose upon him the duty of a trustee with respect to the administration thereof."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Schemes for administration of property vested in the Treasurer",
      "content": "(1) On application\nmade as hereinafter mentioned, and with the concurrence of the person or persons making the\napplication, the 3[appropriate Government], if it thinks fit, may settle a 6scheme for the\nadministration of any property which has been or is to be vested in the Treasurer of Charitable\nendowments, and may in such scheme appoint, by name or office, a person or persons, not being or\nincluding such Treasurer, to administer the property.\n(2) On application made as hereinafter mentioned, and with the concurrence of the person or\npersons making the application, the 3[appropriate Government] may, if it thinks fit, modify any\nscheme settled under this section or substitute another scheme in its stead.\n(3) A scheme settled, modified or substituted under this section shall, subject to the other\nprovisions of this section, come into operation on a day to be appointed by the 2[appropriate\nGovernment] in this behalf, and shall remain in force so long as the property to which it relates\ncontinues to be vested in the Treasurer of Charitable Endowments or until it has been modified or\nanother such scheme has been substituted in its stead.\n1\nIns. by A. O., 1937.\n2\nSubs, by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n3\nSubs. by A. O., 1937, for “L.G.”.\n4\nFor notifications issued under this section in conjunction with s. 5, see different local R. & O.\n5\nSub-section (3) rep. by A. O., 1937.\n6\nFor notification setting a scheme for the Administration of the Pakistan Army Endowment Fund Trust Fund, see Gazette of Pakistan, 1958,   Pt. I,\npp. 18 and 20.\n(4) Such a scheme, when it comes into operation, shall supersede any decree or direction\nrelating to the subject-matter thereof in so far as such decree or direction is in any way repugnant\nthereto, and its validity shall not be questioned in any Court, nor shall any Court give, in\ncontravention of the provisions of the scheme or in any way contrary or in addition thereto, a decree\nor direction regarding the administration of the property to which the scheme relates:\n2\n[Provided that nothing in this sub-section shall be construed as precluding a Court from\ninquiring whether the Government by which a scheme was made was the appropriate Government.]\n(5) In the settlement of such a scheme effect shall be given to the wishes of the author of the\ntrust so far as they can be ascertained, and, in the opinion of the 1[appropriate Government], effect\ncan reasonably be given to them.\n(6) Where a scheme has been settled under this section for the administration of property not\nalready vested in the Treasurer of Charitable Endowments, it shall not come into operation until the\nproperty has become so vested."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Mode of applying for vesting orders and schemes",
      "content": "(1) The application referred to in\nthe two last foregoing sections must be made,—\n(a)           if the property is already held in trust for a charitable purpose, then by the\nperson acting in the administration of the trust, or, where there are more\npersons than one so acting, then by those persons or a majority of them; and\n(b)           if the property is to be applied in trust for such a purpose, then by the person\nor persons proposing so to apply it.\n(2) For the purposes of this section the executor or administrator of a deceased trustee of\nproperty held in trust for a charitable purpose shall be deemed to be a person acting in the\nadministration of the trust."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Bare trusteeship of Treasurer",
      "content": "(1) Subject to the provisions of this Act, a Treasurer of\nCharitable Endowments shall not, as such Treasurer, act in the administration of any trust whereof\nany of the property is for the time being vested in him under this Act.\n(2) Such Treasurer shall keep a separate account of each property for the time being so vested in so\nfar as the property consists of securities for money, and shall apply the property or the income\nthereof in accordance with the provision made in that behalf in the vesting order under section 4 or in\nthe scheme, if any, under section 5, or in both those documents.\n(3) In the case of any property so vested other than securities for money, such Treasurer shall,\nsubject to any special order which he may receive from the authority by whose order the property\nbecame vested in him, permit the persons acting in the administration of the trust to have the\npossession, management and control of the property, and the application of the income thereof, as if\nthe property had been vested in them.\n1\nSubs. by A. O; 1937, for “L.G.”.\n2\nProviso ins. ibid."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Annual publication of list of properties vested in Treasurer. A Treasurer of Charitable",
      "content": "Endowments shall cause to be published annually in the l[official Gazette], at such time as the\n2\n[appropriate Government] may direct, a list of all properties for the time being vested in him under\nthis Act and an abstract of all accounts kept by him under sub-section (2) of the last foregoing\nsection."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Limitation of functions and powers of Treasurer",
      "content": "(l) A Treasurer of Charitable\nEndowments shall always be a sole trustee, and shall not, as such Treasurer, take or hold any\nproperty otherwise than under the provisions of this Act, or subject to those provisions, transfer any\nproperty vested in him except in obedience to a decree divesting him of the property, or in\ncompliance with a direction in that behalf issuing from the authority by whose order the property\nbecame vested in him.\n(2) Such a direction may require the Treasurer to sell or otherwise dispose of any property\nvested in him, and, with the sanction of the authority issuing the direction, to invest the proceeds of\nthe sale or other disposal of the property in any such security for money as is 3[specified in the\ndirection], or in the purchase of immoveable property.\n(3) When a Treasurer of Charitable Endowments is divested, by a direction of 4[the\nappropriate Government] under this section, of any property, it shall vest in the person or persons\nacting in the administration thereof and be held by him or them on the same trusts as those on which\nit was held by such Treasurer."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Provisions for continuance of office of Treasurer in certain contingencies. If the",
      "content": "office held by an officer of the Government who has been appointed to be a Treasurer of Charitable\nEndowments is abolished or its name is changed, the 5[appropriate Government] may appoint the\nsame or another officer of the Government by the name of his office to be such Treasurer, and\nthereupon the holder of the latter office shall be deemed for the purposes of this Act to be the\nsuccessor in office of the holder of the former office.\n6[12. Transfer of property from one Treasurer to another. If by reason of any alteration of\nareas or by reason of the appointment of a Treasurer of Charitable Endowments for 7[Pakistan] or for\nany Province for which such a Treasurer has not previously been appointed or for any other reason it\nappears to the 8[Federal Government] that any property vested in a Treasurer of Charitable\nEndowments should be vested in another such Treasurer, that Government may direct that the\nproperty shall be so vested and thereupon it shall vest in that other Treasurer and his successors as\nfully and effectually for the purposes of this Act as if it had been originally vested in him under this\nAct .]\n9[13.Power to frame forms and make rules. 10[*                                  *           *           *          *           *   *]\n1\nSubs. by A. O., 1937, for “Local official Gazette”.\n2\nSubs. ibid., for “L.G.”.\n3\nSubs. by A.O., 1937, for “mentioned in section 4, sub-section (3), clause (a), (b), (c), (d) or (e)”.\n4\nSub. ibid., for “the L. G. or the G. G. in C”.\n5\nSubs. ibid., for “L. G.” which had been subs. for “G. G. in C.” by the Devolution Act, 1920 (38 of 1920), s. 2 and Sch. 1.\n6\nSubs. by A.O., 1937, for the original s. 12.\n7\nSubs. by A.O., 1949, Sch., for “India”.\n8\nSubs. by F. A.O., 1975, Art. 2 and Table, for “Central Government”.\n9\nSubs. by Act, 38 of 1920, s. 2 and Sch. I, for the original section 13.\n10\nSub-section (1) rep. by A.O.,1937.\n(2) The 1[appropriate Government] my make rules consistent with this Act for—\n(a)        prescribing the fees to be paid to the Government in respect of any property\nvested under this Act in a Treasurer of Charitable Endowments;\n(b)        regulating the cases and the mode in which schemes or any modification\nthereof are to be published before they are settled or made under section 5;\n(c)        prescribing the forms in which accounts are to be kept by Treasurers of\nCharitable Endowments and the mode in which such accounts are to be\naudited; and\n(d)        generally carrying into effect the purposes of this Act]"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Indemnity to Government and Treasure. No suit shall be instituted against the",
      "content": "2\n[Government] in respect of anything done or purporting to be done under this act, or in respect of\nany alleged neglect or omission to perform any duty devolving on the Government under this Act, or\nin respect of the exercise of, or the failure to exercise, any power conferred by this Act on the\nGovernment, nor shall any suit be instituted against a Treasurer of Charitable Endowments except\nfor divesting him of property on the ground of its not being subject to a trust for a charitable purpose,\nor for making him chargeable with or accountable for the loss or misapplication of any property\nvested in him, or the income thereof, where the loss or misapplication has been occasioned by or\nthrough his wilful neglect or default.\n3[15. Saving of provisions of the Official Trustees Act, 1913. Nothing in this Act shall be\nconstrued to impair the operation of the Official Trustees Act, 1913 (II of 1913)]."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. [General controlling authority of Governor General in Council.] Rep by the",
      "content": "Devolution Act, 1920 (XXXVIII of 1920), s. 2 and Schedule. I, Pt. I.\n__________\nDate: 05-09-2024\n1\nSubs. ibid., for “L. G.”.\n2\nSubs. by A.O., 1961, Art. 2 (with effect from the 23rd March, 1956), for “Crown” which had been subs. by A.O; 1937, for “Govt.”.\n3\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2nd Sch., for the existing section 15, which\nwas amended by A. O., 1949 and Act 2 of 1913."
    }
  ],
  "definitions": []
}
