{
  "id": "pk-chartered-accountant-ordinance-1961",
  "type": "statute",
  "title": "Chartered Accountant Ordinance, 1961",
  "title_en": "Chartered Accountant Ordinance, 1961",
  "short_name": "CAO",
  "status": "in_force",
  "issued_date": "1961-03-09",
  "in_force_date": "1961-03-09",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJyY-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Chartered Accountant Ordinance, 1961 (X of 1961) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Constitution and functions of Regional Committees",
      "content": "CHAPTER VA.\n20 A. Facts, etc, to be laid before the Investigation Committee.\n20 B. Enquiry by the Investigation Committee.\n20 C. Member or student not found guilty.\n20 D. Orders by the Council if member found guilty.\n20 E. Orders by the Council if student found guilty.\n20 F. Hearing of case by the High Court.\n20 G. Effect of inquiry\n20 H. Council and Investigation Committee to have powers of civil court.\n20 I.   Publication of findings and decisions.\n20 J.   Return of certificate.\n20 K. Appeal and revision.\nCHAPTER VI."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. [Saving.]",
      "content": "SCHEDULE I.\n[See section 20A]\nSCHEDULE II.\n[See section 20A and 20D]\nSCHEDULE III.\n[See section 20A and 20E]\nORDINANCE No. X OF 1961\n[10th March, 1961]\nAn Ordinance to make provision for the regulation of the profession of Accountants.\nWHEREAS it is expedient to make provision for the regulation of the profession of\naccountants and for that purpose to establish and Institute of Chartered Accountants;\nNOW, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958\nand in exercise of all powers enabling him in that behalf the President in pleased to make and\npromulgate the following Ordinance:—\nCHAPTER I."
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extend and commencement",
      "content": "(1) This Ordinance my be called the\nChartered Accountants Ordinance, 1961.\n(2) It extends to the whole of Pakistan 1[and shall apply to all members, wherever they may\nbe].\n(3) It shall come into force on such date2 [3[Federal Government] may, by notification in\nthe official Gazette, appoint in this behalf."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Ordinance, unless there is anything repugnant in the subject\nor\ncontext,—\n(a)        “associate” means an associate member of the Institute;\n(b)        “chartered accountant” means a person who is a member of the Institute;\n(c)        “Council” means the Council of the Institute;\n4\n[(cc) “fellow” means a fellow member of the Institute];\n(d)        “Institute” means the Institute of Chartered Accountants of Pakistan on\nstituted under this Ordinance;\n(e)        “prescribed” means prescribed by the bye-laws of the Institute;\n(f)    “Register” means the Register of the Members of the Institute maintained\nunder thisOrdinance;\n(g)    “registered accountant” means any person who has been enrolled on the\nRegisterof Accountants maintained by the 3[Federal Government] under the\nAuditors'Certificates Rules, 1950;\n4\n[(gg) “student” means a person who is or has been a trainee under a training\ncontract with a member of the Institute entitled to train students under this\nOrdinance and the bye-laws made thereunder and has not successfully\ncompleted the examinations of the Institute ; and]\n(h)        “year” means the period commencing on the first day of July of any year\nand ending on the thirtieth day of June of the succeeding year.\n1\nAdded by the Chartered Accountant (Amdt.) Ordinance, 1983 (15 of 1983), s. 2.\n2\nThe 1st July, 1961, see Gaz. of P., 1961, Ext., p. 1025.\n3\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. 4Ins. by Ord. 15 of 1983, s. 3.\n(2) A member of the Institute shall be deemed “to be in practice” when individually or\nin partnership with chartered accountants in practice, he, in consideration of remuneration received\nor to be received—\n(i)        engages himself in the practice of accountancy, or\n(ii)       offers to perform or performs services involving the auditing, or verification\nof financial transactions, books, accounts, or records or the preparation,\nverification or certification of financial accounting and related statements\nor holds himself out to the public as an accountant; or\n(iii)      renders professional services or assistance in or about matters of principle\nor detail relating to accounting procedure or the recording, presentation or\ncertification of financial facts or data ; or\n(iv)       renders such other services as, in the opinion of the Council, are or may be\nrendered by a chartered accountant in practice; and the words “to be in\npractice” with their grammatical variations and cognate expressions shall be\nconstrued accordingly.\nExplanation.—An associate or a fellow the Institute who is salaried employee of a\nchartered accountant in practice or a firm of such chartered accountants shall, notwithstanding\nsuch employment, be deemed to be in practice for the limited purpose of the training of 1[students].\n__________\nCHAPTER II.\nTHE INSTITUTE OF CHARTERED ACCOUNTANTS OF PAKISTAN."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Incorporation of the Institute",
      "content": "(1) All persons whose names are entered in the\nRegister at the commencement of this Ordinance and all persons who may hereafter have their\nnames entered in the Register under the provisions of this Ordinance, so long as they continue to\nhave their names borne on the said Register, are hereby constituted a body corporate by the name\nof the Institute of Chartered Accountants of Pakistan, and all such persons shall be known as\nmembers of the Institute.\n(2) The Institute shall have perpetual succession and a common seal and shall have power\nto acquire, hold and dispose of property, both movable and immovable, and shall by its name sue and\nbe sued."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Entry of names in Register",
      "content": "(1) Any of the following persons shall be entitled to have\nhis name entered in the Register, namely,—\n(i)        any person who is registered accountant at the commencement of this\nOrdinance;\n(ii)       any person who has passed such examination and completed such training\nas may be prescribed;\n1\nSubs. by the Chartered Accountants (Amdt.) Ordinance, 1983 (15 of 1983), s. 3, for “articled clerks”.\n(iii)      any person who has passed such other examination and completed such\nother training    outside Pakistan as is recognized by the 1[Federal\nGovernment] or the Council with the        approval of the 1[Federal\nGovernment] as being equivalent to the examination and training\nprescribed for members of the Institute:\n2\n[Provided that, in the case of any such person, the Council may, with\nthe approval of the Federal Government, impose such conditions as it may\ndeem fit.]\n(iv)       any person domiciled in Pakistan, who at the commencement of this\nOrdinance is studying for any foreign examination and is at the same time\nundergoing training, whether within or without Pakistan or, who, having\npassed such foreign examination, is at the commencement of this Ordinance\nundergoing training whether within or without Pakistan.\nProvided that any such examination or training was recognized before the commencement of\nthis Ordinance for the purpose of conferring the right to be registered as an accountant under the\nAuditors Certificates Rules, 1950, and provided further that such person passes the examination or\ncompletes training 3[.]\n4\n*                  *                   *                     *                     *                     *                    *\n(2) The name of every person belonging to the class mentioned in clause (i) of sub-section\n(1) shall be entered in the Register without the payment of any entrance fee or any application\nbeing made in that behalf and shall, for the purpose of sub-section (1) of section 3, be deemed to\nhave been so entered at the commencement of this Ordinance.\n(3) Every person belonging to any of the classes mentioned in clauses (ii), 4[(iii), 5[and\n(iv)]] of sub- section (1) shall have his name entered in the Register on application being made and\ngranted in the prescribed manner and on payment of the prescribed fee, which shall not exceed\nrupees five hundred in any case.\n(4)The 1[Federal Government] shall take such steps as may be necessary for the purpose\nof having the names of all persons belonging to the class mentioned in clause (i) of sub- section\n(1) entered in the Register."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Associates and Fellows",
      "content": "(1) The members of the Institute shall be of two classes\ndesignated respectively as associates and fellows.\n(2) Every person shall, on his name being entered in the Register, become an associate\nmember of the Institute and be entitled to use the letters A.C.A after his name to indicate that he is\nan associate member of the Institute of Chartered Accountants.\n1\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n2\nSubs. by the Chartered Accountants (Amdt.) Ordinance, 1983 (15 of 1983) s. 4, for the Proviso.\n3\nSubs. by the Chartered Accountants (Amdt.) Ordinance, 1968 (4 of 1968) s. 2, for the semi-colon, which was previously amended by Ord. 24 of\n1962, s. 2, for full-stop. 4Cl.(v) omitted ibid.\n4\nSubs. by the Chartered Accountants (Amdt.) Ordinance, 1962 (24 of 1962), s. 2, for clauses (iii) and (iv).\n5\nSubs. by the Chartered Accountants (Amdt.) Act 1968, (4 of 1968), s. 2, for “clauses (iv) and (v)”.\n1\n[(3) An associate member who has been in practice for at least five years or an\nassociate member of the Institute for a period of not less than ten years shall, on payment of the\nprescribed fee, have his name transferred to the Register of Fellows of the Institute and on\nhaving his name transferred to the Register of Fellows, he shall be entitled to use the letters F.C.A\nafter his name to indicate that he is a fellow member of the Institute.\nExplanation.—For the purpose of this sub-section, two years as a non-practicing associate\nshall be counted as one year of practice of such associate.]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Certificate of practice",
      "content": "(1) No member of the Institute shall be entitled to practice\nas an auditor of a public company as defined in the Companies Act, 1913 (VII of 1913) , unless\nhe has obtained from the Council a certificate of practice 2[ . ]\n3\n*                 *                     *                      *                     *   *   *\n(2) Every such member shall pay such annual fee for his certificate as may be prescribed,\nand such fee shall be due on the first day of July in each year."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Members to be known as Chartered Accountants",
      "content": "Every member of the\nInstitute in practice shall and any other member may, use the designation of a Chartered\nAccountants and no member using such designation shall use any other designation whether in\naddition thereto or in substitution therefore:\nProvided that nothing contained in this section shall be deemed to prohibit any such person\nfrom adding any other description or designatory letters to his name, if entitled thereto, to\nindicate membership of such other institute of accountancy, whether in Pakistan or elsewhere as\nmay be recognized in this behalf by the Council, or any other qualification that he may possess, or\nto behalf by the Council, or any other qualification that he may possess, or to prohibit a firm, all the\npartners of which are members of the Institute and in practice, from being known by its firm name\nas Chartered Accountants."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Disabilities",
      "content": "Notwithstanding anything contained in section 4, a person shall not be\nentitled to have his name entered in or borne on the Register if he—\n(i)       has not attained the age of twenty-one years at the time of his application for\nthe entry of his name in the Register; or\n(ii)       is of unsound mind and stands so adjudged by a competent Court; or (iii) is an\nundercharged insolvent; or\n(iv)        having been discharged of insolvency, has not obtained from the Court a\ncertificate stating that his insolvency was caused by misfortune without any\nmisconduct on his part ; or\n(v)        has been convicted by a competent Court, whether within or without\nPakistan of an offence involving moral turpitude and punishable with\ntransportation or imprisonment or of an offence, not of a technical nature,\ncommitted by him in his professional capacity unless in respect of\nthe offence committed he has either been granted a pardon or, on an\napplication made by him in this behalf, the 1[Federal Government] has, by an\norder in writing, removed the disability; or\n1\nSubs. by the Chartered Accountants (Amdt.) Ordinance, 1983 (15 of 1983), s. 5, for sub-section (3).\n2\nSubs. ibid., s.6, for the colon.\n3\nProviso omitted ibid.\n(vi)       has been removed from the membership of the Institute on being found on\ninquiry to have been guilty of such professional or other misconduct, as may\nbe prescribed:\nProvided that a person who has been removed from the membership of the Institute\nfor a specified period, shall be entitled to have his name entered in the Register after the expiry of\nsuch period.\n___________\nCHAPTER III."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Constitution of the Council of the Institute",
      "content": "(1) There shall be a Council of the\nInstitute for the management of the affairs of the Institute and for discharging the functions\nassigned to it under this Ordinance.\n1\n[(2) The Council shall be composed of the following persons, namely :—\n(a)        the prescribed number of persons, not being less than twelve, elected\nfrom the two prescribed regional constituencies by the members of the\nInstitute belonging to such constituencies from among such members of at\nleast five years’ standing, the number of members to be elected from each\nsuch constituency being such as may be prescribed:\nProvided that each such regional constituency shall consist of two zones, to be known as\nZone “A” and Zone “B”, having the prescribed limits :\nProvided further that at least one member shall be elected from each of the aforesaid Zones;\nand\n(b)        not more than four persons nominated by the Federal Government.]\n2\n*                  *                     *                     *                     *   *   *"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Mode of election to the Council",
      "content": "(1) Elections under clause (a) of sub-section (2) of\nsection 9 shall be conducted in the prescribed manner.\n3\n[(2) Where any dispute arises regarding any such election, the matter shall be referred by\nthe Council to a tribunal appointed by the President of the Council in this behalf and the decision of\nsuch Tribunal shall be final:\nProvided that in case the President of the Council in office is himself a party to such dispute\nor is unwilling to make such appointment, the immediate past President of the Council shall\nappoint the Tribunal :\n1\nSubs. by the Chartered Accountants (Amdt.) Ordinance, 1983 (15 of 1983), s. 7, for sub-section (2).\n2\nSub-section (3) omitted ibid.\n3\nSubs. ibid., s. 8. for sub-section (2).\nProvided further that no such reference shall be made except on an application made to\nthe Council by an aggrieved party, within thirty days from the date of the declaration of the result\nof the Election.]\n(3) The expenses of the Tribunal shall be borne by the Institute.\n1[11. Nomination in default of election.—(1) If the members of the Institute referred\nto in clause (a) of sub-section (2) of section 9 fail to elect the required number of members which\nthey are empowered under that section to elect from a zone of a constituency, the members\ndeclared elected from that zone shall nominate the number of members not elected who shall\nbe deemed to be members of the Council as if they had been duly elected.\n(2)Where the members of the Institute referred to in clause (a) of sub-section (2) of section\n9 do not at all elect any member, the Council shall nominate the required number of members from\nthe respective regional constituencies and such members shall be deemed to be the members of\nthe Council as if they had been duly elected.]"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. President and Vice President or Vice",
      "content": "Presidents.—(1) The Council shall elect\nfrom members a President and one or, if the Council so decides, 2[more than one] Vice-Presidents\nof the Institute, who shall also be the President and Vice-President or Vice Presidents of the\nCouncil) respectively and so often as the office or offices of the President or the Vice-President\nor Vice- Presidents become vacant, the Council shall choose from among its members a President\nor a Vice- President or vice-Presidents, as the case may be 3[.]\n4\n*                  *                     *                     *                   *   *   *\n(2) The President shall be the chief executive authority of the Council.\n(3) The President and the Vice-President or Vice-Presidents shall hold office for a period of\none year from the date on which they are chosen but so as not to extend beyond their term of office\nas members of the Council, and, subject to their being members of the Council at the relevant time,\nthey shall be eligible for re-election for a total period not exceeding three consecutive years 5[:]\n6\n[Provided that, notwithstanding the expiry of the term of their office, the President and the\nVice- President or Vice-Presidents of the Council, shall continue to hold office till such time as\ntheir successors are elected.]\n(4) On the dissolution of the Council, the President of the Council at the time of such\ndissolution shall continue to hold office and discharge such administrative and other duties as may\nbe prescribed until such time as a new President shall have been elected and shall have taken over\ncharge of his duties."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Resignation of membership and casual vacancies",
      "content": "(1) Any member of the Council\nmay at time resign his membership by writing under his hand addressed to the President and the\nseat of such member shall become vacant when such resignation is notified in the official Gazette.\n1\nSubs. by the Chartered Accountants (Amdt.) Ordinance 1983 (15 of 1983) s. 9, for section 11.\n2\nSubs. by the Chartered Accountants (Amdt.) Ordinance, 1970 ( 9 of 1970), s. 2, for “two”.\n3\nSubs. by Ord. 15 of 1983 . s. 10, for colon.\n4\nProviso omitted ibid.\n5\nSubs. ibid., for full-stop.\n6\nProviso added ibid.\n(2) A member of the Council shall be deemed to have vacated his seat if he is declared by\nthe Council to have been absent without sufficient excuse from three consecutive meetings of\nthe Council, or if his name is, for any cause, removed from the Register under the provisions of\nsection19.\n(3) A casual vacancy in the Council shall be filled by fresh election from the\nconstituency concerned or by nomination by the 1[Federal Government] as the case may be,\nand the person elected or nominated to fill the vacancy shall hold office until the dissolution of the\nCouncil:\nProvided that no election shall be held to fill a casual vacancy occurring within six months\nprior to the date of the expiry of the duration of the Council but such a vacancy may be filled by\nnomination by the 2[Council].\n(4) No act done by the Council shall be called in question on the ground merely of the\nexistence of any vacancy in, or defect in the constitution of, the Council."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Duration and dissolution of Council",
      "content": "(1) The duration of the Council constituted\nunder this Ordinance shall be 3[four] years from the date of the first meeting of the Council on the\nexpiry of which it shall stand dissolved and a new Council constituted in accordance with the\nprovisions of this Ordinance [:]4\n5\n[Provided that the duration of the Council existing immediately before the commencement\nof the Chartered Accountants (Amendment) Ordinance, 1983, shall be three years.]\n(2) Notwithstanding the expiry of the duration of the Council it shall continue to function\nuntil a new Council is constituted in accordance with the provisions of this Ordinance and\nupon such constitution, the Council so functioning shall stand dissolved."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Functions of the Council",
      "content": "(1) The duty of carrying out the provisions of this\nOrdinance shall be vested in the Council.\n(2) In particular, and without prejudice to the generality of the foregoing provisions,\nthe 6[functions] of the Council shall include—\n(a)        the examination of candidates for enrolment and the prescribing of fees\ntherefore;\n(b)        the regulation of the engagement and training of 7[students];\n(c)        the prescribing of qualifications for entry in the Register;\n(d)        the recognition of the foreign qualifications and training for purposes of\nenrolment;\n(e)        the granting or refusal of certificates of practice under this Ordinance;\n1\nSubs. by F.A.O., 1975, Art. 2 and Table for “Central Government”.\n2\nSubs. by the Chartered Accountants (Amdt.) Ordinance, 1983 (15 of 1983), s. 11, for certain words.\n3\nSubs. ibid., s. 12, for “three”.\n4\nSubs. ibid., for full-stop.\n5\nProviso added ibid.\n6\nSubs. by the Chartered Accountants (Amdt.) Ordinance, 1983 (15 of 1983), s. 13, for “duties”.\n7\nSubs. ibid., for “articled and audit clerks”.\n(f)      the maintenance and publication of a Register of persons qualified to practice\nas chartered accountants;\n(g)       the levy and collection of fees from members, examines and other person;\n(h)       the removal of names from the Register and the restoration to the Register\nof names which have been removed;\n(i)       the regulation and maintenance of the status and standard of professional\nqualifications of the members of the Institute;\n(j)       the carrying out, by financial assistance to persons other than members of the\nCouncil or in any other manner, of research in accountancy;\n(k)       the maintenance of a library and publication of books and periodicals\nrelating to accountancy;\n(l)       the exercise of such disciplinary power over the members and servants of\nthe Institute as may be prescribed;\n(m)       the formation of such Standing Committees as may be prescribed; and\n1\n[(mm) the constitution of an Investigation Committee consisting of such members as\nmay be prescribed;].\n(n)       such other powers as may be conferred on the Council by the 2[Federal\nGovernment]."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Staff, remuneration and allowances",
      "content": "For the efficient performance of its\nduties, the Council may—\n(a)       appoint a full-time Secretary who may also, if so decided by the Council, act\nas Treasurer;\n(b)       appoint such other officers and servants as it deems necessary;\n(c)       require and take from the Secretary or from any other officer or servant of\nthe Council such security for the due performance of his duties, as the Council\nconsiders necessary;\n(d)       fix salaries, fees, allowances and other conditions of service of the officers and\nservants of the Council.\n2\n(e)       with the previous sanction of the                              [Federal Government] fix the\nallowances of the\nPresident, Vice President or Vice-Presidents and other members of\nthe Council and members of its Committees.\n1\nCl (mm) ins. by the Chartered Accountants (Amdt.) Ordinance, 1983 (15 of 1983), s. 13.\n2\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Finances of the 1[Institute.] There shall be established a fund under the management",
      "content": "and control of the Council into which shall be paid all monies received by the 1[Institute] and\nout of which shall be met all expenses and liabilities properly incurred by the 1[Institute].\n_____________\nCHAPTER IV."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Register",
      "content": "(1) The Council shall maintain in the prescribed manner a Register of\nthe Members of the Institute.\n(2) The Register shall include the following particulars about every member of the\nInstitute, namely,—\n(a)       his full name date of birth, domicile, residential and professional addresses;\n(b)       the date on which his name is entered in the Register;\n(c)       his qualifications;\n(d)       whether he holds a certificate of practice; and\n(e)       any other particulars which may be prescribed.\n(3) The Council shall cause to be published, in such manner as may be prescribed, a list\nof members of the Institute as on the first day of July of each year, and shall, if requested to do so\nby any such members, send to him a copy of such list.\n(4) Every member of the Institute shall, on his name being entered in the Register pay\nsuch annual membership fee, as may be prescribed and different fees may be prescribed for\nassociates and for fellows."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Removal from the Register",
      "content": "2[(1)] The Council may remove from the Register the\nname of any member of the Institute—\n(a)       who is dead; or\n(b)       from whom a request has been received to that effect; or\n(c)       who has not paid any prescribed fee required to be paid by him; or\n(d)       who is found to have been subject at the time when his name was entered in\nthe Register, or who at anytime thereafter has become subject, to any of the\ndisabilities mentioned in section 8, or who for any other reason has ceased\nto be entitled to have his name borne on the Register 3[; or]\n1\nSubs. by F.A.O., 1975, Art. 2 and Table for “Central Government”.\n2\nRe-numbered by the Chartered Accountants (Amdt.). Ordinance, 1983 (15 of 1983), s. 15\n3\nSubs. ibid., s. 15, for full-stop.\n1\n[(e) against whom an order has been passed under this Ordinance removing him from\nthe membership of the Institute.];\n2\n[(2) The Council may, on an application made to it by a person whose name has been\nremoved from the Register for a specified period, restore his name if he is otherwise eligible\nto such membership :\nProvided that he shall have paid before such restoration the admission fee for the year\nduring which his name is restored, and, if his name has been removed under clause (b) or clause\n(c) of sub- section (1), all arrears on account of annual membership fee subject to maximum of\nfive years of annual membership fee according to the scale applicable to him.\n(3) The restoration of the name of a member shall be notified in the official Gazette and in\nsuch journal or journals as the Council thinks desirable and shall also be communicated in writing\nto the person concerned.]\nCHAPTER V."
    },
    {
      "provision_ref": "sec20a",
      "section": "20A",
      "title": "Section 20A. Facts, etc., to be laid before the Investigation Committee.",
      "content": "(1) The Secretary\nof the Institute shall, and any member or any aggrieved person may, lay before the Investigation\nCommittee any fact indicating that —\n(a)        a member of the Institute has prima facie been guilty of any professional\nmisconduct specified in Schedule I or Schedule II; or\n(b)        a student has prima facie been guilty of any professional misconduct\nspecified in Schedule III.\n(2) Where a complaint is received by the Institute that any member of the Institute or\nstudent is guilty of professional misconduct referred to in sub-section (1), the complaint shall, with\nrelevant and necessary facts, be laid before the Investigation Committee."
    },
    {
      "provision_ref": "sec20b",
      "section": "20B",
      "title": "Section 20B. Enquiry by the Investigation Committee",
      "content": "(1) If on considering the facts or\ncomplaint laid before it under section 20A, the Investigation Committee is of opinion that such\nfacts or complaint require investigation, it shall, after giving a notice to the member of the Institute\nor student whose conduct is in question, hold an inquiry.\n1\nCl. (e) added ibid.,\n2\nNew sub-section (2) added ibid.,\n3\nSubs. by the Chartered Accountants (Amdt.) Ordinance 1983 (15 of 1983), ibid., s. 16, for “specified by the Federal Governmen t”.\n4\nChapter VA ins. ibid., s. 17.\n(2) A member of the Institute or a student whose conduct is in question shall be given\nan opportunity of being heard and, such member or student so desires, the Investigation Committee\nshall permit such member or student to be represented before it by a counsel or by a member\nof the Institute.\n(3) After the conclusion of inquiry, the Investigation Committee shall report the result of\nthe inquiry to the Council."
    },
    {
      "provision_ref": "sec20c",
      "section": "20C",
      "title": "Section 20C. Member or student not found guilty",
      "content": "If, on receipt of the report under section\n20B, the Council finds that the member of the Institute or student, as the case may be, is not\nguilty of any professional misconduct, it shall record its finding accordingly and direct that the\nproceedings or, as the case may be the complaint be filed."
    },
    {
      "provision_ref": "sec20d",
      "section": "20D",
      "title": "Section 20D. Orders by the Council if member found guilty",
      "content": "(1) If, on receipt of the report\nunder section 20B, the Council is of opinion that the member of the Institute has been guilty\nof any professional misconduct specified in Schedule I, it may, after affording such member an\nopportunity of being heard, either personally or through counsel or another member of the Institute,\nmake any of the following orders, namely:—\n(a)    reprimand or warn such member;\n(b)    impose such penalty as it may deem necessary not exceeding one thousand\nrupees; and\n(c)    remove the name of such member from the Register for a period not exceeding\nfive years:\nProvided that, where it appears to the Council that the case is one in which the name of\nsuch member ought to be removed from the Register for a period exceeding five years or\npermanently, shall not make any order but shall refer the case to the High Court with its\nrecommendations thereon.\n(2) If the Council is of opinion that the member of the Institute is guilty of a\nprofessional misconduct specified in Schedule II, it shall refer the case to the High Court with its\nrecommendations thereon."
    },
    {
      "provision_ref": "sec20e",
      "section": "20E",
      "title": "Section 20E. Orders by the Council if student found guilty",
      "content": "If, on receipt of report under\nsection 20B, the Council is of opinion that the student is guilty of any professional misconduct\nspecified in Schedule III, it shall, after affording such student an opportunity of being heard, either\npersonally or through a counsel or a member of the Institute, make any of the following orders,\nnamely:—\n(a)    reprimand or warn the student; or\n(b)    suspend the student from training, or extend the period of training of the\nstudent, for such period as it may deem fit; or\n(c)    debar the student from training."
    },
    {
      "provision_ref": "sec20f",
      "section": "20F",
      "title": "Section 20F. Hearing of case by the High Court",
      "content": "On receipt of a reference under section\n20D, the High Court shall fix a date for the hearing of the reference and cause notice of the date so\nfixed to be given to the member of the Institute and the Council, and shall, after affording such\nmember and the Council, either personally or through counsel or a member of the Institute, an\nopportunity of being heard, make any of the following orders, namely:—\n(a)     direct that the proceedings be filed, or dismiss the complaint, as the case may\nbe;\n(b)     reprimand such member;\n(c)     remove him from membership of the Institute either permanently or for such\nperiod as it may deem fit; or\n(d)     refer the case to the Council for further inquiry and report."
    },
    {
      "provision_ref": "sec20g",
      "section": "20G",
      "title": "Section 20G. Effect of inquiry",
      "content": "For the purposes of this Chapter, “member of the Institute”\nincludes a person who was a member of the Institute on the date of the alleged misconduct but has\nceased to be a member of the Institute at the time of inquiry for any reason."
    },
    {
      "provision_ref": "sec20h",
      "section": "20H",
      "title": "Section 20H. Council and Investigation Committee to have powers of civil court",
      "content": "The\ncouncil and the Investigation Committee shall, for the purpose of an inquiry under this Chapter, be\ndeemed to be a civil court and shall have the same powers as are vested in a civil court under the\nCode of Civil Procedure, 1908 (V of 1908) in respect of the following mattes, namely:—\n(a)     summoning and enforcing the attendance of any person and examining him on\noath;\n(b)     the discovery and production of any document; and\n(c)     receiving evidence on affidavits."
    },
    {
      "provision_ref": "sec20i",
      "section": "20I",
      "title": "Section 20I. Publication of findings and decisions",
      "content": "Where a member of the Institute or a\nstudent is found guilty, the Council shall cause the findings and decisions given against such\nmember or student, as the case may be, to be published in the official Gazette and in such journal\nor journals as the Council may deem fit:\nProvided that, where the Council deems necessary, it may omit the name of such member\nor student from publication."
    },
    {
      "provision_ref": "sec20j",
      "section": "20J",
      "title": "Section 20J. Return of certificate",
      "content": "(1) Where the name of member of the Institute is removed\nfrom the Register, whether for a specified period or permanently, every certificate of membership\nor practice held by such member shall be deemed to be cancelled from the date of the order\nremoving his name from the Register and shall stand so cancelled for the said period or, as the case\nmay be, permanently.\n(2) The certificate referred to in sub-section (1) shall be returned by the member of the\nInstitute to the Secretary of the Council who shall, in the case of a member whose name is\nremoved from the Register for a specified period, return the certificate to the member on the\nexpiration of the said period."
    },
    {
      "provision_ref": "sec20k",
      "section": "20K",
      "title": "Section 20K. Appeal and revision",
      "content": "(1) Any member of the Institute aggrieved by an order of\nthe council imposing on him any of the penalties referred to in section 20D may, within sixty days\nof the date of communication of such order to him, prefer an appeal to the High Court.\n(2) The High court may, on its own motion or on an application made to it, call for the\nrecord of any case in which the Council has made an order under section 20D and may—\n(a)     confirm, modify or set aside the order;\n(b)       impose any penalty or set aside, reduce, confirm or enhance the penalty\nimposed by the order;\n(c)       remit the case to the Council for such further inquiry as the High Court may\nconsider proper in the circumstances of the case; or\n(d)       pass such other order as it may deem fit:\nProvided that no order of the Council shall be modified or set aside unless the Council has\nbeen given an opportunity of being heard and no order imposing or enhancing a penalty shall be\npassed unless the person concerned has also been given an opportunity of being heard.]\n___________\nCHAPTER VI."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Penalty for falsely claiming to be a member, etc",
      "content": "Any person who—\n(i)       not being a member of the Institute,__\n(a)        represents that he is a member of the Institute; or\n(b)        uses the designation Chartered Accountant, 1* * *; or\n(ii)      being a member of the Institute, but not having a certificate of practice,\nrepresents that he is in practice or practices as a chartered accountant,\nshall be punishable on first conviction with fine which may extend to one\nthousand rupees, and on any subsequent conviction with imprisonment\nwhich may extend to six months or with fine which may extend to five\nthousand rupees, or with both."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Penalty for using name of the Council awarding degree of chartered",
      "content": "accountancy, etc.—\n(1) No person shall—\n(i)       use a name or a common seal which is identical with the name or the\ncommon seal of the Institute or so nearly resembles it as to deceive or as is\nlikely to deceive the public;\n(ii)      award any degree, diploma or certificate or bestow any designation which\nindicates or purports to indicate the possession or attainment of any\nqualification or competence possessed by a person by virtue of his being a\nmember of the Institute; or\n(iii)     seek to regulate in any manner whatsoever the profession of chartered\naccountants.\n1\n(2) Any person contravening the provisions of sub-section (1) shall, without prejudice to\nany other proceedings which may be taken against him, be punishable with fine which may extend\non first conviction to one thousand rupees, and on any subsequent conviction with imprisonment\nwhich may extend to six months, or with fine which may extend to five thousand rupees, or with\nboth."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Companies not to engage in accountancy",
      "content": "(1) No company, limiting the liability\nof its members, whether incorporated in Pakistan or elsewhere shall practice as chartered\naccountants [:]1\n2\n[Provided that the members of the Institute shall be permitted to form into a limited\ncompany solely for practicing as “Management Consultants”.]\n(2) If any company contravenes the provisions of sub-section (1) then, without prejudice to\nany other proceedings which may be taken against the company, every director, manager,\nsecretary and any other officer thereof, who is knowingly a party to such contravention, shall be\npunishable with fine which may extend on first conviction to one thousand rupees and on any\nsubsequent conviction to five thousand rupees."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Unqualified persons not to sign documents",
      "content": "(1) No person other than a member\nof the Institute shall sign any document on behalf of a chartered accountant in practice or a firm of\nsuch chartered accountants in his or its professional capacity.\n(2) Any person contravening the provisions of sub-section (1) shall, without prejudice to\nany other proceedings which may be taken against him, be punishable with fine which may extend\non first conviction to one thousand rupees, and on any subsequent conviction with imprisonment\nwhich may extend to six moths, or with fine which may extend to five thousand rupees, or with both."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Maintenance of branch offices",
      "content": "(1) Where a chartered accountant in practice or a\nfirm of such chartered accountants has more than one office 1** each one of such offices shall be\nin the separate charge of a member of the Institute 2[who ordinarily resides in the area served by\nsuch office].\nProvided that the Council may in suitable cases exempt any chartered accountant in practice\nor a firm of such chartered accountants from the operation of this sub-section.\n(2) Every chartered accountant in practice or a firm of such chartered accountants\nmaintaining more than one office shall send to the Council a list of offices and the persons in\ncharge thereof and shall keep the Council informed of any change in relation thereto."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Power to make bye",
      "content": "laws.—(1) The Council may, by notification3 in the official\nGazette, make bye-laws for the purpose of carrying out the object of this Ordinance and a copy of\nsuch bye- laws shall be sent to each member of the Institute.\n(2) In particular, and without prejudice to the generality of the foregoing power, such\nbye-laws may provide for all or any of the following matters:—\n(a)        the standard and conduct of examinations under this Ordinance;\n(b)        the qualifications for the entry of the name of any person in the Register;\n(c)        the conditions under which any examination or training may be treated as\nequivalent to the examination and training prescribed for the membership of\nthe Institute;\n(d)        the conditions under which any foreign qualifications may be recognized;\n(e)        the manner in which and the conditions subject to which applications for\nentry in the Register may be made;\n(f)        the fees payable for membership of the Institute and the annual fees payable\nby associates and fellows of the Institute in respect of their certificates;\n(g)        the manner in which elections to the Council and the Regional Committees\nmay be held;\n(h)        the particulars to be entered in the Register;\n(i)        the functions of Regional Committees;\n4\n[(j)      the training of the students and suspension of the training of students for\nmisconduct or for any other cause;]\n1\n2\nAdded ibid.\n3\nFor the Chartered Accountants bye-laws, 1961, see Gaz of P., 1961 Ext., pp10 26-1060.\n4\nSubs. by the Chartered Accountants (Amdt.) Ordinance 1983 (15 of 1983) s. 21 for (j)\n(k)        the regulation and maintenance of the status and standard of professional\nqualifications of members of the Institute;\n1\n[(kk) the issue of directives to the members of the Institute on professional matter;]\n(l)        carrying out of research in accountancy;\n(m)        the maintenance of a library and publication of books and periodicals on\naccountancy;\n(n)        the management of the property of the Council and the maintenance and\naudit of its accounts;\n(o)        the summoning and holding of meetings of the Council, the times and\nplaces of such meetings, the conduct of business thereat and the number of\nmembers necessary to form a quorum;\n(p)        the powers, duties and functions of the President and the Vice-President\nor Vice-Presidents of the Council;\n(q)        the functions of the Standing and other Committees and the conditions\nsubject to which such functions shall be discharged;\n(r)        the terms of office, and the powers, duties and functions of the Secretary\nand other officers and servants of the Council;\n(s)        the rules of professional and other misconduct, and the exercises of\ndisciplinary powers; and\n(t)        any other matter which is required to be or may be prescribed under this\nOrdinance.\n(3) All bye-laws made by the Council under this Ordinance shall be subject to the condition\nof previous publication and to the approval of the 2[Federal Government].\n(4) Notwithstanding anything contained in sub-section (1) and (2), the 2[Federal\nGovernment] may frame the first bye-laws for the purposes mentioned in this section, and such\n3\nbye-laws shall be deemed to have been made by the Council, and shall remain in force from the\ndate of the coming into force of this Ordinance, until they are amended, altered or revoked by the\nCouncil."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Powers of 2[Federal Government] to direct bye",
      "content": "laws to be made or to make or\namend bye - laws.__ (1) Where the 2[Federal Government] considers it expedient so to do, it may,\nby order in writing, direct the Council to make any bye-law or to amend or revoke any bye-law\nalready made within such period as it may specify in this behalf.\n(2) If the Council fails or neglects to comply with such order within the specified period,\nthe 2[Federal Government] may make or amend, with or without modifications, or revoke, any bye-\nlaws, directed to be made, amended or revoked by that order.\n1\nCl. (kk) added ibid.\n2\nSubs. by F.A.O., 1975, Art. 2 and Table for “Central Government”.\n3\nFor such bye-laws see Gaz. of p 1961 Ext, P.1026."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Reference to registered accountants, etc. to be construed as references to",
      "content": "chartered accountants.—Any reference to a chartered accountant or a registered accountant or a\ncertified or qualified auditor in any other law or in any document whatsoever shall be construed as a\nreference to a chartered accountant in practice within the meaning of this Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "associate",
      "definition": "an associate member of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "chartered accountant",
      "definition": "a person who is a member of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Council",
      "definition": "the Council of the Institute; 4 [(cc) “fellow” means a fellow member of the Institute];",
      "source_provision": "sec2"
    },
    {
      "term": "Institute",
      "definition": "the Institute of Chartered Accountants of Pakistan on stituted under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by the bye-laws of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Register",
      "definition": "the Register of the Members of the Institute maintained under thisOrdinance;",
      "source_provision": "sec2"
    },
    {
      "term": "registered accountant",
      "definition": "any person who has been enrolled on the Registerof Accountants maintained by the 3[Federal Government] under the Auditors'Certificates Rules, 1950; 4 [(gg) “student” means a person who is or has been a trainee under a training contract with a member of the Institute entitled to train students under this Ordinance and the bye-laws made thereunder and has not successfully completed the examinations of the Institute ; and]",
      "source_provision": "sec2"
    },
    {
      "term": "year",
      "definition": "the period commencing on the first day of July of any year and ending on the thirtieth day of June of the succeeding year. 1 Added by the Chartered Accountant (Amdt.) Ordinance, 1983 (15 of 1983), s. 2. 2 The 1st July, 1961, see Gaz. of P., 1961, Ext., p. 1025. 3 Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. 4Ins. by Ord. 15 of 1983, s. 3. (2) A member of the Institute shall be deemed “to be in practice” when individually or in partnership with chartered accountants in practice, he, in consideration of remuneration received or to be received— (i) engages himself in the practice of accountancy, or (ii) offers to perform or performs services involving the auditing, or verification of financial transactions, books, accounts, or records or the preparation, verification or certification of financial accounting and related statements or holds himself out to the public as an accountant; or (iii) renders professional services or assistance in or about matters of principle or detail relating to accounting procedure or the recording, presentation or certification of financial facts or data ; or (iv) renders such other services as, in the opinion of the Council, are or may be rendered by a chartered accountant in practice; and the words “to be in practice” with their grammatical variations and cognate expressions shall be construed accordingly. Explanation.—An associate or a fellow the Institute who is salaried employee of a chartered accountant in practice or a firm of such chartered accountants shall, notwithstanding such employment, be deemed to be in practice for the limited purpose of the training of 1[students]. __________ CHAPTER II. THE INSTITUTE OF CHARTERED ACCOUNTANTS OF PAKISTAN.",
      "source_provision": "sec2"
    }
  ]
}
