{
  "id": "pk-chemical-fertilizers-development-surcharge-act-1973",
  "type": "statute",
  "title": "Chemical Fertilizers (Development Surcharge) Act, 1973",
  "title_en": "Chemical Fertilizers (Development Surcharge) Act, 1973",
  "short_name": "CFSA",
  "status": "in_force",
  "issued_date": "1973-06-26",
  "in_force_date": "1973-06-26",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUZWFw-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Chemical Fertilizers (Development Surcharge) Act, 1973 (XLI of 1973) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Chemical\nFertilizers (Development Surcharge) Act, 1973.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(a)     “company” means any company engaged in the business of manufacturing\nchemical fertilizers ;\n(b)     “development surcharge” means the surcharge payable under section 3;\n(c)     “differential margin”, in relation to a chemical fertilizer, means the amount\nby which the maximum sale price of that fertilizer exceeds its maximum\nretail selling price as in force immediately before the commencement of the\nChemical Fertilizers (Development Surcharge) Ordinance, 1973 (VI of 1973),\nhereinafter referred to as the said Ordinance, or, as the case may be, the\namount by which its maximum sale price exceeds the aggregate of its ex-\nfactory price and the incidental charges;\n(d)     “ex-factory price”, in relation to a chemical fertilizer produced by a factory,\nmeans such ex-factory price of that fertilizer as the Federal Government may,\nby notification in the official Gazette, declare to be the ex-factory price\nhaving regard to the cost of production of such factory;\n(e)     “incidental charges” means the aggregate of the freight by rail or road and\nsuch distribution costs as the Federal Government may, by notification in the\nofficial Gazette, fix;\n(f)     “landed cost”, in relation to any chemical fertilizer, means the aggregate of\nc.i.f. value, duties, taxes, fees and other charges payable on or after the import\nof that fertilizer into Pakistan;\n(g)       “maximum sale price”, in relation to a chemical fertilizer, means such retail\nprice of that fertilizer, not exceeding 125 per cent, of its landed cost, as the\nFederal Government may, by notification in the official Gazette, declare to be\nthe maximum sale price."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Levy of development surcharge",
      "content": "(1) Subject to the provisions of this Act, every\ncompany shall pay to the Federal Government a development surcharge equal to the differential\nmargin in respect of a chemical fertilizer produced by it, including a chemical fertilizer so produced\nand held in stock immediately before the commencement of the 1[said Ordinance].\n(2) Subject as aforesaid, every stockist shall pay to the Federal Government a development\nsurcharge equal to the differential margin in respect of a chemical fertilizer held by him in stock\nimmediately before commencement of the said Ordinance."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to grant exemption from payment, authorise refund and procedure for",
      "content": "collection and refund of surcharge.—(1) Subject to such conditions, limitations or restrictions as it\nmay think fit to impose, the Federal Government may, in such general cases as it may prescribe by\nrules or in particular cases by special order, exempt a company from the payment of the\ndevelopment surcharge in respect of all or any of the fertilizers or authorise the refund in whole or in\npart of the development surcharge paid by a company.\n(2) Subject to any rules made under this Act, the development surcharge shall be collected in\n1944), is collected."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Maximum sale price",
      "content": "(1) Notwithstanding anything contained in any other law, no\ncompany or stockist shall sell any chemical fertilizer at a price higher than the maximum sale price.\n(2) A contravention of sub-section (1) shall be deemed to be a contravention of an order made\nunder the 1[Price Control and Prevention of Profiteering and Hoarding Act, 1977 (XXXIX of 1977)],\nand all the provisions of that Act shall have effect accordingly."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Allowance to be made for development surcharge for purposes of income",
      "content": "tax.—\nNotwithstanding anything contained in any other law, the amount of the development surcharge paid\nby a company or stockist under section 3 shall be an expenditure for which allowance is to be made\nin computing profits or gains under 1[subsection (1) of section 23 of the Income tax Ordinance\n(XXXI of 1979)]."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power to make rules",
      "content": "The Federal Government may, by notification in the official\nGazette, make rules for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Delegation of Powers",
      "content": "The Federal Government may, by notification in the official\nGazette, direct that all or any of its powers under this Act or the rules made thereunder shall, in such\ncircumstances and under such conditions, if any, as may be specified in the direction, be exercised\nalso by an officer or authority subordinate to the Federal Government."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. 1 [Omitted]",
      "content": "RGN Uploaded on 28.2.2024\n1\nSubs. and omitted by the Federal Laws (Revision and Declaration) Ordinance 1981 (XXVII of 1981). s. 3 and Sch. II."
    }
  ],
  "definitions": [
    {
      "term": "company",
      "definition": "any company engaged in the business of manufacturing chemical fertilizers ;",
      "source_provision": "sec2"
    },
    {
      "term": "development surcharge",
      "definition": "the surcharge payable under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "incidental charges",
      "definition": "the aggregate of the freight by rail or road and such distribution costs as the Federal Government may, by notification in the official Gazette, fix;",
      "source_provision": "sec2"
    }
  ]
}
