{
  "id": "pk-chemical-weapons-convention-implementation-ordinance-2000",
  "type": "statute",
  "title": "Chemical Weapons Convention Implementation Ordinance, 2000.",
  "title_en": "Chemical Weapons Convention Implementation Ordinance, 2000.",
  "short_name": "CWCIO",
  "status": "in_force",
  "issued_date": "2000-10-10",
  "in_force_date": "2000-10-10",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FobZg%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Chemical Weapons Convention Implementation Ordinance, 2000. (LIV of 2000) published by The Pakistan Code (Criminal Laws).",
  "provisions": [
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Power to make rules",
      "content": "ORDINANCE, 2000\nORDINANCE No. LIV of 2000\n[11th October, 2000]\nAn Ordinance to give effect in Pakistan to the Convention on the Prohibition of the Development,\nProduction, Stockpiling and use of Chemical Weapons and on their Destruction signed at Paris on\nthe 13th January, 1993\nWHEREAS it is expedient to give effect in Pakistan to the Convention on the Prohibition of\nthe Development, Production, Stockpiling and use of Chemical Weapons, and on their destruction\nsigned at Paris on the 13th January, 1993;\nAND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the\nProclamation of Emergency of the fourteenth day of October, 1999, and the Provisional Constitution\nOrder No.1 of 1999;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of\nOctober, 1999, and the Provisional Constitution Order No 1 of 1999, as well as Order No. 9 of 1999,\nand in exercise of all powers enabling him in that behalf, the President of the Islamic Republic of\nPakistan is pleased to make and promulgate the following Ordinance:-"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_ (1) This Ordinance may be called the Chemical\nWeapons Convention Implementation Ordinance, 2000.\n(2)    It extends to the whole of Pakistan.\n(3)    It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definition",
      "content": "_ (1) In this Ordinance, unless there is anything repugnant in the subject or\ncontext,—\n(a)     “assistance inspection” means an inspection conducted pursuant to Parts II and\nXI of the Verification Annex;\n(b)     “challenge inspection” means an inspection conducted pursuant to Parts II and\nX of the Verification Annex;\n(c)     “chemical weapons” means—\n(i)    a toxic chemical and its precursor, except where intended for permitted\npurposes, as long as types and quantities are consistent with such\npurposes;\n(ii)    a munitions or device, specifically designed to cause death or other harm\nthrough the toxic properties of a toxic chemical specified in sub-clause\n(i), which would be released as a result of the employment of such\nmunition or device; or\n(iii)   any equipment specifically designed for use directly in connection with\nthe employment of a munition or device specified in sub-clause (ii);\n(d)   “Convention” means the convention on the Prohibition of the Development,\nProduction, stockpiling and use of Chemical Weapons and on their Destruction\nsigned at Paris on the 13th January, 1993;\n(e)   “National Authority” means the National Authority designated as such under\nsection 9;\n(f)   “permitted purposes” means—\n(i)     industrial, agricultural, research, medical, pharmaceutical or other\npeaceful purposes;\n(ii)    protective purposes, that is such purposes which are directly related to\nprotection against toxic chemicals and to protection against chemical\nweapons;\n(iii)   military purposes not connected with the use of chemical weapons and\nnot dependent on the use of the toxic properties of chemicals as a method\nof warfare; and\n(iv)    law enforcement including domestic riot control purposes;\n(g)   “precursor” means any chemical reactant which takes part at any stage in the\nproduction by whatever method of a toxic chemical and includes any key\ncomponent of a binary or multi-component chemical system;\n(h)   “prescribed” means prescribed by rules made under this Ordinance;\n(i)   “riot control agent” means any chemical which is not a\nscheduled chemical, which can produce rapidly in humans sensory irritation or\ndisabling physical effects which disappear within a short time following\ntermination of exposure;\n(j)   “routine inspection” means an inspection conducted pursuant to Parts II to IX\nof the Verification Annex;\n(k)   “scheduled chemical” means a chemical listed in Schedules I or, as the case may\nbe, Schedule II or Schedule III to this Ordinance;\n(l)   “toxic chemical” means any chemical which through its chemical action on life\nprocesses can cause death, temporary incapacitation or permanent harm to\nhumans or animals and includes all such chemicals, regardless of their origin or\nof their method of production, and regardless of whether they are produced in\nfacilities, in munitions or elsewhere; and\n(m)    “Verification Annex” means the Verification Annex to the Convention and\nportions of which are reproduced in Schedule IV to this Ordinance."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Prohibition on development etc; of chemical weapon.___ (1) No person shall",
      "content": "(a)    develop, produce, otherwise acquire, stockpile or retain a chemical weapon, or\ntransfer, directly or indirectly, a chemical weapon to anyone;\n(b)    use a chemical weapon;\n(c)    engage in any military preparations to use a chemical weapon;\n(d)    assist, encourage or induce, in any way, any other person to engage in any\nactivity prohibited to a State Party under the Convention; or\n(e)    use a riot control agent as a method of warfare.\n(2) For the purposes of sub-section (1) an object shall not be a chemical weapon if the person\nuses the object only for permitted purposes and in deciding whether permitted purposes are intended\nthe types and quantities of objects shall be taken into account.\n(3) Whoever contravenes the provisions of this section shall be guilty of an offence punishable\nwith imprisonment for a term which may extend to twenty-five years."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Premises or equipment for producing chemical weapons.___ (1) No person shall",
      "content": "(a)    construct any premises intended to be used for production of chemical weapons;\n(b)    alter any premises with intention to use the same for production of chemical\nweapons;\n(c)    install or construct any equipment intended to be used for production of\nchemical weapons; and\n(d)    alter any equipment with intention to use the same for production of chemical\nweapons.\n(2) For the purposes of sub-section (1) an object shall not be a chemical weapon if the object\nis used for permitted purposes and in deciding whether permitted purposes are intended the types and\nquantities of objects shall be taken into account.\n(3) Whoever contravenes the provisions or this section shall be guilty of an offence punishable\nwith imprisonment for a term which may extend to twenty-five years."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Prohibition on production, etc. of toxic chemicals and precursors",
      "content": "_ (1) No person shall\nproduce, use, acquire, possess, transfer, import or export-\n(a)    any scheduled chemical;\n(b)    any discrete organic chemical not being a scheduled chemical ;or\n(c)    any chemical containing the elements phosphorous, sulfur or fluorine.\nexcept for permitted purposes under this Ordinance.\n(2) Whoever contravenes the provisions or this section shall be guilty of an offence punishable\nwith fine which may extend to ten thousand rupees."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Transfer of any scheduled chemical for permitted purposes",
      "content": "_ (1) No person shall\ntransfer to a State Party or as the case may be to a state not party to the Convention any scheduled\nchemical listed in-\n(a)    Schedule I except its accordance with the relevant provisions of Part VI of the\nVerification Annex;\n(b)    Schedule II except in accordance with the relevant provisions of part VII of the\nVerification Annex; and\n(c)    Schedule III except in accordance with the relevant provisions of Part VIII of\nthe Verification Annex.\n(2) Whoever contravenes the provisions of this section shall be guilty of an offence punishable\nwith fine which may extend to ten thousand rupees."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Production, etc, for permitted purposes",
      "content": "(1) The production, use, acquisition, export or\nimport of a chemical listed in___\n(a)    Schedule I shall be subject to the prohibition, acquisition, retention and use as\nspecified in Part VI of the Verification Annex and such chemicals and facilities\nspecified in Part VI of the Verification Annex shall be subject to systematic\nverification through on-site inspection and monitoring with on-site instruments\nin accordance with that part of the Verification Annex;\n(b)    Schedule II and facilities specified in Part VII of the Verification Annex shall\nbe subject to data monitoring and on-site verification in accordance with that\npart of the Verification Annex; and\n(c)    Schedule III and facilities specified its Part VIII of the Verification Annex shall\nbe subject to data monitoring and on-site verification in accordance with that\npart of the Verification Annex.\n(2) The production, use, acquisition, export or import of any discrete organic chemical not\nbeing a scheduled chemical or any chemical containing the elements phosphorous, sulfur or fluorine\nand facilities specified in Part IX of the Verification Annex shall be subject to data monitoring and\neventual on-side verification in accordance with that part of the Verification Annex unless decided\notherwise by the Conference of the States Parties pursuant to paragraph 22 of Part IX of the\nVerification Annex."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Verification activities",
      "content": "_ In conducting verification, activities under the Convention, the\nTechnical Secretariat provided under the Convention shall avoid undue intrusion into the State Party's\nchemical activities for permitted purposes and, in particular, abide by the provisions of the Annex on\nthe Protection of Confidential Information to the Convention as set out in Schedule V to this\nOrdinance."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. National Authority",
      "content": "_ The Secretary, Ministry of Foreign Affairs, Government of Pakistan,\nshall be the National Authority for the purposes of this Ordinance."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Functions of the Authority",
      "content": "_ In particular and without prejudice to the generality of\nfunctions under this Ordinance, the functions of the Authority shall be to___\n(a)     ensure effective operation of this Ordinance ;\n(b)     carry out, on behalf of Pakistan, such obligations which Pakistan has under the\nConvention;\n(c)     facilitate inspections of premises in Pakistan, in case compliance of Pakistan\nwith the Convention is challenged; and\n(d)     do anything incidental or conducive to the performance of the aforesaid\nfunctions."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Delegation of powers",
      "content": "_The National Authority may, for the purpose of efficient discharge\nof its functions and duties, delegate to an officer of the Federal Government, subject to such conditions\nand limitations as may be specified, such of its functions and duties under this Ordinance as it may\ndeem necessary."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Inspections under the Convention",
      "content": "_ (1) If it is proposed to conduct a routine inspection,\na challenge inspection or an assistance inspection in Pakistan, the National Authority may, subject to\nsub-section (2), issue an authorisation under this section in respect of that inspection.\n(2) In issuing any authorisation, the National Authority shall ensure that the Convention is not\nabused to the detriment of the security and economic interests of Pakistan and shall take appropriate\nmeasures to protect sensitive installations not related to the Convention."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Particulars of authorisation.___ An authorisation under section 12 shall",
      "content": "(a)     state the names of the members of the inspection team by whom the inspection\nis to be carried out;\n(b)     contain the name of the person in charge of the in-country escorts;\n(c)     in the case of a challenge inspection, also state the name of any observer who\nmay accompany the team;\n(d)     contain a description of the specified area in which the inspection is to be\nconducted; and\n(e)     specify the type of inspection concerned."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Effect of authorisation",
      "content": "_ (1) An authorisation under section 12 shall have the effect of\nauthorising the inspection team-\n(a)     to exercise within the specified area such rights of access, entry and\nunobstructed inspection as are conferred on them by the Verification Annex;\n(b)     to do such other things within the specified area in connection with the\ninspection as they are entitled to do by virtue of the Verification Annex\nincluding things concerning the maintenance, replacement or adjustment of any\ninstrument or other object relating to open equipment on site;\n(c)     authorising an in-country escort to accompany the inspection team in\naccordance with the provisions of the Verification Annex; and\n(d)     authorising the police to give such assistance as the in-country escort may\nrequest for the purpose of facilitating the conduct of the inspection in\naccordance with the Verification Annex.\n(2) An authorisation under section 12, in the case of a challenge inspection shall, in addition,\nhave the effect of authorising the observer to exercise within the specified area such rights of access\nand entry as are conferred on him by the Verification Annex.\n(3) Any police officer giving assistance in accordance with clause (d) of sub-section (1) may\nuse such reasonable force as he considers necessary for the purpose of facilitating inspection."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Right of occupier, etc",
      "content": "_The occupier of any premises, or a person acting on his behalf,___\n(a)     in relation to which it is proposed to exercise a right of entry on the basis of an\nauthorisation under section 12; or\n(b)     on which an inspection is being carried out on the basis of such an authorisation\nshall be entitled to require a copy of the authorization to be shown to him by a\nmember of the in-country escort."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Bar to jurisdiction",
      "content": "_ The validity of an authorisation issued under section 12 in respect\nof an inspection shall not be called in question in any court."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Proof regarding status of a member of inspection team",
      "content": "_ If a question arises whether\na person at any time was or was not, in relation to any routine, challenge or assistance inspection, a\nmember of the inspection team or a member of the in-country escort or an observer, a certificate issued\nby, or on behalf of, the National Authority stating any fact relating to that question shall be conclusive\nevidence of that fact."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Power to amend authorisation, and its effect",
      "content": "_ (1) The National Authority may amend\nan authorisation issued by it under section 12, verying the specified area mentioned therein, as it may\nconsider necessary from time to time.\n(2) In case the National Authority has amended an authorisation under sub-section (1)\n(a)    the provisions of section 14 shall be applicable to such amendment as if the\nspecified area were the area as varied; and\n(b)    the provisions of section 16 shall be applicable to such amendment as it shall\napply to the authorisation."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Offences in respect of an inspection",
      "content": "_ (1) In case an authorisation has been issued under\nsection 12 in respect of an inspection, a person shall be guilty of an offence if he—\n(a)    refuses without reasonable excuse to comply with a request made by a police\nofficer or a member of the in-country escort for the purpose of facilitating the\nconduct of that inspection in accordance with the Verification Annex;\n(b)    interferes without reasonable excuse with any container, instrument or other\nobject installed in the course of that inspection in accordance with the\nVerification Annex; or\n(c)    wilfully obstructs a member of the inspection team or of the in-country escort,\nor the observer, in the conduct of that inspection in accordance with the\nVerification Annex.\n(2) The provisions of clause (b) of sub-section (1) shall apply to any interference which may\noccur at any time while the container, instrument or other object is retained in accordance with the\nVerification Annex.\n(3) A person on conviction of an offence under this section shall be punishable with\nimprisonment for a term which may extend to two years, or with fine, or with both."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Privileges and immunities of members of inspection team and observers",
      "content": "_ (1) The\nmembers of an inspection team and observers shall enjoy the same privileges and immunities as are\nenjoyed by diplomatic agents in accordance with the following provisions of the Vienna Convention\non Diplomatic Relations of 1961, namely:-\n(a)    Article 29;\n(b)    Paragraphs 1 and 2 of Article 30;\n(c)    Paragraphs 1, 2 and 3 of Article 31; and\n(d)    Article 34.\n(2) The members of an inspection team and observers shall, enjoy the same privileges as are\nenjoyed by diplomatic agents in accordance with paragraph 1 (b) of Article 36 of the Vienna\nConvention on Diplomatic Relations of 1961, except in relation to such articles the importing or\nexporting of which is prohibited by law or controlled by. the enactments relating to quarantine.\n(3) Samples and approved equipment carried by members of an inspection team shall be\ninviolable and exempt from payment of customs-duties.\n(4) The privileges and immunities accorded to the members of an inspection team and observers\nby virtue of this section shall be enjoyed by them at any time when they are in Pakistan-\n(a)     in connection with the carrying out a routine inspection, a challenge inspection\nor an assistance inspection; or\n(b)     while in transit to or from the territory of another State Party to the Convention\nin connection with the carrying out of such inspection.\n(5) If___\n(a)     immunity from jurisdiction of a member of an inspection team is waived in\naccordance with the Verification Annex; and\n(b)     a notice made by the National Authority and informing the member of the\nwaiver is delivered to him in person.\nthen, from the time the notice is so delivered, this section shall not have effect to confer that immunity\non the member.\nExplanation.—In this section “approved equipment” and “samples” shall be construed in accordance\nwith the Verification Annex."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Disclosure of information",
      "content": "_ (1) Any person who produces, possesses, consumes,\ntransfers, exports or imports any scheduled chemical or who produces a discrete organic chemical not\nbeing a scheduled chemical or a chemical containing the elements phosphorus, sulfur or fluorine or\nwho holds a riot control agent for riot control purposes shall—\n(a)     provide the prescribed information, at the prescribed time and in the prescribed\nform, to the National Authority; and\n(b)     keep and maintain the prescribed documents in Pakistan, at his place of business\nor at such other place as may be specified by -the National Authority, in the\nprescribed manner and for the prescribed period; and\n(c)     on request, provide the documents to the National Authority.\n(2) Whoever contravenes the provisions of this section shall be guilty of an offence punishable\nwith imprisonment for a term which may extend to two years or with fine or with both."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Privileged information and documents",
      "content": "_ (1) Any information or document obtained\npursuant to this Ordinance or the Convention shall be privileged.\n(2) Information and documents shall not be privileged to the extent that these are required to\nbe disclosed or communicated for the purposes of an emergency involving public safety.\n(3) No person in possession of privileged information or document shall knowingly, without\nthe written consent of the person from whom they were obtained communicate them or allow them to\nbe communicated to any person, or allow any person to have access thereto, except-\n(a)     for the purpose of the enforcement of this Ordinance or of giving effect to the\nConvention; or\n(b)     pursuant to an obligation of the Federal Government under the Convention.\n(4) Notwithstanding anything contained in any law no person shall be required in connection\nwith any legal proceedings, to produce any statement or other record containing any privileged\ninformation or document, or to give evidence relating to them, unless the proceedings relate to the\nenforcement of this Ordinance.\n(5) Whoever contravenes the provisions of sub-section (3) shall be guilty of an offence\npunishable with imprisonment for a term which may extend to six months or with fine which may\nextend to ten thousand rupees or with both."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Registration",
      "content": "_ (1) The National Authority may directly or through notice require an\nindividual or organisation involved in production, processing, consumption, transfer, import or export\nof any scheduled chemical or any discrete organic chemical not being a schedule chemical, or a\nchemical containing elements of phosphorus, sulfur, or fluorine, to register themselves with the\nNational Authority or any other office as may be prescribed within a specified time period.\n(2) Whoever contravenes the provisions of this section shall be guilty of an offence punishable\nwith imprisonment for a term which may extent to two years or with fine or with both."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Power to enter a premises and search, remove or immobilise objects",
      "content": "(1) If the\nNational Authority has reasonable cause to believe that-\n(a)     an object is on a premises to which the public has access or which are occupied\nby a person who consents to action being taken under this sub-section; and\n(b)     the object is a chemical weapon,\nthe National Authority may authorise any person to enter the premises and to search them.\n(2) If a magistrate is satisfied on information on oath that there is reasonable cause to believe\nthat an object is on premises and that it is a chemical weapon he may issue a warrant in writing\nauthorising a person acting under the authority of the National Authority to enter the premises, if\nnecessary, by force at any time within one month from the time of the issue of the warrant and to search\nthem.\n(3) A person who acts under an authorisation given under sub-section (1) or sub-section (2)\nmay take with him such other persons and such equipment as appear to him to be necessary.\n(4) If a person enters premises under an authorisation given under sub-section (1) or sub-section\n(2), and the object is found then he may make the object safe and-\n(a)     he may seize and remove it, if it is reasonably practicable to do so; or\n(b)     he may, in any other case, affix a warning on the object or on something in\nconspicuous position near the object, stating that the object is not to be moved\nor interfered with before a date specified in the warning."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Extension to external territories",
      "content": "_ The Provision of this Ordinance shall also apply to\nany offence committed by__\n(a)    any citizen of Pakistan or any person in the service of Pakistan in any place\nwithout and beyond Pakistan; and\n(b)    any person on any ship or aircraft registered in Pakistan wherever it may be."
    }
  ],
  "definitions": [
    {
      "term": "assistance inspection",
      "definition": "an inspection conducted pursuant to Parts II and XI of the Verification Annex;",
      "source_provision": "sec2"
    },
    {
      "term": "challenge inspection",
      "definition": "an inspection conducted pursuant to Parts II and X of the Verification Annex;",
      "source_provision": "sec2"
    },
    {
      "term": "Convention",
      "definition": "the convention on the Prohibition of the Development, Production, stockpiling and use of Chemical Weapons and on their Destruction signed at Paris on the 13th January, 1993;",
      "source_provision": "sec2"
    },
    {
      "term": "National Authority",
      "definition": "the National Authority designated as such under section 9;",
      "source_provision": "sec2"
    },
    {
      "term": "precursor",
      "definition": "any chemical reactant which takes part at any stage in the production by whatever method of a toxic chemical and includes any key component of a binary or multi-component chemical system;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "riot control agent",
      "definition": "any chemical which is not a scheduled chemical, which can produce rapidly in humans sensory irritation or disabling physical effects which disappear within a short time following termination of exposure;",
      "source_provision": "sec2"
    },
    {
      "term": "routine inspection",
      "definition": "an inspection conducted pursuant to Parts II to IX of the Verification Annex;",
      "source_provision": "sec2"
    },
    {
      "term": "scheduled chemical",
      "definition": "a chemical listed in Schedules I or, as the case may be, Schedule II or Schedule III to this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "toxic chemical",
      "definition": "any chemical which through its chemical action on life processes can cause death, temporary incapacitation or permanent harm to humans or animals and includes all such chemicals, regardless of their origin or of their method of production, and regardless of whether they are produced in facilities, in munitions or elsewhere; and",
      "source_provision": "sec2"
    },
    {
      "term": "Verification Annex",
      "definition": "the Verification Annex to the Convention and portions of which are reproduced in Schedule IV to this Ordinance.",
      "source_provision": "sec2"
    }
  ]
}
