{
  "id": "pk-civii-commotion-compensation-fund-repeal-act-1972",
  "type": "statute",
  "title": "CiviI Commotion Compensation Fund (Repeal) Act, 1972",
  "title_en": "CiviI Commotion Compensation Fund (Repeal) Act, 1972",
  "short_name": "CCCFA",
  "status": "repealed",
  "issued_date": "1972-09-09",
  "in_force_date": "1972-09-09",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FuaJ0%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of CiviI Commotion Compensation Fund (Repeal) Act, 1972 (XI of 1972) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short Title and commencement",
      "content": "(1) Short title and commencement. This Act may be\ncalled the Civil Commotion Compensation Fund (Repeal) Act, 1972.\n(2) It shall come into force at once and shall be deemed to have taken effect on the third day of\nAugust, 1972."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Repeal are Savings",
      "content": "(1) The Civil Commotion Compensation Fund Ordinance, 1971 (XXI\nof 1971) hereinafter referred to as the said Ordinance, is hereby repealed.\n(2) Notwithstanding the repeal of the said Ordinance, every insurer shall pay into the Fund\nestablished thereunder, within such time as the Federal Government may specify in this behalf,—\n(a)        such part of the surcharge collected by him under subsection (1) of section 5 of\nOrdinance as has not already been so paid; and\n(b)        Such part of the amount payable by him under section 6 of the said Ordinance\nas has not already been so paid.\n(3) No compensation shall be payable out of the Fund established under the said Ordinance and\nall moneys paid into the Fund shall, after payment out of the Fund of the loans and advances obtained\nunder section 7 of the said Ordinance, be credited to the Federal Consolidated Fund.\n(4) Any sum payable in pursuance of sub-section (2) into the Fund established under the said\nOrdinance shall be recoverable as an arrear of land revenue."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. [Repeal of Ordinance XXXII of 1972.] Omitted by the Federal Laws (Revision and",
      "content": "Declaration) Ordinance, 1981 (XXVII of 1981) s. 3 and Sch„ II.\n____________\nDate: 16-09-2024\n1\nFor Statement of Objects and Reasons, see Gaz. of P., 1972, Ext., Pt. III, p. 402."
    }
  ],
  "definitions": []
}
