{
  "id": "pk-code-of-civil-procedure-cpc-1908-under-review",
  "type": "statute",
  "title": "Code of Civil Procedure (CPC) , 1908 (Under Review)",
  "title_en": "Code of Civil Procedure (CPC) , 1908 (Under Review)",
  "short_name": "COCPR",
  "status": "in_force",
  "issued_date": "1908-03-20",
  "in_force_date": "1908-03-20",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apeb-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Code of Civil Procedure (CPC) , 1908 (Under Review) (V of 1908) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Savings",
      "content": "(1) In the absence of any specific provision to the contrary, nothing in this Code\nshall be deemed to limit or otherwise affect any special or local law now in force or any special\njurisdiction or power conferred, or any special form of procedure prescribed, by or under any other\nlaw for the time being in force.\n(2) In particular and without prejudice to the generality of the proposition contained in\nsub-section (1), nothing in this Code shall be deemed to limit or otherwise affect any remedy which a\nland-holder or landlord may have under any law for the time being in force for the recovery of rent of\nagricultural land from the produce of such land."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Application of the Code to the Revenue Courts",
      "content": "(1) Where any Revenue Courts are\ngoverned by the provisions of this Code in those matters of procedure upon which any special\nenactment applicable to them is silent, the 1[Provincial Government] 2[* * *] may, by notification\nin the 1[official Gazette], declare that any portions of those provisions which are not expressly made\napplicable by this Code shall not apply to those Courts, or shall only apply to them with such\nmodifications as the 1[Provincial Government] 3[* * *] may prescribe.\n(2) “Revenue Court” in subsection (1) means a Court having jurisdiction under any local law\nto entertain suits or other proceedings relating to the rent, revenue or profits of land used for\nagricultural purposes, but does not include a Civil Court having original jurisdiction under this Code\nto try such suits or proceedings as being suits or proceeding of a civil nature.\n4\n[6. Pecuniary Jurisdiction.__Save in so far as is otherwise expressly provided, nothing herein\ncontained shall operate to give any Court jurisdiction over suits the amount or value of the subject\nmatter of which exceeds the pecuniary limits, if any, of its ordinary jurisdiction].\n7. 5[* *              *          *          *           *          *]"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. [Presidency Small Cause Courts.] Omitted by A.O., 1949",
      "content": "JURISDICTION OF THE COURTS AND Res Judicata"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Courts to try all civil suits unless barred. The Courts shall (subject to the provisions herein",
      "content": "contained) have jurisdiction to try all suits of a civil nature excepting suits of which their cognizance\nis either expressly or impliedly barred.\n1\nSubs. by Adaptation Order, 1937.\n2\nThe words “with the previous sanction of the G.G. in C.” omitted by the Devolution Act No. XXXVIII of 1920, s.2 and 1st Sch., Pt. I.\n3\nThe words “with the sanction aforesaid” omitted by Act No. XXXVIII of 1920, s.2 and 1st Sch., Pt. I.\n4\nSubs. by Act XIX of 2023, s.2.\n5\nOmitted by Act VII of 2020, s. 5.\nExplanation.__ A suit in which the right to property or to an office is contested is a suit of a\ncivil nature, notwithstanding that such right may depend entirely on the decision of questions as to\nreligious rites or ceremonies."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Stay of suit. No Court shall proceed with the trial of any suit in which the matter in issue",
      "content": "is also directly and substantially in issue in a previously instituted suit between the same parties, or\nbetween parties under whom they or any of them claim litigating under the same title where such suit\nis pending in the same or any other Court in 1[Pakistan] having jurisdiction to grant the relief claimed,\nor in any Court beyond the limits of 1[Pakistan] established or continued by 2[the 3[Federal\nGovernment] 4* * *] and having like jurisdiction, or before 5[the Supreme Court].\nExplanation.__ The pendency of a suit in a foreign Court does not preclude the Courts in\n1\n[Pakistan] from trying a suit founded on the same cause of action."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Res Judicata. No Court shall try suit or issue in which the matter directly and substantially",
      "content": "in issue has been directly and substantially in issue in a former suit between the same parties, or\nbetween parties under whom they or any of them claim, litigating under the same title, in a Court\ncompetent to try such subsequent suit or the suit in which such issue has been subsequently raised, and\nhas been heard and finally decided by such Court.\nExplanation I.__ The expression \"former suit\" shall denote a suit which has been decided prior\nto the suit in question whether or not it was instituted prior thereto.\nExplanation II.__ For the purposes of this section, the competence of a Court shall be\ndetermined irrespective of any provisions as to a right of appeal from the decision of such Court.\nExplanation III.__ The matter above referred to must in the former suit have been alleged by\none party and either denied or admitted, expressly or impliedly, by the other.\nExplanation IV.__ Any matter which might and ought to have been made ground of defence or\nattack in such former suit shall be deemed to have been a matter directly and substantially in issue in\nsuch suit.\nExplanation V.__ Any relief claimed in the plaint, which is not expressly granted by the decree,\nshall, for the purposes of this section, be deemed to have been refused.\nExplanation VI.__ Where persons litigate bona fide in respect of a public right or of a private\nright claimed in common for themselves and others, all persons interested in such right shall, for the\npurposes of this section, be deemed to claim under the persons so litigating.\n6[12. Bar to further suit.__ (1)] Where a plaintiff is precluded by rules from instituting a\nfurther suit in respect of any particular cause of action, he shall not be entitled to institute a suit in\nrespect of such cause of action in any Court to which this Code applies.\n1\nSubs. by the Central laws (Statute Reform) Ordinance, No. XXI of 1960, s. 3 and 2nd Sch. (with effect from the 14th October, 1955).\n2\nSubs. by Adaptation Order, 1937.\n3\nSubs. by Federal Adaptation Order, 1975. Art.2 and Table.\n4\nThe words “or the Crown Representative” omitted by Adaptation Order, 1949.\n5\nSubs. by Adaptation Order, 1961, Art. 2 and Sch. (with effect from the 23rd March 1956).\n6\nS.12 was renumbered as sub-section (1) of that section by the Code of Civil Procedure (Amdt.) Ordinance, No. X of 1980, s. 2\n1\n[(2) Where a person challenges the validity of a judgment, decree or order on the plea of fraud,\nmis-representation or want of jurisdiction, he shall seek his remedy by making an application to the\nCourt which passed the final judgment, decree or order and not by a separate suit.]"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. When foreign judgment not conclusive. A foreign judgment shall be conclusive as to any",
      "content": "matter thereby directly adjudicated upon between the same parties or between parties under whom\nthey or any of them claim litigating under the same title except__\n(a)        Where it has not been pronounced by a Court of competent Jurisdiction ;\n(b)        Where it has not been given on the merits of the case;\n(c)        Where it appears on the face of the proceedings to be founded on an incorrect\nview of international law or a refusal to recognise the law of 2[Pakistan] in cases\nin which such law is applicable;\n(d)        Where the proceedings in which the Judgment was obtained are opposed to\nnatural justice ;\n(e)        Where it has been obtained by fraud ;\n(f)        Where it sustains a claim founded on a breach of any law in force in 2[Pakistan]."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Presumption as to foreign judgment. The Court shall presume, upon the production of",
      "content": "any document purporting to be a certified copy of a foreign Judgment, that such Judgment was\npronounced by a Court of competent Jurisdiction, unless the contrary appears on the record ; but such\npresumption may be displaced by proving want of jurisdiction."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Suits to be instituted where subject",
      "content": "matter situate. Subject to the pecuniary or other\nlimitations prescribed by any law, suits__\n(a)        for the recovery of immoveable property with or without rent or profits,\n(b)        for the partition of Immoveable property,\n(c)        for foreclosure, sale or redemption in the case of a mortgage of or charge upon\nimmoveable property,\n(d)        for the determination of any other right to or interest in immoveable property,\n(e)        for compensation for wrong to immoveable property,\n(f)        for the recovery of moveable property actually under distraint or attachment,\n1\nSub-section (2) added by the Code of Civil Procedure (Amdt.) Ordinance, No. X of 1980, s.2.\n2\nSubs. by the Central Laws (statute Reform) Ordinance, No. XXI of 1960, s.3 and 2nd Sch. (with effect from the 14th October, 1955).\nshall be instituted in the Court within the local limits of whose jurisdiction the property is situate,\n1\n[, or, in the case of suits referred to in clause (c), at the place where the cause of action has wholly or\npartly arisen]:\nProvided that a suit to obtain relief respecting, or compensation for wrong to, immoveable\nproperty held by or on behalf of the defendant may, where the relief sought can be entirely obtained\nthrough his personal obedience, be instituted either in the Court within the local limits of whose\njurisdiction the property is situate 1[,or, in the case of suit referred to in clause (c), at the place where\nthe cause of action has wholly or partly arisen], or in the Court within the local limits of whose\njurisdiction the defendant actually and voluntarily resides, or carries on business, or personally works\nfor gain.\nExplanation.__ In this section \"property\" means property situate in 2[Pakistan]."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Suits for immoveable property situate within jurisdiction of different Courts. Where",
      "content": "a suit is to obtain relief respecting, or compensation for wrong to, immoveable property situate with in\nthe jurisdiction of different Courts, the suit may be instituted in any Court within the local limits of\nwhose jurisdiction any portion of the property is situate:\nProvided that, in respect of the value of the subject-matter of the suit, the entire claim is\ncognizable by such Court."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Place of institution of suit where local limits of jurisdiction, of Courts are",
      "content": "uncertain.__ (1) Where it is alleged to be uncertain within the local limits of the jurisdiction of which\nof two or more Courts any immoveable property is situate, any one of those Courts may, if satisfied\nthat there is ground for the alleged uncertainty, record a statement to that effect and thereupon proceed\nto entertain and dispose of any suit relating to that property, and its decree in the suit shall have the\nsame effect as if the property were situate within the local limits of its Jurisdiction :\nProvided that the suit is one with respect to which the Court is competent as regards the nature\nand value of the suit to exercise Jurisdiction.\n(2) Where a statement has not been recorded under subs-section (1), and an objection is taken\nbefore an appellate or revisional Court that a decree or order in a suit relating to such property was\nmade by a Court not having jurisdiction where the property is situate, the appellate or revisional Court\nshall not allow the objection unless in its opinion there was, at the time of the institution of the suit, no\nreasonable ground for uncertainty as to the Court having jurisdiction with respect thereto and there has\nbeen a consequent failure of Justice."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Suits for compensation for wrongs to person or moveables. Where a suit is for",
      "content": "compensation for wrong done to the person or to moveable property, if the wrong was done within the\nlocal limits of the Jurisdiction of one Court and the defendant resides, or carries on business, or\npersonally works for gain, within the local limits of the Jurisdiction of another Court, the suit may be\ninstituted at the option of the plaintiff in either of the said Courts.\n1\nIns. by the Code of Civil Procedure (Amdt.) Ordinance, No. XLIV of 1962, s.6.\n2\nSubs. by the Central Laws (Statute Reform) ordinance, No. XXI of 1960, s.3 and 2nd Sch. (with effect from the 14th October, 1955).\nIllustrations\n(a)        A, residing in 1[Karachi], beats B in 2[Quetta]. B may sue A either in 2[Quetta] or\n1\n[Karachi].\n(b)        A, residing in 1[Karachi] publishes in 2[Quetta] statements defamatory of B. B may\nsue A either in 2[Quetta] or in 1[Karachi]."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Other suits to be instituted where defendants reside or cause of action arises. Subject to",
      "content": "the limitations aforesaid, every suit shall be instituted in a Court within the local limits of whose\njurisdiction__\n(a)        the defendant, or each of the defendants where there are more than one, at the time\nof the commencement of the suit, actually and voluntarily resides, or carries on\nbusiness, or personally works for gain ; or\n(b)        any of the defendants, where there are more than one, at the time of the\ncommencement of the suit, actually and voluntarily resides, or carries on business,\nor personally works for gain, provided that in such case either the leave of the Court\nis given, or the defendants who do not reside, or carryon business, or personally\nwork for gain, as aforesaid, acquiesce in such institution ; or\n(c)        the cause of action, wholly or in part, arises.\nExplanation I.__ Where a person has permanent dwelling at one place and also a temporary\nresidence at another place, he shall be deemed to reside at both places in respect of any cause of\naction arising at the place where he has such temporary residence.\nExplanation II.__ A corporation shall be deemed to carry on business at its sole or principal office\nin 1[Pakistan] or, in respect of any cause of action arising at any place where it has also a subordinate office,\nat such place.\nIllustrations\n(a)        A is a tradesman in 2[Lahore]. B carries on business in 1[Karachi], B, by his agent\nin 2[Lahore], buys goods of A and requests A to deliver them to the 1[Pakistan\nInternational Airways]. A delivers the goods accordingly in 2[Lahore]. A may sue\nB for the price of the goods either in 2[Lahore] where the cause of action has arisen,\nor in 1[Karachi], where B carries on business.\n(b)        A resides at 1[Murree], B at 2[Lahore], and C at 1[Karachi], A, B and C being\ntogether at 1[Bahawalpur], B and C make a joint promissory note payable on\ndemand, and deliver it to A. A may sue B and C 1[Bahawalpur,] where the cause of\naction arose. He may also sue them at 2[Lahore], where B resides, or at 1[Karachi],\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, No. XXI of 1960, s.3 and 2nd Sch. (with effect from the 14th October, 1955).\n2\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, No. XXVII of 1981, s.3 and 2nd Sch.\nwhere C resides; but in each of these cases, if the non­resident defendant objects, the suit\ncannot proceed without the leave of the Court."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Objections to jurisdiction. No objection as to the place of suing shall be allowed by any appellate or",
      "content": "revisional Court unless such objection was taken in the Court of first instance at the earliest possible opportunity and\nin all cases where issues are settled at or before such settlement, and unless there has been a consequent failure of\njustice."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Power to transfer suits which may be instituted in more than one Court. Where a suit may be",
      "content": "instituted in any one of two or more Courts and is instituted in one of such Courts, any defendant, after notice to the\nother parties, may, at the earliest possible opportunity and in all cases where issues are settled at or before such\nsettlement, apply to have the suit transferred to another Court, and the Court to which such application is made,\nafter considering the objections of the other parties (if any), shall determine in which of the several Courts having\njurisdiction the suit shall proceed."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. To what Court application lies",
      "content": "(1) Where the several Courts having jurisdiction are subordinate to\nthe same Appellate Court, an application under section 22 shall be made to the Appellate Court.\n(2) Where such Courts are subordinate to different appellate Courts but to the same High Court, the\napplication shall be made to the said High Court.\n(3) Where such Courts are subordinate to different High Courts, the application shall be made to the High\nCourt within the local limits of whose jurisdiction the Court in which the suit is brought is situate."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. General power of transfer and with drawl",
      "content": "(1) On the application of any of the parties and after\nnotice to the parties and after hearing such of them as desire to be heard, or of its own motion without such notice,\nthe High Court or the District Court may at any stage__\n(a)        transfer any suit, appeal or other proceeding pending before it for trial or disposal to any\nCourt subordinate to it and competent to try or dispose of the same, or\n(b)        withdraw any suit, appeal or other proceeding pending in any Court subordinate to it, and\n(i)        try or dispose of the same ; or\n(ii)       transfer the same for trial or disposal to any Court subordinate to it and competent\nto try or dispose of the same ; or\n(iii)      retransfer the same for trial or disposal to the Court from which it was withdrawn.\n(2) Where any suit or proceeding has been transferred or withdrawn under sub-section (1), the Court which\nthereafter tries such suit may, subject to any special directions in the case of an order of transfer, either retry it or\nproceed from the point at which it was transferred or withdrawn.\n(3) For the purposes of this section, Courts of Additional and Assistant Judges shall be deemed to subordinate\nto the District Court.\n(4) The Court trying any suit transferred or withdrawn under this section from a Court of Small Causes shall,\nfor the purposes of such suit, be deemed to be a Court of Small Causes.\n1[24A. Appreance of parties on transfer of suits, etc.__ (1) Where any suit is transferred under section 22,\nor any suit, appeal or other proceeding is transferred or withdrawn under sub-section (1) of section 24 on the\napplication of a party, the Court ordering the transfer or withdrawal shall fix a date for the appearance of the parties\nbefore itself, if the suit, appeal or other proceeding is to be tried or disposed of by itself, or before the Court to which\nthe case is so transferred.\n1\nS.24A ins. by the Code of Civil Procedure (Amdt.) Ordinance, No. XLIV of 1962, s.7.\n(2) Where any suit, appeal or other proceeding is transferred from one Court to another, otherwise than on\nthe application of a party, the parties thereto shall appear before the Court from which the suit, appeal or other\nproceedings is to be transferred, on the day already fixed for their appearance before that Court, and such Court\nshall then communicate the order of transfer to such parties and direct them to appear before the Court to which the\nsuit, appeal or other proceeding is to be transferred, either on the same day, or on such earliest day as may be\nreasonable having regard to the distance at which the other Court is located.]\n1"
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. [Power of Provincial Government to transfer suits.] Omitted by the Central Laws (Statue Reform)",
      "content": "Ordinance, 1960 (XXI of 1960), s.3 and 2nd Sch. (with effect from the 14th October, 1955).\n2\n[26. Institution of suit.__ Every suit shall be instituted by presentation of a plaint or in such other manner\nas may be prescribed.]\n2\n[26A-26D.               *            *            *            *            *            *            *]"
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Summons to defendants. Where a suit has been duly instituted, a summons may be issued to the",
      "content": "defendant to appear and answer the claim 2[* * *] and may be served in manner prescribed.\n2[27A.\n*            *            *            *            *            *            *]"
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Service of summons where defendant resides in another Province",
      "content": "(1) A Summons may be sent for\nservice in another Province to such Court and in such manner as may be prescribed by rules in force in that Province.\n(2) The Court to which such summons is sent shall, upon receipt thereof, proceed as if it had been issued by\nsuch Court and shall then return the summons to the Court of issue together with the record (if any) of its proceedings\nwith regard thereto.\n3[29. Service of foreign summonses. Summonses 2[and other processes] issued by any Civil\n1\nS. 25 was amended by Adaptation Order, 1937.\n2\nSubs. and Omitted by Act No. XIX of 2023, s.3.\n3\nProvisions of s.29 have been applied to__\n(i)the Civil Courts in the Federation of Malaya in so far as the Chief Commissioner’s Province of Baluchistan and the Capital of the Federation are concerned, see Gaz. of P.,\n1949, Pt.I, P.258 and ibid., Pt.II A, P. 68\n(ii)all Civil and Revenue Courts of India; and service by any Civil or Revenue Court of India of any summons issued under the Code of Civil Procedure, 1908, by a Court of\nthe Province of Sind shall be deemed to be valid, see Sind Government Gazette, Extraordinary, dated 3rd July, 1952. Pt. I, P. 437.\n(iii)all Civil and Revenue Courts in India and Service by such Courts of any summons issued under the said Code by a Court in the N.W.F.P, Baluchistan or Karachi shall be\ndeemed to be valid service, see N.W.F.P Government Gazette, 1952, Pt. I, P. 248 and Gaz., of P. 1952, Pt. I, P. 119 and ibid., Pt. VI, p. 126.\n(iv)all Civil and Revenue Courts in India; and that service by such Courts of any summons issued under the said Code by a Court in Khairpur State shall be deemed to be valid\nservice, see Khairpur State Gazette, Ext., 1952, dated the 18th September, 1952.\n(v)all Civil and Revenue Courts in India; and service by such Courts of any summons issued under the said Code by a Court in the Bahawalpur State shall be deemed to be\nvalid service, see Bahawalpur Govt. Gazette, dated the 2nd October, 1952.\n(vi)all Civil and Revenue Courts of India; and service by any civil or Revenue Court in India, within whose jurisdiction the person to be served resides of any summons issued\nby a Court under the said Code shall be deemend to be valid service, see Punjab Gazette, Ext., 1951, dated the 1st September, 1951, p. 1743.\n(vii)all Civil and Revenue Courts in the Union of Burma, in respect of Baluchistan; and service by such Courts of any summons issued under the said Code by a Court in\nBaluchistan shall be deemed to be valid service see Gaz. of P., Ext., 1954, p. 1873.\n(viii)all Civil and Revenue Courts in the Union of Burma, in respect of Karachi; and service by such Courts of any summons issued under the said Code by a Court in Karachi\nshall be deemed to be valid service, see Gaz. of p., Extra., 1954, p. 1997.\n(ix)all Civil and Revenue Courts of the Union of Burma; and service by such Courts of Summonss issued under the said Code by A Court in East Bengal shall be deemed to\nbe valid service, see Dacca Gazette, Ext., dated 18th October, 1954, Pt. I, p. 3053.\n(x)all Civil and Revenue Courts of the Union of Burma; and service by such Courts of any summons issued under the said Code by a Court in the N.W.F.P, shall be deemed\nto be valid service, see N.W.F.P, Gazette, 1954, Pt. I, p. 523.\n(xi)all Civil and Revenue Courts of the Union of Burma; and service by such Courts of any summons issued under the said Code by a Court in the Province of Punjab, shall be\ndeemed to be valid service, see Gaz. of Punjab, 1954, Pt. I, p. 843.\n(xii)all Civil and Revenue Courts of the Union of Burma; and service by such Courts of any summons issued under the said Code by a Court in the Province of Sind, shall be\ndeemed to be valid service, w.e.f. 18th October, 1954, see Gaz. of Sind, 1954, pt I, p. 940.\n(xiii)all Civil and Revenue Courts in the Federal Republic of Germany; and service by such Courts of summons issued under the said Code by a Court in Baluchistan shall be\ndeemed to be valid service, see Gaz. of P. 1955, Pt. I, p. 126.\n(xiv)the summonses issued by any Civil or Revenue Courts in Pakistan may be sent to the Courts in the Union of Burma and served as if they had been issued by such Courts,\nsee Gaz of 1955, P.I, p. 143.\n(xv)service by any Court situated in Pakistan, of any summons issued by a Court of the Union of Burma shall be deemed to be valid service, see Gaz. of P., 1955, Pt. I, p. 143.\n(xvi)all Civil and Revenue Courts in the Federal Republic of Germany an services by such Courts of any summons issued under the said Code by a Court in Karachi, shall be\ndeemed to be valid service, with effect on and from the 1st June, 1955, see Gaz. Of P., 1955, Pt. VI, p. 102.\n(xvii)all Civil and Revenue Courts in the Federal Republic of Germany; and service by such Courts of any summons issued under the said Code by a Court in the Province of\nEast Bengal shall be deemed to be valid service see Dacca Gazette, 1955, Pt. I, p. 1051.\n(xviii)all Civil Courts in Switzerland and the service by such Courts of any summons issued under the Code (C.Pr.C.) by a Court in the Province of W. Pakistan shall be deemed\nto be valid service, see W.P. Gaz., 1959, Ext. p. 843.\n2\nIns. by the Code of Civil Procedure (Amdt.) Act, 1940 (34 of 1940).\nor Revenue Court situate 1[outside 2[Pakistan]] may be sent to the Courts 1[in 2[Pakistan]] and served\nas if they 3[were summonses] issued by such Courts:\n4\n[Provided that the Courts issuing such summonses 5[or processes] have been established or\ncontinued by the authority of the 6[Federal Government] 7[* * *] or that the Provincial Government\n8\n[of the Province in which such summonses or processes are] to be served has by notification in the\nofficial Gazette declared the provisions of this section to apply to 9[such Courts].]"
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Power to order discovery and the like. Subject to such conditions and limitations as may",
      "content": "be prescribed, the Court may, at any time, either of its own motion or on the application of any party, __\n(a)        make such orders as may be necessary or reasonable in all matters relating to\nthe delivery and answering of interrogatories, the admission of documents and\nfacts, and the discovery, inspection, production, impounding and return of\ndocuments or other material objects producible as evidence ;\n(b)        issue summonses to persons whose attendance is required either to give\nevidence or to produce documents or such other objects as aforesaid ;\n(c)        order any fact to be proved by affidavit."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Summons to witness. The provisions in sections 27, 28 and 29 shall apply to summonses",
      "content": "to give evidence or to produce documents or other material objects."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Penalty for default. The Court may compel the attendance of any person to whom a",
      "content": "summons has been issued under section 30 and for that purpose may___\n(a)        issue a warrant for his arrest ;\n(b)        attach and sell his property ;\n(c)        impose a fine upon him not exceeding 10[two thousand] rupees ;\n(d)        order him to furnish security for his appearance and in default commit him to\n10\n[* * *] prison."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Judgment and decree. The Court, after the case has been heard, shall pronounce judgment,",
      "content": "and on such judgment 11[* * *] a decree shall follow.\n1\nSubs. by the Adaptation of Central Acts and Ordinances Order, 1949 (Order No. 4 of 1949) Art. 3 and Sch.\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, No. XXI of 1960, s.3 and 2nd Sch. (w. e. f the 14th October, 1955).\n3\nSubs. by the Code of Civil Procedure (Amdt.) Act No. XXXIV of 1940, s. 2(1) (a) (ii).\n4\nSubs. by Adaptation Order, 1937.\n5\nIns. by Act No. XXXIV of 1940, s. 2 (1) (b) (i).\n6\nSubs. by Federal Adaptation Order, 1975, Art. 2 and Table.\n7The words “or of the Crown Representative” omitted by Adaptation Order, 1949.\n8\nSubs. by Act No. XXXIV of 1940, s.2 (1) (b) (ii) The substitution with the omission of the words “or processes” is to be deemed to have taken effect on\nthe 1st day of April, 1937.\n9\nSubs. ibid. s. 2 (1) (b) (iii) The substitution is to be deemed to have taken effect on the 1st April, 1937.\n10\nSubs. & omitted by Act XIV of 1994, s. 6.\n11\nOmitted by Act No. XIX of 2023, s. 7."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Interest",
      "content": "(1) Where and in so far as a decree is for the payment of money, the Court may,\nin the decree, order interest at such rate as the Court deems reasonable to be paid on the principal sum\nadjudged, from the date of the suit to the date of the decree, in addition to any interest adjudged on\nsuch principal sum for any period prior to the institution of the suit, with further interest at such rate\nas the Court deems reasonable on the aggregate sum so adjudged, from the date of the decree to the\ndate of payment, or to such earlier date as the Court thinks fit.\n(2) Where such a decree is silent with respect to the payment of further interest on such\naggregate sum as aforesaid from the date of the decree to the date of payment or other earlier date, the\nCourt shall be deemed to have refused such interest, and a separate suit therefore shall not lie.\n1[34A. Interest on public dues.__ (1) Where the Court is of opinion that a suit was instituted\nwith intent to avoid the payment of any public dues payable by the plaintiff or on his behalf, the Court\nmay, while dismissing such suit, make an order for payment of interest on such public dues at the rate\nof two per cent, above the prevailing bank rate.\n(2) Where the court is of opinion that the recovery of any public dues from the plaintiff was\nunjustified, the Court may, while disposing of the suit, make an order for payment of interest on the\namount recovered at the rate of two per cent, above the prevailing bank rate.\nExplanation.__ In this section,__\n(a)        “bank rate” means the bank rate determined and made public under the\nprovisions of the State Bank of Pakistan Act, 1956 (XXXIII of 1956) ; and\n(b)        “public dues” includes the dues of any bank owned by the Federal Government\nor of any corporation or undertaking owned or controlled by the Federal\nGovernment or a Provincial Government or of any local authority.]\nInterest, etc. on dues of banking company.__ Where and in so far as a decree is\n2[34B.\nfor payment of money due to a banking company in repayment of a loan advanced by it, the Court\nshall, in the decree, provide for interest or return, as the case may be, on the judgment debt from the\ndate of decree till payment__\n(a)        in the case of interest-bearing loans, for interest at the contracted rate or at the\nrate of two per cent above the bank rate, whichever is the higher ;\n(b)        in the case of loans given on the basis of mark-up in price, lease, hire-purchase\nor service charges, for the contracted rate of mark-up, rental, hire or service\ncharges, as the case may be, or at the latest rate of the banking company for\nsimilar loans, whichever is the higher ; and\n(c)        in the case of loans given on the basis of participation in profit and loss, for\nreturn at such rate, not being less than the annual rate of profit for the preceding\nsix months paid by the banking company on term deposits of six months\naccepted by it on the basis of participation in profit and loss, as the court may\nconsider just and reasonable in the circumstances of the case, keeping in view\n1\nNew section 34A was ins. by the Code of Civil Procedure (Amdt.) Ordinance, No. X of 1980) s.3.\n2\nSection 34B ins. by the Code of Civil Procedure (Amdt.) Ordinance, No. LXIII of 1980, s. 2.\nthe profit-sharing agreement entered into between the banking company and\nExplanation.__ In this section in clause (a), “bank rate” has the same meaning as in section\n34A.].\n1[35. Costs.__ (1) Subject to such conditions and limitations, as may be prescribed, and to the\nprovisions of any law for the time being in force,__\n(i)        a party to any proceedings shall, before the announcement of final order,\njudgment or decree, file in the prescribed form, detail of actual costs of\nlitigation, including but not limited to court fee, stamp fee, fee paid to counsel\nand all other ancillary or incidental expenses thereto;\n(ii)       the Court shall award the actual costs of litigation under clause (i) to the\nsuccessful party with markup not exceeding the prescribed limit per annum, as\nnotified by the State Bank of Pakistan, at the time of passing the order,\njudgement or decree;\n(iii)      the costs other than those mentioned in clause (i) shall be in the discretion of the\nCourt; and\n(iv)       the Court shall have full power to determine out of what property such costs are\nto be paid and recovered and to give all necessary directions for the purpose\naforesaid.\n(2) The fact the Court has no jurisdiction in respect of the proceedings shall be no bar to the\nexercise of such powers under this section."
    },
    {
      "provision_ref": "sec35a",
      "section": "35A",
      "title": "Section 35A. Adjournment costs",
      "content": "If, on the date fixed for hearing in any proceedings, a party to the\nproceedings or any other person, despite service of notice, fails to appear or comply with any order of\nthe Court or mandatory provision of the Code or any other law for the time being in force, seeks an\nadjournment for such purpose, the Court shall, for sufficient cause and reasons to be recovered, grant\nsuch adjournment on the condition that such party or person shall pay to the other party, costs of\nadjournment which shall not be less than five thousand Rupees per adjournment or such higher amount\nas may be prescribed from time to time:\nProvided that if the Court is satisfied that the adjournment being sought is on account of\nunavoidable reasons beyond the control of the party concerned, which reasons shall be recorded by the\nCourt, the Court may grant adjournment without imposing adjournment cost:\nProvided further that if the Court finds that there is a tendency of seeking repeated\nadjournments by any party on such grounds, the Court may not grant adjournment without imposing\nthe adjournment costs as the Court may deem fit."
    },
    {
      "provision_ref": "sec35b",
      "section": "35B",
      "title": "Section 35B. Special costs",
      "content": "(1) If in any proceedings, the Court finds that any averment made by any\nparty is false or vexatious to the knowledge of such party, the Court shall award special costs to the\nopposite party against whom such averment has been made.\n1\nSubs. by Act No. XVII of 2017, s. 2.\n(2) The amount of any special costs awarded under sub-section (1) shall be taken into account\nin any subsequent suit for damages or compensation in respect of such claim or defence."
    },
    {
      "provision_ref": "sec35c",
      "section": "35C",
      "title": "Section 35C. General provisions as to costs",
      "content": "The Government shall not be liable to costs under\nsection 35, 35A and 35B.\nExplanation.__ In sections 35, 35A and 35B, the expression “proceedings” includes suit,\nappeal, review, revision, execution or any other proceedings and any matter incidental therto.]"
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Application to orders. The provisions of this Code relating to the execution of decrees",
      "content": "shall, so far as they are applicable, be deemed to apply to the execution of orders."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Definition of Court which passed a decree. The expression “Court which passed a",
      "content": "decree,” or words to that effect, shall, in relation to the execution of decrees, unless there is anything\nrepugnant in the subject or context, be deemed to include,__\n(a)   where the decree to be executed has been passed in the exercise of appellate\njurisdiction, the Court of first instance, and\n(b)   where the Court of first instance has ceased to exist or to have jurisdiction to\nexecute it, the Court which, if the suit wherein the decree was passed was\ninstituted at the time of making the application for the execution of the decree,\nwould have Jurisdiction to try such suit."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Court by which decree may be executed. A decree may be executed either by the Court",
      "content": "which passed it, or by the Court to which it is sent for execution."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Transfer of decree",
      "content": "(1) The Court which passed a decree may, on the application of the\ndecree-holder, send it for execution to another Court,__\n(a)     if the person against whom the decree is passed actually and voluntarily resides\nor carries on business, or personally works for gain, within the local limits of\nthe jurisdiction of such other Court, or\n(b)     if such person has not property within the local limits of the jurisdiction of the\nCourt which passed the decree sufficient to satisfy such decree and has property\nwithin the local limits of the jurisdiction of such other Court, or\n(c)     if the decree directs the sale or delivery of immoveable property situate outside\nthe local limits of the Jurisdiction of the Court which passed it, or\n(d)     if the Court which passed the decree considers for any other reason, which it\nshall record in writing, that the decree should be executed by such other Court.\n(2) The Court which passed a decree may of its own motion send it for execution to any\nsubordinate Court of competent jurisdiction."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Transfer of decree to Court in another Province. Where a decree is sent for execution",
      "content": "in another Province, it shall be sent to such Court and executed in such manner as may be prescribed\nby rules in force in that Province."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Results of execution proceeding to be certified. The Court to which a decree is sent for",
      "content": "execution shall certify to the Court which passed it the fact of such execution, or where the former\nCourt fails to execute the same the circumstances attending such failure.\n1[42. Powers of Court in executing transferred decree. __ (1)] The Court executing a decree\nsent to it shall have the same powers in executing such decree as if it had been passed by itself. All\npersons disobeying or obstructing the execution of the decree shall be punishable by such Court in the\nsame manner as if it had passed the decree. And its order in executing such decree shall be subject to\nthe same rules in respect of appeal as if the decree had been passed by itself.\n2\n[(2) Without prejudice to the generality of the foregoing provision, the Court executing a\ndecree sent to it shall have the following powers, namely:__\n(a)        power under section 39 to transfer the decree to another Court, if necessary;\n(b)        Power under sub-section (1) of section 50 to permit execution to proceed against\nthe legal representatives, of a deceased judgment debtor ;\n(c)        power under section 152 to correct clerical or arithmetical errors ;\n(d)        power under rule 16 of Order XXI to recognise the assignment of a decree ;\n(e)        power under sub rule (2) of rule 50 of Order XXI to grant leave to a decree\nholder to proceed against a person not already recognised as a partner in a firm\nin an execution proceeding against the firm ;\n(f)        power under clause (b) of sub-rule (1) of rule 53 of Order XXI to give notice of\nattachment of decree passed by another Court.]"
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Execution of decrees passed by British Courts in places to which this Part does not",
      "content": "extend or in foreign territory. Any decree passed by a Civil Court established in any 3[area in\nPakistan] to which the provisions relating to execution do not extend, 4[* * *] may, if it cannot be\nexecuted within the jurisdiction of the Court by which it was passed, be executed in manner herein\nprovided within the jurisdiction of any Court in 5[Pakistan]."
    },
    {
      "provision_ref": "sec644",
      "section": "644",
      "title": "Section 644. [Omitted]",
      "content": "1\nS. 42 renumbered as sub-section (1) of that section by the Code of civil Procedure (Amdt.) Ordinance, No. XLIV of 1962, s. 10.\n2\nSub-section (2) added ibid.\n3\nAmended by Adaptation Order, 1949 and the Central Laws (Statute Refrom) Ordinance, No. XXI of 1960, s.3 and 2nd Sch. (with effect from the 14th\nOctober, 1955).\n4\nThe words “or by Court established or continued by the authority of the Federal Government in any Acceding State,” omitted by the Federal Laws\n(Revision and Declration) Ordinance, No. XXVII of 1981, s. 3 and Second Sch.\n5\nSubs. by the Central Laws (Statute Reform) Ordinance, No. XXI of 1960, s. 3 and 2nd Sch. (w. e. f the 14th October, 1955).\n6\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, No. XXVII of 1981, s. 3 and Second Schedule.\n1[44A.\nExecution of decrees passed by Courts in the United Kingdom and other\nreciprocating territory.__ (1) Where a certified copy of a decree of any of the superior Courts\nof the United Kingdom or any reciprocating territory has been filed in a District Court, the decree\nmay be executed in 2[Pakistan] as if it had been passed by the District Court.\n(2) Together with the certified copy of the decree shall be filed a certificate from such superior\nCourt stating the extent, if any, to which the decree has been satisfied or adjusted and such certificate\nshall, for the purposes of proceedings under this section, be conclusive proof of the extent of such\nsatisfaction or adjustment.\n(3) The provisions of section 47 shall as from the filing of the certified copy of the decree apply\nto the proceedings of a District Court executing a decree under this section, and the District Court shall\nrefuse execution of any such decree, if it is shown to the satisfaction of the Court that the decree falls\nwithin any of the exceptions specified in clauses (a) to (f) of section 13.\nExplanation 1.__ “Superior Courts”, with reference to the United Kingdom, means the High\nCourt in England, the Court of Session in Scotland, the High Court in Northern Ireland the Court of\nChancery of the Country Palatine of Lancaster and the Court of Chancery of the County Palatine of\nDurham.\nExplanation 2.__ “Reciprocating territory” means 3[the United Kingdom and such other country\nor territory as] the 4[Federal Government] may, from time to time, by notification in the 5[official\nGazette], declare6 to be reciprocating territory for the purposes of this section; and \"superior Courts\",\nwith reference to any such territory, means such Courts as may be specified in the said notification.\nExplanation 3.__ “Decree”, with reference to a superior Court, means any decree or judgment\nof such Court under which a sum of money is payable, not being a sum payable in respect of taxes or\nother charges of a like nature or in respect of a fine or other penalty, and\n(a)      with reference to superior Courts in the United Kingdom, includes Judgments\ngiven and decrees made in any Court in appeals against such decrees or\nJudgments, but\n(b)      in no case includes an arbitration award, even if such award is enforceable as a\ndecree or Judgment.]\n1\nS. 44A ins. by the Code of Civil Procedure (Amdt.) Act No. VIII of 1937. s. 2.\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, No. XXI of 1960, s. 3 and 2nd Sch. (w. e. f the 14th October, 1955).\n3\nSubs. by the Civil and Criminal Procedure Codes (Amdt.) Ordinance, No. LXVII 1962, s. 3.\n4\nSubs. by Federal Adaptation Order, 1975, Art. 2 and Table.\n5\nSubs. by Adaptation Order, 1937.\n6\nThe Central Govt. has declared Fiji to be a reciprocating territory and the Supreme Court of Fiji to be a Superior Court of the territory for the purposes\nof this section, see Gaz. of P., 1949, Pt. I, p. 275.\nCertain Courts of Pakistan have been declared to be superior Courts for the purpose of Part I of the Foreign Judgments (Reciprocal Enforcement) Act,\n1933 (23 Geo. 5, ch, 13), see Gaz. of P., 1953, Pt. I , pp. 143-44\nThe Central Government has declared the Colony of Singapore to be a reciprocating territory, and the Supreme Court of Singapore to be a superior Court\nof the territory for the purpose of this section. see Gaz. of P. 1954, Pt. I, p. 106.\nCertain Courts in Pakistan have been declared to be superior Court for the purpose of section 5 of the Reciprocal Enforcement of Judgment Ordinance of\nSingapore, see Gaz. of P., 1954, Pt. I, p. 296.\nThe Central Government has declared the Australian Capital Territory to be a reciprocating territory, and the Supreme Court of Australian Capital\nTerritory to be a superior Court of the territory for the purposes of this section, see Gaz. of P., 1957, Pt. I, p. 174.\nThe Central Government has declared “New Zealand including the Cook Islands (including Nive) and the Trust Territory of Western Samao” to be a\nreciprocating territory, and the Supreme Court of New Zealand to be a superior Court of that territory, for the purposes of this section (with effect from\n7th August, 1958), see Gaz. of 1958 Pt. I, p. 455.\nThe Central Government has declared the Northern Territory of Australia to be reciprocating territory, and the Supreme Court of the said territory to be\na superior Court of the territory for the purposes of this section, see Gaz. of P., 1959, Pt. I, p. 425."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Precepts.__ (1) Upon the application of the decree",
      "content": "holder the Court which passed the decree\nmay, whenever it thinks fit, issue a precept to any other Court which would be competent to execute\nsuch decree to attach any property belonging to the judgment-debtor and specified in the precept.\n(2) The Court to which a precept is sent shall proceed to attach the property in the manner\nprescribed in regard to the attachment of property in execution of a decree :\nProvided that no attachment under a precept shall continue for more than two months unless\nthe period of attachment is extended by an order of the Court which passed the decree or unless before\nthe determination of such attachment the decree has been transferred to the Court by which the\nattachment has been made and the decree-holder has applied for an order for the sale of such property."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Questions to be determined by the Court executing decree.",
      "content": "(1) All questions\narising between the parties to the suit in which the decree was passed, or their representatives, and\nrelating to the execution, discharge or satisfaction of the decree, shall be determined by the Court\nexecuting the decree and not by a separate suit.\n(2) The Court may, subject to any objection as to limitation or jurisdiction, treat a proceeding\nunder this section as a suit or a suit as a proceeding and may, if necessary, order payment of any\nadditional court-fees.\n(3) Where a question arises as to whether any person is or is not the representative of a party,\nsuch question shall, for the purposes of this section, be determined by the Court.\nExplanation.__ For the purposes of this section, a plaintiff whose suit has been dismissed and a\ndefendant against whom a suit has been dismissed, are parties to the suit."
    },
    {
      "provision_ref": "sec248",
      "section": "248",
      "title": "Section 248. Execution barred in certain cases",
      "content": "(1) Where an application to execute a decree not\nbeing a decree granting an injunction has been made, no order for the execution of the same decree\nshall be made upon any fresh application presented after the expiration of 3[six years] from__\n(a)        the date of the decree sought to be executed, or,\n(b)        where the decree or any subsequent order directs any payment of money or the\ndelivery of any property to be made at a certain date or at recurring periods, the\ndate of the default in making the payment or delivery in respect of which the\napplicant seeks to execute the decree.\n(2) Nothing in this section shall be deemed__\n1\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Second Schedule.\n2\nThis section has been amended in its application to Sind by the Sind Rural Credit and Land Transfer Act No. XLIX of 1947, s. 18.\n3\nSubs. by the Law Reforms Ordinance, No. XII of 1972, s. 2 and Sch.\n(a)        to preclude the Court from ordering the execution of a decree upon an\napplication presented after the expiration of the said term of 1[six years],\nwhere the judgment-debtor has, by fraud or force, prevented the execution of\nthe decree at some time within 1[six years] immediately before the date of the\napplication ;or\n(b)        to limit or otherwise affect the operation of article 2[183 of the First Schedule\nto the Limitation Act, 1908 (IX of 1908).]"
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Transferee. Every transferee of a decree shall hold the same subject to the equities (if any)",
      "content": "which the Judgment-debtor might have enforced against the original decree-holder."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Legal representative.__ (1) Where a judgment",
      "content": "debtor dies before the decree has been fully\nsatisfied, the holder of the decree may apply to the Court which passed it to execute the same against\nthe legal representative of the deceased.\n(2) Where the decree is executed against such legal representative, he shall be liable only to the\nextent of the property of the deceased which has come to his hands and has not been duly disposed of\n; and, for the purpose of ascertaining such liability, the Court executing the decree may, of its own\nmotion or on the application of the decree-holder, compel such legal representative to produce such\naccounts as it thinks fit."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Powers of Court to enforce execution. Subject to such conditions and limitations as may",
      "content": "be prescribed, the Court may, on the application of the decree-holder, order execution of the decree__\n(a)        by delivery of any property specifically decreed;\n(b)        by attachment and sale or by sale without attachment of any property ;\n(c)        by arrest and detention in prison ;\n(d)        by appointing a receiver ; or\n(e)        in such other manner as the nature of the relief granted may require:\n3\n[Provided that, 4[* * *] execution by detention in prison shall not be ordered unless, after\ngiving the judgment-debtor an opportunity of showing cause why he should not be committed to\nprison, the Court, for reasons recorded in writing, is satisfied__\n(a)        that the judgment-debtor, with the object or effect of obstructing or delaying the\nexecution of the decree,__\n1\nSubs. by the Law Reform Ordinance, No. XII of 1972, s. 2 and Sch.\n2\nSubs. by the Code of Civil Procedure (Amdt.) Act No. XXXIV of 1940, s. 3.\n3\nProviso and Explanation were ins. by the Code of Civil Procedure (Amdt.) Act No. XXI of 1936, s. 2.\n4\nThe words and commas, “where the decree is for the payment of money,” were omitted by the Code of Civil Procedure (Amdt.) Ordinance, No. X of\n1980), s. 4.\n(i)       is likely to abscond or leave the local limits of the jurisdiction of the\nCourt, or\n(ii)      has, after the institution of the suit in which the decree was passed,\ndishonestly transferred, concealed, or removed any part of his property,\nor committed any other act of bad faith in relation to his property ; or\n(b)        that the judgment-debtor has, or has had since the date of the decree, the means\nto pay the amount of the decree or some substantial part thereof and refuses or\nneglects or has refused or neglected to pay the same, or\n(c)        that the decree is for a sum for which the judgment-debtor was bound in a\nfiduciary capacity to account.\nExplanation.__ In the calculation of the means of the judgment-debtor for the purposes of clause\n(b), there shall be left out of account any property which, by or under any law or custom having the\nforce of law for the time being in force, is exempt from attachment in execution of the decree.]"
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Enforcement of decree against legal representative",
      "content": "(1) Where a decree is passed\nagainst a party as the legal representative of a deceased person, and the decree is for the payment of\nmoney out of the property of the deceased, it may be executed by the attachment and sale of any such\nproperty.\n(2) Where no such property remains in the possession of the judgment-debtor and he fails to\nsatisfy the Court that he has duly applied such property of the deceased as is proved to have come into\nhis possession, the decree may be executed against the judgment-debtor to the extent of the property\nin respect of which he has failed so to satisfy the Court in the same manner as if the decree had been\nagainst him personally."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Liability of ancestral property. For the purposes of section 50 and section 52, property in",
      "content": "the hands of a son or other descendant which is liable under Hindu law for the payment of the debt of\na deceased ancestor, in respect of which a decree has been passed, shall be deemed to be property of\nthe deceased which has come to the hands of the son or other descendant as his legal representative."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Partition of estate of seperation of share. Where the decree is for the partition of an",
      "content": "undivided estate assessed to the payment of revenue to 1[the Government], or for the separate\npossession of a share of such an estate, the partition of the estate or the separation of the share shall be\nmade by the Collector or any gazetted subordinate of the Collector deputed by him in this behalf, in\naccordance with the law (if any) for the time being in force relating to the partition, or the separate\npossession of shares, of such estates."
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Arrest and detention.__ (1) A judgment",
      "content": "debtor may be arrested in execution of a decree at\nany hour and on any day, and shall, as soon as practicable, be brought before the Court 2[which may\nmake an order for his detention in prison to suffer simple imprisonment for a period not exceeding one\nyear] :\n1\nAmended by Adaptation Order, 1961, Art. 2 (with effect from the 23rd March, 1956), to read as above.\n2\nSubs. by Ordinance, X of 1980, s. 5.\nProvided, firstly, that, for the purpose of making an arrest under this section, no dwelling-house\nshall be entered after sunset and before sunrise:\nProvided, secondly, that no outer door of a dwelling-house shall be broken open unless such\ndwelling-house is in the occupancy of the judgment-debtor and he refuses or in any way prevents\naccess thereto, but when the officer authorised to make the arrest his duly gained access to any\ndwelling-house, he may break open the door of any room in which he has reason to believe the\njudgment-debtor is to be found:\nProvided, thirdly, that, if the room is in the actual occupancy of a woman who is not the\njudgement-debtor and who according to the customs of the country does not appear in public, the\nofficer authorised to make the arrest shall give notice to her that she is at liberty to withdraw, and, after\nallowing a reasonable time for her to withdraw and giving her reasonable facility for withdrawing,\nmay enter the room for the purpose of making the arrest:\nProvided, fourthly, that, where the decree in execution of which a judgment-debtor is arrested,\nis a decree for the payment of money and the judgment-debtor pays the amount of the decree and the\ncosts of the arrest to the officer arresting him, such officer shall at once release him.\n(2) The 1[Provincial Government] may, by notification in the 1[official Gazette], declare that\nany person or class of persons whose arrest might be attended with danger or inconvenience to the\npublic shall not be liable to arrest in execution of a decree otherwise than in accordance with such\nprocedure as may be prescribed by the 1[Provincial Government] in this behalf.\n2\n[(3) A judgment-debtor detained in prison under sub-section (1) shall not, merely by reason\nof undergoing such imprisonment, be discharged from his liability under the decree, but he shall not\nbe liable to be re-arrested under the decree in execution of which he was so detained in prison.]"
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. Prohibition of arrest or detention of women in execution of decree for money",
      "content": "Notwithstanding anything in this Part, the Court shall not order the arrest or detention in the 2[*] prison\nof a women in execution of a decree for the payment of money.\n3\n[57. Subsistence Allowance.] Omitted by the Code of Civil Procedure (Amdt.) Ordinance,\n1980 (X of 1980), s. 7.\n2[58. Release from detention.__ Every person detained in prison in execution of a decree shall\nbe released from such detention, before the expiry of the period of detention, if__\n(a)        the amount mentioned in the warrant for his detention is paid to the officer in\ncharge of the prison ; or\n(b)        the decree against him is otherwise fully satisfied ; or\n(c)        the person on whose application he has been detained so requests:\n1\nSubs. by Adaptation Order, 1937.\n2\nSubs., omitted and amended by Ordinance, X of 1980, ss. 5, 6, 8.\n3\nAmended by Adaptation Order, 1937.\nProvided that he shall not be released from such detention without the order of the Court.]"
    },
    {
      "provision_ref": "sec60",
      "section": "60",
      "title": "Section 60. Property liable to attachment and sale in execution of decree",
      "content": "(1) The following\nproperty is liable to attachment and sale in execution of a decree, namely, lands, houses or other\nbuildings, goods, money, bank-notes, cheques, bills of exchange, hundis, promissory notes,\nGovernment securities, bonds or other securities for money, debts, shares in a corporation and, save as\nhereinafter mentioned, all other saleable property, moveable or immoveable, belonging to the\njudgment-debtor or over which, or the profits of which, he has a disposing power which he may\nexercise for his own benefit, whether the same be held in the name of the judgment-debtor or by\nanother person in trust for him or on his behalf :\nProvided that the following particulars shall not be liable to such attachment or sale, namely:__\n(a)        the necessary wearing-apparel, cooking vessels, beds and bedding of the\njudgment-debtor, his wife and children, and such personal ornaments as, in\naccordance with religious usage, cannot be parted with by any woman ;\n(b)        tools of artisans, and, where the judgment-debtor is an agriculturist, his\nimplements of husbandry and such cattle and seed-grain as may, in the opinion\nof the Court, be necessary to enable him to earn his livelihood as such, and such\nportion of agricultural produce or of any class of agricultural produce as may\nhave been declared to be free from liability under the provisions of the next\nfollowing section;\n(c)        houses and other buildings (with the materials and the sites thereof and the land\nimmediately appurtenant thereto and necessary for their enjoyment) belonging\nto an agriculturist and occupied by him ;\n(d)        books of account ;\n(e)        a mere right to sue for damages ;\n(f)        any right of personal service ;\n(g)        stipends and gratuities allowed to 2[pensioners of the Government], or payable\nout of any service family pension fund notified3 in the 4[official Gazette] by\n4\n[the 5[Federal Government] or the Provincial Government] in this behalf, and\npolitical pensions ;\n1\nAmended by Adaptation Order, 1937.\n2\nAmended by Adaptation Order, 1961, Art. 2 (with effect from the 23rd March, 1956), to read as above.\n3\nFor such Notification, see Gazette of India, 1909 Pt. I, p.5.\n4\nSubs. by Adaptation Order, 1937.\n5\nSubs. by Federal Adaptation Order, 1975, Art. 2 and Table.\n1\n[(h)   the wages of labourers and domestic servants, whether payable in money or in\nkind ; 2[* * *] ;\n2\n[(i)   salary to the extent of the first hundred rupees and one-half of the remainder:\nProvided that where such salary is the salary of a 3[servant of the State] or a servant of\na railway 4[*] or local authority, and the whole or any part of the portion of\nsuch salary liable to attachment has been under attachment, whether\ncontinuously or intermittently for a total period of twenty-four months, such\nportion shall be exempt from attachment until the expiry of a further period of\ntwelve months and, where such attachment has been made in execution of one\nand the same decree, shall be finally exempt from attachment in execution of\nthat decree ;]]\n(j)        the pay and allowances of persons to whom the 5[ 6[Pakistan Army Act, 1952\n(XXXIX of 1952)], 7[* * *] applies],8[or of persons other than commissioned\nofficers to whom the 9[Pakistan Navy Ordinance, 1961, (XXXV of 1961),\napplies] ;\n(k)        all compulsory deposits and other sums in or derived from any fund to which\nthe Provident Funds Act,1[1925 (XIX of 1925)], for the time being applies in\nso far as they are declared by the said Act not to be liable to attachment;\n1\n[(l)   any allowance forming part of the emoluments of any 3[servant of the State] or\nof any servant of a railway 4[*] or local authority which the 10[appropriate\nGovernment] may by notification11 in the 13[official Gazette] declare to be\nexempt from attachment, and any subsistence grant or allowance made to 13[any\nsuch servant] while under suspension ;]\n(m)        an expectancy of succession by survivorship or other merely contingent or\npossible right or interest ;\n(n)        a right to future maintenance ;\n(o)        any allowance declared by 14[any Pakistan law] to be exempt from liability to\nattachment or sale in execution of a decree ; and\n1\nSubs. and Ins. by Act, IX of 1937, s. 2.\n2\nSubs. and omitted by Act, V of 1943, s. 2.\n3\nSubs. by Adaptation Order, 1961, Art. 2 and Sch., (with effect from the 23rd March,, 1956).\n4\nOmitted by Ordinance, XLIV of 1962, s. 13.\n5\nSubs. by Adaptation Order, 1937.\n6\nSubs. by Ordinance, XXI of 1960, s. 3 and 2nd Sch., (with effect from the 14th October, 1955).\n7\nOmitted by Adaptation Order, 1949.\n8\nIns. by the amending Act, (XXXV of 1934), s. 2 and Sch.\n9\nSubs. by Ordinance, XXVII of 1981, s. 3 and Second Sch.\n10\nSubs. by Adaptation Order, 1937.\n11\nFor notification exempting certain allowances payable to any public officers in the service of the Central Government, or any servant of a Federal\nRailway or of a cantonment authority or of the port authority of a major port, for attachment, see G. of I. Judicial Department Notification No. 186/37,\ndated 2nd October, 1940, published in the supplement to Gen. R. & O., Pt. II, Vol. VI, p.253.\n12\nSubs. by Adaptation Order, 1937.\n13\nSubs. by Act V of 1943, s. 2.\n14\nAmended by Adaptation Order, 1937, and Adaptation Order, 1949, to read as above.\n(p)        where the judgment-debtor is a person liable for the payment of land-revenue,\nany moveable property which, under any law for the time being applicable to\nhim, is exempt from sale for the recovery of an arrear of such revenue.\n1\n[Explanation 1].__The particulars mentioned in clauses (g), (h), (i), (j), (l) and (o) are exempt\nfrom attachment or sale whether before or after they are actually payable, 1[and in the case of salary\nother than salary of a 2[servant of the State] or a servant of a railway 3[*] or local authority the\nattachable portion thereof is exempt from attachment until it is actually payable].\n[Explanation 2.__ In clauses (h) and (i), “salary” means the total monthly emoluments,\n1\nexcluding any allowance declared exempt from attachment under the provisions of clause (l), derived\nby a person from his employment whether on duty or on leave.]\n4\n[Explanation 3.__ In clause (l) “appropriate Government” means__\n(i)        as respects any 5[person] in the service of the 6[Federal Government], or any\nservant 6[of railway or] 3[* * *] of a cantonment authority or of the port authority\nof a major port, the 6[Federal Government] ;\n7\n[*     *          *           *          *          *          *]\n(iii)      as respects any other 2[servant of the State] or a servant of any 8[* * *] local\nauthority, the Provincial Government.]\n(2) Nothing in this section shall be deemed__\n9\n[*] to exempt houses and other buildings (with the materials and the sites thereof and the lands\nimmediately appurtenant thereto and necessary for their enjoyment) from attachment or sale in\nexecution of decrees for rent of any such house, building, site or land, [*]3\n9\n[*     *          *          *           *          *          *]\n1\nSubs., re-numbered by Act No. IX of 1937, s. 2.\n2\nSubs. by Adaptation Order, 1961, Art, 2 and Sch. (with effect from the 23rd March,, 1956),\n3\nOmitted by Ordinance, No. XLIV of 1962, s. 13.\n4\nIns. by Adaptation Order, 1937.\n5\nSubs. by Act 5 of 1943, s.2.\n6\nSubs. by Federal Adaptation Order, 1975, Art. 2 and Table.\n7\nOmitted by Adaptation Order, 1949.\n8\nOmitted by Federal Adaptation Order, 1975, Art. 2 and Sch. (with effect from the 14th August, 1973).\n9\nRep. by Act No. X of 1914, s. 3 and 2nd Sch."
    },
    {
      "provision_ref": "sec61",
      "section": "61",
      "title": "Section 61. Partial exemption of agricultural produce. The 1[Provincial Government]2* * * may, by",
      "content": "general or special order published in the 3[official Gazette, declare that such portion of agricultural\nproduce, or of any class of agricultural produce, as may appear to the 1[Provincial Government] to be\nnecessary for the purpose of providing until the next harvest for the due cultivation of the land and for\nthe support of the judgment-debtor and his family, shall, in the case of all agriculturists or of any\nclass of agriculturists, be exempted from liability to attachment or sale in execution of a decree."
    },
    {
      "provision_ref": "sec62",
      "section": "62",
      "title": "Section 62. Seizure of property in dwelling",
      "content": "house.__ (1) No person executing any process under this\nCode directing or authorizing seizure of moveable property shall enter any dwelling-house after sunset\nand before sunrise.\n(2) No outer door of a dwelling-house shall be broken open unless such dwelling-house is in\nthe occupancy of the judgment-debtor and he refuses or in any way prevents access thereto, but when\nthe person executing any such process has duly gained access to any dwelling-house, he may break\nopen the door of any room in which he has reason to believe any such property to be.\n(3) Where a room in a dwelling-house is in the actual occupancy of a woman who, according\nto the customs of the country, does not appear in public, the person executing the process shall give\nnotice to such woman that she is at liberty to withdraw ; and, after allowing reasonable time for her to\nwithdraw and giving her reasonable facility for withdrawing, he may enter such room for the purpose\nof seizing the property, using at the same time every precaution, consistent with these provisions, to\nprevent its clandestine removal."
    },
    {
      "provision_ref": "sec63",
      "section": "63",
      "title": "Section 63. Property attached in execution of decrees of several Courts",
      "content": "(1) Where property not\nin the custody of any Court is under attachment in execution of decrees of more Courts than one, of\nthe Court which shall receive or realize such property and shall determine any claim thereto and any\nobjection to the attachment thereof shall be the Court of highest grade, or, where there is no difference\nin grade between such Courts, the Court under whose decree the property was first attached.\n(2) Nothing in this section shall be deemed to invalidate any proceeding taken by a Court\nexecuting one of such decrees."
    },
    {
      "provision_ref": "sec64",
      "section": "64",
      "title": "Section 64. Private alienation of property after attachment to be void. Where an attachment has",
      "content": "been made, any private transfer or delivery of the property attached or of any interest therein and any\npayment to the judgment-debtor of any debt, dividend or other monies contrary to such attachment,\nshall be void as against all claims enforceable under the attachment.\nExplanation.__ For the purposes of this section, claims enforceable under an attachment include\nclaims for the rateable distribution of assets.\nSALE"
    },
    {
      "provision_ref": "sec65",
      "section": "65",
      "title": "Section 65. Purchaser's title. Where immoveable property is sold in execution of a decree and such",
      "content": "sale has become absolute, the property shall be deemed to have vested in the purchaser from the time\nwhen the property is sold and not from the time when the sale becomes absolute.\n1\nSubs. by Adaptation Order, 1937.\n2\nRep. by Act No. XXXVIII of 1920, s. 2 and Sch. Pt. I.\n3\nSubs. by Adaptation Order, 1937."
    },
    {
      "provision_ref": "sec66",
      "section": "66",
      "title": "Section 66. Suit against purchaser not maintainable on ground of purchase being on behalf of",
      "content": "plaintiff.__ (1) No suit shall be maintained against any person claiming title under a purchase certified\nby the Court in such manner as may be prescribed on the ground that the purchase was made on behalf\nof the plaintiff or on behalf of some one through whom the plaintiff claims.\n(2) Nothing in this section shall bar a suit to obtain a declaration that the name of any purchaser\ncertified as aforesaid was inserted in the certificate fraudulently or without the consent of the real\npurchaser, or interfere with the right of a third person to proceed against that property, though\nostensibly sold to the certified purchaser, on the ground that it is liable to satisfy a claim of such third\nperson against the real owner.\n1[67. Power for Provincial Government to make rules as to sales of land in execution of\ndecrees for payment of money.__ (1)] The 2[Provincial Government] 3[* * *], may, by notification in\nthe 2[official Gazette], make rules for any local area imposing conditions in respect of the sale of any\nclass of interests in land in execution of decrees for the payment of money, where such interests are\nso uncertain or undetermined as, in the opinion of the 2[Provincial Government], to make it impossible\nto fix their value.\n1\n[(2) When on the date on which this Code came into operation in any local area, any special\nrules as to sale of land in execution of decrees were in force therein, the 2[Provincial Government]\nmay, by notification in the 2[official Gazette], declare such rules to be in force, or may, 3[* * *] by a\nlike notification, modify the same.\nEvery notification issued in the exercise of the powers conferred by this sub-section shall set\nout the rules so continued or modified.]"
    },
    {
      "provision_ref": "sec68",
      "section": "68",
      "title": "Section 68. Power to prescribe rules for transferring to Collector execution of certain decrees",
      "content": "The [Provincial Government] may, 3[* * *], declare, by notification in the 2[official Gazette], that in\n2\nany local area the execution of decrees in cases in which a Court has ordered any immoveable property\nto be sold, or the execution of any particular kind of such decrees, or the execution of decrees ordering\nthe sale of any particular kind of, or interest in, immoveable property, shall be transferred to the\nCollector."
    },
    {
      "provision_ref": "sec69",
      "section": "69",
      "title": "Section 69. Provisions of Third Schedule to apply. The provisions set forth in the Third Schedule",
      "content": "shall apply to all cases in which the execution of a decree has been transferred under the last preceding\nsection."
    },
    {
      "provision_ref": "sec70",
      "section": "70",
      "title": "Section 70. Rules of procedure",
      "content": "(1) The 2[Provincial Government] may make rules consistent with\nthe aforesaid provisions__\n(a)        for the transmission of the decree from the Court to the Collector, and for\nregulating the procedure of the Collector and his subordinates in executing the\nsame, and for retransmitting the decree from the Collector to the Court ;\n1\nRe-numbered by Act No. I of 1914, s. 3.\n2\nSubs. by Adaptation Order, 1937.\n3\nOmitted by Act No. XXXVIII of 1920, s.2 and First Sch., Pt.I.\n(b)     conferring upon the Collector or any gazatted subordinate of the Collector all or\nany of the powers which the Court might exercise in the execution of the decree if\nthe execution thereof had not been transferred to the Collector ;\n(c)     providing for orders made by the Collector or any gazatted subordinate of the\nCollector, or orders on appeal with respect to such orders, being subject to appeal\nto, and revision by, superior revenue-authorities as nearly as may be as the orders\nmade by the Court, or orders made on appeal with respect to such orders, would be\nsubject to appeal to, and revision by, appellate or revisional Courts under this Code\nor other law for the time being in force if the decree had not been transferred to the\nCollector.\n(2) Jurisdiction of Civil Courts barred. A power conferred by rules made under sub-section (1)\nupon the Collector or any gazatted subordinate of the Collector, or upon any appellate or revisional\nauthority, shall not be exercisable by the Court or by any Court in exercise of any appellate or revisional\njurisdiction which it has with respect to decrees or orders of the Court."
    },
    {
      "provision_ref": "sec71",
      "section": "71",
      "title": "Section 71. Collector deemed to be acting judicially. In executing a decree transferred to the Collector",
      "content": "under section 68 the Collector and his subordinates shall be deemed to be acting judicially."
    },
    {
      "provision_ref": "sec72",
      "section": "72",
      "title": "Section 72. Where Court may authroise Collector to stay public sale of land",
      "content": "(1) Where in any\nlocal area in which no declaration under section 68 is in force the property attached consists of land or of\na share in land, and the Collector represents to the Court that the public sale of the land or share is\nobjectionable and that satisfaction of the decree may be made within a reasonable period by a temporary\nalienation of the land or share, the Court may authorise the Collector to provide for such satisfaction in the\nmanner recommended by him instead of proceeding to a sale of the land or share.\n(2) In every such case the provisions of sections 69 to 71 and of any rules made in pursuance thereof\nshall apply so far as they are applicable."
    },
    {
      "provision_ref": "sec73",
      "section": "73",
      "title": "Section 73. Proceeds of execution sale to be rateably distributed among decree",
      "content": "holders.__ (1) Where\nassets are held by a Court and more persons than one have, before the receipt of such assets, made\napplication to the Court for the execution of decrees for the payment of money passed against the same\njudgment-debtor and have not obtained satisfaction thereof, the assets, after deducting the costs of\nrealization, shall be rateably distributed among all such persons :\nProvided as follows:__\n(a)     where any property is sold subject to a mortgage or charge, the mortgagee or\nincumbrancer shall not be entitled to share in any surplus arising from such sale;\n(b)     where any property liable to be sold in execution of a decree is subject to a mortgage\nor charge, the Court may, with the consent of the mortgagee or incumbrancer, order\nthat the property be sold free from the mortgage or charge, giving to the mortgagee\nor incumbrancer the same interest in the proceeds of the sale as he had in the\nproperty sold ;\n(c)     where any immoveable property is sold in execution of a decree ordering its sale\nfor the discharge of an incumbrance thereon, the proceeds of sale shall be applied __\nfirst, in defraying the expenses of the sale ;\nsecondly, in discharging the amount due under the decree ;\nthirdly, in discharging the interest and principal monies due on subsequent incumbrances (if\nany) ; and\nfourthly, rateably among the holders of decrees for the payment of money against the judgment\ndebtor, who have, prior to the sale of the property, applied to the Court which passed the\ndecree ordering such sale for execution of such decrees, and have not obtained satisfaction\nthereof.\n(2) Where all or any of the assets liable to be rateably distributed under this section are paid to a person\nnot entitled to receive the same, any person so entitled may sue such person to compel him to refund the assets.\n(3) Nothing in this section affects any right of 1[the Government].\n2\n[74. Resistance to execution.__ (1) Where the Court is satisfied that the holder of a decree for the\npossession of property or a purchaser of property sold in execution of a decree has been resisted or obstructed\nin obtaining possession of the property by the judgment-debtor or any other person on his behalf and that such\nresistance or obstruction was without any just cause, the Court may, at the instance of the decree-holder or\nthe purchaser, order the judgment-debtor or such other person to undergo simple imprisonment for a term\nwhich may extend to thirty days and may further direct that the decree-holder or the purchaser be put into\npossession of the property.\n(2) Notwithstanding anything contained in sub-section (1), where a judgment-debtor or any other person resists\nor obstructs the execution of a decree, the Court may direct the officer in charge of the police-station within\nwhose jurisdiction the judgment-debtor or such other person resides or where the property to which the decree\nrelates is situate to provide the necessary police assistance for the execution of the decree.]"
    },
    {
      "provision_ref": "sec75",
      "section": "75",
      "title": "Section 75. Power of Court to issue commissions. Subject to such conditions and limitations as may be",
      "content": "prescribed, the Court may issue a commission__\n(a)        to examine any person ;\n(b)        to make a local investigation ;\n(c)        to examine or adjust accounts ; or\n(d)        to make a partition.\n3[75A. *              *          *          *          *          *          *]\n1\nThe original words “the Government” were first subs. by Adaptation Order, 1937, and then amended by A.O., 1961, Art. 2 (w. e. f 23rd March, 1956).\n2\nSubs. by the Code of Civil Procedure (Amdt.) Ordinance, 1980 (X of 1980), s. 10.\n3\nOmitted by Act XIX of 2023, s.8."
    },
    {
      "provision_ref": "sec76",
      "section": "76",
      "title": "Section 76. Commission to another Court.",
      "content": "(1) A commission for the examination of any person may\nbe issued to any Court (not being a High Court) situate in a Province other than the Province in which the\nCourt of issue is situate and having jurisdiction in the place in which the person to be examined resides.\n(2) Every Court receiving a commission for the examination of any person under sub-section (1)\nshall examine him or cause him to be examined pursuant thereto, and the commission, when it has been\nduly executed, shall be returned together with the evidence taken under it to the Court from which it was\nissued, unless the order for issuing the commission has otherwise directed, in which case the commission\nshall be returned in terms of such order."
    },
    {
      "provision_ref": "sec77",
      "section": "77",
      "title": "Section 77. Letter of request. In lieu of issuing a commission the Court may issue a of letter of request to",
      "content": "examine a witness residing at any place not within 1[Pakistan]."
    },
    {
      "provision_ref": "sec78",
      "section": "78",
      "title": "Section 78. Commissions issued by foreign Courts. 2[Subject to such conditions and limitations as may",
      "content": "be prescribed,] the provisions as to the execution and return of commissions for the examination of\nwitnesses shall apply to commissions issued by 2[or at the instance of] __\n(a)        Courts situate beyond the limits of 1[Pakistan] and established or continued by the\nauthority of 3[* * *] 4[the 5[Federal Government] 6* * *], or\n7\n[*     *          *          *          *          *          *]\n(c)        Courts of any State or country outside Pakistan.].\nSUITS BY OR AGAINST 8[THE GOVERNMENT] OR PUBLIC OFFICERS IN THEIR\n[79. Suits by or against the Government.__ 10[* * *] In a Suit by or against the 11[Government]\n9\nthe authority to be named as plaintiff or defendant, as the case may be, shall be__\n(a)        in the case of a suit by or against the 5[Federal Government], 12[Pakistan];\n(b)        in the case of a suit by or against a Provincial Government, the Province ; and\n13\n[*     *          *          *          *          *          *]\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch. (w. e. f the 14th October, 1955).\n2\nIns. by the Code of Civil Procedure (Amdt.) Act, 1932 (X of 1932), section 2.\n3\nOmitted by the Central Laws (Adaptation) Order, 1961 (P.O No.1 of 1961), Art. 2 and Sch. (w. e. f the 23rd march, 1956).).\n4\nSubs. by Adaptation Order, 1937.\n5\nSubs. by F.A.O. 1975, Art. 2 and Table.\n6\nThe words “or of the Crown Representative” omitted by Adaptation Order, 1949.\n7\nClause (b) as amended by A.O., 1949 and Act 10 of 1932, s.2, has been omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII\nof 1981), s.3 and Second Sch.,\n8\nThe original words “the Government” were first subs. by Adaptation Order, 1937, and then amended by Adaptation Order, 1961, Art. 2 (w. e. f the 23rd\nMarch, 1956) to read as above.\n9\nSubs. by Adaptation Order, 1937, for the original s.79.\n10\nThe words and figures “Subject to the provisions of sections 179 and 185 of the Government of India Act, 1935,” omitted by the Federal Laws\n(Revision and Declaration) Act, 1951, (XXVII of 1951), s.3 and 2nd Sch.\n11\nSubs. by Adaptation Order, 1961, Art. 2. (w. e. f the 23rd March, 1956).\n12\nThe original words “the Governor­General in Council before the establishment of the Federation of India, and thereafter, the Federation” have\nsuccessively been amended by Adaptation Order, 1949, Act 26 of 1951, s.3 and 2nd Sch. and the Code of Civil Procedure (Amdt.) Ordinance, 1962\n(XLIV of 1962), s. 14.\n13\nCl. (c) omitted by Adaptation Order, 1949.\n1\n[80. Notice.__ (1) A suit may be instituted against the Government or against a Public officer, in respect of\nany act purporting to be done by such public officer in his official capacity, after the expiration of two months next\nafter notice in writing has been delivered to or left at the office of, __\n(a)        in the case of a suit against the 2[Federal Government], a Secretary to that Government;\n(b) (i) in the case of a suit against the Provincial Government other than a suit relating to the\naffairs of a Railway, a Secretary to that Government or the Collector of the District; and\n(ii) in the case of a suit against the 3[Federal Government] relating to the affairs of a Railway,\nthe General Manager of the Railway concerned,\nand in the case of a public officer, delivered to him or left at his office stating the cause of action, the name, description\nof place of residence of the plaintiff and the relief which he claims ; and the plaint shall contain a statement that such\nnotice has been so delivered or left.\n(2) Where any such suit is instituted without delivering or leaving such notice as aforesaid or before the\nexpiration of the said period of two months or where the plaint does not contain a statement that such notice has been\nso delivered or left, the plaintiff shall not be entitled to any costs if settlement as regards the subject-matter of the\nsuit is reached or the Government or the public officer concedes the plaintiff's claim, within the period of two\nmonths from the date of the institution of the suit :\nProvided that in a suit instituted without such notice, the Court shall allow not less than three months to the\nGovernment to submit its written statement.]"
    },
    {
      "provision_ref": "sec81",
      "section": "81",
      "title": "Section 81. Exemption from arrest and personal appearance. In a suit instituted against a public officer in respect",
      "content": "of any act purporting to be done by him in his official capacity__\n(a)        the defendant shall not be liable to arrest nor his property to attachment otherwise than in\nexecution of a decree, and,\n(b)        where the Court is satisfied that the defendant cannot absent himself from his duty without\ndetriment to the public service, it shall exempt him from appearing in person."
    },
    {
      "provision_ref": "sec82",
      "section": "82",
      "title": "Section 82. Execution of decree.",
      "content": "(1) Where the decree is against 4[the Government] or against a public officer in\nrespect of any such act as aforesaid, a time shall be specified in the decree within which it shall be satisfied ; and,\nif the decree is not satisfied within the time so specified, the Court shall report the case for the orders of the\n5[Provincial Government].\n(2) Execution shall not be issued on any such decree unless it remains unsatisfied for the period of three\nmonths computed from the date of such report.\n6[SUITS BY ALIENS AND BY OR AGAINST FOREIGN RULERS, AMBASSADORS AND ENVOYS]"
    },
    {
      "provision_ref": "sec83",
      "section": "83",
      "title": "Section 83. When aliens may sue",
      "content": "(1) Alien enemies residing 7[in Pakistan] with the permission of the 8[Federal\nGovernment], and alien friends, may sue in the Courts 9[in the Provinces], as if they were 10[citizens of Pakistan].\n(2) No alien enemy residing 7[in Pakistan] without such permission, or residing in a foreign country, shall\nsue in any of such Courts.\n1\nOrder, 1961, Art. 2 (w. e. f. the 23rd March, 1956) and Ord. 44 of 1962, s.15. to read as above.\n2\nSubs. by F.A.O., 1975, Art. 2 and Table.\n3\nSubs. by F.A.O. 1975, Art. 2 and Sch. (with effect form the 14th August, 1973).\n4\nAmended by A.O., 1961, Art. 2 (with effect from the 23rd march, 1956).\n5\nSubs. by A.O., 1937.\n6\nSubs. by the Code of civil Procedure (Amdt.) Ordinance, 1960 (22 of 1960), s.2, for “SUITS BY ALIENS AND BY OR AGAINST FOREIGN RULERS AND RULERS OF\nACCEDING STATES” as amended by A.O., 1937 and the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s.4 and 3rd Sch.\n7\nSubs. by A.O., 1949.\n8\nSubs. by F.A.O., 1975, Art. 2 and Table.\n9\nSubs. by A.O., 1949.\n10\nSubs. by A.O., 1961, Art. 2 and Sch., (with effect from the 23rd March, 1956).\nExplanation.__ Every person residing in a foreign country the Government of which is at war\nwith 1[, or engaged in military operations against,] 2[Pakistan], and carrying on business in that country\nwithout a license in that behalf under the hand 3[* * *] of a Secretary to the 4[Federal Government]\nshall, for the purpose of sub-section (2), be deemed to be an alien enemy residing in a foreign country."
    },
    {
      "provision_ref": "sec84",
      "section": "84",
      "title": "Section 84. When foreign States may sue",
      "content": "(1) A foreign State may sue in any Court 5[in the\nProvinces] :\nProvided that such State has been recognized by 6[* * *] the 7[Federal Government]:\nProvided, also, that the object of the suit is to enforce a Private right vested in the head of such\nState or in any officer of such State in his public capacity.\n(2) Every Court shall take judicial notice of the fact that a foreign State has or has not been\nrecognized by 6[* * *] the 7[Federal Government]."
    },
    {
      "provision_ref": "sec85",
      "section": "85",
      "title": "Section 85. Persons specially appointed by Government to prosecute or defend for Ruler of",
      "content": "foreign State.__ 8[(1) Persons specially appointed by order of the 7[Federal Government] at the request\nof the Ruler of any foreign State, or at the request of any person competent, in the opinion of the\n7\n[Federal Government], to act on behalf of such Ruler, to prosecute or defend any suit on his behalf,\nshall be deemed to be the recognized agents by whom appearances, acts and applications under this\nCode may be made or done on behalf of such Ruler.]\n9\n[*     *           *          *           *          *          *]\n(2) An appointment under this section may be made for the purpose of a specified suit or of\nseveral specified suits, or for the purpose of all such suits as it may from time to time be necessary to\nprosecute or defend on behalf of the 10[Ruler].\n(3) A person appointed under this section may authorise or appoint persons to make\nappearances and applications and do acts in any such suit or suits as if he were himself a party thereto.\n11"
    },
    {
      "provision_ref": "sec86a",
      "section": "86A",
      "title": "Section 86A. Suits against diplomatic agents",
      "content": "(1) No proceeding in any Court shall lie against a\ndiplomatic agent except in a case relating to__\n1\nIns. by the code of Civil Procedure (Amdt.) Act, 1965 (19 of 1965), s.2.\n2\nSubs. by A.O., 1949.\n3\nThe words “of one of His Majesty’s Secretaries of State or” omitted, ibid.\n4\nSubs. by F.A.O., 1975, Art. 2 and Table.\n5Subs. by A.O., 1949.\n6The words “His majesty or by” omitted by A.O., 1961, Art. 2 and Sch. (with effect from the 23rd March, 1956).\n7Subs. by F.A.O., 1975, Art.2 and Table.\n8Subs. and shall be deemed to have been so subs. on the 14th day of October, 1955, by the Code of Civil Procedure (Amdt.) Ordinance,\n1960 (22 of 1960), s.3, for the existing sub-section (1), as amended by A.O., 1949 and the Central laws (Statute Reform) Ordinance,\n1960 (21 of 1960), s.3 and 2nd Sch.\n9\nThe Explanation which had been ins. by A.O., 1937, omitted by A.O. 1949.\n10\nSubs. and shall be deemed to have been so subs. on the 14th day of October, 1955, by Ordinance 22 of 1960, s.3.\n11\nThis section was previously amended from time to time by various enactments.\n(a)       any private immoveable property situated in Pakistan held by him in his private\ncapacity and not on behalf of the sending State for the purpose of the mission ;\n(b)       a succession in which the diplomatic agent is involved as executor,\nadministrator, heir or legatee as a private person and not on behalf of the sending\nState;\n(c)       any professional or commercial activity exercised by the diplomatic agent in\nPakistan outside his official functions.\n(2) No measures of execution shall be taken in respect of a diplomatic agent except in cases\nwhich come under clauses (a), (b) and (c) of sub-section (1) and in which such measures can be taken\nwithout infringing the inviolability of his person or of his residence.\n(3) The initiation of any proceedings in a Court by a diplomatic agent shall preclude him from\ninvoking immunity from jurisdiction under this section in respect of any counter-claim directly\nconnected with the principal claim.\n(4) The immunity of a diplomatic agent under sub-section (1) or sub-section (2) may be waived\nby the sending State; and any such waiver shall be express.\n(5) Waiver of immunity in respect of any proceedings shall not be held to imply waiver of\nimmunity in respect of any measure of execution for which a separate waiver shall be necessary.\n(6) In this section, 'diplomatic agent' in relation to a State means the head of the mission in\nPakistan of that State and includes a member of the staff of that mission having diplomatic rank.]\n1"
    },
    {
      "provision_ref": "sec387a",
      "section": "387A",
      "title": "Section 387A. [Application of sections 85 and 86 to Rulers of Acceding States, etc.] Omitted by the",
      "content": "Code of Civil Procedure (Amdt.) Act, 1972 (II of 1972), s.2."
    },
    {
      "provision_ref": "sec88",
      "section": "88",
      "title": "Section 88. Where inter pleader suit may be instituted. Where two or more persons claim adversely",
      "content": "to one another the same debt, sum of money or other property, moveable or immoveable, from another\nperson, who claims no interest therein other than for charges or costs and who is ready to pay or\ndeliver it to the rightful claimant, such other person may institute a suit of' interpleader against all the\nclaimants for the purpose of obtaining a decision as to the person to whom the payment or delivery\nshall be made and of obtaining indemnity for himself :\nProvided that where any suit is pending in which the rights of all parties can properly be\ndecided, no such suit of interpleader shall be instituted.\n1\nThis section was previously amended by various enactments from time to time.\n2\nThe heading “SUITS AGAINST RULERS OF ACCEDING AND MERGED STATES” as ins. by Ord. 22 of 1960, s.6, has been omitted by the Code\nof Civil Procedure (Amdt.) Act, 1972 (2 of 1972), s.2.\n3\nS.87A was ins. by ord. 22 of 1960, s. 6."
    },
    {
      "provision_ref": "sec89",
      "section": "89",
      "title": "Section 89. [Arbitration.] Omitted by the Arbitration Act, 1940 (X of 1940), s. 49 and Third Schedule",
      "content": "1[89A. Alternate dispute resolution.__ The Court may, where it considers necessary, having\nregard to the facts and circumstances of the case, with the object of securing expeditious disposal of a\ncase, in or in relation to a suit, adopt with the consent of the parties alternate dispute resolution\nmethod, including mediation and conciliation]."
    },
    {
      "provision_ref": "sec90",
      "section": "90",
      "title": "Section 90. Power to state case for opinion of Court. Where any persons agree in writing to state a",
      "content": "case for the opinion of the Court, then the Court shall try and determine the same in the manner\nprescribed."
    },
    {
      "provision_ref": "sec91",
      "section": "91",
      "title": "Section 91. Public nuisances",
      "content": "(1) In the case of a public nuisance the Advocate General, or two or\nmore persons having 2[with the leave of the Court], may institute a suit, though no special damage has\nbeen caused, for a declaration and injunction or for such other relief as may be appropriate to the\ncircumstances of the case.\n(2) Nothing in this section shall be deemed to limit or otherwise affect any right of suit which\nmay exist independently of its provisions."
    },
    {
      "provision_ref": "sec92",
      "section": "92",
      "title": "Section 92. Public charities",
      "content": "(1) In the case of any alleged breach of any express or constructive trust\ncreated for public purposes of a charitable or religious nature, or where the direction of the Court is\ndeemed necessary for the administration of any such trust, the Advocate General, or two or more\npersons having an interest in the trust and having obtained the 2[with the leave of the Court], may\ninstitute a suit, whether contentious or not, in the principal Civil Court of original jurisdiction or in any\nother Court empowered in that behalf by the 3[Provincial Government] within the local limits of\nwhose jurisdiction the whole or any part of the subject-matter of the trust is situate, to obtain\na decree__\n(a)        removing any trustee ;\n(b)        appointing a new trustee ;\n(c)        vesting any property in a trustee ;\n(d)        directing accounts and inquiries ;\n(e)        declaring what proportion of the trust-property or of the interest therein shall\nbe allocated to any particular object of the trust ;\n1\nIns. by ord. 34 of 02, s. 2.\n2\nSubs. by Act No. XLVIII of 2016, s.2.\n3\nSubs. by A.O., 1937.\n(f)        authorising the whole or any part of the trust-property to be let, sold, mortgaged\nor exchanged ;\n(g)        settling a scheme ; or\n(h)        granting such further or other relief as the nature of the case may require.\n(2) 1[* * *] 1[No] suit claiming any of the reliefs specified in sub-section (1) shall be instituted\nin respect of any such trust as is therein referred to except in conformity with the provisions of that\nsub- section."
    },
    {
      "provision_ref": "sec93",
      "section": "93",
      "title": "Section 93. Exercise of powers of Advocate General. The powers conferred by sections 91 and 92 on",
      "content": "the Advocate General may, 2[* * *] , be, with the previous sanction of the 3[Provincial Government],\nexercised also by the Collector or by such officer as the 3[Provincial Government], may appoint in this\nbehalf.\n_______"
    },
    {
      "provision_ref": "sec94",
      "section": "94",
      "title": "Section 94. Supplemental Proceedings. In order to prevent the ends of justice from being defeated the",
      "content": "Court may, if it is so prescribed,__\n(a)        issue a warrant to arrest the defendant and bring him before the Court to show\ncause why he should not give security for his appearance, and if he fails to\ncomply with any order for security commit him to the civil prison ;\n(b)        direct the defendant to furnish security to produce any property belonging to\nhim and to place the same at the disposal of the Court or order the attachment\nof any property ;\n(c)        grant a temporary injunction and in case of disobedience commit the person\nguilty thereof to the civil prison and order that his property be attached and\nsold ;\n(d)        appoint a receiver of any property and enforce the performance of his duties by\nattaching and selling his property ;\n(e)        make such other interlocutory orders as may appear to the Court to be just and\nconvenient."
    },
    {
      "provision_ref": "sec95",
      "section": "95",
      "title": "Section 95. Compensation, for obtaining arrest, attachment or injunction on in sufficient",
      "content": "grounds.__ (1) Where, in any suit in which an arrest or attachment has been effected or a temporary\ninjunction granted under the last preceding section,__\n(a)        it appears to the Court that such arrest, attachment or injunction was applied for\non insufficient grounds, or\n1\nOmitted and subs. by Act No. XLVIII of 2016, s.3.\n2\nThe words “outside the Presidency­towns” omitted by A.O., 1949.\n3\nSubs. by A.O., 1937.\n(b)        the suit of the plaintiff fails and it appears to the Court that there was no\nreasonable or probable ground for instituting the same,\nthe defendant may apply to the Court and the Court may, upon such application, award against\nthe plaintiff by its order such amount, not exceeding 1[ten] thousand rupees, as it deems a\nreasonable compensation to the defendant for the expense or injury caused to him :\nProvided that a Court shall not award, under this section, an amount exceeding the limits of its\npecuniary jurisdiction.\n(2) An order determining any such application shall bar any suit for compensation in respect\nof such arrest, attachment or injunction.\n_______\n2[96. Appeal from original decree.__ Save where otherwise expressly provided in the body of\nthis Code or by any other law for the time being in force, an appeal shall lie from every decree passed\nby any Court exercising original jurisdiction to the Court authorized to hear appeal from the decisions\nof such Court.\n(2) An appeal may lie from an original decree passed ex-parte.\n(3) No appeal shall lie from a decree passed by the Court with consent of the parties.]"
    },
    {
      "provision_ref": "sec97",
      "section": "97",
      "title": "Section 97. Appeal from final decree where no appeal from preliminary decree. Where any party",
      "content": "aggrieved by a preliminary decree passed after the commencement of this Code does not appeal from\nsuch decree, he shall be precluded from disputing its correctness in any appeal which may be preferred\nfrom the final decree."
    },
    {
      "provision_ref": "sec98",
      "section": "98",
      "title": "Section 98. Decision where appeal heard by two or more Judges",
      "content": "(l) where an appeal is heard by\na Bench of two or more Judges, the appeal shall be decided in accordance with the opinion of such\nJudges or of the majority (if any) of such Judges.\n(2) Where there is no such majority which concurs in a judgment varying or reversing the\ndecree appealed from, such decree shall be confirmed :\nProvided that where the Bench hearing the appeal is composed of two judges belonging to a\nCourt consisting of more than two Judges, and the Judges composing the Bench differ in opinion on a\npoint of law, they may state the point of law upon which they differ and the appeal shall then be\nheard upon that point only by one or more of the other Judges, and such point shall be decided\naccording to the opinion of the majority (if any) of the Judges who have heard the appeal, including\nthose who first heard it.\n3\n[(3) Nothing in this section shall be deemed to alter or otherwise affect any provision of the\nletters patent of any High Court.]\n1\nSubs. by Act XIV of 1994, s.8.\n2\nSubs. by Act XIX of 2023, s.9.\n3\nSub-section (3) ins. by the Repealing and Amending Act, 1928 (18 of 1928), s.2 and First Sch."
    },
    {
      "provision_ref": "sec99",
      "section": "99",
      "title": "Section 99. No decree to be reversed or modified for error or irregularity not affecting merits or",
      "content": "jurisdiction. No decree shall be reversed or substantially varied, nor shall any case be remanded, in\nappeal on account of any misjoinder of parties or causes of action or any error, defect or irregularity\nin any proceedings in the suit, not affecting the merits of the case or the jurisdiction of the Court.\n1[100. Second appeal.__ (1) Save where otherwise expressly provided in the body of this Code\nor in any other law, for the time being in force, an appeal shall lie to the High Court from every decree\npassed in appeal by any Court subordinate to that High Court, on any of the following grounds,\nnamely:__\n(a)        the decision being contrary to law or to some usage having the force of law;\n(b)        the decision having failed to determine some material issue of law or usage\nhaving the force of law; or\n(c)        a substantial error or defect in the procedure provided by this Code or by any\nother law for the time being in force, which may possibly have produced error\nor defect in the decision of the case upon the merits."
    },
    {
      "provision_ref": "sec101",
      "section": "101",
      "title": "Section 101. Second appeal on no other grounds",
      "content": "No second appeal shall lie except on the grounds\nmentioned in section 100."
    },
    {
      "provision_ref": "sec102",
      "section": "102",
      "title": "Section 102. No second appeal in certain cases",
      "content": "No second appeal shall lie in any suit except when\nthe amount or value of the subject matter of the original suit does not exceed the amount or value as\nmay be prescribed."
    },
    {
      "provision_ref": "sec103",
      "section": "103",
      "title": "Section 103. Power of High Court to determine issues of fact",
      "content": "In any second appeal, the High Court\nmay, if the evidence on the record is sufficient, determine any issue of fact necessary for disposal of\nthe appeal which has not been determined by the lower appellate Court or which has been wrongly\ndetermined by such Court by reason of any illegality, omission, error or defect such as is referred to in\nsub-section (1) of section 100.]"
    },
    {
      "provision_ref": "sec104",
      "section": "104",
      "title": "Section 104. Orders from which appeal lies",
      "content": "(1) An appeal shall lie from the following orders, and\nsave as otherwise expressly provided in the body of this Code or by any law for the time being in\nforce, from no other orders:__\n2\n[*      *          *           *          *           *          *]\n3\n[(f)   an order under section 35A;\n(ff)       an order under section 47;]\n4\n[(fff) an order under section 91 or section 92 refusing leave to institute a suit;]\n1\nSubs by Act No. XIX of 2023, s.10.\n2\nCls. (a) to (f) omitted by the Arbitration Act No. X of 1940, s. 49 and 3rd Sch.\n3\nSubs. by Ord. 12 of 1972, s.2 and Sch., for cl. (ff) which was previously ins. by the Civil Procedure (Amdt.) Act No. IX of 1922, s. 3.\n4\nIns. by Act No. XLVIII of 2016, s.4.\n(g)        an order under section 95;\n(h)        an order under any of the provisions of this Code imposing a fine or directing\nthe arrest or detention in the civil prison of any person except where such arrest\nor detention is in execution of a decree;\n(i)        any order made under rules from which an appeal is expressly allowed by rules:\n1\n[Provided that no appeal shall lie against any order specified in clause 2[(f)] save on the ground\nthat no order, or an order for the payment of a less amount, ought to have been made.]\n(2) No appeal shall lie from any order passed in appeal under this section."
    },
    {
      "provision_ref": "sec105",
      "section": "105",
      "title": "Section 105. Other orders",
      "content": "(1) Save as otherwise expressly provided, no appeal shall lie from any\norder made by a Court in the exercise of its original or appellate jurisdiction; but, where a decree is\nappealed from, any error, defect or irregularity in any order, affecting the decision of the case, may\nbe set forth as a ground of objection in the memorandum of appeal.\n(2) Notwithstanding anything contained in sub-section (1), where any party aggrieved by an\norder of remand made after the commencement of this Code from which an appeal lies does not appeal\ntherefrom, he shall thereafter be precluded from disputing its correctness.\n3[106. What Courts to hear appeals. Where an appeal from any order is allowed, it shall lie\nto the Court to which an appeal would lie from the decree in the suit in which such order was made, or\nwhere such order is made by a Court (not being a High Court) in the exercise of appellate jurisdiction,\nthen to the High Court.]"
    },
    {
      "provision_ref": "sec107",
      "section": "107",
      "title": "Section 107. Powers of Appellate Court",
      "content": "(1) Subject to such conditions and limitations as may be\nprescribed, an Appellate Court shall have power__\n(a)        to determine a case finally;\n(b)        to remand a case;\n(c)        to frame issues and refer them for trial;\n(d)        to take additional evidence or to require such evidence to be taken.\n(2) Subject as aforesaid, the Appellate Court shall have the same powers and shall perform as\nnearly as may be the same duties as are conferred and imposed by this Code on Courts of original\njurisdiction in respect of suits instituted therein."
    },
    {
      "provision_ref": "sec108",
      "section": "108",
      "title": "Section 108. Procedure in appeals from appellate decrees and orders. The provisions of this Part",
      "content": "relating to appeals from original decrees shall, so far as may be, apply to appeals__\n(a)        from appellate decrees, and\n(b)        from orders made under this Code or under any special or local law in which a\ndifferent procedure is not provided.\n1\nProviso ins. by the Civil Procedure (Amdt.) Act No. IX of 1922, s. 3.\n2\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, No. XXVII of 1981, s. 3 and Second Sch.\n3\nSubs. by Act No. XIX of 2023, s. 11.\n1\nAPPEALS TO THE 2[SUPREME COURT]\n3\n[109. When appeals, lie to the Supreme Court. An appeal from a judgment, decree or final order\nof a High Court shall lie to the Supreme Court__\n(a)        if the amount or value or the subject-matter of the dispute in the Court of first\ninstance was and also in appeal is (unless varied by an Act of Parliament) fifty\nthousand rupees or upward and the judgment, decree or final order appealed from\nhas varied or set aside the judgment, decree or final order of the Court immediately\nbelow; or\n(b)        if the judgment, decree or final order involves, directly or indirectly, some claim or\nquestion respecting property of the like amount or value and the judgment, decree\nor final order appealed from has varied or set aside the judgment, decree or final\norder of the Court immediately below; or\n(c)        if the High Court certifies that the case involves a substantial question of law as to\nthe interpretation of the Constitution.]\n4\n110.[Omitted]."
    },
    {
      "provision_ref": "sec111",
      "section": "111",
      "title": "Section 111. Bar of certain appeals. Notwithstanding anything contained in section 109, no appeal shall",
      "content": "5\nlie to [the Supreme Court]:\n(a)        from the decree or order of one Judge of a High Court 6[* * *], or of one Judge of\na Division Court, or of two or more Judges of such High Court, or of a Division\nCourt constituted by two or more Judges of such High Court, where such Judges\nare equally divided in opinion and do not amount in number to a majority of the\nwhole of the Judges of the High Court at the time being ; or\n7\n[(b)   from any decree from which, under section 102, no second appeal lies.]\n8"
    },
    {
      "provision_ref": "sec112",
      "section": "112",
      "title": "Section 112. Savings",
      "content": "9[(1) Nothing contained in this Code shall be deemed__\n(a)        to affect the powers of the Supreme Court under Article 10[191 of the Constitution\nor any other provision thereof] ; or\n(b)        to interfere with any rules made by the Supreme Court, and for the time being in\nforce, for the presentation of appeals to that Court, or their conduct before that\nCourt.]\n1\nSee also the Federal Court (Enlargement of Jurisdiction) Act No. I of 1950, s. 6 and the Privy council (Abolition of Jurisdiction) Act, 1950, s. 9.\n2\nSubs. by Adaptation Order, 1961, Art. 2 and sch., (with effect from the 23rd March, 1956).\n3\nfrom the 14th October, 1955), Adaptation Order, 1961, Art.2 and Sch. (with effect from the 23rd March, 1956), and Federal Adaptation Order, 1975,\nArt.2 and Sch. (with effect from the 14th August,1973), to read as above.\n4\nOmitted by Federal Adaptation Order, 1975, Art. 2 and Sch. (with effect from the 14th August, 1973).\n5\nSubs. by Adaptation Order, 1961, Art. 2 and Sch., (with effect from the 23rd March, 1956).\n6\nAmended by Adaptation Order, 1937 and Act No. XIII of 1916. Sch., have been Omitted by Adaptation Order, 1961, Art. 2 and Sch. (with effect from\nthe 23rd March, 1956).\n7\nSubs. by Act No. XIX of 2023, s.12.\n8\nOmitted by the Federal Court Act, 1941 (XXI of 1941), s. 2.\n9\nSubs. by Adaptation Order 1961, Art. 2 and Sch. (with effect from the 23rd March, 1956).\n10\nAmended by Adaptation Order, 1964, Art. 2 and Sch. and Federal Adaptation Order, 1975, Art. 2 and Sch. (with effect from the 14th August, 1973).\n(2) Nothing herein contained applies to any matter of criminal or admiralty or vice-admiralty\njurisdiction, or to appeals from orders and decrees of Prize Courts.\nREFERENCE, REVIEW AND REVISION"
    },
    {
      "provision_ref": "sec113",
      "section": "113",
      "title": "Section 113. Reference to High Court. Subject to such conditions and limitations as may be prescribed,",
      "content": "any Court may state a case and refer the same for the opinion of the High Court, and the High Court may\nmake such order thereon as it thinks fit.\n1\n[114. Review.__ (1) Subject as aforesaid, any person considering himself aggrieved by a degree or\norder from which__\n(a)        an appeal is allowed by this Code, but from which no appeal has been preferred; or\n(b)        no appeal is allowed by this Code,\nmay apply for a review of judgment to the Court which passed the degree or made the order, and the Court\nmay make such order thereon as it think fit.]\n1\n[115. Revision.__ (1) A High Court may call for the record of any case which has been decided by\nany Court subordinate to that High Court and in which no appeal lies thereto, and if such subordinate Court\nappears__\n(a)        to have exercised a jurisdiction not vested in it by law; or\n(b)        to have failed to exercise a jurisdiction so vested; or\n(c)        to have acted in the exercise of its jurisdiction illegally or with material irregularity,\nthe High Court may make such order in the case as it thinks fit:\nProvided that where a person makes an application under this sub-section, he shall, in support of\nsuch application, furnish copies of the pleadings, documents and order of the subordinate Court and the\nHigh Court shall, except for reasons to be recorded, dispose of such application without calling for the\nrecord of the subordinate Court:\nProvided further that such application shall be made within ninety days of the decision of the\nsubordinate Court which shall provide a copy of such decision within three days thereof and the High Court\nshall dispose of such application within six months.\n(2) A District Court may exercise the powers conferred on the High Court by sub-section (1) in\nrespect of any case decided by a Court subordinate to that District Court in which no appeal lies and the\namount or value of the subject-matter whereof does not exceed the limits of the appellate jurisdiction of\nthe District Court.\n(3) If an application under sub-section (1) in respect of a case within the competence of the District\nCourt has been made either to the High Court or the District Court, no further such application shall be\nmade to either of them.\n(4) No proceedings in revision shall be entertained by the High Court against an order made under\nsub-section (2) by the District Court.]\n1\nSubs. by Act No. XIX of 2023, s. 13-14.\nSPECIAL PROVISION RELATING TO 1[* *] HIGH COURTS"
    },
    {
      "provision_ref": "sec117",
      "section": "117",
      "title": "Section 117. Application of Code to High Courts. Save as provided in this Part or in Part X or in",
      "content": "rules, the provisions of this Code shall apply to 1[*] High Courts."
    },
    {
      "provision_ref": "sec118",
      "section": "118",
      "title": "Section 118. Execution of decree before ascertainment of costs. Where any 3* High Court considers",
      "content": "it necessary that a decree passed in the exercise of its original civil jurisdiction should be executed\nbefore the amount of the costs incurred in the suit can be ascertained by taxation, the Court may order\nthat the decree shall be executed forthwith, except as to so much thereof as relates to the costs;\nand, as to so much thereof as relates to the costs, that the decree may be executed as soon as\nthe amount of the costs shall be ascertained by taxation."
    },
    {
      "provision_ref": "sec119",
      "section": "119",
      "title": "Section 119. Unauthorised persons not to address Courts. Nothing in this Code shall be deemed to",
      "content": "authorise any person on behalf of another to address the Court in the exercise of its original civil\njurisdiction, or to examine witnesses, except where the Court shall have in the exercise of the power\nconferred by its charter authorised him so to do, or to interfere with the power of the High Court to\nmake rules concerning advocates, vakils and attorneys."
    },
    {
      "provision_ref": "sec120",
      "section": "120",
      "title": "Section 120. Provisions not applicable to High Court in original civil jurisdiction",
      "content": "(1) The\nfollowing provisions shall not apply to the High Court in the exercise of its original civil jurisdiction,\nnamely, sections 16, 17 and 20.\n4\n[*     *          *          *          *          *          *]"
    },
    {
      "provision_ref": "sec121",
      "section": "121",
      "title": "Section 121. Effect of rules in First Schedule. The rules in the First Schedule shall have effect as if",
      "content": "enacted in the body of this Code until annulled or altered in accordance with the provisions or this Part."
    },
    {
      "provision_ref": "sec122",
      "section": "122",
      "title": "Section 122. Power of certain High Courts to make rules. 4[ The High Courts] 5[* * *] may, from",
      "content": "time to time after previous publication, make rules regulating their own procedure and the procedure\nof the Civil Courts subject to their superintendence, and may by such rules annul, alter or add to all or\nany of the rules in the First Schedule.\n1\nOmitted by the Central Laws (Statute Reform) Ordinance, No. XXI of 1960, s.3 and 2nd Sch. (with effect from the 14th October,1955).\n2\nAmended by Adaptation Order., 1937 and Act No. XIII of 1916, Sch., have been omitted by Ordinance No. XXI of 1960. s.3 and 2nd Sch. (with effect\nfrom the 14th October, 1955).\n3\nSub-section (2) omitted by the Presidency-towns Insolvency Act No. III of 1909, s. 127 and Third Sch.\n4\nSubs. by the Central Laws (Statute Reform) ordinance, No. XXI of 1960,s. 3 ad 2nd Sch. (with effect from the 14th October, 1955) and the Government\nof India Act, 1935’’ as amended by Adaptation Order, 1937, Adaptation Order, 1949 and the Oudh Courts (Supplementary) Act No. XXXII of 1925, s.2\nand Sch.\n5\nOmitted by the Repealing and Amending Act No. XI of 1923, s. 3 and Second Sch. and subs. by the repealing and Amending Act No. XVIII of 1919, s.\n2 and First Sch."
    },
    {
      "provision_ref": "sec123",
      "section": "123",
      "title": "Section 123. Constitution of Rules Committees in certain Provinces",
      "content": "(1) A Committee, to be called\nthe Rule Committee, shall be constituted at 1[the town which is the usual place of sitting of each of the\nHigh Courts 2[* * *] 3[* * *] referred to in section 122].\n(2) Each such Committee shall consist of the following persons, namely:__\n(a)        three Judges of the High Court established at the town at which such Committee\nis constituted, one of whom at least has served as a District Judge or 4* * * a\nDivisional Judge for three years,\n5\n[*     *           *          *          *          *           *]\n5\n[(c)      two advocates practising in that Court, and]\n(d)        a Judge of a Civil Court subordinate to the High Court,\n5\n[*     *           *          *          *          *           *]\n(3) The members of each such Committee shall be appointed by the Chief Justice 6[* * *] who\nshall also nominate one of their member to be President:\nProvided that, if the Chief Justice 6[* * *] elects to be himself a member of a Committee, the\nnumber of other Judges appointed to be members shall be two, and the Chief Justice 6[* * *] shall be\nthe President of the Committee.\n(4) Each member of any such Committee shall hold office for such period as may be prescribed\nby the Chief Justice 6[* * *] in this behalf; and whenever any member retires, resigns, dies or ceases\nto reside in the Province in which the Committee was constituted, or becomes incapable of acting as a\nmember of the Committee, the said Chief Justice 6[* * *] may appoint another person to be a member\nin his stead.\n(5) There shall be a Secretary to each such Committee, who shall be appointed by the Chief\nJustice 6[* * *] and shall receive such remuneration as may be provided in this behalf 7[by the\nProvincial Government]."
    },
    {
      "provision_ref": "sec124",
      "section": "124",
      "title": "Section 124. Committee to report to High Court. Every Rule Committee shall make a report to the",
      "content": "High Court established at the town at which it is constituted on any proposal to annul, alter or add to\nthe rules in the First Schedule or to make new rules, and before making any rules under section 122\nthe High Court shall take such report into consideration.\n8"
    },
    {
      "provision_ref": "sec125",
      "section": "125",
      "title": "Section 125. [Omitted]",
      "content": "1\nSubs. by the Amending Act No. XIII 1916, s. 2 and Sch.\n2\nIns. by Act No. XXXII of 1925, s. 2 and Sch., were omitted by Adaptation Order, 1949.\n3\nOmitted by Act No. XI of 1923, s. 2 and First Sch and previously subs by Act No. XVIII of 1919, s. 2 and First Sch.\n4\nSubs. by s. 2 and First Sch. of Act No. XVIII of 1919, and were subsequently omitted by s. 3 and Second Sch. of Act No. XI of 1923.\n5\nClause (b) omitted, clause (c) subs., and clause (e) omitted by the Federal Laws (Revision and Declaration) Ordinance, No. XVII of 1981, s. 3 and\nSecond Sch.\n6\nOmitted by the Central Laws (Statute Reforms) Ordinance, No. XXI of 1960, s. 3 and 2nd Sch. (with effect from the 14th October, 1955).\n7\nSubs. by Adaptation Order, 1937.\n8\nOmitted by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), S.3 and 2nd Sch. (with effect from the 14th October, 1955).\n1[126. Rules to be subject to approval. Rules made under the foregoing provisions shall be\nsubject to the previous approval of the Government of the Province in which the Court whose\nprocedure the rules regulate is situate or, if that Court is not situate in any Province, to the previous\napproval of the 2[Federal Government]."
    },
    {
      "provision_ref": "sec127",
      "section": "127",
      "title": "Section 127. Publication of rules. Rules so made and 3[approved] shall be published in the 4[official",
      "content": "Gazette * * *], and shall from the date of publication or from such other date as may be specified have\nthe same force and effect, within the local limits of the jurisdiction of the High Court which made\nthem, as if they had been contained in the First Schedule."
    },
    {
      "provision_ref": "sec128",
      "section": "128",
      "title": "Section 128. Matters for which rules may provide",
      "content": "(1) Such rules shall be not inconsistent with the\nprovisions in the body of this Code, but, subject thereto, may provide for any matters relating to the\nprocedure of Civil Courts.\n(2) In particular, and without prejudice to the generality of the powers conferred by sub-section\n(1), such rules may provide for all or any of the following matters, namely:__\n(a)        the service of summonses, notices and other processes by post or in any other\nmanner either generally or in any specified areas, and the proof of such service;\n(b)        the maintenance and custody, while under attachment, of live-stock and other\nmoveable property, the fees payable for such maintenance and custody, the sale\nof such live-stock and property, and the proceeds of such sale;\n(c)        procedure in suits by way of counterclaim, and the valuation of such suits for\nthe purposes of jurisdiction;\n(d)        procedure in garnishee and charging orders either in addition to, or in\nsubstitution for, the attachment and sale of debts ;\n(e)        procedure where the defendant claims to be entitled to contribution or indemnity\nover against any person whether a party to the suit or not;\n(f)        summary procedure__\n(i)        in suits in which the plaintiff seeks only to recover a debt or liquidated\ndemand in money payable by the defendant, with or without interest,\narising on a contract express or implied; or\non an enactment where the sum sought to be recovered is a fixed sum of\nmoney or in the nature of a debt other than a penalty; or\non a guarantee, where the claim against the principle is in respect of a\ndebt or a liquidated demand only; or\non a trust; or\n1\nSubs. by Adaptation Order, 1937, for s. 126 as amended by the Amending Act No. XIII of 1916, Sch.\n2\nSubs. by Federal Adaptation Order, 1975, Art.2 and Sch. which had been subs. by Adaptation Order, 1961, Art. 2 (with effect from the 23rd March,\n1956).\n3\nSubs. by the Repealing and Amending Act No. XXVII of 1917, s. 2 and First Sch.\n4\nSubs. by Adaptation Order, 1937, para 4 (1).\n(ii)       in suits for the recovery of immoveable property, with or without a claim\nfor rent or mesne profits, by a landlord against a tenant whose term has\nexpired or has been duly determined by notice to quit, or has become\nliable to forfeiture for non-payment of rent, or against persons claiming\nunder such tenant;\n(g)       procedure by way of originating summons;\n(h)       consolidation of suits, appeals and other proceedings;\n(i)       delegation to any Registrar, Prothonotary or master or other official of the Court\nof any judicial, quasi-judicial and non­judicial duties; and\n(j)       all forms, registers, books, entries and accounts which may be necessary or\ndesirable for the transaction of the business of Civil Courts.\n1\n[(3) The High Court shall make rules, not inconsistent with the provisions of this Code, for\ncase management and scheduling conferences binding the parties to follow the schedules and timelines\nprescribed therein.]"
    },
    {
      "provision_ref": "sec129",
      "section": "129",
      "title": "Section 129. Power of 2[*] the High Courts to make rules as to their original civil procedure",
      "content": "Notwithstanding anything in this Code, any High Court 3[* * *] may make such rules not inconsistent\nwith 4[its Letters Patent] to regulate its own procedure in the exercise of its original civil jurisdiction\nas it shall think fit, and nothing herein contained shall affect the validity of any such rules in force at\nthe commencement of this Code."
    },
    {
      "provision_ref": "sec131",
      "section": "131",
      "title": "Section 131. Publication of rules. Rules made in accordance with section 129 6[* * *] shall be",
      "content": "published in the 7[official Gazette * * *] and shall from the date of publication or from such other date\nas may be specified have the force of law."
    },
    {
      "provision_ref": "sec132",
      "section": "132",
      "title": "Section 132. Exemption of certain women from personal appearance",
      "content": "(1) Women who, according\nto the customs and manners of the country7 ought not to be compelled to appear in public shall be\nexempt from personal appearance in Court.\n(2) Nothing herein contained shall be deemed to exempt such women from arrest in execution\nof civil process in any case in which the arrest of women is not prohibited by this Code.\n1\nIns. by Act No. VII of 2020, s. 16.\n2\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, No. XVII of 1981, s. 3 and Second Sch.\n3\nAmended by Adaptation Order, 1937 and the Amending Act No. XIII of 1916, Sch., have been omitted by the Central Laws (Statute Reform)\nOrdinance, No. XXI of 1960, s.3 and 2nd Sch. (with effect from the 14th October, 1955).\n4\nSubs. by Ordinance, No. XXI of 1960, s. 3 and 2nd Sch. (with effect from the 14th October, 1955).\n5\nOmitted by Adaptation Order, 1961, Art. 2 and Sch. (with effect from the 23rd March, 1956).\n6\nOmitted by Adaptation Order, 1961, Art. 2 and Sch. (with effect from the 23rd March, 1956).\n7\nSubs. by Adaptation Order, 1937, para 4(1)."
    },
    {
      "provision_ref": "sec133",
      "section": "133",
      "title": "Section 133. Exemption of other persons",
      "content": "(1) The 1[Provincial Government] may, by notification2\nin the 1[official Gazette], exempt from personal appearance in Court any person whose rank, in the\nopinion of such Government, entitles him to the privilege of exemption.\n(2) The names and residences of the persons so exempted shall, from time to time, be forwarded\nto the High Court by the 1[Provincial Government] and a list of such persons shall be kept in such\nCourt, and a list of such persons as reside within the local limits of the jurisdiction of each Court\nsubordinate to the High Court shall be kept in such subordinate Court.\n(3) Where any person so exempted claims the privilege of such exemption, and it is\nconsequently necessary to examine him by commission, he shall pay the costs of that commission,\nunless the party requiring his evidence pays such costs."
    },
    {
      "provision_ref": "sec134",
      "section": "134",
      "title": "Section 134. Arrest other than in execution of decree. The provisions of sections 55, 57 and 59 shall",
      "content": "apply, so far as may be, to all persons arrested under this Code."
    },
    {
      "provision_ref": "sec135",
      "section": "135",
      "title": "Section 135. Exemption from arrest under civil process",
      "content": "(1) No Judge, Magistrate or other judicial\nofficer shall be liable to arrest under civil process while going to, presiding in, or returning from, his\nCourt.\n(2) Where any matter is pending before a tribunal having jurisdiction therein, or believing in\ngood faith that it has such jurisdiction, the parties thereto, their pleaders, mukhtars, revenue-agents and\nrecognized agents, and their witnesses acting in obedience to a summons, shall be exempt from arrest\nunder civil process other than process issued by such tribunal for contempt of Court while going to or\nattending such tribunal for the purpose of such matter, and while returning from such tribunal.\n(3) Nothing in sub-section (2) shall enable a judgment-debtor to claim exemption from arrest\nunder an order for immediate execution or where such judgment-debtor attends to show cause why he\nshould not be committed to prison in execution of a decree.\n3[l35A. Exemption of members of Legislative bodies from arrest and detention under civil\nprocess.__ (1) No person shall be liable to arrest or detention in prison under civil process__\n6\n[(a)   if he is member of a 4[*] Legislature 4[* * *] 5[* * *] ,during the continuance\nof any meeting of such Legislature 4[* *];]\n(b)        if he is a member of any committee of such 1[Legislature 4* * *], during the\ncontinuance of any meeting of such committee;\n6\n[*      *          *          *           *          *          *]\n1\nSubs. by Adaptation Order, 1937.\n2\nFor such notifications, see the different local Rules and Orders.\n3\nS. 135A ins. by the Legislative Members Exemption Act, 1925 (23 of 1925), s.3.\n4\nOmitted by Adaptation Order, 1949.\n5\nOmitted by Adaptation Order, 1961, Art. 2 and Sch. (with effect from the 23rd March, 1956).\n6\nThe original cl. (c) was first subs. by Adaptation Order, 1937 and then omitted by Adaptation Order, 1949.\nand during the fourteen days before and after such meeting or sitting.\n(2) A person released from detention under sub-section (1) shall, subject to the provisions of\nthe said sub-section, be liable to re-arrest and to the further detention to which he would have been\nliable if he had not been released under the provisions of sub-section (1).]"
    },
    {
      "provision_ref": "sec136",
      "section": "136",
      "title": "Section 136. Procedure where person to be arrested or property to be attached is outside district",
      "content": "(1) Where an application is made that any person shall be arrested or that property shall be attached\nunder any provision of this Code not relating to the execution of decrees, and such person resides or\nsuch property is situate outside the local limits of the jurisdiction of the Court to which the application\nis made, the Court may, in its discretion, issue a warrant of arrest or make an order of attachment, and\nsend to the District Court within the local limits of whose jurisdiction such person or property resides\nor is situate a copy of the warrant or order, together with the probable amount of the costs of the arrest\nor attachment.\n(2) The district Court shall, on receipt of such copy and amount, cause the arrest or attachment to\nbe made by its own officers, or by a Court subordinate to itself, and shall inform the Court which issued or\nmade such warrant or order of the arrest or attachment\n(3) The Court making an arrest under this section shall send the person arrested to the Court by\nwhich the warrant of arrest was issued, unless he shows cause to the satisfaction of the former Court why\nhe should not be sent to the latter Court, or unless he furnishes sufficient security for his appearance before\nthe latter Court or for satisfying any decree that may be passed against him by that Court, in either of which\ncases the Court making the arrest shall release him.\n1\n[*     *         *          *          *         *          *]"
    },
    {
      "provision_ref": "sec137",
      "section": "137",
      "title": "Section 137. Language of subordinate Courts",
      "content": "(1) The language which, on the commencement of this\nCode, is the language of any Court subordinate to a High Court shall continue to be the language of such\nsubordinate Court until the 2[Provincial Government] otherwise directs.\n(2) The 2[Provincial Government] may declare what shall be the language of any such Court and\nin what character applications to and proceedings in such Courts shall be written.\n(3) Where this Code requires or allows anything other than the recording of evidence to be done in\nwriting in any such Court, such writing may be in English; but if any party or his pleader is unacquainted\nwith English a translation into the language of the Court shall, at his request, be supplied to him; and the\nCourt shall make such order as it thinks fit in respect of the payment of the costs of such translation."
    },
    {
      "provision_ref": "sec138",
      "section": "138",
      "title": "Section 138. Power of High Court to require evidence to be recorded in English",
      "content": "(1) The 3[High Court]\nmay, by notification in the 2[official Gazette], direct with respect to any Judge specified in the notification,\nor failing under a description set forth therein, that evidence in cases in which an appeal is allowed shall\nbe taken down by him in the English language and in manner prescribed.\n(2) Where a Judge is prevented by any sufficient reason from complying with a direction under\nsub-section (1), he shall record the reason and cause the evidence to be taken down in writing from his\ndictation in open Court.\n1\nAmended by Adaptation Order, 1937, has been omitted by Adaptation Order, 1949.\n2\nSubs. by Adaptation Order, 1937.\n3\nSubs. by the Decentralization Act, No. IV of 1914, s.2 and Sch., Pt. I."
    },
    {
      "provision_ref": "sec139",
      "section": "139",
      "title": "Section 139. Oath on affidavit by whom to be administered. In the case of any affidavit under this Code",
      "content": "(a)        any Court or Magistrate, or\n(b)        any officer or other person whom a High Court may appoint in this behalf, or\n1\n(c)    any officer appointed by any other Court which the 2[Provincial Government] has\ngenerally or specially empowered in this behalf,\nmay administer the oath to the deponent."
    },
    {
      "provision_ref": "sec140",
      "section": "140",
      "title": "Section 140. Assessors in causes of savages, etc.__ (1) In any Admiralty or Vice",
      "content": "Admiralty cause of\nsalvage, towage or collision, the Court, whether it be exercising its original or its appellate jurisdiction,\nmay, if it thinks fit, and shall upon request of either party to such cause, summon to its assistance, in\nsuch manner as it may direct or as may be prescribed, two competent assessors; and such assessors\nshall attend and assist accordingly.\n(2) Every such assessor shall receive such fees for his attendance, to be paid by such of the\nparties as the Court may direct or as may be prescribed.\n3[141. Miscellaneous proceedings.__ The procedure provided in this Code with regard to suits\nshall be followed, as far as it can be made applicable, in all proceedings in any Court of civil\njurisdiction.]"
    },
    {
      "provision_ref": "sec142",
      "section": "142",
      "title": "Section 142. Orders and notices to be in writing. All orders and notices served on or given to any",
      "content": "person under the provisions of this Code shall be in writing."
    },
    {
      "provision_ref": "sec143",
      "section": "143",
      "title": "Section 143. Postage. Postage, where chargeable on a notice, summons or letter issued under this Code",
      "content": "and forwarded by post, and the fee for registering the same, shall be paid within a time to be fixed\nbefore the communication is made:\nProvided that the 2[Provincial Government] 4[* * *] may remit such postage, or fee, or both, or\nmay prescribe a scale of court-fees to be levied in lieu thereof."
    },
    {
      "provision_ref": "sec144",
      "section": "144",
      "title": "Section 144. Application for restitution",
      "content": "(1) Where and in so far as a decree is varied or reversed,\nthe Court of first instance shall, on the application of any party entitled to any benefit by way of\nrestitution or otherwise, cause such restitution to be made as will, so far as may be, place the parties\nin the position which they would have occupied but for such decree or such part thereof as has been\nvaried or reversed; and, for this purpose, the Court may make any orders, including orders for the\nrefund of costs and for the payment of interest, damages, compensation and mesne profits, which are\nproperly consequential on such variation or reversal.\n1\nGaz. Of P. 1956, Pt. 1. p. 294.\n2\nSubs. by Adaptation Order, 1937.\n3\nSubs. by Act No. XIX of 2023, s.15.\n4\nOmitted by the Devolution Act, No. XXXVIII of 1920), s.2 and first Sch., Pt.I.\n(2) No suit shall be instituted for the purpose of obtaining any restitution or other relief which\ncould be obtained by application under sub-section (1)."
    },
    {
      "provision_ref": "sec145",
      "section": "145",
      "title": "Section 145. Enforcement of liability of surety. Where any person has become liable as surety",
      "content": "(a)         for the performance of any decree or any part thereof, or\n(b)         for the restitution of any property taken in execution of a decree, or\n(c)         for the payment of any money, or for the fulfillment of any condition imposed\non any person, under an order of the Court in any suit or in any proceedings\nconsequent thereon,\nthe decree or order may be executed against him, to the extent to which he has rendered himself\npersonally liable, in the manner herein provided for the execution of decrees, and such person\nshall, for the purposes of appeal, be deemed a party within the meaning of section 47:\nProvided that such notice as the Court in each case thinks sufficient has been given to the\nsurety."
    },
    {
      "provision_ref": "sec146",
      "section": "146",
      "title": "Section 146. Proceedings by or against representatives. Save as otherwise provided by this Code or",
      "content": "by any law for the time being in force, where any proceeding may be taken or application made by or\nagainst any person, then the proceeding may be taken or the application may be made by or against\nany person claiming under him."
    },
    {
      "provision_ref": "sec147",
      "section": "147",
      "title": "Section 147. Consent or agreement by person under disability. In all suits to which any person under",
      "content": "disability is a party, any consent or agreement, as to any proceeding shall, if given or made with the\nexpress leave of the Court by the next friend or guardian for the suit, have the same force and effect as\nif such person, were under no disability and had given such consent or made such agreement."
    },
    {
      "provision_ref": "sec148",
      "section": "148",
      "title": "Section 148. Enlargement of time. Where any period is fixed or granted by the Court for the doing of",
      "content": "any act prescribed or allowed by this Code, the Court may, in its discretion, from time to, enlarge such\nperiod, even though the period originally fixed or granted may have expired."
    },
    {
      "provision_ref": "sec149",
      "section": "149",
      "title": "Section 149. Power to make up deficiency of court",
      "content": "fees. Where the whole or any part of any fee\nprescribed for any document by the law for the time being in force relating to court-fees has not been\npaid, the Court may, in its discretion, at any stage, allow the person, by whom such fee is payable, to\npay the whole or part, as the case may be, of such court­fee; and upon such payment the document, in\nrespect of which such fee is payable, shall have the same force and effect as if such fee had been paid\nin the first instance."
    },
    {
      "provision_ref": "sec150",
      "section": "150",
      "title": "Section 150. Transfer of business. Save as otherwise provided, where the business of any Court is",
      "content": "transferred to any other Court, the Court to which the business is so transferred shall have the same\npowers and shall perform the same duties as those respectively conferred and imposed by or under this\nCode upon the Court from which the business was so transferred."
    },
    {
      "provision_ref": "sec151",
      "section": "151",
      "title": "Section 151. Saving of inherent powers of Court. Nothing in this Code shall be deemed to limit or",
      "content": "otherwise affect the inherent power of the Court 1[to be exercised after recording reasons] to make\n1\nIns. by Act No. VII of 2020, s.18.\nsuch orders as may be necessary for the ends of justice or to prevent abuse of the process of the Court."
    },
    {
      "provision_ref": "sec152",
      "section": "152",
      "title": "Section 152. Amendment of judgments, decrees or orders. Clerical or arithmetical mistakes in",
      "content": "judgments, decrees or orders or errors arising therein from any accidental slip or omission may at any\ntime be corrected by the Court either of its own motion or on the application of any of the parties."
    },
    {
      "provision_ref": "sec153",
      "section": "153",
      "title": "Section 153. General power to amend. The Court may at any time, and on such terms as to costs or",
      "content": "otherwise as it may think fit, amend any defect or error in any proceeding in a suit; and all necessary\namendments shal1 be made for the purpose of determining the real question or issue raised by or\ndepending on such proceeding."
    },
    {
      "provision_ref": "sec157",
      "section": "157",
      "title": "Section 157. Continuance of orders under repealed enactments. Notifications published,",
      "content": "declarations and rules made, places appointed, agreements filed, scales prescribed, forms framed,\nappointments made and powers conferred under Act VIII of 1859 or under any Code of Civil Procedure\nor any Act amending the same or under any other enactment hereby repealed shall, so far as they are\nconsistent with this Code, have the same force and effect as if they had been respectively published,\nmade, appointed, filed, prescribed, framed and conferred under this Code and by the authority\nempowered thereby in such behalf."
    },
    {
      "provision_ref": "sec158",
      "section": "158",
      "title": "Section 158. Reference to Code of Civil Procedure and other repealed enactments. In every",
      "content": "enactment or notification passed or issued before the commencement of this Code in which reference\nis made to or to any Chapter or section of Act VIII of 1859 or any Code of Civil Procedure or any Act\namending the same or any other enactment hereby repealed, such reference shall, so far as may be\npracticable, be taken to be made to this Code or to its corresponding Part, Order, section or rule.\n4[159. Saving of proceedings.__ All proceedings instituted prior to the commencement of the\nCode of Civil Procedure (Amendment) Act, 2023 (Act of 2023) shall be deemed to be the proceedings\nof, and dealt in accordance with, the provisions of this Code which existed prior to the aforesaid\ncommencement.\nExplanation.__ In this section, the expression “proceedings” includes suit, appeal, review,\nrevision, execution applications or any other proceedings and any matter incidental thereto.]\n1\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, No. XXVII of 1981, s.3and Second Sch.\n2\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, No. XXVII of 1981, s.3 and Second Sch.\n3\nRep. by the Second Repealing and Amending Act No. XVII of 1914, s.3 and Second Sch.\n4\nSubs. by Act No. XIX of 2023, s. 16.\n(See section 121)\n________"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Who may be joined as plaintiffs. All Persons may be joined in one suit as plaintiffs in",
      "content": "whom any right to relief in respect of or arising out of the same act or transaction or series of acts or\ntransactions is alleged to exist, whether jointly, severally or in the alternative, where, if such persons\nbrought separate suits, any common question of law or fact would arise."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Power of Court to order separate trials. Where it appears to the Court that any joinder of",
      "content": "plaintiffs may embarrass or delay the trial of the suit, the Court may put the plaintiffs to their election\nor order separate trials or make such other order as may be expedient."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Who may be joined as defendants. All persons may be joined as defendants against whom",
      "content": "any right to relief in respect of or arising out of the same act or transaction or series of acts or\ntransactions is alleged to exist, whether jointly, severally or in the alternative, where, if separate suits\nwere brought against such persons, any common question of law or fact would arise."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Joinder of parties liable on same contract. The plaintiff may, at his option, join as parties",
      "content": "to the same suit all or any of the persons severally, or jointly and severally, liable on any one contract,\nincluding parties to bills of exchange, hundis and promissory notes."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. When plaintiff in doubt from whom redress is to be sought. Where the plaintiff is in",
      "content": "doubt as to the person from whom he is entitled to obtain redress, he may join two or more defendants\nin order that the question as to which of the defendants is liable, and to what extent, may be determined\nas between all parties."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Appearance of one of several plaintiffs of defendants for others",
      "content": "(1) where there are\nmore plaintiffs than one, any one or more of them may be authorized by any other of them to appear,\nplead or act for such other in any proceeding ; and in like manner, where there are more defendants\nthan one, any one or more of them may be authorized by any other of them to appear, plead or act for\nsuch other in any proceeding.\n(2) The authority shall be in writing signed by the party giving it and shall be filed in Court."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Where service may be on male member of defendant’s family. Where in any suit the",
      "content": "defendant cannot be found and has no agent empowered to accept service of the summons on his\nbehalf, service may be made on any adult male member of the family of the defendant who is residing\nwith him.\nExplanation.__ A servant is not a member of the family within the meaning of this rule."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Service in foreign territory through Political Agent or Court. Where",
      "content": "(a)         in the exercise of any foreign 5[or extra provincial jurisdiction vested in the\n6\n[Federal Government]], a Political Agent has been appointed, or a Court has been\nestablished or continued, with power to serve a summons issued by a Court under\nthis Code in any foreign territory in which the defendant resides, or\n1\nThe words and figures “or rule 22” omitted by A.O., 1949.\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2nd Sch. (with effect from the 14th October, 1955), for “the Provinces\nand the Capital of the Federation” which had been subs. by A.O., 1949, for “British India”.\n3\nIns. by the Code of Civil Procedure (Amdt.) Act, 1950 (68 of 1950), s.2 (with effect from the 1st September, 1951).\n1\nProvisions of s.29 have been applied to__\n(i)the Civil Courts in the Federation of Malaya in so far as the Chief Commissioner’s Province of Baluchistan and the Capital of the Federation are\nconcerned, see Gaz. of P., 1949, Pt.I, P.258 and ibid., Pt.II A, P. 68\n(ii)all Civil and Revenue Courts of India; and service by any Civil or Revenue Court of India of any summons issued under the Code of Civil Procedure,\n1908, by a Court of the Province of Sind shall be deemed to be valid, see Sind Government Gazette, Extraordinary, dated 3rd July, 1952. Pt. I, P. 437.\n(iii)all Civil and Revenue Courts in India and Service by such Courts of any summons issued under the said Code by a Court in the N.W.F.P, Baluchistan\nor Karachi shall be deemed to be valid service, see N.W.F.P Government Gazette, 1952, Pt. I, P. 248 and Gaz., of P. 1952, Pt. I, P. 119 and ibid., Pt. VI,\np. 126.\n(iv)all Civil and Revenue Courts in India; and that service by such Courts of any summons issued under the said Code by a Court in Khairpur State shall\nbe deemed to be valid service, see Khairpur State Gazette, Ext., 1952, dated the 18th September, 1952.\n(v)all Civil and Revenue Courts in India; and service by such Courts of any summons issued under the said Code by a Court in the Bahawalpur State\nshall be deemed to be valid service, see Bahawalpur Govt. Gazette, dated the 2nd October, 1952.\n(vi)all Civil and Revenue Courts of India; and service by any civil or Revenue Court in India, within whose jurisdiction the person to be served resides\nof any summons issued by a Court under the said Code shall be deemend to be valid service, see Punjab Gazette, Ext., 1951, dated the 1st September,\n1951, p. 1743.\n(vii)all Civil and Revenue Courts in the Union of Burma, in respect of Baluchistan; and service by such Courts of any summons issued under the said\nCode by a Court in Baluchistan shall be deemed to be valid service see Gaz. of P., Ext., 1954, p. 1873.\n(viii)all Civil and Revenue Courts in the Union of Burma, in respect of Karachi; and service by such Courts of any summons issued under the said Code\nby a Court in Karachi shall be deemed to be valid service, see Gaz. of p., Extra., 1954, p. 1997.\n(ix)all Civil and Revenue Courts of the Union of Burma; and service by such Courts of Summonss issued under the said Code by A Court in East Bengal\nshall be deemed to be valid service, see Dacca Gazette, Ext., dated 18th October, 1954, Pt. I, p. 3053.\n(x)all Civil and Revenue Courts of the Union of Burma; and service by such Courts of any summons issued under the said Code by a Court in the N.W.F.P,\nshall be deemed to be valid service, see N.W.F.P, Gazette, 1954, Pt. I, p. 523.\n(xi)all Civil and Revenue Courts of the Union of Burma; and service by such Courts of any summons issued under the said Code by a Court in the\nProvince of Punjab, shall be deemed to be valid service, see Gaz. of Punjab, 1954, Pt. I, p. 843.\n(xii)all Civil and Revenue Courts of the Union of Burma; and service by such Courts of any summons issued under the said Code by a Court in the\nProvince of Sind, shall be deemed to be valid service, w.e.f. 18th October, 1954, see Gaz. of Sind, 1954, pt I, p. 940.\n(xiii)all Civil and Revenue Courts in the Federal Republic of Germany; and service by such Courts of summons issued under the said Code by a Court in\nBaluchistan shall be deemed to be valid service, see Gaz. of P. 1955, Pt. I, p. 126.\n(xiv)the summonses issued by any Civil or Revenue Courts in Pakistan may be sent to the Courts in the Union of Burma and served as if they had been\nissued by such Courts, see Gaz of 1955, P.I, p. 143.\n(xv)service by any Court situated in Pakistan, of any summons issued by a Court of the Union of Burma shall be deemed to be valid service, see Gaz. of\nP., 1955, Pt. I, p. 143.\n(xvi)all Civil and Revenue Courts in the Federal Republic of Germany an services by such Courts of any summons issued under the said Code by a Court\nin Karachi, shall be deemed to be valid service, with effect on and from the 1st June, 1955, see Gaz. Of P., 1955, Pt. VI, p. 102.\n(xvii)all Civil and Revenue Courts in the Federal Republic of Germany; and service by such Courts of any summons issued under the said Code by a\nCourt in the Province of East Bengal shall be deemed to be valid service see Dacca Gazette, 1955, Pt. I, p. 1051.\n(xviii)all Civil Courts in Switzerland and the service by such Courts of any summons issued under the Code (C.Pr.C.) by a Court in the Province of W.\nPakistan shall be deemed to be valid service, see W.P. Gaz., 1959, Ext. p. 843.\n5\nSubs. by A.O., 1949, for “jurisdiction vested in His Majesty or in [the Central Govt. or the Crown Representative]”. The words in crotchet had been\nsubs., for “the G.G in C.” by A.O., 1937.\n6\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n1          2\n[(b)    [the Provincial Government] has, by notification in the 3[official Gazette],\ndeclared4, in respect of any Court situate in any such territory and not\nestablished or continued in the exercise of any such jurisdiction as aforesaid,\nthat service by such Court of any summons 5[issued under this Code by a Court\nof the Province] shall be deemed to be valid service,]\nthe summons may be sent to such Political Agent or Court, by post or otherwise, for the purpose\nof being served upon the defendant ; and, if the Political Agent or Court returns the summons\nwith an endorsement signed by such Political Agent or by the Judge or other officer of the\nCourt that the summons has been served on the defendant in manner hereinbefore directed,\nsuch endorsement shall be deemed to be evidence of service.\n6[26A. Service on civil public officer or on servant of railway company or local authority,\nin India. where the defendant is a servant (not belonging to the military, naval or air forces) of any\nGovernment in India, or a servant of a railway company or local authority in India, the summons\ntogether with a copy of it to be retained by the defendant shall be sent, with a request that it may be\nserved on the defendant,__\n(a)        in the case of a defendant serving in connection with the affairs of the\nGovernment of India or a servant of a Railway in India, to the Secretary to the\nGovernment of India in the Ministry of Home Affairs, and\n(b)        in the case of a defendant serving in connection with the affairs of any other\nGovernment in India, or in the case of a servant of a local authority in India, to\nthe Home Secretary to that Government or, as the case may be, to the Home\nSecretary to the Government in whose territories the local authority has its\njurisdiction.]"
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Duty of person to whom summons is delivered or sent for services",
      "content": "(1) Where a\nsummons is delivered or sent to any person for service under rule 24, rule 27 or rule 28, such person\nshall be bound to serve it, if possible, and to return it under his signature, with the written\nacknowledgement of the defendant, and such signature shall be deemed to be evidence of service.\n(2) Where from any cause service is impossible, the summons shall be returned to the Court\nwith a full statement of such cause and of the steps taken to procure service, and such statement shall\nbe deemed to be evidence of non-service."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Decree for immoveable property",
      "content": "(1) Where a decree is for the delivery of any\nimmoveable property, possession thereof shall be delivered to the party to whom it has been adjudged,\nor to such person as he may appoint to receive delivery on his behalf, and, if necessary, by removing\nany person bound by the decree who refuses to vacate the property.\n(2) Where a decree is for the joint possession of immoveable property, such possession shall\nbe delivered by affixing a copy of the warrant in some conspicuous place on the property and\nproclaiming by beat of drum, or other customary mode, at some convenient place, the substance of the\ndecree.\n(3) Where possession of any building or enclosure is to be delivered and the person in\npossession, being bound by the decree, does no afford free access, the Court, through its officers, may,\nafter giving reasonable warning and facility to any woman not appearing in public according to the\ncustoms of the country to withdraw, remove or open any lock or bolt or break open any door or do any\nother act necessary for putting the decree-holder in possession."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Attachment in case of decree for rent or mesne profits or other matter, amount of",
      "content": "which to be subsequently determined. Where a decree directs an inquiry as to rent or mesne profits\nor any other matter, the property of the judgment-debtor may, before the amount due from him has\nbeen ascertained, be attached, as in the case of an ordinary decree for the payment of money.\n1\nSubs. by the Code of Civil Procedure (Amdt.) Act, 1936 (21 of 1936), s.4, for the original rule 40.\n2\nSubs. and Omitted by Act XIV of 1994, s.11"
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Attachment of agricultural produce. Where the property to be attached is agricultural",
      "content": "produce, the attachment shall be made by affixing a copy of the warrant of attachment,__\n(a)     where such produce is a growing crop, on the land on which such crop has\ngrown, or\n(b)     where such produce has been cut or gathered, on the threshing-floor or place for\ntreading out grain or the like or fodder-stack on or in which it is deposited,\nand another copy on the outer door or on some other conspicuous part of the house in which the\njudgment-debtor ordinarily resides or, with the leave of the Court, on the outer door or on some other\nconspicuous part of the house in which he carries on business or personally works for gain or in which\nhe is known to have last resided or carried on business or personally worked for gain ; and the produce\nshall thereupon be deemed to have passed into the possession of the Court."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Provisions as to agricultural produce under attachment",
      "content": "(1) Where agricultural\nproduce is attached, the Court shall make such arrangements for the custody thereof as it may deem\nsufficient and, for the purpose of enabling the Court to make such arrangements, every application for\nthe attachment of a growing crop shall specify the time at which it is likely to be fit to be cut or\ngathered.\n(2) Subject to such conditions as may be imposed by the Court in this behalf either in the order\nof attachment or in any subsequent order, the judgment-debtor may tend, cut, gather and store the\nproduce and to any other act necessary for maturing or preserving it; and if the judgment­debtor fails\nto do all or any of such acts, the decree-holder may, with the permission of the Court and subject to\nthe like conditions, do all or any of them either by himself or by any person appointed by him in\nthis behalf, and the costs incurred by the decree-holder shall be recoverable from the judgment-debtor\nas if they were included in, or formed part of, the decree.\n(3) Agricultural produce attached as a growing crop shall not be deemed to have ceased to be\nunder attachment or to require re-attachment merely because it has been severed from the soil.\n(4) Where an order for the attachment of a growing crop has been made at a considerable time\nbefore the crop is likely to be fit to be cut or gathered, the Court may suspend the execution of the\norder for such time as it thinks fit, and may, in its discretion make a further order prohibiting the\nremoval of the crop pending the execution of the order of attachment.\n(5) A growing crop which from its nature does not admit of being stored shall not be attached\nunder this rule at any time less than twenty days before the time at which it is likely to be fit to be cut\nor gathered."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Attachment of salary or allowances of public officer or servant of railway company",
      "content": "or local authority.__ (1) Where the property to be attached is the salary or allowance of a 1[servant of\nthe State] or of a servant of a company or local authority, the Court, whether the judgment-debtor or\nthe disbursing officer is or is not within the local limits of the Court's jurisdiction, may order that\nthe amount shall, subject to the provisions of section 60, be withheld from such salary or allowances\neither in one payment or by monthly instalments as the Court may direct; and, upon notice of the\norder to such officer as 2[the appropriate Government may by notification in the official Gazette]\nappoint 3[in this behalf,__\n(a)         where such salary or allowances are to be disbursed within the local limits to\nwhich this Code for the time being extends, the officer or other person whose\nduty it is to disburse the same shall withhold and remit to the Court the amount\ndue under the order, or the monthly installments, as the case may be;\n1\nThe original words “public officer” were first subs. by the Code of Civil Procedure (Amdt.) Act, 1943, (5 of 1943) s.3, and then amended by A.O. , 1961,\nArt. 2 and Sch. (with effect from the 23rd March, 1956), to read as above.\n2\nSubs. by the Repealing and Amending Act, 1942 (25 of 1942), s. 3 and Second Sch., for “the Central Governemnt or the Provincial Governemnt may by\nnotification in their official Gazette” which had been subs., by A.O., 1937, for “the Govt. may by notification in the Gazette of India or in the local official\nGazette, as the case may be.”\n3\nSubs. by the Code of Civil Procedure (Amdt.) Act, 1939 (26 of 1939), s.2, for certain words.\n(b)        where such salary or allowances are to be disbursed beyond the said limits, the\nofficer or other person within those limits whose duty it is to instruct the\ndisbursing authority regarding the amount of the salary or allowances to be\ndisbursed shall remit to the Court the amount due under the order, or the\nmonthly installments, as the case may be, and shall direct the disbursing\nauthority to reduce the aggregate of the amounts from time to time be disbursed\nby the aggregate of the amounts from time to time remitted to the Court.]\n(2) Where the attachable proportion of such salary or allowances is already being withheld and\nremitted to a Court in pursuance of a previous and unsatisfied order of attachment, the officer appointed\nby 1[the appropriate Government] in this behalf shall forthwith return the subsequent order to the Court\nissuing it with a full statement of all the particulars of the existing attachment.\n(3) Every order made under this rule, unless it is returned in accordance with the provisions of\nsub- rule (2), shall, without further notice or other process, bind 2[the appropriate Government] or\nthe railway company or local authority, as the case may be, while the judgment debtor is within the\nlocal limits to which this Code for the time being extends and while he is beyond those limits if he is\nin receipt of any salary or allowances payable out of 3[the revenues of the 4[Federal Government] or a\nProvincial Government] or the funds of a railway company carrying on business in any part of\n5\n[Pakistan] or local authority in 5[Pakistan]; and 2[the appropriate Government] or the railway\ncompany or local authority, as the case may be, shall be liable for any sum paid in contravention of\nthis rule.\n6\n[Explanation.__ In this rule “appropriate Government” means__\n(i)        as respects any 7[person] in the service of the 4[Federal Government], or any\nservant 8* * * of a cantonment authority or of the port authority of\na major port, the 4[Federal Government] ;\n9\n[*      *          *          *           *          *          *]\n(iii)      as respects any other 10[Servant of the State] or a servant of any 11[*]railway or\nlocal authority, the Provincial Government.]"
    },
    {
      "provision_ref": "sec57",
      "section": "57",
      "title": "Section 57. Determination of attachment. Where any property has been attached in execution of a",
      "content": "decree but by reason of the decree-holder’s default the Court is unable to proceed further with the\napplication for execution, it shall either dismiss the application or for any sufficient reason adjourn\nthe proceedings to a future date. Upon the dismissal of such application the attachment shall cease.\nInvestigation of Claims and Objections"
    },
    {
      "provision_ref": "sec58",
      "section": "58",
      "title": "Section 58. Investigation of claims to, and objections to attachment of, attached property",
      "content": "(1)\nWhere any claim is preferred to, or any objection is made to the attachment of, any property attached\nin execution of a decree on the ground that such property is not liable to such attachment, the Court\nshall proceed to investigate the claim or objection with the like power as regards the examination of\nthe claimant or objector, and in all other respects, as if he was a party to the suit:\n1\n[Provided that no such investigation shall be made where it appears to the Court that the claim\nor objection (whether made before or after the sale) has been designedly or unnecessarily delayed, or\nwas not made within a reasonable time or within one year of the date of the first attachment of the said\nproperty in the execution of the said decree, whichever is earlier, unless the claimant or objector__\n(a)        proves title acquired in good faith and for consideration subsequent to the date\nof the first attachment ;\n(b)        Proves that his predecessors-in-interest, whether their interest existed at the time\nof such attachment or was acquired thereafter, fraudulently omitted to make a\nclaim or objection ; and\n(c)        impleads all such predecessors-in-interest, as parties.].\n(2) Postponement of sale. Where the property to which the claim or objection applies has been\nadvertised for sale, the Court ordering the sale may postpone it pending the investigation of the claim\nor objection.\n2[59. Evidence to be adduced by claimant. The claimant or objector must adduce evidence\nto show that at the date of the attachment he had a title to, or right or interest in, the property attached."
    },
    {
      "provision_ref": "sec67",
      "section": "67",
      "title": "Section 67. Mode of making proclamation",
      "content": "(1) Every proclamation shall be made and published, as\nnearly as may be, in the manner prescribed by rule 54, sub-rule (2).\n(2) Where the Court so directs, such proclamation shall also be published in the 1[official\nGazette] or in a local newspaper, or in both, and the costs of such publication shall be deemed to be\ncosts of the sale.\n(3) Where property is divided into lots for the purpose of being sold separately, it shall not be\nnecessary to make a separate proclamation for each lot unless proper notice of the sale cannot, in the\nopinion of the Court, otherwise be given."
    },
    {
      "provision_ref": "sec74",
      "section": "74",
      "title": "Section 74. Sale of agricultural produce",
      "content": "(1) Where the property to be sold is agricultural produce,\nthe sale shall be held,__\n(a)     if such produce is a growing crop, on or near the land on which such crop has\ngrown, or,\n(b)     if such produce has been cut or gathered, at or near the threshing-floor or place\nfor treading out grain or the like or fodder-stack on or in which it is deposited:\nProvided that the Court may direct the sale to be held at the nearest place of public resort, if it\nis of opinion that the produce is thereby likely to sell to greater advantage.\n(2) Where, on the produce being put up for sale,__\n(a)     a fair price, in the estimation of the person holding the sale, is not offered for it,\nand\n(b)     the owner of the produce or a person authorized to act in his behalf applies to\nhave the sale postponed till the next day or, if a market is held at the place of\nsale, the next market-day,\nthe sale shall be postponed accordingly and shall be then completed, whatever price may be offered\nfor the produce."
    },
    {
      "provision_ref": "sec79",
      "section": "79",
      "title": "Section 79. Delivery of moveable property, debts and shares",
      "content": "(1) Where the property sold is\nmoveable property of which actual seizure has been made, it shall be delivered to the purchaser.\n(2) Where the property sold is moveable property in the possession of some person other than\nthe judgment-debtor, the delivery thereof to the purchaser shall be made by giving notice to the person\nin possession prohibiting him from delivering possession of the property to any person except the\npurchaser.\n(3) Where the property sold is a debt not secured by a negotiable instrument, or is a share in a\ncorporation, the delivery thereof shall be made by a written order of the Court prohibiting the creditor\nfrom receiving the debt or any interest thereon, and the debtor from making payment thereof to any\nperson except the purchaser, or prohibiting the person in whose name the share may be standing from\nmaking any transfer of the share to any person except the purchaser, or receiving payment of any\ndividend or interest thereon, and the manager, secretary or other proper officer of the corporation from\npermitting any such transfer or making any such payment to any person except the purchaser."
    },
    {
      "provision_ref": "sec80",
      "section": "80",
      "title": "Section 80. Transfer of negotiable instruments and shares",
      "content": "(1) Where the execution of a\ndocument or the endorsement of the party in whose name a negotiable instrument or a share in a\ncorporation is standing is required to transfer such negotiable instrument or share, the Judge or such\nofficer as he may appoint in this behalf may execute such document or make such endorsement as may\nbe necessary, and such execution or endorsement shall have the same effect as an execution or\nendorsement by the party.\n(2) Such execution or endorsement may be in the following form, namely:__\nA.B by C.D., Judge of the Court of (or as the case may be), in a suit by E.F against A.B.\n(3) Until the transfer of such negotiable instrument or share, the Court may, by order, appoint\nsome person to receive any interest or divided due thereon and to sign a receipt for the same; and any\nreceipt so signed shall be as valid and effectual for all purposes as if the same had been signed by the\nparty himself."
    },
    {
      "provision_ref": "sec86",
      "section": "86",
      "title": "Section 86. Procedure in default of payment. In default of payment within the period mentioned in",
      "content": "the last preceding rule, the deposit may, if the Court thinks fit, after defraying the expenses of the sale,\nbe forfeited to the Government, and the property shall be re-sold, and the defaulting purchaser shall\nforfeit all claim to the property or to any part of the sum for which it may subsequently be sold."
    },
    {
      "provision_ref": "sec87",
      "section": "87",
      "title": "Section 87. Notification on re",
      "content": "sale. Every re-sale of immoveable property, in default of payment of\nthe purchase-money within the period allowed for such payment, shall be made after the issue of a\nfresh proclamation in the manner and for the period hereinbefore prescribed for the sale."
    },
    {
      "provision_ref": "sec96",
      "section": "96",
      "title": "Section 96. Delivery of property in occupancy of tenant. Where the property sold is in the occupancy",
      "content": "of a tenant or other person entitled to occupy the same and a certificate in respect thereof has been\n1\nSubs. by the Law Reforms Ordinance 1972 (12 of 1972), s.2 and Sch., for full-stop.\n2\nProviso added ibid.\ngranted under rule 94, the Court shall, on the application of the purchaser, order delivery to be made\nby affixing a copy of the certificate of sale in some conspicuous place on the property, and\nproclaiming to the occupant by beat of drum or other customary mode, at some convenient place,\nthat the interest of the judgment-debtor has been transferred to the purchaser.\nResistance to Delivery of Possession to Decree-holder Or Purchaser"
    },
    {
      "provision_ref": "sec100",
      "section": "100",
      "title": "Section 100. Dispossession by decree",
      "content": "holder or purchaser.__ (1) Where any person other than the\njudgment-debtor is dispossessed of immovable property by the holder of a decree for the possession\nof such property or, where such property has been sold in execution of a decree, by the purchaser\nthereof, he may make an application to the Court complaining of such dispossession.\n(2) The Court shall fix a day for investigating the matter and shall summon the party against\nwhom the application is made to appear and answer the same."
    },
    {
      "provision_ref": "sec8b",
      "section": "8B",
      "title": "Section 8B. Definitions of “Government” and “Government pleader. In this Order",
      "content": "“ [Government]” and “5[Government]” pleader means respectively__\n5\n(a)        in relation to any suit by or against 9[* * *] the 10[Federal Government], or\nagainst a public officer in the service of that Government, the 10[Federal\nGovernment] and such pleader as that Government may appoint whether\ngenerally or specially for the purposes of this Order;\n11\n(b)          [*       *          *          *          *          *]\n1\nThe original words “Governemnt pleader” were first subs. by A.O., 1937, and than amended by A.O., 1961, Art.2 and Sch. (with effect from the 23rd\nMarch, 1956) to read as above.\n2\nThe original words “the Secretary of State for India in Council” were first subs. by A.O., 1937 and then amended by A.O., 1961, Art. 2 and Sch (with\neffect from the 23rd March, 1956). to read as above.\n3\nThe orignal words \"the Government were first subs. by A.O., 1937, and then amended by A.O., 1961, Art.2 and Sch. (with effect from the 23rd March,\n1956) to read as above.\n4\nFor notifn. Under these rules, see Gaz. Of P. 1956, Pt. 1, p. 486.\n5\nSubs. by A.O., 1961, Art. 2 and Sch. for “Crown” (with effect from the 23rd Marach, 1956).\n6\nThe original words “the Government pleader” have successively been amended by A.O., 1937, and A.O., 1961, Art. 2 and Sch. (with effect the 23rd\nMarch, 1956), to read as above.\n7\nThe original words “the Government pleader\" have successively been amended by A.O., 1937, and A.O., 1961, Art. 2 and Sch. (with effect from the\n23rd March, 1956), to read as above.\n8\nRules 8A and 8B were ins. by A.O., 1937.\n9\nThe words “the Secretary of State or “omitted by A.O., 1949.\n10\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n11\nCl. (b) omitted by A.O., 1949.\n(c)         in relation to any suit by or against a Provincial Government or against a public\nofficer in the service of a Province, the Provincial Government and the Government\npleader, or such other pleader as the Provincial Government may appoint, whether\ngenerally or specially, for the purposes of this Order.]\n_____________\n1\n[ORDER XXVIIA\nSUITS INVOLVING 2[ANY SUBSTANTIAL QUESTION AS TO THE INTERPRETATION OF\nCONSTITIONAL LAW]."
    },
    {
      "provision_ref": "sec417",
      "section": "417",
      "title": "Section 417. [Appeals to the Federal Court]. Omitted by the Federal Court Act 1941 (XXI of 1941), S.2",
      "content": "_______\n1\nSubs. by A.O., 1961, Art. 2 andSch., for “His Majesty in Council” (with effect from the 23rd March, 1956).\n2\nSub-rule (3) omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s.3 and Second Sch., which was previously amended\nby various enacments, from time to time.\n3\nSub-section (4) ins. by the Indian Limitation and Code of Civil Procedure (Amdt.) Act, 1920 (26 of 1920), s.5.\n4\nThis section was ins. by A.O., 1937."
    }
  ],
  "definitions": []
}
