{
  "id": "pk-companies-appointment-of-trustees-act-1972",
  "type": "statute",
  "title": "Companies (Appointment of Trustees) Act, 1972",
  "title_en": "Companies (Appointment of Trustees) Act, 1972",
  "short_name": "COTA",
  "status": "in_force",
  "issued_date": "1972-09-23",
  "in_force_date": "1972-09-23",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2Np-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Companies (Appointment of Trustees) Act, 1972 (XV of 1972) published by The Pakistan Code (Companies Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, application and commencement",
      "content": "(1) This Act may be called the\nCompanies (Appointment of Trustees) Act, 1972.\n(2) It extends to the whole of Pakistan.\n(3) It applies only to companies the object of which are not confined to one Province.\n(4) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Act to override other laws. This Act shall have effect notwithstanding anything contained",
      "content": "in the Companies Act, 1913 (VII of 1913), or in any other law for the time being in force or in any\nagreement, contract or memorandum pr articles of association."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(a)         “assets” include all rights and powers and properties, whether movable or\nimmovable, cash balances, reserve funds, investments, deposits and all other\ninterests and rights in or to or arising out of any such property and the books of\naccounts and documents;\n(b)         “company” has the same meaning as in the Companies Act, 1913 (VII of 1913);\nand\n(c)         “trustee” in relation to a company means the trustee appointed under section 4\nin respect of such company."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Appointment of trustees",
      "content": "(1) If the Federal Government is of opinion that it is necessary\nin the public interest so to do, the Federal Government may, by notification in the official Gazette,\nappoint a trustee in respect of a company the registered office of which is located in Pakistan beyond\nthe Provinces of Baluchistan, the North-West Frontier, the Punjab and Sind on such terms and\nconditions as may be determined by the Federal Government.\n(2) The trustee shall hold office during the pleasure of the Federal Government.\n(3) The trustee may, by writing under his own hand addressed to the Federal Government,\nresign his office.\n1\nFor Statement of Objects and Reasons, see Gaz. of P., 1972, Ext. Pt. HI, p. 406."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Management of company to vest in trustee",
      "content": "(1) Upon the appointment of a trustee under\nsection 4 in respect of a company, the management of the affairs of such company in so far as they\nrelate to its business and assets and liabilities in the Provinces referred to in that section and all such\nassets and liabilities shall vest in that trustee and any person or authority-exercising or having the right\nto exercise immediately before such appointment any power or function in relation to the management\nof such affairs shall cease to exercise or to have the right to exercise such power to function.\n(2) The trustee appointed in respect of a company shall, where necessary, open on behalf of\nsuch a company, with a branch of the National Bank of Pakistan an account to which he shall credit\nfrom time to time all moneys received by him on behalf or on the account of the company after\ndeducting therefrom such amount representing the expenses of the management of the affairs of the\ncompany as he may determine with the approval of the Federal Government.\n(3) Every trustee appointed in respect of a company shall keep proper account of all income\nand expenditure received or incurred by him on account of company.\n(4) Where a trustee is appointed in respect of a company, the Federal Government may, by\norder, remove from office any officer howsoever designated performing or having the right to perform\nany function in relation to the management of the affairs of the company in so far as they relate to its\nassets or liabilities referred to in sub-section (1)."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. All assets to be delivered to trustee. No officer of a company, nor any other person, shall",
      "content": "retain or fail to deliver to the trustee any assets which vest in the trustee under section 5."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Powers of trustee. The trustee appointed in respect of a company shall exercise all the",
      "content": "powers and functions of the Board of Directors of the company in so far as they relate to the assets and\nliabilities of the company in the Provinces referred to in section 4."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Transfer of assets prohibited. No person shall transfer any of the assets of a company in",
      "content": "respect of which a trustee has been appointed or create any charge or encumbrance on such assets and\nany transfer made or charge or encumbrance created in contravention of this section shall be void."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Liabilities of company. When a trustee is appointed in respect of a company, only such",
      "content": "liabilities of the company shall be deemed to be liabilities relating to the assets of the company vested\nin the trustee as may be determined by such authority and in such manner as may be prescribed by\nrules made under this Act."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Amounts payable to trustee",
      "content": "(1) Any amount payable to a company in respect of which\na trustee has been appointed shall be paid to the trustee by the person liable to pay the same.\n(2) Any person who makes a payment under sub-section (1) shall be discharged from further\nliability to pay to the extent of the payment so made.\n(3) Any payment made otherwise than in accordance with sub-section (1) shall not discharge\nthe person paying it from his obligation to pay the amount due, and shall not affect the right of the\ntrustee to enforce such obligation against any such person."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Instructions to trustee prohibited. No person shall, except on the authority of the Federal",
      "content": "Government, give any instructions to the trustee, nor shall any person in any manner obstruct him in\nthe discharge of his functions."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Bar of jurisdiction, etc",
      "content": "(1) No court shall call in question, or permit to be called in\nquestion, anything done or any action taken or purporting to be done or taken under this Act.\n(2) No court shall grant any injunction or make any order, nor shall any such court entertain\nany proceedings, in relation to anything done or intended or purported to be done under this Act.\n(3) No suit, prosecution or other legal proceeding shall lie against the Federal Government or\nnotification issued thereunder."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Power to make rules. The Federal Government may, by notification in the official Gazette,",
      "content": "make such rules1 as appear to it to be necessary or expedient for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Delegation of powers. The Federal Government may, by notification in the official",
      "content": "Gazette, direct that all or any of its powers under this. Act shall, subject to such conditions, if any, as\nmay be specified in the notification, be exercised by such officer or authority as may be so specified."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Removal of difficulties. If any difficulty arises in giving effect to any provision of this Act,",
      "content": "including an order modifying the provisions of the memorandum or articles of association of company,\nas it considers necessary or expedient for the purpose of removing of that difficulty."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. [Repeal.] Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981",
      "content": "(XXVII of 1981), s. 3 and Sch.., II.\n___________\nDate: 11-11-2024\n1\nFor the Companies (Appointment of Trustees) Rules, 1973 see S.R.O. No. 643(I)/73. dt. 12-5-73. Gaz. of P.. 1973. Ext., (Islamabad) Pt, II. p. 754."
    }
  ],
  "definitions": []
}
