{
  "id": "pk-companies-profits-workers-participation-act-1968",
  "type": "statute",
  "title": "Companies Profits (Workers Participation) Act, 1968",
  "title_en": "Companies Profits (Workers Participation) Act, 1968",
  "short_name": "CPPA",
  "status": "in_force",
  "issued_date": "1968-07-04",
  "in_force_date": "1968-07-04",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJub-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Companies Profits (Workers Participation) Act, 1968 (XII of 1968) published by The Pakistan Code (Labour Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Companies\nProfits (Workers Participation) Act, 1968.\n(2)       It extends to the whole of Pakistan.\n(3)       It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.",
      "content": "In this Act, unless there is anything repugnant in the subject or context,__\n(a)     “Board” in relation to a Fund means a Board of Trustees constituted\nunder section 4 for the management and administration of the Fund;\n(b)        “company” means a company within the meaning of                                                    2\n[ Companies\nOrdinance, 1984 (XLVII of 1984)], and includes—\n(i)      a body corporate established by or under any law for the time being\nin force;\n(ii)     any institution, organization or association whether incorporated or not,\ndeclared by the 3 [ Federal Government] in the official Gazette to\nbe a company for the purposes of this Act;\n(c)        “Fund” means a Workers Participation Fund established under section 3;\n(d)        “Profits” in relation to a company means such of the “net Profits ” as\ndefined in section 87C of the Companies Act, 1913, as are attributable to its\nbusiness, trade, undertakings or other operations in Pakistan;\n4\n[(dd) “rules” means rules made under this Act;]\n_________________________________________________________________________________\n1\nFor Statement of Objects and Reasons, see Gaz., of P., 1968, Extraordinary, p. 461.\n*The Act has been applied to the Provincially Administered Tribal Areas or to the parts or those areas to which it does not already apply, see\nRegulation No. 1 of 1972, s. 2 and Sch.\n2\nSubs. and ins. by Act IV of 2007, s. 7 sub-sect.(1) clauses (a) & (b) (w.e.f. 1-7-2007).\n3\nSubs. and shall be deemed to have been so subs. by the Labour Laws (Amdt.) Act, 1975 (11 of 1975), s. 2 and Sch., for “Central\nGovernment” w.e.f. 14-8-1973).\n4\nClause (dd) added by the Companies Profit (Workers Participation) (Amdt.) Ordinance, 1970, (12 of 1970), s.2.\n(e)        “scheme” means the scheme set out in the Schedule;\n1\n[(f)    “worker” in relation to a company, means an employee of the company\n2\n[,including employed by or through the contractors,] who falls within the\ndefinition of a worker as defined in clause (xxx) of section 2 of the Industrial\nRelations Ordinance, 2002 (XCI of 2002) and has been 2[working for or in]\nthe company for a period of not less than six months.]\n3\n[3. Establishment of Fund. — (1) Every company to which the scheme applies shall__\n(a)        establish a Workers Participation Fund in accordance with the scheme as\nsoon as the accounts for the year in which the scheme becomes applicable\nto it are finalised, but not later than nine months after the close of that year;\n4\n[*]\n5\n[(b)   subject to adjustments, if any, pay every year to the Fund not later than\nnine months after the close of that year five percent of its profits during such\nyear 6[* * *]; and\n(c)        furnish to the Federal Government and the Board, not later than nine\nmonths after the close of every year of account, its audited accounts for that\nyear, duly signed by its auditors.]\n(2) The amount paid to the Fund under clause (b) of sub-section (1) in relation to a year\nshall be deemed to have been allocated to the Fund on the first day of the year next succeeding that\nyear."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Management of the Fund",
      "content": "(1) As soon as may be 7[but not later than two\nmonths], after the establishment by a company of a Fund under section 3, there shall be constituted\na Board of Trustees consisting of the following trustees, namely:—\n(a)       two persons elected by the workers of the company from amongst themselves;\nand\n(b)       two persons nominated by the management of the company of whom at least\none shall be a person from the accounts branch of the company.\n(2) The person’s bolding office as trustees shall elect for one year a person to be the\nchairman of the Board alternately from amongst the trustees elected under clause (a) of sub-section\n(I) and those nominated under clause (b) of that sub-section, the first Chairman being from\namongst the latter.\n(3) A trustee shall, unless he sooner ceases to represent the interest he was elected or\nnominated to represent, hold office for such term and on such conditions as may be prescribed by\nrules.\n1\nSubs. by Act. III of o6, s.7.\n2\nIns. and Subs. by Act IV of 2007, s. 7 (w.e.f. 1-7-2007).\n3\nSubs. by the Companies Profits; Workers’ Participation) (Amdt.) Ordinance, 1970 (12 of 1970) s. 3, for the original sections 3 and 4.\n4\nThe word “and” omitted by the Labour Laws (Amdt.) Act, 1977 (17 of 1977), s. 2 and Sch.\n5\nSubs. ibid., for Cl. (b). which was previously amended by various enactments.\n6\nOmitted by Act IV of 07,s.7 (with effect from 01-07-2007).\n7\nIns. by the Labour Laws (Amdt.) Act, 1977 (17 of 1977), s. 2 and Sch.\n(4) All decisions of the Board shall be expressed in terms of the opinion of the majority of\nthe trustees and in the event of the trustees being equally divided in their opinions, the Chairman\nshall have and exercise a second or casting vote.\n(5) The Board shall manage and administer the Fund in accordance with the provisions of\nthis Act, the scheme and any rules made in this behalf.\n(6) The Board shall, in the exercise of its powers and performance of its functions under this\nAct, be subject to such directions as the 1 [Federal Government] may from time to time give.\n(7) The 1[Federal Government], if it is of opinion that a trustee or a Board has been\npersistently failing in the performance of his or its functions or has generally been acting in a\nmanner inconsistent with the objects and interests of the Fund, may, after giving such trustee or, as\nthe case may be, the Board, an opportunity of showing cause against it, by order, __\n(a)     remove such trustee from his office or direct that the Board shall stand\nsuperseded for such period as may be specified in the order; and\n(b)     direct that, pending the election or nomination of a person in place of the trustee\nremoved from office or, as the cast may be, the re-constitution of the Board, the\npowers and functions of the trustee so removed or the Board shall be exercised\nand performed by a person specified in the order.\n(8) A casual vacancy in the office of a trustee shall be filled as soon as may be by the\nelection or, as the case may be, nomination of another person and the person elected or nominated to\nfill such vacancy shall hold office for the unexpired term of his predecessor.\n(9) Upon the supersession of a Board under sub-section (7) the trustees in that Board shall\ncease to hold office and references to the Board in this Act, the scheme and the rules shall be\nconstrued as references to the officer specified in the order under that sub-section.\n(10) Before the expiry of the period of supersession, the Board shall be re-constituted in\naccordance with the provisions of this Act so as to enable it to take over its functions upon the\nexpiry of such period.\n(11) No act or proceeding of the Board shall be invalid or questioned merely on the ground\nof the existence of a vacancy in, or defect in the constitution of the Board.]"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Penalty",
      "content": "2 [ (1) Where a company to which the scheme applies fails to comply with\nany of the provisions of this Act or the scheme, every director, manager or other officer\nresponsible for the management of the affairs of the company, shall, if the Federal\nGovernment by order so directs, pay by way of penalty a sum which may extend to five thousand\nrupees and, in case of a continuing failure, a further sum which may extend to one thousand rupees\nfor every day after the first during which the failure continues.]\n(3) A penalty imposed by an order under sub-section 3 [(1)] shall, if it is not paid within\nthe time specified in the order, be recoverable as an arrears of land revenue.\n1\nSubs. and shall be deemed to have been so subs. by the Labour Laws (Amdt.) Act, 1975 (11 of 1975) s. 2 and Sch. for “Central\nGovernment” (w.e.f.14-8-73)\n2\nSubs. by the Labour Laws (Amdt.) Act, 1977 (17 of 1977), s. 2 and Sch. for sub-sections (1) and (2).\n3\nSubs.ibid. for “(2)”\n(4) The 1[Federal Government] may, upon an application made in this behalf by any person\naggrieved by an order made under sub-section (1) 2 [*     *      *] within a period of six months\nfrom the date of the order, review the order and may, upon such review, pass such order as it may\nthink fit.\n3\n[(5) Notwithstanding anything contained in this Act or the scheme, if any defaulting\nemployer strictly complies with the provisions of section 3 and distributes the benefits in accordance\nwith paragraph 4 of the scheme for the period of default on or before the date fixed by the Federal\nGovernment, no such penalty shall be imposed and the company shall not be liable to pay interest as\nprovided in paragraph 2 of the scheme.]\n4\n[6. Power to call for information. __ The 1[Federal Government] may, at any time, call\nupon a company or a Board to furnish it with such information and documents, including the\nrecords of the proceedings of the company or the Board, as may be relevant or useful for the\npurpose of, or necessary for ensuring proper compliance with, the provisions of this Act, the rules\nand the scheme."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Settlement of disputes, etc",
      "content": "(1) Any difference arising between the Board and the\ncompany relating to the administration of the scheme shall be reported to the 1[ Federal\nGovernment] whose decision thereon shall be final.\n(2) All claims of a worker relating to the benefits of the scheme, whether against the\nBoard or the company, shall be settled in the same manner as is provided for in the Payment of\nWages Act, 1936 (IV of 1936), for the settlement of claims arising out of deductions from wages."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Delegation of power.",
      "content": "The 1[Federal Government) may, by notification in the official\nGazette, direct that all or any of its powers or functions under this 5[Ordinance] may, subject to such\nlimitations, restrictions or conditions, if any, as may be specified in the notification, be exercised or\nperformed also by any officer subordinate to it or by any authority so specified.\n7\n[8A. Power to exempt.⸻ The Federal Government may, through notification in the official\nGazette,⸻\n(a)        declare that any company or class of companies shall be exempt from the\napplication of the scheme; and\n(b)        exempt any company or class of companies from any amount payable under\nsection 3 of this Act.]"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Power to make rules.",
      "content": "The 1 [Federal Government] may make rules6 to carry out the\npurposes of this Act."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Act to override other laws.",
      "content": "The provisions of this Act shall have effect\nnotwithstanding anything contained in any other law for the time being in force, or in any\ncontract or the memorandum or articles of association of a company.]\n1\nSubs. and shall be deemed to have been so subs. by the Labour Laws (Amdt.) Act, 1975 (11 of 1975), s. 2 and Sch. for “Central\nGovernment”. (w.e.f. 14-8-73).\n2\nThe words “or sub-section (2)” omitted by Act 17 of 1977 s.2 and Sch.\n3\nAdded by Act III of 06, s.7.\n4\nSubs. by the Companies Profits (Workers Participation) (Amendment) Ordinance, 1970 (12 of 1970) s. 4 for the original sections 6 and 7.\n5\nSic. Should read “Act”.\n6\nFor Companies Profits (Workers Participation) Rules, 1971, see Gazette of Pakistan, 1971, Extraordinary, page 1038.\n7\nIns. by Act. no. XXXV of 2022.\n[ See Section 2(e)]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Workers drawing average monthly wages exceeding fifteen thousand",
      "content": "rupees.]\n(b)            The average monthly wages shall be rounded up to the nearest Rs.10.\n(c)            The number of units available to each category of workers shall be\ndivided equally among all the workers in that category to determine the share\nof each workers of that category.\n5\n[(d)       Notwithstanding anything contained in this scheme, no worker shall, in any\none year, be entitled out of the annual allocation to units exceeding rupees\n6\n[the amount of 4 [four] times of the minimum wages for unskilled workers as\ngiven in the schedule of Minimum Wages for unskilled Workers Ordinance,\n1969 (W.P. Ord. XX of 1969)] in value in so far as such allocation is relatable\nto 7 [* * *] of clause b of sub-section (1) of section 3. Any amount left out of\nannual allocation after the units have been so allocated shall be transferred\nto the Fund constituted under section 3 of the Workers Welfare Fund\nOrdinance, 1971 (XXXIV of 1971). No part of such amount shall be deemed\nto be included in the asset value of the Fund established under this Act and no\nindividual worker shall have any lien on this amount by virtue of holding any\nunits].\n1\nSubs. and shall be deemed to have been so subs. by the Labour Laws (Amdt.) Act, 1975 (11 of 1975), s. 2 and Sch., for “Central\nGovernment”, (w.e.f. 14-8-73).\n2\nSubs. by the Companies Profits (Workers Participation) (Amendment) Ordinance, 1970 (12 of 1970), section 5, for the original paras 3 and\n4.\n3\nSubs. by the Labour Laws (Amdt.) Ordinance, 1972 (9 of 1972), s. 2 and Sch., for cl. (a).\n4\nSubs. by Act IV of 07.\n5\nSubs. by the Labour Laws (Amdt.) Ordinance 1972 (9 of 1972), s. 2 and, Sch., for cl. (d)\n6\nSubs by Act III of 2006, s. 7.\n7\nThe words “sub-clause (i) of “omitted by the Companies profits (Workers Participation) (amdt.), Act 1973 (20 of 1973), s. 3.\nExplanations. — In this paragraph, “average monthly wages” means total\nwages drawn during the year of account divided by 12, or by the number of\nmonths a worker actually worked during a year in respect of which he is entitled\nto the benefit under the scheme, as the case may be, and “wages” has the same\nmeaning as in clause (vi) of section 2 of the Payment of Wages Act, 1936 (IV of\n1936), but does not include any overtime allowance 1 [or bonus],"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Definition of the net asset value of the unit",
      "content": "To determine the net asset value of a unit,\nthe total net assets of the Fund, namely, market value of the securities, cash and other assets resulting\nfrom the investment and re-investment, capital accretion thereto and all incomes of any kind rising\nthere-from shall be divided by the number of units in the Fund. Net asset value of the entire Fund shall\nbe computed once every year and each worker's unit entitlement determined at the same time.\nAdditional units will be given to the workers according to the amount they voluntarily contribute to the\nFund.\n[7. Employee's own contribution. — A worker may voluntarily choose to contribute a part of\n6\nhis wages, cash bonus, dividend or interest to the Fund. For each unit of contribution, he shall\nreceive credit for 1-1/4 units. Contribution received during the course of a year of account shall,\nhowever, be deemed to be contribution received on the last day of that year. If at any time a worker\nchooses to leave the employment of the company or 7[his services are terminated or in the event of his\nretirement or death or' on the expiry of three years from the date he voluntarily chooses to contribute a\npart of his wages, cash bonus, dividend or interest to the Fund, he, at his option, or, in the event of his\ndeath, his nominated beneficiary, may], receive the net asset value of the units representing his\ncontribution. The contribution by a worker in any one year of account shall not exceed 10 per cent\nof his annual wages during such year.]\n1\nAdd by Ordinance 4 of 1985, s. 3.\n2\nSubs. by the Companies Profits (Workers Participation) (Amdt.) Act, 1973 (20 of 1973), s. 3, for cl. (b), which was previously amended by\nOrd. 12 of 1970, s. 5.\n3\nCls. (c), (d) and (e) omitted ibid.\n4\nSubs. by the Companies Profits (Workers’ Participation) (Amdt.) Act, 1973 (20 of 1973), s. 3, for cl. (f)\n5\nCertain words omitted ibid.\n6\nSubs. by the Companies Profits (Workers Participation) (Amdt.) Ordinance, 1970 (12 of 1970), s. 5, for the original para 7.\n7\nSubs. by Act, 20 of 1973, s. 3, for certain words."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Audit of the Fund accounts",
      "content": "The Fund accounts shall be audited annually at the\ncompany's expense in the same manner as the accounts of the company are audited :\nProvided that the 2[Federal Government] may, at its own cost, appoint independent\naccountants for a special audit of the accounts of the Fund."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Scheme’s benefits to be in addition to other benefits",
      "content": "The benefits to a worker\nunder this scheme shall be in addition to, and not in derogation or substitution of, any other\nbenefits to which the worker may be entitled under any other law, contract, terms and\nconditions of employment or otherwise.\n3\n[14. Special provision for industries working seasonally.— Notwithstanding\nanything contained in this Act or this scheme the 2 [Federal Government] may, by 4notification in\nthe official Gazette, make special provisions for the participation of workers in the profit of\ncompanies engaged in industrial undertakings which operate only for a part of the year."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Companies engaged in more than one industrial undertakings",
      "content": "Notwithstanding\nanything contained in this Act or this scheme, the 2 [Federal Government] may, at the request of a\ncompany which is engaged in more than one industrial undertakings located at different places\npermit the splitting up of the Fund amongst the various undertakings or groups of\nundertakings and constitution of the Board of Trustees for each such undertaking or group of\nundertakings; and thereupon the provisions of this Act and this scheme shall have effect in relation\nto such undertakings or groups as if each such undertaking or group were a company."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Entrustment of management of Fund to Investment Corporation of Pakistan",
      "content": "etc.— The Board of Trustees may, with the prior approval of the 2[Federal Government], enter into\na contract with the Investment Corporation of Pakistan, the National Investment Trust or the\nNational Bank of Pakistan, entrusting the management of the Fund to that Corporation, Trust or\nBank on such fee, which shall be payable by the company, and on such terms and\nconditions as may be mutually agreed upon.]\n1\nSubs. by the Companies Profits (Workers Participation) (Amdt.), Ordinance, 1970 (12 of 1970), s. 5, for original para 11.\n2\nSubs. and shall be deemed to have been so subs. by the Labour Laws, (Amdt.) Act, 1975 (11 of 1975), s. 2 and Sch., for “Central\nGovernment” (w.e.f. 14-8-73).\n3\nParas.14, 15 and 16 added, ibid., by Ord. 18 of 1970, s. 5.\n4\nFor Such notification, see Gaz. of Pak., 1971, Ext. page 1037."
    }
  ],
  "definitions": [
    {
      "term": "company",
      "definition": "a company within the meaning of 2 [ Companies Ordinance, 1984 (XLVII of 1984)], and includes— (i) a body corporate established by or under any law for the time being in force; (ii) any institution, organization or association whether incorporated or not, declared by the 3 [ Federal Government] in the official Gazette to be a company for the purposes of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Fund",
      "definition": "a Workers Participation Fund established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act;] _________________________________________________________________________________ 1 For Statement of Objects and Reasons, see Gaz., of P., 1968, Extraordinary, p. 461. *The Act has been applied to the Provincially Administered Tribal Areas or to the parts or those areas to which it does not already apply, see Regulation No. 1 of 1972, s. 2 and Sch. 2 Subs. and ins. by Act IV of 2007, s. 7 sub-sect.(1) clauses (a) & (b) (w.e.f. 1-7-2007). 3 Subs. and shall be deemed to have been so subs. by the Labour Laws (Amdt.) Act, 1975 (11 of 1975), s. 2 and Sch., for “Central Government” w.e.f. 14-8-1973). 4 Clause (dd) added by the Companies Profit (Workers Participation) (Amdt.) Ordinance, 1970, (12 of 1970), s.2.",
      "source_provision": "sec2"
    },
    {
      "term": "scheme",
      "definition": "the scheme set out in the Schedule; 1 [(f) “worker” in relation to a company, means an employee of the company 2 [,including employed by or through the contractors,] who falls within the definition of a worker as defined in clause (xxx) of section 2 of the Industrial Relations Ordinance, 2002 (XCI of 2002) and has been 2[working for or in] the company for a period of not less than six months.] 3 [3. Establishment of Fund. — (1) Every company to which the scheme applies shall__ (a) establish a Workers Participation Fund in accordance with the scheme as soon as the accounts for the year in which the scheme becomes applicable to it are finalised, but not later than nine months after the close of that year; 4 [*] 5 [(b) subject to adjustments, if any, pay every year to the Fund not later than nine months after the close of that year five percent of its profits during such year 6[* * *]; and (c) furnish to the Federal Government and the Board, not later than nine months after the close of every year of account, its audited accounts for that year, duly signed by its auditors.] (2) The amount paid to the Fund under clause (b) of sub-section (1) in relation to a year shall be deemed to have been allocated to the Fund on the first day of the year next succeeding that year.",
      "source_provision": "sec2"
    }
  ]
}
