{
  "id": "pk-compulsory-service-in-the-armed-forces-ordinance-1971",
  "type": "statute",
  "title": "Compulsory Service in the Armed Forces Ordinance, 1971",
  "title_en": "Compulsory Service in the Armed Forces Ordinance, 1971",
  "short_name": "CSITA",
  "status": "in_force",
  "issued_date": "1971-12-02",
  "in_force_date": "1971-12-02",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Fuapk%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Compulsory Service in the Armed Forces Ordinance, 1971 (XXXI of 1971) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. [Repeal]",
      "content": "1\n1971\nORDINANCE NO. XXXI of 1971\n[3rd December, 1971]\nAn Ordinance to provide for compulsory service in the Armed Forces of essential persons\nand ex-servicemen.\nWHEREAS it is expedient to provide for compulsory service in the Armed Forces of\nessential persons and ex-servicemen;\nNOW, THEREFORE, in pursuance of Proclamation of the 25th day of March, 1969, read\nwith the Provisional Constitution Order, and in exercise of all powers enabling him in that behalf,\nthe President is pleased to make and promulgate the following Ordinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, application and commencement",
      "content": "(1) This Ordinance may be\ncalled the Compulsory Service in the Armed Forces Ordinance, 1971.\n(2) It extends to the whole of Pakistan and applies to all essential persons and ex-\nservicemen wherever they may be; but does not apply to:—\n(a)     any person who is a member of, or employed by, any of the Armed Forces, or the\nCivilian Armed Forces, or, except for the provisions of sections 9 and 10, to the\nreserves of such Armed Forces or Civilian Armed Forces; 2[or]\n(b)    the sole surviving son or daughter, where one or more sons or daughters of a family\nhave been killed in action or have died while serving in the Armed Forces3[.]\n4\n*                  *                    *                  *              *                 *                    *\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Ordinance, unless there is anything repugnant in the subject or\ncontext—\n(a)    “Armed Forces” means the Pakistan Army, the Pakistan Navy and the\nPakistan Air Force, and the reserves thereof;\n(b)       “Code” means the Code of Criminal Procedure, 1898 (Act V of 1898);\n1\nValidated by the Validations of Laws Act, 1975 (LXIII of 1975), s. 2, and Sch.,\nThis Ordinance has been applied to the Provincially Administered Tribal Areas of Balochistan, see Regulation No. IV of 1987, Article 2 and\nSch.,\n2\nThe word “or” added by the Compulsory Service in the Armed Forces (Amdt.) Act, 1976 (XXXVI of 1976), s. 2.\n3\nSubs, ibid., for “; or”.\n4\nCl. (c) omitted ibid.,\n1\n(c)        [‘essential persons’ means essential personnel as defined in] the Essential\nPersonnel (Registration) Ordinance, 1948 (X of 1948), and includes such\nother person as the 2[Federal Government] may, by notification in the official\nGazette, declare to be an essential person for the purposes of this Ordinance;\n(d)       “ex-servicemen” means a person, not being an essential person, whose service\nwith any of the Armed Forces has been terminated and who is not for the time\nbeing included in any of the reserves thereof;\n3\n[(dd) “Inducting Authority” means the Authority nominated by the Service\nHeadquarters for the purpose of selecting essential persons below\ncommissioned rank;]\n(e)       “industrial undertaking” has the same meaning as assigned to it by clause (4)\nof section 2 of the Control of employment Ordinance, 1965 (XXXII of 1965)\nand includes a commercial concern;\n4\n[(ee) “Interview Board” means the Board constituted by the Service Headquarters\nfor the purpose of selecting essential person for a commissioned rank;]\n(f)        “Manpower Board” and “Manpower Tribunal” means respectively the Board\nand the Tribunal constituted under the Control of Employment Ordinance,\n1965 (XXXII of 1965);\n(g)       “prescribed” means prescribed by rules made under this Ordinance;\n(h)       “Service Headquarters” means the General Headquarters, the Naval\nHeadquarters or the Air Headquarters, as the case may be."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Liability to be called up, etc",
      "content": "(1) Every person to whom this Ordinance applies shall\nbe liable to be called up for service under this Ordinance if he is not over the age of sixty years.\n(2) Persons so called up shall be liable to serve with any of the Armed Forces for so long as\ntheir services are required 5[:]\n6\n[Provided that, in the case of a medical practitioner, such liability shall cease after he has\nserved with the Armed Forces for a period of two years.\nExplanation.—In this sub-section, ‘medical practitioner’ means a person who possesses\nqualifications which are recognised medical qualifications, or, as the case may be, recognised\ndental qualifications, for the purposes of the Medical and Dental Council Ordinance, 1962 (XXXII\nof 1962).]\n1\nSubs. by the Compulsory Service in the Armed Forces (Amdt.) Act, 1976 (XXXVI of 1976), s. 2 for “essential person” means a person registered\nunder section 3 of ”.\n2\nSubs by F.A.O. 1975 (P.O. IV of 1975). Art. 2 and table for “Central Government”.\n3\nCl. (dd) ins. by the Compulsory Service in the Armed Forces (Amdt.) Act, 1976 Act XXXVI of 1976, s. 3.\n4\nC1. (ee) ins. ibid.,\n5\nSubs. by the Compulsory Service in the Armed Forces (Amdt.) Act, 1976 (XXXVI of 1976), s. 4, for full-stop.\n6\nThe proviso and Explanation added, ibid."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Call up notice",
      "content": "1[(1) The Manpower Board, or such authority as may be empowered by\nit, shall on requisition from any of the service Headquarters, issue to such essential persons as are\nto be called up notice in writing requiring them, or direct such persons, to report in person to\nthe Interview Board or, as the Case may be, Inducting Authority at such time and place as may\nbe specified in the notice or direction.]\n(2) The Service Headquarters concerned, or such authority as may be empowered by them,\nmay likewise issue call up notices 2[or directions] to ex-servicemen.\n(3) The issue of a notice 2[or direction] under this section shall not mean that the person\ncalled up has been accepted for service.\n3\n[(4) Where such person is known to be serving in a department or office of Government or\nin an industrial undertaking, a copy of a notice, if any, under sub-section (1), shall at the same time\nbe forwarded to the head of such department or office or, as the case may be, to the owner or\nmanager of such undertaking requiring him to release such person so as to enable him to comply\nwith such notice.]\n4\n[(5) The owner or manager of an industrial undertaking referred to in sub-section (4) shall\nnot—\n(a)        obstruct from joining service under this Ordinance in pursuance of a direction\nunder sub-section (1) or subsection (2) an essential person or ex-servicemen\nwho serves upon him a notice of his intention to leave his employment or\nrequests him in person to be released from such employment, or\n(b)         take any action against an essential person or ex-servicemen who, without of\nformal release from such employment, leaves such employment for joining\nservice under this Act in pursuance of such direction.\nExplanation.—In this section and sections 5, 6, 8 and 10, “direct”, with all its grammatical\nvariations, means to direct on the radio, through the press or by any other means.]\n5\n[5. Obligation to comply with call up notice or direction.—A person to whom a notice\nor direction under section 4 has been issued shall report to the authority at the time, date and place\nspecified in the notice or, as the case may be, direction.]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Applicability of service law",
      "content": "6[(1) A person—\n(a)        accepted for service under this Act shall be deemed to have been\ncommissioned, appointed or enrolled, as the case may be, and shall, as from\nthe date he is so accepted, become subject to the law of the Armed\nForces concerned, or\n1\nSubs. by the Compulsory Service in the Armed Forces (Amdt.) Act, 1976 (XXXVI of 1976), s.5., for the original sub-section (1).\n2\nIns ibid.\n3\nSubs. ibid. for the original sub-section (4).\n4\nNew sub-section (5) and Explanation added ibid.,\n5\nSubs., ibid., by s.6. for the original section 5.\n6\nSubs., ibid., s.7.\n(b)        provisionally accepted by the Interview Board for a commissioned rank and\ndirected by that Board to wait for receipt of his commissioning orders at his\nplace of present employment or residence shall be granted commission from\nthe date he is finally accepted and shall, as from that date, become subject to\nthe law of the Armed Forces concerned, and shall remain so subject until duly\nretired, released, discharged, removed or dismissed from service.]\n(2) Such person shall, during his service in the Armed Forces, be governed as regards\nattestation, pay and allowances, leave and other terms of service by the rules as applicable to\nserving personnel of equivalent rank, and shall, on the termination of his service, be paid such\npension or gratuity as may be prescribed."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Grant of Commission. A person called up for service under this Ordinance may be",
      "content": "granted commission in the Armed Forces subject to such conditions as may be prescribed.\n1\n[8. Procedure for seeking exemption.—(1) If a person to whom a notice or\ndirection under subsection (1) of section 4 has been issued seeks exemption from service under this\nAct, he shall first report to the Interview Board or, as the case may be, Inducting Authority, at the\ntime, date and place specified in the call up notice or direction and then submit a written\nrepresentation to the Chairman, Interview Board, or, as the case may be, Inducting Authority,\nwhose decision shall be final.\n(2) An ex-serviceman desirous of seeking exemption from service under this Act may\nmake a representation to the Service Headquarters concerned, whose decision shall be final.]"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Reinstatement of persons released under the orders of the Board",
      "content": "2[(1) Subject to\nthe other provisions of this section, every employer—\n(a)       by whom a person was released in pursuance of a notice served on\nsuch employer under sub-section (4) of section 4 for joining service under this\nAct, or\n(b)       whose employment was left by a person in pursuance of a direction under the\nsaid section for joining such service, whether upon a formal release from such\nemployment or otherwise, shall, on the termination of such service, reinstate\nsuch person in the employment or the assignment from which he was released\nor which he left and, if such reinstatement is less favourable to such person\nthan that to which he would, in the ordinary course, have been entitled, give\nhim such employment or assignment as is not less favourable:\nProvided that the employer shall not be required to so reinstate\nor employ any person if such person does not apply or report to him for the\npurpose within three months of his release from service under this Act.]\n1\nSubs. by the Compulsory Service in the Armed Forces (Amdt.) Act, 1976 (XXXVI of 1976), s. 8, for the original section 8.\n2\nSubs. ibid., s. 9, for sub-section (1).\n(2) Where, for any reason, reinstatement or employment under sub-section (1) is not\npracticable, the employer shall, within seven days from the date on which the person to be\nreinstated or employed applies or reports himself for reinstatement or employment, make an\napplication to the Manpower Tribunal concerned 1[or an authority empowered by the Federal\nGovernment] for exemption from the provisions of sub-section (1) and send a copy thereof to such\nperson.\n(3) Upon an application from the employer under sub-section (2), the Manpower Tribunal\n1\n[or, as the case may be, the authority empowered under the said sub-section] shall, after such\nenquiry and hearing as it considers necessary, make an order—\n(a)       exempting the employer from the provisions of sub-section (1), in which case\nthe employer shall be required to pay to such person within three months of\nthe order a compensation of a sum not less than six months’ nor more than\ntwelve months’ remuneration calculated at the rate he was entitled to when he\nwas released by the employer and such sum, in the case of failure to make\npayment, shall be recoverable as arrear of land revenue; or\n(b)       requiring the employer to reinstate or give employment to such person in\nterms of sub-section (1), or on such terms and conditions as it may specify in\nthe order.\n(4) If any employer—\n(a)       without seeking exemption under sub-section (2) fails to comply with the\nprovisions of sub-section (1), or\n(b)       having applied for exemption under sub-section (2) fails to comply with an\norder under clause (b) of sub-section (3),\nhe shall, without prejudice to any penalty to which he may be liable under section 10, be also\nliable, if the court convicting him so directs, to pay as compensation a sum not exceeding twelve\nmonths’ remuneration of the person concerned in addition to the compensation provided\nunder clause (a) of sub-section (3).\n(5) Any sum which the employer is required to pay under any order of the Tribunal 2[or\nauthority] under sub-section (3) or an order of the court under sub-section (4) shall be recoverable as\nif it were a fine imposed by a court.\n3[9A.Concessions to medical practitioner released from service with the Armed\nForces.—Notwithstanding anything contained in any other law for the time being in force, a\nmedical practitioner 4[or other essential person] who, following his release from service with the\nArmed Forces after having rendered satisfactory service under this Ordinance for a period of not\nless than two years, enters employment of the Federal Government or a Provincial Government\n5\n[,or an organization controlled by the Federal Government or a Provincial Government or any\nstatutory or local body] shall be entitled to count towards his seniority in such employment the\nperiod of service rendered by him under this Ordinance and to his pay in such employment being\nfixed after giving him credit for the service so rendered.\n1\nIns. by the Compulsory Service in the Armed Forces (Amdt.) Act. 1976 (XXXVI of 1976), s. 9.\n2\nIns. ibid.\n3\nIns. and shall be deemed to have taken effect on the 3rd day of December, 1971, by the Compulsory Service in the Armed Forces (Amdt.) Ord.\n1978- (IV of 1978). s. 2.\n4\nIns. by the Compulsory Service in the Armed Forces (Amdt.) Ordinance, 1984 (XLV of 1984), s.2.\n5\nIns. by the Compulsory Service in the Armed Forces (Amdt.) Ordinance, No. LXIII of 2000, s.2. (w.e.f 4th Oct 1984).\nExplanation.—In this section, “medical practitioner” has the same meaning as in section 3.]"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Penalty and procedure",
      "content": "(1) Any person who commits any of the following offences,\nthat is to say,—\n(a)          fails to deliver, or obstructs or causes delay in the delivery of, or refuses to\nreceive, a notice issued under this Ordinance;\n1\n[(b)     fails to report in response to a call up notice or direction issued under\nsection 4;\n(bb)         does not release an essential person or ex-serviceman in accordance with a\nnotice under sub-section (4) of section 4;\n(bbb)        obstructs from joining service under this Act in pursuance of a direction an\nessential person or ex-serviceman who serves upon him a notice of his\nintention to leave his employment or requests him in person to be released\nfrom such employment;\n(bbbb)       takes any action against an essential person or ex-serviceman who, without a\nformal release from such employment, leaves such employment for joining\nservice under this Act in pursuance of a direction;\n(bbbbb) fails to report for service on receipt of commissioning orders after having\nbeen provisionally accepted by the Interview Board but directed by it to wait\nfor receipt of his commissioning orders at his place of present employment\nor residence;]\n(c)          persuades a person called up for service under this Ordinance to evade such\nservice or abets in any manner the contravention of any of the provisions of\nthis Ordinance or of any order, notice or direction issued thereunder;\n(d)          makes a false statement with a view to avoiding service under this\nOrdinance or abets the avoidance of such service by any person;\n(e)          with intent to render himself or any other person unfit for service under this\nOrdinance, voluntarily causes hurt or disease to himself or that person;\n(f)          without seeking exemption under sub-section (2) of section 9, fails to\ncomply with the provision of sub-section (1) of that section ; or\n(g)          having sought exemption under sub-section (2) of section 9, fails to comply\nwith an order under clause (b) of sub-section (3) of that section,\nshall, on conviction by a court, be punishable with rigorous imprisonment for a term which may\nextend to seven years, or with fine which may extend to ten thousand rupees, or with both.\n1\nSubs. by the Compulsory Service in the Armed Forces (Amdt.) Act, 1976 (XXXVI of 1976), s.10, for clause (b).\n(2) No court inferior to that of a Magistrate of the first class invested with power under\nsection 30 of the Code of Criminal Procedure, 1898 (Act V of 1898) shall try an offence under this\nOrdinance."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Indemnity",
      "content": "Except as provided in this Ordinance, no order made, direction\nissued or proceedings taken under this Ordinance shall be called in question in any court, and no\nsuit, prosecution or other legal proceedings shall lie against any person for anything in good faith\ndone or intended to be done under this Ordinance."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to make rules",
      "content": "(1)The 1[Federal Government] may, by notification in the\nofficial Gazette, make rules2 for carrying out the purposes of this Ordinance.\n(2) In particular, and without prejudice to the generality of the foregoing power, such rules\nmay provide for—\n(a)        the form, procedure and mode of issue of call up notice;\n(b)        the travelling and other allowances payable to persons called up for service\nunder this Ordinance up to the date of their acceptance for such service;\n(c)        the standards and conduct of tests and medical examination of person called\nup for service under this Ordinance to determine their suitability for such\nservice and the grant of rank upon their being accepted therefor;\n(d)        the gratuity or compensation to be paid on the termination of their service to\npersons accepted for service under this Ordinance or to the dependents of such\npersons; and\n(e)        any other matter which under this Ordinance is to be or may be prescribed."
    }
  ],
  "definitions": [
    {
      "term": "Armed Forces",
      "definition": "the Pakistan Army, the Pakistan Navy and the Pakistan Air Force, and the reserves thereof;",
      "source_provision": "sec2"
    },
    {
      "term": "Code",
      "definition": "the Code of Criminal Procedure, 1898 (Act V of 1898); 1 Validated by the Validations of Laws Act, 1975 (LXIII of 1975), s. 2, and Sch., This Ordinance has been applied to the Provincially Administered Tribal Areas of Balochistan, see Regulation No. IV of 1987, Article 2 and Sch., 2 The word “or” added by the Compulsory Service in the Armed Forces (Amdt.) Act, 1976 (XXXVI of 1976), s. 2. 3 Subs, ibid., for “; or”. 4 Cl. (c) omitted ibid., 1 (c) [‘essential persons’ means essential personnel as defined in] the Essential Personnel (Registration) Ordinance, 1948 (X of 1948), and includes such other person as the 2[Federal Government] may, by notification in the official Gazette, declare to be an essential person for the purposes of this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "ex-servicemen",
      "definition": "a person, not being an essential person, whose service with any of the Armed Forces has been terminated and who is not for the time being included in any of the reserves thereof; 3 [(dd) “Inducting Authority” means the Authority nominated by the Service Headquarters for the purpose of selecting essential persons below commissioned rank;]",
      "source_provision": "sec2"
    },
    {
      "term": "Interview Board",
      "definition": "the Board constituted by the Service Headquarters for the purpose of selecting essential person for a commissioned rank;]",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "Service Headquarters",
      "definition": "the General Headquarters, the Naval Headquarters or the Air Headquarters, as the case may be.",
      "source_provision": "sec2"
    }
  ]
}
