{
  "id": "pk-compulsory-teaching-of-the-holy-quran-act-2017",
  "type": "statute",
  "title": "Compulsory Teaching of the Holy Quran Act, 2017",
  "title_en": "Compulsory Teaching of the Holy Quran Act, 2017",
  "short_name": "CTOTH",
  "status": "in_force",
  "issued_date": "2017-02-16",
  "in_force_date": "2017-02-16",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5lrZw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Compulsory Teaching of the Holy Quran Act, 2017 (XX of 2017) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, application and commencement.(1) This Act may be called the Compulsory",
      "content": "Teaching of the Holy Quran Act, 2017.\n(2) It shall apply to only Muslim students in all educational institutions\n(a)    in the Islamabad Capital Territory; and\n(b)    owned and controlled by the Federal Government wherever they may be.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definition. Unless there is anything repugnant in the subject or context, ",
      "content": "(a)    “appropriate Government “shall have the same meaning as assigned to this\nexpression in the Right to Free and Compulsory Education Act,2012 (XXIV of\n2012);\n(b)     “educational institution” means any school, college, institute or otherwise, by\nwhatever name called for, established and setup in public or private sector for\nimparting education to students irrespective of its status whether registered or\nnot registered with the appropriate Government or any other body;\n(c)    “Naazrah Quran” means recitation by sighting of the Arabic text;\n(d)    “prescribed” means prescribed by rules made under this Act; and\n(e)    “rules” means rules made under this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Compulsory teaching of the Holy Quran.(1) There shall be, in all educational institutions,",
      "content": "compulsory teaching of\n(a)    the Naazrah Quran in classes, grades or, as the case may be, levels I to V in\nprescribed manner; and\n(b)    the translation of the Holy Quran in classes, grades or, as the case may be,\nlevels VI to XI I in such prescribed manner so that the entire Holy Quran is\ncompleted upto class, grade or as the case may be level XII.\n(2) The Minister-in-charge of the appropriate Government shall ensure implementation of this\nAct in the manner as may be prescribed."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to make rules. The Minister",
      "content": "in-charge of the appropriate Government may, by\nnotification in the official Gazette, make rules for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Act not to be derogatory to any other law. The provisions of this Act shall be in addition",
      "content": "to, and not in derogation of, any other law for the time being in force.\n___________________"
    }
  ],
  "definitions": [
    {
      "term": "educational institution",
      "definition": "any school, college, institute or otherwise, by whatever name called for, established and setup in public or private sector for imparting education to students irrespective of its status whether registered or not registered with the appropriate Government or any other body;",
      "source_provision": "sec2"
    },
    {
      "term": "Naazrah Quran",
      "definition": "recitation by sighting of the Arabic text;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act.",
      "source_provision": "sec2"
    }
  ]
}
