{
  "id": "pk-comsats-university-islamabad-act-2018",
  "type": "statute",
  "title": "COMSATS University Islamabad Act, 2018",
  "title_en": "COMSATS University Islamabad Act, 2018",
  "short_name": "CUIA",
  "status": "in_force",
  "issued_date": "2018-03-13",
  "in_force_date": "2018-03-13",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NobZw%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of COMSATS University Islamabad Act, 2018 (XI of 2018) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, application and commencement",
      "content": "_(1) This Act may be called the COMSATS\nUniversity Islamabad Act, 2018.\n(2) I shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act unless there is anything repugnant in the subject or context",
      "content": "_\n(i)      “Academic Council” means the Academic Council of the University;\n(ii)     “Affiliated college” means an educational institution affiliated to the University\nbut not maintained or administered by it;\n(iii)    “Authority” means any of the Authorities of the University specified in this Act;\n(iv)     “Campus” means a constituent campus of the University;\n(v)      “Chairman” means the Chairman of an academic Department to whom the status\nof an academic Department is granted by this Act or by the Statutes or\nRegulations;\n(vi)     “Chancellor” means the Chancellor of the University;\n(vi)     “College” means a constituent college or an affiliated college;\n(viii)   “Commission” means the Higher Education Commission set up by the Higher\nEducation Commission Ordinance, 2002 (L.III of2002);\n(ix)     “COMSATS” means the Commission on Science and Technology for Sustainable\nDevelopment in the South;\n(x)       “Constituent college” means an educational institution, by whatever name\ndescribed, maintained and administered by the University;\n(xi)      “Dean” means the head of a Faculty or the head of an academic body granted the\nstatus of a Faculty by this Act or by the Statutes or Regulations;\n(xii)     “Department” means a teaching department maintained and administered, or\nrecognized by, the University in the manner prescribed;\n(xiii)    “Director means the head of an institute or a constituent campus established by\nthe University under Statutes or Regulations;\n(xiv)     “Faculty” means an administrative and academic unit of the University consisting\nof one or more departments, as prescribed;\n(xv)      “Government” means the Federal Government;\n(xvi)     “prescribed” means prescribed by Statutes, Regulations or Rules made under this\nAct;\n(xvii)    “Principal” means the head of a college;\n(xviii)   “Pro-Chancellor” means the Pro-Chancellor of the University;\n(xix)     “Pro-Rector” means Pro-Rector of the University;\n(xx)      “Rector” means the Rector of the University;\n(xxi)     “Representation Committees” means the Representation Committees constituted\nunder section 25;\n(xxii)    “Review Panel” means the Review Panel set up by the Chancellor in accordance\nwith the provisions of section 8;\n(xxiii)   “Search Committee” means the Search Committee set up under section 12;\n(xxiv)    “Senate” means the Senate of the University;\n(xxv)     “Statutes”, “Regulations” and “Rules” mean respectively the Statutes, the\nRegulations and the Rules made under this Act and for the time being in force;\n(xxvi)    “Syndicate” means the Syndicate of the University;\n(xxvii)    “Teachers” include Professors, Associate Professors, Assistant Professors and\nLecturers engaged whole-time by the University or by a constituent or affiliated\ncollege and such other persons as may be declared to be teachers by Regulations;\n(xviii)    “University” means the COMSATS University Islamabad; and\n(xxix)     “University Teacher” means a whole-time teacher appointed and paid by the\nUniversity, or recognized by the University as such."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Incorporation",
      "content": "_(1) The COMSATS Institute of Information Technology Islamabad is hereby\nupgraded to the status of COMSATS University Islamabad, in accordance with the provisions of this Act,\nwith its principal seat at Islamabad and will have and may establish any number of campuses anywhere in\nor outside Pakistan.\n(2) The University shall consist of the following, namely:___\n(a)       the Chancellor and Pro-Chancellor;\n(b)       the Rector and the Pro- Rectors;\n(c)       the Chairpersons and Deans;\n(d)       the members of the authorities of the University established under section I7;\n(e)       all University teachers and persons recognized as students of the University in the\nprescribed manner; and\n(f)       all other full-time officers and members of the staff of the University.\n(3) The University shall be a body corporate by the name of COMSATS University Islamabad and\nshall have perpetual succession and a common seal, and may sue and be sued by the said name.\n(4) The University shall be competent to acquire and hold property, both movable and immovable,\nand to lease, sell or otherwise transfer any movable and immovable property which may have become\nvested in or been acquired by it.\n(5) Notwithstanding anything contained in any other law for the time being in force, the University\nshall have academic, financial and administrative autonomy, including the power to employ officers,\nteachers and other employees on such terms as may be prescribed, subject to the terms of this Act and the\nHigher Education Commission Ordinance, 2002 (LIII of 2002). In particular and without prejudice to the\nauthority granted to the Commission by the law, the Government or an authority or auditor appointed by\nthe Government shall have no power to question the policy underlying the allocation of resources\napproved by the Senate in the annual budget of the University.\n(6) Al! properties, rights and interests of whatever kind, used, enjoyed, possessed, owned or vested\nin, or held in trust by or for COMSATS Institute of Information Technology and liabilities legally\nsubsisting against COMSATS Institute of Information Technology shall hereafter be transferred to the\nCOMSATS University established under the Act."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers and Purposes of the University",
      "content": "The University shall,___\n(i)       provide for education and scholarship in such branches of knowledge as it may\ndeem fit, and to make provision for research, service to society and for the\napplication, advancement and dissemination of knowledge in such manner as it\nmay determine;\n(ii)      prescribe courses of studies to be conducted by it and the colleges:\n(iii)     hold examinations and award or confer degrees, diplomas, certificates and other\nacademic, distinctions on persons who have been admitted to and have passed its\nexaminations under prescribed conditions;\n(iv)      prescribe the terms and conditions of employment of the officers, teachers and\nother employees of the University and to lay down terms and conditions that may\nbe different from those applicable to government servants in general:\n(v)       engage, where necessary, persons on contracts of specified duration and to\nspecify the terns of each engagement;\n(vi)      confer honorary degrees or other distinctions on approved persons in the\nprescribed manner;\n(vii)     provide for such instruction for persons not being students of the University as it\nmay prescribe, and to grant certificates and diplomas to such persons;\n(viii)    institute programmes for the exchange of students and teachers between the\nUniversity and other universities, educational institutions and research\norganizations, inside as well as outside Pakistan.\n(ix)      provide career counseling and job search services to students and alumni;\n(x)       maintain linkages with alumni;\n(xi)      develop ad implement fund- raising plans;\n(xii)     provide ad support the academic development of the faculty of the University;\n(xiii)    confer degrees on persons who have carried out an independent research under\nprescribed conditions;\n(xiv)     affiliate and disaffiliate educational institutions under prescribed conditions;\n(xv)      inspect colleges and other educational institutions affiliated or seeking affiliation\nwith it;\n(xvi)     accept the examinations passed and the period of study spent by students of the\nUniversity at other universities and places of learning equivalent to such\nexaminations and periods of study in the University, as it may prescribe, and to\nwithdraw such acceptance;\n(xvii)    co-operate with other universities, public authorities or private organizations,\ninside as well as outside Pakistan, in such manner and for such purposes as it may\nprescribe;\n(xviii)   institute Professorships, Associate Professorships, Assistant Professor ships and\nLectureships and any other posts and to appoint persons 1hereto;\n(xix)     create pests for research, extension, administration and other related purposes and\nto appoint persons thereto;\n(xx)      recognize selected members of the teaching staff of affiliated colleges or\neducational institutions admitted to the privileges of the University or such other\npersons as it may deem fit, as University teachers;\n(xxi)     institute and award financial assistance to students in need, fellowships,\nscholarships, bursaries, medals and prizes under prescribed conditions;\n(xxii)    establish teaching departments, schools, colleges, faculties, institutes, museums\nand other centers of learning for the development of teaching and research and to\nmake such arrangements for their maintenance, management and administration\nas it may prescribe;\n(xxiii)   provide for the residence of the students of the University and the colleges, to\ninstitute and maintain halls of residence and to approve or license hostels and\nlodgings;\n(xxiv)    maintain order, discipline and security on the campuses of the University and the\ncolleges;\n(xxv)     promote the extra curricular and recreational activities of such students, and to\nmake arrangements for promoting their health and general welfare;\n(xxvi)    demand and receive such fees and other charges as it may determine;\n(xxvii)   make provision for research, advisory or consultancy services and with these\nobjects to enter into arrangements with other institutions, public or private bodies,\ncommercial and industrial enterprises under prescribed conditions;\n(xxviii) enter into, carry out, vary or cancel contracts;\n(xix)     receive and manage property transferred and grants, contributions made to the\nUniversity and to invest any fund representing such property, grants, bequests,\nrusts, gifts, donations, endowments or contributions in such manner as it may\ndeem fit;\n(xxx)     provide for the printing and publication of research and other works; and\n(xxxi)    to do all such other acts and things, whether incidental to the powers aforesaid or\nnot, as may be requisite or expedient in order to further the objectives of the\nUniversity as a place of education, learning, and research."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. University open to all classes, creeds, etc",
      "content": "_(1) The University shall be open to all persons of\neither gender and of whatever religion, race, creed, class, colour or domicile and no person shall be denied\nthe privileges of the University on the grounds of religion, race, caste, creed, class, colour or domicile.\n(2) An increase in any fee or charge that is in excess of ten percent per annum on annual basis\nfrom the last such increase may not be made except in special circumstances, and only with the approval\nof the Chancellor.\n(3) The University shall institute financial aid programmes for students in need, to the extent\nconsidered feasible by the Senate, given the resources available, so as to enable admission and access to\nthe University and the various opportunities provided by it to be based on merit rather than ability to pay:\nProvided that the University may institute self-finance schemes not covering more than ten percent\nof the total number of candidates in any an-campus taught course or research-based programme of study."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Teaching at the University",
      "content": "_(1) Ali recognized teaching in various courses shall be conducted\nby the University or the colleges in the prescribed manner and may include lectures, tutorials, discussion,\nseminars, demonstrations, distance learning and other methods of instruction as well as practical work in\nthe laboratories, hospitals, workshops and other governmental or private organizations.\n(2) The authority responsible for organizing recognized teaching shall be such as may be\nprescribed.\n(3) The degree awarding programmes of the university shall conform to the approved criteria of\nthe Commission.\n(4) No degree shall be granted unless student has passed an examination in Islamic and Pakistan\nStudies at the Bachelor’s degree level or, in case of non-muslim student, in Ethics and Pakistan Studies at\nhis option."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Principal Officers",
      "content": "The following shall be the principal officers of the University, namely:___\n(a)     the Chancellor;\n(b)     the Pre-Chancellor;\n(c)     the Rector:\n(d)     the Pro-Rector;\n(e)     the Directors;\n(f)     the Deans;\n(g)     the Principals of the constituent colleges;\n(h)     the Chairpersons of 1he teaching departments;\n(i)     the Registrar;\n(j)     the Treasurer;\n(k)     the Controller of Examinations; and\n(l)     such other persons as may be prescribed by the Statutes or Regulations to be the\nprincipal officers of the University."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Chancellor",
      "content": "_(1) The President of Pakistan shall be the Chancellor of the University and the\nChairperson of the Senate.\n(2) The Chancellor shall, when present, preside at the meetings of the Senate and the Convocation\nof the University.\n(3) The selected members of the Senate and the Rector shall be appointed by the Chancellor from\namongst the persons recommended by the Representation Committee and the Search Committee\nrespectively set up for this purpose in accordance with the Act and the Statutes, as the case may be, along-\nwith those elected.\n(4) Every proposal to confer an honorary degree shall be subject to confirmation by the Chancellor.\n(5) If the Chancellor is satisfied that serious irregularity or mismanagement with respect to the\naffairs of the University has occurred, he may as regards proceeding of,___\n(a)    Senate, direct that specified proceedings be reconsidered and appropriate action\ntaken be within one month of this direction:\nProvided that if the Chancellor is satisfied that either no reconsideration has\nbeen carried out or that the reconsideration has failed to address the concern\nexpressed he may, after calling upon the Senate to show cause in writing, appoint\na five member Review Panel to examine and report to the Chancellor on the\nfunctioning of the Senate. The report of the Review Panel shall be submitted within\nsuch time as may be prescribed by the Chancellor. The Review Panel shall be drawn\nfrom persons of eminence in academics and in the fields of law, accountancy and\nadministration; and\n(b)    any Authority or with respect to matters within the competence of any Authority\nother than the Senate, direct the Senate to exercise powers under section 19."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Removal from the Senate",
      "content": "(1) The Chancellor may, upon the recommendation of the Review\nPanel, remove any person from the membership of the Senate on the ground that such person--\n(a)    has become of unsound mind: or\n(b)    has become incapacitated to function as member of the Senate; or\n(c)    has been convicted by a court of law for an offence involving moral turpitude; or\n(d)    has absented himself from two consecutive meetings without just cause; or\n(e)    has been guilty of misconduct, including use of position for personal advantage of\nany kind, or gross inefficiency in the performance of functions.\n(2) The Chancellor shall remove any person from the membership of the Senate on a resolution\ncalling for the removal of such person supported by at least three-fourths of the membership of the Senate:\nProvided hat before passing such resolution the Senate shall provide the member concerned a fair\nhearing:\nProvided further that the provisions of this section shall not be applicable to the Rector in his\ncapacity as a member of the Senate."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Pro",
      "content": "Chancellors.___(1) The Federal Minister concerned with the subject of Science and\nTechnology shall be the first Pro-Chancellor of the University.\n(2) Executive Director COMSATS shall be the second Pro-Chancellor of the University.\n(3) The first Pro-Chancellor shall have precedence over the second Pro-Chancellor.\n(4) In the case of non-availability of Chancellor, the first Pro-Chancellor shall preside at the\nConvocation of the University and in case of non-availability of the Chancellor and the first Pro-\nChancellor, the second Pro-Chancellor shall preside at the Convocation of the University."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Rector",
      "content": "_(1) There shall be a Rector of the University who shall be an eminent academic or a\ndistinguished administrator and shall be appointed on such terms and conditions as may be prescribed.\n(2) The Rector shall be the chief executive officer of the University and shall be responsible for\nall administrative and academic functions of the University and for ensuring that the provisions of the Act,\nStatutes, Regulations and Rules are faithfully observed in order to promote the general efficiency and\ngood order of the University. The Rector shall have all powers prescribed for this purpose, including\nadministrative control over the officers, teachers and other employees of the University.\n(3) The Rector shall, if present, be entitled to attend any meeting of any Authority or body of the\nUniversity.\n(4) The Rector may, in an emergency that in his opinion requires such immediate action which is\nordinarily not in the competence of the Rector, take such action and forward, within seventy-two hours, a\nreport of the action taken to the members of the Emergency Committee of the Senate, to be set up by\nStatute. The Emergency Committee may direct such further action as it considers appropriate.\n(5) The Rector shall also have the following powers, namely:___\n(a)     to direct teachers, officers and other employees of the University to take up such\nassignments in connection with examination, administration and such other\nactivities in the University as he may consider necessary for the purposes of the\nUniversity;\n(b)     to sanction by re-appropriation an amount not exceeding an amount prescribed by\nthe Senate for an unforeseen item not provided for in the budget and report it to the\nSenate at the next meeting;\n(c)     to make appointments of such categories of employees of the University and in\nsuch manner as may be prescribed by the Statutes;\n(d)     to suspend, punish and remove, in accordance with prescribed procedure, from\nservice officers, teachers and other employees of the University except those\nappointed by or with the approval of the Senate;\n(e)     to delegate, subject to such conditions as may be prescribed, any of his powers\nunder this Act to an officer or officers of the University; and\n(f)     to exercise and perform such other powers and functions as may be prescribed.\n(6) The Rector shall preside at the convocation of the University in the case of non-availability of\nthe Chancellor, Pro-Chancellor and the Executive Director COMSATS.\n(7) The Rector shall present an annual report before the Senate within three months of the close of\nthe academic year. The annual report shall present such information as regards the academic year under\nreview as may be prescribed, including disclosure of all relevant facts pertaining to,___\n(a)     academics;\n(b)     research;\n(c)     administration; and\n(d)     finances and audit.\n(8) The Rector’s annual report shall be made available, prior to its presentation before the Senate,\nto all officers and University Teachers and shall be published in such numbers as are required to ensure\nits wide circulation."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Appointment and Removal of the Rector",
      "content": "_(1) The Rector shall be appointed by the\nChancellor on the basis of recommendations made by the Senate.\n(2) A Search Committee for the recommendation of persons suitable for appointment as Rector\nshall be constituted by the Senate on the date and in the manner proscribed by the Statutes and shall\ncomprise five members consisting of two eminent members of society nominated by the Chancellor, of\nwhom one shall he appointed the Convener, one member of the Senate, one distinguished University\nTeacher who is not member of the Senate and one academic of eminence not employed by the University.\nThe distinguished University teacher shall be selected by the Senate through a process, to be prescribed\nby Statute that provides for the recommendation of suitable names by the University Teachers in general.\nThe Search Committee shall remain in existence till such time that the appointment of the next Rector has\nbeen made by the Chancellor.\n(3) The persons proposed by the Search Committee for appointment as Rector shall be considered\nby the Senate and of these a panel of three, in order of priority, shall be recommended by the Senate to\nthe Chancellor:\nProvided that the Chancellor may decline to appoint any of the three persons recommended and\nseek recommendation of a fresh panel. In the event of a fresh recommendation being sought by the\nChancellor the Search Committee shall make a proposal to the Senate in the prescribed manner.\n(4) The Rec or shall be appointed for a renewable tenure of five years on terms and conditions\nprescribed by Statute. The tenure of an incumbent Rector shall be renewed by the Chancellor on receipt\nof a resolution of the Senate in support of such renewal:\nProvided that the Chancellor may call upon the Senate to reconsider such resolution once.\n(5) The Senate may, pursuant to a resolution in this behalf passed by three-fourths of its\nmembership, recommend to the Chancellor the removal of the Rector on the ground of inefficiency, moral\nturpitude or physical or mental incapacity or gross misconduct, including misuse of position for personal\nadvantage of any kind:\nProvided that the Chancellor may make a reference to the Senate stating the instances of\ninefficiency, moral turpitude or physical or mental incapacity or gross misconduct on the part of the Rector\nthat have come to his notice. After consideration of the reference the Senate may, pursuant to a resolution\nin this behalf passed by two thirds of its membership, recommend to the Chancellor the removal of the\nRector:\nProvided further that prior to a resolution for the removal of the Rector being voted upon the Rector\nshall be given an opportunity of being heard.\n(6) A resolution recommending the removal of the Rector shall be submitted to the Chancellor\nforthwith. The Chancellor may accept the recommendation and order removal of the Rector or return the\nrecommendation to the Senate within one month of the receipt of such recommendations for\nreconsideration, in case the Senate reiterates the same recommendations, the Chancellor shall give his\nassent within one month.\n(7) At any time when the office of the Rector is vacant, or the Rector is absent, or is unable to\nperform the functions of his office due to illness, leave or some other cause, for a period not exceeding\none month. the Federal Minister for Science and Technology, being one of the Pro-Chancellors, shall\nmake such arrangements for the performance of the duties of the Rector as he may deem fit ln case the\nabsence or leave exceeds one month, the decision shall be taken by the Chancellor."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Pro",
      "content": "Rector.___(1)The Pro-Rector of the University shall be appointed by the Senate on such\nterms and conditions as may be prescribed. Pro-Rector shall be responsible to the Rector and will provide\nsupport to the Rector in planning and execution of assigned functions.\n(2) The Pro-Rector shall represent the Rector as and when required and shall undertake such other\nresponsibilities, duties and exercise powers as the Rector may assign or delegate from time to time."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Registrar",
      "content": "_(1) There shall be a Registrar of the University to be appointed by the Senate on\nthe recommendation of the Rector, on such terms and conditions as may be prescribed.\n(2) The experience as well as the professional and academic qualifications necessary for\nappointment to the post of the Registrar shall be as may be prescribed.\n(3) The Registrar shall be a full-time officer of the University and shall,___\n(a)     be the administrative head of the secretariat of the University and be responsible\nfor the provision of secretariat support to the Authorities of the University;\n(b)     be the custodian of the common seal and the academic records of the University;\n(c)    maintain z register of registered graduates in the prescribed manner;\n(d)    supervise the process of election, appointment or nomination of members to the\nvarious authorities and other bodies in the prescribed manner; and\n(e)    perform such other duties as may be prescribed.\n(4) The term of office of the Registrar shall be a renewable period of three years:\nProvided that the Senate may, on the advice of the Rector, terminate the appointment of the\nRegistrar on grounds of inefficiency or misconduct in accordance with prescribed procedure. ‘"
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Treasurer",
      "content": "_(1) There shall be a Treasurer of the University to be appointed by the Senate on\nthe recommendation of the Rector, on such terms and conditions as may be prescribed.\n(2) The experience and the professional and academic qualifications necessary for appointment to\nthe post of the Treasurer shall be as may be prescribed.\n(3) The Treasurer shall be the chief financial officer of the University and shall.___\n(a)    manage the assets, liabilities, receipts, expenditures, funds and investments of the\nUniversity;\n(b)    prepare the annual and revised budget estimates of the University and present them\nto the Syndicate or a committee thereof for approval and incorporation in the budget\nto be presented to the Senate;\n(c)    ensure that the funds of the University are expended on the purposes for which they\nare provided;\n(d)    have the accounts of the University audited annually that they may be available for\nsubmission to the Senate within six months of the close of the financial year; and\n(e)    perform such other duties as may be prescribed.\n(4) The term of office of the Treasurer shall be a renewable period of three years:\nProvided that the Senate may, on the advice of the Rector, terminate the appointment of\nthe Treasurer on grounds of inefficiency or misconduct in accordance with prescribed procedure."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Controller of Examinations",
      "content": "(1) There shall be a Controller of Examinations, to be appointed\nby the Senate on the recommendation of the Rector, on such terms and conditions as may be prescribed.\n(2) The minimum qualifications necessary for appointment to the post of the Controller of\nExaminations shall be as may be prescribed.\n(3) The Controller of Examinations shall be a full-time officer of the University and shall be\nresponsible for all matters connected with the conduct of examinations and perform such other duties as\nmay be prescribed.\n(4) The Controller of Examinations shall be appointed for a renewable term of three years:\nProvided that the Senate may, on the advice of the Rector, terminate the appointment of the\nController of Examinations on grounds of inefficiency or misconduct in accordance with prescribed\nprocedure."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Authorities",
      "content": "_(1) The following shall be the Authorities of the University, namely:___\n(a)     authorities established by the Act,___\n(i)     the Senate;\n(ii)    the Syndicate; and\n(iii)   the Academic Council:\n(b)     authorities to be established by the Statutes.___\n(i)     Board of advances Studies and Research:\n(ii)    Recruitment, Development, Evaluation and Promotion committees and\nSelection Board for teachers and other staff whether at the level of the\ndepartment, the Faculty, the Campus or the University;\n(iii)   Career Placement and Internship Committee of each faculty;\n(iv)    Search Committee for the appointment of the Rector;\n(v)     the Representation Committees for appointment to the Senate, Syndicate\nand the Academic Council;\n(vi)    Board of Faculty;\n(vii)   Board of Studies of Department; and\n(viii) Finance and Planning Committee.\n(2) The Senate, the Syndicate and the Academic Council may set up such other committees or sub-\ncommittees. by whatever name described, as are considered desirable through Statutes or Regulations as\nappropriate. Such committees or sub-committees shall be Authorities of the University for the purposes\nof this Act."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Senate",
      "content": "(I) The body responsible for the governance of the University shall be described as\nthe Senate, and shall consist of the following, namely:__\n(a)     the Chancellor who shall be the Chairperson of the Senate;\n(b)     the Pro-Chancellors;\n(c)     the Rector;\n(d)     the Secretary of the Ministry dealing with the subject matter of Science and\nTechnology;\n(e)     the Secretary of the Ministry dealing with the subject of Education;\n(f)     One of the Pro-Rectors nominated by the Rector;\n(g)     four persons from society at large being persons of distinction in the fields of\nadministration, management, education, academics, law, accountancy, medicine,\nfine arts, architecture, agriculture, science, technology, industry and engineering so\nthat the appointment of these persons reflects a balance across the various fields:\nProvided that the special focus or affiliation of the University, to be declared\nin the manner prescribed, may be reflected in the number of persons of distinction\nin the areas of expertise relevant to the University who are appointed to the Senate;\n(h)     one person from amongst the alumni of the University;\n(i)     two persons from the academic community of the country, other than an employee\nof the University, at the level of professor or principal of a college;\n(j)     four University Teachers;\n(k)     Chairman, Higher Education Commission or his nominee: and\n(l)     Two Parliamentarians, one each from Senate and National Assembly.\n(2) The numbers of the members of the Senate described against clauses (h) to (j) of sub-section\n(1) may be increased by the Senate through Statutes subject to condition that the total membership of the\nSenate does not exceed twenty three, with a maximum of five University Teachers, and the increase is\nbalanced, to the extent possible, across the different categories specified in sub-section (1).\n(3) All appointments to the Senate shall be made by the Chancellor. Appointments of persons\ndescribed in clauses (h) to (i) of sub- section (1) shall be made from amongst a panel of three names for\neach vacancy recommended by the Representation Committee set up in terms of section 25 and in\naccordance with procedure as may be prescribed:\nProvided that effort shall be made, without compromising on quality or qualification, to give fair\nrepresentation to women on the Senate:\nProvided further that as regards the University Teachers described in clause (j) of sub-section (I)\nthe Senate shall prescribe a procedure for appointment on the basis of elections that provide for voting by\nthe various categories of University teacher:\nProvided a so that the Senate may alternatively prescribe that appointment of University Teachers\nto the Senate shall also be in the manner provided by this sub-section for the persons described in clauses\n(h) to (i) of sub-section (l).\n(4) Members of the Senate, other than ex-officio members, shall hold office for three years. One-\nthird of the members, other than ex-officio members, of the first restructured Senate, to be determined by\nlot, shall retire from office on the expiration of one year from the date of appointment by the Chancellor.\nOne- half of the remaining members, other than ex-officio members, of the first restructured Senate, to be\ndetermined by lot, shall retire from office on the expiration of two years from the date of appointment and\nthe remaining one - half, other than ex-officio members, shall retire from office on the expiration of the\nthird year:\nProvided that no person, other than an ex-officio member, may serve on the Senate for more than\ntwo consecutive terms:\nProvided further that the University Teachers appointed to the Senate may not serve for two\nconsecutive terms.\n(5) The Senate shall meet at least twice in a calendar year.\n(6) Service on the Senate shall be on honourary basis:\nProvided that actual expenses may be re-imbursed as prescribed.\n(7) The Registrar shall be the secretary of the Senate.\n(8) In the absence of the Chancellor, meetings of the Senate shall be presided over by the Federal\nMinister for Science and Technology being one of the Pro-Chancellors. In case of non-availability of the\nChancellor and the Federal Minister for Science and Technology, the Executive Director of COMSATS,\nbeing one of the Pro-Chancellors of University shall preside over the meeting.\n(9) Unless otherwise prescribed by this Act, all decisions of the Senate shall be taken on the basis\nof the opinion of a majority of the members present. In the event of the members being evenly divided on\nany matter the person presiding over the meeting shall have a casting vote.\n(10) The quorum for a meeting of the Senate shall be two thirds of its membership, a fraction being\ncounted as one."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Powers and functions of the Senate",
      "content": "_(1) The Senate shall have the power of general\nsupervision over the University and shall hold the Rector and the Authorities accountable for all the\nfunctions of the University. The Senate shall have all powers of the University not expressly vested in an\nAuthority or officer by the Act and all other powers not expressly mentioned by this Act that are necessary\nfor the performance of its functions.\n(2) Without prejudice to the generality of the foregoing powers, the Senate shall have the\nfollowing powers, namely:—\n(a)    to approve the proposed annual plan of work, the annual and revised budgets, the\nannual report and the annual statement of account;\n(b)    to hold, control and lay down policy for the administration of the property, funds\nand investments of the University, including the approval of the sale and purchase\nor acquisition of immovable property;\n(c)    to oversee the quality and relevance of the University’s academic programmes and\nto review the academic affairs of the University in general;\n(d)    to approve the appointment of the Deans, Professors, Associate Professors and such\nother senior faculty and senior administrators as may be prescribed;\n(e)    to institute schemes, directions and guidelines for the terms and conditions of\nappointment of all officers, teachers and other employees of the University;\n(f)    to approve strategic plans;\n(g)    to approve financial resource development plans of the University;\n(h)    to consider the drafts of Statutes and Regulations proposed by the Syndicate and\nthe Academic Council and deal with them in the manner as provided for in sections\n27 and 28, as the case may be:\nProvided that the Senate may frame a Statute or Regulation on its own\ninitiative and approve it after calling for the advice of the Syndicate or the\nAcademic Council as the case may be;\n(i)     to annul by order in writing the proceedings of any Authority or officer if\nthe Senate is satisfied that such proceedings are not in accordance with the\nprovisions of the Act, Statutes or Regulations after calling upon such\nAuthority or officer to show cause why such proceedings should not be\nannulled;\n(j)     to recommend to the Chancellor removal of any member of the Senate in\naccordance with the provisions of the Act;\n(k)     to make appointment of members of the Syndicate, other than ex-officio members,\nin accordance with the provisions of the Act;\n(l)     to make appointment of members of the Academic Council, other than ex-officio\nmembers, in accordance with the provisions of the Act;\n(m)     to appoint Emeritus Professors on such terms and conditions as may be prescribed;\n(n)     to remove any person from the membership of any Authority if such person has\nbecome of unsound mind or has become in-capacitated to function as member of\nsuch Authority or has been convicted by a court of law for an offence involving\nmoral turpitude; and\n(o)     to determine the form, provide for the custody and regulate the use of the common\nseal of the University.\n(3) The Senate may, subject to the provisions of the Act delegate all or any of the powers and\nfunctions of any Authority, officer or employee of the University at its main campus, of any Authority,\ncommittee, officer or employee at its campus for the purpose of exercising such powers and performing\nsuch functions in relation to such campus, and for this purpose the Senate may create new posts or\npositions at the campus."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Visitation. The Senate may, cause an inspection to be made in respect of any matter connected",
      "content": "with the University in the prescribed manner."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Syndicate",
      "content": "_(1)There shall be a Syndicate of the University consisting of the following,\nnamely:___\n(a)     the Rector who shall be its Chairperson;\n(b)     the Pro-Rector;\n(c)     Joint Secretary concerned from the Ministry of Science and Technology;\n(d)     the Directors;\n(e)     the Deans;\n(f)     three professors from different departments, who are not members of the Senate, to\nbe elected by the University Teachers in accordance with procedure to be\nprescribed by the Senate;\n(g)     Principals of the constituent colleges;\n(h)     the Registrar, who shall also be the secretary;\n(i)     the Treasurer and any other officer designated as principal officer under clause (j)\nof section 7: and\n(j)     the Controller of Examinations.\n(2) Members of the Syndicate, other than ex-officio members, shall hold office for three years.\n(3) As regards the three professors described in clause (e) of sub-section (1) the Senate may, as an\nalternative to elections, prescribe a procedure for proposal of a panel of names by the Representation\nCommittee set up in terms of section 25. Appointment of persons proposed by the Representation\nCommittee may be made by the Senate on the recommendation of the Rector.\n(4) The quorum for a meeting of the Syndicate shall be one- half of the total number of members,\na fraction being counted as one.\n(5) The Syndicate shall meet at least once in each quarter of the year."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Powers and duties of the Syndicate",
      "content": "_(1) The Syndicate shall be the executive body of the\nUniversity and shall, subject to the provisions of the Act and the Statutes, exercise general supervision\nover the affairs and management of the University.\n(2) Without prejudice to the generality of the foregoing powers, and subject to the provisions of\nthe Act, the Statutes and directions of the Senate the Syndicate shall have the following powers, namely:___\n(a)     to consider the annual report, the annual and revised budget estimates and to submit\nthese to the Senate;\n(b)     to transfer and accept transfer of movable property on behalf of the University;\n(c)     to enter into, vary, carry out and cancel contracts on behalf of the University;\n(d)     to cause proper books of account to be kept for all sums of money received and\nexpended by the University and for the assets and liabilities of the University;\n(e)     to invest any money belonging to the University including any un-applied income\nin any of the securities described in section 20 of the Trusts Act, 1882 (Act II of\n1882), or in the purchase of immovable property or in such other manner, as it may\nprescribe, with the like power of varying such investments;\n(f)     to receive and manage any property transferred, and grants, bequests, trust, gifts,\ndonations, endowments, and other contributions made to the University;\n(g)    to administer any funds placed at the disposal of the University for specified\npurposes;\n(h)    to provide the buildings, libraries, premises, furniture, apparatus, equipment and\nother means required for carrying out the work of the University;\n(i)    to establish and maintain halls of residence and hostels or approve or license hostels\nor lodgings for the residence of students;\n(J)    to recommend to the Senate affiliation or disaffiliation of colleges;\n(k)    to recommend to the Senate admission of educational institutions to the privileges\nof the University and withdraw such privileges; to arrange for the inspection of\ncolleges and the departments;\n(m)    to institute Professorships, Associate Professorships. Assistant Professorships,\nLectureships, and other teaching posts or to suspend or to abolish such posts;\n(n)    to create, suspend or abolish such administrative or other posts as may be necessary;\n(o)    to prescribe the duties of officers, teachers and other employees of the University;\n(p)    to report to the Senate on matters with respect to which it has been asked to report;\n(q)    to appoint members to various Authorities in accordance with the provisions of the\nAct;\n(r)    to propose drafts of Statutes for submission to the Senate;\n(s)    to regulate the conduct and discipline of the students of the University;\n(t)    to take actions necessary for the good administration of the University in general\nand to this end exercise such powers as are necessary;\n(u)    to delegate any of its powers to any Authority or officer or a committee; and\n(v)    to perform such other functions as have been assigned to it by the provisions of the\nAct or may be assigned to tit by the Statutes."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Academic Council",
      "content": "_(1) There shall be an Academic Council of the University consisting of\nthe following, namely:___\n(a)    the Rector who shall be its Chairperson;\n(b)    the Pro-Rector;\n(c)    the Campus Directors;\n(d)    the Deans of Faculties and such Heads of departments as may be prescribed;\n(e)    five members representing the departments, institutes and the constituent colleges\nto be elected in the manner prescribed by the Senate: two Principals of affiliated\ncolleges; five Professors including Emeritus Professors; the Registrar, who shall\nalso be the secretary; the Controller of Examinations; and the Librarian.\n(2) The Senate shall appoint the members of the Academic Council, other than the ex-officio and\nthe elected members, on the recommendation of the Rector:\nProvided that as regards five professors and the members representing the departments, institutes\nand the constituent colleges the Senate may, as an alternative to elections, prescribe a procedure for\nproposal of a panel of names by the Representation Committee set up in terms of section 25. Appointment\nof persons proposed by the Representation Committee may be made by the Senate on the recommendation\nof the Rector.\n(3) Member of the Academic Council shall hold office for three years.\n(4) The Academic Council shall meet at least once it each quarter.\n(5) The quorum for meetings of the Academic Council shall be one- half of the total number of\nmembers, a fraction being counted as one."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Powers and functions of the Academic Council",
      "content": "_(1) The Academic Council shall be the\nprincipal academic body of the University and shall, subject to the provisions of the Act and the Statutes,\nhave the power to lay down proper standards of instruction, research and examinations and to regulate and\npromote the academic life of the University and the colleges.\n(2) Without prejudice to the generality of the foregoing powers, and subject to the provisions of\nthis Act and the Statutes, the Academic Council shall have the power to,\n(a)    approve the policies and procedures pertaining to the quality of academic\nprogrammes;\n(b)    approve academic programmes;\n(c)    approve the policies and procedures pertaining to student related function:\nincluding admissions, expulsions, punishments, examinations and certification;\n(d)    approve the policies and procedures assuring quality of teaching and research:\n(e)    recommend the policies and procedures for affiliation of other educational\ninstitutions;\n(f)     propose o the Syndicate schemes for the constitution and organization of Faculties,\nteaching departments and boards of stud\n(g)     appoint paper setters and examiners for all examinations of the University after\nreceiving panels of names from the relevant authorities;\n(h)     institute programmes for the continued professional development of University\nTeachers at all levels;\n(i)     recognize the examinations of other Universities or examining bodies as equivalent\nto the corresponding examinations of the University;\n(j)     regulate the award of studentships, scholarships, exhibitions, medals and prizes:\n(k)     frame Regulations for submission to the Senate;\n(l)     prepare an annual report on the academic performance of the University; and\n(m)     perform such functions as may be prescribed by Regulations."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Representation Committees",
      "content": "_(1) There shall be a Representation Committee constituted by\nthe Senate through Statute for recommendation of persons for appointment to the Senate in accordance\nwith the provisions of section 18.\n(2) There shall also be a Representation Committee constituted by the Senate through Statute for\nthe recommendation of persons for appointment to the Syndicate and the Academic Council in accordance\nwith the provisions of sections 22 and 24.\n(3) Members of the Representation Committee for appointments to the Senate shall consist of the,\nnamely:___\n(a)     three members of the Senate who are not University Teachers;\n(b)     two persons nominated by the University Teachers from amongst themselves in the\nmanner prescribed:;\n(c)     one person from the academic community, not employed by the University, at the\nlevel of professor or college principal to be nominated by the University Teachers\nin the manner prescribed; and\n(d)     one eminent citizen with experience in administration, philanthropy, development\nwork, law or accountancy to be nominated by the Senate.\n(4) The Representation Committee for appointments to the Syndicate and the Academic Council\nshall consist of the following, namely:___\n(a)     two members of the Senate who are not University Teachers; and\n(b)     three persons nominated by the University Teachers from amongst themselves in\nthe manner prescribed.\n(5) The tenure of the Representation Committees shall be three years:\nProvided that no member shall serve for more than two consecutive terms.\n(6) The procedures of the Representation Committees shall be as may be prescribed.\n(7) There may also be such other Representation Committees set up by any of the other Authorities\nof the University as are considered appropriate for recommending persons for appointment to the various\nAuthorities and other bodies of the University."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Appointment of Committees by certain Authorities",
      "content": "_(1) The Senate, the Syndicate, the\nAcademic Council and other Authorities may, from time to time, appoint such standing, special or\nadvisory committees, as they may deem fit, and may place on such committee persons who are not\nmembers of the Authorities appointing the Committees.\n(2) The constitution, functions and powers of the Authorities for which no specific provision has\nbeen made in this Act shall be such as may be proscribed by Statutes or Regulations.\nSTATUTES, REGULATIONS AND RULES"
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Statutes",
      "content": "_(1) Subject to the provisions of the Act, Statutes, may be made to regulate or\nprescribe all or any of the following matters:___\n(a)     the contents of and the manner in which the annual report to be presented by the\nRector before the Senate shall be prepared;\n(b)     the University fees and other charges;\n(c)     the constitution of any pension, insurance, gratuity, provident fund and benevolent\nfund for University employees;\n(d)     the scales of pay and other terms and conditions of service of officers, teachers and\nother University employees;\n(e)     the maintenance of the register of registered graduates;\n(f)     affiliation and disaffiliation of educational institutions and related matters;\n(g)     admission of educational institutions to the privileges of the University and the\nwithdrawal of such privileges;\n(h)     the establishment of Campuses, Faculties, departments, institutes, colleges, Science\nand Technology Park and other academic divisions;\n(i)     the powers and duties of officers and teachers;\n(j)     conditions under which the University may enter into arrangements with other\ninstitutions or with public bodies for purposes of research and advisory services;\n(k)     conditions for appointment of Emeritus Professors and award of honorary degrees;\n(l)     efficiency and discipline of University employees;\n(m)     the constitution and procedure to be followed by Representation Committees in\ncarrying out functions in terms of this Act;\n(n)     the constitution and procedure to be followed by the Search Committee for\nappointment of the Rector,\n(o)     constitution, functions and powers of the Authorities of the University; and\n(p)     all other matters which by this Act are to be or may be prescribed or regulated by\nStatutes.\n(2) The draft of Statutes shall be proposed by the Syndicate to the Senate which may approve or\npass with such modifications as the Senate may think fit or may refer back to the Syndicate, as the case\nmay be, for reconsideration of the proposed draft:\nProvided that Statutes concerning any of the matters mentioned in clauses (a) and (l) of sub-section\n(1) shall be initiated and approved by the Senate, after seeking the views of the Syndicate:\nProvided further that the Senate may initiate a Statute with respect to any matter in its power or\nwith respect to which a Statute may be framed in terms of the Act and approve such Statute after seeking\nthe views of the Syndicate."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Regulations",
      "content": "_(1) Subject to the provisions of the Act and the Statutes, the Academic Council\nmay make Regulations, for all or any of the following matters, namely:___\n(a)     the courses of study for degrees, diplomas and certificates of the University;\n(b)     the manner in which the teaching referred to in sub-section (I) of section 6 shall be\norganized and conducted;\n(c)     the admission and expulsion of students to and from the University;\n(d)    the conditions under which students shall be admitted to the courses and the\nexaminations of the University and shall become eligible for the award of degrees,\ndiplomas and certificates;\n(e)    the conduct of examinations;\n(f)    conditions under which a person may carry on independent research to entitle him\nto a degree;\n(g)    the institution of fellowships, scholarships, exhibitions, medals and prizes;\n(h)    the use of the Library;\n(i)    the formation of Faculties, departments and board of studies; and\n(j)    all other matters which by the Act or tie Statutes are to be or may be prescribed by\nRegulations.\n(2) Regulations shall be proposed by the Academic Council and shall be submitted to the Senate\nwhich may approve them or withhold approval or refer them back to the Academic Council for\nreconsideration. A Regulation proposed by the Academic Council shall not be effective unless it receives\nthe approval of the Senate.\n(3) Regulations regarding to matters incidental to those contained in sub clauses (g) and (i) shell\nnot be submitted to the Senate without the prior approval of the Syndicate."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Amendment and repeal of Statutes and Regulations",
      "content": "The procedure for adding to,\namending or repealing the Statutes and the Regulations shall be the same as that prescribed respectively\nfor framing or making Statutes and Regulations."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Rules",
      "content": "_(1) The Authorities and the other bodies of the University may make rules, consistent\nwith the Act, Statutes or the Regulations, to regulate any matter relating to the affairs of the University\nwhich has not been provided for by the Act or that is not required to be regulated by Statutes or\nRegulations, including rules to regulate the conduct of business and the time and place of meetings and\nrelated matters.\n(2) Rules shall become effective upon approval by the Syndicate."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. University fund",
      "content": "The University shall have a fund to which shall be credited its income\nfrom fees, charges, donations, trusts, bequests, endowments, contributions, grants and all other sources."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Audits and Accounts",
      "content": "_(1)The Accounts of the University shall be maintained in such form\nand in such manner as may be prescribed.\n(2) The teaching departments, constituent colleges, institutes and all other bodies designated as\nsuch by the Syndicate in terms of Statutes shall be independent cost centres of the University with\nauthority vested in the head of each cost centre to sanction expenditure out of the budget allocated to it:\nProvided that re-appropriation from one head of expenditure.to another may be made by the head\nof a cost centre in accordance with and to the extent prescribed by the Statutes.\n(3) All funds generated by a teaching department, constituent college or other unit of the University\nthrough consultancy, research or other provision of service shall be made available without prejudice to\nthe budgetary allocation otherwise made, after deduction of overheads in the manner and to the extent\nprescribed by Statute, to the teaching department, constituent college or other unit for its development. A\npart of the funds so generated may be shared with the University Teachers or researchers in charge of the\nconsultancy, research or service concerned in the manner and to the extent prescribed by Statute.\n(4) No expenditure shall be made from the funds of the University, unless a bill for its payments\nhas been issued by the head of the cost centre concerned in accordance with the relevant statutes and the\nTreasurer has verified that the payment is provided for in the approved budget of the cost centre, subject\nto the authority to re-appropriate available to the head of the cost centre.\n(5) Provisions shall be made for an internal audit of the finances of the University.\n(6) Without prejudice to the requirement of audit by an auditor appointed by Government in\naccordance with the provisions of any other law in force, the annual audited statement of accounts of the\nUniversity shall be prepared in conformity with the Generally Accepted Accounting Principles by a\nreputed firm of chartered accountants and signed by the Treasurer. The annual audited statement of\naccounts so prepared shall be submitted to the Auditor General of Pakistan for his observations.\n(7) The observations of the Auditor General of Pakistan, if any, together with such annotations as\nthe Treasurer may make, shall be considered by the Syndicate and shall be placed before the Senate within\nsix months of closing of the financial year."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Opportunity to show cause",
      "content": "Except as otherwise provided by law no officer, teacher or\nother employee of the University holding a permanent post shall be reduced in rank, or removed or\ncompulsorily retired from service for cause arising out of any act or omission on the part of the person\nconcerned unless he has been given a reasonable opportunity of showing cause against the action proposed\nto be taken."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Appeal to the Syndicate and the Senate",
      "content": "Where an order is passed punishing any officer\nother than the Rector, teacher or other employee of the University or altering or interpreting to his dis-\nadvantage the prescribed terms or conditions of his service, he shall, where the order is passed by any\nofficer or teacher of the University other than the Rector, have the right to appeal to the Syndicate against\nthe order, and where the order is passed by the Rector, have the right to appeal to the Senate."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Service of the University",
      "content": "_(1) All persons employed by the University in accordance with\nthe terms and conditions of service prescribed by statutes shall be persons in the service of Pakistan for\nthe purposes of any court or tribunal set up by lax in terms of Article 212 of the Constitution of the Islamic\nRepublic of Pakistan:\nProvided that any provision as regards the terms and conditions of employment of persons in the\nservice of Pakistan in general or in comparable employment notwithstanding the service of persons\nemployed by the University shall be entirely governed by the terms and conditions prescribed by the\nrelevant Statutes.\n(2) An officer, teacher or other employee of the University shall retire from service on the\nattainment of such age or tenure of service as may be prescribed.\n(3) No adverse change shall be made in the terms and conditions of employment of any University\nTeacher in the employment of the University on the date of enforcement of the Act."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Benefits and insurance",
      "content": "_(1) The University shall constitute for the benefit of its officers,\nteachers and other employees schemes, as may be prescribed, for the provision of post-employment\nbenefits as well as health and life insurance while in service.\n(2) Where any provident fund has been constituted under this Act, the provisions of the Provident\nFunds Act, 1925 (XIX of 1925), shall apply to such funds as if it were the Government Provident Fund."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Commencement of term of office of members of Authority",
      "content": "_(1) When a member of a\nnewly constituted Authority is elected, appointed or nominated, his term of office, as fixed under this Act,\nshall commence from such date as may be prescribed.\n(2) Where a member who has accepted any other assignment or for any other similar reason\nremains absent from the University for a period of not less than six months he shall be deemed to have\nresigned and vacated his seat."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Filling of casual vacancies in authorities",
      "content": "Any casual vacancy among the members of any\nAuthority shall be filled. as soon as conveniently may be, in the same manner and by the same person or\nauthority that had appointed the member whose place has become vacant and the person appointed to the\nvacancy shall be a member of such authority for the residue of the term for which the person whose place\nhe tilts would have been a member."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Flaws in the constitution of authorities",
      "content": "Where there is a flaw in the constitution of an\nauthority, as constituted by this Act, the Statutes or the Regulations on account of the abolition of a\nspecified office under Government or because an organization, institution or other body outside the\nUniversity has been dissolved or has ceased to function, or because of some other similar reason, such\nflaw shall be removed in such manner as the Senate may direct."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Proceedings of authorities not invalidated by the vacancies",
      "content": "No act, resolution or decision\nof any authority shall be invalid by reason of any vacancy on the authority doing, passing, or making it or\nby reason of any want of qualification or invalidity in the election, appointment or nomination of any de\nfacto member of the authority, whether present or absent."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. First Statutes and Regulations",
      "content": "Notwithstanding anything to the contrary contained in the\nAct, the President of Pakistan shall promulgate the First Statutes and Regulations which shall he deemed\nto be Statutes and Regulations framed under section 27 and 28 and shall continue to remain in force until\namended or replaced or till such ime as new Statutes and Regulations are framed in accordance with the\nprevisions of the Act."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Repeal and savings",
      "content": "_(1) The COMSATS Institute of Information Technology Ordinance,\n2000(XXX VIII of 2000), shall stand repealed.\n(2) Notwithstanding the repeal envisaged by sub-section (1),___\n(a)    everything done, action taken, obligations or liabilities incurred, rights and assets\nacquired, persons appointed or authorized. jurisdiction or powers conferred,\nendowments, bequests, funds or trusts created, donations or grants made,\nscholarships, studentship, or exhibitions instituted, affiliations or privileges granted\nand orders issued under any of the provisions of the (QMSATS Institute of\nInformation Technology Ordinance, 2000 (XXXVIII of 2000), or the Statutes, the\nRegulations and the Rules made or deemed to have been made thereunder, shall, if\nnot inconsistent with the provisions of the Act or the Statutes, the Regulations or\nrespectively done, taken, occurred, acquired, appointed, authorized, conferred.\ncreated, made, instituted, granted and issued under this Act, and any documents\nreferring to any of the provisions of the COMSATS Institute of Information\nTechnology Ordinance, 2000 (XXXVIII of 2000), or the Statutes the Regulations\nand the Rules first referred shall, so far as may be. be considered to refer to the\ncorresponding provisions of the Act or the Statutes, the Regulations and the Rules\nmade under this Act;\n(b)    all campuses, institutes, colleges or ether constituent units of the University\nfunctioning in terms of the provisions of the COMSATS Institute of Information\nTechnology Ordinance, 2000 (XXXVII of 2000), all continue to function in terms\nof the relevant repealed provisions till such time that the Senate through Statute has\nprescribed otherwise; and\n(e)    any Statutes, Regulations, or Rules made or deemed to have been made u der the\nCOMSATS Institute of Information Technology Ordinance, 2000(XXX VIII of\n2000) shall if not inconsistent with the provisions of the Act be deemed to be\nStatutes, Regulations or Rules made under the Act having regard to the various\nmatters which by the Act have to be regulated or prescribed by Statutes,\nRegulations and Rules respectively and shall continue to be in force until they are\nrepealed, rescinded or modified in accordance with the provisions of the Act."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Transitory Provisions",
      "content": "_(l) Notwithstanding anything contained in the Act, upon the coming\ninto force of this Act, the Senate shall be structured and the members thereof, except the University\nTeachers, appointed by the Chancellor in accordance with the numbers and criteria for membership\nspecified in the Act. As regards the University Teachers to be elected or appointed to the newly structured\nSenate elections shall be held as soon as possible and shall be appointed to the Senate as provided in the\nAct. The first Senate shall initiate, as soon as possible, the process for the appointment of the members of\n(2) Any existing provision as regards tenure notwithstanding the Rector and the other Authorities,\nin existence immediately before the date on which the Act is enforced with respect to COMSATS\nUniversity, shall continue to function and shall, as far as may be, exercise the powers respectively assigned\nto the Rector and the corresponding Authorities by or under this Act, until such time as they are\nrespectively replaced in accordance with the terms of the Act."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Removal of difficulties",
      "content": "_(1) If any question arises as to the interpretation of any of the\nprovisions of the Act, it shall be placed before the Chancellor whose decision thereon shall be final.\n(2) If any difficulty arises in giving effect to any of the provisions of the Act, the Chancellor may\nmake such order after obtaining the views of the Senate, not inconsistent with the provisions of this Act,\nas may appear to him to be necessary for removing the difficulty.\n(3) Where the Act makes any provision for anything to be done but no provision or no sufficient\nprovision has been made as respects the authority by whom, or the time at which, or the manner in which,\nit shall be done, then it shall be done by such authority, at such time, or in such manner as the Chancellor\nmay direct after obtaining the views of the Senate."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Indemnity",
      "content": "No suit or legal proceedings shall lie against the Government, the University or\nany Authority, officer or employee of the Government or the University or any person in respect of\nanything which is done in good faith under the Act."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Power to allow appointment of employees of the Government, other universities or",
      "content": "educational or research institutions to the University.___(1) Notwithstanding anything contained in the\nAct the Senate may, on the advice of the Syndicate, allow an post in the University to be filled by\nappointment, on such terms as may be prescribed, an employee of the Government or any other university\nor educational or research institution.\n(2) Where any appointment has been made under this section, the terms and conditions of service\nof the appointee shall not be less favourable than those admissible to him immediately before such\nappointment and he shall be entitled to all benefits of his post of service.\ns"
    }
  ],
  "definitions": [
    {
      "term": "Academic Council",
      "definition": "the Academic Council of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Affiliated college",
      "definition": "an educational institution affiliated to the University but not maintained or administered by it;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "any of the Authorities of the University specified in this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Campus",
      "definition": "a constituent campus of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of an academic Department to whom the status of an academic Department is granted by this Act or by the Statutes or Regulations;",
      "source_provision": "sec2"
    },
    {
      "term": "Chancellor",
      "definition": "the Chancellor of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "College",
      "definition": "a constituent college or an affiliated college; (viii) “Commission” means the Higher Education Commission set up by the Higher Education Commission Ordinance, 2002 (L.III of2002);",
      "source_provision": "sec2"
    },
    {
      "term": "COMSATS",
      "definition": "the Commission on Science and Technology for Sustainable Development in the South;",
      "source_provision": "sec2"
    },
    {
      "term": "Constituent college",
      "definition": "an educational institution, by whatever name described, maintained and administered by the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Dean",
      "definition": "the head of a Faculty or the head of an academic body granted the status of a Faculty by this Act or by the Statutes or Regulations;",
      "source_provision": "sec2"
    },
    {
      "term": "Department",
      "definition": "a teaching department maintained and administered, or recognized by, the University in the manner prescribed; (xiii) “Director means the head of an institute or a constituent campus established by the University under Statutes or Regulations;",
      "source_provision": "sec2"
    },
    {
      "term": "Faculty",
      "definition": "an administrative and academic unit of the University consisting of one or more departments, as prescribed;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by Statutes, Regulations or Rules made under this Act; (xvii) “Principal” means the head of a college; (xviii) “Pro-Chancellor” means the Pro-Chancellor of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Pro-Rector",
      "definition": "Pro-Rector of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Rector",
      "definition": "the Rector of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Representation Committees",
      "definition": "the Representation Committees constituted under section 25; (xxii) “Review Panel” means the Review Panel set up by the Chancellor in accordance with the provisions of section 8; (xxiii) “Search Committee” means the Search Committee set up under section 12; (xxiv) “Senate” means the Senate of the University;",
      "source_provision": "sec2"
    }
  ]
}
