{
  "id": "pk-contempt-of-court-ordinance-2003",
  "type": "statute",
  "title": "Contempt of Court Ordinance, 2003",
  "title_en": "Contempt of Court Ordinance, 2003",
  "short_name": "COCO",
  "status": "in_force",
  "issued_date": "2003-12-14",
  "in_force_date": "2003-12-14",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tjZg%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Contempt of Court Ordinance, 2003 (V of 2003) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Punishment.__ (1) Subject to sub",
      "content": "section (2), any person who commits contempt of court\nshall be punished with imprisonment which may extend to six months simple imprisonment, or with\nfine which may extend to one hundred thousand rupees, or with both.\n(2) A person accused of having committed contempt of court may, at any stage, submit an\napology and the court, if satisfied that it is bona fide, may discharge him or remit his sentence.\nExplanation.__ The fact that an accused person genuinely believes that he has not committed\ncontempt and enters a defence shall not detract from the bona fides of an apology.\n(3) In the case of a contempt having been committed, or alleged to have been committed, by a\ncompany, the responsibility therefore shall extend to the persons in the company, directly or indirectly,\nresponsible for the same, who shall also be liable to be punished accordingly.\n(4) Notwithstanding anything contained in any judgement, no court shall have the power to\npass any order of punishment for or in relation to any act of contempt save and except in accordance\nwith sub-section (1)."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Criminal contempt when committed",
      "content": "(1) A criminal contempt shall be deemed to have\nbeen committed if a person__\n(a)     attempts to influence a witness, or proposed witness, either by intimidation or\nimproper inducement, not to give evidence, or not to tell the truth in any legal\nproceeding;\n(b)     offers an improper inducement or attempts to intimidate a judge, in order to\nsecure a favourable verdict in any legal proceedings;\n(c)     commits any other act with intent to divert the course of justice.\n(2) Nothing contained in sub-section (1) shall prejudice any other criminal proceedings which\nmay be initiated against any such person as is mentioned therein."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Cognisance of criminal contempt",
      "content": "In the case of a criminal contempt a superior court\nmay take action;\n(i)     suo moto; ог\n(ii)    on the initiative of any person connected with the proceedings in which the\nalleged contempt has been committed; or\n(iii)   on the application of the law officer of a Provincial or the Federal Government."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Fair reporting.__ (1) Subject to sub",
      "content": "section (2), the publication of a substantially accurate\naccount of what has transpired in a court, or of legal proceedings, shall not constitute contempt of\ncourt.\n(2) The court may, for reasons to be recorded in writing, in the interest of justice, prohibit the\npublication of information pertaining to legal proceedings."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Personalized criticism",
      "content": "(1) Subject to the provisions of this Ordinance, personalized\ncriticism of a specific judge, or judges, may constitute judicial contempt save and except true averment\nif made in good faith and in temperate language in a complaint made,__\n(a)     to the administrative superior of a judge of a subordinate court;\n(b)     to a Provincial Government;\n(c)     to the Chief Justice of a High Court;\n(d)     to the Supreme Court;\n(e)     to the Supreme Judicial Council; or\n(f)     to the Federal Government for examination and being forwarded to the Supreme\nJudicial Council.\n(2) Nothing contained in sub-section (1) is intended to deprive a judge of the right to file a suit\nfor defamation."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Fair comments",
      "content": "The fair and healthy comments on a judgment involving question of\npublic importance in a case which has finally been decided and is no longer pending shall not constitute\ncontempt:\nProvided that it is phrased in temperate language and the integrity and impartiality of a Judge\nis not impugned."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Judicial contempt",
      "content": "(1) A superior court may take action in a case of judicial contempt\non its own initiative or on information laid before it by any person.\n(2) Any person laying false information relating to the commission of an alleged judicial\ncontempt shall himself be liable to be proceeded against for contempt of court.\n(3) Judicial contempt proceedings initiated by a judge, or relating to a judge, shall not be heard\nby the said judge, but shall (unless he is himself the Chief Justice) be referred to the Chief Justice, who\nmay hear the same personally or refer it to some other judge, and, in a case in which the judge himself\nis the Chief Justice, shall be referred to the senior most judge available for disposal similarly.\n(4) No proceedings for judicial contempt shall be initiated after the expiry of one year."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Civil contempt",
      "content": "(1) Proceedings for civil contempt may be initiated suo moto or at the\ninstance of an aggrieved party.\n(2) The provisions contained herein are intended to be in addition to, and not in derogation of,\nthe power of the court under any other law for the time being in force to enforce compliance of its\norders, judgements or decrees."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Procedure in cases of contempt in the face of the court",
      "content": "(1) In the case of a contempt\ncommitted in the face of the court, the court may cause the contemner/offender to be detained in\ncustody and may proceed against him in the manner provided in sub-section (2):\nProvided that if the case cannot be finally disposed of on the same day, the court may order the\nrelease of the accused from the custody either on bail or on his own bond.\n(2) In all cases of contempt in the face of the court the judge shall pass an order in open court\nrecording separately what was said or done by the accused person and shall immediately proceed\nagainst the offender or may refer the matter to the Chief Justice for hearing and deciding the case by\nhimself or by another Judge."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Expunged material",
      "content": "No material which has been expunged from the record under the\norders of__\n(i)     a court of competent jurisdiction; or\n(ii)    the presiding officer of the Senate, the National Assembly or a Provincial\nAssembly,\nshall be admissible in evidence unless it is otherwise ordered by the court."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Innocent publication",
      "content": "No person shall be guilty of contempt of court for making any\nstatement, or publishing any material, pertaining to any matter which forms the subject of pending\nproceedings, if he was not aware of the pendency thereof."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Protected statements",
      "content": "No proceedings for contempt of court shall lie in relation to the\nfollowing:__\n(i)     observations made by a higher or appellate court in a judicial order or\njudgement;\n(ii)    remarks made in an administrative capacity by any authority in the course of\nofficial business, including those in connection with a disciplinary inquiry or in\nan inspection note or a character roll or confidential report; and\n(iii)   a true statement regarding conduct of a judge connected with the performance\nof his judicial functions:\nProvided that onus of proof shall be on the person relying on the statement."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Procedure",
      "content": "(1) Save as expressly provided to the contrary, proceedings in cases of\ncontempt shall be commenced by the issuance of a notice, or a show cause notice, at the discretion of\nthe court.\n(2) In the case of a notice the alleged contemner may enter appearance in person or through an\nadvocate, and, in the case of a show cause notice, shall appear personally:\nProvided that the court may at any time exempt the alleged contemner from appearing\npersonally.\n(3) If, after giving the alleged contemner an opportunity of a preliminary hearing, the court is\nprima facie satisfied that the interest of justice so requires, it shall fix a date for framing a charge in\nopen court and proceed to decide the matter either on that date, or on a subsequent date or dates, on\nthe basis of affidavits, or after recording evidence:\nProvided that the alleged contemner shall not, if he so requests, be denied the right of cross\nexamination in relation to any affidavit, other than that of a judge, used in evidence against him."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Substantial detriment",
      "content": "(1) No person shall be found guilty of contempt of court, or\npunished accordingly, unless the court is satisfied that the contempt is one which is substantially\ndetrimental to the administration of justice or scandalizes the court or otherwise tends to bring the\ncourt or Judge of the court into a hatred or ridicule.\n(2) In the event of a person being found not guilty of contempt by reason of sub-section (1) the\ncourt may pass an order deprecating the conduct, or actions, of the person accused of having committed\ncontempt.\n(3) Subject to the provisions of this Ordinance, truth shall be a valid defence in cases of\ncontempt of court."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Appeal",
      "content": "(1) Notwithstanding anything contained in any other law or the rules for the time\nbeing in force, orders passed by a superior court in cases of contempt shall be appealable in the\nfollowing manner:__\n(i)     in the case of an order passed by a single judge of a High Court an intra-court\nappeal shall lie to a bench of two or more judges;\n(ii)    in a case in which the original order has been passed by a division or larger\nbench of a High Court an appeal shall lie to the Supreme Court; and\n(iii)   in the case of an original order passed by a single judge or a bench of two judges\nof the Supreme Court an intra-court appeal shall lie to a bench of three judges\nand in case the original order was passed by a bench of three or more judges an\nintra-court appeal shall lie to a bench of five or more judges.\n(2) The appellate court may suspend the impugned order pending disposal of the appeal.\n(3) The limitation period for filing an appeal shall be thirty days."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Repeal",
      "content": "The Contempt of Court Act, 1976 (LXIV of 1976) is hereby repealed.\n_______\nRGN Date: 18-04-2025"
    }
  ],
  "definitions": []
}
