{
  "id": "pk-cooperative-farming-act-1976",
  "type": "statute",
  "title": "Cooperative Farming Act, 1976",
  "title_en": "Cooperative Farming Act, 1976",
  "short_name": "CFA",
  "status": "in_force",
  "issued_date": "1976-07-18",
  "in_force_date": "1976-07-18",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2Jx-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Cooperative Farming Act, 1976 (LII of 1976) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Shot title, extent and commencement.―(1) This Act may be called the Co",
      "content": "operative\nFarming Act, 1976.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Act to override other laws.―The provisions of this Act and the rules shall have effect",
      "content": "notwithstanding anything contained in the Co-operative Societies Act, 1925 (Act VII of 1925), or\nin any other law for the time being in force relating to the rights of landlords and tenants."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Definitions.―In this Act, unless there is anything repugnant in the subject or",
      "content": "context,―\n(a)     ‘agricultural year’ has the same meaning as in the West Pakistan Land Revenue\nAct, 1967 (W. P. Act No. XVII of 1967) ;\n(b)     ‘bye-laws’ means bye-laws registered under this Act ;\n(c)     ‘committee’ means the managing committee of a society ;\n(d)     ‘co-operative farm’ means the total land pooled by the members of a society ;\n(e)    ‘District Co-operative Council’ means a District Co-operative Council formed\nunder section 39 ;\n(f)    ‘District Co-operative Federation’ means a District Co-operative Federation of\nCo-operative Farming Societies formed under section 35 ;\n(g)   ‘member’ means a member of a society ;\n(h)   ‘National Co-operative Council’ means the National Co-operative Council\nconstituted under section 43 ;\n(i)   ‘nation building department’ means the departments which the Provincial\nGovernment may, by notification in the official Gazette, designate as such for\nthe purposes of this Act ;\n(j)   ‘net profits’ means net profits as defined in sub-section (3) of section 87C\nof the Companies Act, 1913 (VII of 1913) ;\n(k)   ‘office-bearers’ means the Chairman, Vice-Chairman, Secretary and\nTreasurer of a Committee ;\n(l)   ‘prescribed’ means prescribed by rules ;\n(m)   ‘produce index units’ means the measures in terms of which the comparative\nproductivity of an area of land of a particular kind in a particular assessment\ncircle or area is computed and expressed for the purposes of the schemes\nrelating to the re-settlement of displaced persons on land and, in respect of any\nassessment circle or area where no such units have been determined, such\nmeasures as may be prescribed ;\n(n)   ‘produce income’ means the total income derived from all earnings of\nthe co-operative farm before deducting any expenses ;\n(o)   ‘Provincial Co-operative Council’ means a Provincial Co-operative Council\nformed under section 41;\n(p)   ‘Provincial Co-operative Federation’ means a Provincial Co-operative\nFederation of Co-operative Farming Societies formed under section 37 ;\n(q)   ‘Registrar’ means a person appointed to perform the duties of Registrar of\nCo-operative Societies under the Co-operative Societies Act, 1925 (Act VII of\n1925), and includes an officer authorised by Government to perform the duties\nof Registrar under this Act ;\n(r)   ‘rules’ means rules made under this Act ;\n(s)   ‘society’ means a co-operative farming society registered under this Act ;\n(t)   ‘tenant’ means tenant as defined in the Punjab Tenancy Act, 1887 (Punjab Act\nNo. XVI of 1887) ; and\n(u)   ‘value’ in relation to land, means the value as evaluated under section 13."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Conditions of registration.―(1) A co",
      "content": "operative farming society which fulfils the\nfollowing conditions may apply to the Registrar for registration under this Act, namely :―\n(a)    it consists of not less than twenty members ;\n(b)     the total land pooled by its members is—\n(i)     in the case of the Provinces of Baluchistan, the Punjab and Sind, not\nless than five hundred acres ; and\n(ii)    in case of the North-West Frontier Province, not less than three\nhundred acres ; and\n(c)     the land pooled by its members forms one contiguous farm.\n(2) An application under sub-section (1) shall be made in such form, and be accompanied by\nsuch documents, as may be prescribed."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Procedure of registration.―If, after making such enquiry as he considers necessary, the",
      "content": "Registrar is satisfied that a co-operative farming society applying for registration is eligible for\nregistration under this Act, and that the bye-laws proposed to be framed by it are not inconsistent\nwith any of the provisions of this Act, or the rules, he shall register it, and its bye-laws, within fifteen\ndays from the receipt of its application."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Evidence of registration.―A certificate of registration signed by the Registrar shall be",
      "content": "conclusive evidence that the society mentioned therein is duly registered, unless it is proved\nthat the registration of the society has been cancelled."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Amendment of the bye",
      "content": "laws of a society.―(1) No amendment of the bye-laws of a society\nshall be effective unless it is registered with the Registrar.\n(2) If the Registrar is satisfied that an amendment of the bye-laws proposed to be made\nby a society is not inconsistent with any of the provisions of this Act or the rules he shall register\nthe amendment."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. General meeting.―Every society shall call an annual general meeting of its members",
      "content": "and not less than one other general meeting in an agricultural year."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Special general meeting.―(1) On a requisition signed by not less than one",
      "content": "fifth of the\ntotal number of members of a society, the Chairman shall call a special general meeting of the society\nwithin thirty days of the receipt of the requisition.\n(2) If the Chairman does not call the meeting within the time specified in sub-section (1), the\nRegistrar shall direct the Chairman to call the meeting within a period of seven days and, if the\nChairman fails to do so, may himself call the meeting.\nMANAGING COMMITTEE AND RIGHTS AND LIABILITIES OF MEMBERS."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Managing committee of a society.―(1) Each member shall have one vote irrespective",
      "content": "of the area of the land pooled by him ; provided that in case of a deceased member all his\nheirs who want to remain members shall be registered and shall have the right to vote.\n(2) The members shall, in their annual general meeting, elect, by majority of votes,—\n(a)    a managing committee consisting of not less than seven and not more than\neleven members, including the office-bearers ; and\n(b)    one representative for the District Co-operative Federation.\n(3) A member of a committee, including an office-bearer, and the representative shall, unless\nhe resigns or is removed from office earlier, hold office for a term of two years.\n(4) No member of a committee or an office-bearer or the representative shall hold office\nfor more than two consecutive terms.\n(5) Subject to such decisions, if any, as may be taken in a general meeting of a society,\nthe management of the affairs of a society shall vest in the committee.\n(6) A member of a committee, including an office-bearer or the representative, may be\nremoved from office by a resolution passed by a majority of the total number of members of a\nsociety in an annual general meeting or a meeting requisitioned for this purpose by not less than\none-third of the total number of members.\n(7) Any member of a committee, including an office-bearer, may by writing under his hand\naddressed to the Chairman, resign his office."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Pooling of land.―(1) Every member shall, subject to the provisions of clause (c) of sub",
      "content": "section (1) of section 4, pool his entire holding without affecting his ownership of the holding in any\nway :\nProvided that a member or group of members owning a subsistence holding may retain\nfor his or their personal use an area not exceeding—\n(a)    in the case of Baluchistan, two acres ; and\n(b)    in the case of the other Provinces, one acre :\nProvided further that a member or group of members pooling more than a subsistence holding\nmay retain for his or their personal use such area not exceeding—\n(a)     in the case of Baluchistan, four acres, and\n(b)     in the case of the other Provinces, two acres ;\nas may be determined by the committee :\nProvided further that the location of the area to be so retained may be determined by the\ncommittee :\nProvided further that a member owning less than a subsistence holding shall not be entitled to\nretain any land for his personal use.\nExplanation.― In this section, ‘subsistence holding’ shall have the same meaning as in the\nLand Reforms Regulation, 1972.\n(2) All land pooled for a co-operative farm by members shall, for the purposes of management,\nvest in the society."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Evaluation of land, etc.―(1) The land pooled by each member for a co",
      "content": "operative\nfarm shall be evaluated by the Managing Committee according to its quality and area on the basis of\nproduce index units.\n(2) If any land pooled by a member for a co-operative farm contains orchards, ponds or any\nother immovable structures, the value of the orchards, ponds and other structures shall be assessed\nby the Managing Committee and added to the shares of such member :\nProvided that trees other than orchards shall continue to be the property of the member\nand the value thereof shall not be assessed or added to his share :\nProvided further that, if the committee decides to remove such trees or structures standing on\nany land, such trees or structures shall be removed on payment to the owner of such land of such\ncompensation as may be determined by the committee."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Withdrawal from membership.―(1) A member who has been a member of a society for",
      "content": "not less than three years may, by notice under his hand addressed to the Chairman and delivered to\nhim by the thirty-first day of March in any year, withdraw from membership of the society.\n(2) Where, due to the death of a member, the rights and liabilities of the member devolve upon\nhis legal heirs or successors and any of the heirs or successors is a minor the rights and liabilities of\nthe minor shall be the rights and liabilities of his guardian until such time as the minor attains majority.\n(3) A minor referred to in sub-section (2) may, after he attains majority, withdraw from\nthe membership of the society in the manner provided for in sub-section (1) if the land owned by\nhim has formed part of the co-operative farm for not less than three years.\n(4) On a member withdrawing from the membership of a society―\n(a)    he shall cease to be member on and from the first day of July following the\nday on which he gives notice of his withdrawal ;\n(b)     the land pooled by him shall revert to him on the aforesaid day subject to any\nencumbrances that may have been created on it by the society, to such extent\nas may be determined by the society ;\n(c)     he shall not be entitled to any share in the Development Fund or to any right or\ninterest in anything established or purchased out of that Fund ; and\n(d)      he shall pay to the society, towards the cost of tubewells installed, residential\nhouses, sheds or other structures raised, or improvements done, on his land by\nthe society, such amount, and in such manner, as may be determined by the\nsociety.\n(5) As soon as may be after a person ceases to be a member, his name shall be notified\nto the Registrar for removal from membership."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Admission of new members.―(l) Subject to the other provisions of this Act, a committee",
      "content": "may admit to the membership of the society any owner of land who pools his land :\nProvided that no owner of land shall be so admitted except after the close of the agricultural\nyear during which the society is registered.\n(2) As soon as may be after an owner of land is admitted as a member under sub- section (1),\nhis name shall be notified to the Registrar."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Societies to be bodies corporate.―A society shall be a body corporate by the name",
      "content": "under which it is registered, having perpetual succession and a common seal, with power to hold\nproperty, both movable and immovable, and shall by the said name sue and be sued."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Copy of Act, etc., to be open to inspection.―Every society shall keep open to inspection",
      "content": "at all reasonable times at the registered address of the society, free of charge,—\n(a)     a copy of this Act,\n(b)     a copy of the rules governing such society,\n(c)     a copy of the bye-laws of such society, and\n(d)     a register of its members."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Liability in respect of encumbrances on land.―Where the land pooled by a member",
      "content": "is subject to any encumbrances, such encumbrances shall continue to be the liability of such member."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Audit and accounts.―(1) The accounts of a society shall be maintained in the prescribed",
      "content": "manner, shall be audited every year by an auditor or auditors appointed at each Annual General\nMeeting out of a list of auditors prepared by the Registrar and shall be laid before the Annual General\nMeeting for adoption.\n(2) An auditor appointed under sub-section (1) shall have power—\n(a)     to summon at the time of audit any officer, agent, servant and member, past or\npresent, of the society whom he has reason to believe can give material\ninformation in regard to any transaction of the society or the management of\nits affairs ; and\n(b)     to require the production of a book or document relating to the affairs of, or\nany cash or security belonging to, the society, by the officer, agent, servant or\nmember believed by the auditor to be in possession of such book, document,\ncash or security.\n(3) An auditor appointed under sub-section (1) shall hold office until the next Annual General\nMeeting and shall paid such fees as may be determined by the Annual General Meeting."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Transfer of interest on death of a member.―On the death of a member, the rights,",
      "content": "interests and liabilities of the member shall devolve on the legal heirs or successors of the member\nand such legal heirs or successors shall become the members of the society in place of the deceased\nmember."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Assets of the Society.―(1) A society shall have its own assets consisting of its properties",
      "content": "built or acquired out of the Development Fund and such funds and properties as may be prescribed.\n(2) A society may purchase any land or other property for the purposes of setting up its\noffice or any agro-based industry or for such other projects of public utility.\n(3) Subject to such limits as may be prescribed, a society may, in so far as may be necessary\nfor the purposes of the society, borrow money on the security of its property or of land forming part\nof the co-operative farm.\n(4) Where a society borrows money on the security of its property and also of the land forming\npart of the co-operative farm, the society shall, as far as practicable, repay the loan obtained by it on\nthe security of such land in priority to the other loans."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Provisions for Reserve Fund, Development Fund and other expenses.―(1) Every",
      "content": "society shall maintain a Reserve Fund and a Development Fund.\n(2) The Reserve Fund shall be utilized to meet natural calamities affecting the co-\noperative farm or other property of the society and for such other purposes, and in such manner, as\nthe committee may determine.\n(3) The Development Fund shall be utilized for the development of the co-operative farm and\nestablishment of agro-based industries, hospitals and schools and for such other purposes as may be\ndetermined by the society.\n(4) Every society may recover from the produce income of the co-operative farm sufficient\namount to meet its office expenditure, for the contribution it has to make to the District Co-operative\nFederation and for the payment of fees to the auditors and of such travelling allowance and daily\nallowance to its representatives for attending meetings of the District Co-operative Federation as it\nmay from time to time determine."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Distribution of produce income of co",
      "content": "operative farm.―Out of the produce income of\nthe co-operative farm the direct expenses on account of agricultural inputs, including seeds,\nfertilizers, pesticides, water charges, land revenue, maintenance of tractors, tubewells farm animals\nand agricultural implements, consumption of electricity, depreciation on fixed assets and the\nexpenses referred to in sub-section (4) of section 23, shall first be deducted and the balance shall be\ndistributed as follows, namely :―\n(a)     not less than five per cent each for the Reserve Fund and Development Fund\nshall be set apart ; and\n(b)    of the remaining amount, forty per cent shall be distributed amongst the\nmembers in proportion to the value of the land pooled by them and sixty per\ncent amongst the workers, including working members, and other staff\nworking on the farm according to the quality and quantity of the work done, as\ndetermined by the committee."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Distribution of profits.―The net profits of a society from sources other than the co",
      "content": "operative farm shall be distributed as follows, that is to say,—\n(a)    one-third shall be set apart for credit to the Development Fund and repayment\nof loans, in such proportion as may be determined by the society ; and\n(b)    the remaining two-thirds shall be distributed amongst the members in\nproportion to the value of the land pooled by them."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Rights of tenants, etc.―(1)The tenants of the land pooled by a member for a co",
      "content": "operative farm shall stand ejected from such land upon its being so pooled.\n(2) The tenants ejected from any land by virtue of sub-section (1) shall be given preference\nin providing employment on the co-operative farm or in the agro-based industries of the society and,\nif a member withdraws from the society or the society is wound up, the tenancy rights of such tenants\nshall stand restored."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Winding up.―(1) If one third of the total number of members of a society apply to the",
      "content": "Chairman of the District Co-operative Federation for winding up the society and the Chairman,\nafter such enquiry as he may deem fit, is of the opinion that the society ought to be wound up, he\nmay issue an order directing it to be wound up, and when necessary may appoint a liquidator\nfor the purpose from amongst the members of the District Co-operative Federation and fix his\nremuneration.\n(2) A copy of an order passed under sub-section (1) shall be sent to the Registrar."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Winding up if membership is reduced.―(1) Where the membership of a society is",
      "content": "reduced to less than twenty members or the area of the co-operative farm is reduced to less than the\nminimum area specified in clause (b) of sub-section (1) of section 4, the Chairman of the District Co-\noperative Federation may, after allowing the society a period of sixty days to make up the deficiency\nby order in writing direct that the society be wound up, and when necessary, may appoint a liquidator\nfor the purpose from amongst the members of the District Co-operative Federation and fix his\nremuneration.\n(2) A copy of an order passed under sub-section (1) shall be sent to the Registrar."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Effect of winding up.―When a society is wound up―",
      "content": "(a)    the standing crop of the co-operative farm shall be harvested and the produce\nincome distributed in accordance with the provisions of this Act ;\n(b)    the land comprising the co-operative farm shall revert to the members together\nwith improvements, if any, made by the society and subject to the\nencumbrances, if any, created thereon by the society and subject to payment\nby each member of the cost of such improvements on his land as at the time\nof the winding up ;\n(c)     after all the liabilities of the society have been met, the assets of the society,\nincluding the Reserve Fund, shall, subject to clause (d), be divided amongst the\nmembers in proportion to the value of the land pooled by them ; and\n(d)    the hospitals, schools and other social institutions, if any, established by the\nsociety shall stand transferred to, and vest in, the District Co-operative\nFederation and shall be managed by it in accordance with schemes prepared\nby it and approved by the Provincial Co-operative Federation."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Power of Chairman of District Co",
      "content": "operative Federation to assess damage.―Where, in\nthe course of the winding up of a society, it appears that any person who has taken part in the\norganisation or management of the society or any past or present member or office-bearer of a\ncommittee or officer of the society has misapplied or retained or become liable or accountable for\nany money or property of the society or has been guilty of breach of trust in relation to the society,\nthe Chairman of the District Co-operative Federation may, of his own motion or on the application\nof a liquidator or any other interested person, hold an inquiry into the conduct of such person, member\nor officer and make an order requiring him to repay or restore the money or property or any part\nthereof respectively with interest at such rate as the Chairman thinks just, or to contribute such sum\nto the assets of the society by way of compensation in regard to the misapplication, retainer or breach\nof trust as the Chairman thinks just."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Bar of suit.―Save as is otherwise provided in the Act, no civil court shall have jurisdiction",
      "content": "in respect of any matter arising out of any proceedings under this Act or connected with the\nwinding up of a society nor shall any suit or other legal proceedings lie or be proceeded with against\nthe society, except by the leave of the Chairman of the Provincial Co-operative Council and subject\nto such terms as he may impose."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Arbitration.―(1) If any dispute with regard to the business of a society other than a",
      "content": "dispute regarding disciplinary action taken by the society or its committee against a paid servant of\nthe society, arises—\n(a)     between the members or past members of a society, or persons claiming\nthrough a member or past member ; or\n(b)     between the members or past members or persons so claiming and any past or\npresent office-bearer ; or\n(c)      between the society or its committee and any past or present member of the\nsociety ; or\n(d)      between the society or its committee and any past or present office-bearer of\nthe society ;\nit shall be reported to the Chairman of the District Co-operative Federation, who shall refer it\nfor decision to not more than three arbitrators appointed by him from amongst the members of the\nDistrict Co-operative Federation.\n(2) Any party aggrieved by the award of the arbitrators under sub-section (1) may, within one\nmonth of the date of the communication of the order, prefer an appeal to the District Judge.\n(3) The award of arbitrators, or an award passed in appeal by the District Judge under sub-\nsection (2), shall, subject to the provisions of section 54, be final and shall not be liable to be called\nin question in any court."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Attachment before award.―Where a dispute has been referred to arbitration under",
      "content": "section 32 and the arbitrators are satisfied on inquiry or otherwise that a party to such arbitration\nis, with intent to delay or obstruct the execution of any award that may be made, about to dispose\noff the whole or any part of his property, the arbitrators may direct the conditional attachment of the\nsaid property and such attachment shall have the same effect as if made by a competent civil court."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Recoveries of dues.―Every award made under section 32, every order passed in appeal",
      "content": "under that section, and every order passed under section 5 shall be deemed to be a decree of a civil\ncourt and shall be executed in the same manner as a decree of such court."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. District Co",
      "content": "operative Federation.―(1) In each district in which not less than two\nsocieties are in existence, there shall be formed a District Co-operative Federation of Co-operative\nFarming Societies which shall consist of one representative from each society in the district.\n(2) Each District Co-operative Federation shall elect at its general meeting its office-\nbearers, including the Chairman, two representatives for the District Co-operative Council and one\nrepresentative for the Provincial Co-operative Federation, provided that till such time as the requisite\nnumber of representatives mentioned in sub-section (1) are available, two or more representatives\nshall carry out the responsibilities of all the required office-bearers.\n(3) The office-bearers, including the Chairman, and representatives shall hold office for a\nterm of two years.\n(4) A representative for a District Co-operative Council or a Provincial Co-operative\nFederation may, by writing under his hand addressed to the Chairman of the District Co-\noperative Council or, as the case may be, the Provincial Co-operative Federation, resign his office.\n(5) The District Co-operative Federation may make bye-laws relating to its meeting and\nprocedure and the performance of its functions."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Fund and functions of District Co",
      "content": "operative Federation.―(1) A District Co-\noperative Federation shall have a fund to which shall be credited the contributions received by\nit from the societies and out of which shall be defrayed the contributions it shall make to the\nProvincial Co-operative Federation and the office and other expenses of the District Co-operative\nFederation.\n(2) A District Co-operative Federation shall deal with matters of mutual interest to the\nsocieties in the district and make recommendations to the District Co-operative Council on matters\nwith which the Provincial Government is concerned."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Provincial Co",
      "content": "operative Federation.―(1) There shall be formed in each Province a\nProvincial Federation of Co-operative Farming Societies which shall consist of one representative\nfrom each of the District Co-operative Federations within the Province.\n(2) Each Provincial Co-operative Federation shall elect in its general meeting its office-\nbearers, including the Chairman, five representatives for the Provincial Co-operative Council and one\nrepresentative for the National Co-operative Council.\n(3) A representative shall hold office for a term of one year.\n(4) A representative for a Provincial Co-operative Council or the National Co-\noperative Council, may, by writing under his hand addressed to the Chairman of the Provincial Co-\noperative Council or, as the case may be, the National Co-operative Council, resign his office.\n(5) The Provincial Co-operative Federation may make bye-laws relating to its meeting and\nprocedure and the performance of its functions."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Fund and functions of the Provincial Co",
      "content": "operative Federation.―(1) A Provincial Co-\noperative Federation shall have a fund to which shall be credited the contributions received by it from\nthe District Co-operative Federations and out of which shall be defrayed its office and other expenses.\n(2) The functions of the Provincial Co-operative Federation shall be to deal with matters\nof mutual interest to the societies in the Province and make recommendations to the Co-operative\nCouncil on matters with which the Provincial Government is concerned."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. District Co",
      "content": "operative Council.―(1) There shall be formed in each district a District Co-\noperative Council which shall consist of the heads of the nation-building departments in the district\nand two representatives of the District Co-operative Federation. Provided that, pending the\navailability of the representatives of the District Co-operative Federation, the District Co-operative\nCouncil may consist of only the heads of the said departments.\n(2) The elected Chairman of the District Council established under the Provincial Law relating\nto local government shall be the ex-officio Chairman of the District Co-operative Council.\n(3) Pending the election of the Chairman of the District Co-operative Council referred to in\nsub-section (2) the Chairman shall be appointed by the Provincial Government from amongst the\nmembers of the council.\n(4) The District Co-operative Council may make bye-laws relating to its meetings and\nprocedure and the performance of its functions."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Functions of the District Co",
      "content": "operative Council.―(l) A District Co-operative Council\nshall, of its own motion or on the recommendation of the District Co-operative Federation, co-\nordinate the services of the different nation-building departments and the District Co-operative\nFederation and extend all possible assistance to the societies within the district.\n(2) A District Co-operative Council shall review the decisions taken by it from time to time,\nthe progress of co-operative farming movement within the district and suggest measures for its\nimprovement and future development.\n(3) The Provincial Government shall make available to a District Co-operative Council such\nfunds as the Provincial Government may consider adequate for enabling the Council to perform its\nfunctions."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Provincial Co",
      "content": "operative Council.―(1) There shall be formed in each Province a\nProvincial Co-operative Council which shall consist of all the Secretaries to the Provincial\nGovernment in the nation-building departments and five representatives of the Provincial Co-\noperative Federation.\n(2) The Provincial Minister dealing with the matters relating to co-operation shall be the\nex-officio Chairman of the Provincial Co-operative Council and the Secretary of the department\ndealing with such matters shall be the ex-officio Secretary of the Council.\n(3) The Provincial Co-operative Council may make bye-laws relating to its meetings and\nprocedure and the performance of its functions."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Functions of the Provincial Co",
      "content": "operative Council.―(1) The Provincial Co-operative\nCouncil shall co-ordinate the activities of all the District Co-operative Councils within the Province,\nensure uniformity of policy throughout the Province and perform at the Provincial level the functions\nassigned by section 40 to the District Co-operative Council at the district level.\n(2) The Provincial Government will make available to the Provincial Co-operative Council\nsuch funds as the Provincial Government may consider adequate for enabling the Council to perform\nits functions."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. National Co",
      "content": "operative Council.―(1) As soon as may be after the commencement of this\nAct the Federal Government shall constitute the National Co-operative Council which shall consist of\nthe following members, namely:—\n(a)    the Federal Minister-in-charge of the Ministry dealing with matters relating to\nco-operatives, who shall be the Chairman of the Council ;\n(b)    the Provincial Ministers dealing with matters relating to Co-operation in each\nProvince ;\n(c)    one representative of each of the Provincial Co-operative Federation ; and\n(d)    such other members as the Federal Government may appoint :\nProvided that, for the first constitution of the National Co-operative Council, the members\nreferred to in clause (c) shall be nominated by the Chairman of the Council.\n(2) The National Council may make bye-laws relating to its meetings and procedure and the\nperformance of its functions."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Functions of the National Co",
      "content": "operative Council.―(1) The National Co-operative\nCouncil shall co-ordinate the activities of the Provincial Co-operative Councils and ensure uniformity\nof policy in all the Provinces by laying down policy guidelines for the working of the Provincial Co-\noperative Councils and the District Co-operative Councils.\n(2) The National Co-operative Council shall review its decisions taken from time to time and\nthe progress of the co-operative movement in all the Provinces and suggest measures for its\nover-all future development.\n(3) The National Co-operative Council shall also maintain liaison between the Federal and\nProvincial nation-building departments and arrange for the holding of national and international\nseminars on various aspects of co-operative farming.\n(4) The Federal Government shall make available to the National Co-operative Council\nsuch funds as the Federal Government may consider adequate for enabling the Council to\nperform its functions."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Inquiry by Chairman District Co",
      "content": "operative Federation.―(1) The Chairman of the\nDistrict Co-operative Federation may, of his own motion, by himself or by a person duly authorised\nby him in writing in this behalf hold an inquiry into the constitution, working and financial condition\nof a society.\n(2) The Chairman of the District Co-operative Federation shall hold such an inquiry as is\ncontemplated in sub-section (1) of this section—\n(a)    on the application of a majority of the committee of the society, or\n(b)    on the application of one-third of the members of the society.\n(3) All officers and members of the society whose affairs are investigated shall furnish\nsuch information in their possession in regard to the affairs of the society as the person holding\nthe inquiry may require.\n(4) The result of any inquiry under this section shall be communicated to the society whose\naffairs have been investigated."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Inspection of books of indebted society.―(1) The Chairman of the District Co",
      "content": "operative Federation may, on the application of a creditor of a society, inspect or direct some person\nauthorized by him by order in writing in this behalf to inspect the books of the society :\nProvided that the applicant―\n(a)    satisfies the Chairman that the debt is a sum then due, and that he has\ndemanded payment thereof and has not received satisfaction within a\nreasonable time ; and\n(b)    deposits with the Chairman such sum as security for the costs of the proposed\ninspection as the Chairman may require.\n(2) The Chairman shall communicate the result of any such inspection to the creditor."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Power of Chairman, District Co",
      "content": "operative Federation to exercise powers under\nsection 30 in the course of an inquiry or inspection.―Where, in the course of any inquiry under\nsection 45 or an inspection under section 46, it appears to the Chairman of the District Co-operative\nFederation that there exists any such ground as is specified in section 30, he may of his own motion\nor on the application of the person authorized by him under section 45 or section 46, exercise the\npowers specified in section 30."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Costs of inquiry.―Where an inquiry is held under section 45 or an inspection is made",
      "content": "under section 46, the Chairman of the District Co-operative Federation may apportion the costs, or\nsuch part of the costs, as he may consider proper between the society, the members of creditor\ndemanding the inquiry or inspection, the officers or former officers, and the members or past members\nof the society :\nProvided that—\n(a)      no order of apportionment of the costs shall be made under this section unless\nthe society or person liable to pay the costs thereunder has or have been heard\nor has or have had a reasonable opportunity of being heard ; and\n(b)     the Chairman shall record the grounds on which the costs were apportioned."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Recovery of costs.―Any sum awarded by way of costs under section 48 may be",
      "content": "recovered, on application by the Chairman of the District Co-operative Federation to a\nMagistrate having jurisdiction in the place where the person from whom the money is claimable\nactually and voluntarily resides, or carries on business, by the distress and sale of any movable\nproperty within the limits of the jurisdiction of such Magistrate belonging to such person, and\nsuch Magistrate shall proceed to recover the same in the same manner as if it were a fine imposed\nby himself."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Amalgamation or transfer of societies.―(1) Any two or more societies may, with the",
      "content": "approval of the District Co-operative Federation, by resolution passed by a three-fourths\nmajority of the members present at a special general meeting of each such society held for the\npurpose, amalgamate as a single society :\nProvided that each member has had fifteen clear days’ notice of the resolution and the date of\nthe meeting.\n(2) An amalgamation referred to in sub-section (1) may be effected without a dissolution, or\na division of the funds, of the amalgamating societies and the resolution of the societies concerned\nshall on such amalgamation, be a sufficient conveyance to vest the assets and liabilities of the\namalgamating societies in the amalgamated society.\n(3) Any society may, by a resolution passed in accordance with the procedure laid down in\nsub-section (1) transfer its assets and liabilities to any other society which is prepared to accept them\n:\nProvided that, when any such amalgamation or transfer of assets and liabilities involves\nthe transfer of its liabilities by any society to any other society, it shall not be made without giving\nthree months’ notice to the creditors of both or such societies :\nProvided further that if a creditor of any of the societies concerned objects to such\namalgamation or transfer of assets and liabilities and gives written notice to that effect to the society\nor societies concerned one month before the date fixed for the amalgamation or transfer, the\namalgamation or transfer shall not be made until the dues of such creditor have been satisfied."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Powers to exempt from stamp duty or registration fee, etc.―The Provincial",
      "content": "Government may, by notification in the official Gazette, reduce or remit―\n(a)     the stamp-duty with which, under any law for the time being in force, any\ninstruments executed by or on behalf of a society or by an officer or member\nand relating to the business of the society, or security bonds executed by or\non behalf of officers or servants of a society, or awards of the arbitrators\nunder this Act, are chargeable ; and\n(b)        any fee payable under the law relating to the registration of documents or to\ncourt-fees for the time being in force."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Exemption from Income",
      "content": "tax.―The earnings of a society and the dividend paid by it to\nits members shall be exempt from income-tax."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Notice necessary in suits.―No suit shall be instituted against a society or any of the",
      "content": "office-bearers in respect of any act relating to the buiness of the society until the expiration\nof three months next, after notice in writing has been given to the Chairman of the District Co-\noperative Federation."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Power of revision.―The Chairman of the Provincial Co",
      "content": "operative Council may, of his\nown motion or otherwise call for the record of any case or proceedings under this Act for the purpose\nof satisfying himself as to the correctness, legality or propriety of any decision or order passed by\nany authority, and may pass such order in relation thereto as he may think fit :\nProvided that no order shall be passed under this section revising or modifying an order\naffecting any person unless such person has been afforded an opportunity of being heard."
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Transitional provisions.―(1) Till such time as the District Co",
      "content": "operative Federation\nis formed in a District and its Chairman has been elected,―\n(a)       the powers and functions of the District Co-operative Federation under this\nAct and the rules shall be exercised and performed by the District\nCo-operative Council ; and\n(b)       the powers and functions of the Chairman under this Act and the rules shall be\nexercised and performed by the Chairman of the District Co-operative Council.\n(2) Till such time as the Provincial Co-operative Federation is formed in a Province, its\npowers and functions under this Act and the rules shall be exercised and performed by the Provincial\nCo-operative Council."
    },
    {
      "provision_ref": "sec57",
      "section": "57",
      "title": "Section 57. Repeal.―The Co",
      "content": "operative Farming Ordinance, 1976 (XXII of 1976), is hereby\nrepealed.\n______________\nRGN Date: 18-09-2024\n1\nThis section has been omitted to the extent of Islamabad Capital Territory by the Federal Laws (Revision and Declaration) Ordinance, 1981\n(Ordinance No. XXVII of 1981), s. 5 and 4th Schedule."
    }
  ],
  "definitions": []
}
