{
  "id": "pk-copyright-ordinance-1962",
  "type": "statute",
  "title": "Copyright Ordinance, 1962",
  "title_en": "Copyright Ordinance, 1962",
  "short_name": "Copyright Ordinance, 1962",
  "status": "in_force",
  "issued_date": "1962-06-01",
  "in_force_date": "1962-06-01",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pibA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Copyright Ordinance, 1962 (XXXIV of 1962) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Meaning of Copyright",
      "content": "(1) For the purposes of this Ordinance, “copyright” means the\nexclusive right, by virtue of, and subject to the provisions of, this Ordinance,__\n(a)         in the case of a literary, dramatic or musical work, to do and authorize the doing\nof any of the following acts, namely:__\n1\nIns. by Ordinance No. LIII of 2000, s. 2.\n(i)           to reproduce the work in any material form;\n(ii)          to publish the work;\n(iii)         to perform the work in public;\n(iv)          to produce, reproduce, perform or publish any translation of the work;\n(v)           to use the mark in a cinematographic work or make a record in respect\nof the work;\n1\n[(vi) to broadcast the work, or to communicate the broadcast of the work to\nthe public by a loudspeaker or any other similar instrument;]\n(vii)         to make any adaptation of the work;\n(viii) to do in relation to a translation or an adaptation of the work any of the\nacts specified in relation to the work in sub-clauses (i) to (vi);\n2\n[(ix) to authorize the rental of computer programmes;]\n(b)        in the case of an artistic work, to do or authorize the doing of any of the\nfollowing acts, namely:__\n(i)           to reproduce the work in any material form;\n(ii)          to publish the work;\n(iii)         to use the work in a cinematographic work;\n(iv)          to show the work in television;\n(v)           to make any adaptation of the work;\n(vi)          to do in relation to an adaptation of the work any of the acts specified in\nrelation to the work in sub-clauses (i) to (iv);\n(c)        in the case of a cinematographic work, to do or authorize the doing of any of the\nfollowing acts, namely:__\n(i)           to make a copy of the work;\n(ii)          to cause the work in so far as it consists of visual images, to be seen in\npublic and, in so far as it consists of sounds, to be heard in public;\n(iii)         to make any record embodying the recording in any part of the sound\ntrack associated with the work by utilising such sound track;\n1\nSubs. by Act No. XX of 1992, s. 3.\n2\nAdded by Ordinance No. LIII of 2000, s. 3.\n1\n[(iv) to broadcast the work;]\n2\n[(v)   to authorize the rental of cinematographic works;]\n(d)         in the case of a record, to do or authorize the doing of any of the following acts\nby utilizing the record, namely:__\n(i)        to make any other record embodying the same recording;\n(ii)       to use the record in the sound track of a cinematographic work;\n(iii)      to cause the recording embodied in the record to be heard in public;\n(iv)       to communicate the recording embodied in the record by 1[broadcast].\n(2) Any reference in sub-section(1) to the doing of any act in relation to a work or a translation\nor an adaptation thereof shall include a reference to the doing of that act in relation to a part thereof.\n2\n[(3) Entitlement to copyright in compilation of data or other material shall not extent to data\nor other material itself and shall be without prejudice to any copyright subsisting in the data or other\nmaterial, that is to say, the copyright shall subsist to the extent of compilation only.]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Meaning of publication",
      "content": "(1) For the purposes of this Ordinance, “publication” means,__\n(a)         in the case of a literary, dramatic, musical or artistic work, the issue of copies\nof the work to the public in sufficient quantities;\n(b)         in the case of a cinematographic work, the sale or hire or offer for sale or hire\nof the work or copies thereof to the public;\n(c)         in the case of a record, the issue of records to the public in sufficient quantities;\nbut does not, except as otherwise expressly provided in this Ordinance, include:__\n(i)        in the case of a literary, dramatic or musical work, the issue of any\nrecords recording such work;\n(ii)       in the case of a work of sculpture or an architectural work of art, the\nissue of photographs and engravings of such work.\n(2) If any question arises under sub-section (1) whether copies of any literary, dramatic, musical\nor artistic work, or records issued to the public are sufficient in quantities, it shall be referred to the\nBoard whose decision thereon shall be final."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. When work not deemed to be published or performed in public",
      "content": "Except for the\npurposes of infringement of copyright, a work shall not be deemed to be published or performed in\npublic, and a lecture shall not be deemed to be delivered in public, if published, performed in public\nor delivered in public, without the licence or consent of the owner of the copyright.\n1\nSubs. by Act No. XX of 1992, s. 3.\n2\nIns. by Ordinance No. LIII of 2000, s. 3."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. When work deemed to be first published in Pakistan",
      "content": "(1) For the purposes of this\nOrdinance, a work published in Pakistan, shall be deemed to be first published in Pakistan,\nnotwithstanding that it has been published simultaneously in some other country, unless such other\ncountry provides a shorter term of copyright for such work; and a work shall be deemed to be published\nsimultaneously in Pakistan and in another country if the time between the publication in Pakistan and\nthe publication in such other country does not exceed thirty days.\n(2) If any question arises under sub-section (1) whether the term of copyright for any work is\nshorter in any other country than that provided in respect of that work under this Ordinance, it shall be\nreferred to the Board whose decision thereon shall be final."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Nationality of author where the making of unpublished work is extended over",
      "content": "considerable period.__ Where, in the case of an unpublished work, the making of the work is extended\nover a considerable period, the author of the work shall, for the purposes of this Ordinance, be deemed\nto be a citizen of, or domiciled in, the country of which he was a citizen or wherein he was domiciled\nduring the major part of that period."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Domicile of corporation",
      "content": "For the purposes of this Ordinance, a body corporate shall be\ndeemed to be domiciled in Pakistan if it is incorporated under any law in force in Pakistan or if it has\nan established place of business in Pakistan.\n_______\nCOPYRIGHT, OWNERSHIP OF COPYRIGHT AND THE RIGHTS OF THE OWNER."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. No copyright except as provided in this Ordinance",
      "content": "No person shall be entitled to\ncopyright or any similar right in any work, whether published or unpublished, otherwise than under\nand in accordance with the provisions of this Ordinance, or of any other law for the time being in force,\nbut nothing in this section shall be construed as abrogating any right or jurisdiction to restrain a breach\nof trust or confidence."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Works in which copyright subsists",
      "content": "(1) Subject to the provisions of this section and to\nclasses of works, that is to say,__\n(a)     original literary, dramatic, musical and artistic works;\n(b)     cinematographic works; and\n(c)     records.\n(2) Copyright shall not subsist in any work specified in sub-section (1), other than a work to\nwhich the provisions of section 53 or section 54 apply, unless,__\n(i)     in the case of a published work, the work is first published in Pakistan, or where\nthe work is first published outside Pakistan, the author is at the date of such\npublication, or in a case where the author was dead at that date, was at the time\nof his death, a citizen of Pakistan or domiciled in Pakistan;\n(ii)       in the case of an unpublished work other than an architectural work of art, the\nauthor is at the date of the making of the work a citizen of Pakistan or domiciled\nin Pakistan; and\n(iii)      in the case of an architectural work of art, the work is located in Pakistan.\n1\n[(2A) *           *          *   *       *       *       *]\n(3) Copyright shall not subsist,__\n(a)        in any cinematographic work, if a substantial part of the work is an infringement\nof the copyright in any other work;\n(b)        in any record made in respect of a literary, dramatic or musical work, if, in\nmaking the record, copyright in such work has been infringed.\n(4) The copyright or the lack of copyright in a cinematographic work or a record shall not affect\nthe separate copyright in any work in respect of which or a substantial part of which, the work, or, as\nthe case may be, the record is made.\n(5) In the case of an architectural work of art, copyright shall subsist only in the artistic\ncharacter and design and shall not extend to the processes or methods of construction."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Work of joint authors",
      "content": "Where, in the case of a work of joint authorship, some one or\nmore of the joint authors do not satisfy the conditions conferring copyright laid down by this\nOrdinance, the work shall be treated for the purposes of this Ordinance as if the other author or authors\nhad been the sole author or authors thereof:\nProvided that the term of the copyright shall be the same as it would have been if all the authors\nhad satisfied such conditions."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Provision as to designs registerable under Act II of 1911",
      "content": "(1) Copyright shall not\nsubsist under this Ordinance in any design which is registered under the Patents and Designs Act, 1911\n(II of 1911).\n(2) Copyright in any design which is capable of being registered under the Patents and Designs\nAct, 1911 (II of 1911), but which has not been so registered, shall cease as soon as any article to which\nthe design has been applied has been reproduced more than fifty times by an industrial process by the\nowner of the copyright or, with his licence, by any other person."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. First owner of copyright",
      "content": "Subject to the provisions of this Ordinance, the author of a\nwork shall be the first owner of the copyright therein:\nProvided that,__\n1\nOmitted by Ordinance No. LIII of 2000, s. 4.\n(a)     in the case of a literary, dramatic or artistic work made by the author in the\ncourse of his employment by the proprietor of a newspaper, magazine or similar\nperiodical under a contract of service or apprenticeship, for the purpose of\npublication in a newspaper, magazine or similar periodical, the said proprietor\nshall, in the absence of any agreement to the contrary, be the first owner of the\ncopyright in the work in so far as the copyright relates to the publication of the\nwork in any newspaper, magazine or similar periodical, or to the reproduction\nof the work for the purpose of its being so published, but in all other respects\nthe author shall be the first owner of the copyright in the work;\n(b)     subject to the provisions of clause (a), in the case of a photograph taken, or a\npainting or portrait drawn, or an engraving or a cinematographic work made,\nfor valuable consideration at the instance of any person, such person shall, in\nthe absence of any agreement to the contrary, be the first owner of the copyright\ntherein;\n(c)     in the case of a work made in the course of the author's employment under a\ncontract of service or apprenticeship, to which clause (a) or clause (b) does not\napply, the employer shall, in the absence of any agreement to the contrary, be\nthe first owner of the copyright therein;\n(d)     in the case of a Government work, Government shall, in the absence of any\nagreement to the contrary, be the first owner of the copyright therein;\n(e)     in the case of a work to which the provisions of section 53 apply, the\ninternational organization concerned shall be the first owner of the copyright\ntherein."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Assignment of copyright",
      "content": "(1) The owner of the copyright in an existing work or the\nprospective owner of the copyright in a future work may assign to any person the copyright either\nwholly or partially and either generally or subject to limitations and either for the whole term of the\ncopyright or any part thereof:\nProvided that, in the case of the assignment of copyright in any future work, the assignment\nshall take effect only when the work comes into existence:\nProvided further that, where the owner of the copyright in a work is the author of the work, no\nassignment of the copyright in the work or of any interest in such copyright shall be made, or if made\nshall be effective (except where the assignment is made in favour of Government or an educational,\ncharitable, religious or non-profit institution) for a period of more than ten years beginning from the\ncalendar year next following the year in which the assignment is made ; if an assignment of the\ncopyright in a work is made in contravention of this proviso, the copyright in the work shall, on the\nexpiry of the period specified in this proviso, revert to the author (who may re-assign the copyright in\nthe work subject to the provisions herein contained), or if the author be dead to his representatives in\ninterest 1[:]\n1\n[Provided further that the copyright in an unpublished work assigned by its author to any\nperson or organization for the specific purpose of its publication shall revert to the author if such work\nis not published within a period of three years from the date of its assignment.]\n(2) Where the assignee of a copyright becomes entitled to any right comprised in the copyright,\nthe assignee as respects the rights so assigned, and the assignor as respects the rights not assigned,\nshall be treated for the purposes of this Ordinance as the owner of copyright and the provisions of this\nOrdinance shall have effect accordingly.\n1\n[(2A) If the owner of a copyright, or the publisher to whom such right has been assigned,\nconsiders any of the terms of the assignment to be likely to affect his interests adversely, he may within\none year of such assignment apply to the Board to consider such term and the Board may, after hearing\nboth the parties, pass such order as it may deem fit; and the order of the Board shall be binding on both\nthe parties.]\n(3) In this section, the expression “assignee” as respects the assignment of the copyright in any\nfuture work includes the legal representatives of the assignee, if the assignee dies before the work\ncomes into existence."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Mode of assignment",
      "content": "No assignment of the copyright in any work shall be valid unless\nit is in writing signed by the assignor or by his duly authorized agent."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Transmission of copyright in manuscript by testamentary disposition",
      "content": "Where under\na bequest a person is entitled to the manuscript of a literary, dramatic or musical work, or to an artistic\nwork, and the work was not published before the death of the testator, the bequest shall, unless the\ncontrary intention is indicated in the testator’s will or any codicil thereto, be construed as including the\ncopyright in the work in so far as the testator was the owner of the copyright immediately before his\ndeath."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Right of owner to relinquish copyright",
      "content": "(1) The owner of the copyright in a work may\nrelinquish all or any of the rights comprised in the copyright by giving notice in the prescribed form\nto the Registrar and thereupon such rights shall, subject to the provisions of sub-section (3), cease to\nexist from the date of the notice.\n(2) On receipt of a notice under sub-section (1), the Registrar shall cause it to be published in\nthe official Gazette and in such other manner as he may deem fit.\n(3) The relinquishment of all or any of the rights comprised in the copyright in a work shall not\naffect any rights subsisting in favour of any person on the date of the notice referred to in sub-section\n(1).\n___________\n1\nSubs., added and Ins. by Act No. XX of 1992, s. 4."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Term of copyright in published literary, dramatic, musical and artistic works",
      "content": "Except as otherwise hereinafter provided, copyright shall subsist in any literary, dramatic, musical or\nartistic work (other than a photograph) published within the life time of the author until fifty years\nfrom the beginning of the calendar year next following the year in which the author dies.\nExplanation.__ In this section, the reference to the author shall, in the case of a work of joint\nauthorship, be construed as a reference to the author who dies last."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Term of copyright in posthumous work",
      "content": "(1) In the case of a literary, dramatic or musical\nwork or an engraving, in which copyright subsists at the date of the death of the author or, in the case\nof any such work of joint authorship, at or immediately before the date of the death of the author who\ndies last, but which or any adaptation of which, had not been published before that date, copyright\nshall subsist until fifty years from the beginning of the calendar year next following the year in which\nthe work is first published or, where an adaptation of the work is published in any earlier year, from\nthe beginning of the calendar year next following that year.\n(2) For the purposes of this section, a literary, dramatic or musical work or an adaptation of\nany such work shall be deemed to have been published, if it has been performed in public or if any\nrecords made in respect of the work have been sold, or offered for sale, to the public."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Term of copyright in cinematographic works, records and photographs",
      "content": "(1) In the\ncase of a cinematographic work, copyright shall subsist until fifty years from the beginning of the\ncalendar year next following the year in which the work is published.\n(2) In the case of a record, copyright shall subsist until fifty years from the beginning of the\ncalendar year next following the year in which the record is published.\n(3) In the case of a photograph, copyright shall subsist until fifty years from the beginning of\nthe calendar year next following the year in which the photograph is published."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Term of copyright in anonymous and pseudonymous work",
      "content": "(1) In the case of a literary,\ndramatic, musical or artistic work (other than a Photograph), which is published anonymously or\npseudonymously, copyright shall subsist until fifty years from the beginning of the calendar year next\nfollowing the year in which the work is first published:\nProvided that where the identity of the author is disclosed before the expiry of the said period,\ncopyright shall subsist until fifty years from the beginning of the calendar year next following the year\nin which the author dies.\n(2) In sub-section (1), references to the author shall, in the case of an anonymous work of joint\nauthorship be construed,__\n(a)     where the identity of one of the authors is disclosed as references to that author;\n(b)          where the identity of more authors than one is disclosed, as references to the\nauthor who dies last from amongst such authors.\n(3) In sub-section (1), references to the author shall, in the case of a pseudonymous work of\njoint authorship, be construed,__\n(a)          where the names of one or more (but not all) of the authors are 1[pseudonym]\nand his or their identity is not disclosed, as references to the author whose name\nis not a pseudonym, or, if the names of two or more of the authors are not\npseudonyms, as references to such one of those authors who dies last;\n(b)          where the names of one or more (but not all) of the authors are pseudonyms and\nthe identity of one or more of them is disclosed, as references to the author who\ndies last from amongst the authors whose names are not pseudonyms and the\nauthors whose names are pseudonyms and are disclosed; and\n(c)          where the names of all the authors are pseudonyms and the identity of one of\nthem is disclosed, as references to the author whose identity is disclosed or, if\nthe identity of two or more of such authors is disclosed, as references to such\none of those authors who dies last.\nExplanation.__ For the purposes of this section, the identity of an author shall be deemed to\nhave been disclosed, if either the identity of the author is disclosed publicly by both the author and the\npublisher or is otherwise established to the satisfaction of the Board but that author."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Term of copyright in Government works and in works of international",
      "content": "organizations.__ (1) Copyright in a Government work shall, where Government is the first owner of\nthe copyright therein, subsist until fifty years from the beginning of the calendar year next following\nthe year in which the work is first published.\n(2) In the case of a work of an international organization to which the provisions of section 53\napply, copyright shall subsist until fifty years from the beginning of the calendar year next following\nthe year in which the work is first published."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Term of copyright in unpublished work",
      "content": "(1) If a work, whose author’s identity is\nknown, is not published posthumously within fifty years after the death of the author, such work shall\nfall into the public domain after fifty years from the beginning of the calendar year next following the\nyear in which the author dies.\n(2) If a work, whose author’s identity is not known, is not published within fifty years of its\ncreation, such work shall fall into the public domain after fifty years from the beginning of the calendar\nyear next following the year in which the work is created.\n__________\n_________________________________________________________________________________\n1\nSic. should read “Pseudonyms”.\n1[RIGHTS OF BROADCASTING ORGANIZATIONS, PERFORMERS AND PRODUCERS\nOF PHONOGRAMS (SOUND RECORDING)]"
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Rights of broadcasting organizations",
      "content": "(1) Broadcasting organizations shall enjoy the\nright to authorize__\n(a)         the rebroadcasting of their broadcasts;\n(b)         the fixation of their broadcasts; and\n(c)         the copying of fixations made of their broadcasts.\n(2) This right shall subsist until twenty-five years from the beginning of the calendar year next\nfollowing the year in which the broadcast took place.\n1\n[24A. Rights of performers and producers of Phonograms (sound recording).__ (1) The\nperformers shall have the right to do or to prevent fixation of their unfixed performance and\nreproduction of such fixation and broadcasting by wireless means and communication to the public of\ntheir live performance.\n(2) The producers of Phonograms shall have the right to do or to prohibit the direct or the\nindirect reproduction of their fixation and any rental thereof.\n(3) The rights specified in sub-sections (1) and (2) shall subsist for a period of fifty years\ncomputed from the end of the calendar year in which fixation was made or performance took place.]\n1\n[25. Application of other provisions of this Ordinance to broadcasting, performers and\nproducers of phonograms.__ Any person who, without authorization of the broadcasting organization,\nperformers and producers of phonograms (sound recording) does or causes the doing of any of the acts\nreferred to in section 24 and 24 A shall be deemed to infringe the rights of the broadcasting\norganization, performers and producers of phonograms (sound recording) and the provisions contained\nin Chapters XII to XVI shall, within the limits permitted by the nature of the matter, apply to\nbroadcasting organization, performers and producers of phonograms (sound recording) as if they were\nauthors and works, respectively.]\n[26. Definitions.__ (a) “broadcasting” means communication to the public of sound or images\n1\nor both by means of radio diffusion, including communication by telecast, or wire, or by both, or any\nother means of communication.\n(b) “fixation” means the incorporation of sounds or images or both in a device by means of\nwhich they can later be made aurally or visually perceivable.\n(c) “phonogram” means any exclusively aural fixation of sounds of a performance or of other\nsounds.\n1\nSubs. and ins. by Ordinance No. LIII of 2000, s. 5-8.\n(d) “producer of phonogram” means a person who, or the legal entity which, fixes the sounds\nof a performance or other sounds.\n(e) “rebroadcasting” means the simultaneous broadcasting by one broadcasting organization of\nthe broadcast of another broadcasting organization.]"
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Other rights not affected",
      "content": "For the removal of doubts, it is hereby declared that the rights\nconferred upon broadcasting organizations shall not affect the copyright in any literary, dramatic,\nmusical, artistic or cinematographic work, or in any record used in the broadcast.\n_______"
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Protection of typography and term of protection",
      "content": "The publisher of an edition of a work\nshall enjoy the right to authorize the making, by any photographic or similar process, of copies,\nintended for sale in commerce, of the typographical arrangement of the edition, and such right shall\nsubsist until twenty-five years from the beginning of the calendar year next following the year in which\nthe edition was first published."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Infringements, etc",
      "content": "Any person who, without the authorization of the publisher, makes\nor causes the making of, by any photographic or similar process, copies, intended for sale in commerce,\nof the typographical arrangement of the edition or any substantial part thereof, shall be deemed to\ninfringe the rights of the publisher, and the provisions contained in Chapters XII to XVI shall, within\nthe limits permitted by the nature of the matter, apply to the publisher and the typographical\narrangements of editions as if they were authors and works respectively.\nExplanation.__ “Typographical arrangement” shall include calligraphy."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Relations to copyright",
      "content": "For the removal of doubts, it is hereby declared that 1[,subject to\nthe provisions of sub-section (2A) of section 10,] the rights conferred upon publishers by this Chapter\nshall__\n(a)           subsist irrespective of the question whether the edition is that of a work\nprotected or unprotected by copyright;\n(b)           not affect the copyright, if any, in the literary, dramatic, musical or artistic work\nitself.\n_______"
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Performing rights society to file statements of fees, charges and royalties",
      "content": "(1) Every\nperforming right society shall, within the prescribed time and in the prescribed manner, prepare,\n1\nIns. by Act No. II of 1973, s. 3.\npublish and file with the Registrar, statements of all fees, charges or royalties which it proposes to\ncollect for the grant of licenses for the performance in public of works in respect of which it has\nauthority to grant such licences.\n(2) If any such society fails, in relation to any work, to prepare, publish or file with the Registrar\nthe statements referred to in sub-section (1) in accordance with the provisions of that sub-section, no\naction or other proceeding to enforce any remedy, civil or criminal, for infringement of the performing\nrights in that work shall be commenced except with the consent of the Registrar."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Objections relating to published statements",
      "content": "Any person having any objections to any\nfees, charges or royalties or other particulars included in any statement referred to in section 31 may\nat any time lodge such objections in writing at the Copyright Office."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Determination of objections",
      "content": "(1) Every objection lodged at the Copyright Office under\nsection 32 shall, as soon as may be, be referred to the Board, and the Board shall decide such objection\nin the manner hereinafter provided.\n(2) The Board shall, notwithstanding that no objection has been lodged, take notice of any\nmatter which, in its opinion, is one for objection.\n(3) The Board shall give notice in respect of every objection to the performing rights society\nconcerned and shall give to such society and the person who lodged the objection a reasonable\nopportunity of being heard.\n(4) The Board shall, after making the prescribed enquiry, make such alterations in the\nstatements as it may think fit, and shall transmit the statements thus altered or unchanged, as the case\nmay be, to the Registrar, who shall thereupon as soon as practicable after the receipt of such statements,\npublish them in the official Gazette and furnish the performing rights society concerned and the person\nwho lodged the objection with a copy thereof.\n(5) The statement of fees, charges or royalties as approved by the Board shall be the fees,\ncharges or royalties which the performing rights society concerned may respectively lawfully sue for\nor collect in respect of the issue or grant by it of licences for the performance in public of works to\nwhich such fees, charges or royalties relate.\n(6) No performing rights society shall have any right of action or any right to enforce any civil\nor other remedy for infringement of the performing rights in any work claimed by such society against\nany person who has tendered or paid to such society the fees, charges or royalties which have been\napproved by the Board as aforesaid."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Existing rights not affected",
      "content": "Nothing in this Chapter shall be deemed to affect__\n(a)     any rights or liabilities in relation to the performing rights in work accrued or\nincurred before the commencement of this Ordinance; and\n(b)     any legal proceedings in respect of such rights or liabilities pending at such\ncommencement.\n____________"
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Licences by owners of copyright",
      "content": "The owner of the copyright in any existing work or the\nprospective owner of the copyright in any future work may grant any interest in the copyright by licenceo\nin writing signed by him or by his duty authorized agent:\nProvided that in the case of a licence relating to copyright in any future work, the licence shall take\neffect only when the work comes into existence.\nExplanation.__ When a person to whom a licence relating to copyright in any future work is granted\nunder this section dies before the work comes into existence, his legal representatives shall, in the absence\nof any provision to the contrary in the licence, be entitled to the benefit of the licence."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Compulsory licence in works withheld from public",
      "content": "(1) If at any time during the term of\ncopyright in any Pakistani work which has been published or performed in public, an application is made\nto the Board that the owner of the copyright in the work__\n(a)        has refused to republish or allow the republication of the work or has refused to\nallow the performance in public of the work and by reason of such refusal the work\nis withheld from the public; or\n(b)        has refused to allow communication to the public by 1[broadcast] of such work or,\nin the case of a record, the work recorded in such record, on terms which the\napplicant considers reasonable; 1[or]\n1\n[(c)   is dead or is unknown or cannot be traced or found and republication of the work\nis necessary in the public interest;]\nthe Board, after giving to the owner of the copyright in the work a reasonable opportunity of being heard\nand after holding such inquiry as it may deem necessary, may, if it is satisfied that such refusal is not in the\npublic interest, or that the grounds for such refusal are not reasonable 1[, or that the owner of the copyright\nis dead or is unknown or cannot be traced or found and republication of the work is necessary in the public\ninterest,] direct the Registrar to grant to the applicant a licence to republish the work, perform the work in\npublic or communicate the work to the public by 1[broadcast], as the case may be, subject to payment to\nthe owner of the copyright of such compensation and subject to such other terms and conditions as the\nBoard may determine; and thereupon the Registrar shall grant the licence to the applicant in accordance\nwith the directions of the Board, on payment of such fee as may be prescribed.\n(2) Where two or more persons have made applications under sub-section (1), the licence shall be\ngranted to the applicant who, in the opinion of the Board, would best serve the interests of the general\npublic.\n2\n[(3) The Federal Government or the Board may, upon an application by any governmental or\nstatutory institution, in the public interest, grant a license to reprint, translate, adopt or publish any text\nbook on non-profit basis.]\n1\nSubs., added and Ins. by Act No. XX of 1992, s. 6.\n2\nAdded by Ordinance No. LIII of 2000, s. 9."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Licence to produce and publish translations",
      "content": "(1) Any citizen of Pakistan or a person\ndomiciled in Pakistan may apply to the Board for a licence to produce and publish a translation of a\nliterary or dramatic work in any Pakistani language or a language ordinarily used in Pakistan 1[, not\nbeing English, French or Spanish].\n(2) Every such application shall be made in such form as may be prescribed and shall state the\nproposed retail price of a copy of the translation of the work.\n(3) Every applicant for a licence under this section shall, along with his application, deposit\nwith the Registrar such fee as may be prescribed.\n(4) When an application is made to the Board under this section, it may, after holding such\ninquiry as may be prescribed, direct the Registrar to grant to the applicant a licence, not being an\nexclusive 1[or transferable] licence, to produce and publish a translation of the work in the language\nmentioned in the application, on condition that the applicant shall pay to the owner of the copyright in\nthe work royalties in respect of copies of the translation of the work sold to the public, calculated at\nsuch rate as the Board may, in the circumstances of each case, determine in the prescribed manner:\nProvided that no such licence shall be granted, unless__\n(a)        a translation of the work in the language mentioned in the application has not\nbeen published by the owner of the copyright in the work or any person\nauthorized by him within 1[one year] of the first publication of the work, or if a\ntranslation has been so published, it has been out of print;\n(b)        the applicant has proved to the satisfaction of the Board that he had requested\nand had been denied authorization by the owner of the copyright to produce and\npublish such translation or that he was unable to find the owner of the copyright;\n(c)        where the applicant is unable to find the owner of the copyright, he had sent a\ncopy of his request for such authorization to the publisher whose name appears\nfrom the work, not less than two months before the application for the licence;\n(d)        the Board is satisfied 1[* * * * * * *] that the applicant is competent to\nproduce and publish a correct translation of the work and possesses the means\nto pay to the owner of the copyright the royalties payable to him under this\nsection;\n1\n[(e)   *          *          *       *       *       *   *]\n(f)        an opportunity of being heard is given wherever practicable to the owner of the\ncopyright in the work; and\n(g)        the Board is satisfied, for reason to be recorded in writing, that the grant of the\nlicence will be in the public interest.\n___________\n1\nAdded, ins., subs. and omitted by Act No. XX of 1992, s. 7."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Register of Copyrights, indexes form and inspection of Register",
      "content": "(1) The Registrar\nshall keep at the Copyright Office a register in the prescribed form to be called the Register of\nCopyrights in which shall be entered the names or titles of works and the names and addresses of\nauthors, publishers and owners of copyright and such other particulars as may be prescribed.\n(2) The Registrar shall also keep such indexes of the Register of Copyrights as may be\nprescribed.\n(3) The Register of Copyrights and the indexes thereof kept under this section shall at all\nreasonable times be open to inspection, and any person shall be entitled to take copies of, or make\nextracts from, any such register or index on payment of such fee and subject to such conditions as may\nbe prescribed."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Registration of copyrights",
      "content": "(1) The author or publisher of, or the owner of, or other\nperson interested in the copyright in, any work may make an application in the prescribed form\naccompanied by the prescribed fee to the Registrar for entering particulars of the work in the Register\nof Copyrights.\n(2) On receipt of an application in respect of any work under sub-section (1), the Registrar\nshall enter the particulars of the work in the Register of Copyrights and issue a certificate of such\nregistration to the applicant unless, for reason to be recorded in writing, he considers that such entry\nshould not be made in respect of any work 1[:]\n1\n[Provided that in the case of artistic works the Registrar shall not enter the particulars of the\nwork in the Register of Copyrights and shall not issue a certificate of registration to the applicant unless\nwithin one month of the filing of the application, or within such extended time as the Registrar may\ndetermine, the applicant has advertised the work itself in a newspaper as may be prescribed, and send\ntwo copies thereof to the Registrar and unless within one month thereafter, or within such extended\ntime as the Registrar may determined, not exceeding two months, the Registrar has not received any\nobjection to the registration of particulars of the work in the Register of Copyrights.]"
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Registration of assignments, etc., of copyrights",
      "content": "(1) Any person interested in the grant\nof an interest in a copyright, either by assignment or licence, may make an application in the prescribed\nform, accompanied by the prescribed fee, the original instrument of such grant and a certified copy\nthereof, to the Registrar for entering the particulars of the grant in the Register of Copyrights.\n(2) On receipt of an application in respect of any work under sub-section (1), the Registrar\nshall, after holding such inquiry as he deems fit, enter the particulars of the grant in the Register of\nCopyrights unless, for reasons to be recorded in writing, he considers that such entry should not be\nmade in respect of any grant.\n1\nSubs. and added by Ordinance No. LIII of 2000, s. 10.\n(3) The certified copy of the grant shall be retained at the Copyright Office and the original\nshall be returned to the person depositing it, with a certificate of registration endorsed thereon or\naffixed thereto."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Correction of entries in the Register of Copyrights and indexes, etc",
      "content": "The Registrar\nmay, in the prescribed cases and subject to the prescribed conditions, amend or alter the Register of\nCopyrights and the indexes by__\n(a)        correcting any error in any name, address or particulars; or\n(b)        correcting any other error which may have arisen therein by accidental slip or\nomission.\n(2) The Board, on application of the Registrar or of any person aggrieved, may order the\nrectification of the Register of Copyrights by__\n(a)        the making of any entry wrongly omitted to be made in the Register, or\n(b)        the expunging of any entry wrongly made in, or remaining on, the Register, or\n(c)        the correction of any error or defect in the Register."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Register of Copyrights to be prima facie evidence of particulars entered therein",
      "content": "(1)\nThe Register of Copyrights and the indexes shall be prima facie evidence of the particulars entered\ntherein and documents purporting to be copies of any entry therein or extract therefrom certified by\nthe Registrar and sealed with the seal of the Copyright Office shall be admissible in evidence in all\ncourts without further proof or production of the original.\n(2) A certificate of registration of copyright in a work shall be prima facie evidence that\ncopyright subsists in the work and that the person shown in the certificate as the owner of the copyright\nis the owner of such copyright.\n_______\nCOPYRIGHT OFFICE, REGISTRAR OF COPYRIGHTS AND COPYRIGHT BOARD."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Copyright Office",
      "content": "(1) There shall be established for the purposes of this Ordinance an\noffice to be called the Copyright Office.\n(2) The Copyright Office shall be under the immediate control of the Registrar of Copyrights\nwho shall act under the superintendence and direction of the 1[Federal Government].\n(3) The Copyright Office shall have a seal the impression whereof shall be judicially noticed.\n1\nSubs. by Act No. II of 1973, s. 5.\n1\n[43A. Branch of Copyright Office.__ (1) There shall be established for the purpose of\nfacilitating the registration of copyrights, a Branch of the Copyright Office at such place in Pakistan\nas the Registrar may, with the approval of the Federal Government, determine.\n(2) The Branch Office shall discharge such functions of the Copyright Office as may be\nnotified by the Registrar from time to time.]"
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Registrar and Deputy Registrars of Copyrights",
      "content": "(1) The 2[Federal Government] shall,\nfor the purposes of this Ordinance, appoint a Registrar of Copyrights and may appoint one or more\nDeputy Registrars of Copyrights.\n(2) The Registrar shall,__\n(i)        sign all entries made in the Register of Copyrights kept under this Ordinance;\n(ii)       sign all certificates of registration of copyrights and certified copies under the\nseal of the Copyright Office;\n(iii)      exercise the powers conferred and perform the duties imposed upon him by or\nunder this Ordinance;\n(iv)       be the Secretary of the Copyright Board; and\n(v)        shall perform such other functions as may be prescribed.\n(3) A Deputy Registrar of Copyrights shall discharge, under the superintendence and direction\nof the Registrar, such functions of the Registrar under this Ordinance as the Registrar may, from time\nto time, assign to him.\n1\n[(4) The Registrar may, with the approval of the Federal Government, assign any particular\nfunctions of the Registrar under this Ordinance to officers other than the Deputy Registrar of\nCopyrights.]"
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Copyright Board",
      "content": "(1) The 2[Federal Government] shall constitute a Board to be called\nthe Copyright Board consisting of the following members, namely:__\n(i)        a Chairman appointed by the 2[Federal Government];\n(ii)       not less than three and not more than five other members appointed by the\n2\n[Federal Government] after consultation with the representative bodies of\nauthors, publishers, cinematograph industry and any other interest relating to\ncopyright:\n1\nIns. and Added by Act No. XX of 1992, ss. 8-9.\n2\nSubs. by Act No. II of 1973, s. 5.\nProvided that adequate representation on the Board shall, as far as possible, be\ngiven to the residents of each Province; and\n(iii)     the Registrar, ex-officio.\n(2) The members, including the Chairman of the Board, other than the ex-officio member, shall\nhold office for such period and on such terms and conditions as may be prescribed.\n(3) The Chairman shall be a person who is, or has been a Judge of a High Court, or is qualified\nfor appointment as such Judge."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Powers and procedure of the Board",
      "content": "(1) The Board shall, subject to any rules that may\nbe made under this Ordinance, have power to regulate its own procedure, including the fixing of places\nand times of its sittings.\n(2) If there is a difference of opinion among the members of the Board in respect of any matter\ncoming before it for decision under this Ordinance, the opinion of the majority shall prevail:\nProvided that where there is no such majority the opinion of the Chairman shall prevail.\n(3) The Board may authorize any of its members to exercise any of its powers under section 78\nand any order made or act done in exercise of any such power by the member so authorized shall be\ndeemed to be the order or act, as the case may be, of the Board.\n(4) No act done or proceeding taken by the Board under this Ordinance shall by questioned on\nthe ground merely of the existence of any vacancy in, or defect in the constitution of, the Board.\n(5) The Board shall be deemed to be a civil court for the purposes of sections 480 and 482 of\ndeemed to be judicial proceedings within the meaning of sections 193 and 228 of the Pakistan Penal\nCode (Act XLV of 1860).\n(6) No member of the Board shall take part in any proceedings before the Board in respect of\nany matter in which he has a personal interest.\n_______\nDELIVERY OF BOOKS AND NEWSPAPERS TO PUBLIC LIBRARIES."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Delivery of books to public libraries",
      "content": "(1) Subject to any rules that may be made under\nthis Ordinance, but without prejudice to the provisions contained in section 1[43 of the West Pakistan\npress and publications Ordinance, 1963 (W. P Ordinance No. XXX of 1963)], the publisher of every\nbook published in Pakistan after the commencement of this Ordinance, shall, notwithstanding any\nagreement to the contrary, deliver at his own expense, one copy of the book to each of the 2[public\nlibraries within thirty days from the date of its publication, and shall also furnish to it such particulars\nrelating thereto as may be prescribed].\n1\nSubs. by the Federal Laws (Revision Declaration) Ordinance, 1981 (Ordinance No. XXVII of 1981), s. 3 and Sch., II.\n2\nSubs. by Act No. XX of 1992, s. 10.\n(2) The copy delivered to the National Library of Pakistan 1[, Islamabad,] shall be a copy of\nthe whole book with all maps and illustrations belonging thereto finished and coloured in the same\nmanner as the best copies of the same, and shall be bound, sewed or stitched together, and on the best\npaper on which any copy of the book is printed.\n(3) The copy delivered to any other public library shall be on the paper on which the largest\nnumber of copies of the book is printed for sale, and shall be in the like condition as the books prepared\nfor sale.\n(4) Nothing contained in sub-section (1) shall apply to any second or subsequent edition of a\nbook in which edition no additions or alterations either in the letter-press or in the maps, book-prints\nor other engravings belonging to the book have been made, and a copy of the first or any other edition\nof which book has been delivered under this section.\n1\n[48. Delivery of periodicals and newspapers to public libraries.__ Subject to any rules that\nmay be made under this Ordinance, but without prejudice to the provisions contained in section 36 of\nevery periodical or newspaper published in Pakistan shall deliver, at his own expense, one copy of\neach issue or such periodical or newspaper as soon as it is published to each of the public libraries, and\nshall also furnish to it such particulars relating thereto as may be prescribed.]"
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Receipt for books 1[, periodicals and newspapers] delivered.__ The person in",
      "content": "charge of\na public library (whether called a librarian or by any other name) or any other person authorized by\nhim in this behalf to whom a copy of a book 1[, periodical or newspaper is delivered under section 47\nor section 48] shall give to the publisher a receipt in writing thereto."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Penalty",
      "content": "Any publisher who contravenes any provision of this Chapter or of any rule\nmade thereunder shall be punishable with fine which may extend to 1[five hundred] rupees and, if the\ncontravention is in respect of a book 1[or periodical], shall also be punishable with fine which shall be\nequivalent to the value of the book; 1[or periodical] and the Court trying the offence may direct that\nthe whole or any part of the fine realised from him shall be paid, by way of compensation, to the public\nlibrary to which the book 1[, periodical] or newspaper, as the case may be, ought to have been delivered."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Cognizance of offences under this Chapter",
      "content": "(1) No Court shall take cognizance of any\noffence punishable under this Chapter save on complaint made by an officer empowered in this behalf\nby the 2[Federal Government] by a general or special order.\n(2) No Court inferior to that of a Magistrate of the first class shall try any offence punishable\nunder this Chapter."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Application of this Chapter to books 1[, periodicals] and newspapers published by",
      "content": "Government.__ This Chapter shall also apply to books 1[, periodicals] and newspapers published by\nor under the authority of the Government, but shall not apply to books 1[or periodicals] meant for\nofficial use only.\n___________\n1\nIns. and subs. by Act No. XX of 1992, ss. 10-14.\n2\nSubs. by Act No. II of 1973, s. 5."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Provisions as to works of certain international organizations",
      "content": "(1) The 1[Federal\nGovernment] may, by notification in the official Gazette, declare that this section shall apply to such\norganizations as may be specified therein of which one or more sovereign powers or the Government\nor Governments thereof are members.\n(2) Where__\n(a)        any work is made or first published by or under the direction or control of any\norganization to which this section applies; and\n(b)        there would, apart from this section, be no copyright in the work in Pakistan at\nthe time of the making or, as the case may be, of the first publication thereof;\nand\n(c)        either__\n(i)         the work is published as aforesaid in pursuance of an agreement in that\nbehalf with the author, being an agreement which does not reserve to the\nauthor the copyright, if any, in the work, or\n(ii)        under section 13 any copyright in the work would belong to the\norganization;\nthere shall subsist copyright in the work throughout Pakistan 1[,except as\nrespects its reprint, translation, adaptation or publication, by or under the\nauthority of the Federal Government, as text-book for the purposes of teaching,\nstudy or research in educational institutions.]\n(3) Any organization to which this section applies which at the material time had not the legal\ncapacity of a body corporate shall have, and be deemed at all material times to have had, the legal\ncapacity of a body corporate for the purpose of holding, dealing with, and enforcing copyright and in\nconnection with all legal proceedings relating to copyright."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Power to extend copyright to foreign works",
      "content": "(1) The 1[Federal Government] may, by\norder published in the official Gazette, direct that all or any of the provisions of this Ordinance shall\napply__\n(a)        to works first published in a foreign country to which the order relates in like\nmanner as if they were first published within Pakistan;\n1\nSubs. and added by Act No. II of 1973, ss. 4 and 5.\n(b)        to unpublished works, or any class thereof, the authors whereof were at the time\nof making of the work, subjects or citizens of a foreign country to which the\norder relates, in like manner as if the authors were citizens of Pakistan;\n(c)        in respect of domicile in a foreign country to which the order relates in like\nmanner as if such domicile were in Pakistan;\n(d)        to any work of which the author was at the date of the first publication thereof,\nor, in a case where the author was dead at that date, was at the time of his death,\na subject or citizen of a foreign country to which the order relates in like manner\nas if the author was a citizen of Pakistan at the date or time;\nand thereupon, subject to the provisions of this Chapter and of the order, this Ordinance shall\napply accordingly:\nProvided that__\n(i)        before making an order under this section in respect of any foreign country\n(other than a country with which Pakistan has entered into a treaty or which is\na party to a convention relating to copyright to which Pakistan is also a party),\nthe 1[Federal Government] shall be satisfied that that foreign country has made,\nor has undertaken to make, such provisions, if any, as it appears to the 1[Federal\nGovernment] expedient to require for the protection in that country of work\nentitled to copyright under the provisions of this Ordinance;\n(ii)       the order may provide that the provisions of this Ordinance shall apply either\ngenerally or in relation to such classes of works or such classes of cases as may\nbe specified in the order;\n(iii)      the order may provide that the term of copyright in Pakistan shall not exceed\nthat conferred by the law of the foreign country to which the order relates;\n(iv)       the order may provide that the provisions of this Ordinance as to delivery of\ncopies of books to public libraries shall not apply to works first published in\nsuch foreign country except so far as is provided by the order;\n(v)        in applying the provisions of this Ordinance as to ownership of copyrights, the\norder may make such modification as appears necessary, having regard to the\nlaw of the foreign country;\n(vi)       the order may provide that this Ordinance or any part thereof shall not apply to\nworks made, or first published, before the commencement of the order."
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Power to restrict rights in works of foreign authors first published in Pakistan",
      "content": "If it\nappears to the 1[Federal Government] that a foreign country does not give, or has not undertaken to\ngive, adequate protection to the works of Pakistani authors, the 1[Federal Government] may, by order\n1\nSubs. by Act No. II of 1973, s. 5.\npublished in the official Gazette, direct that such of the provisions of this Ordinance as confer copyright\non works first published in Pakistan shall not apply to works, published after the date specified in the\norder, the authors thereof are subjects or citizens of such foreign country and are not domiciled in\nPakistan, and thereupon those provisions shall not apply to such works.\n_______"
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. When copyright infringed",
      "content": "Copyright in a work shall be deemed to be infringed__\n(a)     when any person, without the consent of the owner of the copyright or without\na licence granted by such owner or the Registrar under this Ordinance or in\ncontravention of the conditions of a licence so granted or of any condition\nimposed by a competent authority under this Ordinance,__\n(i)     does anything, the exclusive right to do which is by this Ordinance\nconferred upon the owner of the copyright; or\n(ii)    permits for profit any place to be used for the performance of the work\nin public where such performance constitutes an infringement of the\ncopyright in the work unless he was not aware, and had no reasonable\nground for suspecting, that such performance would be an infringement\nof copyright; or\n(b)     when any person__\n(i)     makes for sale or hire, or sells or lets for hire, or by way of trade displays\nor offers for sale or hire, or\n(ii)    distributes either for the purpose of trade to such an extent as to affect\nprejudicially the owner of the copyright, or\n(iii)   by way of trade exhibits in public, or\n(iv)    imports into Pakistan,\nany infringing copies of the work.\nExplanation.__ For the purposes of this section, the reproduction of a literary, dramatic, musical\nor artistic work in the form of a cinematographic work shall be deemed to be an “infringing copy”."
    },
    {
      "provision_ref": "sec57",
      "section": "57",
      "title": "Section 57. Certain acts not to be infringement of copyright",
      "content": "(1) The following acts shall not\nconstitute an infringement of copyright, namely:__\n(a)     a fair dealing with a literary, dramatic, musical or artistic work for the purpose\nof __\n(i)    research or private study;\n(ii)   criticism or review, whether of that work or of any other work;\n(b)        a fair dealing with a literary, dramatic, musical or artistic work for the purpose\nof reporting current events__\n(i)    in a newspaper, magazine or similar periodical, or\n(ii)   by 1[broadcast] or in a cinematographic work or by means of\nphotographs;\n(c)        the reproduction of a literary, dramatic, musical or artistic work for the propose\nof a judicial proceeding or for the purpose of a report of a judicial proceeding;\n(d)        the publication in a newspaper of a report of an address of political nature\ndelivered at a public meeting unless the report is prohibited by conspicuous\nwritten or printed notice affixed before and maintained during the lecture at or\nabout the main entrance of the building in which the lecture is given and, except\nwhilst the building is being used for public worship, in a position near the\nlecture; but nothing in this clause shall affect the provisions as to newspaper\nsummaries;\n(e)        the reproduction of any literary, dramatic or musical work in the certified copy\nmade or supplied in accordance with any law for the time being in force;\n(f)        the reading or recitation in public of any reasonable extract from a published\nliterary or dramatic work;\n(g)        the publication in a collection, mainly composed of non-copyright matter, bona\nfide intended for the use of educational institutions and so described in the title\nand in any advertisement issued by or on behalf of the publisher, of short\npassages from published literary or dramatic works, not themselves published\nfor the use of educational institutions, in which copyright subsists:\nProvided that not more than two such passages from works of the same\nauthor are published by the same publisher during any period of five years;\nExplanation.__ In the case of a work of joint authorship references in this\nclause to passages from works shall include references to passages from works\nby any one or more of the authors of those passages or by any one or more of\nthose authors in collaboration with any other person.\n(h)        the reproduction or adaptation of a literary, dramatic, musical or artistic work__\n1\nSubs. by Act No. XX of 1992, s. 15.\n(i)    in the course and for the sole purpose of instruction, whether at an\neducational institution or elsewhere, where the reproduction or\nadaptation is made by a teacher or a pupil otherwise than by the use of a\npainting process; or\n(ii)   as part of the questions to be answered in an examination; or\n(ii)   in answers to such questions;\n(i)   the performance, in the course of the activities of an educational institution, of\na literary, dramatic or musical work by the staff and students of the institution,\nor of a cinematographic work or a record, if the audience is limited to such staff\nand students, the parents and guardians of the students and persons directly\nconnected with the activities of the institution;\n(j)   the making of records in respect of any literary, dramatic or musical work, if__\n(i)    records recording the work have previously been made by or with the\nlicence or consent of, the owner of the copyright in the work; and\n(ii)   the person making the records has given the prescribed notice of his\nintention to make the records, and has paid in the prescribed manner to\nthe owner of the copyright in the work royalties in respect of all such\nrecords to be made by him, at the rate fixed by the Board in this behalf:\nProvided that in making the records such person shall not make\nany alterations in, or omissions from, the work, unless records recording\nthe work subject to similar alterations and omissions have been\npreviously made by, or with the licence or consent of the owner of the\ncopyright, or unless such alterations and omissions are reasonably\nnecessary for the adaptation of the work to the records in question;\n(k)   the causing of a recording embodied in a record to be heard in public utilising\nthe record,__\n(i)    at any premises where persons reside, as part of the amenities provided\nexclusively or mainly for residents therein, or\n(ii)   as part of the activities of a club, society or other organization which is\nnot established or conducted for profit;\n(l)   the performance of a literary, dramatic or musical work by an amateur club or\nsociety, if the performance is given to a non-paying audience, or for the benefit\nof a religious, charitable or educational institution;\n(m)   the reproduction in a newspaper, magazine or other periodical of an article on\ncurrent economic, political, social or religious topics, unless the owner of\ncopyright of such article has expressly reserved to himself the right of such\nreproduction;\n(n)   the publication in a newspaper, magazine or other periodical of a report of a\nlecture delivered to public;\n(o)   the making of not more than three copies of a book (including a pamphlet, sheet\nof music, map, chart or plan) by or under the direction of the person in charge\nof a public library or a non-profit library available for use by the public free of\ncharge or a library attached to an educational institution for the use of such\nlibrary if such book is not available for sale;\n(p)   the reproduction, for the purpose of research or private study or with a view to\npublication, of an unpublished literary, dramatic or musical work kept in a\nlibrary, museum or other institution to which the public has access:\nProvided that where the identity of the author of any such work, or in\nthe case of a work of joint authorship, of any of the authors, is known to the\nlibrary, museum or other institution, as the case may be, the provision of this\nclause shall apply only if such reproduction is made at a time more than fifty\nyears from the date of the death of the author or, in the case of a work of joint\nauthorship, from the death of the author whose identity is known or, if the\nidentity of more authors than one is known, from the death of such one of those\nauthors who dies last;\n(q)   the reproduction or publication of__\n(i)    any matter which has been published in any official Gazette, or the\nreport of any committee, commission, council, board or other like body\nappointed by the Government unless the reproduction or publication of\nsuch matter or report is prohibited by the Government;\n(ii)   any judgment or order of a court, tribunal or other judicial authority,\nunless the reproduction or publication of such judgment or order is\nprohibited by the court, tribunal or other judicial authority, as the case\nmay be;\n(r)   the making or publishing of a painting, drawing, engraving or photograph of an\narchitectural work of art;\n(s)   the making or publishing of a painting, drawing, engraving or photograph of a\nsculpture or other artistic work if such work is permanently situate in a public\nplace or any premises to which the public has access;\n(t)   the inclusion in a cinematographic work of__\n(i)    any artistic work permanently situate in a public place or any premises\nto which the public has access; or\n(ii)   any other artistic work, if such inclusion is only by way of background\nor is otherwise incidental to the principal matters represented in the\nwork;\n(u)     the use by the author of an artistic work, where the author of such work is not\nthe owner of the copyright therein, of any mould, cast, sketch, plan, model or\nstudy made by him for the purpose of the work;\nProvided that he does not thereby repeat or imitate the main design of the work;\n(v)     the making of an object of any description in three dimensions of an artistic\nwork in two dimensions, if the object would not appear, to persons who are not\nexperts in relation to objects of that description, to be a reproduction of the\nartistic work;\n(w)     the reconstruction of a building or structure in accordance with the architectural\ndrawings or plans by reference to which the building or structure was originally\nconstructed:\nProvided that the original construction was made with the consent or\nlicence of the owner of the copyrights in such drawings or plans;\n(x)     in relation to a literary, dramatic or musical work recorded or reproduced in any\ncinematographic work, the exhibition of such work after the expiration of the\nterm of copyright therein:\nProvided that the provisions of sub-clause (ii) of clause (a), sub-clause\n(i) of clause (b) and clauses (f), (g), (m), and (p) shall not apply as respects any\nact unless that act is accompanied by an acknowledgment__\n(i)     identifying the work by its title or other description; and\n(ii)    unless the work is anonymous or the author of the work has previously\nagreed or required that no acknowledgment of his name should be made,\nalso identifying the author.\nExplanation.__ For the purposes of clause (a) or clause (b) of this sub-section__\n(i)     in relation to a literary or dramatic work in prose, a single extract up to\nfour hundred words, or a series of extracts (with comments interposed)\nup to a total of eight hundred words with no one extract exceeding three\nhundred words; and\n(ii)    in relation to a literary or dramatic work in poetry, an extract or extracts\nup to a total of forty lines and in no case exceeding one fourth of the\nwhole of any poem may be deemed to be fair dealing with such work :\nProvided that in a review of a newly published work, reasonably\nlonger extracts may be deemed fair dealing with such work.\n(2) The provisions of sub-section (1) shall apply to the doing of any act in relation to the\ntranslation of a literary, dramatic or musical work or the adaptation of a literary, dramatic, musical or\nartistic work as they apply in relation to the work itself.\n1\n[57A. Particulars to be included in records and video films.__ (1) No person shall\npublish a record in respect of any Pakistani work unless the following particulars are displayed\non the record and on any container thereof, namely:__\n(a)        the name and address of the person who has made the record;\n(b)        the name and address of the owner of the copyright in such work; and\n(c)        the year of its first publication.\n(2) No person shall publish a video film in respect of any Pakistani work unless the following\nparticulars are displayed in the video film when exhibited, and on the video cassette or other container\nthereof, namely:__\n(a)        if such work is a cinematographic film required to be certified for exhibition\nunder the provisions of the Motion Picture Ordinance, 1979 (XLIII of 1979), a\ncopy of the certificate granted in respect of such work by the Central Board of\nfilm Censors under sub- section (3) of section 5 of that Ordinance or by any\nother agency authorised by the Government for the purpose;\n(b)        the name and address of the person who has made the video film and a\ndeclaration by him that he has obtained the necessary licence or consent from\nthe owner of copyright in such work for making such video film; and\n(c)        the name and address of the owner of the copyright in such work.]\n2\n[58. Importation and exportation of infringing copies.__ (1) The Registrar, on application\nof owner of copyright or his duly authorized agent and on payment of prescribed fee, may, after making\nsuch inquiry as he may deem fit, order that no infringing copies of the work shall be imported into or\nexported out of Pakistan.\n(2) Subject to such provisions as may be prescribed, the Registrar or any person authorized by\nhim in this behalf may enter any ship, vehicle, dock or premises where any such copies as are referred\nto in sub-section (1) may be found and may examine such copies.\n(3) All copies to which any order made under sub-section (1) applies, shall be deemed to be\ngoods of which the bringing into or exporting out of Pakistan is prohibited or restricted under the\nprovisions of the Customs Act, 1969 (IV of 1969), and all the provisions of that Act shall have effect\naccordingly.]\n___________\n1\nIns. by Act No. XX of 1992, s. 16.\n2\nSubs. by Ordinance No. LIII of 2000, s. 11."
    },
    {
      "provision_ref": "sec59",
      "section": "59",
      "title": "Section 59. Definition",
      "content": "For the purposes of this Chapter, unless the context otherwise requires, the\nexpression \"owner of copyright\" shall include__\n(a)         an exclusive licensee;\n(b)         in the case of an anonymous or pseudonymous literary, dramatic, musical or\nartistic work, the publisher of the work, until the identity of the author or, in the\ncase of an anonymous work of joint authorship or a work of joint authorship\npublished under names all of which are pseudonyms, the identity of any of the\nauthors, is disclosed publicly by the author and the publisher or is otherwise\nestablished to the satisfaction of the Board by that author or his legal\nrepresentatives."
    },
    {
      "provision_ref": "sec60",
      "section": "60",
      "title": "Section 60. Civil remedies for infringement of copyright",
      "content": "(1) Where copyright in any work has\nbeen infringed, the owner of the copyright shall, except as otherwise provided by this Ordinance, be\nentitled to all such remedies by way of injunction, damages, accounts and otherwise as are or may be\nconferred by law for the infringement of a right:\nProvided that if the defendant proves that at the date of the infringement he was not aware that\ncopyright subsisted in the work and he had reasonable ground for believing that copyright did not\nsubsist in the work, the plaintiff shall not be entitled to any remedy other than an injunction in respect\nof the infringement and a decree for the whole or part of the profits made by the defendant by the sale\nof the infringing copies as the court may in the circumstances deem reasonable.\n(2) Where, in the case of a literary, dramatic, musical or artistic work, a name purporting to be\nthat of the author or the publisher, as the case may be, appears on copies of the work as published, or,\nin the case of an artistic work, appeared on the work when it was made, the person whose name so\nappears or appeared shall, in any proceedings in respect of infringement of copyright in such work, be\npresumed, unless the contrary is proved, to be the author or the publisher of the work, as the case may\nbe.\n(3) The costs of all parties in any proceedings in respect of the infringement of copyright shall\nbe in the discretion of the court.\n1\n[60A. Special remedies for infringement of copyright.__ (1) where copyright in any work\nhas been infringed and the owner of the copyright is unable to institute immediate regular legal\nproceedings for sufficient cause, the owner or any other person having any interest in the copyright in\nthe work, may apply to the Court for immediate provisional orders to prevent infringement of the\ncopyright in such work and for preservation of any evidence relating to such infringement\nnotwithstanding that regular proceedings in the form of a suit or other civil proceedings have not yet\nbeen instituted by the owner.\n1\nIns. by Ordinance No. LIII of 2000, s. 12.\n(2) The court may pass any interim orders envisaged in sub section (1) without prior notice to\nthe defendant, if the court is satisfied that the applicant has some interest in copyright in the work and\nthe right of the applicant is likely to be infringed, affected or prejudiced and any delay in passing such\norders is likely to cause irreparable harm to the applicant or where there is a reasonable risk of\nevidence, either being destroyed, hidden or removed from the jurisdiction of the court or otherwise\nthere is a likelihood of frustration of the intended proceedings if immediate action could not be\ninstituted or there is likelihood of multiplicity of proceedings in the absence of the such orders.\n(3) Where the copyright owner or any other person having any interest in the copyright has\nsought interim orders as provided in sub section (1) and (2), such order shall cease to have effect if a\nsuit for infringement of copyright or other civil proceedings are not initiated within a maximum period\nof thirty days, and where such regular proceedings have been filed by the owner of the copyright, the\nprovisional proceedings in respect of such a work by whosoever filed shall merge into the regular\nproceedings.\n(4) While exercising powers under sub-section (1) and (2), the court, in case of import or export\nof consignment containing infringing copies of works, may direct the custom authorities, in whose\ncustody such consignment is lying for the time being to refuse release of such consignment pending\ndecision of the matter by the court:\nProvided that where interim orders are revoked or cease to have effect due to any act or\nomission of the applicant, the court may award appropriate costs to the defendant for any injury\ncaused.]"
    },
    {
      "provision_ref": "sec61",
      "section": "61",
      "title": "Section 61. Protection of separate rights",
      "content": "Subject to the provisions of this Ordinance, where the\nseveral rights comprising the copyright in any work are owned by different persons, the owner of any\nsuch right shall, to the extent of that right, be entitled to the remedies provided by this Ordinance and\nmay individually enforce such right by means of any suit, action or other proceeding without making\nthe owner of any other right a party to such or proceeding."
    },
    {
      "provision_ref": "sec62",
      "section": "62",
      "title": "Section 62. Author’s special rights",
      "content": "(1) Notwithstanding that the author of a work may have assigned\nor relinquished the copyright in the work, he shall have the right to claim the authorship of the work\nas well as the right to restrain, or claim damages in respect of any distortion, mutilation or other\nmodification of the said work, or any other action in relation to the said work which would be\nprejudicial to his honor or reputation.\n(2) The right conferred upon an author of a work by sub-section (1) may be exercised by the\nlegal representatives of the author."
    },
    {
      "provision_ref": "sec63",
      "section": "63",
      "title": "Section 63. Rights of owner against persons possessing or dealing with infringing copies",
      "content": "All\ninfringing copies of any work in which copyright subsists, and all plates used or intended to be used\nfor the production of such infringing copies, shall be deemed to be the property of the owner of the\ncopyright, who accordingly may take proceedings for the recovery of possession thereof or in respect\nof the conversion thereof:\nProvided that the owner of the copyright shall not be entitled to any remedy in respect of the\nconversion of any infringing copies, if the opponent proves__\n(a)        that he was not aware that copyright subsisted in the work and he had reasonable\nground for believing that copyright did not subsist in the work of which such\ncopies are alleged to be infringing copies; or\n(b)        that he has reasonable ground for believing that such copies or plates do not\ninvolve infringement of the copyright in any work."
    },
    {
      "provision_ref": "sec64",
      "section": "64",
      "title": "Section 64. Restriction on remedies in the case of works of architecture",
      "content": "(1) Where the\nconstruction of a building or other structure which infringes or which, if completed, would infringe the\ncopyright in some other work has been commenced, the owner of the copyright shall not be entitled to\nobtain an injunction to restrain the construction of such building or structure or to order its demolition.\n(2) Nothing in section 63 shall apply in respect of the construction of a building or other\nstructure which infringes or which, if completed, would infringe the copyright in some other work.\n1\n[65. Jurisdiction of court and limitation.__ 2[(1) Every suit or other civil proceedings\nregarding infringement of copyright shall be instituted and tried in the Court of District Judge which\nshall ordinarily be decided within a period of twelve months.]\n(2) Where a petition has been filed under the proviso to sub-section (1), the Board, or a\nCommittee consisting of the Chairman and not less than two members of the Board as the Chairman\nmay appoint, shall consider the matter, and, after giving the parties an opportunity of being heard, pass\nsuch order as it thinks fit.\n(3) The decision of the Committee referred to in sub-section (2) shall be deemed to be the\ndecision of the Board.\n(4) Where a matter has been referred to the Board under the proviso to sub-section (1), no court\nshall hear, try or entertain any suit or proceeding relating to that matter.\n(5) The decision of the Board shall, subject to the provisions as to appeal, be final, and shall be\nexecuted in the manner provided in section 79.]\n2[CHAPTER XIIIA"
    },
    {
      "provision_ref": "sec65a",
      "section": "65A",
      "title": "Section 65A. Prohibition",
      "content": "No infringing copies of any work, whether themselves or depicted or\napplied to any article or goods or in anyother form, shall be allowed to be imported into or exported\nout of Pakistan either by sea, air, land or through any other means or channel of communication."
    },
    {
      "provision_ref": "sec65b",
      "section": "65B",
      "title": "Section 65B. Jurisdiction of officers of customs",
      "content": "(1) An officer of custom functioning under the\nCustoms Act, 1969 (IV of 1969), may, upon an application by the owner of copyright in the work or\nany other person having an interest in the copyright in the work, detain any consignment intended to\nbe imported into or exported out of Pakistan which is suspected to contain infringing copies of any\nwork.\n1\nSubs. by Act No. XX of 1992, s. 17.\n2\nSubs. and ins. by Ordinance No. LIII of 2000, ss. 13-14.\n(2) A consignment detained under sub-section (1), shall be examined by an officer of customs\nin the presence of the parties and upon determination that such consignment contains infringing copies\nof any work, the same shall be ordered to be confiscated and the importer or exporter thereof, as the\ncase may be, shall be liable to such penalties as provided in this behalf in the Customs Act, 1969 (IV\nof 1969):\nProvided that all the process of detention and examination of the consignment as provided in\nthis section shall be completed ordinarily within a period of fifteen days of the filing of the application\nby the aforesaid person:\nProvided further that an order passed by any officer of customs under this section shall be\ndeemed to be an order passed under the Customs Act, 1969 (IV of 1969), and shall be appealable as\nsuch."
    },
    {
      "provision_ref": "sec65c",
      "section": "65C",
      "title": "Section 65C. Release of detained consignment",
      "content": "In case where the consignment intended to be\nimported into or exported out of Pakistan has been detained by an officer of customs under section\n65B and the requirements of the first proviso to that section are not completed, the importer or exporter\nof such consignment, as the case may be, may apply to the concerned customs authorities for release\nof such goods subject to furnishing such security as may be deemed appropriate by the officer of\ncustoms.]\n_______"
    },
    {
      "provision_ref": "sec66",
      "section": "66",
      "title": "Section 66. Offences of infringement of copyright or other rights conferred by this Ordinance",
      "content": "Any person who knowingly infringes or abets the infringement of__\n(a)        the copyright in a work, 1[*]\n1\n[(ab) the rental rights in cinematographic works and computer programmes;\n(ac)       the rights of performers or producers of sound recording; or]\n(b)        any other right conferred by this Ordinance,\nshall be punishable with 2[imprisonment which may extend to three years, or with fine which may\nextend to one hundred thousand rupees] or with both.\nExplanation.__ Construction of a building or other structure which infringes or which, if\ncompleted, would infringe the copyright in some other work, shall not be an offence under this section.\n1\nOmitted and ins. by Ordinance No. LIII of 2000, s. 15.\n2\nSubs. by Act No. XX of 1992, s. 18.\n1\n[66A. Penalty for publishing collections or compendiums of work which have been\nadapted, translated or modified in any manner without the authority of the owner of the\ncopyright.__ Any person who knowingly publishes, or causes to be published, a collection or\ncompendium of works which have been adapted, translated or modified in any manner without the\nauthority of the owner of the copyright in the original works, or who fraudulently employs a title which\ntends to mislead the public or create confusion with another work published earlier, shall be punishable\nwith imprisonment which may extend to three years, or with fine which may extend to one hundred\nthousand rupees, or with both."
    },
    {
      "provision_ref": "sec66b",
      "section": "66B",
      "title": "Section 66B. Penalty for unauthorised reproduction or distribution of counterfeit copies of sound",
      "content": "recording and cinematographic work.__ Any person who unauthorisedly makes or distributes\ncounterfeit of sound recording and cinematographic work for the purpose of business, profit or gain\nshall be publishable with imprisonment which may extend to three years, or with fine which may\nextend to one hundred thousand rupees, or with both."
    },
    {
      "provision_ref": "sec66c",
      "section": "66C",
      "title": "Section 66C. Penalty for exploitation and appropriation of recording or audio",
      "content": "visual work\nintended for private use.__ Any person who for the purpose of business, profit or gain, exploits or\nappropriates any sound recording or audio-visual work intended for private use, shall be punishable\nwith imprisonment which may extend to three years, or with fine which may extend to one hundred\nthousand rupees, or with both."
    },
    {
      "provision_ref": "sec66d",
      "section": "66D",
      "title": "Section 66D. Penalty for making copies or reproduction in excess of those authorised by the",
      "content": "copyright owner or his successor in title.__ Any person who produces, or causes to be produced,\ncopies or reproductions in excess of the number authorised by the copyright owner or his successor in\ntitle, shall be punishable with imprisonment which may extend to three years, or with fine which may\nextend to one hundred thousand rupees, or with both.]\n2\n[66E. Penalty for unauthorized rental of cinematographic works and computer\nprogrammes.__ Any person who, without authorization of the copyright owner or his licensee rents\nout the original or copies of the cinematographic works or computer programmes, shall be punishable\nwith imprisonment which may extend to three year, or with fine which may extend to one hundred\nthousand rupees or with both.]"
    },
    {
      "provision_ref": "sec67",
      "section": "67",
      "title": "Section 67. Possession of plates for purpose of making infringing copies",
      "content": "If any person knowingly\nmakes or has in his possession any plate for the purpose of making infringing copies of any work in\nwhich copyright subsists, or knowingly and for his private profit causes any such work to be performed\nin public without the consent of the owner of the copyright, he shall be punishable with 1[imprisonment\nwhich may extend to two years, or with fine which may extend to one hundred thousand rupees], or\nwith both."
    },
    {
      "provision_ref": "sec68",
      "section": "68",
      "title": "Section 68. Penalty for making false entries in the Register, etc., or producing or tendering false",
      "content": "evidence.__ Any person who,__\n(a)        makes or causes to be made a false entry in the Register of Copyright, or\n1\nIns. and subs. by Act No. XX of 1992, ss.19-20.\n2\nIns. by Ordinance No. LIII of 2000, s. 16.\n(b)        makes or causes to be made a writing falsely purporting to be a copy of any\nentry in the Register, or\n(c)        produces or tenders or causes to be produced or tendered as evidence any such\nentry or writing, knowing the same to be false,\nshall be punishable with 1[imprisonment which may extend to two years, or with fine which may\nextend to one hundred thousand rupees], or with both."
    },
    {
      "provision_ref": "sec69",
      "section": "69",
      "title": "Section 69. Penalty for making false statements for the purpose of deceiving or influencing any",
      "content": "authority or officer.__ Any person who,__\n(a)        with a view to deceiving any authority or officer in the performance of any of\nhis functions under any of the provisions of this Ordinance, or\n(b)        with a view to inducing or influencing the doing or omission of anything in\nrelation to this Ordinance or any matter thereunder,\nmakes a false statement or representation knowing the same to be false, shall be punishable, with\n1\n[imprisonment which may extend to two years, or with fine which may extend to one hundred\nthousand rupees], or with both."
    },
    {
      "provision_ref": "sec70",
      "section": "70",
      "title": "Section 70. False attribution or authorship, etc",
      "content": "Whosoever__\n(1)        inserts or affixes the name of any person in or on a work of which that person\nis not the author, or in or on a reproduction of such a work, in such a way as to\nimply that such person is the author of the work; or\n(2)        publishes or sells or lets for hire, or by way of trade offers, exposes for sale or\nhire, or by way of trade exhibits in public a work in or on which the name of a\nperson has been inserted or affixed in such a way as to imply that such person\nis the author of the work, or the publisher of the work, who to his knowledge is\nnot the author or the publisher, as the case may be, of such work; or\n(3)        does any of the acts mentioned in clause (2) in relation to, or distributes,\nreproductions of a work, being reproductions in or on which any person’s name\nhas been inserted or affixed in such a way as to imply that such person is the\nauthor of the work, who to his knowledge is not the author of such work, or\nperforms in public, or broadcasts the work as being the work of a particular\nauthor, who to his knowledge is not the author of such work;\nshall be punishable with 1[imprisonment which may extend to two years, or with fine which may\nextend to one hundred thousand rupees], or with both.\n1\nSubs. by Act No. XX of 1992, s. 20.\n1\n[70A. Penalty for contravention of section 57A.__ Any person who publishes a record or a\nvideo film in contravention of the provisions of section 57A, shall be punishable with imprisonment\nwhich may extend to three years, or with fine which may extend to one hundred thousand rupees, or\nwith both."
    },
    {
      "provision_ref": "sec70b",
      "section": "70B",
      "title": "Section 70B. Enhanced fine in the case of subsequent offences",
      "content": "Where any person convicted for an\noffence punishable under section 66, 66A, 66B, 66C, 66D, 2[66E] or 70A, is again convicted for the\nsame offence, the said section shall have effect as if for the words “one hundred thousand” therein the\nwords “two hundred thousand” were substituted.]"
    },
    {
      "provision_ref": "sec71",
      "section": "71",
      "title": "Section 71. Offences by companies",
      "content": "(1) Where any offence under this Ordinance has been committed\nby a company, every person who at the time the offence was committed was in charge of, and was\nresponsible to the company for, the conduct of the business of the company, as well as the company\nshall be deemed to be guilty of such offence and shall be liable to be proceeded against and punished\naccordingly:\nProvided that nothing contained in this sub-section shall render any person liable to any\npunishment, if he proves that the offence was committed without his knowledge or that he exercised\nall due diligence to prevent the commission of such offence.\n(2) Notwithstanding anything contained in sub-section (1), where an offence under this\nOrdinance has been committed by a company, and it is proved that the offence was committed with\nthe consent or connivance of, or is attributable to any negligence on the part of, any director, manager,\nsecretary or other officer of the company, such director, manager, secretary or other officer shall also\nbe deemed to be guilty of that offence and shall be liable to be proceeded against and punished\naccordingly.\nExplanation.__ For the purposes of this section__\n(a)        “company” means any body corporate and includes a firm or other association\nof persons; and\n(b)        “director” in relation to a firm means a partner in the firm"
    },
    {
      "provision_ref": "sec72",
      "section": "72",
      "title": "Section 72. Cognizance of offences",
      "content": "No court inferior to that of a Magistrate of the first class shall\ntry any offence under this Ordinance."
    },
    {
      "provision_ref": "sec73",
      "section": "73",
      "title": "Section 73. Power of the court to dispose of infringing copies 1[, plates or recording equipment]",
      "content": "for purpose of making infringing copies.__ The court before which any offence under this Ordinance\nis tried may, whether the alleged offender is convicted or not, order that all copies of the work or all\nplates 1[or recording equipment] in the possession of the alleged offender, which appear to it to be\ninfringing copies, or plates 1[or recording equipment used or intended to be used] for the purpose of\nmaking infringing copies, be destroyed or delivered to the owner of the copyright or otherwise dealt\nwith as the court may think fit.\n1\nIns and subs. by Act No. XX of 1992, ss. 21-22.\n2\nIns. by Ordinance No. LIII of 2000, s. 17."
    },
    {
      "provision_ref": "sec74",
      "section": "74",
      "title": "Section 74. Powers of police to seize infringing copies 1[, plates and recording equipment]",
      "content": "1[(1)\nAny police officer, not bellow the rank of Sub-inspector, shall, if he is satisfied that an offence under\nChapter XIV in respect of infringement of copyright in any work has been, is being, or is likely to be,\ncommitted, seize without warrant all copies of the work and all plates and recording equipments used\nfor the purposes of making infringed copies of the work, wherever found, and all copies, plates and\nrecording equipments so seized shall, as soon as practicable, be produced before a Magistrate:\nProvided that no such copy, plate or recording equipment as is owned by any public library or\na library attached to an educational institution or a non-profit library available for use by the public\nfree of charge or is in the possession of any person for his bona fide use shall be seized.]\n(2) Any person having an interest in any copies of a work 1[, plates or recording equipment]\nseized under sub-section (1) may, within fifteen days of such seizure, make an application to the\nMagistrate for such copies 1[, plates or recording equipment] being restored to him and the Magistrate,\nafter hearing the applicant and the complainant and making such further inquiry as may be necessary,\nshall make such order on the application as he may deem fit.\n1\n[(3) All offences under this Ordinance shall be cognizable and non-bailable.]\n1\n[74A. Power of Magistrate to award compensation for offences under this Chapter.__ (1)\nThe Magistrate may, when passing a sentence of fine, direct that an amount not exceeding fifty per\ncent of the fine imposed by him but commensurate with the loss suffered by the party shall be paid as\ncompensation to the person whose right has been infringed or to the heirs or legal representatives of\nsuch person.\n(2) Payment of any compensation to any person under sub-section (1) shall be without prejudice\nto his right to any claim in a suit or other proceeding which may be instituted, or may be pending in a\nCourt, in relation to the same matter.]"
    },
    {
      "provision_ref": "sec75",
      "section": "75",
      "title": "Section 75. Appeals against certain orders of Magistrate",
      "content": "Any person aggrieved by an order made\nunder section 73 1[, sub-section (2) of section 74 or sub-section (1) of section 74A] may, within thirty\ndays of the date of such order, appeal to the court to which appeals from the court making the order\nordinarily lie, and such appellate court may direct that execution of the order be stayed pending\ndisposal of the appeal."
    },
    {
      "provision_ref": "sec76",
      "section": "76",
      "title": "Section 76. Appeals against orders of Registrar",
      "content": "Any person aggrieved by any final decision or\norder of the Registrar may, within three months from the date of the decision or order, appeal to the\nBoard:\nProvided that the Registrar shall not sit as a member of the Board when the Board hears an\nappeal under this section.\n1\nAdded, Subs. and Ins. Act No. XX of 1992, ss. 23-25."
    },
    {
      "provision_ref": "sec77",
      "section": "77",
      "title": "Section 77. Appeals against orders of the Board",
      "content": "(1) Any person aggrieved by any final decision or\norder of the Board, not being the decision or order made in an appeal under section 76 may, within\nthree months from the date of such decision or order, appeal to the High court within whose jurisdiction\nthe appellant actually and voluntarily resides or carries on business or personally works for gain:\nProvided that no such appeal shall lie against a decision of the Board under sub-section (2) of\nsection 4 and sub-section (2) of section 6.\n(2) In calculating the period of three months provided for an appeal under section 76 and sub-\nsection (1), the time taken in granting a certified copy of the order or record of the decision appealed\nagainst shall be excluded.\n___________"
    },
    {
      "provision_ref": "sec78",
      "section": "78",
      "title": "Section 78. Registrar and Board to possess certain powers of civil court",
      "content": "The 1[Register] and the\nBoard shall have the powers of a civil court when trying a suit under the Code of Civil Procedure, 1908\n(Act V of 1908), in respect of the following, namely:__\n(a)       sommoning and enforcing the attendance of any person and examining him on\noath:\n(b)       requiring the discovery and production of any document;\n(c)       receiving evidence on affidavits;\n(d)       issuing commissions for the examination of witnesses or documents;\n(e)       requisitioning any public record or copy thereof from any court or office;\n(f)       any other matter of procedure which may be prescribed.\nExplanation.__ For the purpose of enforcing the attendance of witnesses, the local limits of the\njurisdiction of the Registrar or the Board, as the case may be, shall be the whole of Pakistan."
    },
    {
      "provision_ref": "sec79",
      "section": "79",
      "title": "Section 79. Order for payment of money passed by Registrar or Board to be executable as a",
      "content": "decree.__ Every order made by the Registrar or the Board under this ordinance for the payment of any\nmoney or by the High Court in any appeal against any such order of the Board shall, on a certificate\nissued by the Registrar, the Board or the Registrar or the High Court, as the case may be, be deemed\nto be a decree of a civil court and shall be executable in the same manner as a decree of such court."
    },
    {
      "provision_ref": "sec80",
      "section": "80",
      "title": "Section 80. Indemnity",
      "content": "No suit or other legal proceeding shall lie against any person in respect of\nanything which is in good faith done or intended to be done in pursuance of this Ordinance."
    },
    {
      "provision_ref": "sec81",
      "section": "81",
      "title": "Section 81. Certain persons to be public servants",
      "content": "Every officer appointed under this Ordinance\nand every member of the Board shall be deemed to be a public servant within the meaning of section\n21 of the Pakistan Penal Code (Act XLV of 1860).\n1\nSic should read “Registrar”."
    },
    {
      "provision_ref": "sec82",
      "section": "82",
      "title": "Section 82. Powers to make rules",
      "content": "(1) The 1[Federal Government] may, after previous publication,\nmake rules for carrying out the purposes of this ordinance.\n(2) In particular, and without prejudice to the generality of the foregoing power, the rules may\nprovide for all or any of the following, namely:__\n(a)        the term of office and conditions of service of the Chairman and other members\nof the Board;\n(b)        the form of complaints and applications to be made, and the licences to be\ngranted, under this Ordinance ;\n(c)        the procedure to be followed in connection with any proceeding before the\nRegistrar or the Board;\n(d)        the manner of determining any royalties payable under this Ordinance, and the\nsecurity to be taken for the payment of such royalties;\n(e)        the form of Register of Copyrights to be kept under this Ordinance and the\nparticulars to be entered therein;\n(f)        the matters in respect of which the Registrar and the Board shall have powers\nof a civil court;\n(g)        the fees which may be payable under the Ordinance;\n(h)        the regulation of business of the Copyright Office and of all things by this\nOrdinance placed under the direction or control of the Registrar."
    },
    {
      "provision_ref": "sec84",
      "section": "84",
      "title": "Section 84. Savings and transitory provisions",
      "content": "(1) Where any person has, before the commencement\nof this Ordinance, taken any action whereby he has incurred any expenditure or liabilities in connection\nwith the reproduction or performance of any work in a manner which at the time was lawful or for the\npurpose of or with a view to the reproduction or performance of a work at a time when such\nreproduction or performance would, but for the coming into force of this Ordinance, have been lawful,\nnothing in this section shall diminish or prejudice any rights or interests arising from or in connection\nwith such actions which are subsisting and valuable at the said date, unless the person who, by virtue\nof this Ordinance, becomes entitled to restrain such reproduction or performance agrees to pay such\ncompensation as, failing agreement, may be determined by the Board.\n(2) Copyright shall not subsist by virtue of this Ordinance in any work in which copyright did\nnot subsist immediately before the commencement of this Ordinance under any Act repealed by section\n83.\n1\nSubs. by Act No. II of 1973, s. 5.\n2\nOmitted by the Federal Laws (Revision Declaration) Ordinance, 1981 (Ordinance No. XXVII of 1981), s. 3 and Sch., II.\n(3) Where copyright subsisted in any work immediately before the commencement of this\nOrdinance, the rights comprising such copyright shall, as from the date of such commencement, be the\nrights specified in section 3 in relation to the class of works to which such work belongs, and where\nany new rights are conferred by that section the owner of such rights shall be__\n(a)     in any case where copyright in the work was wholly assigned before the\ncommencement of this Ordinance, the assignee or his successor-in -interest; and\n(b)     in any other case, the person who was the first owner of the copyright in the\nwork under any Act repealed by section 83 or his legal representatives.\n(4) Except as otherwise provided in this Ordinance, where any person was entitled immediately\nbefore the commencement of this Ordinance to copyright in any work or any right in such copyright\nor to an interest in any such right, he shall continue to be entitled to such right or interest for the period\nfor which he would have been entitled thereto if this Ordinance had not come into force.\n(5) Nothing contained in this Ordinance shall be deemed to render any act done before its\ncommencement an infringement of copyright if that act would not otherwise have constituted such an\ninfringement.\n_______\nRGN.20-06-2025"
    }
  ],
  "definitions": []
}
