{
  "id": "pk-corporate-industrial-restructuring-corporation-ordinance-2000",
  "type": "statute",
  "title": "Corporate Industrial Restructuring Corporation Ordinance, 2000",
  "title_en": "Corporate Industrial Restructuring Corporation Ordinance, 2000",
  "short_name": "CIRCO",
  "status": "in_force",
  "issued_date": "2000-09-21",
  "in_force_date": "2000-09-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FobZY%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Corporate Industrial Restructuring Corporation Ordinance, 2000 (L of 2000) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Removal of difficulties",
      "content": "SCHEDULE.\nCORPORATION ORDINANCE, 2000\nORDINANCE NO. L OF 2000\n22nd September, 2000\nAN\nto make provisions for the acquisition, restructuring, rehabilitation, management, disposition\nand realization of non- performing loans and other assets of various banks and financial\ninstitutions\nWHEREAS it is expedient, in the public interest, to deal with financial institutions and their\nassets, to assist the business sector by dealing with distressed enterprises and to promote the\nrehabilitation of the national economy by making provisions for the acquisition, restructuring,\nrehabilitation, management, disposition and realization of non-performing loans and other assets\nof various banks and financial institutions and for matters ancillary or incidental thereto;\nAND WHEREAS, the National Assembly and the Senate stand suspended in pursuance of the\nProclamation of the Fourteenth day of October, 1999 and the Provisional Constitution Order No.\n1 of 1999;\nAND WHEREAS, the President is satisfied that circumstances exist which render it necessary to\ntake immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of\nOctober, 1999, and Provisional Constitution Order No. 1 of 1999, as well as Order No. 9 of 1999,\nand in exercise of all powers enabling him in that behalf, the President of the Islamic Republic of\nPakistan is pleased to make and promulgate the following Ordinance:—\nCHAPTER I. — PRELIMINARY"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Ordinance may be called the\nCorporate and Industrial Restructuring Corporation Ordinance, 2000.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Ordinance, unless there is anything repugnant in the subject or\ncontext,—\n(a)     “Administration Committee” means the administration committee established\nunder section 12;\n(b)     “Board” means the Board of directors constituted under section 6;\n(c)        “bonds” mean bonds, debentures, participation term certificates, term finance\ncertificates, redeemable capital certificates or similar instruments providing for\nscheduled or contingent payment of debt obligations;\n(d)        “book value” means the rupee amount, inclusive of principal and accrued\nprofit, owed by any obligor in connection with any financial asset as reflected\non the books and records of the financial institution, as of the transfer date;\n(e)        “Chairman” means the chairman of the Board;\n(f)        “Chief Executive” means the Chief Executive Officer of the Corporation;\n(g)        “collateral” means any asset, property, right, claim, entitlement, share,\nundertaking, guarantee, agreement, document or instrument, security interest,\ncharge, mortgage, lien, hypothecation, pledge or assignment in respect of or as\nsecurity for any financial asset;\n(h)        “Commission” means the Securities and Exchange Commission of Pakistan\nestablished under section 3 of the Securities and Exchange Commission of\nPakistan Act, 1997 (XLII of 1997);\n(i)        “Corporation” means the Corporate and Industrial Restructuring Corporation\nestablished under section 4;\n(j)        “director” means a director of the Board;\n(k)        “financial asset” means any short, medium or long term interest and\nnon-interest bearing loan, finance, advance, lease, installment, term finance\ncertificate, participation term certificate, musharaka, modaraba, profit and\nloss sharing agreement, redeemable capital, guarantee or contractual right to\nreceive payment of money in respect of sums advanced or committed to an\nobligor by a financial institution including collateral pertaining thereto;\n1\n[(l)   “Financial Institution” means any bank or other financial institution operating\nin Pakistan wherein the Federal Government holds any equity.]\n(m)        “Government entity” means any Ministry, Division, Department or office of\nthe Federal Government or any corporation, company, trust, statutory body or\nother entity of which more than fifty per cent of the equity or beneficial\ninterest is directly or indirectly owned or controlled by the Federal\nGovernment;\n(n)       “non-performing asset” means any financial asset:\n(a)     which is held as an asset on the books of a financial institution;\n(b)     with respect to which the obligor has been in arrears on any payment\nobligation for a period more than three hundred and sixty-five days,\nincluding—\n_________________________________________________________________________________________________________________________\n1\nSubs. by the Corporate and Industrial Restructuring Corporation (Amdt.) Act, 2005 (3 of 2005) s. 2 for clause (1).\n(i)         collateral with respect to any financial asset; and\n(ii)       a whole or partial right or interest of a financial institution in\nany financial asset, that otherwise constitutes a non-performing\nasset including a financial asset with respect to which the\nfinancial institution has an ongoing funding obligation; and\n1\n[(c)    with respect to which the obligor’s outstanding payment obligation to\nany financial institution exceeds thirty million rupees:\nProvided that the Federal Government may, by notification in the\nofficial Gazette, alter, reduce or increase the said amount as and when\nit deems fit.]\n(o)        “obligor” means any individual, proprietorship concern, company or other body\ncorporate, trust, partnership or other entity that has, with respect to a\nnon-performing asset, a contractual or legal obligation or duty to make\npayment, effect performance, provide security, or collateral with respect to\nany financial asset whether as principal, surety, guarantor or otherwise and\nwhether such obligation is primary, secondary, matured or contingent;\n(p)        “ outstanding amount” means the book value of a non-performing asset of\nthe financial institution less, —\n(a)         any amount on the books of the financial institution appearing as a\nspecific reserve applicable to that non-performing asset;\n(b)         any amount on the books of the financial institution appearing in a\ngeneral loan loss and/or other reserve applicable to that non-performing\nasset; and\nif, in the opinion of the Board, the book value of the non-performing asset, as\nadjusted in sub-clauses (a) and (b), is higher than the estimated market price\nof the non-performing asset, the Board shall commission an independent\nevaluator to determine such market price and in the event that the market\nprice as determined by the independent evaluator is lower than the book\nvalue as adjusted in sub-clauses (a) and (b), such market price shall be\ndeemed to be the outstanding amount;\n(q)       “regulations” means regulations made under this Ordinance;\n(r)        “ rules” means rules made under this Ordinance;\n(s)        “Schedule” means the Schedule to this Ordinance; and\n(t)        “State Bank” means the State Bank of Pakistan.\n________________________________________________________________________________\n1\nSubs. by the Corporate and Industrial Restructuring Corporation (Amdt.) Ordinance, 2000 (57 of 2000) s. 2 for the original sub-clause (c)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Ordinance not to derogate from other laws",
      "content": "The provisions of this Ordinance shall\nbe in addition to and save as hereinafter provided, not in derogation of any other law for the time\nbeing in force.\n__________\nCHAPTER II. — ESTABLISHMENT OF THE CORPORATION AND THE"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Establishment of the Corporation",
      "content": "(1) A corporation called the Corporate and\nIndustrial Restructuring Corporation is hereby established for carrying out the purposes of this\nordinance.\n(2) The Corporation shall be a body corporate having a common seal, with powers, subject to\nsued.\n(3) The headquarters of the Corporation shall be at Islamabad or such other place as may\nbe determined by the Board."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Board and its Powers",
      "content": "(1) The overall direction, management, control and\nsuperintendence of the affairs of the Corporation shall vest in the Board which may exercise all such\npowers and do all such acts and things as may be exercised and done by the Corporation as set out in\nsection 18.\n(2) In discharging its functions, the Board shall act with prudence and sound business\nand financial considerations for and on behalf of all persons who have beneficial interest as creditors\nor otherwise are beneficiaries, including the financial institutions and Government entity."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Composition of the Board",
      "content": "(1) The Board shall consist of the following directors,\nnamely:—\n(a)        the Minister for Finance, Government of Pakistan;\n1\n[(b)    the Minister of Commerce, Government of Pakistan;\n(bb)       the Minister of Industries, Government of Pakistan;]\n(c)         the Governor, State Bank of Pakistan;\n(d)        the Chairman, Privatization Commission of Pakistan;\n1\n[(e)    the Finance Secretary, Ministry of Finance;]\n(f)        the Chief Executive as defined in clause (f) section 2; and\n_________________________________________________________________________________\n1\nSubs. by the Corporate and Industrial Restructuring Corporation (Amdt.) Act, 2005 (3 of 2005) s. 3 for clause (b) and (e)\n(g)     a minimum of four and a maximum of eight persons of repute from the private\nsector and as far as possible from each Province, one of whom shall be from\nthe banking sector.\n(2) The directors referred to in clauses (a) to (f) of sub-section (1) shall be ex officio directors.\n(3) The directors under clause (g) of sub-section (1) shall be appointed by the Federal\nGovernment, who shall hold office for a term of two years and shall be eligible for re-appointment\nfor additional terms of two years each.\n(4) No act or proceedings of the Board shall be invalid merely on the ground of the existence\nof any vacancy in, or defect in the constitution of, the Board.\n(5) No director shall have any direct or indirect financial interest in, or have business\nconnection with any obligor or financial institution whose non-performing assets are the subject of\nthis Ordinance.\nExplanation. — For the purposes of this sub-section, any involvement of the spouse or any\nlineal ascendant or descendant of any director with any obligor or financial institution shall be\nconsidered as a direct financial interest or connection of the director with such obligor or financial\ninstitution.\n(6) The directors shall not, for two years after the expiry of their term of office, enter into\nthe employment of or accept any advisory or consultancy relationship with any obligor or\nfinancial institution whose non-performing assets are the subject of this Ordinance."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Chairman of the Board",
      "content": "The Minister for Finance shall be the Chairman of the Board."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Chief Executive of the Corporation",
      "content": "(1) The Chief Executive shall be appointed by\nthe Federal Government who shall be the whole-time chief executive officer of the Corporation.\n(2) The Chief Executive shall hold office for a term of two years and shall be eligible for\nre-appointment for additional terms of two years each.\n(3) Subject to its superintendence, direction and control, the Board may authorise in writing\nthe Chief Executive to exercise and perform any or all of the following powers and functions\nas the Board deems fit, namely:—\n(a)      to deal with, negotiate, enter into and sign agreements and contracts with\nany obligor or financial institution in respect of the non-performing assets\nor related collateral and to take any and all actions, in any manner, to\nadvance the business of the Corporation as specified in section 18;\n(b)      to institute, finance, manage, oversee and terminate rehabilitation plans and\nschemes for the non-performing assets or the obligor, as the case may be;\n(c)     to pay the cost, charges and expenses for the day to day business of the\nCorporation;\n(d)     to receive money or goods on behalf of the Corporation;\n(e)   to sell, deal in and dispose of all articles and goods of the Corporation;\n(f)   to engage, employ, fix and pay the remuneration and dismiss or discharge\nall managers, agents, secretaries, clerks, servants, workmen and other persons\nemployed in, or in connection with, the Corporation’s business;\n(g)   to appoint any person or persons to be attorney or attorneys of the Corporation\nfor such purposes and with such powers, authorities and discretions and\nfor such period and subject to such conditions as he may from time to time\nthink fit;\n(h)   to make and give receipt, release and discharge, all moneys payable to the\nCorporation or for the claims and demands of the Corporation;\n(i)   to draw, accept, endorse and negotiate all such cheques, bills of exchange,\npromissory notes and Government and other securities as shall be necessary\nin or for carrying on the affairs of the Corporation whether the account may be\noverdrawn or not;\n(j)   to institute, compromise, withdraw or abandon any legal proceedings by or\nagainst the Corporation or its officers or otherwise concerning the affairs of the\nCorporation;\n(k)   to provide for the welfare of employees or ex-employees of the\nCorporation and the wives, widows or families or the dependents of such\npersons in such manner as he may think fit;\n(l)   to open, maintain and operate accounts or letters of credit for any amount\nwith any bank or banks and to give instructions for operation of such accounts;\n(m)   to appear before any court law, civil, criminal, revenue, excise, income-tax\nincluding banking courts and tribunals established for recovery of bank dues\nand loans, whether original or appellate, High Courts and Supreme Court of\nPakistan and other authorities for and on behalf of the Corporation and to\ninstitute, apply for transfer of suits and other proceedings, conduct, prosecute\nand defend suits and legal proceedings whatsoever including original,\nappellate or any other jurisdiction, sign power of attorney or other\nauthorisation, statements, pleadings and petitions on behalf of the\nCorporation and to represent, defend and safeguard the interest of the\nCorporation;\n(n)   to enter into all such negotiations and contracts and rescind or vary all such\ncontracts and do all acts, deeds and things, in the name and on behalf of the\nCorporation as he may consider necessary, expedient or proper, or in relation\nto any of the matters aforesaid or otherwise, for the purposes of the\nCorporation;\n(o)   to give effectual discharge for moneys payable to the Corporation and for its\nclaims and demands;\n(p)     to purchase or take on lease or otherwise acquire for the Corporation, land,\nbuildings, rights and privileges for the purpose of offices or premises of the\nCorporation at such prices and generally on such terms as he may think\nnecessary and expedient, to build, alter and furnish offices, houses or premises\nand let or sub-let any such houses or premises in portion or otherwise;\n(q)     to demand and enforce payment, delivery, transfer of any dues for recovery\nand receive from all and every persons, body corporate or corporations, firm\nor companies whatsoever, all money, securities for money, debts and claims\nof all kinds and demand, enforce, deliver and receive and take possession of\nmoney, securities, shares, and goods produced and property of all kinds\nwhether belonging to the Corporation as security or in trust or held by any\nperson or company in trust or by way of security for the Corporation;\n(r)     to deal with, make arrangements, sign contracts with Government, semi\nGovernment, autonomous bodies, corporations, local Government and other\ninstitutions; and\n(s)     to appoint attorneys, agents, managers and authorise them to exercise any or\nall such powers and functions as are mentioned in clauses (a) to (r) above.\n(4) The Federal Government may, by notification in the official Gazette, remove the\nChief Executive if, —\n(a)     he refuses or fails to discharge or becomes in the opinion of the Federal\nGovernment, incapable of discharging his responsibilities under this\nOrdinance; or\n(b)     he has been declared insolvent; or\n(c)      he has been declared to be disqualified for employment in, or has been\ndismissed from the service of Pakistan, or has been convicted of an offence\ninvolving moral turpitude; or\n(d)      he has knowingly acquired or continued to hold without the permission in\nwriting of the Federal Government, directly or indirectly or through a partner,\nany share or interest in any obligor or financial institution."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Committees",
      "content": "The Board may, for the purpose of obtaining advice and assistance in\ncarrying out the purposes of this Ordinance, constitute one or more committees consisting of\nmembers of the Board and any other suitable persons as it may deem fit. Any committee so formed\nshall, in exercise of the powers delegated to it or conferred on it conform to any restrictions that may\nbe imposed on it by the Board."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Verification Committees",
      "content": "(1) For the purposes of this Ordinance and before taking any\naction thereunder, the Corporation shall, having regard to the facts and circumstances of a case, refer\na question of bona fide dispute relating to liability of the obligor in respect of the non-performing\nassets or cases relating thereto, including the cases of fraud, misrepresentation, and breach of any\nprovision of law, rule, regulation and circulars of the State Bank, regarding the calculation, existence\nand repayment of a financial obligation or outstanding loan, mark-up or interest claimed against an\nobligor, to the Governor State Bank for verification and correct determination and calculation by the\nVerification Committee as hereafter provided:\nProvided that the Corporation may in appropriate cases and having regard to the facts and\ncircumstances of a case require the Governor State Bank to include one or more suitable persons\nincluding an expert or consultant to be member of the Verification Committee.\n(2) The verification, determination and calculation of matters referred to in sub-section (1)\nshall be made in accordance with the existing law, rules, regulations and circulars of the State Bank\nin the manner provided herein in regard to the principal amount of loan, mark up, interest and\nancillary financial matters relating to the financial institutions as claimed by or against the financial\ninstitution or the Corporation, as the case may be, in respect of the non-performing assets and the\nliability of the obligor.\n(3) Save as provided in this Ordinance, the provisions of sub-sections (1) and (2) shall not\naffect the validity, continuance and enforcement of an order of winding up of a company under\nexcept for the purpose of calculating the payment of any financial obligation or verified claim to the\ncreditor or contributory or liability of the guarantor or any other person.\n(4) Where a matter is referred to the Governor State Bank under sub-sections (1) and (2), he\nmay constitute one or more Verification Committees for the purposes of this Ordinance.\n(5) The Verification Committee shall consist of a nominee of the Governor State Bank being\na senior officer of the State Bank who shall be the Chairman of the Committee, two Chartered\nAccountants, to be nominated by the Governor State Bank and one Chartered Accountant to be\nnominated by the Council of the Institute of Chartered Accountants of Pakistan, Karachi, such\nnomination to be obtained by the Governor State Bank and such other person as the Corporation may\nrequire.\n(6) The Chairman of the Verification Committee shall convene the meetings, conduct\nproceedings of the Committee, maintain record including the evidence submitted before him by\nthe parties and their statements and on their request supply authenticated copies of the record to them.\n(7) The Verification Committee after examination of the record of the concerned lending\nfinancial institution and the obligor and after due notice by courier service, fax, U.M.S. or any other\neffective mode to both parties and affording them reasonable opportunity to explain their position\nand hearing them in person and through their chartered accountants shall make correct determination,\nverification and calculation of liability and matters referred to in sub-sections (1), (2) and (3) in\naccordance with the law, rules, regulations and circulars of the State Bank.\n(8) Where a party after due notice under sub-section (7) does not appear in person or through\nchartered accountant before the Verification Committee, it may proceed ex-parte:\nProvided that nothing contained herein shall prevent such party from appearance before\nthe Verification Committee before the conclusion of the proceedings.\n(9) The Verification Committee shall submit its finding and report with recommendations to\nthe Governor State Bank within thirty days of the commencement of the proceedings or such\nextended period as the Governor State Bank may allow for reasons to be recorded in writing.\n(10) The Governor State Bank shall consider the findings and report and recommendations\nsubmitted to him by the Verification Committee under sub-section (9) and may accept or modify the\nsame or may, for reasons to be recorded, make such other appropriate recommendations and findings\nin respect thereof as he may deem fit.\n(11) The Governor State Bank shall forward his recommendations and findings made under\nsub-section (10) alongwith the finding, report, recommendations and record of the Verification\nCommittee to the Corporation and the parties will be entitled to obtain copies thereof from the\nCorporation.\n(12) The recommendations and findings of the Governor State Bank made on the basis\nof finding, report and recommendations of the Verification Committee in regard to calculation of\nliability of obligor shall be final and have presumption of truth unless found to contain manifest\nerror or contrary to law, but the same shall be subject to orders of the High Court.\n(13) The Corporation after considering the recommendations and findings of the Governor\nState Bank forwarded to it under sub-section (11) will take appropriate action under this Ordinance\nhaving regard to the facts of each case.\n(14) In the event of failure either of the Verification Committee to conclude the reference\nwithin thirty days of the commencement of the proceedings or such extended period referred to in\nsub- section (9) or the failure of the obligor or the financial institution to accept the recommendations\nand findings of the Governor State Bank, the Corporation may proceed in respect of the\nnon-performing asset under this Ordinance.\n(15) Notwithstanding anything contained in any other law for the time being in force, the\nfinal recommendations and findings by the Governor State Bank and the finding, report and the\nrecommendations of the Verification Committee under sub-section (11) shall constitute admissible\nevidence for any legal proceedings.\nExplanation.— For the purpose of this Ordinance any instructions given by the State Bank to\nany bank or financial institution for writing off any debt for the purpose of accounting of any such\nbank or financial institution shall not be construed as satisfaction of any debt payable by the obligor."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Guidelines for Corporation and the Governor State Bank",
      "content": "The Corporation, and\nwhere a matter is referred by it to Governor State Bank under sub-section (1) of section 10, the\nGovernor State Bank, shall take into consideration inter-alia the following factors as the Corporation,\nor as the case may be, the Governor State Bank, may deem fit having regard to the facts of each case,\nnamely: —\n(a)     the practical possibilities of the non-performing asset;\n(b)      the possibility of re-scheduling of financial assistance;\n(c)      the adequacy of the subsisting securities and the willingness of the obligor\nto provide sufficient additional security;\n(d)     such other preventive, ameliorative and remedial measures including\namalgamation or merger, change in management whether partial or whole or\nsuch incidental, consequential or supplemental measures as may be necessary;\n(e)      examine the possibility of keeping alive a running project by providing\nreasonable financial assistance through financial institutions keeping in view\nthe interest of both borrower and lender and avoiding unemployment;\n(f)    where the obligor can make financial arrangement on a joint venture basis\nwith a third person on mutually agreed terms so as to provide sufficient\nsecurity to the satisfaction of the Governor State Bank or the Board for\nrepayment of the outstanding amount or liability of the non-performing asset\nto be determined in accordance with the State Bank’s circulars, instructions,\nrules, regulations and the law; and\n(g)     any other, facts and circumstances having regard to public interest and the\nobjectives of the Ordinance."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Administration Committee",
      "content": "(1) The Administration Committee shall consist of the\nChief Executive and four other members of the Corporation to be appointed from the fields of\nbanking, law, finance, engineering, management or accountancy.\n(2) The minutes of every meeting of the Administration Committee shall be laid before the\nBoard at its meeting next following the meeting of the Administration Committee.\n(3) Subject to the superintendence, direction and control of the Board, the Administration\nCommittee may deal with any matter within the competence of the Board and may exercise such\npowers and perform such functions as may be assigned to it by the Board."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Members, officers and servants of the Corporation",
      "content": "(1) The Board shall appoint\nfour members of the Corporation in the fields of banking, law, finance, engineering, management\nor accountancy to assist the Corporation in the discharge of its function under this Ordinance. Each\nmember shall receive such salary and allowances, be subject to such conditions of service\nand removal, as may be prescribed by the rules.\n(2) The Corporation may appoint such officers and servants as it considers necessary for the\nefficient discharge of its functions on such terms and conditions as the Board may decide."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Meeting of the Board and the Administration Committee",
      "content": "(1) No business of the\nBoard or of the Administration Committee shall be transacted except at a meeting at which a\nquorum of a majority of the directors then appointed in the case of the Board, and three members\nin the case of the Administration Committee, are present.\n(2) The meetings of the Board and of the Administration Committee shall be held at such\ntimes and at such places as the Federal Government may, by rules, prescribe.\n(3) All meetings of the Board shall be presided over by the Chairman of the Board and of\nthe Administration Committee by the Chief Executive. In the absence of the Chairman of the Board\nat a Board meeting, the Chief Executive shall preside. In the absence of the Chief Executive at a\nmeeting of the Administration Committee, the meeting shall be presided over by a member\nauthorized in writing by the Chief Executive.\n(4) The decisions at the Board and the Administration Committee shall be taken by a\nmajority provided that such majority includes the presiding officer as mentioned in sub-section\n(3). At a meeting of the Board or of the Administration Committee, each director or member, as\nthe case may be, shall have one vote, and in the case of equality of votes, the presiding officer shall\nhave a second or casting vote.\n(5) A resolution in writing signed by the majority of the Board and the Chairman of the Board\nor the Administration Committee and the Chief Executive or affirmed by them through facsimile,\ntelex or telegram shall be as valid and effectual as if it had been passed at a meeting of the Board\nor the Administration Committee, as the case may be, duly convened and held."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Qualifications and disqualifications of directors",
      "content": "No person shall be, or shall\ncontinue to be, a director who-\n(a)     is or at any time has been adjudicated as insolvent;\n(b)     is found to be a lunatic or becomes of unsound mind;\n(c)     is or has at any time been convicted of any offence which, in the opinion of\nthe Federal Government, is an offence involving moral turpitude;\n(d)      absents himself from all the meetings of the Board, without leave of absence\nfrom the Board, for a continuous period of six months or, if less than three\nmeetings are held within such period, from three consecutive meetings of the\nBoard; and\n(e)     is a salaried official of the Corporation other than the Chief Executive."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Employees of the Corporation to be public servants",
      "content": "Every person in the service\nof the Corporation shall, when acting or purporting to act in pursuance of any of the provisions\nof this Ordinance, be deemed to be a public servant within the meaning of section 21 of the Pakistan\nPenal Code. 1860 (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Indemnity of members, directors, officers or servants",
      "content": "(1) A director shall not be\npersonally responsible for the acts of any other director or of any member or officer or servant of\nthe Corporation or for any loss or expenditure of the Corporation by reason of the insufficiency or\ndeficiency in value of or title to any property or security acquired or taken on behalf of the\nCorporation, or for anything done by him in good faith in the discharge of his duties.\n(2) No suit, prosecution or legal proceedings shall lie against the Corporation, the Chairman of\nthe Board, the Chief Executive, the directors, members or officers and servants of the Corporation,\nin respect of anything done or intended, to be done in good faith under this Ordinance.\n____________\nCHAPTER III. — POWERS AND FUNCTIONS OF THE"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Business which the Corporation can transact",
      "content": "Without prejudice to the\nprovisions of any other law for the time being in force and subject to the provisions of this\nOrdinance, the Corporation may exercise powers and functions as under: —\n(a)      to acquire, purchase, hold, manage, restructure, rehabilitate, sell and dispose\nof non-performing assets;\n(b)     to acquire, purchase, manage, restructure, rehabilitate, sell and dispose of\nany obligor being a corporation or a company;\n(c)     to purchase, take over, own, hold, sell, lease, arrange finance for, manage,\ndispose of, re-organize, restructure, rehabilitate and otherwise, enter into any\nsettlement or contract, realize, mortgage, hypothecate, control, manage any\nloan, finance, advance, commitment, lease installment, sale contract or other\nactivity relating to a non-performing asset;\n(d)     to purchase, take over, own, hold, sell, lease and otherwise dispose of,\nre-organize, restructure, rehabilitate and otherwise enter into any settlement or\ncontract, realize, pledge, mortgage, hypothecate, control, manage and arrange\nfinance for any asset, property, undertaking, collateral or security underlying\nor relating to or securing any financial asset or instrument, including any\nintellectual property, trade mark, equity, financial interest, legal and\ncontractual right, asset, guarantee and other undertaking;\n(e)     to initiate, take, continue, resist, implement and perform any and all activities\nfor the recovery of non- performing assets including filing suits and appeals\nand to enter into settlements, through the courts or outside, in respect thereof;\n(f)     to engage and enter into agreements with financial and other institutions, and\nfinancial, legal, accounting, valuation and other specialists, for the purposes\nof the business of the Corporation;\n(g)     to purchase, amalgamate, enter into partnerships, form joint ventures, make\nprofit sharing arrangements or co-operate or participate with any company or\nother entity for the business purposes of the Corporation;\n(h)     to borrow money and secure or discharge any debt or obligation binding on\nthe Corporation in such manner as may be thought fit, and in particular by\nmortgages of or charges upon all or any of the real and personal property,\npresent and future, of the Corporation or by the creation and issue, on such\nterms as may be deemed expedient, of debentures, term finance certificates,\nparticipation term certificates, or other redeemable capital as defined in the\nCompanies Ordinance, 1984 (XLVII of 1984) or other securities of any\ndescription;\n(i)   to sell, improve, manage, develop, exchange, mortgage, let or rent (for profit\nor royalty or otherwise), grant licences, easements, options, servitudes and\nother rights over and in any other manner deal with or dispose the real and\npersonal property, assets, rights and effects of the Corporation;\n(j)    to open and maintain the Corporation’s accounts with banks and financial\ninstitutions and to draw, make, endorse, accept, discount, executive and issue\npromissory notes, bills of exchange, bills of lading, warrants, participation\nterm certificates and other negotiable or transferable instruments;\n(k)    to establish or promote, or concur or participate in establishing, any\ncorporation or other entity whose objects shall include the acquisition of all or\nany of the property or liabilities of the Corporation, or the promotion of which\nmay seem, directly or indirectly, calculated to benefit the Corporation;\n(l)        to enter into any agreement with any authorities, Federal, Provincial,\nautonomous, semi- autonomous, municipal, local or otherwise that may seem\nconducive to the Corporation's objects or any of them, and to obtain from\nany such authority, rights, privileges and concessions which the Corporation\nmay deem desirable to obtain and to carry out, exercise and comply with any\nsuch arrangements, rights, privileges and concessions; and\n(m)        all powers enumerated in sub-section (3) of section 8 entrusted to the Chief\nExecutive."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Corporation not to be a banking company",
      "content": "Without prejudice to the provisions\nof section 32, the Corporation shall be deemed not to be engaged in the business of banking for\npurposes of the Banking Companies Ordinance, 1962 (LVII of 1962), or, as the case may be, the\nState Bank of Pakistan Act, 1956 (Act XXXII of 1956)."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Financial Institutions to which the provisions of this Ordinance shall apply",
      "content": "1\n[The Federal Government may, by notification in the official Gazette include in the schedule the\nname of any financial institution as defined in sub-clause (1) of section 2.]"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Consideration for transfer of non",
      "content": "performing assets. — The Corporation shall\npay to the concerned financial institution the outstanding amount as consideration for the transfer\nof non-performing assets by mutual agreement upon such terms and conditions and in such manner\nas may be prescribed by rules to be notified in the official Gazette."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Bonds issued by the Corporation",
      "content": "(1) The payment obligations in respect of any\nbonds issued by the Corporation pursuant to mutual agreement between the Corporation and the\nfinancial institution shall bear the full faith and credit of the Islamic Republic of Pakistan.\nRecourse for payment of such bonds, in accordance with their respective terms, may be against the\nCorporation or directly against the Federal Government without the necessity of notice to or prior\ndemand on the Corporation. The tenure of the bonds shall not exceed five years from the date of\nissuance.\n(2) At the request of the Corporation, the appropriate representatives of the Federal\nGovernment shall execute and deliver, on behalf of the Federal Government, any bonds presented to\nthem by the Corporation to evidence the full faith and credit obligation of the Federal Government.\n(3) Any bond issued by the Corporation to a financial institution shall also constitute an\napproved investment for purposes of the liquidity and reserve requirements under the Banking\nCompanies Ordinance, 1962 (LVII of 1962).\n______________________________________________________________________________\n1\nSubs. by the Corporate and Industrial Restructuring Corporation (Amdt.) Act, 2005 (3 of 2005) s. 4 for section 20."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Certain rights and remedies",
      "content": "(1) In addition to the provisions of this Ordinance or\nany other law for the time being in force, the Corporation shall, for the rehabilitation, management\nand restructuring of the obligor in respect of whom any non-performing assets and collateral are held\nby it or on its behalf, have the following powers, rights and remedies, each of which shall be\nindependent and in addition to the others, namely: —\n(a)      the Corporation may request the Commission as provided in section 295 of the\nCompanies Ordinance, 1984 (XLVII of 1984) to take action under section 295\nof the said Ordinance if it is of the opinion that the condition of the obligor\nwarrants such action. The Commission may in pursuance of the said section\nand after complying with its requirements and giving the obligor an\nopportunity to be heard, appoint the Chief Executive or his nominee as an\nAdministrator, hereinafter referred to as the Administrator, to manage the\naffairs of the obligor;\n(b)      all the provisions of section 295 of the Companies Ordinance, 1984 (XLVII of\n1984) shall apply, as far as possible, to the functioning of the Administrator as\nstated herein; and\n(c)     the Corporation shall be entitled to apply to the Commission to avail the\nbenefits of section 296 of the Companies Ordinance, 1984 (XLVII of 1984)."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Powers of the Corporation to seek assistance",
      "content": "(1) The Corporation shall have the\npower to seek assistance and information from any department of the Federal Government or a\nProvincial Government, local authority, financial institution, law enforcement agencies including\nthe police and the Federal Investigation Agency, patwari, mukhtiarkar, registrar of assurances and\nthe Commission and it shall be the duty of such department, local authority, financial institution,\nlaw enforcement agency, registrar of assurances and the Commission to render such assistance or\nfurnish such information as it may reasonably require.\n(2) Any information required under sub-section (1) shall only be used for the purpose of\nthe Corporation and shall not be divulged to any other person.\n_________\nCHAPTER IV. —FINANCE"
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Corporation Fund",
      "content": "(1) There shall be a fund to be known as the “Restructuring\nCorporation Fund” vested in the Corporation which shall be utilised by the Corporation to meet\ncharges in connection with its functions under this Ordinance including the payment of salaries\nand other remunerations to the Chief Executive and members of the Corporation and to its officers\nand servants.\n(2) The Corporation fund shall consist of,—\n(a)      funds provided by the Federal Government;\n(b)      allocations made by the Federal Government from the Federal Consolidated\nFund or any other source available with the Federal Government;\n(c)      loans obtained from the Federal Government;\n(d)      loans obtained by the Corporation with the special or general sanction of\nthe Federal Government;\n(e)      foreign aid and loans obtained with the sanction of, and on such terms and\nconditions as may be approved by the Federal Government;\n(f)      recovery fees collected by the Corporation from financial institutions; and\n(g)      all other sums received by the Corporation including income from investments."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Accounts and audit",
      "content": "(1) The financial year of account of the Corporation shall be the\nyear commencing the first day of July and ending the last day of June.\n(2) Subject to sub-section (1), the Corporation shall maintain its accounts in such manner as\nthe Federal Government may, in consultation with the Auditor General of Pakistan, prescribe.\n(3) The accounts of the Corporation shall be audited by one or more auditors who are\nchartered accountants within the meaning of the Chartered Accountants Ordinance, 1961(X of 1961),\nappointed by the Corporation."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Reserve fund",
      "content": "The Corporation shall establish a reserve fund to which shall be\ncredited its annual recoveries.\n_________\nCHAPTER V. — BUDGET STATEMENT AND ANNUAL REPORT"
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Budget Statement",
      "content": "(1) The Corporation shall, in respect of each financial year, prepare\nits own budget and submit to the Federal Government three months before the commencement of\nevery financial year for allocation of funds required before the commencement of every financial\nyear.\n(2) The budget statement shall specifically state the estimated receipts and expenditure and\nthe sums which are likely to be required by the Corporation from the Federal Government for\nthe relevant financial year.\n(3) Any surplus of receipts over the actual expenditure in a year shall be remitted to the\nFederal Consolidated Fund and any deficit from the actual expenditure shall be made up by the\nFederal Government.\n(4) Notwithstanding the provisions of sub-section (1) the Corporation may apply to the\nFederal Government for a supplementary grant during the financial year for sufficient reason."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Annual report to the Federal G o v e r n m e n t",
      "content": "Within one hundred and eighty days\nof the end of each financial year of the Corporation, the Board shall prepare a presentation to the\nFederal Government with respect to the financial performance and results of operations of the\nCorporation for the preceding financial year and the overall policies and goals of the Corporation.\n___________\nCHAPTER VI. — RULES AND REGULATIONS"
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Power of Fed eral Government to m a k e rules",
      "content": "The F e d e r a l G o v e r n m e n t\nm a y, b y notification in the official Gazette, make rules for carrying out the purposes of this\nOrdinance."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Power of the Board to make regulations",
      "content": "(1) The Board may make regulations not\ninconsistent with the provisions of this Ordinance and the rules made hereunder to provide for\nall matters for which provision is necessary or expedient for carrying out the purposes of this\nOrdinance.\n(2) In particular and without prejudice to the generality of the foregoing power, such\nregulations may provide for,—\n(a)     the manner and terms of issue and redemption of bonds and debentures by the\nCorporation;\n(b)     the form of returns and statements required to be prepared under this Ordinance;\n(c)     the duties and conduct of officers and servants and agents of the Corporation;\nthe recruitment of officers and staff of the Corporation, the terms and\nconditions of their service, the constitution and management of provident or\nother funds for the officers and staff of the Corporation connected with any of\nthese things;\n(d)     the disclosure of interest, direct or indirect of any director or any member of\nthe Administration Committee in any financial institution or obligor;\n(e)     the manner in which the handing over of all original documents and files\nfrom the financial institution to the Corporation will take place; and\n(f)     generally for the efficient conduct of the affairs of the Corporation.\n__________\nCHAPTER VII. — RIGHTS AND REMEDIES OF CORPORATION"
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Rights and remedies available to Corporation",
      "content": "(1) In respect of any\nnon-performing asset held by the Corporation and any collateral, the Corporation shall be entitled\nto exercise and shall have all rights and remedies available to a banking company under the Code\nof Civil Procedure (Act V of 1908), Banking Companies Ordinance, 1962 (LVII of 1962), the\nOffences in Respect of Banks (Special Courts) Ordinance, 1984 (IX of 1984), and the Banking\nCourts (Recovery of Loans, Advances, Credits and Finances) Act, 1997 (Act XV of 1997) and shall\nalso have the rights and remedies available under the Companies Ordinance, 1984 (XLVII of 1984,\nXLVII of 1984), and further all recoveries by the Corporation in pursuance of this Ordinance shall\nbe made in accordance with the aforesaid laws.\n(2) It is declared that the Corporation shall be entitled to the the rights, title, interest,\nbenefits, privileges of a financial institution as specified in the Schedule subject to the terms of\nmutual agreement between the Corporation and the Financial Institutions specified in the\nSchedule and likewise the Corporation shall be subject to the legal liability, if any, of the Financial\nInstitutions.\n(3) All acts pursuant to and in exercise of the powers under this Ordinance and rights\nand remedies thereunder shall be done performed and pursued in accordance with the provisions\nof the prevailing law inter-alia as set out in sub-section (1)."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Rights and remedies not exhaustive",
      "content": "The rights and remedies provided to the\nCorporation under this Ordinance may be exercised separately or concurrently by the Corporation\nand are in addition to, and not in lieu or derogation of, any other rights or remedies the Corporation\nor any other person may legally have in respect of any non-performing assets of the obligor and\nany related collateral."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Exemption from taxes",
      "content": "Notwithstanding anything contained in any other law for the\ntime being in force, the Federal Government may exempt Corporation from the payment of, all\nor any other taxes, duties, levies, charges and fees payable under or pursuant to any Federal law, on\nits investment, income, assets or wealth."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Liquidation of the Corporation",
      "content": "(1) The Corporation shall have a life of six years\nfrom the date of commencement of this Ordinance which may be extended further by the Federal\nGovernment by law. The Corporation may be wound up by order of the Federal Government in\nsuch manner as it may direct, or under the orders of the competent court.\n(2) Notwithstanding anything contained in sub-section (1) or any other provision of this\nOrdinance or the agreement between the Corporation and the Financial institutions concerned and\nfurther in case the Corporation is wound up at any time prior to the expiry of the third year of its\nexistence, all non-performing assets at that time shall be deemed transferred, assigned, sold\nand conveyed back hereunder to the financial institution by the Corporation with immediate effect\nand without the necessity of any further action or instrument.\n(3) On the winding up of the Corporation, the bonds issued by the Corporation, if any\nunder section 21, shall be deemed to be bonds as if they were issued directly by the Federal\nGovernment and the winding up of the Corporation shall in no way affect the ability of the holder\nof the bond to receive full payment in terms of the bond.\n______________\nCHAPTER VIII . — GENERAL"
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Limitation of liability",
      "content": "The Corporation shall not have any liability to any financial\ninstitution save in accordance with law."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Right of recovery as arrears of land revenue",
      "content": "The Corporation shall be entitled\nto recover all outstanding amounts, subject to law, on the basis of and under any non-performing\nassets held by the Corporation as if they are arrears of land revenue under the Land Revenue Act,"
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Power to obtain information and documents etc",
      "content": "(1) The Corporation may call\nupon any person, authority, agency, bank or financial institution to furnish any information,\ndocuments, papers and accounts it may require for the purposes of this Ordinance.\n(2) Any person who does not or fails to furnish the information, documents, papers and\naccounts required by the Corporation under sub-section (1) shall be punishable with imprisonment\nof either description for a term which may extend to one year, or with fine or, with both."
    }
  ],
  "definitions": [
    {
      "term": "Administration Committee",
      "definition": "the administration committee established under section 12;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of directors constituted under section 6;",
      "source_provision": "sec2"
    },
    {
      "term": "book value",
      "definition": "the rupee amount, inclusive of principal and accrued profit, owed by any obligor in connection with any financial asset as reflected on the books and records of the financial institution, as of the transfer date;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the chairman of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "Chief Executive",
      "definition": "the Chief Executive Officer of the Corporation;",
      "source_provision": "sec2"
    },
    {
      "term": "collateral",
      "definition": "any asset, property, right, claim, entitlement, share, undertaking, guarantee, agreement, document or instrument, security interest, charge, mortgage, lien, hypothecation, pledge or assignment in respect of or as security for any financial asset;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the Securities and Exchange Commission of Pakistan established under section 3 of the Securities and Exchange Commission of Pakistan Act, 1997 (XLII of 1997);",
      "source_provision": "sec2"
    },
    {
      "term": "Corporation",
      "definition": "the Corporate and Industrial Restructuring Corporation established under section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "director",
      "definition": "a director of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "financial asset",
      "definition": "any short, medium or long term interest and non-interest bearing loan, finance, advance, lease, installment, term finance certificate, participation term certificate, musharaka, modaraba, profit and loss sharing agreement, redeemable capital, guarantee or contractual right to receive payment of money in respect of sums advanced or committed to an obligor by a financial institution including collateral pertaining thereto; 1 [(l) “Financial Institution” means any bank or other financial institution operating in Pakistan wherein the Federal Government holds any equity.]",
      "source_provision": "sec2"
    },
    {
      "term": "Government entity",
      "definition": "any Ministry, Division, Department or office of the Federal Government or any corporation, company, trust, statutory body or other entity of which more than fifty per cent of the equity or beneficial interest is directly or indirectly owned or controlled by the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "non-performing asset",
      "definition": "any financial asset: (a) which is held as an asset on the books of a financial institution; (b) with respect to which the obligor has been in arrears on any payment obligation for a period more than three hundred and sixty-five days, including— _________________________________________________________________________________________________________________________ 1 Subs. by the Corporate and Industrial Restructuring Corporation (Amdt.) Act, 2005 (3 of 2005) s. 2 for clause (1). (i) collateral with respect to any financial asset; and (ii) a whole or partial right or interest of a financial institution in any financial asset, that otherwise constitutes a non-performing asset including a financial asset with respect to which the financial institution has an ongoing funding obligation; and 1 [(c) with respect to which the obligor’s outstanding payment obligation to any financial institution exceeds thirty million rupees: Provided that the Federal Government may, by notification in the official Gazette, alter, reduce or increase the said amount as and when it deems fit.]",
      "source_provision": "sec2"
    },
    {
      "term": "obligor",
      "definition": "any individual, proprietorship concern, company or other body corporate, trust, partnership or other entity that has, with respect to a non-performing asset, a contractual or legal obligation or duty to make payment, effect performance, provide security, or collateral with respect to any financial asset whether as principal, surety, guarantor or otherwise and whether such obligation is primary, secondary, matured or contingent;",
      "source_provision": "sec2"
    },
    {
      "term": "outstanding amount",
      "definition": "the book value of a non-performing asset of the financial institution less, — (a) any amount on the books of the financial institution appearing as a specific reserve applicable to that non-performing asset; (b) any amount on the books of the financial institution appearing in a general loan loss and/or other reserve applicable to that non-performing asset; and if, in the opinion of the Board, the book value of the non-performing asset, as adjusted in sub-clauses (a) and (b), is higher than the estimated market price of the non-performing asset, the Board shall commission an independent evaluator to determine such market price and in the event that the market price as determined by the independent evaluator is lower than the book value as adjusted in sub-clauses (a) and (b), such market price shall be deemed to be the outstanding amount;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "Schedule",
      "definition": "the Schedule to this Ordinance; and",
      "source_provision": "sec2"
    },
    {
      "term": "State Bank",
      "definition": "the State Bank of Pakistan. ________________________________________________________________________________ 1 Subs. by the Corporate and Industrial Restructuring Corporation (Amdt.) Ordinance, 2000 (57 of 2000) s. 2 for the original sub-clause (c).",
      "source_provision": "sec2"
    }
  ]
}
