{
  "id": "pk-corporate-rehabilitation-act-2018",
  "type": "statute",
  "title": "Corporate Rehabilitation Act, 2018",
  "title_en": "Corporate Rehabilitation Act, 2018",
  "short_name": "CRA",
  "status": "in_force",
  "issued_date": "2018-03-15",
  "in_force_date": "2018-03-15",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NobJk%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Corporate Rehabilitation Act, 2018 (IX of 2018) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(l) This Act shall be called the Corporate\nRehabilitation Act, 2018.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once.\nPreliminary"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the subject or context,—\n(a)   “administrator” means an administrator appointed under section 20;\n(b)   “administration committee” means the committee of the creditors or shareholders\nof the debtor appointed under section 26;\n(c)   “claim” or “debt” means right to payment, whether or not such right is reduced\nto judgment, liquidated, unliquidated, fixed, contingent, matured, disputed,\ndisputed, legal, secured or unsecured and includes principal amount and any\nmark-up, profit, return and other charges;\n(d)   “Commission” means the Securities and Exchange Commission of Pakistan\nestablished under the Securities and Exchange Commission of Pakistan Act, 1997\n(XLII of 1997);\n(e)   “Court” means the High Court having territorial jurisdiction;\n(f)   “creditor” means an entity that has a claim against debtor that arose at the time of\nor before the commencement of a case under this Act;\n(g)   “debtor” means a company specified under section 6;\n(h)   “financial institution” shall have the same meaning as assigned to it under the\nFinancial Institutions (Recovery of Finances) Ordinance, 2001 (XLVI of 2001);\n(i)   “insolvency expert” means the expert specified under section 5;\n(j)   “interests” or “class of interests” means any person or class of persons liable to\ncontribute to the assets of a company in the event of its being wound up and\nincludes the holder of any shares which are fully paid up;\n(k)   “mediator” means the mediator appointed under section 10;\n(l)   “Ordinance” means the Companies Ordinance, 2016 (VI of2016) or such other\nlaw in force for regulations of companies;\n(m) “order of mediation” means the order passed by the Court under section 10;\n(n)   “plan of rehabilitation” means a plan of rehabilitation of debtor defined under\nsection 7;\n(o)   “prescribed” means prescribed by rules or regulations made under this Act;\n(p)   “property” means property of all description, whether movable or immovable,\ntangible or intangible, existing or future, claims for money, cash, and includes\ninstruments that evidence title in property;\n(q)   “qualifying creditors” means one or more creditors holding unpaid and overdue\nclaims for an aggregate amount of not less than two-third of the value of assets\nof the debtor as per its latest balance sheet;\n(r)   “regulations” means regulations made under this Act;\n(s)   “rules” means rules made under this Act;\n(t)   “security interest” means a charge, mortgage, lien, hypothecation, pledge,\nassignment or any other encumbrance over a property;\n(u)   “State Bank” shall have the same meaning as assigned to it under the State Bank\nof Pakistan Act, 1956 (XXXIII of 1956); and\n(v)   “statement of affairs” means statement of particulars about the property and\nbusiness of a debtor prepared under section 9.\n(2) The words and expressions used but not defined in this Act shall have the same meaning\nas assigned to them in the Ordinance."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Jurisdiction and powers of High Court",
      "content": "(1) The Court having jurisdiction under this\nAct shall be the High Court having jurisdiction over the place at which the registered office of the\ndebtor or, as the case may be, the principal place of business of the debtor is situated.\n(2) Subject to the provisions of this Act, the Court shall,—\n(a)     in exercise of its civil jurisdiction, have all the powers vested in a civil court\nunder the Code of Civil Procedure, 1908 (Act V of 1908);\n(b)     in exercise of its criminal jurisdiction, have all the powers vested in a court\nexercising jurisdiction under the Code of Criminal Procedure, 1898 (Act V of\n1898); and\n(c)     in exercise of its company jurisdiction, have all the powers vested in a court\nexercising jurisdiction under the Ordinance.\n(3) Notwithstanding anything contained in any other law, all matters coming before the Court\nunder this Act shall be disposed of expeditiously and final judgment shall be pronounced as soon as\nmay be practicable and, except in extraordinary circumstances, the Court shall hear the case on day to\nday basis."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Appeal and review",
      "content": "(1) An appeal shall lie, at the instance of any person aggrieved by\nan order made by a Judge of the High Court in the exercise of the jurisdiction conferred by this Act,\nin the same way and subject to the same provisions as an appeal lies against an order passed by a single\nJudge of that Court in exercise of its original civil jurisdiction.\n(2) The Court may review, rescind or vary any order made by it under this Act."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Insolvency experts",
      "content": "(1)The Commission shall, in consultation with the State Bank,\nmaintain a panel of insolvency experts who shall be professionals having a minimum experience of\nfifteen years in the field of accountancy, banking, finance, law, management and sound knowledge of\ninsolvency practices of the country.\n(2) An insolvency expert shall, for due performance of his functions under this Act, be entitled\nto such remunerations and privileges as may be prescribed by regulations.\n(3) The Commission may, by regulations, prescribe the code of conduct for the panel of\ninsolvency experts to be appointed under this Act and organize training, capacity building and\naccreditation programmes for professional development of such insolvency experts.\nRehabilitation of Debtor"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Debtor",
      "content": "A debtor shall be a company incorporated or registered under the Ordinance or\nprevious companies legislation and shall not include—\n(a)   a financial institution;\n(b)   a company engaged in the business of insurance as defined in clause (xxvii) of\nsection 2 of the Insurance Ordinance, 2000 (XXXIX of 2000);\n(c)   a company which has debts of less than hundred million Rupees or such other\nsum as the Federal Government may, by notification in the official Gazette,\nspecify from time to time;\n(d)   a company against which an order of dismissal under section 17 has been passed\nwithin the past five years;\n(e)   a company with respect to which a plan of rehabilitation has been confirmed\nunder this Act within the past seven years;\n(f)   a company against which a winding up order has already been passed;\n(g)   a company which has resolved by special resolution that such company be wound\nup voluntarily;\n(h)   a company against which execution proceedings are pending for satisfaction of\none or more decrees for an aggregate sum not less than twenty-five percent of the\nvalue of its assets; or\n(i)   a company which has availed relief under the BPD Circular No. 29 of 2002 issued\nby the State Bank."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Plan of rehabilitation",
      "content": "(l) A plan of rehabilitation shall specify the following matters in\nrelation to a debtor,—\n(a)   claims and classes of claims against the debtor;\n(b)   interests and classes of interests in the debtor;\n(c)   claims and interests belonging to the debtor;\n(d)   claims or interests that will not be impaired under the plan of rehabilitation;\n(e)   claims or interests that will be impaired under the plan of rehabilitation;\n(f)   places of business of the debtor, details of its assets and any security interests\ncreated over such assets;\n(g)   particulars of shareholders, directors and key management of the debtor; and\n(h)   scheme of implementation of the plan of rehabilitation of the debtor.\n(2) Subject to sub-section (1), a plan of rehabilitation may provide for the following matters,\nin relation to a debtor,—\n(a)   the settlement, restructuring or rescheduling of any claims or interests or classes\nof claims or interests;\n(b)   the change of ownership and management of the debtor;\n(c)   the sale of all or any assets of the debtor and the distribution of proceeds of such\nsale among holders of claims or interests;\n(d)   the assumption, rejection or assignment of any executory contract or unexpired\nlease of the debtor;\n(e)   the enforcement of any claims or interests belonging to the debtor; and\n(f)   any other matter concerning rehabilitation of the debtor or distribution of\nproceeds of sale of property of the debtor."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Commencement of a case",
      "content": "(1) A debtor may file a petition in the Court for an order of\nmediation, which shall be supported by a plan of rehabilitation, statement of affairs and special\nresolution of the debtor approving the plan of rehabilitation.\n(2) The qualifying creditors may file a petition in the Court for an order of mediation against a\ndebtor.\n(3) On first date of hearing, the Court shall issue notice to the parties listed in the petition\nthrough,—\n(a)   registered post, acknowledgement due;\n(b)   courier service; and\n(c)   publication in one English language and one Urdu language daily newspaper of\nwide circulation in the country;\nand service duly effected in any one of the aforesaid modes shall be deemed to be valid service for the\npurposes of this Act.\n(4) The notice issued under sub-section (3) shall specify a date of hearing not later than twenty-\none days after completion of the service.\n(5) Any person interested of filing a written reply to the petition shall do so at least three days\nprior to the hearing and supply a copy of such reply to the party that filed the petition.\n(6) The Court may, where a prima facie case has been made out by the qualifying creditor for\nan order of mediation in relation to a petition filed under sub-section (2), direct—\n(a)   the debtor to submit, within fifteen days, the statement of affairs in the Court; and\n(b)   the qualifying creditor to submit, within thirty (30) days after submission of the\nstatement of affairs, a plan of rehabilitation of the debtor in the Court."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Statement of affairs",
      "content": "(1) The statement of affairs of a debtor shall be verified by an\naffidavit of the chief executive officer or a director of the debtor and shall contain the following\nparticulars, namely,—\n(a)   the assets, debts and liabilities of the debtor;\n(b)   the particulars of the creditors, stating separately the amount of secured debts and\nunsecured debts and in the case of secured debts, particulars of the securities\ngiven, their value and the dates when they were given;\n(c)   the debts due to the debtor and the particulars of the persons from whom such\ndebts are due and the amount likely to be realized therefrom;\n(d)   where any property of the debtor is not in its custody or possession, the place\nwhere and the person in whose custody or possession such property is;\n(e)   full address of the places where the business of the debtor was conducted during\nsix months preceding the relevant date and the names and particulars of the\npersons in charge of the same;\n(f)   details of any pending suits or proceedings in which the debtor is a party;\n(g)   latest publically disclosed accounts and the last audited accounts; and\n(h)   such other particulars as may be prescribed by regulations or as the Court may by\norder require.\n(2) Whoever intentionally files a statement of affairs which is false in material particulars or\nfalsely denies his signature on any document before the Court, or fails to file the statement of affairs\nwithout just excuse when so ordered by the Court, shall be guilty of an offence punishable with\nimprisonment of either description for a term which may extend to six months, or with fine, or with\nboth."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Mediation",
      "content": "(1) The Court may, after notice and a hearing of the petition filed under\nsection 8, pass an order for the appointment of insolvency experts to act as sole mediator or joint\nmediators, as the case may be, in relation to the plan of rehabilitation filed in the Court.\n(2) The mediator appointed by the Court shall carry out mediation between the debtor and\ncreditors or different classes of creditors to achieve acceptance of the plan of rehabilitation, whether\nwith or without any modifications.\n(3) For due discharge of his functions under this Act, a mediator shall have the following\npowers,—\n(a)   to hold separate meetings of shareholders of the debtor and creditors or different\nclasses of creditors;\n(b)   to invite, scrutinize and determine claims and interest against the debtor;\n(c)   to determine security interests created over the debtor’s assets;\n(d)   to determine the debtor’s assets available for satisfaction of the claims of the\ncreditors;\n(e)   to carry out valuation of the assets of the debtor through professional experts\napproved by the State Bank; and\n(f)   any other power given by the Court, either on its own accord or on application of\nthe Mediator, to carry out the functions under sub-section (1).\n(4) A mediator shall, from the date of his appointment, submit monthly progress reports and\nmay refer any matter to Court for appropriate directions including for the purposes of—\n(a)   production of any records or property of the debtor in possession of any person;\nand\n(b)   examination and attendance of any person concerned with affairs of the debtor.\n(5) The person filing the petition shall provide necessary funds to allow the mediator to perform\ndirections in this regard."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Notice of order of mediation",
      "content": "(1) The person filing the petition under this Act shall\nprovide the notice of the order of mediation to all interested parties within three days of the order\nthrough,—\n(a)   registered post, acknowledgement due;\n(b)   courier service; and\n(c)   publication in one English language and one Urdu language daily newspaper of\nwide circulation in the country;\nand service duly effected in any one of the aforesaid modes shall be deemed to be valid service for the\npurposes of this Act.\n(2) The notice of order of mediation shall specify the appointment of mediator and for filing\nof any claims against, and interests in, the debtor with the mediator within a period of fourteen days\nof publication of notice of the order of mediation."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Stay of actions against debtor",
      "content": "(1) In a case commenced under this Act, the Court may,\non an application made to it by the debtor or an interested person, pass an order after notice and a\nhearing for—\n(a)   preservation of assets of the debtor in such manner as the Court may deem fit in\nthe circumstance of the case; and\n(b)   protection of the debtor or its shareholders, directors and guarantors,\nAgainst any imminent adverse action, measure, process or proceeding commenced to recover a claim\nagainst the debtor or its shareholders, directors and guarantors through sale, transfer, repossession or\nmortgage of assets of the debtor or its shareholders, directors and guarantors, or by creating any rights\nor interests in relation to such assets.\n(2) The stay granted under sub-section (1) shall, if not earlier vacated, ipso facto cease to have\neffect on,—\n(a) the confirmation of a plan under section 14; or\n(b) the dismissal of the case under section 17.\n(3) Notwithstanding anything contained in sub-section (2), the Court may, on application of\nthe qualifying creditors or an interested party and after notice and a hearing, grant such relief from the\nstay granted under sub-section (l) as may be necessary to prevent irreparable harm or loss to the interest\nof that party."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Acceptance of plan of rehabilitation",
      "content": "(1) The acceptance or rejection of a plan of\nrehabilitation shall not be solicited from a holder of a claim or interest unless such holder is first\nprovided with a copy of the plan.\n(2) A class of creditors shall be deemed to have accepted a plan of rehabilitation if such plan\nis accepted by the creditors holding at least two-thirds in value of such class.\n(3) A class of interests of the debtors, shall be deemed to have accepted a plan of rehabilitation\nif such plan is accepted by holders of at least two-thirds in value of interests of such class.\n(4) A class that is not impaired under a plan of rehabilitation and each holder of a claim or\ninterest of such class are conclusively presumed to have accepted the plan and solicitation of\nacceptance with respect to such class from the holders of claims or interests of such class is not\nrequired."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Confirmation of a plan of rehabilitation",
      "content": "(1)The Court may, after notice and a hearing,\nconfirm a plan of rehabilitation if the plan is in accordance with the provisions of this Act and\n(a) with respect to each class of claims or interests,—\n(i) such class has accepted the plan; or\n(ii) such class is not impaired under the plan; and\n(b) except to the extent that the holder of a particular claim has agreed to a different\ntreatment of such claim, the plan provides that the holder of such claim will receive\ncash equal to the allowed amount of such claim.\n(2) The provisions of a plan of rehabilitation confirmed by the Court bind the debtor, any entity\nissuing securities under the plan, any entity acquiring property under the plan and any creditor or\nshareholder of the debtor, whether or not the claim or interest of such creditor or shareholder is\nimpaired under the plan and whether or not such creditor or shareholder has accepted the plan.\n(3) The Court may refuse to confirm a plan if the principal purpose of the plan is avoidance of\ntaxes, duties and fiscal charges levied under law."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Implementation of plan of rehabilitation",
      "content": "(1) The Court may, on the application of the\ndebtor or qualifying creditors and after notice and a hearing, pass such directions as deemed\nappropriate for the purposes of implementation of the plan of rehabilitation and any person responsible\nfor carrying out the plan or any part thereof shall comply with such directions.\n(2) The Court may direct the debtor and any other necessary party to execute or deliver or to\njoin in the execution or delivery of any instrument required to effect a transfer of property dealt with\nby a plan of rehabilitation confirmed by the Court and to perform any other act, including the\nsatisfaction of any charge, that is necessary for the consummation of the charge."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Revocation of confirmation of a plan of rehabilitation",
      "content": "(1) The Court may, on the\napplication of any person aggrieved by the plan of rehabilitation, at any time within twelve months of\nthe date of confirmation of the plan and after notice and a hearing, make an order, upon such terms as\nthe Court thinks fit declaring the confirmation to have been void.\n(2) The Court may pass an order under sub-section (1) if the order of confirmation to be\ndeclared void was procured by fraud.\n(3) An order under this section revoking an order of confirmation shall provide for all such\nmeasures as are necessary to protect any entity which has acquired rights in good faith reliance on the\norder of confirmation."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Dismissal of a case",
      "content": "(1) Notwithstanding anything to the contrary in this Act, the Court\nmay, on the application of any person concerned with the debtor or on its own accord, dismiss a case\nor may suspend all proceedings in a case under this Act at any time, if the Court determines that—\n(a) the continuation of proceedings would amount to an abuse of the judicial process;\n(b) the person filing the petition has failed to provide necessary funds for mediation\nafter getting due opportunity in this regard; and\n(c) the mediator has not been able to fully perform one or more of the functions\nspecified in section 10 within a period of twelve months from his appointment.\n(2) Unless the Court for any reason orders otherwise, the dismissal of a case does not affect\n(3) Unless the Court for any reason orders otherwise, the dismissal of a case shall:\n(a) re-instates,—\n(i) any proceeding or custodianship superseded under this Act;\n(ii) any transfer avoided under this Act; and\n(iii) any charge voided under this Act;\n(b) vacates any order or transfer ordered under this Act; and\n(c) re-vests the property of the estate in such person in which such property was vested\nbefore the commencement of the case under this Act."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Conversion of a case",
      "content": "(1) A case under this Act may, on an application made to the\nCourt, be converted into winding up proceedings for the following reasons:—\n(a) failure to achieve the acceptance of plan of rehabilitation in twelve months from\nappointment of an administrator except where the administrator has been removed\nunder section 22; or\n(b) the Court finds that a petition under this Act was filed by the debtor for fraud lent\npurposes.\n(2) The order of conversion under this section shall also provide for the appointment of a\nliquidator and the Court shall for such purpose exercise necessary jurisdiction under the Ordinance.\n(3) An administrator appointed in a case under this Act shall not be appointed as liquidator in\nthat case.\n(4) An application for conversion under this section shall not be filed by any party except—\n(a) the debtor;\n(b) the qualifying creditors; or\n(c) the administrator appointed in the case."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Consequences of conversion",
      "content": "(1) Notwithstanding any provision of the Ordinance, an\norder of conversion under section 18 shall be deemed to be a winding up order by the Court under the\nOrdinance and the winding up of the debtor shall be deemed to have commenced on the date of\ncommencement of the case under this Act.\n(2) Except as provided in sub-section (3), all proceedings subsequent to an order of conversion\nunder section 18 shall be carried out in accordance with the provisions of the Ordinance, including the\nfiling of appeal against such order and other remedies provided therein.\n(3) Following an order of conversion, a financial institution may initiate or continue with\nproceedings under the Financial Institutions (Recovery of Finances) Ordinance, 2001 (XLVI of 2001)\nwithout seeking permission from the Court under the Ordinance.\nAdministration of Debtor"
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Appointment of administrator",
      "content": "(1) The Court may, on a petition made by the qualifying\ncreditors and after notice and a hearing, appoint an insolvency expert as administrator of the debtor at\nany time before confirmation of a plan of rehabilitation for one or more of the following reasons\nnamely:—\n(a)   the affairs or business of the debtor have been conducted or managed in a manner\nlikely to be prejudicial to the interest of the debtor or qualifying creditors;\n(b)   any director of the debtor or person concerned with the management of the debtor\nhas been guilty of breach of trust, misfeasance or other misconduct towards the\ndebtor or qualifying creditors;\n(c)   the affairs or business of the debtor have been conducted or managed with intent\nto defraud its shareholders or qualifying creditors or for a fraudulent or unlawful\npurpose, or in a manner oppressive of shareholders or qualifying creditors;\n(d)   the affairs of the debtor have been so conducted or managed as to deprive the\nqualifying creditors of their claims against the debtor in full or in part.\n(e)   any project owned by the debtor is not in operation for over a period of two years\nor has been in operation intermittently or partially during the preceding two years;\n(f)   the accumulated losses of the debtor exceed sixty percent of its paid up capital;\nor\n(g)   any project set up by, or belonging to, the debtor has not commenced operations\nor has not been operating smoothly or its production or performance has so\ndeteriorated that—\n(i) the market value of its shares as quoted on the stock exchange or the net worth\nof its shares has fallen by more than seventy-five per cent of its par value;\n(ii) debt equity ratio has deteriorated beyond 9:1; or\n(iii) current ratio has deteriorated beyond 5:l :\nProvided that the party filing the petition under this section shall\nadditionally demonstrate to the Court on balance of probabilities that the\nmediation has not been successful or is not like y to be successful in the\ncircumstances of the case.\n(2) If an administrator dies or resigns during the pendency of case under this Act or is removed\nby the Court on just cause shown, then a substitute administrator shall be appointed immediately.\n(3) Notice of the appointment of administrator in every case under this Act shall be given by\nthe appointed administrator to all interested parties within three working days of his appointment and\nshall additionally be published in one English language and one Urdu language daily newspaper of\nwide circulation in the country and the notice shall provide for filing of any claims against, and\ninterests in, the debtor with the administrator within a period of fourteen days of publication of the\nnotice.\n(4) The Court may award such fees and expenses to an administrator as may be prescribed by\nregulations."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Effect of appointment of administrator",
      "content": "(1) On the appointment of an administrator,—\n(a)   all the powers of the directors, chief executive and other officers of the debtor\nshall cease, except as may be required under this Act and except so far as the\nCourt may sanction the continuance thereof; and\n(b)   all the powers of a receiver appointed prior to the commencement of a case shall\ncease in relation to the property of the debtor.\n(2) Where an administrator is appointed, the debtor and its directors and management shall—\n(a)   cooperate with the administrator to enable him to perform his duties under this\nAct;\n(b)   surrender to the administrator all property of the debtor and any recorded\ninformation including books, documents, records and papers relating to the\ndebtor; and\n(c)   appear at any hearings at which its presence is required by either the administrator\nor an administration committee."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Removal and termination of administrator",
      "content": "(1) The Court may, at any time before\nconfirmation of a plan of rehabilitation, on request of an interested party and after notice and a hearing,\nterminate the administrator’s appointment and restore the debtor to possession of its property and\nmanagement of its business.\n(2) The Court, after notice and a hearing, may remove an administrator for mal-feasance, mal-\nadministration or gross negligence and appoint another administrator.\n(3) Whenever the Court removes an administrator under sub-section (2), such administrator\nshall also thereby stand automatically removed in all other cases under this Act in which such\nadministrator is then serving unless the Court makes orders otherwise.\n(4) A vacancy in office of the administrator during a case does not abate any pending action or\nproceeding and the successor administrator shall be substituted as a party in such action or proceeding."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Powers and duties of an administrator",
      "content": "(1) An administrator shall—\n(a) operate the debtor’s business;\n(b) prepare and submit in the Court the statement of affairs, where the debtor has not\ndone so;\n(c)   except to the extent that the Court makes orders otherwise, investigate the acts,\nconduct, assets, liabilities and financial condition of the debtor, the operation of\nthe debtor’s business and the desirability of the continuance of such business and\nany other matter relevant to rehabilitation of the debtor;\n(d)   as soon as practicable,—\n(i) file a statement of any investigation conducted under clause (c) including\nany fact ascertained pertaining to fraud, dishonesty, incompetence,\nmisconduct, mis-management or irregularity in the management of the\naffairs of the debtor; and\n(ii) transmit a copy or a summary of any such statement to the administration\ncommittees, mortgagee, receiver or charge holder and to such other entity\nas the Court designates;\n(e)   adopt the plan of rehabilitation filed under this Act or seek modification of the\nplan or recommend the winding up of the debtor;\n(f)   institute or defend any suit, action, prosecution or other legal proceeding, civil or\ncriminal, in the name and on behalf of the debtor, to the extent necessary;\n(g)   subject to approval of the administration committees, make any compromise or\narrangement with creditors or persons claiming to be creditors or having or\nalleging themselves to have any claim against the debtor;\n(h)   be accountable for all property of the debtor;\n(i)   examine proofs of claim and object to the allowance of any claim that is improper;\n(j)   unless the Court makes orders otherwise, furnish such information concerning the\nproperty and business of the debtor as is requested by an interested party; and\n(k)   make and submit monthly reports, a final report and final accounts of the\nadministration in the Court.\n(2) For due discharge of the functions under sub-section (1), the administrator shall have the\npower to,—\n(a) to do anything that is incidental to exercising a power set out in this section;\n(b)    to do anything that is necessary or convenient for the purpose of administering\nthe affairs of the debtor; and\n(c) not be liable for any loss or damages caused by any act or omission undertaken in\ngood faith."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Administrator’s account",
      "content": "(1) Every administrator shall, during his tenure in office,\npresent to the Court a comprehensive account of his receipts and payments and dealings as\nadministrator together with such further information as may be relevant.\n(2) The administrator shall cause his account and all receipts and payments to be audited and\nsend the audit report to the Commission, State Bank and the administration committees and to every\nshareholder, where a committee of shareholders has not been constituted, and submit one copy in the\nCourt."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Employment of professional persons",
      "content": "(1) The administrator may employ one or more\nadvocates, accountants, appraisers, auctioneers or other professional persons to represent or assist the\nadministrator in carrying out the administrator’s duties under this Act on reasonable terms and\nconditions of employment with the prior approval of the administration committee of creditors.\n(2) In cases of emergency, the administrator may appoint a person and submit the details of\nterms and conditions of such appointment along-with due reasons thereof to the administration\ncommittee of creditors."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Administration committees",
      "content": "(1) The administrator shall appoint a committee of\ncreditors and may appoint an additional committee of shareholders, if the administrator deems\nappropriate in a case.\n(2) The administration committees shall have adequate representation of different classes of\ncreditors and shareholders of the debtor, as the case may be.\n(3) On request of an interested party, the Court may make order directing the administrator to\nappoint such additional members of an administration committee as the Court finds necessary to\nensure adequate representation of creditors and shareholders, as the case may be."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Powers and duties of administration committees",
      "content": "(1) An administration committee\nshall perform the functions given to it under this Act and in this regard may—\n(a) consult the administrator concerning the administration of the case;\n(b)   review the acts, conduct, assets, liabilities and financial condition of the debtor,\nthe operation of the debtor’s business and the desirability of the continuance of\nsuch business and any other matter relevant to the plan of rehabilitation; and\n(c)   participate in the finalization of the plan and file with the Court acceptance or\nrejection of the plan, if necessary.\n(2) As soon as practicable after the appointment of an administration committee under this Act,\nproper.\n(3) The powers of an administration committee shall terminate upon the confirmation of a plan\nof rehabilitation or upon the conversion of a case into winding up proceedings."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Use, sale or lease of property",
      "content": "(1) The administrator may enter into transactions\nconcerning the business and property of the debtor, including the use, sale or lease of the property, in\nthe ordinary course of business.\n(2) The administrator may use, sell or lease property of the debtor in a manner other than in\nthe ordinary course of business only after consultation with the administration committees."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Obtaining credit",
      "content": "(1) The administrator may, to the extent allowed by the administration\ncommittees, obtain unsecured credit and incur unsecured debt in the course of debtor’s business which\nshall be allowable as an administrative expense.\n(2) Where the administrator is unable to obtain unsecured credit for the debtor, the\nadministration committees may allow the administrator, on such terms and conditions as deemed\nappropriate by the committees, to obtain credit secured by a superior or equal security interest on the\nproperty of the debtor that is subject to an existing security interest:\nProvided that the same has been approved by the holder of the existing security interest on the\nproperty of the debtor on which such superior or equal security interest is proposed to be granted."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Assumption and rejection of executory contracts and unexpired leases",
      "content": "(1) The\nadministrator may, with the prior approval of the Court, assume or reject any executory contract or\nunexpired lease of the debtor including—\n(a) any executory contract relating to the employment or services of any person; and\n(b) any unexpired lease of immovable property.\n(2) The administrator may not reject any executory contract or unexpired lease without giving\nnotice of his intent to reject to all parties to such executory contract or unexpired lease.\n(3) Any party which is prejudiced by the debtor’s rejection of an executory contract or\nunexpired lease may file a claim for damages and such claim shall be deemed to be a breach of such\ncontract or lease occurring immediately prior to the date of filing of the petition."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Claims and interests",
      "content": "(1) Within fourteen days of the publication of the notice of\nappointment of administrator, proof of any claims or interests shall be filed with the administrator by\nthe creditors, shareholders or interested parties, as the case may be.\n(2) Any person who does not timely file a claim or interest will be deemed to have no claim or\ninterest against the debtor unless the delay in filing the claim or interest is condoned, after notice and\na hearing, by the Court for just cause shown.\n(3) Any party aggrieved by a determination of the administrator of any claims and interests\nmay prefer an appeal to the Court which shall determine the amount of such claims or interests."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Allowance of claims for administrative expenses",
      "content": "(1) After notice and a hearing there\nshall be allowed administrative expenses, from time to time, including—\n(a)   the actual, necessary costs and expenses of preserving the business and property\nof the debtor, including\n(i)    any credit facility obtained by the debtor;\n(ii) wages, salaries or commissions for services rendered after the appointment\nof administrator;\n(iii) payment for raw materials supplied to the debtor for its business; and\n(iv)    payment for goods supplied to the debtor in the ordinary course of its\nbusiness; and\n(b) the fees and expenses awarded to the administrator under section 20.\n(2) Administrative expenses allowed under this section shall have priority over all other\nexpenses and claims."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Handover of property of debtor to administrator",
      "content": "(1) Any person in possession,\ncustody or control of a property that the administrator may use, sell or lease under this Act shall deliver\nsuch property to the administrator or account for the value of such property.\n(2) Any person who owes a debt to the debtor, which is due for payment, payable on demand\nor payable on order, shall pay such debt to or on the order of the administrator, except to the extent\nthat such debt may be approved by the administrator to be offset against a claim of such person against\nthe debtor.\n(3) After notice and a hearing, the Court may excuse compliance with any provision of this\nsection, if the interests of creditors would be better served by, not handing over possession, custody\nor control of such property to the administrator."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Avoidance of transfers",
      "content": "(1) Except as provided under sub-section (2), an administrator\nmay, with the approval of the Court, avoid a transfer of an interest of the debtor in property in favour\nof a creditor where such transfer—\n(a) is made on account of an antecedent debt owed by the debtor before such transfer;\n(b) is made—\n(i)    within six months before the date of the appointment of the administrator;\nor\n(ii)   if the creditor is an insider, within one year before the date of the\nappointment of the administrator; and\n(c) enables such creditor to receive more than what such creditor would have received\notherwise.\n(2) The administrator shall not avoid a transfer where such transfer is,—\n(a)   intended by the debtor and the creditor to be a contemporaneous exchange for\nnew value given to the debtor and is a substantially contemporaneous exchange;\n(b) made in payment of a debt incurred by the debtor in the ordinary course of business\nand according to ordinary business terms; or\n(c)   for the benefit of a creditor to the extent that such creditor gives new value to or\nfor the benefit of the debtor subsequent to the transfer.\n(3) To the extent that a transfer is avoided under this section, the Court may allow the\nadministrator to recover the property transferred or the value of such property from the initial\ntransferee or subsequent transferee.\n(4) For the purposes of this section the expression, “new value” means money worth in goods,\nservices or new credit or released by a transferee of property previously transferred to such transferee\nin a transaction that is neither void nor voidable by the administrator under law, including proceeds of\nsuch property, but does not include an obligation substituted for an existing obligation."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Abandonment of property of debtor",
      "content": "(1) After notice and a hearing, the administrator\nmay abandon any property of the debtor that is burdensome or that is of inconsequential value and\nbenefit to the debtor.\n(2) On request of an interested party and after notice and a hearing, the Court may order the\nadministrator to abandon any property of the debtor that is burdensome or that is of inconsequential\nvalue and benefit to the debtor.\nMiscellaneous"
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Act not in derogation",
      "content": "This Act shall be in addition to and not in derogation of any other\nlaw."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Act to override contracts, instruments, memorandum and articles",
      "content": "Save as otherwise\nexpressly provided in this Act, the provisions of this Act shall have effect notwithstanding anything\nto the contrary contained in any contract, instrument, memorandum or articles of a company or in any\nagreement executed by a company or in any resolution passed by the company in a general meeting\nor by its directors, whether the same is registered, executed or passed, before or after the\ncommencement of this Act."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Limitation",
      "content": "(l) Except as provided otherwise in this Act, the provisions of the Limitation\nAct, 1908 (IX of 1908) shall apply to the proceedings under this Act.\n(2) Notwithstanding anything contained in the Limitation Act, 1908 (IX of 1908), in computing\nthe time within which an administrator may institute a suit for the recovery of any debt due to the\ndebtor, the period which elapses between the filing of a petition under the is Act and the passing of\norder of mediation under this Act or period of one year, which ever be greater, shall be excluded."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Power to require delivery of property",
      "content": "Without prejudice to any obligation imposed\nunder any other provision, the Court may at any time after passing order of mediation under this Act\nrequire any trustee, receiver, banker, agent, officer or employee or former officer or employee or\nauditor of the debtor to pay, deliver, convey, surrender or transfer forthwith or within such time as the\nCourt directs, to the administrator, if one has been appointed, any money, property or books and papers\nincluding documents in his hands to which debtor is prima facie entitled, which is not subject to any\ncharge."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Power to make rules",
      "content": "The Minister-in-charge of the Federal Government may, by\nnotification in the official Gazette, make such rules as may be necessary to carry out the purposes of\nthis Act."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Power to make regulations",
      "content": "The Commission may, by notification in the official\nGazette, make regulations in respect of the matters expressly required in this Act to be prescribed by\nthe Commission."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Power to issue directives, circulars, guidelines, etc",
      "content": "The Commission may, from time\nto time, issue such directives, circulars and guidelines as may be necessary for carrying out the\npurposes of this Act, the rules or regulations made thereunder."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Power to remove difficulties",
      "content": "If any difficulty arises in giving effect to the provisions\nof this Act, the Minister-in-charge of the Federal Government may, by notification in the official\nGazette, make such order not inconsistent with the provisions of this Act and as may be necessary to\nremove the difficulty.\n___________\nRGN Date: 24-07-2025"
    }
  ],
  "definitions": [
    {
      "term": "administrator",
      "definition": "an administrator appointed under section 20;",
      "source_provision": "sec2"
    },
    {
      "term": "administration committee",
      "definition": "the committee of the creditors or shareholders of the debtor appointed under section 26;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the Securities and Exchange Commission of Pakistan established under the Securities and Exchange Commission of Pakistan Act, 1997 (XLII of 1997);",
      "source_provision": "sec2"
    },
    {
      "term": "Court",
      "definition": "the High Court having territorial jurisdiction;",
      "source_provision": "sec2"
    },
    {
      "term": "creditor",
      "definition": "an entity that has a claim against debtor that arose at the time of or before the commencement of a case under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "debtor",
      "definition": "a company specified under section 6;",
      "source_provision": "sec2"
    },
    {
      "term": "insolvency expert",
      "definition": "the expert specified under section 5;",
      "source_provision": "sec2"
    },
    {
      "term": "mediator",
      "definition": "the mediator appointed under section 10;",
      "source_provision": "sec2"
    },
    {
      "term": "Ordinance",
      "definition": "the Companies Ordinance, 2016 (VI of2016) or such other law in force for regulations of companies;",
      "source_provision": "sec2"
    },
    {
      "term": "order of mediation",
      "definition": "the order passed by the Court under section 10;",
      "source_provision": "sec2"
    },
    {
      "term": "plan of rehabilitation",
      "definition": "a plan of rehabilitation of debtor defined under section 7;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules or regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "property",
      "definition": "property of all description, whether movable or immovable, tangible or intangible, existing or future, claims for money, cash, and includes instruments that evidence title in property;",
      "source_provision": "sec2"
    },
    {
      "term": "qualifying creditors",
      "definition": "one or more creditors holding unpaid and overdue claims for an aggregate amount of not less than two-third of the value of assets of the debtor as per its latest balance sheet;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "security interest",
      "definition": "a charge, mortgage, lien, hypothecation, pledge, assignment or any other encumbrance over a property;",
      "source_provision": "sec2"
    },
    {
      "term": "statement of affairs",
      "definition": "statement of particulars about the property and business of a debtor prepared under section 9. (2) The words and expressions used but not defined in this Act shall have the same meaning as assigned to them in the Ordinance.",
      "source_provision": "sec2"
    }
  ]
}
