{
  "id": "pk-cotton-industry-statistics-act-1926",
  "type": "statute",
  "title": "Cotton Industry (Statistics) Act, 1926",
  "title_en": "Cotton Industry (Statistics) Act, 1926",
  "short_name": "CIA",
  "status": "in_force",
  "issued_date": "1926-03-24",
  "in_force_date": "1926-03-24",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap%2BV-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Cotton Industry (Statistics) Act, 1926 (XX of 1926) published by The Pakistan Code (Labour Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent.⸻(1) This Act may be called the Cotton Industry (Statistics) Act, 1926",
      "content": "1\n[(2) It extends to the whole of Pakistan.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.⸻For the purposes of this Act, unless there is anything repugnant in the",
      "content": "subject or context,___\n(a)        “cotton goods” or “goods” includes all tissues and other articles (except yarn\nand thread) woven, knitted or otherwise manufactured wholly or partly from\ncotton yarn;\n(b)        “cotton yarn” or “yarn” means yarn wholly or partly composed of cotton\nfibres;\n(c)        “mill” means any building or place where cotton goods are woven, knitted or\notherwise manufactured, or where cotton yarn is spun, by machinery moved\notherwise than by manual labour, and includes every part of such building or\nplace;\n(d)        “owner”, in relation to any mill, includes the managing agent or other\nprincipal officer of the mill ; and\n(e)        “prescribed” means prescribed by rules made under this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Delivery of monthly returns of goods and yarn manufactured by mill",
      "content": "owners.___(1)\nThe owner of every mill shall each month prepare and deliver, or cause to be prepared and delivered,\nto the prescribed officer a return of all cotton goods manufactured and all cotton yarn spun in the mill\nduring the preceding month by machinery moved otherwise than by manual labour, and shall\nsubscribe a declaration of the truth of the return at the foot thereof.\n(2) Save as may be otherwise prescribed, every such return shall state, in respect of each\ndescription of goods and of yarn, the quantity manufactured during the period to which the return\nrelates, and shall contain such further information, and be in such form and be subject to such\nconditions as to verification and otherwise, as may be prescribed.\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (Ordinance No. XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955).\n(3) Every such return shall be delivered to the prescribed officer or posted to his address\nwithin seven days after the end of the month to which it relates."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to inspect mills and take copies of records",
      "content": "(1) Any officer authorised by the\n1\n[Provincial Government] by order in writing in this behalf shall have free access at all reasonable\ntimes during working hours to any mill and may at any time, with or without notice to the owner,\nexamine and take copies of, or extracts from, the records of the mill for the purpose of testing the\naccuracy of any return made under section 3, or of informing himself as to any particulars regarding\nwhich information is required for the purposes of this Act or any rules made thereunder:\nProvided that no officer not especially empowered by the 1[Provincial Government] in this\nbehalf shall be entitled to inspect any record containing the description or formulae of any trade\nprocess.\n(2) All copies and extracts and all information acquired by any officer in the inspection of\nany mill under this section shall be treated as strictly confidential."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Publication of returns. The 1[Provincial Government] shall, from the returns delivered",
      "content": "under section 3, cause to be compiled and published, in such form as 1[it] may direct, statements\nshowing for each month the total quantities of goods manufactured and of yarn spun in mills in 1[the\nProvince]."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to make rules",
      "content": "(1) The 1[Provincial Government] may, by notification in the\n1\n[official Gazette], make rules consistent with this Act to carry out the purposes thereof.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules\nmay provide for all or any of the following matters, namely:___\n(a)        the form of any return required under this Act, the Particulars to be contained\ntherein, and the manner in which the return shall be verified;\n(b)        the nature of the records to be maintained by the owners of mills;\n(c)        the powers and duties, in regard to the inspection of mills under this Act, of\nthe officers authorised to make such inspections; and\n(d)        any other matter which may be or is to be prescribed."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Penalties",
      "content": "_(1) Any person who⸻\n(a)        knowingly falsifies any record of manufacture or production kept in a mill, or\n(b)        being required to deliver a return under section 3, knowingly delivers a false\nreturn, or\n1\nSubs. by the Government of India (Adaptation of Indian Laws) Order, 1937.\n(c)        omits to make any return required by section 3, or refuses to sign or complete\nthe same, or\n(d)        knowingly does any act, not otherwise punishable under this Act, in\ncontravention of the provisions of any rule made under this Act,\nshall be punishable with fine which may extend to five hundred rupees.\n(2) Any person who discloses any particulars or other information acquired by him in the\ninspection of any mill under this Act shall be punishable with fine which may extend to one thousand\nrupees:\nProvided that nothing in this sub-section shall apply to the disclosure___\n(a)        of any such particulars or information for the purpose of a prosecution under\nsection 193 of the Pakistan Penal Code (XLV of 1860) or under this Act, in\nrespect of any return kept or record made for the purposes of this Act, or\n(b)        of any such particulars or information to any person acting in the execution of\nany duty imposed upon him by this Act, where the disclosure is necessary for"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Exemption",
      "content": "_The 1[Provincial Government] may, by notification in the 1[official Gazette],\nexempt from the operation of this Act or of any specified provision thereof any mill or class of mills,\nor any goods or class of goods, specified in the notification."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Protection for acts done under this Act",
      "content": "_No suit or other legal proceeding shall be\ninstituted against any person in respect of anything which is in good faith done or intended to be\ndone under this Act.\n________________\n41130\nDate: 20-02-2025\n1\nSubs. by the Government of India (Adaptation of Indian Laws) Order, 1937."
    }
  ],
  "definitions": [
    {
      "term": "mill",
      "definition": "any building or place where cotton goods are woven, knitted or otherwise manufactured, or where cotton yarn is spun, by machinery moved otherwise than by manual labour, and includes every part of such building or place;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act.",
      "source_provision": "sec2"
    }
  ]
}
