{
  "id": "pk-cotton-standardization-ordinance-2002",
  "type": "statute",
  "title": "Cotton Standardization Ordinance, 2002",
  "title_en": "Cotton Standardization Ordinance, 2002",
  "short_name": "CSO",
  "status": "in_force",
  "issued_date": "2002-10-03",
  "in_force_date": "2002-10-03",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FtbJY%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Cotton Standardization Ordinance, 2002 (LXIV of 2002) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Savings",
      "content": "_____________\nORDINANCE N o . LXIV OF 2002\n[4th October, 2002]\nAn Ordinance to provide for the establishment of the Pakistan Cotton Standards Institute and\nto promote quality control of cotton\nWHEREAS it is expedient to provide for the establishment of the Pakistan Cotton\nStandards Institute and to promote quality control of cotton and to provide for matters connected\ntherewith or incidental thereto;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth\nday of October, 1999, and the Provisional Constitution Order No.l of 1999, read with the\nProvisional Constitution (Amendment) Order No.9 of 1999, and in exercise of all powers\nenabling him in that behalf, the President of the Islamic Republic of Pakistan is pleased to\nmake and promulgate the following Ordinance, namely:⸺"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "-(1) This Ordinance may be called the\nCotton Standardization Ordinance, 2002.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or",
      "content": "context,⸺\n(a)   “arbitration” means settlement of disputes between buyer and seller of\ncotton;\n(b)   “bale” means any pressed package of lint cotton with standard average net\nweight of one hundred and seventy kilograms with variation of three percent\nplus or minus at eight and half percent moisture content;\n(c)   “Board” means the Board of Directors of the Institute constituted under\nsection 5;\n(d)   “Chairman” means the Chairman of' the Board;\n(e)   “Classer” means a person trained in cotton assessing and having obtained the\nprescribed certificate by the Institute;\n(f)   “cotton” means the post-harvest seed cotton and lint cotton;\n(g)   “contamination” means all materials other than cotton;\n(h)    “cotton standards” means the official cotton standards prescribed by the\nInstitute;\n(i)    “Fund” means the Pakistan Cotton Standards Institute Fund established\nunder section 16;\n(j)   “ginner” means any natural or legal person responsible for managing a\nginning factory;\n(k)   “grade” means a grade of cotton established under this Ordinance;\n(l)   “Inspector” means an Inspector appointed by a Provincial Government\nunder the Provincial Cotton Control Ordinance, 1966, (W.P.Ordinance XX\nof 1966);\n(m) “Institute” means the Pakistan Cotton Standards Institute established under\nsection 3;\n(n)   “member” means member of the Board;\n(o)   “prescribed” means prescribed by rules made under this Ordinance;and\n(p)   “private inspection company” means a company or person so authorized\nby the Institute to grade and classify seed cotton and lint cotton for\ndetection of contamination level therein."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Institute.⎯(1) There shall be established an institute to be known",
      "content": "as the Pakistan Cotton Standards Institute which shall be a body corporate having perpetual\nsuccession and a common seal and may acquire, hold and dispose of its property:\nProvided that the immovable property of the Institute shall be disposed of after approval\nof the Federal Government.\n(2). The Head Office of the Institute shall be at Karachi, with sub-offices one each in the\nPunjab at Multan and in Sindh at Sukkur. The Board may, with the approval of the Federal\nGovernment, set up such additional sub-offices at other places as and when required.\n(3). The Institute shall be headed by a Director who shall be its chief executive officer."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Management.⎯() The general direction and administration of the Institute shall vest in",
      "content": "Institute under this Ordinance.\n(2) The Board shall in discharge of its functions, act on sound principles of standardization,\ntesting and quality control and shall be guided on matters of policy by such directives which the\nFederal Government may issue from time to time and if question arises as to whether any matter\nis a matter of policy or not, the decision of the Federal Government shall be final."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Constitution of the Board.⸺(1) The Board shall consist of the following, namely:⸺",
      "content": "(a) The Chairman;\n(b) one representative each of the 1[Ministry of Textile Industry,]                               Members.\nMinistry of Food, Agriculture and Livestock, Ministry of\nCommerce and Ministry of Finance, Government of Pakistan;\n(c) one representative each of the Agriculture Departments                                        Members.\nof the Punjab, Sindh, NWFP and Balochistan;\n(d) one representative each of the Pakistan Central Cotton                                        Members.\nCommittee (PCCC), Trading Corporation of Pakistan (TCP),\nKarachi Cotton Association (KCA), All Pakistan Textile Mill's\nAssociation (APTMA), Pakistan Cotton Ginner's Association\n(PCGA) and Textile Commissioner’s Organization (TCO);\n(e) one grower each to be nominated far a tern of two years by                                    Members.\nthe Provincial Agriculture Departments of Punjab, Sindh, NWFP\nand Balochistan;\n(f) such other growers not exceeding three, to be                                                 Members.\nnominated by the Federal Government for a terns of two\nyears; and\n(g) Director, Pakistan Cotton Standards Institute                                                 Member.\n(PCSI).\n(2) The Secretary, Ministry of 2 [Textile Industry] shall be the Chairman and the Director,\nPakistan Cotton Standards Institute shall be ex officio Secretary of the Board.\n(3) The Federal Government shall, from the Ministry of Commerce, Government of\nPakistan, appoint a member to be the Vice-Chairman of the Board.\n(4) The appointment of the Chairman, Vice-Chairman and members shall be notified in the\nofficial Gazette."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Meetings.⎯ (1) The meetings of the Board shall be convened by the Chairman for an",
      "content": "identified agenda on such date and at such time and place as may be specified by him:\nProvided that not more than a period of six months shall intervene between two meetings\nof the Board and at least two meetings of the Board shall be held each year.\n1\nIns. by the Cotton Standardization (Amdt.) Act, 2009 (II of 2009), s. 2.\n2Subs by the Cotton Standardization (Amdt) Act, 2009 (II of 2009), s.2 for “Food, Agriculture and Livestock\".\n(2) On a written requisition of at least seven members, the Chairman shall, within a period\nof fifteen days from receipt of such requisition, summon a meeting of the Board.\n(3) Seven members of the Board shall constitute a quorum for a meeting of the Board.\n(4) All decisions of the Board shall be taken by majority vote and, in the event of\nequality of votes, the Chairman shall have the casting vote.\n(5) The Board may, with the approval of the Federal Government, make rules for conduct\nof its business."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power of Board to associate other persons. The Board may, in such manner and on",
      "content": "such terms as it may deem fit, seek the advice or assistance of any person in carrying out the\npurposes of this Ordinance and invite any person to take part in discussions during any of its meeting\nwithout the right to vote."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Executive Committee.⎯ (1) There shall be an Executive Committee which shall",
      "content": "consist of the following members, namely:⎯\n(a) the Vice-Chairman;\n(b) three members of the Board of whom two members from the public sector and\none member from the private sector, to be nominated by the Board; and\n(c) the Director, Pakistan Cotton Standards Institute.\n(2) Subject to the directions and delegation of powers by the Board, the Executive\nCommittee shall be the principal administrative body of the Institute."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Appointment of officers and staff.⸺ (1) The Board may appoint such officers and",
      "content": "employees as it may consider necessary for the efficient performance of its functions on such terms\nand conditions as may be prescribed with the prior approval of the Federal Government.\n(2) All appointments under sub-section (1) shall be made in accordance with the prescribed\neducational, technical or professional qualifications, experience and age limits and after\nadvertisement of the vacancies in the prominent newspapers."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Officers and staff etc. to be public servants. The officers and staff of the Institute",
      "content": "shall be deemed to be public servants within the meaning of section 21 of the Pakistan Penal\nCode (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Functions of the institute.⎯ The following shall be the functions of the Institute,",
      "content": "namely:⸺\n(a)   to introduce standardization of cotton;\n(b)   to establish cotton standards and recommend measures               to Provincial\nGovernments for producing contamination-free cotton;\n(c)   to devise quality control measures for export and domestic use of cotton and\nthe handling procedures for contamination-free cotton in ginning\nfactories;\n(d)   to conduct grading of seed cotton and classification of lint cotton through its\nClassers or the approved private inspection companies;\n(e)   to pre-qualify the private inspection companies for certifying the quality of\ncotton;\n(f)   to conduct training and examination in cotton grading and cotton classing for\ngrowers, ginners, spinners, exporters and other persons of public and private\nsectors and awarding the certificate;\n(g)   to develop arbitration procedures to settle disputes relating to classification,\ngrading and contamination amongst sellers and buyers of seed cotton and lint\ncotton;\n(h)   to liaison with the national and international cotton related institutions; and\n(i)   to lay down the policy and programme and its implementation for training\nin arbitration, cotton classification and cotton fibre testing."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Placement of Classers.⎯(1) The Institute shall assign a Classer to one or more",
      "content": "ginning factories for supervision of the-standardization of cotton.\n(2) The assignment of a Classer under sub-section (1) shall not prevent the Institute from\nexercising itself or any private inspection company from exercising the duties of a Classer."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Duties of a Classer.⎯(1) The Classer shall supervise the standardization procedures",
      "content": "and technical requirements by a ginning factory with which his assignment has been made\nunder sub-section (1) of section 13.\n(2) In order to carry out his duties under sub-section (1), the Classer shall be empowered to\nvisit the assigned ginning factory and he may examine any cotton being ginned and take samples\nthereof for classification.\n(3) If a Classer has reasons to believe that the standardization procedures and technical\nrequirements are not complied with by a ginning factory, the Classer shall inform the Inspector by\na written memorandum with copy to the Institute."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Standardization fee.⸺ (1) The Institute may charge standardization fee as charges of",
      "content": "standardization of the cotton at such rate as the Federal Government may, from time to time, fix by\nnotification in the official Gazette.\n(2) The Institute shall have the authority to utilize the standardization fee to meet its\nestablishment and operational expenses.\n(3) The institute shall, however, continue to receive such annual grants from the Federal\nGovernment to meet its establishment and operational expenses till it becomes self- financing."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Pakistan Cotton Standards Institute Fund.⎯ (1) There shall be established a Fund to",
      "content": "be known as the Pakistan Cotton Standards Institute Fund to meet expenses in connection with the\nfunctions of the Institute under this Ordinance including the payment of salaries and other\nremunerations of the officers and staff of the Institute.\n(2) The Fund shall consist of⸺\n(a)   grants made by the Federal Government ;\n(b)   loans obtained from the Federal Government ;\n(c)   loans obtained from, and grants made by foreign agencies with the prior\nsanction of the Federal Government ;\n(d)   standardization fee charged under section 15; and\n(e)   all other funds and sums including donations received by the Institute.\n(3) The Fund shall be kept in the Personal Ledger Account of the Institute with the National\nBank of Pakistan, or with such other banks as may be approved by the Federal Government."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Power of the Institute to borrow money.⸺ For the purpose of borrowing money, the",
      "content": "Institute shall be deemed to be a local authority under the Local Authorities Loans Act, 1914 (IX of\n1914)."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Budget. The Institute shall prepare its annual budget estimates for every ensuing year,",
      "content": "and submit it for approval to the Board."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Delegation.⎯ (1) The Federal Government may, by notification in the official",
      "content": "Gazette, and subject to such conditions as may be specified in the notification, direct that all or\nany of its powers under this Ordinance or rules made thereunder shall also be exercisable by a\nProvincial Government or any authority subordinate to it.\n(2) The Board may delegate all or any of its powers under this Ordinance to the\nChairman, a member or any officer of the Institute."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Power to make rules.⎯ (1) The Institute may, with the approval of the Federal",
      "content": "Government, make rules for carrying out the purpose of this Ordinance.\n(2) In particular and without prejudice to the generality of the foregoing powers, such rules\nmay provide for all or any of the following matters, namely:⸺\n(a)   to regulate appointments to and conditions of service of officers and employees\nof the Institute;\n(b)   standardization of cotton and devise measures for application of\nstandards;\n(c)   seed cotton grading and lint cotton classification;\n(d)   specifying nature and levels of contamination and measures for quality\ncontrol of cotton and for producing contamination-free cotton;\n(e)   selection and control of approved private inspection companies for certifying\nthe cotton quality;\n(f)   regulating the composition and the functions of technical and administrative\ndepartments, and other offices of the Institute;\n(g)   levying of fees and charges in respect of grading, classing, quality control,\nfibre testing and other services provided by the Institute;\n(h)   settlement of disputes between buyer and seller of cotton;\n(i)   laying down the qualifications and duties of the employees of the Institute;\nand\n(j)   courses of study for training in cotton grading, classification, standards,\ndetection and eradication of contamination in cotton and fibre testing by\nmodern machines and HVI."
    }
  ],
  "definitions": [
    {
      "term": "arbitration",
      "definition": "settlement of disputes between buyer and seller of cotton;",
      "source_provision": "sec2"
    },
    {
      "term": "bale",
      "definition": "any pressed package of lint cotton with standard average net weight of one hundred and seventy kilograms with variation of three percent plus or minus at eight and half percent moisture content;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of Directors of the Institute constituted under section 5;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of' the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "Classer",
      "definition": "a person trained in cotton assessing and having obtained the prescribed certificate by the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "cotton",
      "definition": "the post-harvest seed cotton and lint cotton;",
      "source_provision": "sec2"
    },
    {
      "term": "contamination",
      "definition": "all materials other than cotton;",
      "source_provision": "sec2"
    },
    {
      "term": "cotton standards",
      "definition": "the official cotton standards prescribed by the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Fund",
      "definition": "the Pakistan Cotton Standards Institute Fund established under section 16;",
      "source_provision": "sec2"
    },
    {
      "term": "ginner",
      "definition": "any natural or legal person responsible for managing a ginning factory;",
      "source_provision": "sec2"
    },
    {
      "term": "grade",
      "definition": "a grade of cotton established under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "Inspector",
      "definition": "an Inspector appointed by a Provincial Government under the Provincial Cotton Control Ordinance, 1966, (W.P.Ordinance XX of 1966);",
      "source_provision": "sec2"
    },
    {
      "term": "Institute",
      "definition": "the Pakistan Cotton Standards Institute established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "member of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Ordinance;and",
      "source_provision": "sec2"
    },
    {
      "term": "private inspection company",
      "definition": "a company or person so authorized by the Institute to grade and classify seed cotton and lint cotton for detection of contamination level therein.",
      "source_provision": "sec2"
    }
  ]
}
