{
  "id": "pk-cotton-transport-act-1923",
  "type": "statute",
  "title": "Cotton Transport Act, 1923",
  "title_en": "Cotton Transport Act, 1923",
  "short_name": "CTA",
  "status": "in_force",
  "issued_date": "1923-02-22",
  "in_force_date": "1923-02-22",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apyZ-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Cotton Transport Act, 1923 (III of 1923) published by The Pakistan Code (Labour Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent",
      "content": "_(1) This Act may be called the Cotton Transport Act, 1923.\n1\n[(2) It extends to the whole of Pakistan.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_In this Act, unless there is anything repugnant in the subject or context, ___\n(a)        “certified copy”, in relation to a licence, means a copy of the licence certified\nin the manner described in section 76 of the Evidence Act, 1872 (I of 1872), by\nthe authority by which the licence was granted;\n(b)        “cotton” means every kind of unmanufactured cotton, that is to say, ginned and\nunginned cotton, cotton waste and cotton seed;\n(c)        “cotton waste” means droppings, strippings, fly and other waste products of a\ncotton-mill other than yarn waste;\n(d)        “licence” means a licence granted under this Act;\n(e)        “notified station” means a railway station specified in a notification under\nsection 3;\n(f)        “prescribed” means prescribed by rules made under this Act; and\n(g)        “protected area” means an area into which the import of cotton or of any kind\nof cotton has been prohibited 2[wholly or partly] by a notification under section\n3 3[ ; ]\n3\n[(h)   “appropriate Government” means in relation to the transport of cotton across\nthe customs frontiers and interprovincial trade and commerce, the Federal\nGovernment and, for other purposes, the Provincial Government.]\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960). s. 3 and 2nd Sch. (With Effect From the 14th October, 1955).\n2\nIns. by Act No. XXXIV of 1925, s. 2.\n3\nSubs. and ins. by the Federal Adaptation of laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Sch."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Power to issue notification prohibiting import of cotton into protected area",
      "content": "_(1) The\n1\n[appropriate Government] may, for the purpose of maintaining the quality or reputation of the cotton\ngrown in any area in the Province, by notification in the 2[official Gazette], prohibit the import of\ncotton or of any specified kind of cotton into that area 3[by rail, road, river and sea, or by any one or\nmore of such routes] save under, and in accordance with the conditions of, a licence:\nProvided that no such notification shall be deemed to prohibit the import into any protected\narea of packages containing any kind of cotton and not exceeding ten pounds avoirdupois weight.\n(2) Any such notification may prohibit the delivery to, and the taking of delivery by, any\nperson, at any specified railway station situated in the protected area, of any cotton, the import of which\n3\n[by rail] into that area is prohibited when such cotton has been consigned from a railway station not\nsituated in that area, unless such person holds a licence for the import 3[by rail] of the cotton into that\narea."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Refusal to carry unlicensed cotton",
      "content": "_(1) Notwithstanding anything contained in the\nRailways Act, 1890 (IX of 1890), or any other law for the time being in force, the station master of\nany railway station or any other railway servant responsible for the booking of goods or parcels at that\nstation may refuse to receive for carriage at, or to forward or allow to be carried on the railway from,\nthat station any cotton consigned to a notified station, being cotton of a kind of which the delivery at\nsuch notified station has been prohibited unless both stations are in the same protected area, or unless\nthe consignor produces a certified copy of a licence for the import of the cotton 3[by rail] into the\nprotected area in which such notified station is situated.\n(2) Every certified copy of a licence when so produced shall be attached to the invoice or way-\nbill, as the case may be, and shall accompany the consignment to its destination, and shall there be\ndealt with in the prescribed manner.\n(3) 4[* *             *          *          *          *          *]"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Procedure where cotton arrives at notified station",
      "content": "_(1) Where any cotton, the import of\n3\nwhich [by rail] into any protected area has been prohibited, has been consigned to and arrives at a\nnotified station in any such protected area, the station master or other railway servant responsible for\nthe receipt and delivery to the consignee of goods or parcels, as the case may be, at that station shall,\nunless both the notified station and the railway station from which the cotton has been consigned are\nsituated in the same protected area, refuse to deliver the cotton until he is satisfied that the consignee\nholds a licence for the import of the cotton 3[by rail] into the protected area in which such notified\nstation is situated ; and, if he is not so satisfied, or if within fourteen days the consignee or some person\nacting on his behalf does not appear in order to take delivery, shall return the cotton to the railway\nstation from which it was consigned, together with an intimation that delivery of the cotton has been\nrefused or has not been taken, as the case may be.\n(2) Any station master or other railway servant receiving any cotton returned under sub-section\n(1), or returned with a like intimation from a railway station specified in a notification under sub-\nsection (3) of section 4, shall cause to be served on the consignor in any manner authorised by section\n1\nSubs. by the Federal Adaptation of laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Sch.\n2\nSubs. by Adaptation Order, 1937.\n3\nIns. by Act No. XXXIV of 1925, ss. 3-5.\n4\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch. II.\n141 of the Railways Act, 1890 (IX of 1890), a notice stating that the cotton has been so returned and\nrequiring the consignor to pay any rate, terminal or other charges due in respect of the carriage of the\ncotton to and from the railway station to which it was consigned, and such charges shall be deemed to\nbe due from the consignor for all the purposes of section 55 of that Act."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Penalties",
      "content": "_Any person who, in contravention of the provisions of this Act or of any\nnotification or rule made hereunder, knowingly takes delivery of any cotton from a notified station or\nimports, or attempts to import, any cotton into a protected area, and any station master or other railway\nservant who, in contravention of the provisions of sub-section (1) of section 5, without reasonable\nexcuse, the burden of proving which shall lie upon him, delivers any cotton to a consignee or other\nperson, shall be liable to a fine not exceeding one thousand rupees, and upon any subsequent conviction\nto imprisonment which may extend to three months, or to fine which may extend to five thousand\nrupees, or to both."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power to make rules",
      "content": "_(1) The 1[appropriate Government] may, by notification in the\n2\n[official Gazette], make rules to provide for any of the following matters, namely:—\n(a)        the prevention of the import into a protected area by road, river or sea, save\nunder and in accordance with the conditions of a licence, of cotton the import\nof which into that area has been prohibited 3[wholly or partly] by a notification\nunder section 3;\n(b)        the terms and conditions to be contained in licences and the authorities by which\nthey may be granted; and\n(c)        the manner in which licences and certified copies thereof shall be dealt with on\nand after the delivery of the cotton to which they relate.\n(2) Any such rules may provide that any contravention thereof or of the conditions of any\nlicence, not otherwise made punishable by this Act, shall be punishable with fine which may extend\nto five hundred rupees."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Previous approval of Provincial Legislature to issue of notifications and rules",
      "content": "_No\nnotification under section 3 or rule under section 7 shall be issued by the 1[appropriate Government]\n4\n[* * *], unless it has been laid in draft before 2[, the 1[Parliament or, as the case may be, the Provincial\nAssembly], and has been approved by a Resolution 2[ of 1[Parliament or of] that Assembly], either\nwith or without modification or addition, but upon such approval being given the notification or rule,\nas the case may be, may be issued in the form in which it has been so approved:\n5\n[*      *          *          *         *          *          *]"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Protection for acts done under Act",
      "content": "_No suit or other legal proceeding shall be instituted\nagainst any person in respect of anything which is in good faith done or intended to be done under this\nAct.\n___________\nDate: 30-12-2024\n1\nSubs. by the Federal Adaptation of laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Sch.\n2\nSubs. by Adaptation Order, 1937.\n3\nIns. by Act No. XXXIV of 1925, s. 6.\n4\nOmitted by the Repealing and Amending Ordinance, 1961 (I of 1961), s. 3 and 2nd Sch.\n5\nOmitted by Adaptation of Central Acts and Ordinance Order, 1949 (Order No. 4 of 1949), s. 3 and Sch."
    }
  ],
  "definitions": [
    {
      "term": "cotton",
      "definition": "every kind of unmanufactured cotton, that is to say, ginned and unginned cotton, cotton waste and cotton seed;",
      "source_provision": "sec2"
    },
    {
      "term": "cotton waste",
      "definition": "droppings, strippings, fly and other waste products of a cotton-mill other than yarn waste;",
      "source_provision": "sec2"
    },
    {
      "term": "licence",
      "definition": "a licence granted under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "notified station",
      "definition": "a railway station specified in a notification under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "protected area",
      "definition": "an area into which the import of cotton or of any kind of cotton has been prohibited 2[wholly or partly] by a notification under section 3 3[ ; ] 3 [(h) “appropriate Government” means in relation to the transport of cotton across the customs frontiers and interprovincial trade and commerce, the Federal Government and, for other purposes, the Provincial Government.] 1 Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960). s. 3 and 2nd Sch. (With Effect From the 14th October, 1955). 2 Ins. by Act No. XXXIV of 1925, s. 2. 3 Subs. and ins. by the Federal Adaptation of laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Sch.",
      "source_provision": "sec2"
    }
  ]
}
