{
  "id": "pk-covid-19-prevention-of-hoarding-2021",
  "type": "statute",
  "title": "COVID-19 (Prevention of Hoarding), 2021",
  "title_en": "COVID-19 (Prevention of Hoarding), 2021",
  "short_name": "COH",
  "status": "in_force",
  "issued_date": "2021-12-02",
  "in_force_date": "2021-12-02",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pi-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of COVID-19 (Prevention of Hoarding), 2021 (XLVI of 2021) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act shall be called COVID-19\n(Prevention of Hoarding) Act, 2021.\n(2)   It extends to the Islamabad Capital Territory.\n(3)   It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\na. “dealer” means any person, trader, partnership, firm, whether registered or\nunregistered, an association or body of persons or individuals, or a company,\nor their agents carrying on the business of purchasing, selling or stocking of\nany scheduled article and includes a manufacturer, producer, packager,\nimporter, exporter, wholesaler or retailer of such article;\nb. “Government” means the Federal Government;\nc. “hoard” or “hoarding”―\ni. means stocking or storing anything in excess of the maximum quantity\nof scheduled articles allowed to be held in stock or storage, in the\nmanner as may be prescribed; or\nii. where no maximum quantity of a scheduled article is prescribed under\nsub-clause (i), “hoard” or “hoarding” shall mean stocking or\naccumulation of scheduled articles without offering such articles for\nsale, despite there being a demand by consumers.\nd. “maximum quantity” means the quantity of an item that is currently available\nfor sale;\ne. “officer” means the deputy commissioner of the Islamabad Capital Territory\nand such other officer as may be authorized by him in this behalf;\nf. “prescribed” means prescribed by rules made under this Act; and\ng. “scheduled article” means any of the articles specified in the Schedule to this\nAct."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Offence of hoarding",
      "content": "(1) Any dealer who is found to hoard any scheduled article shall be\nguilty of an offence punishable with simple imprisonment up to three years and fine equivalent to fifty\npercent of the value ofthe scheduled articles involved in the case.\n(2) The value of scheduled articles for purposes of sub-section (1) shall be determined in the\nmanner as may be prescribed."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to search for and seizure of scheduled article",
      "content": "(1) When an officer has reasonable\ngrounds to suspect, either upon information from anyone or on his own, that there has been a\ncontravention of any of the provisions of this Act, he may, after recording in writing the grounds of his\nsuspicion, enter and search, without any warrant, any place where a dealer keeps, or is for the time being\nkeeping, any scheduled article, accounts, registers or any other related items or things.\n(2) Upon entry in and search of a premise under sub-section (1), if scheduled articles are found\nat such premise in contravention of this Act, the officer shall immediately seize the same and prepare a\ndetailed report of the scheduled articles and other relevant material found during the search.\non search and seizure under this Act"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Offence of hoarding",
      "content": "(1) Any dealer who is found to hoard any scheduled article shall be\nguilty of an offence punishable with simple imprisonment up to three years and fine equivalent to fifty\npercent of the value ofthe scheduled articles involved in the case.\n(2) The value of scheduled articles for purposes of sub-section (1) shall be determined in the\nmanner as may be prescribed."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to search for and seizure of scheduled article",
      "content": "(1) When an officer has reasonable\ngrounds to suspect, either upon information from anyone or on his own, that there has been a\ncontravention of any of the provisions of this Act, he may, after recording in writing the grounds of his\nsuspicion, enter and search, without any warrant, any place where a dealer keeps, or is for the time being\nkeeping, any scheduled article, accounts, registers or any other related items or things.\n(2) Upon entry in and search of a premise under sub-section (1), if scheduled articles are found at\nsuch premise in contravention of this Act, the officer shall immediately seize the same and prepare a\ndetailed report of the scheduled articles and other relevant material found during the search.\n(3) The provisions of the Code of Criminal Procedure, 1898 (Act V of 1898) shall not be applicable\non search and seizure under this Act."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power to auction seized Scheduled articles",
      "content": "(1) Notwithstanding anything contained in any\nother law for the time being in force and in addition to the prosecution under this Act, the officer may sell\nthe scheduled articles seized under section 4 by auction, in the manner as may be prescribed.\n(2) The proceeds collected under sub-section (1) shall be deposited in a profit bearing bank account\nin the National Bank of Pakistan, and if—\n(a) the accused person whose scheduled articles are auctioned is acquitted of an offence\nunder section 3, the deposited amount alongwith the profit shall be released to the said\naccused; or\n(b) the accused person whose scheduled articles are auctioned is convicted of an offence\nunder section 3, the deposited amount alongwith the profit shall be released into the\ngovernment exchequer."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Cognizance of offence and arrest without warrant",
      "content": "(1) Notwithstanding anything\ncontained in the Code of Criminal Procedure, 1898 (V of 1898), all offences punishable under this Act\nshall be cognizable and non- bailable.\n(2) The Special Magistrate under section 8 shall take cognizance of an offence under this Act,\nupon written information by the officer.\n(3) An officer may arrest any person without warrant against whom there is credible information\nthat he has committed an offence under this Act."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Offences by corporations etc",
      "content": "If an offence under this Act is committed by a company or\nbody corporate or a partnership or other association or body of persons or individuals, every director,\nmanager, secretary, member or other officer, the principal, primary or beneficial owner or agents thereof\nshall, unless he proves that the contravention took place without his knowledge or that he exercised all\ndue diligence to prevent such contravention, be deemed to be guilty of such contravention and shall be\nliable to punishment under this Act."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Power to try offences summarily",
      "content": "(1) Offences punishable under this Act shall be tried by\na Special Magistrate appointed under section 14A of the Code of Criminal Procedure, 1898 (Act V of\n1898), in a summary manner as provided in sections 262 to 265 of the said Code:\nProvided that sub-section (2) of section 262 of the Code of Criminal Procedure, 1898 (Act V\nof 1898) shall not apply.\n(2) If a Special Magistrate has reason to suspect that any offence punishable under this Act has\nbeen committed by any dealer or owner of a godown or a storage place or its management or agent thereof,\nhe may enter the place or premises where the offence has been committed and try the offence on the spot.\n(3) The trial under this Act shall be concluded within thirty days."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Appeal",
      "content": "(1) A person aggrieved by an order of conviction and sentence under of this Act\nmay file an appeal before a District and Sessions Judge of the Islamabad Capital Territory within thirty\ndays of the said order.\n(2) An appeal under sub-section (1) shall be disposed of within thirty days."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Reward for informers",
      "content": "Anyone who provides an information to an officer with regard to\nany act or acts of hoarding, which results in a conviction and release of funds into the government\nexchequer, shall be entitled to an award equivalent to ten percent of the amount released to the government\nexchequer, in the manner as may be prescribed."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Information and declarations",
      "content": "(1) Every dealer shall provide to an officer, such\ninformation regarding production, importation, exportation, purchase, stock, sale or distribution of any of\nthe scheduled articles as the officer may, by an order in writing, require.\n(2) The officer may direct the owners or manufactures of scheduled articles or owners and\nmanagement of godowns or storage places or their agents to declare stocks of any particular item, owned or\nmanaged by them at their premises, at any point in time or at such periodical intervals as may be deemed fit.\n(3) The declaration to be made under sub-section (2), shall, inter alia, include, the quantity of\nstock, its value, date of purchase, copies of procurement invoices in any given time frame, along with details\nof any sale or sale agreements.\n(4) The officer may verify the stock as well as the books or documents in respect of the stock,\npurchase or sale, at any time, in respect of scheduled articles.\n(5) While carrying out the verification of stock in terms of sub-section (4) or upon receipt of any\ninformation from whatever source, the officer may require the dealer, owner or manager of a godown or\nstorage place to furnish the details of persons, shops, firms or companies, etc. from whom the purchases\nhavebeen made and to whom the sales have been or are to be made."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Offences in respect of false reporting and failure to disclose information",
      "content": "Any dealer or\nowner of a godown or a storage place or their management or agent, who fails to provide information or\ngives fake or false information with regard to any of the items or details under section 11, or provides\ninformation of contracts, agreements or arrangements found to be fake or false, or is otherwise found to\nbe involved in speculative dealings or market manipulation, creating artificial, false or misleading\nappearance with respect to the price of, or market for, the scheduled articles, shall be guilty of an offence\npunishable with simple imprisonment upto three years and fine equivalent to one million Rupees."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Protection of action taken under the Act",
      "content": "(1) No suit, prosecution or other legal\nproceedings shall lie against any person for anything done in good faith.\n(2) Except as provided in this Act, no suit or other legal proceedings shall lie to challenge\nany proceedings under this Act on any ground."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Action in aid of an officer",
      "content": "In giving effect to the provisions of this Act, an officer, where\nhe deems fit, may seek the aid of law enforcement agencies."
    }
  ],
  "definitions": []
}
