{
  "id": "pk-credit-bureaus-act-2015",
  "type": "statute",
  "title": "Credit Bureaus Act, 2015",
  "title_en": "Credit Bureaus Act, 2015",
  "short_name": "CBA",
  "status": "in_force",
  "issued_date": "2015-08-23",
  "in_force_date": "2015-08-23",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2JwZ5o%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Credit Bureaus Act, 2015 (XI of 2015) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.―(1) This Act may be called the Credit Bureaus",
      "content": "Act, 2015.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once on such dates as the Federal Government may, by\nnotification in the official Gazette appoint."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.―(1) In this Act, unless there is anything repugnant in the subject or",
      "content": "context,―\n(a)    “adverse action” means any action which causes a denial, rejection,\ncancellation of or reduction in or otherwise any unfavourable result in any\ntransaction involving credit, finance, trade, commerce or employment with\nrespect to a debtor;\n(b)    “banking” means the accepting, for the purposes of lending or investment, of\ndeposit of money from the public, repayable on demand or otherwise, and\nwithdrawable by cheque, draft, order or otherwise;\n(c)    “banking company” means any company which transacts business of banking\nin Pakistan;\n(d)    “banking policy” means any policy formulated by the State Bank of Pakistan\nin the interest of banking or in the interest of monetary stability or sound\neconomic growth, having due regard to the interest of the depositors, the\nvolume of deposits and other resources of the bank and the need for equitable\nallocation and the efficient use of these deposits and resources;\n(e)    “companies Ordinance” means the Companies Ordinance, 1984 (XLVII of\n1984);\n(f)   “company” means a company incorporated under the Companies Ordinance;\n(g)   “court” means the court of sessions having territorial jurisdiction in the area\nwhere the cause of action arises or offences committed under this Act;\n(h)   “credit bureau” means a public limited company established under the\nCompanies Ordinance which has been granted a licence by the State Bank of\nPakistan in accordance with this Act;\n(i)   “credit information” means any information with respect to a debtor relating\nto―\n(i)     the amounts, nature of loans or advances, finance and other credit\nfacilities granted by a credit institution and repayment thereof by the\ndebtor and the nature of security taken by a credit institution for credit\nfacilities granted;\n(ii)    the guarantee or any other non-fund based facility furnished by a credit\ninstitution for the benefit thereof;\n(iii)   the amounts and nature of commercial transactions, facilities and\nservices entered into or availed of credit from non-financial companies\nand bodies and other lenders and authorities including but not limited\nto retailers, insurance companies, utility providers and landlords as\nnotified by the Federal Government;\n(iv)    any and all factors included in the financial history bearing on the\ncredit worthiness, credit standing and credit capacity thereof;\n(v)     any other related public record and information as prescribed by rules;\nor\n(vi)    personal information as prescribed by rules;\n(J)   “credit information furnisher” means any credit institution, person or entity\nwhich provides credit information to a credit bureau including non-financial\ncompanies and bodies and other lenders and authorities;\n(k)   “credit information report” means any written or electronic communication\nissued by a credit bureau containing credit information relating to any debtor\nfor the purposes of this Act;\n(l)   “credit institution” includes ―\n(i)     a banking company;\n(ii)    microfinance banks;\n(iii)   a financial institution, which means\n(a)    any company, whether incorporated within or outside Pakistan,\nwhich transacts business of banking or any associated or\nancillary business in Pakistan through its branches within or\noutside Pakistan and includes a government savings bank but\nexcludes the State Bank of Pakistan;\n(b)    a modaraba, leasing company, investment bank, financing\ncompany, unit trust or mutual fund of any kind and credit or\ninvestment institution, corporation or company; and\n(c)    any company authorized by law to carry on any similar\nbusiness;\n(iv)   non-banking financial company; and\n(v)    any company, corporation or institution or class of companies or\ninstitutions as the Federal Government may from time to time, by\nnotification in the official Gazette, specify for the purpose;\n(m)   “credit scoring” means a system whereby points are awarded to debtors\nenabling users to asses the credit worthiness and capacity of debtors to repay\nloans and advances and to discharge any and all other obligations with regard\nto credit facility availed of or to be availed of by the debtors;\n(n)   “debtor” means a person to whom finance as defined in the Financial\nInstitutions (Recovery of Finances) Ordinance, 2001(XLVI of 2001) has been\nprovided, including those who have been credit recipients and who are\npotential recipients of credit as notified by the Federal Government;\n(o)   “default” includes omission or failure to perform a legal or contractual\nobligation involving credit;\n(p)   “licence” means the licence issued by the State Bank of Pakistan to a public\nlimited company for the purpose of functioning as, and carrying out the\nbusiness of, a credit bureau in accordance with the provisions of this Act;\n(q)   “person” means an individual, association or body of individuals, company,\nfirm, authority, institution or any other entity;\n(r)   “prescribed” means prescribed by rules or regulations made under this Act;\n(s)   “regulations” means regulations made under this Act;\n(t)   “rules” means rules made under this Act;\n(u)   “Schedule” means a Schedule to this Act; and\n(v)   “user” means any person or body which obtains a credit information report\nfrom a credit bureau under this Act.\n(2) The words and expressions used and not defined in this Act shall have the meanings as\nassigned to them in the Companies Ordinance, 1984 (XLVII of 1984), State Bank of Pakistan Act,\n1956 (XXXIII of 1956) and Banking Companies Ordinance, 1962 (LVII of 1962)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Application of other laws not barred. ―The provisions of this Act shall be in addition",
      "content": "to, and not, save as herein after expressly provided, in derogation of, the Companies Ordinance, 1984\n(XLVII of 1984), the Banking Companies Ordinance, 1962 (LVII of 1962) or any other law for the\ntime being in force."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Licence.―Notwithstanding anything contained in any other law for the time being in force",
      "content": "and save as hereinafter provided, no person shall commence or carry on business of or function as a\ncredit bureau without obtaining a licence from the State Bank of Pakistan in the manner prescribed\nby regulations."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Eligibility for licensing. ―(1) A person proposing to commence business as a credit",
      "content": "bureau shall be eligible for licence under this Act subject to the following conditions or\nrequirements, namely: ―\n(a)     such person is incorporated as a public limited company under the Companies\nOrdinance;\n(b)     none of the promoters, sponsors, directors, officers or employees of such\ncompany being an individual, sponsor, director, chief executive or major\nshareholder in any company,―\n(i)     has been associated with any illegal banking business;\n(ii)    has overdue loan against any credit institutions that has not been\nsettled within last six months;\n(iii)   has been convicted of any offence involving fraud, breach of trust or\nmoral turpitude;\n(iv)    has defaulted on payment of taxes and liabilities towards other\ngovernment agencies; and\n(v)     has either been adjudicated as insolvent or has defaulted in payment of\ndebt or has compounded with his creditors;\n(c)     the promoters of such company are persons of means and have special\nknowledge of matters which the company may have to deal with as a credit\nbureau and are not involved in the capacity of a director or shareholder with\nany company, business or activity which is likely to be in conflict with the\nbusiness of the credit bureau; and\n(d)     none of the directors of such company shall hold such office with any other\ncompany, business or activity which is likely to be in conflict with the\nbusiness of the credit bureau.\nExplanation―A company, business or activity shall be deemed to be in conflict with the\nbusiness of the credit bureau, if it directly or indirectly competes with the business of credit\ninformation bureaus including but not limited to another credit bureau and financial institution.\n(2) Without prejudice to the conditions specified in sub-section (1), the State Bank of\nPakistan may impose such additional conditions as it may deem necessary on any company at the\ntime of granting the licence or generally by regulations.\n(3) The State Bank of Pakistan may refuse to grant licence, provided that―\n(a)    any of the conditions imposed under this section is not fulfilled; or\n(b)    the application for a licence has been made subsequent to the issuance of a\nnotification regarding suspension of issuance of licences generally:\nProvided that grant of licence shall not be refused without giving an opportunity of being\nheard."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Paid up capital.―The minimum paid up capital of a credit bureau shall be a minimum of",
      "content": "PKR 250,000,000 or as may be prescribed by the State Bank of Pakistan from time to time but not\nless than 250,000,000/- should be fully subscribed and deposited as paid up capital of the company."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Shareholding.―(1) No person shall acquire more than ten percent shares of a credit",
      "content": "bureau either directly or indirectly, except with prior written approval of the State Bank of Pakistan.\n(2) Anyone who knowingly contravenes the provisions of sub-section(1) shall be punishable\nwith a fine not exceeding one million rupees."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Credit bureau in existence prior to the commencement of this Act.―(1) Every person",
      "content": "conducting the business of a credit bureau on commencement of this Act, other than the credit\ninformation bureau of the State Bank of Pakistan, shall before the expiry of the twelve months from\nsuch commencement, apply in writing to the State Bank of Pakistan for obtaining a licence to\ncontinue to carry on business of a credit bureau.\n(2) In the event that the application for the grant of licence made by a person conducting\nbusiness of a credit bureau on commencement of this Act is refused by the State Bank of Pakistan,\nsuch person shall cease operations as a credit bureau within such period as specified in the decision.\nThe credit information collected, collated, stored and maintained by such person may not be sold to\nany entity other than a credit bureau and if the same is not sold to a credit bureau, for whatever\nreason, it shall be surrendered to the State Bank of Pakistan."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Power to suspend or cancel licence.―The State Bank of Pakistan may suspend or cancel",
      "content": "a licence, if a credit bureau―\n(a)    ceases to carry on business of a credit bureau in Pakistan;\n(b)    fails to comply with or contravenes any provision of this Act or any conditions\nsubject to which the licence was granted to it or any other law for the time\nbeing in force or fails to comply with or contravenes any rules or regulations,\ndirections, guidelines or instructions issued under this Act:\nProvided that no licence shall be suspended or cancelled without affording an opportunity to\nbe heard."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Credit information furnishers to provide credit information.―Notwithstanding",
      "content": "anything contrary to any other law for the time being in force or in any agreement entered into\nbetween a credit information furnisher and its debtor, credit information furnishers shall provide\ncredit information to credit bureaus, provided that such credit information furnisher is a member of\nthe credit bureau, to which credit information is being provided."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Membership of credit bureaus.―(1) Every credit institution shall become a member of",
      "content": "at least one credit bureau within a period as may be prescribed by regulations. The membership of\nother credit information furnisher, other than credit institution, to become a member of credit\nbureaus shall be notified by the Federal Government accordingly.\n(2) All credit information furnishers upon membership of a credit bureau shall furnish credit\ninformation in accordance with the requirements and specifications.\n(3) In case of termination of membership, the credit institution shall obtain membership of\nany other credit bureau either before termination or simultaneously to comply with sub-section (1).\n(4) In case of failure to comply with quality standards and procedural requirements specified\nby credit bureaus, the membership of credit information furnisher either by the credit bureau on its\nown motion or at the direction of the State Bank of Pakistan may be suspended or cancelled,\nprovided that an opportunity to show cause for the proposed action is given.\n(5) Where a credit institution\n(a)     abstains from becoming a member of at least one credit bureau; or\n(b)     at any time is not a member of any credit bureau―\nsuch credit institution shall be liable to a fine not exceeding one million rupees and, where the\ncontravention is a continuing one, with a further fine which may extend to fifty thousand rupees for\nevery day during which the violation continues, provided that no penalty may be imposed by the\nState Bank of Pakistan without affording such credit institution an opportunity to show cause against\nthe proposed imposition of penalty."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Accounts and balance sheet.―Every credit bureau shall on expiration of each calendar",
      "content": "year prepare a balance sheet and profit and loss account in respect of all business transacted in that\nyear by it."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Audit.―(1) The accounts of credit bureaus shall be audited by auditors who are chartered",
      "content": "accountants within the meaning of Chartered Accountants Ordinance, 1961 (X of 1961) and are on\nthe panel of auditors maintained by the State Bank of Pakistan for the purposes of audit of banking\ncompanies.\n(2) Credit bureaus shall submit duly audited accounts to the State Bank of Pakistan within a\nperiod not exceeding three months of the date of closing of each calendar year."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Powers of the State Bank of Pakistan to give directions.―(1) Where the State Bank of",
      "content": "Pakistan is satisfied that it is necessary and expedient so to do―\n(a)       in the public interest; or\n(b)       in the interest of banking policy; or\n(c)       in the interest of the credit system, credit bureaus, credit information\nfurnishers, users and debtors in general or to prevent the affairs of a credit\nbureau being conducted in a manner detrimental or prejudicial to the interests\nthereof; or\n(d)       to secure the proper management of credit bureaus generally, ―\nit may formulate the policies, issue regulations, directions or guidelines to\ncredit bureaus generally or to a credit bureau in particular, from time to time,\nas it deems fit and the credit bureau or all the credit bureaus, as the case may\nbe, shall be bound to comply with such policy, directions and guidelines.\n(2) The State Bank of Pakistan may, on representation made to it or on its own motion,\nmodify or cancel any regulations, guidelines or direction issued under sub-section (1) and in so\nmodifying or canceling any direction may impose such conditions as it deems fit, subject to which\nthe modification or cancellation shall have effect."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Power of the State Bank of Pakistan to call for information.―(1) The State Bank of",
      "content": "Pakistan shall have the power and authority to call for any information from a credit bureau\nregarding its business and affairs and to appoint inspecting officers to inspect its books, data,\naccounts, record and other documents.\n(2) It shall be duty of every director, officer or employee of credit bureaus to produce all such\nbooks, data, accounts, record and other documents in his custody or power to an inspecting officer\nappointed under sub-section (1) and furnish to such inspecting officer any statement and information\nrelating to the affairs of the credit bureau.\n(3) An inspecting officer appointed under sub-section (1) may examine on oath any director,\nofficer or employee of a credit bureau in relation to its business and may administer an oath\naccordingly.\n1\n[*       *         *         *       *     *       *]\n1\nomitted by Act XXXIV of 2016, s.2."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Power of the State Bank of Pakistan to remove directors or other managerial",
      "content": "persons from office.―(1) Where the State Bank of Pakistan is satisfied that any chairman, director,\nchief executive or any officer, by whatever name called, of a credit bureau, has been, or is likely to\nbe, in breach of the provisions of this Act or rules or regulations made thereunder or any policy,\ndirections or guidelines issued thereunder, it may, for reasons to be recorded in writing, remove from\noffice, with effect from such date as may be specified in the order, or may hold the same liable to a\nfine not exceeding five million rupees:\nProvided that no order under this sub-section shall be made unless concerned person has been\ngiven a reasonable opportunity of being heard against the proposed action and that concerned person\nhas failed to provide an explanation to the satisfaction of the State Bank of Pakistan within the time\nframe specified. In the event of issuance of an order of removal, the chairman, director, chief\nexecutive and officer so removed shall vacate their office on the date specified in the order and the\nvacancy so created shall be filled in accordance with the Companies Ordinance.\n(2) Where the State Bank of Pakistan is satisfied that the board of directors of any credit\nbureau is, or is likely to be, detrimental to the interest of such credit bureau, its shareholders or the\npublic interest or the interest of the credit information system in general or for securing proper\nmanagement of such credit bureau, it is necessary so to do, it may for reasons to be recorded in\nwriting, supersede the board of directors of the credit bureau for such period as may be specified in\nthe order or extended subsequently, however, the total period shall not exceed twelve months:\nProvided that no order under this sub-section shall be made unless the concerned credit\nbureau has been given a reasonable opportunity of being heard against the proposed supersession and\nthat bureau has not provided an explanation to the satisfaction of the State Bank of Pakistan within\nthe time frame specified. In the event of the issuance of an order of supersession under this sub-\nsection, the board of directors, including the chairman, chief executive and directors, by whatever\nname called, shall vacate their offices on the date specified in the order.\n(3) Upon making of an order of supersession under sub-section (2), ―\n(a)     the State Bank of Pakistan may appoint an administrator and shall issue such\ndirections to the appointed administrator as it deems fit and appropriate and\nthe administrator shall be bound to follow the issued directions; and\n(b)    all powers, functions and duties, which may under the provisions of the\nCompanies Ordinance or this Act or any other law for the time being in force\nor by resolution passed in a general meeting of such credit bureau, be\nexercised or discharged by or on behalf of the board of directors of such credit\nbureau until the reconstitution of the board of directors under sub-section (5)\nshall be exercised and discharged by the administrator appointed by the\nState Bank of Pakistan.\n(4) The salary payable to the administrator and any staff assisting the administrator shall be\nfixed by the State Bank of Pakistan and shall be borne by the credit bureau.\n(5) On or before the expiration of two months prior to the expiry of the period of supersession\nspecified in the order of the State Bank of Pakistan issued under sub-section (3), the administrator\nshall call a general meeting of the credit bureau to elect new directors and to reconstitute its board of\ndirectors.\n(6) No person removed from his office under the order of the State Bank of Pakistan shall be\nentitled to any claim or compensation."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Powers of the State Bank of Pakistan to appoint auditors for special audit.―(1)",
      "content": "Where the State Bank of Pakistan is satisfied that it is necessary and expedient to do so in the public\ninterest or in the interest of the credit system, credit bureaus, credit information furnishers, users or\nthe debtors, it may, at any time, direct by written notice that a special audit of a credit bureau shall be\nconducted and the State Bank of Pakistan may by such notice or by a separate notice appoint auditors\nto conduct such special audit of―\n(a)     the accounts of the credit bureau in relation to any transaction or class of\ntransactions or for such period or periods as may be mentioned in the notice;\nand\n(b)     where the credit bureau has not complied with the requirements for audit\nunder sub-section (3) of section 24 or where the State Bank of Pakistan deems\nthat such an audit is required, it may appoint the auditors who shall comply\nwith such notice and directicns of the State Bank of Pakistan and submit a\nreport of such audit to the State Bank of Pakistan.\n(2) The State Bank of Pakistan may issue directions in particular or in general with respect to\n(3) The remuneration of the auditors appointed under sub-section (1) shall be fixed by the\nState Bank of Pakistan with due consideration to the nature and volume of work involved in the audit\nand the expenses of, or incidental to, the audit shall be borne by the credit bureau with respect to\nwhich the audit is conducted."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Functions which a credit bureau may transact.―(1) A credit bureau, in accordance",
      "content": "with the provisions of this Act and rules made thereunder, may―\n(a)     collect, process, collate, store and maintain credit information relating to\ndebtors;\n(b)     provide credit information reports to users and other credit bureaus;\n(c)     undertake credit scoring and to sell such credit scoring to users;\n(d)     consolidate and utilize credit information for purposes of supplying statistics,\nanalysis and conducting research, provided that the identity of the concerned\ndebtor or the credit information furnisher is not disclosed in any manner;\n(e)     undertake any other form of business which may be prescribed by regulations.\n(2) No credit bureau shall engage in any form of business other than those provided under\nsub- section (1)."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Permissible purposes and uses of credit information reports.―(1) A credit bureau",
      "content": "may furnish credit information collected, processed, collated, stored and maintained, in accordance\nwith the provisions of this Act and rules made thereunder in the form of a credit information report,\nunder the following circumstances, namely:―\n(a)    on written or electronically received request of a credit institution;\n(b)    on written or electronic request or instructions of the debtor, to whom it\nrelates, received from such debtor or through a duly constituted attorney\nthereof;\n(c)    on written or electronically received request from Securities and Exchange\nCommission of Pakistan to assist them in discharging their regulatory\nobligations;\n(d)    in Compliance with an order of a competent court having jurisdiction to issue\nsuch order; and\n(e)    for any other purpose, which may be prescribed by regulations.\n(2) A credit bureau may not furnish a credit information report provided reasonable grounds\nare available to believe that the same will not be used for purposes specified under sub-section (1).\n(3) No credit bureau shall maintain its data base at a place outside Pakistan without prior\npermission in writing of the State Bank of Pakistan.\n(4) In the event of winding up, dissolution, liquidation or bankruptcy of a credit bureau or in\ncase of termination of licence, such credit bureau shall immediately cease all such functions and\noperations. The credit information collected, collated, processed, stored and maintained by such\ncredit bureau may be sold to any other credit bureau or the same shall be surrendered to the State\nBank of Pakistan."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Contents of credit information report.―(1) A credit information report issued by a",
      "content": "credit bureau in accordance with the provisions of this Act shall only contain credit information as\nprescribed and shall not contain any information or data relating to a debtor that is not relevant for\nthe purposes of evaluating or assessing the credit worthiness of such debtor.\n(2) Personal information contained in a credit information report relating to an individual\ndebtor shall be limited to such items as may be prescribed by regulations."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Prohibition of collection of credit information.―No credit bureau shall collect credit",
      "content": "information which―\n(a)    violates any law for the time being in force; or\n(b)    intrudes upon, to an unreasonable extent, personal affairs of the individual\nconcerned."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Deletion of information from credit information report.―No credit bureau shall",
      "content": "include information of default or overdue with respect to any obligation involving credit, where the\ndate on which the default or overdue has been settled antedates the credit information report by the\nnumber of years as may be prescribed by rules."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Disclosure of source of credit information.―(1) Every credit bureau, upon request and",
      "content": "payment of fee prescribed by regulations shall disclose to a debtor, clearly and accurately, the source\nof credit information contained in the credit information report of such debtor.\n(2) A credit bureau shall provide to a debtor, a copy of the summary of rights alongwith the\nreport requested under sub-section (1) as set out in the Schedule."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Accuracy and security of credit information files and credit reports.― (1) A credit",
      "content": "bureau shall―\n(a)     take reasonable steps to ensure that the credit information stored, maintained\nand disseminated is accurate, up-to-date, complete and not misleading and for\nthis purpose may make therein appropriate corrections, deletions and additions\nregularly during the course of business; and\n(b)     ensure that the credit information maintained by it is protected by such\nsecurity safeguards as are reasonable in the circumstances against loss,\nunauthorized access, use, modification or disclosure thereof―\n(2) The credit bureau shall follow the standards with respect to systems and procedures,\nincluding any information systems employed by the credit bureau to ensure credit information\naccuracy and security as may be prescribed by regulations.\n(3) Every credit bureau shall arrange to have such systems and procedures independently\naudited every year to ensure adherence to standards prescribed under sub-section (2)."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. False or misleading credit information.―(1) A credit bureau or a credit information",
      "content": "furnisher shall not knowingly disseminate credit information that contains false or misleading\ninformation.\n(2) A credit bureau or credit institution which contravenes sub-section (1) shall be punishable\nwith a fine not exceeding five million rupees."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Unauthorized access to or disclosure of credit information.―(1) No one shall obtain",
      "content": "access to, or distribute or disclose, credit information in the possession or control of a credit bureau\nor a credit information furnisher or a user unless such access or distribution or disclosure is\nauthorized by this Act or any other law for the time being in force.\n(2) Any credit bureau which contravenes the provisions of this section shall be guilty of an\noffence punishable with a fine not exceeding five million rupees or by imprisonment not exceeding\nthree months or with both:\nProvided that the punishment of imprisonment shall be awarded to the director, officer,\nemployee, agent or representative, etc., of the credit bureau who is convicted of such contravention."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Obtaining access to credit information by false pretences.―No one shall obtain access",
      "content": "to credit information in the possession or control of a credit bureau or a credit information furnisher\nor a user under or by false pretences and anyone who violates the provisions of this section shall be\nliable to be punished with a fine, not exceeding one million rupees or by imprisonment not exceeding\nthree months or with both."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Obligations as to fidelity, confidentiality and secrecy.―(1) Every credit bureau, credit",
      "content": "information provider, present or past employee of a credit bureau or credit information provider, or\nother person by reason of his capacity or office to have by any means access to credit information,\nshall regard as secret and confidential all documents or information disclosed to it in connection with\n(2) Every chairman, director, member of the board of directors, auditor, adviser, officer or\nother employee of a credit bureau shall, before entering upon his duties, make a declaration of\nfidelity and secrecy in the form as may be prescribed.\n(3) A disclosure made in any of the following circumstances shall not be deemed inconsistent\nwith any duty imposed by this section being a disclosure.\n(a)    permitted by the provisions of this Act;\n(b)    on the instruction of the consumer to whom the information related;\n(c)    to the consumer to whom the information relates; and\n(d)    as directed by an order of the court."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Exchange of credit information.―Notwithstanding anything contained in this Act,",
      "content": "credit bureaus in Pakistan may exchange credit information on confidential basis amongst\nthemselves, or with other companies as may be approved by the State Bank of Pakistan for the\npurpose of exchange of credit information."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Protection of action taken in good faith.―No suit or other legal proceedings,",
      "content": "prosecution, claims, actions or demands shall lie against the Federal Government, State Bank of\nPakistan, a credit bureau and credit information furnisher or against their directors, officers,\nemployees, agents or representatives or any other person authorized by the same to discharge any\nfunctions under this Act, for any loss or damage caused or that is likely to be caused by anything\nwhich is in good faith done or intended to be done, in pursuance of this Act or the rules and\nregulations made thereunder or any other law or provision having the force of law."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Requirements on users.―In the event that any user takes an adverse action with respect",
      "content": "to a debtor that is based in whole or in part on any information contained in a credit information\nreport relating to such debtor, such user shall provide to such debtor a copy of the credit information\nreport relied upon, the name, address and telephone number of the credit bureau, which issued the\ncredit information report in question, a copy of the summary of rights set out in the Schedule and a\nstatement that the credit bureau did not make the decision to take the adverse action."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Legal recognition of electronic forms.―Any document, record, information,",
      "content": "communication, transaction, publication or notice, made under or for the purposes of this Act,\nwhether required or otherwise, shall be deemed valid if made in electronic form."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Resolution of disputes.―(1) In the event that the accuracy, completeness or correctness",
      "content": "of a credit information report or any part thereof is disputed by the concerned debtor, such debtor\nmay notify in writing to the concerned credit bureau of the alleged error, such credit bureau shall\nresolve or take up the dispute with the credit information furnisher:\nProvided that the rights specified in the Schedule shall also apply to this section.\n(2) The credit information reports shall clearly identify the disputed credit information, if\nany.\nOFFENCES, FINES AND PENALTIES"
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Penalties.―Any person who contravenes or defaults in complying with any provision or",
      "content": "requirement of this Act or of any rules or regulations made thereunder or obstructs lawful exercise of\nany power conferred by or under this Act, shall, if no specific provision is made under this Act, the\nrules and regulations made thereunder for punishment of such contravention, default or obstruction,\nin addition to any other liability as provided for herein, be punishable with fine which may extend to\nfive million rupees and where a contravention, default or obstruction is a continuing one, with a\nfurther fine which may extend to fifty thousand rupees for every day during which the contravention\nor default or obstruction continues."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Adjudication of fine or penalty.―Where only a fine is provided for any offence,",
      "content": "contravention or default in complying with any of the provisions or requirements of this Act or of\nany rule or regulations made thereunder, it shall be adjudged by the State Bank of Pakistan provided\nthat the person concerned is afforded an opportunity of being heard."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Application of fines or penalties.―(1) The Court imposing any fine or penalty under",
      "content": "this Act may direct that the whole or any part thereof shall be applied in or towards―\n(a)    payment of costs of the proceedings; or\n(b)    for such purposes as may be directed by the Court.\n(2) Any amount recovered as fine or penalty, which is not applied as aforesaid, shall be\ncredited to the Public Account of the Federal Government."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Adjudication of punishment by imprisonment.―(1) Where imprisonment or",
      "content": "imprisonment in addition to fine is provided for any contravention of, or default in complying with,\nany provisions of this Act and any rules or regulations made thereunder, it shall be adjudged by the\nCourt.\n(2) The Court shall not take cognizance of any offence punishable under this Act except upon\na complaint in writing made by an officer of the State Bank of Pakistan or by a person authorised\nby the Federal Government in this behalf."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Appeal.―Any person aggrieved by decision of the Court under this Part, may within",
      "content": "thirty days of date of the decision, prefer an appeal to the High Court."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Complaint to State Bank of Pakistan.―Any person aggrieved by any action or",
      "content": "omission of a credit bureau, credit institution, debtor, user or any other person under this Act may\nmake a complaint to the State Bank of Pakistan to resolve the dispute in such manner as it deems fit."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Appeal to High Court.―Any person aggrieved by decision, of the State Bank of",
      "content": "Pakistan may, within thirty days of date of the decision, prefer an appeal to the High Court."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Removal of difficulties.―If any difficulty arises in giving effect to any of the provisions",
      "content": "of this Act, the Federal Government may make such order as may appear to it to be necessary for the\npurpose of removing the difficulty:\nProvided that such power under this section shall not be exercisable after two years of the\ncommencement of this Act."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Power of the Federal Government to make rules.―The Federal Government may,",
      "content": "after consultation with the State Bank of Pakistan and by notification in the official Gazette, make\nrules to provide for all matters for which provision is necessary or expedient for the purposes of\ngiving effect to the provisions of this Act."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Power to make regulations.―The State Bank of Pakistan may, by notification in the",
      "content": "official Gazette, make regulations not inconsistent with the rules to provide for all matters for which\nprovision is necessary.\n[see sections 23(2), 31 and 33]"
    }
  ],
  "definitions": [
    {
      "term": "adverse action",
      "definition": "any action which causes a denial, rejection, cancellation of or reduction in or otherwise any unfavourable result in any transaction involving credit, finance, trade, commerce or employment with respect to a debtor;",
      "source_provision": "sec2"
    },
    {
      "term": "banking",
      "definition": "the accepting, for the purposes of lending or investment, of deposit of money from the public, repayable on demand or otherwise, and withdrawable by cheque, draft, order or otherwise;",
      "source_provision": "sec2"
    },
    {
      "term": "banking company",
      "definition": "any company which transacts business of banking in Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "banking policy",
      "definition": "any policy formulated by the State Bank of Pakistan in the interest of banking or in the interest of monetary stability or sound economic growth, having due regard to the interest of the depositors, the volume of deposits and other resources of the bank and the need for equitable allocation and the efficient use of these deposits and resources;",
      "source_provision": "sec2"
    },
    {
      "term": "companies Ordinance",
      "definition": "the Companies Ordinance, 1984 (XLVII of 1984);",
      "source_provision": "sec2"
    },
    {
      "term": "company",
      "definition": "a company incorporated under the Companies Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "court",
      "definition": "the court of sessions having territorial jurisdiction in the area where the cause of action arises or offences committed under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "credit bureau",
      "definition": "a public limited company established under the Companies Ordinance which has been granted a licence by the State Bank of Pakistan in accordance with this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "credit information",
      "definition": "any information with respect to a debtor relating to― (i) the amounts, nature of loans or advances, finance and other credit facilities granted by a credit institution and repayment thereof by the debtor and the nature of security taken by a credit institution for credit facilities granted; (ii) the guarantee or any other non-fund based facility furnished by a credit institution for the benefit thereof; (iii) the amounts and nature of commercial transactions, facilities and services entered into or availed of credit from non-financial companies and bodies and other lenders and authorities including but not limited to retailers, insurance companies, utility providers and landlords as notified by the Federal Government; (iv) any and all factors included in the financial history bearing on the credit worthiness, credit standing and credit capacity thereof; (v) any other related public record and information as prescribed by rules; or (vi) personal information as prescribed by rules;",
      "source_provision": "sec2"
    },
    {
      "term": "credit information furnisher",
      "definition": "any credit institution, person or entity which provides credit information to a credit bureau including non-financial companies and bodies and other lenders and authorities;",
      "source_provision": "sec2"
    },
    {
      "term": "credit information report",
      "definition": "any written or electronic communication issued by a credit bureau containing credit information relating to any debtor for the purposes of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "credit institution",
      "definition": "― (i) a banking company; (ii) microfinance banks; (iii) a financial institution, which means (a) any company, whether incorporated within or outside Pakistan, which transacts business of banking or any associated or ancillary business in Pakistan through its branches within or outside Pakistan and includes a government savings bank but excludes the State Bank of Pakistan; (b) a modaraba, leasing company, investment bank, financing company, unit trust or mutual fund of any kind and credit or investment institution, corporation or company; and (c) any company authorized by law to carry on any similar business; (iv) non-banking financial company; and (v) any company, corporation or institution or class of companies or institutions as the Federal Government may from time to time, by notification in the official Gazette, specify for the purpose;",
      "source_provision": "sec2"
    },
    {
      "term": "credit scoring",
      "definition": "a system whereby points are awarded to debtors enabling users to asses the credit worthiness and capacity of debtors to repay loans and advances and to discharge any and all other obligations with regard to credit facility availed of or to be availed of by the debtors;",
      "source_provision": "sec2"
    },
    {
      "term": "debtor",
      "definition": "a person to whom finance as defined in the Financial Institutions (Recovery of Finances) Ordinance, 2001(XLVI of 2001) has been provided, including those who have been credit recipients and who are potential recipients of credit as notified by the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "default",
      "definition": "omission or failure to perform a legal or contractual obligation involving credit;",
      "source_provision": "sec2"
    },
    {
      "term": "licence",
      "definition": "the licence issued by the State Bank of Pakistan to a public limited company for the purpose of functioning as, and carrying out the business of, a credit bureau in accordance with the provisions of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "person",
      "definition": "an individual, association or body of individuals, company, firm, authority, institution or any other entity;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules or regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Schedule",
      "definition": "a Schedule to this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "user",
      "definition": "any person or body which obtains a credit information report from a credit bureau under this Act. (2) The words and expressions used and not defined in this Act shall have the meanings as assigned to them in the Companies Ordinance, 1984 (XLVII of 1984), State Bank of Pakistan Act, 1956 (XXXIII of 1956) and Banking Companies Ordinance, 1962 (LVII of 1962).",
      "source_provision": "sec2"
    }
  ]
}
