{
  "id": "pk-cutting-of-trees-prohibition-act-1992",
  "type": "statute",
  "title": "Cutting of Trees (Prohibition) Act, 1992",
  "title_en": "Cutting of Trees (Prohibition) Act, 1992",
  "short_name": "COTA",
  "status": "in_force",
  "issued_date": "1992-11-30",
  "in_force_date": "1992-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apmaZQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Cutting of Trees (Prohibition) Act, 1992 (XVIII of 1992) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. This Act may be called the Cutting of Trees",
      "content": "(Prohibition) Act, 1992.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(a)     ‘authorised officer’ means an officer authorised by a Provincial Government;\n(b)     ‘field’ means a khasra number as defined in the Provincial law relating to land\nrevenue;\n(c)     ‘first zone’ means an area adjacent to and beyond the external frontier of\nPakistan extending towards Pakistan to a line at four kilometers measured\nfrom the external frontiers of Pakistan;\n(d)     ‘second zone’ means an area adjacent to and beyond the first zone extending\ntowards Pakistan to a line at four kilometers measured from the first zone ; and\n(e)     ‘tree’ means a large plant with a self-supporting trunk."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Cutting of trees etc. Prohibited",
      "content": "(1) Except as hereinafter provided, no person shall,\nwithout the prior written approval of the authorised officer, cut, fell or damage or cause to be cut,\nfelled or damaged any tree growing—\n(i)     in the first zone,, if the number of remaining trees in any field falls short of the\nnumber to be calculated at the rate of fifteen trees per acre ; and\n(ii)    in the second zone, if the number of remaining trees in any field falls short of\nthe number to be calculated at the rate of ten trees per acre.\n(2) Nothing contained in sub-section (1) shall apply to a tree growing on land occupied as the\nsite of a town or village or in a dwelling-house, including its curtilage."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Penalty. Whoever contravenes the provisions of this Act shall be guilty of an offence",
      "content": "punishable—\n(i)     with fine which may extend to five thousand rupees, if he contravention relates\nto the first zone ; and\n(ii)    with fine which may extend to two thousand and five hundred rupees, if the\ncontravention relates to the second zone."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Cognizance of offences. No court shall take cognizance of an offence under this Act,",
      "content": "except on a complaint by the authorised officer or the local formation commander of the Pakistan\nArmy."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Seizure and confiscation of Property",
      "content": "(1) When any tree has been cut, felled or\ndamaged in contravention of the provisions of this Act or rules made thereunder, such tree together\nwith all tools used in committing any such contravention may be seized by the authorised officer.\n(2) Every officer seizing any property under this section shall place on such property a mark\nindicating that the same has been so seized and shall, as soon as may be, make report of such seizure\nto the Magistrate having jurisdiction to try the offence under this Act.\n(3) Upon the receipt of any such report, the Magistrate shall, with all convenient despatch,\ntake such measures as may be necessary for the trial of the offender and the disposal of the property\naccording to law.\n(4) Any tree in respect of which an offence has been committed under this Act and all tools\nused in committing any such offence shall be liable to confiscation, and such confiscation shall be in\naddition to any other punishment prescribed for such offence."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power to prevent commission of offences. The authorised officer shall prevent the",
      "content": "commission of any offence under this Act and for that purpose may take such measures as may be\nprescribed by the rules under this Act."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Provincial Governments to demarcate zones. The Provincial Governments may,",
      "content": "whenever it may deem expedient, cause the zones defined in section 2 to be demarcated and the trees\ngrowing in any zone to be enumerated."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Power to enter etc. Any authorised officer or any other person authorized to demarcate the",
      "content": "zones and enumerate the trees shall be entitled to enter upon any land, and—\n(i)     to survey and land;\n(ii)    to make map of any zone ;\n(iii)   to erect or cause to be erected boundaries marks ; and\n(iv)    to blaze any tree."
    }
  ],
  "definitions": []
}
