{
  "id": "pk-daanish-schools-authority-act-2026",
  "type": "statute",
  "title": "Daanish Schools Authority Act, 2026",
  "title_en": "Daanish Schools Authority Act, 2026",
  "short_name": "DSAA",
  "status": "in_force",
  "issued_date": "2026-01-25",
  "in_force_date": "2026-01-25",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tobw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Daanish Schools Authority Act, 2026 (VI of 2026) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.",
      "content": "_ (1) This Act shall be called the Daanish Schools\nAuthority Act, 2026.\n(2) It shall extend to the Islamabad Capital Territory and to Daanish Schools wherever they may\nbe.\n(3) It shall come in to force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.",
      "content": "_ In this Act unless the context otherwise requires,\n(a)     “Administration” means administration of Daanish School comprising a principal,\nsenior teacher, teachers and other staff etc.;\n(b)     “Authority” means the Daanish Schools Authority established under section 3;\n(c)     “Chairperson” means the Prime Minister of the Islamic Republic of Pakistan or a\nperson of eminence nominated by him;\n(d)     “destitute child” means a child whose combined household's gross income does\nnot exceed the minimum wage as notified by the Federal Government or any other\namount specified by the Authority;\n(e)     “Vice-Chairperson” means the Federal Minister of the Division concerned;\n(f)     “Daanish School” means a School established or notified by the Authority under\nthis Act and includes any school established or notified before the commencement\nof this Act;\n(g)     “Executive Committee” means a committee constituted under section 7;\n(h)     “Fund” means the Fund established under section 13;\n(i)     “governing body” means governing body constituted under section 9;\n(j)     “Government” means Federal Government;\n(k)     “member” means a member of the Authority;\n(l)     “Managing Director” means Managing Director of the Authority appointed under\nsection 6;\n(m)     “prescribed” means prescribed by rules or regulations made under this Act;\n(n)     “rules” means rules made under this Act;\n(o)     “regulations” means regulations made under this Act;\n(p)     “student” means a student of a Daanish School; and\n(q)     “teacher” includes the Principal and an employee of a Daanish School who is\nimparting instructions to the students."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Authority.",
      "content": "_ (1) On commencement of this Act there stands established an Authority to be\ncalled the Daanish Schools Authority.\n(2) The Authority shall be body corporate having perpetual succession and a common seal with\npower to enter into contract and shall, by its name, sue and be sued.\n(3) The Authority shall consist of the following, namely:\nS. No.                   Membership                                      Status\n(1)                         (2)                                           (3)"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Secretary, Ministry of Finance or his Member",
      "content": "nominee, an officer not below the rank of\nBS-21"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Secretary, Ministry of Planning, Member",
      "content": "Development and Special Initiatives or his\nnominee, an officer not below the rank of\nBS-21"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. two prominent persons from private sector Members",
      "content": "having experience in the field of business,\nfinance, social service or philanthropy"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Managing Director Member",
      "content": "(4) The Managing Director shall act as secretary of the Authority.\n(5) The Chairperson may co-opt any government servant or private individual having expertise\nin the field of education, literature, fine arts, social work or development sector, as member of the\nAuthority for a meeting only or for a specified period.\n(6) The members mentioned at S.No. 6 and 7 in sub-section (3) shall be nominated by the\nChairperson for a renewable term of three years and shall serve on pro bono basis.\n(7) In absence of Chairperson, the Vice-Chairperson shall act as the Chairperson.\n(8) The Authority may determine its procedure for meetings and related affairs.\n(9) The Authority shall adhere to the applicable Provincial laws of the concerned Province."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Managing Director.",
      "content": "_ (1) The Federal Government shall appoint a Managing Director of the\nAuthority having such experience and qualification and on such terms and conditions as may be\nprescribed by rules. The Managing Director shall be the Chief Executive Officer of the Authority.\n(2) The Managing Director shall hold office for three years, however, the Government may\nremove him at any time for reasons to be recorded and after providing him an opportunity of hearing.\n(3) The Managing Director shall perform such functions and exercise such powers as prescribed\nby regulations.\n(4) The Managing Director may delegate any of his powers or functions to any member of the\nExecutive Committee."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Governing bodies of schools",
      "content": "_(1) The Authority shall establish such number of Danish\nSchools under the provisions of this Act as it may deem appropriate and it may, by notification in the\nofficial Gazette, declare any school as Daanish School in the manner prescribed by rules.\n(2) The Authority shall constitute and appoint a governing body for every Danish School to serve\nfor a term of two years in the manner prescribed by regulation. All members of the governing body shall\nbe from the concerned Province, preferably from the local area and shall serve on a pro bono basis.\n(3) The governing body shall consist of five or more members who, in the opinion of the\nAuthority, possess sound moral and financial integrity, enjoy an unquestioned and non-controversial\nreputation and do not have any conflict of interest with the aims and objects of the Daanish School.\n(4) The Authority shall nominate one of the members of the governing body as convener of the\ngoverning body.\n(5) The Principal of the concerned Daanish School shall be the secretary of the governing body\nof that School.\n(6) No person shall be appointed as member of more than two governing bodies.\n(7) The Authority may delegate administrative and financial powers of a Daanish School to its\ngoverning body in the manner prescribed by regulations.\n(8) The Authority may, for reasons to be recorded in writing, dissolve a governing body and\nappoint a new governing body within three months of such dissolution.\n(9) If the Authority dissolves a governing body, it may appoint any person as administrator of\nthat Daanish School to look after the affairs of the School till the appointment of the governing body."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Admission to Daanish School.",
      "content": "_ (1) The governing body shall ensure that admissions in\nthe Daanish School shall be merit-based and only ten percent of total seats of students shall pay such fee\nand other expenses as may be prescribed by regulations.\n(2) Subject to sub-section (1), the Governing Body shall admit destitute children, in order of\nprecedence, under any of the following categories, namely: ___\n(a)     orphan having lost both of his parents and having no guardian;\n(b)     orphan and living with real parent; and\n(c)     both parents are alive but are illiterate and do not own immoveable property and\neither of them is disabled and have no source of income.\n(4) The governing body may admit a student whose one of the parent is an employee of the\nDaanish School.\n(5) The governing body shall determine the merit for the admission in the school on the basis of\ncriteria prescribed by regulations.\n(6) The Authority may, for the reasons to be recorded in writing, alter or set-aside any decision\nof the governing body if it finds that the decision is not based on the criteria for admission."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Finance Committee.",
      "content": "_ The Authority shall constitute a Finance Committee consisting of\nsuch members having such functions as may be prescribed by regulations."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Fund",
      "content": "_(1) There shall be established a fund to be known as the Daanish Schools Authority\nFund which shall vest in the Authority and shall be utilized by the Authority for the purpose of this Act,\nand to meet charges and expenditures in connection with its functions including salaries and other\nremuneration of the Managing Director, members, officers, staff, experts and consultants of the\nAuthority.\n(2) The fund shall be kept in such custody and shall be utilized and regulated in such manner as\nmay be prescribed by rules.\n(3) The Fund shall be consist of,\n(a)     grants made by the Government;\n(b)     funds provided by the Federal and provincial government;\n(c)     loans and grants from the national or international agencies received by the\nAuthority to finance the functions of the Authority;\n(d)     charges and fees collected by such sources as may be\napproved by the Authority;\n(e)     income from investments and deposits as approved by the Authority and in\naccordance with rules;\n(f)     income from the sale of movable or immovable property; and\n(g)     donations and endowments."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Budget and Accounts.",
      "content": "_ (1) The Managing Director shall prepare the annual budget of the\nAuthority.\n(2) The Managing Director shall, with the approval of the Chairperson, place the budget proposals\nfor approval before the Authority.\n(3) The accounts of the Authority shall be maintained in such manner as may be prescribed by\nrules."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Audit.",
      "content": "_ (1) The annual accounts of the Authority shall be audited in terms of Articles 169\nand 170 of the Constitution and by a reputable firm of chartered accountants, within the meaning of\nChartered Accountants Ordinance, 1961 (X of 1961), appointed by the Authority.\n(2) The provisions of the Public Finance Management Act, 2019 mutatis mutandis shall apply to\nthe Authority."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Reports",
      "content": "_ (1) The Executive Committee shall prepare and submit, to the Authority, an\nannual performance report of the Schools for the year ending on 30th April.\n(2) The Authority shall submit the annual performance report, for a financial year before 31st\nJuly, to the Government."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Public servants",
      "content": "_A person appointed, acting or purporting to act in pursuance of any\nprovision of this Act, shall be deemed to be public servant within the meaning of section 21 of the\nPakistan Penal Code, 1860 (XLV of 1860)."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Instructions and guidelines",
      "content": "_(1) The Authority may issue general or special instructions\nor guidelines to the Executive Committee and governing bodies for proper management of the Daanish\nSchools on any matter related to the functioning of the school.\n(2) The instructions or guidelines issued by the Authority shall be binding on such Executive\nCommittee and governing body."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Transfer of government employees",
      "content": "_(1) The Government may, with the concurrence of\nthe Authority, transfer the services of any of its employees to the Authority.\n(2) The Authority may, with the concurrence of an employee and the Government, absorb or\ninduct the services of the employee into its service.\n(3) The terms and conditions of the services of an employee transferred from the Government or\nabsorbed in the service of the Authority shall be such as may be prescribed."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Rules",
      "content": "_The Federal Government may, by notification in the official Gazette make rules for\ncarrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Regulations",
      "content": "_Subject to the rules made under section 19, the Authority may, by notification\nin the official Gazette make regulations to give effect to the provisions of the Act."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Indemnity",
      "content": "_No suit, prosecution or other proceedings shall lie against the Federal\nGovernment or its officer for anything in good faith, done or intended to be done in pursuance of this\nAct or the rules made thereunder."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Savings",
      "content": "_All schools established or notified as Daanish Schools before the commencement\nof this Act shall be deemed to have been established or notified under this Act.\n____________\nRGN Dated: 07-02-2026"
    }
  ],
  "definitions": [
    {
      "term": "Administration",
      "definition": "administration of Daanish School comprising a principal, senior teacher, teachers and other staff etc.;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "the Daanish Schools Authority established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairperson",
      "definition": "the Prime Minister of the Islamic Republic of Pakistan or a person of eminence nominated by him;",
      "source_provision": "sec2"
    },
    {
      "term": "destitute child",
      "definition": "a child whose combined household's gross income does not exceed the minimum wage as notified by the Federal Government or any other amount specified by the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "Vice-Chairperson",
      "definition": "the Federal Minister of the Division concerned;",
      "source_provision": "sec2"
    },
    {
      "term": "Daanish School",
      "definition": "a School established or notified by the Authority under this Act and includes any school established or notified before the commencement of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Executive Committee",
      "definition": "a committee constituted under section 7;",
      "source_provision": "sec2"
    },
    {
      "term": "Fund",
      "definition": "the Fund established under section 13;",
      "source_provision": "sec2"
    },
    {
      "term": "governing body",
      "definition": "governing body constituted under section 9;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "Managing Director",
      "definition": "Managing Director of the Authority appointed under section 6;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules or regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "student",
      "definition": "a student of a Daanish School; and",
      "source_provision": "sec2"
    },
    {
      "term": "teacher",
      "definition": "the Principal and an employee of a Daanish School who is imparting instructions to the students.",
      "source_provision": "sec2"
    }
  ]
}
