{
  "id": "pk-decorations-act-1975",
  "type": "statute",
  "title": "Decorations Act, 1975",
  "title_en": "Decorations Act, 1975",
  "short_name": "Decorations Act, 1975",
  "status": "in_force",
  "issued_date": "1975-04-27",
  "in_force_date": "1975-04-27",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2Ns-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Decorations Act, 1975 (XLIII of 1975) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Act may be called the Decorations Act,"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,\n(a)        \"academic distinction\" includes__\n(i)         research, achievement or performance in medicine, science,\nengineering, technology, philosophy, history, literature or the arts ;\n(ii)        invention of national importance;\n(b)        \"decorations\" means any Title, Honour, Award, Order, Medal, Bar, Clasp or\nCommendation instituted or created under section 3, and includes the\ndecorations enumerated in the Schedule;\n4\n[(c)   \"gallantry\" includes an act of bravery, heroism, courage and rendering of\ndedicated services with selfless devotion in human rights and public service;]\n(d)        \"meritorious service in the Armed Forces\" means service rendered by the\nmembers of the Armed Forces in Peace or War or Emergency or in relation to\nany national historic occasion which is worthy of decoration.\n1\nFor Statement of Objects and Reasons, see Gaz. of P., 1975, Ext., Pt. III, p.183.\n2\nSubs. by the Decorations (Amdt.) Ordinance, 1981 (35 of 1981),s.2.\n3\nBy corrigenda.\n4\nSubs. by the Decorations (Amdt.) Act, 1997 (8 of 1997),s.2, for clause (c)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Institution or creation of decorations",
      "content": "(1) The President may, by warrant, institute,\nor create, from time to time any decorations in recognition of gallantry, meritorious service in the\nArmed Forces 1[, academic distinction or distinction in the field of sports or nursing] and prescribe the\nconditions under which a decoration may be awarded, conferred, withdrawn, forfeited or annulled, or\nmay be restored after its withdrawal, forfeiture or annulment.\n(2)    The President may also award decoration posthumously and the monetary reward, if\nany, attached to the decoration shall be paid to the next of kin of the person to whom the decoration is\nawarded.\n(3)     No decoration shall be awarded, conferred, withdrawn, forfeited or annulled, and no\ndecoration which has been withdrawn, forfeited or annulled shall be restored, except with the personal\napproval of the President.\n(4)     Every award, conferment, withdrawal, forfeiture, annulment and restoration of a\ndecoration shall be published in the official Gazette."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Continuance of existing decorations and their Warrants of Institution and",
      "content": "__\nstatutes. (1) All the decorations enumerated in the Schedule and the Warrants of institution and\nstatutes, rules, regulations and instructions pertaining thereto, which were in force immediately before\nPresident.\n(2)   The President may, by order, amend the Schedule so as to include therein or exclude\ntherefrom any decoration.\n(3)     Notwithstanding anything contained in sub-section (1), the President may, at any time,\nwithdraw, forfeit or annul any decoration awarded to, or conferred on, any person, and upon such\nwithdrawal, forfeiture or annulment of any decoration, the person concerned shall cease to have any\nright or privilege appertaining thereto; but the President may restore any such decoration after its\nwithdrawal, forfeiture or annulment."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Restriction on creation, conferment or acceptance of decorations",
      "content": "(1) Subject to\nperson, any Title, Honour, Award, Order, Medal, Bar, Clasp or Commendation of the nature of a\ndecoration or which is an imitation of any decoration.\n(2)    No citizen of Pakistan and no person in the service of Pakistan shall accept any title,\nhonour or decoration from any foreign State or sovereign except with the approval of the Federal\nGovernment.\n(3)     No person to whom a decoration has not been awarded or on whom a decoration has\nnot been conferred, and no person whose decoration has been withdrawn, forfeited or annulled, shall\nuse or cause to be used with his name any words or letters representing that the decoration has been\nawarded to, or conferred on, him.\n1\nSubs. by the Decoration (Amdt.) Ordinance, 1981 (35 of 1981),s.3."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Penalty and procedure",
      "content": "(1) Whoever contravenes the provisions of section 5 shall\nbe punished with fine which may extend to twenty thousand rupees.\n(2)     A person convicted under this section for accepting any decoration from a foreign State\nor sovereign shall be deemed to have been deprived of such decoration.\n(3)    No prosecution for an offence punishable under this Act shall be instituted except with\nthe previous sanction of the Federal Government.\n(4)     No Court inferior to a Court of Session shall try an offence punishable under this Act."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Tamgha",
      "content": "i-Khidmat (Military) Class I, II and III."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Republic Commemoration Medal",
      "content": "1\nIns. and added by order dated. 22-3-76 published in the Gaz. of P., Ext., (Islamabad), Pt. III, pp. 261-62."
    }
  ],
  "definitions": [
    {
      "term": "decorations",
      "definition": "any Title, Honour, Award, Order, Medal, Bar, Clasp or Commendation instituted or created under section 3, and includes the decorations enumerated in the Schedule; 4 [(c) \"gallantry\" includes an act of bravery, heroism, courage and rendering of dedicated services with selfless devotion in human rights and public service;]",
      "source_provision": "sec2"
    },
    {
      "term": "meritorious service in the Armed Forces",
      "definition": "service rendered by the members of the Armed Forces in Peace or War or Emergency or in relation to any national historic occasion which is worthy of decoration. 1 For Statement of Objects and Reasons, see Gaz. of P., 1975, Ext., Pt. III, p.183. 2 Subs. by the Decorations (Amdt.) Ordinance, 1981 (35 of 1981),s.2. 3 By corrigenda. 4 Subs. by the Decorations (Amdt.) Act, 1997 (8 of 1997),s.2, for clause (c).",
      "source_provision": "sec2"
    }
  ]
}
