{
  "id": "pk-defence-housing-authority-islamabad-act-2013",
  "type": "statute",
  "title": "Defence Housing Authority Islamabad Act, 2013",
  "title_en": "Defence Housing Authority Islamabad Act, 2013",
  "short_name": "DHAIA",
  "status": "in_force",
  "issued_date": "2013-03-15",
  "in_force_date": "2013-03-15",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FqbJc%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Defence Housing Authority Islamabad Act, 2013 (XII of 2013) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Removal of difficulty",
      "content": "DEFENCE HOUSING AUTHORITY ISLAMABAD ACT, 2013\nACT NO XII OF 2013\n[19th March, 2013]\nAn Act to provide for establishment of Defence Housing Authority Islamabad\nWHEREAS it is expedient to establish Defence Housing Authority Islamabad for the purpose\nand object of carrying out schemes and projects of land development, inter alia for welfare of the\nbereaved families of martyrs, war injured, disabled and other persons of the defence forces of\nPakistan to boost their morale; to provide financial security in recognition of their selfless services\nfor the defence of the nation; and to provide for ancillary matters;\nIt is hereby enacted as follows: —"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Defence\nHousing Authority Islamabad Act, 2013.\n(2) It extends to the specified area in Islamabad Capital Territory.\n(3) It shall come into force at once and shall be deemed to have taken effect on and from the\n15th August, 2010."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything 1[repugnant] in the subject or context,\n—\n(a)       “Administrator” means the Administrator appointed under section 8;\n(b)       “Authority” means the Defence Housing Authority Islamabad established\nunder section 3;\n(c)       “Chairman” means Chairman of the Governing Body;\n(d)       “Executive Board” means Executive Board constituted under this Act;\n(e)       “Governing Body” means Governing Body constituted under section 4;\n(f)       “Government” means the Federal Government;\n(g)       “member” means a member of the Authority and includes the Chairman;\n(h)       “prescribed” means prescribed by 1[**] regulations made under this Act;\n(i)       “President” means President of the Executive Board;\n1\nSubs. and omitted by Act XL of 2023, s.2.\n1\n[(j)   \"project\" means any project of construction, repair, renovation, maintenance,\nup-gradation and development of any facility or land or area undertaken or\nplanned by the Authority to achieve a particular aim in the specified area;\n(k)        \"scheme” means any scheme, plan, facility or project for development of land\nfor residential, commercial or other use, undertaken, planned or made and\napproved by the Authority under this Act;]\n(l)        “Secretary” means Secretary of the Authority;\n(m)        “specified area” means all land owned, purchased or procured by or vested in\nor leased to the Army Welfare Housing Scheme or the Defence Housing\nAuthority Islamabad constituted under any law before the commencement of\nthis Act in Islamabad Capital Territory and such other land as may, from time\nto time, be purchased or procured by or leased to the Authority in Islamabad\nCapital Territory and notified by the Government; and\n1\n[(n)   *          *       *   *      *       *      *]\n1\n[(o)   “welfare and rehabilitation activities” mean activities done or undertaken by or\nthrough the Authority for the purpose of welfare and rehabilitation of serving\nor retired personnel of the defence forces, inter alia, officers, soldiers,\nbereaved families of Shuhada, war wounded or disabled personnel or other\npeople.]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. The Authority",
      "content": "(1) There shall be established an Authority to be known as Defence\nHousing Authority Islamabad for carrying out purposes of this Act.\n(2) The Authority shall be a body corporate having perpetual succession and common seal\nwith power to purchase, procure, sell, exchange, hold and dispose of property and shall by the said\nname, sue and be sued.\n(3) The head office of the Authority shall be at Islamabad.\n(4) While designing, planning and executing a scheme in the specified area, the Authority\nshall adhere to the master plan of Islamabad and ensure that all public roads and revenue paths\nleading to and from the adjoining areas and access to graveyards shall, as far as possible, be\nmaintained and no change or alteration shall be made in such roads, paths or access except with prior\napproval of the Government.\n(5) Subject to the financial viability of a Scheme, the Authority shall reserve in a scheme in\nthe specified area at least fifty per-cent quota for the bereaved family of the martyrs, war injured,\ndisabled and junior ranks from sepoys to junior commissioned officers of the defence forces of\nPakistan.\n1\nSubs. omitted and added by Act XL of 2023, s.2.\n1[(6)In particular and without prejudice of the generality of the provisions of this Act, the\nAuthority shall take all such measures and exercise all such powers as may be necessary for carrying\nout the purposes of this Act, as well as to carry out any other works or activities connected therewith,\nor ancillary thereto.]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Governing Body",
      "content": "(1) The general administration, supervision and control of the affairs\nof the Authority shall vest in the Governing Body, which shall consist of, —\n(a)        Secretary, Ministry of Defence;                            Chairman\n(b)       Adjutant General Pakistan Army;                             Vice-Chairman\n(c)       a serving or retired Major General of Pakistan              Member\nArmy to be nominated by the Chief of Army Staff:\n(d)        Chief Commissioner, Islamabad;                             Member\n(c)        Administrator;                                             Member\n(f)        Chairman, Capital Development Authority; and               Member\n(g)       Secretary.                                                  Member-cum-\nSecretary\n(2)        The Governing Body shall,—\n(a)        review progress and activities of the Authority;\n(b)       lay down policy for guidance of the Executive Board;\n(c)        consider and approve budget and audit reports of the Authority; and\n(d)       transact such other business of the Authority as the Executive Board may\nplace before it."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Executive Board",
      "content": "(1) There shall be an Executive Board which shall exercise such\nadministrative executive and financial powers of the Authority and do all such acts and functions as\nthe Governing Body may delegate or assign to it.\n(2) The Executive Board shall consist of,—\n(a)       Adjutant General, Pakistan Army;                              President\n1\n(b)       a serving or retired Major General of Pakistan Army               [member]\nto be nominated by the Chief of Army Staff;\n1\nAdded and Subs. by Act XL of 2023, s3-4.\n(c)    Administrator;                                                  Member\n(d)    Secretary of the Authority to be appointed by the               and Secretary\nPresident;\n(e)    two residents of Schemes of the Authority                       Co-opted\nMembers\n(3) The Government shall, for a period not exceeding five years at a time, appoint the co-\nopted members in accordance with the regulations but they shall serve during the pleasure of the\nGovernment.\n(4) In the performance of its functions, the Executive Board shall comply with the directions\nof Governing Body."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Powers and functions of Executive Board",
      "content": "(1) Subject to all applicable laws and\nprovisions of this Act, the Executive Board may take such measures and exercise such powers as\nmay be necessary for proper planning and development of the specified area and for carrying out\npurposes of this Act.\n(2) Without prejudice to the generality of the foregoing powers, the Executive Board may, in\naccordance with all applicable laws, rules and regulations, —\n(a)    purchase, procure, hold, manage, reclaim and take possession of any property\nin the specified area;\n(b)    prepare, plan, develop, notify, execute, implement, maintain, manage and\nregulate any scheme in the specified area;\n(c)    enter into contracts, arrangements, joint ventures, and agreements with any\nperson, for preparation, planning, development, execution, implementation\nand maintenance of schemes in the specified area and for carrying out\npurposes of this Act;\n(d)    incur any expenditure and procure plant, machinery, equipment, instrument\nand necessary materials;\n(e)    carry out, maintain, arrange, manage and provide all facilities, services and\nutilities, including water, electricity, gas and sewerage in schemes in the\nspecified area so as to ensure that the property is maintained up to the required\nstandards for benefit of the residents;\n(f)    plan, approve and execute mergers and amalgamations with other housing\nschemes or cooperative housing societies subject to approval of the competent\nauthorities of those housing schemes or housing societies for merger and\namalgamation;\n1\n[(g)   impose, vary and recover any fee or charges for rendering any service within\nany scheme in the specified area including registration fee, transfer fee,\nmanagement fee, development or re-development charges or additional\ndevelopment charges and maintenance fee, dues and charges, etc.;]\n(h)        lease, purchase procure, sell, exchange, mortgage, rent out or otherwise\ndispose of any property vested in the Authority;\n(i)        cancel or re-plan any scheme or part thereof in the specified area;\n(j)        apply for acquisition of land to the Government for initiation and completion\nof process of land acquisition in accordance with the law governing land\nacquisition; 1[*]\n1\n[(ja) carryout welfare and rehabilitation activities in accordance with the\nprovisions of this Act;]\n(k)        do all such acts deeds and things that may be necessary or expedient for the\npurpose of proper preparation, planning, development, execution,\nimplementation, management and maintenance of residential and commercial\nfacilities 1[including arrangement of security] in the schemes in the specified\narea.\n(3) The Executive Board shall meet as and when required or considered necessary by the\nAdministrator, in consultation with the President.\n(4) The Executive Board shall transact such business at a meeting as the Administrator may\nplace before it:\nProvided that the Defence Housing Authority shall obtain N.O.C from civic amenities\nproviding agencies who are responsible for supply of services like water, sewerage and sanitation\netc, and civic utilities like electricity, gas and telephone etc. working as autonomous bodies."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Powers of the Executive Board to borrow",
      "content": "Subject to the Government’s rules and\nguidelines, the Executive Board may obtain loans for the purposes of generating capital for its\nschemes."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Administrator",
      "content": "(1) The Chief of Army Staff shall nominate a person not below the\nrank of serving or retired Brigadier of Pakistan Army, as Administrator of the Authority.\n(2) The Administrator shall be the chief executive officer of the Authority."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Powers and functions of the Administrator",
      "content": "(1) Subject to provisions of this Act and\nthe regulations, the Administrator shall exercise all executive powers of the Authority, delegated to\nhim or otherwise, in accordance with the policy laid down by the Governing Body and the directions\nor decisions of the Executive Board.\n1\nSubs. omitted and Ins. by Act XL of 2023, s.5.\n(2) The Administrator may, either by himself or through any officer appointed by the\nExecutive Board in this behalf, carry on the correspondence and shall sign, verify, pursue and file all\npleadings and such other documents on behalf of the Authority, in any suit, appeal, petition and\nproceedings which may be instituted, prepared and filed by or against the Authority in or before any\ncourt, tribunal or authority.\n(3) The Administrator may, with approval of the Executive Board, delegate any of his\nspecified powers to any of his sub-ordinate staff, including but not limited to sign contracts,\npleadings or any other legal instruments on behalf of the Authority.\n(4) Subject to conditions of delegation of the authority, the authorized officer shall exercise\nthe power of signing the instrument after its approval by the Executive Board or, as the case may be,\nthe Administrator."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Meetings",
      "content": "(1) The Governing Body shall meet at least once each year on such date,\ntime and place as may be fixed by the Chairman.\n(2) The Chairman and, in his absence, the most senior member of the Governing Body shall\npreside over meetings of the Governing Body.\n(3) The President and, in his absence, the most senior member of the Executive Board shall\npreside over meetings of the Executive Board.\n(4) The quorum of a meeting of the Governing Body or the Executive Board shall be a\nmajority of the total membership.\n(5) The Secretary shall record, maintain and keep the minutes of meetings of the Governing\nBody and the Executive Board."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Appointments",
      "content": "1[(1)] The Executive Board may, in such manner and on such terms\nand conditions as may be prescribed, appoint such officers, functionaries, employees, staff, experts,\nconsultants and advisers as may be necessary for purposes of this Act.\n1\n[(2) The persons appointed or hired under sub-section (1) shall not, directly or indirectly,\nduring employment or engagement with the Authority and for a period not exceeding two years\nthereafter enter into employment, consultation or otherwise engage in any manner whatsoever with\nan entity that competes or conflicts with the activities of the Authority as may be prescribed:\nProvided that nothing contained in this sub-section shall apply to any such employment,\nconsultation or engagement made after seeking prior approval of the Executive Board.]"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Annual report and accounts",
      "content": "As soon as may be after conclusion of a financial year\nbut before the 31st day of December, the Executive Board shall in respect of the said financial year,\nsubmit to the Governing Body a general report on its affairs including accounts, balance sheet and\naudit.\n1\nRe-numbered and added by Act XL of 2023, s.6."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Delegation of powers",
      "content": "Subject to this Act and the specified conditions, the Governing\nBody, the Executive Board and the Administrator may, by order in writing, delegate to any person to\nexercise any of their powers and perform such functions and duties as may be specified in the order."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Committees",
      "content": "The Governing Body and the Executive Board may constitute such\ncommittees and assign to them such functions as may be necessary for efficient performance of their\nrespective functions."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Authority Fund",
      "content": "(1) There shall be a fund to be known as the Defence Housing\nAuthority Islamabad Fund which shall vest in the Authority and to which shall be credited all\nmoneys received by the Authority.\n(2) The fund shall be kept in a scheduled bank or financial institution and shall be utilized\nand regulated in such manner as may be prescribed.\n(3) The funds may, with approval of the Executive Board, be invested in any banking,\nfinancial or non-banking financial institution."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Budget, audit and accounts",
      "content": "The budget of the Authority shall be approved by the\nGoverning Body and its accounts shall be maintained and audited in such manner as may be\nprescribed."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Power to cancel allotment",
      "content": "The Executive Board may cancel revoke or rescind any\nallotment, transfer, licence lease or agreement in respect of any plot or housing unit in a scheme in\nthe specified area if the allottee, transferee, licensee or lessee fails to pay the dues or installments,\nincluding development charges, in respect of such plot or housing unit within three months from the\ndate of receipt of the demand notice in writing or within such extended time as the Governing Body\nor the Executive Board may, in special cases, fix and thereupon the plot or the housing unit, with or\nwithout construction thereon, shall be resumed and shall vest in the Authority."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Conversion of property to a different use",
      "content": "(1) If a person converts without previous\nwritten approval of the Authority, any property in a scheme in the specified area to a use or purpose\nother than the one provided under the scheme, such person shall be liable to fine which may extend\nto two thousand rupees per day from the date of the conversion of the property till the default\ncontinues.\n(2) The Authority shall not impose the fine under sub-section (1) unless the person concerned\nis afforded an opportunity of being heard."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Removal of building erected or used in contravention of the Act",
      "content": "(1) If any land is\nused or building, structure, work on land is erected, constructed or used in contravention of the\nprovisions of this Act or any regulations or orders made thereunder, or in contravention of the\nScheme or without the permission of the Authority, the Authority or any person authorized by it in\nthis behalf, may, by order in writing, require the owner, occupier, user or person in control of such\nland, building, structure, work on land to remove, demolish or alter the building, structure or work or\nto use it in such manner as may bring such erection, construction or use in accordance with the\nprovisions of this Act.\n(2) If an order under sub-section (1), in respect of any building, structure work or land is not\ncomplied with in such time, as may be specified therein, the Authority or any person authorized by it\nin this behalf, may, after giving the person concerned an opportunity of being heard, remove,\ndemolish or alter the building, structure or work, or stop the use of the land, or seal the building,\npremises and in so doing, may use such force as may be necessary and may also recover the cost\nthereof from the person responsible for the erection, construction, or use of the building, structure,\nwork or land.\n1[20. Power to make regulations and bye-laws.— (1) The Governing Body may, on the\nrecommendations of the Executive Board, for carrying out the purposes of this Act, make\nregulations, not inconsistent with the provisions of this Act or any other laws, regulations or bye-\nlaws for the time being in force in the specified area.\n(2) For carrying into effect the purposes of sub-section (1), the Executive Board may make\nbye-laws, not inconsistent with the provisions of this Act and regulations made thereunder and any\nother laws, rules, regulations and bye-laws, for the time being in force.]"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Act not to override other laws",
      "content": "The provisions of this Act shall be in addition to and\nnot in derogation of any other law for the time being in force."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Transfer and savings",
      "content": "(1) After, on the repeal of the Defence Housing Authority\nIslamabad Ordinance, 2010 (XV of 2010) and on commencement of this Act, to the extent of\nSpecified Area in Islamabad Capital Territory;\n(a)        all assets, rights, powers, authorities and privileges and all property, movable\nand immovable, cash and bank balances, reserve funds, investments and all\nother interests and rights in or arising out of such property and all liabilities\nand obligations of whatever kind of the Defence Housing Authority Islamabad\nestablished before this Act, shall be transferred to and vested in the Authority;\n(b)         all contracts and agreements entered into, all rights acquired and all matters\nand things agreed to be done by, with or for the Defence Housing Authority\nIslamabad established before this Act, shall be deemed to have been entered\ninto, acquired or agreed to be done by, with or for the Authority;\n(c)        all leases executed and all grants made and all lands vested in the name of the\nDefence Housing Authority Islamabad established before this Act, shall be\ndeemed to be leases executed, grants made and property vested in the name of\nthe Authority;\n(d)          all contracts, projects, schemes, work (whether in progress or not) and all\nguarantees, undertakings, obligations, liabilities and mortgages, executed or\nsubsisting in the name of the Defence Housing Authority Islamabad\nestablished before this Act, shall be deemed to be contracts, projects, schemes,\nworks, guarantees, undertakings, obligations, liabilities and mortgages of the\nAuthority;\n(e)         all pending disputes in respect of the Defence Housing Authority Islamabad\nestablished before this Act, shall stand transferred to this Authority and be\ndecided by the Administrator and any party aggrieved by his decision shall\n1\nSubs. by Act XL of 2023, s.7.\nhave the right of appeal to the Executive Board whose decision thereon shall\nbe final;\n(f)    all suits, petitions and other legal proceedings instituted by or against the\nDefence Housing Authority Islamabad established before this Act, shall be\ndeemed to be suits, petitions, and proceedings by or against the Authority;\n(g)    all allotments and transfers of plots, whether residential, commercial or\notherwise, made by the Defence Housing Authority Islamabad established\nbefore this Act, shall be deemed to be allotments and transfers made by the\nAuthority; and\n(h)    all bye-laws and regulations in force immediately before the\ncommencement of this Act made by the Defence Housing Authority\nIslamabad established before this Act, shall continue to remain in force until,\naltered or repealed by regulations made under this Act.\n(2) Notwithstanding anything contained in sub-section (1), the Executive Board may:\n(a)    alter the area of any plot involving duplicate allotments and re-allot the same\nin such manner as it may consider appropriate; and\n(b)    pass such order in respect of transfer of plot involving duplicate allotments as\nit may deem fit."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Appeal",
      "content": "Any person aggrieved by an order of cancellation under Section 17, or\nimposition of fine under section 18, or an order under section 19, or an order of the Executive Board\nunder section 22 may, within 15 days of the communication of the order, file an appeal before the\nGoverning Body, whose decision shall be final."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Validation",
      "content": "All actions done or taken by the Defence Housing Authority Islamabad\nbefore the commencement of this Act shall be deemed to be validly done or have been taken to the\nextent they are consistent with this Act."
    }
  ],
  "definitions": [
    {
      "term": "Administrator",
      "definition": "the Administrator appointed under section 8;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "the Defence Housing Authority Islamabad established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "Chairman of the Governing Body;",
      "source_provision": "sec2"
    },
    {
      "term": "Executive Board",
      "definition": "Executive Board constituted under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Governing Body",
      "definition": "Governing Body constituted under section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of the Authority and includes the Chairman;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by 1[**] regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "President",
      "definition": "President of the Executive Board; 1 Subs. and omitted by Act XL of 2023, s.2. 1 [(j) \"project\" means any project of construction, repair, renovation, maintenance, up-gradation and development of any facility or land or area undertaken or planned by the Authority to achieve a particular aim in the specified area;",
      "source_provision": "sec2"
    },
    {
      "term": "scheme",
      "definition": "any scheme, plan, facility or project for development of land for residential, commercial or other use, undertaken, planned or made and approved by the Authority under this Act;]",
      "source_provision": "sec2"
    },
    {
      "term": "Secretary",
      "definition": "Secretary of the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "specified area",
      "definition": "all land owned, purchased or procured by or vested in or leased to the Army Welfare Housing Scheme or the Defence Housing Authority Islamabad constituted under any law before the commencement of this Act in Islamabad Capital Territory and such other land as may, from time to time, be purchased or procured by or leased to the Authority in Islamabad Capital Territory and notified by the Government; and 1 [(n) * * * * * * *] 1 [(o) “welfare and rehabilitation activities” mean activities done or undertaken by or through the Authority for the purpose of welfare and rehabilitation of serving or retired personnel of the defence forces, inter alia, officers, soldiers, bereaved families of Shuhada, war wounded or disabled personnel or other people.]",
      "source_provision": "sec2"
    }
  ]
}
