{
  "id": "pk-defence-services-inquiry-special-provisions-ordinance-1969",
  "type": "statute",
  "title": "Defence Services (Inquiry) (Special Provisions) Ordinance, 1969",
  "title_en": "Defence Services (Inquiry) (Special Provisions) Ordinance, 1969",
  "short_name": "DSPO",
  "status": "in_force",
  "issued_date": "1969-07-21",
  "in_force_date": "1969-07-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cZeW-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Defence Services (Inquiry) (Special Provisions) Ordinance, 1969 (XIX of 1969) published by The Pakistan Code (Military Laws).",
  "provisions": [
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Inquiry into the conduct of certain persons subject to service law",
      "content": "The conduct of a\nperson subject to a service law shall, notwithstanding anything contained in such law, be inquired\ninto by a board of inquiry in accordance with the provisions of this Ordinance and the rules made\nthereunder where the conduct to be inquired into___\n(a)       relates to a period when he was serving or attached, except on secondment, in\nor to an organization or unit other than that of the service to which he belongs,\nor\n(b)        is that of such person together with that of another person who was not, during\nthe period to which the conduct relates, subject to the same service law."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Convening of board of inquiry",
      "content": "Where the conduct to be inquired into under section 3\nis that of the commanding officer or that of the commanding officer together with the conduct of\nanother person, a board of inquiry shall be convened by the 1[Chief of Staff] of the service to which\nthe commanding officer belongs and, in any other case, by the commanding officer."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Composition of a board of inquiry, etc",
      "content": "_(1) A board of inquiry shall consist of a\npresident and such other persons and be convened in such manner, and the inquiry shall be\nconducted in accordance with such procedure, as may be prescribed by rules.\n(2) The president of a board of inquiry shall, after the conclusion of the inquiry, submit to the\nauthority convening the board the proceedings of the board alongwith its findings and\nrecommendations.\n(3) Upon the receipt of the proceedings of a board of inquiry submitted to him under sub-\nsection (2), the commanding officer shall___\n(a)       if the inquiry relates to any matter which he is himself competent to dispose\nof, take the necessary action and forward a copy of the proceedings to the\n1\n[Chief of Staff], informing him of the action taken by him;\n(b)       if the inquiry relates to a matter which is not of the nature mentioned in clause\n(a), forward the proceedings together with his recommendations, to the 1[Chief\nof Staff].\n(4) Upon the receipt of the proceedings of a board of inquiry submitted to him under sub-\nsection (2), or forwarded to him under clause (b) of sub-section (3), the 1[Chief of Staff] shall direct\nthat the person to whom the proceedings relate be dealt with in the manner authorised by the service\nlaw.\n(5) For the purpose of taking any action under the service law, the proceedings of a board of\ninquiry convened under this Ordinance may be acted upon as if they were proceedings of a board of\ninquiry or court of inquiry assembled under such law.\n1\nSubs. by Federal Adaptation of Laws Order, 1975 (P.O. No. 4 of 1975), Art. 2 and Sch."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to make rules",
      "content": "_(1) The 1[Federal Government] may make rules for\ncarrying out the purposes of this Ordinance.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules\nmay provide for all or any of the following matter, namely:___\n(a)        the composition of a board of inquiry;\n(b)        the manner of convening a board of inquiry;\n(c)        the procedure for the conduct of inquiry; and\n(d)        such other matters as may be necessary for carrying out the purposes of this\nOrdinance.\nRGN Uploaded Date: 27.03.2024\n1\nSubs. by Federal Adaptation of Laws Order, 1975 (P.O. No. 4 of 1975), Art. 2 and Sch."
    }
  ],
  "definitions": []
}
