{
  "id": "pk-delimitation-of-constituencies-act-1974",
  "type": "statute",
  "title": "Delimitation of Constituencies Act, 1974",
  "title_en": "Delimitation of Constituencies Act, 1974",
  "short_name": "DOCA",
  "status": "in_force",
  "issued_date": "1974-05-07",
  "in_force_date": "1974-05-07",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2Nt-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Delimitation of Constituencies Act, 1974 (XXXIV of 1974) published by The Pakistan Code (Election Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Act, may be called the Delimitation of\nConstituencies Act, 1974.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context",
      "content": "(a) \"Article\" means Article of the constitution of the Islamic Republic of Pakistan hereinafter\nreferred to as the Constitution;\n(b) \"Commission\" means the Election Commission constituted under Article 218;\n3[(ba) \"local government\" means a local government established under a Federal or a\nProvinicial law relating to local government;\n(bb) \"local government law\" means a Federal or a Provincial law relating to local\ngovernment;\n(bc) \"council\" means a local council as defined in the respective Federal or Provincial local\ngovernment laws;]\n(c) \"population\" means the population in accordance with the 4[last preceding] census\nofficially published; and\n(d) all words and expressions used but not defined in this Act shall have the same meaning as\nin the Constitution.\n1 Amendment in delimitation of constituencies Act 1974.\n2 For Statement of Objects and Reasons, see Gaz. of Pakistan. 1974 Ext., Pt. 111. p. 560.\nThe Act has been applied to the Federally Administered Tribal Areas, see Gaz. P. 1974 Ext., Pt. II, p. 1978 vide S.R.O. 1418(1)/74,dated the 14th November, 1974.\nThe Act has been applied w.e.f. the 23rd Sept., 1974 to the Provincially Administered Tribal Areas of Chitral, Dir. Swat. Kalam, Malakand Protected Area the Tribal Area adjoining Hazara\nDistt. and former State of Amb : see Gaz. of N W.F.P. 1974 Ext.. p. 241­b.\nThis Act has been amended by Ord. No. XXXVIII of 1978 and Ord. No. XXVII of 1979 for the purpose of Elections held in 1985.\nThis Act has been applied to the Provincially Administered Tribal Areas of Baluchistan by Notification No. S.O. (TA) 3/32/73, dt. 25­9­1974 the Gaz. of Baluchistan. Ext.. Issue No. 71 of"
    },
    {
      "provision_ref": "sec2a",
      "section": "2A",
      "title": "Section 2A. This Act has further been amended by Ordinance No. XXIX of 1988",
      "content": "i.e. 9­2­1989 see S.R.O. No. 1093(I)/90, dated 3rd September. 1990. Gazette of Pakistan, Extraordinary Part­III, dated 22­10­1990 page 1848.\n3 Ins. by Act, XXVI 2016, s.2.\n4 Subs. by the Delimitation of Constituencies (Amdt.) Ordinance, 1988 (4 of 1988), s. 2, for “1972” which was previously amended for “last preceding” by Ord. 50 of 1984, s. 2, to read as\nabove."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Commission to delimit constituencies. The Commission shall delimit territorial constituencies",
      "content": "for elections to the National Assembly and to each Provincial Assembly in accordance with the\nprovisions of the Constitution and this Act.\n1[\"3A. Delimitaion of constituences for local government election. The Commission shall also\ndelimit territoral constituencies for elections to the local governments in accordance with the\nprovisions of the local government Law and the rules made thereunder of each Province.\"]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Procedure of Commission",
      "content": "(1) Subject to the provisions of this section, the Commission\nshall regulate its own procedure.\n(2) If, upon any matter requiring the decision of the Commission, there is difference of opinion\namongst its members, the opinion of the majority shall prevail and the decision of the Commission\nshall be expressed in terms of the opinion of the majority.\n(3) The Commission may exercise its powers and performs its functions notwithstanding that\nthere is a vacancy in the office of any one of its members or that any one of its members is, for any\nreason, unable to attend its proceedings and the decision of the 1[majority of the members of the\nCommission] shall have the effect of the decision of the Commission:\n2[Provided that___\n(a) where the members attending the proceedings of the Commission are four and they are\nequally divided in their opinion; or\n(b) where the members attending the proceedings of the Commission are three and there is\ndifference of opinion amongst them;\nthe matter shall be placed before the Commission for decision.]\n2[“5. Delegation of powers, etc.___(1) The Commission may authorize three or more of its\nmembers, acting together, to exercise and perform all or any of its powers and functions under this\nAct.\n(2) Where four members are authorized under sub­section (1) the decision of majority shall\nprevail and where three members are authorized as aforesaid the decision shall be unanimous :\nProvided that___\n(a) where four members have been authorized and they are equally divided in their opinion;\nor\n(b) where three members have been authorized and there is difference of opinion amongst\nthem;\nthe matter shall be placed before the Commission for decision.:]\n1 Ins. by Act No. XXVI of 2016, s.3.\n2 Subs. by Act XII of 2012, s. 2 and 3."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Assistance to the Commission",
      "content": "(1) The Commission may require any person or authority to\nperform such functions or render such assistance for the purposes of this Act as it may direct.\n(2) All executive authorities of the Federal Government and each Provincial Government shall\nassist the Commission in the performance of its functions and for this purpose the Commission may\nissue such directions as it may consider necessary.\n1[7. Allocation of seats in the National Assembly. —(1) On the basis of population, the seats in\nthe National Assembly for each Province, the Federally Administered Tribal Areas and the Federal\nCapital are allocated as set out in the table below:—\nS No.                   Province/Area                                    General Seats   Women Seats   Total"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Reports of Commission and list of constituencies",
      "content": "_(1) For the purpose of delimiting\nconstituencies, the Commission may receive and consider representations, hold inquiries, summon\nwitnesses and record evidence, and shall prepare and publish in the official Gazette a preliminary\nreport and list of constituencies specifying the areas proposed to be included in each constituency.\n(2) Any person entitled to vote at an election to the National Assembly 1[or a local council] may,\nwithin 3[fifteen] days of the publication of the report under sub­section (1), make a representation to\nthe Commission in respect of the delimitation of constituencies.\n1 Added and Ins. by Act XXVI. 2016, s. 4 and 5.\n2 Subs. by Act XII of 2012 s. 5 and 6.\n3 Subs, by the Delimitation of Constituencies (Amdt.) Act, 1989 (3 of 1989), s. 6, for \"thirty\".\n(3) The Commission shall, after hearing and considering the representations, if any, received by it,\nmake such amendments, alterations or modifications, in the preliminary list published under sub­\nsection (1) as it thinks fit or necessary, and shall publish in the official Gazette the final report and list\nof constituencies showing the areas included in each constituency.\n1[10A. Power of Commission to make amendment, alteration or modification in the final list\nof constituencies. Notwithstanding anything contained in this Act, the Commission may, at any time,\nof its own motion, make such amendments, alterations or modifications in the final list of\nconstituencies published under sub­section (3), or in the areas included in a constituency, as it thinks,\nnecessary."
    },
    {
      "provision_ref": "sec10b",
      "section": "10B",
      "title": "Section 10B. Removal of difficulties. If any difficulty arises in giving effect to any of the provisions of",
      "content": "this 2[Act] the President may make such provision for the removal of the difficulty as he may deem\nfit.]."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Bar of Jurisdiction. The validity of the delimitation of any constituency, or of any",
      "content": "proceedings taken or anything done by or under the authority of the Commission, under this Act shall\nnot be called in question in any court.\n3[\"12. Power to make rules.__The Commission may, with the approval of the President and by\nnotification in the official Gazette, make rules for carrying out the purpose of this Act.\"].\n4THE SCHEDULE.—Omitted by the Delimitation of the Constituencies (Amdt.) Ordinance,\n1988 (IV of 1988) s. 8.\n5\n[****]\n_________\n1 Ins. by the Delimitation of Constituencies (Amdt) Ordinance, 1984 (50 of 1984). s.4\n2 Subs, by Act 3 of 1989, s. 7, for \"Order\".\n3 Added by Act No. XXVI of 2016, s. 6.\n4 The Schedule was added by the Delimitation of Constituencies (Amdt.) Ordinance, 1985(1 of 1985), s. 4,\n5 Omitted by Act XII of 2012 s.7"
    }
  ],
  "definitions": [
    {
      "term": "Article",
      "definition": "Article of the constitution of the Islamic Republic of Pakistan hereinafter referred to as the Constitution;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the Election Commission constituted under Article 218; 3[(ba) \"local government\" means a local government established under a Federal or a Provinicial law relating to local government;",
      "source_provision": "sec2"
    },
    {
      "term": "local government law",
      "definition": "a Federal or a Provincial law relating to local government;",
      "source_provision": "sec2"
    },
    {
      "term": "council",
      "definition": "a local council as defined in the respective Federal or Provincial local government laws;]",
      "source_provision": "sec2"
    },
    {
      "term": "population",
      "definition": "the population in accordance with the 4[last preceding] census officially published; and (d) all words and expressions used but not defined in this Act shall have the same meaning as in the Constitution. 1 Amendment in delimitation of constituencies Act 1974. 2 For Statement of Objects and Reasons, see Gaz. of Pakistan. 1974 Ext., Pt. 111. p. 560. The Act has been applied to the Federally Administered Tribal Areas, see Gaz. P. 1974 Ext., Pt. II, p. 1978 vide S.R.O. 1418(1)/74,dated the 14th November, 1974. The Act has been applied w.e.f. the 23rd Sept., 1974 to the Provincially Administered Tribal Areas of Chitral, Dir. Swat. Kalam, Malakand Protected Area the Tribal Area adjoining Hazara Distt. and former State of Amb : see Gaz. of N W.F.P. 1974 Ext.. p. 241­b. This Act has been amended by Ord. No. XXXVIII of 1978 and Ord. No. XXVII of 1979 for the purpose of Elections held in 1985. This Act has been applied to the Provincially Administered Tribal Areas of Baluchistan by Notification No. S.O. (TA) 3/32/73, dt. 25­9­1974 the Gaz. of Baluchistan. Ext.. Issue No. 71 of",
      "source_provision": "sec2"
    }
  ]
}
