{
  "id": "pk-destruction-of-record-act-1917",
  "type": "statute",
  "title": "Destruction of Record Act, 1917",
  "title_en": "Destruction of Record Act, 1917",
  "short_name": "DORA",
  "status": "in_force",
  "issued_date": "1917-02-27",
  "in_force_date": "1917-02-27",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apmU-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Destruction of Record Act, 1917 (V of 1917) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Power to certain authorities to make rules for disposal of documents",
      "content": "_ (1) The\nauthorities hereinafter specified may, from time to time, make rules2 for the disposal, by destruction\nor otherwise, of such documents as are, in the opinion of the authority making the rules, not of\nsufficient public value to justify their preservation.\n(2) The authorities shall be___\n(a)         in the case of documents in the possession or custody of a High Court or of the\nCourts of Civil or Criminal jurisdiction subordinate thereto,___ the High Court;\n(b)         in the case of documents in the possession or custody of Revenue Courts and\nofficers,-the Chief Controlling Revenue-authority3 ; and\n(c)         in the case of documents in the possession or custody of any other public\nofficer,___\n4\n[(i)   if the documents relate to purposes of a Province, the Provincial\nGovernment or any officer specially authorised in that behalf by that\nGovernment ;\n(ii)       in any other case, the 5[Federal Government] or an officer specially\nauthorised in that behalf by that Government.]\n6\n[(3) Rules made under this section by any High Court or by a Chief Controlling\nRevenue-authority3 or by an officer specially authorised in that behalf by any Provincial Government\nshall be subject to the previous approval of the Provincial Government; and rules made by an officer\nspecially authorised in that behalf by the 5[Federal Government] shall be subject to the previous\napproval of the 5[Federal Government]].\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1917, Pt. V, p. 2 ; and for Proceedings in Council, see Ibid, 1917, Pt. VI, pp. 17 and 292.\n2\nFor the Income-tax Appellate Tribunal (Destruction of Record Rules, 1960 see Gazette of Pakistan 1960, Pt. I, pp. 330-331.\n3\nFor definition of Chief Controlling Revenue-authority, formerly included in s. 2, see now the General Clauses Act, 1897 (10 of 1897), s. 3 (9a).\n4\nSubs by A. O., 1937, for the L. G ., or any officer specially authorized in that behalf by the L.G.”,.\n5\nSubs. by F.A.O., 1975, Art, 2 and Table for “Central Government”.\n6\nSubs. ibid., for the original sub-section (3)"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Validation of former rules for disposal of documents. All rules and orders directing or",
      "content": "authorising the destruction or other disposal of documents in the possession or custody of any public\nofficer, heretofore made by a 1[Provincial Government], or with the approval of the 1[Provincial\nGovernment] by any authority not empowered to make such rules under the Destruction of Records\nAct, 1879 (III of 1879) shall be deemed to have had the force of law from the date on which they\nwere made, and all such rules and orders now in force shall continue to have the force of law until\nthey are superseded by rules made under this Act."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Saving of certain documents. Nothing in this Act shall be deemed to authorise the",
      "content": "destruction of any document which, under the provisions of any law for the time being in force, is to\nbe kept and maintained."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. [Repeals.] : [Rep. by the Repealing Act, 1927 (XII of 1927)]",
      "content": "THE SCHEDULE [Repeal of Enactments.] Rep. by the Repealing Act, 1927 (Xll of 1927), s. 2 and\nSchedule.\n___________\nDate: 11-09-2024\n1\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”."
    }
  ],
  "definitions": []
}
