{
  "id": "pk-digital-nation-pakistan-act-2025",
  "type": "statute",
  "title": "Digital Nation Pakistan Act, 2025",
  "title_en": "Digital Nation Pakistan Act, 2025",
  "short_name": "DNPA",
  "status": "in_force",
  "issued_date": "2025-01-28",
  "in_force_date": "2025-01-28",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5praQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Digital Nation Pakistan Act, 2025 (I of 2025) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, and commencement.―(1) This Act shall be called the Digital Nation",
      "content": "Pakistan Act, 2025.\n(2) It shall extend to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.―In this Act, unless there is anything repugnant in the subject or context,―",
      "content": "(a) “Authority” means the Pakistan Digital Authority established under Section 6;\n(b) “Chairperson” means the Chairperson of the Authority appointed under Section 7;\n(c) “Commission” means the National Digital Commission established under Section 3;\n(d) “Committee” means the Oversight Committee established under Section 9;\n(e) “Data Exchange Layer” means a secure and interoperable digital framework that\nfacilitates the standardised sharing and integration of data amongst government entities\nand public sector organisations. It provides secure interfaces for private enterprises to\naccess public services and data as required and ensures data integrity, privacy, and\naccessibility without requiring private enterprises to share their proprietary data;\n(f) “data governance” means the processes, roles, and responsibilities that ensure the\neffective and efficient management of data;\n(g) “digital citizen journeys” means the end-to-end, user-centered processes and interactions\nthrough which citizens discover, engage with, and complete transactions for public sector\ndigital services, including any authentication through digital identity, submission,\nactivation, fulfillment, feedback, or follow-up stages.\n(h) “digital economy” means the economic activities, transactions, and interactions\nconducted through digital platforms and infrastructures to encompass the digital\ntransformation of traditional sectors and the development of new digital services,\nproducts, and business models. The digital economy is driven by data, digital identity,\nand secure, scalable digital public infrastructures, fostering inclusion, innovation and\neconomic growth across both public and private sectors;\n(i) “digital Identity” means a legal, secure, verifiable credentials issued to an eligible\nindividual, enabling access to digital, services, transactions, and interactions which shall\nbe developed, issued and managed by National Database and Registration Authority\nunder the National Database and Registration Authority Ordinance, 2000. For legal\nentities, it shall be based on data maintained by the Securities and Exchange Commission\nof Pakistan or other relevant Federal or Provincial Government entities;\n(j) “digital governance” means integrating and using digital technologies, data and digital\npublic infrastructures to enhance the transparency, accountability and efficiency of\ngovernment decision-making processes and service delivery. It involves leveraging\ndigital platforms to improve the performance, accessibility, and cost-effectiveness of\npublic services, fostering citizen engagement and enabling data-driven policies to support\nsustainable development and innovation in governance;\n(k) “digital nation” means a nation where urban and rural citizens, governments, and\nbusinesses are enabled through digital technologies and the responsible use of data,\nfostering a digital society that generates value for all stakeholders, supports sustainable\neconomic growth and promotes efficient governance;\n(l) “Digital Nation Fund” means the fund created under section 13;\n(m) “Digital Public Infrastructure” or “DPI” means foundational, secure, and interoperable\ndigital systems that enable public and private sector services and support governance,\neconomic activities, and societal needs. It includes systems such as digital identity, data\nexchange platforms, digital payments, cloud-based government services, and open data\nplatforms. It ensures inclusivity, accessibility, security, and efficiency, fostering\ninnovation and sustainable growth across the digital ecosystem;\n(n) “digital society” means a society where individuals, businesses, and governments use\ndigital technologies across all aspects of life, including governance, economy, education\nand social interactions, fostering inclusivity, innovation and efficiency through secure\ndigital infrastructure;\n(o) “digital transformation” refers to a strategic overhaul of government operations, public\nservices, and economic activities by adopting digital technologies, data-driven decision-\nmaking, and innovative solutions to create a digital society, digital economy and digital\ngovernance aligned with the National Digital Masterplan;\n(p) “digitalisation” means the integration of digital technologies into existing government\nsystems, operations and services to enhance efficiency, service delivery and governance;\n(pa) “Division concerned” means the Division to which the business of Information\nTechnology and Telecommunications stands allocated;\n(q) “emerging technologies” means innovative and rapidly evolving technological\nadvancements that have the potential to significantly impact economic growth, societal\ndevelopment, and governance structures;\n(r) “implementation plan” means the detailed plans for each sectoral plan outlined in the\nNational Digital Masterplan and includes all necessary projects, resources, timelines and\nrisk management strategies required for successful execution of the National Digital\nMasterplan under section 11;\n(s) “Member” means a Member of the Authority appointed under Section 7;\n(t) “National Data Strategy” means a comprehensive framework that sets policies, standards,\nand guidelines for managing, sharing, and using data securely and responsibly across\nsectors to foster innovation, economic growth and governance improvements ensuring\ncompliance with national and international standards;\n(u) “National Digital Masterplan” or “Masterplan” means a comprehensive, strategic\nblueprint designed to transform Pakistan into a digital nation by fostering a digital\nsociety, digital economy and digital governance. The Masterplan provides a cohesive\nframework for digital transformation across federal, provincial, and local levels, ensuring\ninclusivity, adaptability and alignment with international standards and emerging digital\ntrends. The Masterplan includes strategic frameworks, sectoral plans, digital economy\ndevelopment plans, implementation plans and governance frameworks that promote\ninnovation, collaboration and sustainability across all sectors, as approved under Section\n11;\n(v) “prescribed” means prescribed by rules or regulations, as the case may be, made under\nthis Act;\n(w) “regulations” means regulations made under this Act;\n(x) “rules” means rules made under this Act; and\n(y) “sectoral plan” means the specific digital transformation roadmaps for key sectors,\nincluding but not limited to health, education, agriculture, finance, industries, commerce,\nand governance, as provided in Section 11.\nCHAPTER-2"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Commission.―(1) Upon the commencement of this Act, there shall",
      "content": "stand established a Commission to be called the National Digital Commission.\n(2) The Commission shall prescribe the required policy, provide governance, and ensure necessary\ncoordination amongst federal, provincial, and sectoral bodies to achieve the objectives of a digital\nnation and aligning national digital transformation with economic growth, effective governance and\nsocietal development."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Composition of the Commission.―(1) The Commission shall consist of the following,",
      "content": "namely:―\nS. No.                           Membership                                         Status\n(1)                                   (2)                                            (3)"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Minister",
      "content": "in-charge of the Division to which the Business of Member\nInformation Technology and Telecommunications stands allocated;"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Minister",
      "content": "in-charge of the Division to which business of Planning and Member\nDevelopment stands allocated;"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Minister",
      "content": "in-charge of the Division to which business of Finance stands Member\nallocated;"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Minister",
      "content": "in-charge of the Division to which business of Commerce Member\nstands allocated;"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Minister",
      "content": "in-charge of the Division to which business of Interior stands Member\nallocated;"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Minister",
      "content": "in-charge of the Division to which business of Economic Member\nAffairs stands allocated;"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Minister",
      "content": "in-charge of the Division to which business of Information Member\nand Broadcasting stands allocated;"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Chairperson of the Pakistan Digital Authority. Secretary",
      "content": "(2) A Chief Minister, in their absence, may nominate a Provincial Minister or the Chief Secretary\nto attend the meeting of the Commission.\n(3) Where business of a Division does not stand allocated to any Federal Minister, Minister of\nState or an Adviser and is in direct charge of the Prime Minister, the Prime Minister may nominate\nMinister-in-charge of another division to act as member of the Commission till such time regular\nMinister-in-charge of that division is appointed:\n(4) The Commission may, by notification in the official Gazette, appoint additional members to\n(5) The Chair may require the attendance of any relevant person by special invitation, including\nbut not limited to Ministers-in-charge of relevant ministries, experts, or officials whose expertise or\nparticipation is deemed necessary to support the Commission’s deliberations on any matter under\ndiscussion.\n(6) The Commission shall hold a meeting at least once every six months and may further meet as\nmany times as necessary at the direction of the Chair.\n(7) The quorum for a meeting of the Commission shall constitute at least three-fourths of the\nmembers of the Commission, and must include the presence of the Chair.\n(8) Notwithstanding anything contained in sub-sections (6) and (7), a meeting of the Commission\nmay also be convened upon a written requisition signed by at least one-fourth of the total membership\nof the Commission. Upon receipt of such a requisition, the Secretary shall promptly place the matter\nbefore the Chair, who shall convene the meeting within thirty (30) days."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Functions of the Commission.―The Commission shall―",
      "content": "(a) approve the National Digital Masterplan and its implementation plans, provide strategic\ndirection and governance to the Authority, and coordinate with all relevant federal and\nprovincial government entities, as well as regulatory bodies, to ensure a unified and\ncollaborative approach to digital transformation across all levels of government;\n(b) issue directives to entities to align their strategic direction, policies, operations, and\ndigital initiatives with the National Digital Masterplan, addressing inter jurisdictional\nchallenges and supporting effective implementation;\n(c) ensure that the Authority has the requisite support, enabling conditions and resources to\nimplement the Masterplan effectively; and\n(d) review cases of non-compliance with the Masterplan referred by the Authority or\nCommittee and may grant exceptions or issue further directives as necessary to ensure\nalignment with the Masterplan.\nCHAPTER-3"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Digital Nation Fund.―(1) There shall be created a non",
      "content": "lapsable fund vesting in and to be\nadministered and controlled by the Authority to be known as the Digital Nation Fund for meeting\nexpenses in connection with the functions and operations of the Authority under this Act.\n(2) The Digital Nation Fund shall, subject to the provisions of the Public Finance Management\nAct, 2019 consist of―\n(a) funds provided by the Federal Government for payment of salaries, establishing\ninfrastructure, administrative, operational, and any other expenses, and running the day-\nto-day business of the Authority;\n(b) loans or funds to be obtained from the Federal Government or any Provincial Government\nif so desired, or local authority if so desired or such other entity subject to approval by\nthe Commission;\n(c) grants by the Federal Government or any Provincial Government if so desired, or local\nauthority if so desired;\n(d) aids, grants, donations, and loans negotiated and raised or otherwise obtained by the\nAuthority from the national and international agencies, in consultation with the Division\nto which business of finance stands allocated and other relevant Divisions;\n(e) funds from international grants, loans, donations, and other financial instruments,\nincluding contributions from multilateral organisations, international agencies, and\nphilanthropic organisations, specifically aimed at supporting digital transformation\ninitiatives in Pakistan. The Authority shall seek out, apply for, and manage such funding\nin accordance with governance standards set by rules to advance its objectives and ensure\ntransparency;\n(f) all other sums or property which may in any manner become payable to or vested in the\nAuthority in respect of any matter incidental to the exercise of its powers and\nperformance of its functions; and\n(g) income generated from investments and assets of the Authority.\n(3) The Digital Nation Fund shall, subject to the Public Finance Management Act, 2019, be\nmanaged and operated in such manner and subject to such extent as may be prescribed by rules.\n(4) Subject to Articles 169 and 170 of the Constitution of the Islamic Republic of Pakistan, to\nensure financial integrity and transparency, the Digital Nation Fund shall be subject to periodic reviews\nand audits by independent external auditors or other relevant bodies as determined by the Committee,\nensuring compliance with financial management rules and the effective use of resources."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Expenditure.―The Digital Nation Fund shall be expended for―",
      "content": "(a) paying any expenditure lawfully incurred by the Authority;\n(b) payment of salaries and other remunerations payable to employees, consultants, and\nadvisers of the Authority;\n(c) paying any other expenses, costs or expenditures properly incurred or accepted by the\nAuthority in the performance of its functions or the exercise of its powers under this Act;\n(d) repaying any loans or advances obtained under this Act, along with any associated\ninterest, charges or fees;\n(e) fulfilling any financial obligations or liabilities that arise in the execution of the functions\nof the Authority under this Act; and\n(f) funding strategic enabling projects and initiatives necessary to support digital\ntransformation objectives, enhance digital public infrastructure, or improve the\nAuthority’s and its stakeholders’ operational capabilities."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Budget, finance and audit.―(1) The Authority shall, for each financial year, prepare its",
      "content": "budget.\n(2) The budget statement shall specifically state the estimated receipts, expenditures, and the sums\nlikely to be required from the Federal Government during the following financial year.\n(3) The accounts of the Authority shall be maintained and audited in accordance with Articles 169\nand 170 of the Constitution of the Islamic Republic of Pakistan.\n(4) In addition to the audit under sub-section (3), the Authority may require the accounts to be\naudited by a chartered accountant within the meaning of the Chartered Accountants Ordinance,1961\n(X of 1961).\n(5) Copies of the report of the Auditor-General of Pakistan on the accounts shall be provided to\nthe Authority, and the Authority shall make it available for public inspection on its official website.\n(6) The funds of the Digital Nation Fund shall be maintained in the National Bank of Pakistan or\nsuch other scheduled banks as may be prescribed by regulations subject to the provisions of the Public\nFinance Management Act, 2019."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Annual report of the Authority.―(1)The Authority shall submit an annual report to the",
      "content": "Commission, Committee and the Division concerned within ninety days after close of the financial\nyear, encompassing―\n(a) an audited statement of income, expenditure, and balance sheet;\n(b) an overview of the Authority’s activities, achievements, and compliance with the\nMasterplan;\n(c) an assessment of progress against key performance indicators and milestones established\nin the Masterplan;\n(d) recommendations for future digital transformation initiatives and any corrective actions\nneeded; and\n(e) any other relevant matters the Authority deems necessary for transparency and\naccountability.\n(2) The Authority shall publish the annual report on its official website to ensure public access\nand transparency.\nCHAPTER-7\nGOVERNANCE, OPERATIONS AND ACCOUNTABILITY"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Assignment of entities.―The Commission may advise the Federal Government through the",
      "content": "Division concerned to assign any Division, semi-autonomous or-autonomous entity, including\ncorporation, board or other relevant public sector entity, to assist the Authority in executing the\nMasterplan or carrying out any functions necessary to achieve the objectives of this Act. The\nCommission may also authorise the Authority to act through such assigned entities for specific\nprojects, works or functions as specified by the Commission."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Assistance from agencies.―(1) Notwithstanding anything contained in any other law for the",
      "content": "time being in force the Authority may seek any assistance or information from any person, including\nbut not limited to any Division, department, statutory body, corporation, or agency of the federal,\nprovincial, or local governments, which, in its opinion, concerns any matter relating to the smooth\nfunctioning of the Authority. The requested assistance or information shall be provided to the\nAuthority within the stipulated timeframe specified by it. If the required assistance or information is\nnot provided within the specified timeframe, the Authority shall take further steps as provided in sub-\nsection (2) to ensure compliance, including reporting the matter to the Commission.\n(2) In cases where the Authority’s directives are not adhered to, and delays in providing the\nrequested assistance or information persist despite follow up by the Authority, the matter may be\nreported to the Commission. The Commission, upon reviewing the situation, may enforce compliance\nby directing the relevant agency or entity to provide the required assistance or information within a\nspecified timeframe, not exceeding ten working days from the date of the Commission’s directive,\nunless an extension is granted under exceptional circumstances."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Engagement with development partners.―(1) The Authority may collaborate and enter into",
      "content": "financial arrangements with development partners, including but not limited to international donors,\nmultilateral organisations, or international agencies to support its functions. These arrangements may\ninclude financial grants and other technical assistance, such as training and capacity building, advisory\nand research services, the remuneration of staff and consultants and provision of assets, etc., without\nimposing financial liability on the Authority.\n(2) In cases where any fiscal obligation is created on the Government of Pakistan, arrangements\nwith development partners shall be made in consultation with the Division to which the business of\neconomic affairs stands allocated."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Appointment of employees, advisers and consultants of the Authority.―(1) The",
      "content": "Chairperson or the Authority may appoint employees, consultants, agents and technical or professional\nadvisers as it deems necessary to perform its functions and exercise its powers under this Act. The\nmethods, qualifications, experience and other terms and conditions of Service of such persons shall be\nsuch as may be prescribed by the regulations.\n(2) The Authority shall ensure a transparent and competitive process for making appointments\nunder sub-section (1).\n(3) Employees of the Authority shall serve at the discretion of the Authority and shall be subject\nto disciplinary action under procedures prescribed by the Regulations.\n(4) All individuals appointed under this section shall be deemed public servants within the\nmeaning of section 21 of the Pakistan Penal Code, 1860 (Act XLV of 1860) but shall not be considered\ncivil servants within the meaning of the Civil Servants Act, 1973 (LXXI of 1973), except for civil\nservants appointed to the Authority, who shall continue to be governed by the Civil Servants Act, 1973\nand the rules made thereunder unless they are absorbed into the Authority as per the rules."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Code of conduct and ethical guidelines.―The Authority shall, as may be prescribed by",
      "content": "regulations, establish a code of conduct and ethical guidelines for all employees, consultants and\nadvisers to ensure integrity, impartiality and professionalism. Such regulations shall cover conflict of\ninterest, confidentiality and transparent decision making. All individuals engaged under this Act must\nundergo mandatory training on the code of conduct and ethical guidelines upon appointment and\nperiodically thereafter.\nCHAPTER-8"
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Indemnity.―No suit, prosecution, or other legal proceedings shall lie against the members of",
      "content": "the Commission, the Chairperson or Members of the Authority, members of the Committee,\nemployees, consultants, or advisers for any act or omission done in good faith in the exercise or\nperformance of any function, power or duty conferred or imposed by or under this Act done in good\nfaith, except where it is proved beyond a reasonable doubt that the act or omission was done in bad\nfaith or involved willful misconduct, fraud or gross, negligence."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Delegation of powers.―The Authority may, by notification in the Official Gazette, delegate",
      "content": "any power conferred upon it under this Act to its Chairperson, any Member, or any officer, as it deems\nnecessary for the effective performance of its functions. Such notification shall clearly identify the\nspecific powers being delegated, outline any conditions, limitations, or requirements under which\nthose powers may be exercised, and specify the period for which the delegation shall remain in force."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Power to make rules.―The Authority may, with the approval of the Federal Government, by",
      "content": "notification in the official Gazette, make rules, not inconsistent with the provisions of this Act, for\nexercising its powers and carrying out its functions under this Act."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Power to make regulations",
      "content": "The Authority may, by notification in the official Gazette,\nmake regulations, not inconsistent with the provisions of this Act or the rules, for exercising its powers\nand carrying out of its functions under this Act."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Power of the Federal Government to issue policy directives",
      "content": "The Federal Government\nmay, by notification in the official Gazette, give policy directives to the Authority to align its actions\nwith national policies, priorities and interests. Such directives shall not impede the Authority’s\noperational autonomy, and the Authority shall comply with them, ensuring consistency with the\nobjectives and framework established under this Act."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Act to override other laws",
      "content": "(1) The provisions of this Act shall have, effect notwithstanding\nanything to the contrary contained in any other law for the time being in force. In case of any\ninconsistency, the provisions of this Act shall prevail, subject to sub-section (2) and (3).\n(2) Where any law prescribes specific measures for protecting citizens’ data rights and\ncybersecurity, such provisions shall have overriding effect and must be complied with in executing\nthis Act.\n(3) in cases where conflicts with existing laws are identified, the Authority shall establish a\nconsultative process involving relevant stakeholders and concerned regulatory bodies to assess and\nresolve the conflict through consultation. Where conflict persists, the Commission may issue necessary\nrecommendations or directives for resolution or propose legislative amendments to the Government."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Bar of jurisdiction",
      "content": "Notwithstanding anything contained in any other law for the time being\nin force and except as provided under this Act, no decision or action taken under this Act or rules or\nregulations made thereunder shall be questioned by any agency or challenged in any court or tribunal,\nnor shall any injunction be granted against such decisions or actions."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Removal of difficulties",
      "content": "If a procedural or operational difficulty arises in giving effect to\nany of the provisions of this Act, the Federal Government may, within six months of the\ncommencement of this Act, make such order not inconsistent with the provisions of this Act, as may\nappear to it to be necessary or expedient for removing such difficulty.\n_________\n186452\nRGN Date: 06-02-2025"
    }
  ],
  "definitions": [
    {
      "term": "Authority",
      "definition": "the Pakistan Digital Authority established under Section 6;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairperson",
      "definition": "the Chairperson of the Authority appointed under Section 7;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the National Digital Commission established under Section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Committee",
      "definition": "the Oversight Committee established under Section 9;",
      "source_provision": "sec2"
    },
    {
      "term": "Data Exchange Layer",
      "definition": "a secure and interoperable digital framework that facilitates the standardised sharing and integration of data amongst government entities and public sector organisations. It provides secure interfaces for private enterprises to access public services and data as required and ensures data integrity, privacy, and accessibility without requiring private enterprises to share their proprietary data;",
      "source_provision": "sec2"
    },
    {
      "term": "data governance",
      "definition": "the processes, roles, and responsibilities that ensure the effective and efficient management of data;",
      "source_provision": "sec2"
    },
    {
      "term": "digital citizen journeys",
      "definition": "the end-to-end, user-centered processes and interactions through which citizens discover, engage with, and complete transactions for public sector digital services, including any authentication through digital identity, submission, activation, fulfillment, feedback, or follow-up stages.",
      "source_provision": "sec2"
    },
    {
      "term": "digital economy",
      "definition": "the economic activities, transactions, and interactions conducted through digital platforms and infrastructures to encompass the digital transformation of traditional sectors and the development of new digital services, products, and business models. The digital economy is driven by data, digital identity, and secure, scalable digital public infrastructures, fostering inclusion, innovation and economic growth across both public and private sectors;",
      "source_provision": "sec2"
    },
    {
      "term": "digital Identity",
      "definition": "a legal, secure, verifiable credentials issued to an eligible individual, enabling access to digital, services, transactions, and interactions which shall be developed, issued and managed by National Database and Registration Authority under the National Database and Registration Authority Ordinance, 2000. For legal entities, it shall be based on data maintained by the Securities and Exchange Commission of Pakistan or other relevant Federal or Provincial Government entities;",
      "source_provision": "sec2"
    },
    {
      "term": "digital governance",
      "definition": "integrating and using digital technologies, data and digital public infrastructures to enhance the transparency, accountability and efficiency of government decision-making processes and service delivery. It involves leveraging digital platforms to improve the performance, accessibility, and cost-effectiveness of public services, fostering citizen engagement and enabling data-driven policies to support sustainable development and innovation in governance;",
      "source_provision": "sec2"
    },
    {
      "term": "digital nation",
      "definition": "a nation where urban and rural citizens, governments, and businesses are enabled through digital technologies and the responsible use of data, fostering a digital society that generates value for all stakeholders, supports sustainable economic growth and promotes efficient governance;",
      "source_provision": "sec2"
    },
    {
      "term": "Digital Nation Fund",
      "definition": "the fund created under section 13;",
      "source_provision": "sec2"
    },
    {
      "term": "digital society",
      "definition": "a society where individuals, businesses, and governments use digital technologies across all aspects of life, including governance, economy, education and social interactions, fostering inclusivity, innovation and efficiency through secure digital infrastructure;",
      "source_provision": "sec2"
    },
    {
      "term": "digitalisation",
      "definition": "the integration of digital technologies into existing government systems, operations and services to enhance efficiency, service delivery and governance;",
      "source_provision": "sec2"
    },
    {
      "term": "Division concerned",
      "definition": "the Division to which the business of Information Technology and Telecommunications stands allocated;",
      "source_provision": "sec2"
    },
    {
      "term": "emerging technologies",
      "definition": "innovative and rapidly evolving technological advancements that have the potential to significantly impact economic growth, societal development, and governance structures;",
      "source_provision": "sec2"
    },
    {
      "term": "implementation plan",
      "definition": "the detailed plans for each sectoral plan outlined in the National Digital Masterplan and includes all necessary projects, resources, timelines and risk management strategies required for successful execution of the National Digital Masterplan under section 11;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "a Member of the Authority appointed under Section 7;",
      "source_provision": "sec2"
    },
    {
      "term": "National Data Strategy",
      "definition": "a comprehensive framework that sets policies, standards, and guidelines for managing, sharing, and using data securely and responsibly across sectors to foster innovation, economic growth and governance improvements ensuring compliance with national and international standards;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules or regulations, as the case may be, made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "sectoral plan",
      "definition": "the specific digital transformation roadmaps for key sectors, including but not limited to health, education, agriculture, finance, industries, commerce, and governance, as provided in Section 11. CHAPTER-2",
      "source_provision": "sec2"
    }
  ]
}
