{
  "id": "pk-digital-presence-proceeds-tax-act-2025",
  "type": "statute",
  "title": "Digital Presence Proceeds Tax Act, 2025",
  "title_en": "Digital Presence Proceeds Tax Act, 2025",
  "short_name": "DPPTA",
  "status": "in_force",
  "issued_date": "2025-06-26",
  "in_force_date": "2025-06-26",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tlaw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Digital Presence Proceeds Tax Act, 2025 (XIX of 2025) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Act shall be called the Digital Presence Proceeds\nTax Act, 2025.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,__\n(a)        “Authority” means the Commissioner Inland Revenue who has been assigned\njurisdiction for the purposes of this Act by the Federal Board of Revenue;\n(b)        “Board” means the Central Board of Revenue established under the Central\n1\nEnacted vide section 12 of the Finance Act, 2025 (Act No. XIX of 2025).\nBoard of Revenue Act, 1924 (IV of 1924), and on the commencement of Federal\nBoard of Revenue Act, 2007, the Federal Board of Revenue established under\nsection 3 thereof and includes a Member of the Federal Board of Revenue to\nwhom powers of the Board have been delegated under section 8 of the Federal\nBoard of Revenue Act, 2007;\n(c)     “digitally delivered services” means any service delivered over the internet or\nelectronic networks, where the delivery is automated and required minimal or\nno human intervention including music, audio and video streaming services,\ncloud services, online software application services, services delivered through\nonline inter-personal interaction i.e. tele-medicine, e-learning etc., online\nbanking services, architectural design services, research and consultancy\nreports, accounting services in the form of digital files or any other online\nfacility;\n(d)     “e-commerce” means sale or purchase of goods and services conducted over\ncomputer networks by methods specifically designed for the purpose of\nreceiving or placing of orders either through websites, mobile applications or\nonline marketplace having digital ordering features by using either mobile\nphones or automated computer-to-computer ordering system;\n(e)     “e-store” means the online platform including websites and software\napplications used to conduct e-commerce, which involves buying and selling\ngoods or services including digital products, through electronic transactions\nover the internet or other computer networks;\n(f)     “online marketplace” means Online interfaces that facilitate, for a fee, the\ndirect interaction between multiple buyers and multiple sellers for digital orders\nfor supply of goods and services, without the platform taking economic\nownership of the goods or rendering the services that are being sold; and\n(g)     “payment Intermediary” means any third part entity including a banking\ncompany, financial institution, a licensed foreign exchange company or\npayments gateway that facilitate the transfer of funds or payment instructions\nbetween two or more parties to enable, process, route or settle payments in a\nfinancial transaction, without being the ultimate source or recipient of the\npayment.\nChapter II __ Chargeability and Scope"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Charging of Digital Presence Proceeds Tax",
      "content": "(1) Every foreign vendor having significant\ndigital presence in Pakistan shall be charged to Digital Presence Proceeds Tax on proceeds of every\nsupply made from outside Pakistan of digitally ordered services or goods irrespective of whether\ndelivered digitally or physically.\n(2) The tax under sub-section (1) shall be charged at the rate provided in the Schedule of this\nAct.\n(3) Proceeds of foreign vendors are attributable to Pakistani users based on their significant\ndigital presence in Pakistan as provided in section 4 of this Act, where__\n(i)     the transaction is carried out through foreign online marketplace or e-store;\n(ii)    they arise in connection with digitally ordered services and goods; and\n(iii)   a Pakistani user is a party to the transaction.\n(4) Any reference to a Pakistani user, in relation to this Act means any user who is reasonable\nto assume__\n(a)     in the case of an individual, is normally resides in Pakistan;\n(b)     in the case of a company, is established or have permanent establishment in\nPakistan; and\n(c)     the payment for the digital order of services and goods has been electronically\npaid from within Pakistan.\n(5) This section shall not apply to any payment for__\n(a)     digitally ordered goods where such payment is effectively connected with a\nbranch office of foreign vendor in Pakistan of the non-resident person and the\ngoods are supplied from within Pakistan; and\n(b)     digitally delivered services where such services giving rise to the payment are\nreceived in Pakistan and are rendered through a branch office of foreign vendor\nin Pakistan of the non-resident person."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Significant digital presence in Pakistan",
      "content": "A foreign vendor shall have significant digital\npresence in Pakistan under this Act, where the foreign vendor supplies digitally ordered services and\ngoods from outside Pakistan to any user in Pakistan, if the aggregate amount exceeds one million\nrupees in a financial year along with one of the following additional factors__\n(a)     existence of a user base and the associated data input;\n(b)     billing or collection in local currency or with a local form of payment;\n(c)     responsibility for the final delivery of goods and services to Pakistani\nconsumers;\n(d)     responsibility for the provision by the foreign vendors of other support services\n(aftersales services, repairs and maintenance); and\n(e)     continued marketing and sales promotion activities, online or not, to attract\ncustomers.\nChapter III __ Collection and Recovery"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Responsibility to Collect Digital Presence Proceeds Tax",
      "content": "(1) Every payment\nintermediary including a banking company, financial institution, licensed exchange company or\npayment gateway responsible for making a payment in whole or part remitting outside Pakistan, the\nproceeds chargeable to tax under section 3 of this Act, to a foreign vendor for digitally ordered services\nor goods shall deduct tax from the gross amount paid at the rate specified in Schedule to this Act.\n(2) Notwithstanding anything contained in any law, the payment intermediary shall not\nmaintain any bank account for a foreign vendor supplying goods or services from outside Pakistan and\nremit funds outside Pakistan unless the deduction of the tax under this section has been made and\ndeposited in the government treasury as provided in sub-section (1) of this section:\nProvided that this sub-section shall not apply where the payment intermediary collects and\ndeposit this tax at the time of remitting any payment outside Pakistan.\n(3) Every payment intermediary who has deducted the tax under this section in a month is\nrequired to deposit the deducted amount in the government treasury before the 7th of immediately\nsucceeding month.\n(4) Notwithstanding anything contained in any law, Customs shall ensure that no courier\ndelivers any consignment unless provide the evidence of payment of this tax at the time when its\npayment has been settled by the buyer and seller under sub-section (1) of this section."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Responsibility to collect digital presence proceeds tax on advertisement at social media",
      "content": "platform.__ (1) Every foreign vendor having digital presence in Pakistan making any payment in whole\nor part to social media platforms or any other online platform for online advertisement in Pakistan\nwhich is chargeable to tax under section 3, shall deduct tax from the gross amount paid at the rate\nspecified in the Schedule of this Act.\n(2) Every foreign vendor who has deducted the tax under this section in a month is required to\ndeposit the deducted amount in the government treasury before the 7th of immediately succeeding\nmonth."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Failure to deduct or deposit collected tax and recovery along with default surcharge",
      "content": "(1) Where a__\n(a)     payment intermediary fails to collect tax as required under section (1) of section\n5;\n(b)     payment intermediary fails to comply with the provisions of section (2) of\nsection 5;\n(c)     foreign vendor fails to comply with the provisions of section 6; or\n(d)     having collected tax under sub-section (3) of section 5 or sub-section (2) of\nsection 6 fails to deposit the tax to the Commissioner, the payment intermediary\nof foreign vendor, as the case may be, shall be personally liable to pay the\namount of tax along with default surcharge @ of KIBOR +3% per annum for\neffect and proceed to recover the same.\n(2) No recovery under sub-section (1) shall be made unless the person referred to in sub-section\n(1) has been granted with an opportunity of being heard.\n(3) For recovery of the demand created under this Act, the Part IV of Chapter X of Income Tax\nOrdinance, 2001 (XLIX Of 2001) regarding tax recovery shall apply mutatis mutandis.\nChapter IV __ Reporting Requirements"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Furnishing of information of e",
      "content": "commerce transactions by Online Payment\nIntermediaries.__ (1) Every payment intermediary responsible for collection of tax in respect of\nremitting proceeds to foreign vendors under section 5 of this Act shall file a quarterly statement in the\nmanner as prescribed to the Commissioner Inland Revenue containing foreign vendor wise information\nregarding all payments related to e-commerce transactions of sale of digitally ordered services and\ngoods including as follows__\n(a)     name of the purchaser, its identification number (CNIC) and address of the\nforeign vendor to whom payments have been made from which tax has been\ncollected under section 5 and section 6;\n(b)     transaction date, unique identifier (invoice number) and total transaction value\nfrom which tax has been collected under section 5 and section 6;\n(c)     the total amount of tax deducted from the seller under section 5 and section 6;\nand\n(d)     any other particular may be prescribed.\n(2) Every payment intermediary maintaining bank account for foreign vendors with digital\npresence in Pakistan shall file a quarterly statement in the manner as prescribed to the Commissioner\nInland Revenue containing information regarding total credit amount in the bank account during this\nperiod in the account of foreign vendor and the amount remitted outside Pakistan."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Furnishing of information by social media and online platforms regarding",
      "content": "advertisement.__ Every social media and online platform having digital presence in Pakistan is\nrequired to file a quarterly statement in the manner as prescribed providing client-wise information of\nlocal vendors or foreign vendors with or without a permanent establishment whose advertisements are\nrelayed in Pakistan through its platform and the amount received.\nChapter V __ Penalty and Suspension"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Penalty for non",
      "content": "filing of statement.__ Where every payment intermediary and social\nmedia platform, who fails to submit the statement required under section 8 or section 9 of this Act,\nwith respect to digitally ordered services and goods or advertisements relayed in Pakistan shall be\nliable to a penalty of one million rupees for each default."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Suspension of remittances to a Foreign Advertiser",
      "content": "The payment intermediary shall\nsuspend the remittances of proceeds of such foreign vendors if it is reported to them by Commissioner\nthat such vendors are advertising continuously for one hundred and twenty days without the payment\nof this tax by the foreign vendor:\nProvided that this suspension shall be in addition to the recovery under section 7 for violation\nof section 6.\nChapter VI __ Appeals"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Appeals",
      "content": "(1) A person dissatisfied with any order of recovery under this Act can file an\nappeal with the Appellate Tribunal Inland Revenue within thirty days from the receipt of the order.\n(2) Within sixty days of the receipt of the order of the Appellate Tribunal Inland Revenue an\naggrieved person or the Commissioner may prefer a reference in the prescribed along with the\nstatement of the case and complete record of the appellate tribunal to the High Court stating any\nquestion of law arising out of such order.\nChapter VII __ Miscellaneous"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Administration of this Act",
      "content": "The Inland Revenue Department of the Board and its\nsubordinate offices shall act as tax administrator for the carrying out the purposes under this Act."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Power to make rules",
      "content": "The Board may prescribe rules for the purposes of giving effect to"
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Power to grant exemption",
      "content": "The Federal Government may, by notification in the official\nGazette, subject to such conditions and restrictions as may be specified therein, exempt any country,\nany class of goods or services and class of persons from the chargeability under this Act, as deemed\nappropriate.\nSchedule\n[See section 3(2)]\nshall be as under.\nS. No. Description                                       Rate of Tax\n(1)       (2)                                               (3)"
    }
  ],
  "definitions": [
    {
      "term": "Authority",
      "definition": "the Commissioner Inland Revenue who has been assigned jurisdiction for the purposes of this Act by the Federal Board of Revenue;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Central Board of Revenue established under the Central 1 Enacted vide section 12 of the Finance Act, 2025 (Act No. XIX of 2025). Board of Revenue Act, 1924 (IV of 1924), and on the commencement of Federal Board of Revenue Act, 2007, the Federal Board of Revenue established under section 3 thereof and includes a Member of the Federal Board of Revenue to whom powers of the Board have been delegated under section 8 of the Federal Board of Revenue Act, 2007;",
      "source_provision": "sec2"
    },
    {
      "term": "digitally delivered services",
      "definition": "any service delivered over the internet or electronic networks, where the delivery is automated and required minimal or no human intervention including music, audio and video streaming services, cloud services, online software application services, services delivered through online inter-personal interaction i.e. tele-medicine, e-learning etc., online banking services, architectural design services, research and consultancy reports, accounting services in the form of digital files or any other online facility;",
      "source_provision": "sec2"
    },
    {
      "term": "e-commerce",
      "definition": "sale or purchase of goods and services conducted over computer networks by methods specifically designed for the purpose of receiving or placing of orders either through websites, mobile applications or online marketplace having digital ordering features by using either mobile phones or automated computer-to-computer ordering system;",
      "source_provision": "sec2"
    },
    {
      "term": "e-store",
      "definition": "the online platform including websites and software applications used to conduct e-commerce, which involves buying and selling goods or services including digital products, through electronic transactions over the internet or other computer networks;",
      "source_provision": "sec2"
    },
    {
      "term": "online marketplace",
      "definition": "Online interfaces that facilitate, for a fee, the direct interaction between multiple buyers and multiple sellers for digital orders for supply of goods and services, without the platform taking economic ownership of the goods or rendering the services that are being sold; and",
      "source_provision": "sec2"
    },
    {
      "term": "payment Intermediary",
      "definition": "any third part entity including a banking company, financial institution, a licensed foreign exchange company or payments gateway that facilitate the transfer of funds or payment instructions between two or more parties to enable, process, route or settle payments in a financial transaction, without being the ultimate source or recipient of the payment. Chapter II __ Chargeability and Scope",
      "source_provision": "sec2"
    }
  ]
}
