{
  "id": "pk-diplomatic-and-consular-officers-oaths-and-fees-act-1948",
  "type": "statute",
  "title": "Diplomatic and Consular Officers (Oaths and Fees) Act, 1948",
  "title_en": "Diplomatic and Consular Officers (Oaths and Fees) Act, 1948",
  "short_name": "DACOA",
  "status": "in_force",
  "issued_date": "1949-01-07",
  "in_force_date": "1949-01-07",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap%2BUaQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Diplomatic and Consular Officers (Oaths and Fees) Act, 1948 (XXI of 1948) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "_ (1) This Act may be called the Diplomatic and\nConsular Officers (Oaths and Fees) Act, 1948.\n(2) It shall come into force at once, and shall be deemed to have taken effect from the\nfifteenth day of August, 1947."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.",
      "content": "_ In this Act, unless there is anything repugnant in the subject or context,___\n2\n[(a)   “consular officer” includes consul, consular agent, consul-general, honorary\nconsul, proconsul and vice-consul; and\n(b)        “diplomatic officer” includes ambassador, agent, agent-general, assistant high\ncommissioner, attache of a diplomatic mission, charged’ affaires,\ncommissioner, counsellor, deputy high commissioner, diplomatic secretary,\nhigh commissioner and minister.]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Powers as to oaths and notarial acts abroad",
      "content": "_ (1) Every diplomatic or consular officer\n3\n[of Pakistan exercising his functions in any foreign country or place, or any such diplomatic or\nconsular officer of a foreign country as is in writing authorized in this behalf by the 2[Federal\nGovernment] in relation to any foreign country or place,] may in that country or place administer\n4\n[either online or in physical form] any oath or affirmation and take any affidavit and also do any\nnotarial act which any notary public may do within the territories of Pakistan, and every such oath,\naffirmation, affidavit and notarial act administered, sworn or done by or before any such person shall\nbe as effectual as if duly administered, sworn or done by or before any lawful authority in any part of\nPakistan.\n(2) Any document purporting to have affixed, impressed or subscribed thereon or thereto the\nseal and signature of any person authorised by this section to administer an oath in testimony of any\noath, affirmation, affidavit or act being administered, sworn or done by or before him, shall be\nadmitted in evidence without proof of the seal or signature being the seal or signature of that person,\nor of the official character of that person.\n1\nFor Statement of Objects and Reasons, see Gaz. Of P., 1948, Pt. V p. 124.\n2\nSubs. and shall be deemed always to have been so subs. by the Diplomatic and Consular Officers (Oath and Fees) Ordinance, 1960 (12 of 1960), s. 2,\nfor the original cls. (a) and (b), as amended by the Diplomatic and Consular Officers (Oaths and Fees) Amendment Act, 1949 (3 of 1949), s. 2.\n3\nSubs. and shall be deemed always to have been so subs. by the Diplomatic and Consular Officers (Oaths and Fees) Ordinance, 1960 (12 of 1960), s. 3,\nfor the original words “exercising his functions in any foreign country or place”.\n4\nIns. by Diplomatic and Consular Officers (Oath and Fees) (Amendment) Act, 2022 (XXI of 2022), s. 2."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers to fix fees",
      "content": "_ The 5[Federal Government] shall have power to fix tables of fees to\nbe charged in respect of any act done in the execution of his office by a consular officer or by a\ndiplomatic officer entrusted with consular duties, and to make regulations in accordance with which\nfees shall be levied, accounted for and applied or may be remitted.\n(2) Tables of any fees so fixed and any regulations6 so made shall be published in the official\nGazette."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Exhibition of tables of fees",
      "content": "_ (1) Tables of the fees mentioned in the preceding section\nshall be exhibited prominently at every customs port, land customs station and customs aerodrome.\n(2) Every consular officer and diplomatic officer entrusted with consular functions shall\nexhibit the aforesaid tables of fees in his office prominently and shall permit them to be inspected by\nany person wishing to do so."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Penalty for taking excessive fees",
      "content": "_ No consular officer or diplomatic officer entrusted\nwith consular duties shall, save as may be provided in the aforesaid regulations, ask for or take any\nfee or reward for any act done in the execution of his office, and if he does so he shall, without\nprejudice to any other liability, be punishable for every such offence with fine which may extend to\nRs. 3,000."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Punishments for offence under this Act",
      "content": "_ (1) Whoever swears falsely in any oath or\naffidavit taken or made in accordance with the provisions of this Act shall be punished with\nimprisonment for a term which may extend to three years and shall also be liable to fine.\n(2) Whoever forges or fraudulently alters the seal or signature of any person authorised by or\nunder this Act to administer an oath or tenders in evidence, or otherwise uses, any affidavit having\nany seal or signature so forged or counterfeited or fraudulently altered knowing the same to be\nforged counterfeited or fraudulently altered, shall be punished with imprisonment for a term which\nmay extend to three years and shall also be liable to fine."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Trail of offences",
      "content": "_ Except as hereinafter provided, any offence under this Act may be\ninquired into dealt with, tried and punished in any Province of Pakistan in which the person charged\nwith the offence is or is apprehended or is in custody in the same manner and to the same extent as if\nthe offence had been committed within the Province where he is, or is apprehended or is in custody;\nProvided that no Court shall take cognizance of an offence under this Act with which any\nconsular officer or diplomatic officer is charged except upon complaint in writing made by a person\nauthorised in this behalf by general or special order of the 7[Federal Government].\n8\n[9. Power to make rules.⸻ The Federal Government may, by notification in the official\nGazette, make rules for carrying out the purposes of this Act.]\n5\nSubs. by F.A.O. 1975, Art. 2 and Table, for “Central Government”.\n6\nFor the Consular Fees Regulations, 1963, see Gaz. of P., 1963, Pt. I pp. 327-330.\n7\nSubs. by F.A.O. 1975, Art. 2 and Table, for “Central Government”.\n8\nAdded by Diplomatic and Consular Officers (Oath and Fees) (Amendment) Act, 2022 (XXI of 2022), s. 3."
    }
  ],
  "definitions": [
    {
      "term": "consular officer",
      "definition": "consul, consular agent, consul-general, honorary consul, proconsul and vice-consul; and",
      "source_provision": "sec2"
    },
    {
      "term": "diplomatic officer",
      "definition": "ambassador, agent, agent-general, assistant high commissioner, attache of a diplomatic mission, charged’ affaires, commissioner, counsellor, deputy high commissioner, diplomatic secretary, high commissioner and minister.]",
      "source_provision": "sec2"
    }
  ]
}
