{
  "id": "pk-diplomatic-immunities-common-wealth-countries-representatives-act-1957",
  "type": "statute",
  "title": "Diplomatic Immunities (Common wealth Countries Representatives), Act, 1957",
  "title_en": "Diplomatic Immunities (Common wealth Countries Representatives), Act, 1957",
  "short_name": "DIWCR",
  "status": "in_force",
  "issued_date": "1957-04-29",
  "in_force_date": "1957-04-29",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap%2Bcaw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Diplomatic Immunities (Common wealth Countries Representatives), Act, 1957 (XXIX of 1957) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "__ (1) This Act may be called the Diplomatic\nImmunities (Commonwealth Countries Representatives) Act, 1957.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "__ In this Act unless there is anything repugnant in the subject or context: ___\n(a)     “chief representative” means a person whether known by the title of High\nCommissioner or by any other title, who for the time being is recognized by\nthe Government of Pakistan as the chief representative in Pakistan of a\nCommonwealth Country for the purposes of this Act ;\n(b)     “envoy” means the envoy of a foreign sovereign power duly accredited in\nPakistan ;\n(c)     “member of the family” of a person means his wife and his unmarried children\nbelow the age of twentyone, when resident with him ;\n(d)     “prescribed” means prescribed by rules made under this Act ;\n(e)     “staff” of a chief representative includes every person employed by the chief\nrepresentative but not servants employed by a member of the staff ;\n(f)     “the official staff” of a chief representative means officials employed in a\nrepresentative capacity directly under the orders of the chief representative."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Immunity of chief representative",
      "content": "_ A chief representative is and shall be entitled to the\nimmunity from suit and legal process, and to the inviolability of residence, official premises and\nofficial archives, to which he would be entitled if he were an envoy."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Immunity of member of staff or family.___ (1) Subject to sub",
      "content": "section (2) a person who\nis,___\n(a)    a member of the family of a chief representative,\n(b)     a member of the staff of a chief representative, or\n(c)     a member of the family of a member of the official staff of a chief\nrepresentative,\nis and shall be entitled to the immunity from suit and legal process to which he would be\nentitled if the chief representative were an envoy.\n(2) When a person who is a member of the staff of a chief representative is or is deemed to be\na citizen of Pakistan___\n(a)     that person is and shall be entitled to immunity under this Act only in respect\nof things done or omitted to be done in the course of the performance of his\nduties as a member of that staff ; and\n(b)     a member of the family of that person is not by reason only of his being a\nmember of that family entitled to any immunity under this Act."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Rules for grant of consular immunity",
      "content": "_ The President may make rules providing that\nany person who holds any prescribed office in the service of the Government of a prescribed part of\nthe Commonwealth shall, on being recognized by the Government of Pakistan in the prescribed\nmanner as a person entitled to the immunity from suit and legal process and to the inviolability of\nofficial premises and official archives to which he would be entitled if he were a consular officer of a\nforeign sovereign power, be so entitled."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Waiver of immunity",
      "content": "_ (1) A chief representative may waive any right to immunity or\ninviolability to which—\n(a)   he or a member of his family,\n(b)   a member of his staff, or\n(c)   a member of the family of a member of his official staff may be entitled under\nthis Act.\n(2) A person may waive any right to immunity or inviolability which has been conferred on\nhim under the rules."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Certificate regarding immunity.___ (1) The Government may issue in the prescribed man",
      "content": "ner a certificate certifying any fact relevant to the question whether a person is or is not entitled\nunder this Act or the rules made thereunder to immunity from suit or legal process or to inviolability\nof residence, official premises or official archives.\n(2) A certificate issued under sub-section (1) shall be conclusive evidence in any legal\nproceedings of the facts certified in the certificate."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Rules",
      "content": "(1) The President may make rules for the purpose of carrying out the purposes of\nthis Act.\n(2) Without prejudice to the generality of the foregoing power the rules may provide that, if\nthe President is of the opinion that persons representing Pakistan in any country within the\nCommonwealth are not accorded treatment corresponding to the treatment accorded to persons\nrepresenting that country in Pakistan, the recognition of any representative of that country for the\npurposes of this Act and the immunities and inviolabilities to which the representatives or other\npersons of that country are otherwise entitled under this Act or the rules made thereunder shall cease,\nor that the immunities and inviolabilities shall be curtailed to the extent and in the manner\nprescribed.\n_________\nDate: 19-12-2024"
    }
  ],
  "definitions": [
    {
      "term": "chief representative",
      "definition": "a person whether known by the title of High Commissioner or by any other title, who for the time being is recognized by the Government of Pakistan as the chief representative in Pakistan of a Commonwealth Country for the purposes of this Act ;",
      "source_provision": "sec2"
    },
    {
      "term": "envoy",
      "definition": "the envoy of a foreign sovereign power duly accredited in Pakistan ;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act ;",
      "source_provision": "sec2"
    }
  ]
}
