{
  "id": "pk-pdp-bill-2023",
  "type": "statute",
  "title": "Personal Data Protection Bill 2023 (Draft / Adopted Provisions)",
  "title_en": "Pakistan Personal Data Protection Bill 2023",
  "short_name": "PDPB",
  "status": "in_force",
  "issued_date": "2023-01-01",
  "in_force_date": "2023-01-01",
  "url": "https://www.moitt.gov.pk/SiteImage/Misc/files/Personal%20Data%20Protection%20Bill%202021.pdf",
  "description": "Pakistan's Personal Data Protection Bill establishes the legal framework for the protection of personal data of Pakistani citizens, creating rights for data subjects and obligations for data controllers and processors. The Bill establishes the National Commission for Personal Data Protection (NCPDP) as the supervisory authority, sets requirements for consent, data localization, cross-border transfers, and breach notification, and aligns Pakistan's framework with international standards.",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short Title, Extent and Commencement",
      "content": "This Act may be called the Personal Data Protection Act. It shall extend to the whole of Pakistan and shall apply to the processing of personal data of citizens and residents of Pakistan wherever such processing takes place, including processing that takes place outside Pakistan by data controllers or processors who are established in Pakistan or who offer goods or services to, or monitor the behaviour of, data subjects who are in Pakistan. The Act shall not apply to personal data processed by individuals for purely personal or household activities, personal data processed for national security, law enforcement or judicial purposes to the extent prescribed, and anonymous data that cannot be linked back to any individual. The Act shall come into force on the date notified by the Federal Government in the official Gazette."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act: 'personal data' means any information relating to an identified or identifiable natural person ('data subject'), including an online identifier or one or more factors specific to the physical, physiological, genetic, mental, economic, cultural or social identity of that natural person; 'sensitive personal data' includes data relating to racial or ethnic origin, political opinions, religious or other beliefs, health data, genetic data, biometric data used for uniquely identifying a person, sex life or sexual orientation, and financial data; 'data controller' means a natural or legal person, public authority, agency or other body which, alone or jointly with others, determines the purposes and means of the processing of personal data; 'data processor' means a natural or legal person, public authority, agency or other body which processes personal data on behalf of the controller; 'processing' means any operation performed on personal data, whether automated or not, including collection, recording, organisation, storage, adaptation, retrieval, consultation, use, disclosure, or destruction."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Principles of Personal Data Processing",
      "content": "Personal data shall be: (a) processed lawfully, fairly and in a transparent manner in relation to the data subject; (b) collected for specified, explicit and legitimate purposes and not further processed in a manner that is incompatible with those purposes; (c) adequate, relevant and limited to what is necessary in relation to the purposes for which it is processed; (d) accurate and, where necessary, kept up to date; (e) kept in a form which permits identification of data subjects for no longer than is necessary for the purposes for which the personal data is processed; (f) processed in a manner that ensures appropriate security of the personal data, including protection against unauthorised or unlawful processing and against accidental loss, destruction or damage, using appropriate technical or organisational measures. The data controller shall be responsible for, and be able to demonstrate compliance with, these principles."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Lawful Bases for Processing",
      "content": "Processing of personal data shall be lawful only if at least one of the following applies: (a) the data subject has given consent to the processing of his or her personal data for one or more specific purposes; (b) processing is necessary for the performance of a contract to which the data subject is party or in order to take steps at the request of the data subject prior to entering into a contract; (c) processing is necessary for compliance with a legal obligation to which the data controller is subject; (d) processing is necessary in order to protect the vital interests of the data subject or of another natural person; (e) processing is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in the data controller; (f) processing is necessary for the purposes of the legitimate interests pursued by the data controller or by a third party, except where such interests are overridden by the interests or fundamental rights and freedoms of the data subject. Processing of sensitive personal data shall require explicit consent unless an exemption applies."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Rights of Data Subjects",
      "content": "Data subjects shall have the following rights: (a) Right of access: to obtain from the data controller confirmation as to whether personal data concerning them is being processed and, if so, access to the data and related information; (b) Right to rectification: to obtain from the data controller the rectification of inaccurate personal data; (c) Right to erasure: to obtain from the data controller the erasure of personal data where certain grounds apply, including where the data is no longer necessary; (d) Right to restriction: to obtain from the data controller restriction of processing in certain circumstances; (e) Right to data portability: to receive personal data in a structured, commonly used and machine-readable format; (f) Right to object: to object, on grounds relating to their particular situation, to processing based on legitimate interests; (g) Right not to be subject to automated decision-making: not to be subject to a decision based solely on automated processing which produces significant effects on them. Data controllers shall respond to requests from data subjects within thirty days."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Data Localization and Cross-Border Transfers",
      "content": "A critical copy of personal data of Pakistani citizens shall be stored on servers located in Pakistan. Transfer of personal data to any foreign country or territory shall only be made subject to: (a) an adequacy decision by the Commission declaring that the destination country or territory ensures an adequate level of protection; (b) appropriate safeguards such as standard contractual clauses approved by the Commission, binding corporate rules, or other legally binding instruments; (c) the data subject's explicit consent after being informed of the risks involved; or (d) where the transfer is necessary for the performance of a contract to which the data subject is party or for the implementation of pre-contractual measures taken at the data subject's request. The Commission shall maintain a list of countries and territories deemed to provide an adequate level of protection. Transfers to countries not on this list without appropriate safeguards shall constitute a serious violation of this Act."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Security of Processing",
      "content": "Data controllers and processors shall implement appropriate technical and organisational measures to ensure a level of security appropriate to the risk, including as appropriate: (a) the pseudonymisation and encryption of personal data; (b) the ability to ensure the ongoing confidentiality, integrity, availability and resilience of processing systems; (c) the ability to restore availability and access to personal data in a timely manner in the event of an incident; (d) a process for regularly testing, assessing and evaluating the effectiveness of technical and organisational measures. In assessing the appropriate level of security, account shall be taken of the risks presented by processing, including accidental or unlawful destruction, loss, alteration, unauthorised disclosure of, or access to, personal data. Data processors shall implement security measures equivalent to those required of controllers and shall process data only on the controller's documented instructions."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Data Breach Notification",
      "content": "In the case of a personal data breach, the data controller shall without undue delay, and where feasible, not later than 72 hours after becoming aware of it, notify the Commission of the breach. Notification to the Commission shall include: a description of the nature of the breach, including the categories and approximate number of data subjects concerned and the categories and approximate number of personal data records concerned; the contact details of the data protection officer or other contact point; likely consequences of the breach; measures taken or proposed to be taken to address the breach. Where the breach is likely to result in a high risk to the rights of individuals, the data controller shall also communicate the breach to the affected data subjects without undue delay. Data controllers shall document all breaches, including those not notified to the Commission, to enable verification of compliance."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. National Commission for Personal Data Protection",
      "content": "There shall be established a National Commission for Personal Data Protection (NCPDP) which shall be a body corporate with perpetual succession, a common seal, and authority to acquire and hold property. The Commission shall consist of a Chairman and not more than six other members, to be appointed by the Federal Government, who shall have expertise in data protection, information technology, law, or public administration. The Commission shall have the following functions: (a) monitor and enforce compliance with this Act; (b) promote awareness of data protection rights and obligations; (c) receive and investigate complaints from data subjects; (d) conduct audits of data controllers and processors; (e) advise the Government on data protection matters; (f) cooperate with data protection authorities of other countries; (g) impose administrative penalties for violations. The Commission shall be operationally independent in the exercise of its functions. Its decisions shall be subject to judicial review."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Penalties",
      "content": "Any person who contravenes the provisions of this Act or the rules made thereunder shall be liable to an administrative fine to be imposed by the Commission as follows: (a) for less serious violations: up to two percent of the annual turnover or five million Pakistani Rupees, whichever is higher; (b) for serious violations: up to four percent of the annual turnover or ten million Pakistani Rupees, whichever is higher; (c) for critical violations involving sensitive personal data, data of minors, or violations of data localization requirements: up to ten percent of annual turnover or fifty million Pakistani Rupees, whichever is higher. In assessing the fine, the Commission shall take into account the nature, gravity and duration of the violation, intentional or negligent character, any action taken to mitigate the damage, the degree of cooperation with the Commission, and any previous violations. Fines imposed shall be deposited in the Federal Consolidated Fund. Persons aggrieved by Commission decisions may appeal to the High Court."
    }
  ],
  "definitions": [
    {
      "term": "personal data",
      "definition": "Any information relating to an identified or identifiable natural person, including online identifiers or factors specific to the physical, physiological, genetic, mental, economic, cultural or social identity of that person.",
      "source_provision": "sec2"
    },
    {
      "term": "sensitive personal data",
      "definition": "Data relating to racial or ethnic origin, political opinions, religious or other beliefs, health data, genetic data, biometric data, sex life or sexual orientation, and financial data.",
      "source_provision": "sec2"
    },
    {
      "term": "data controller",
      "definition": "A natural or legal person, public authority, agency or other body which, alone or jointly with others, determines the purposes and means of the processing of personal data.",
      "source_provision": "sec2"
    },
    {
      "term": "data processor",
      "definition": "A natural or legal person, public authority, agency or other body which processes personal data on behalf of the data controller.",
      "source_provision": "sec2"
    }
  ]
}
