{
  "id": "pk-discontinuance-of-medical-reimbursement-act-1972",
  "type": "statute",
  "title": "Discontinuance of Medical Reimbursement Act, 1972",
  "title_en": "Discontinuance of Medical Reimbursement Act, 1972",
  "short_name": "DOMRA",
  "status": "in_force",
  "issued_date": "1972-09-23",
  "in_force_date": "1972-09-23",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2Nx-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Discontinuance of Medical Reimbursement Act, 1972 (XXV of 1972) published by The Pakistan Code (Service Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Discontinuance\nof Medical Reimbursement Act, 1972.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once and shall be deemed to have taken effect on the 1st day of\nJuly, 1972.\n(4) It shall apply to—\n(i)        all employees of the Federal and Provincial Governments whether serving in\nconnection with affairs of the Federation or of a Province or on deputation to\npublic corporations or statutory bodies; and\n(ii)       all other employees of public corporations and statutory bodies."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Discontinuance of reimbursement of medical expenses. Notwithstanding anything",
      "content": "contained in any law, rule, order or any instrument or contract, but subject to the provisions of section\n3, no employee to whom this Act applies shall be entitled to claim reimbursement for any medicine\npurchased by him for the treatment of himself or any member of his family, whether the medicines are\nprescribed by the authorised medical attendant or other medical authority."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Supply of medicines under certain conditions. An employee to whom this Act applies",
      "content": "may be allowed to get medicines prescribed for him or any member of his family by the authorised\nmedical attendant in accordance with any rules or orders made by his employer and within the limits\nof the funds allocated for the purpose in the budget of the department or body under which he is\nemployed."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. 1[Omitted]",
      "content": "RGN Date:-23.04.2024\n1\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch., II."
    }
  ],
  "definitions": []
}
