{
  "id": "pk-dissolution-of-muslim-marriages-act-1939",
  "type": "statute",
  "title": "Dissolution of Muslim Marriages Act, 1939",
  "title_en": "Dissolution of Muslim Marriages Act, 1939",
  "short_name": "DOMMA",
  "status": "in_force",
  "issued_date": "1939-03-16",
  "in_force_date": "1939-03-16",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJaW-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Dissolution of Muslim Marriages Act, 1939 (VIII of 1939) published by The Pakistan Code (Family Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent",
      "content": "(1) This Act may be called the Dissolution of Muslim Marriages\nAct, 1939.\n1\n[(2) It extends to the whole of Pakistan.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Grounds for decree for dissolution of marriage. A woman married under Muslim Law",
      "content": "shall be entitled to obtain a decree for the dissolution of her marriage on any one or more of the\nfollowing grounds, namely:__\n(i)        that the whereabouts of the husband have not been known for a period of four\nyears;\n(ii)       that the husband has neglected or has failed to provide for her maintenance for\na period of two years;\n2\n[(iia) that the husband has taken an additional wife in contravention of the\nprovisions of the Muslim Family Laws Ordinance, 1961;]\n(iii)      that the husband has been sentenced to imprisonment for a period of seven\nyears or upwards;\n(iv)       that the husband has failed to perform, without reasonable cause, his marital\nobligations for a period of three years;\n(v)        that the husband was impotant at the time of the marriage and continues to be\nso;\n(vi)       that the husband has been insane for a period of two years or is suffering from\nleprosy or a virulent venereal disease;\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch., (with effect from the 14th October, 1955).\n2\nIns. by the Muslim Family Laws Ordinance, 1961 (VIII of 1961), s. 13 (with effect from the 15th July, 1961).\n(vii)      that she, having been given in marriage by her father or other guardian before\nshe attained the age of 1[sixteen] years, repudiated the marriage before\nattaining the age of eighteen years:\nProvided that the marriage has not been consummated;\n2\n[(viia) lian;\nExplanation.__ Lian means where the husband has accused his wife of\nzina and the wife does not accept the accusation as true.]\n(viii)     that the husband treats her with cruelty, that is to say,__\n(a)        habitually assaults her or makes her life miserable by cruelty of\nconduct even if such conduct does not amount to physical\nill-treatment, or\n(b)        associates with women of evil repute or leads an infamous life, or\n(c)        attempts to force her to lead an immoral life, or\n(d)        disposes of her property or prevents her exercising her legal rights\nover it, or\n(e)        obstructs her in the observance of her religious profession or practice,\nor\n(f)        if he has more wives than one, does not treat her equitably in\naccordance with the injunctions of the Quran;\n(ix)       on any other ground which is recognised as valid for the dissolution of\nmarriages under Muslim law:\nProvided that—\n(a)        no decree shall be passed on ground (iii) until the sentence has become\nfinal;\n(b)        a decree passed on ground (i) shall not take effect for a period of six\nmonths from the date of such decree, and if the husband appears either\nin person or through an authorised agent within that period and\nsatisfies the Court that he is prepared to perform his conjugal duties,\nthe Court shall set aside the said decree; and\n1\nSubs. by the Muslim Family Laws Ordinance, 1961 (VIII of1961), s. 13 (with effect from the 15th July, 1961).\n2\nIns. by the Protection of Women (Criminal Laws Amendment) Act, 2006 (VI of 2006), s. 29.\n(c)        before passing a decree on ground (v) the Court shall, on application\nby the husband, make an order requiring the husband to satisfy the\nCourt within a period of one year from the date of such order that he\nhas ceased to be impotent, and if the husband so satisfies the Court\nwithin such period, no decree shall be passed on the said ground."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Notice to be served on heirs of the husband when the husbands’ whereabout are not",
      "content": "known. In a suit to which clause (i) of section 2 applies__\n(a)        the names and addresses of the persons who would have been the heirs of the\nhusband under Muslim law if he had died on the date of the filing of the plaint\nshall be stated in the plaint,\n(b)        notice of the suit shall be served on such persons, and\n(c)        such persons shall have the right to be heard in the suit:\nProvided that paternal uncle and brother of the husband, if any, shall be cited as party even if\nhe or they are not heirs."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Effect of conversion to another faith. The renunciation of Islam by a married Muslim",
      "content": "woman or her conversion to a faith other than Islam shall not by itself operate to dissolve her\nmarriage:\nProvided that after such renunciation, or conversion, the woman shall be entitled to obtain a\ndecree for the dissolution of her marriage on any of the grounds mentioned in section 2:\nProvided further that the provisions of this section shall not apply to a woman converted to\nIslam from some other faith who re-embraces her former faith."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Rights to dower not to be affected. Nothing contained in this Act shall affect any right",
      "content": "which a married woman may have under Muslim law to her dower or any part thereof on the\ndissolution of her marriage."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. 1[Repealed]",
      "content": "Date: 29-05-2024\n1\nRep. by the Repealing and Amending Act, 1942 (XXV of 1942), s. 2 and 1st Sch."
    }
  ],
  "definitions": []
}
