{
  "id": "pk-divorce-act-1869",
  "type": "statute",
  "title": "Divorce Act,1869",
  "title_en": "Divorce Act,1869",
  "short_name": "Divorce Act,1869",
  "status": "in_force",
  "issued_date": "1869-02-25",
  "in_force_date": "1869-02-25",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-a5Y%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Divorce Act,1869 (IV of 1869) published by The Pakistan Code (Family Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title. Commencement of Act. This Act may be called the 1[*] Divorce Act, and",
      "content": "shall come into operation on the first day of April, 1869."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Extent of Act. 2[This Act extends to the whole of Pakistan.]",
      "content": "Extent of power to grant relief generally, and to make decrees of dissolution, or of\nnullity. 3[Nothing hereinafter contained shall authorise any Court to grant any relief under this Act\nexcept where the petitioner 4[or respondent] professes the Christian religion,\nor to make decrees of dissolution of marriage except where the parties to the marriage are\ndomiciled in 1[Pakistan] at the time when the petition is presented,\n5\n[or to make decrees of nullity of marriage except where the marriage if solemnized before\nthe 15th day of August, 1947, has been solemnized in India and if solemnized on or after that date\nhas been solemnized in Pakistan and the petitioner is resident in Pakistan at the time of presenting\nthe petition.]\nor to grant any relief under this Act, other than a decree of dissolution of marriage or of\nnullity of marriage, except where the petitioner resides in 1[Pakistan] at the time of presenting the\npetition.]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Interpretation",
      "content": "clause. In this Act, unless there be something repugnant in the subject or\ncontext,―\n6 7\n[ [*          *              *                *          *           *            *]\n(2) ‘Court of Civil Judge’. “Court of Civil Judge” means, in the case of any petition under\nthis Act, the Court of the Civil Judge within the local limits of whose ordinary jurisdiction the\nhusband and wife reside or last resided together ;\n(3) ‘Court’. “Court” means the High Court, the District Court or the Court of Civil Judge, as\nthe case may be ;]]\n1\nOmitted by A. O., 1949, Sch.\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (Ordinance No. XXI of 1960), s. 3 and Sch. 2 (w. e. f. the 14th October, 1955).\n3\nSubs. by Act No. XXV of 1926.\n4\nIns. by Act No. XXX of 1927, s. 2.\n5\nSubs. by Act No. LVII of 1950, s. 2. (w. e. f. 15th day of August, 1947).\n6\nSubs. by Act, 1975 (Act No. IV of 1976), s. 2.\n7\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ordinance No. XXVII of 1981), s. 3, Sch. II\n(5) “Minor children”. “minor children” means, in the case of sons of 1[Pakistani] fathers,\nboys who have not completed the age of sixteen years, and, in the case of daughters of 1[Pakistani]\nfathers, girls who have not completed the age of thirteen years : in other cases it means unmarried\nchildren who have not completed the age of eighteen years :\n(6) “Incestuous adultery”. “incestuous adultery” means adultery committed by a husband\nwith a woman with whom, if his wife were dead, he could not lawfully contract marriage by reason\nof her being within the prohibited degrees of consanguinity (whether natural or legal) or affinity :\n(7) “Bigamy with adultery”. “bigamy with adultery” means adultery with the same woman\nwith whom the bigamy was committed :\n(8) “Marriage with another woman”. “marriage with another woman’’ means marriage of\nany person, being married, to any other person, during the life of the former wife, whether the second\nmarriage shall have taken place within 2[Pakistan] or elsewhere :\n(9) “Desertion.” “desertion” implies an abandonment against the wish of the person charging\nit : and\n(10) “Property.” “property” includes, in the case of a wife, any property to which she is\nentitled for an estate in remainder or reversion, or as a trustee, executrix or administratrix ; and the\ndate of the death of the testator or intestate shall be deemed to be the time at which any such wife\nbecomes entitled as executrix or administratrix.\n________\nII.—JURISDICTION"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. [Matrimonial Jurisdiction of High Courts to be exercised subject to Act.] Omitted by the",
      "content": "Divorce (Amdt.) Act, 1975 (IV of I976), s. 3."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. [Enforcement of decrees or orders made heretofore by Supreme or High Court.] Omitted",
      "content": "by the Divorce (Amdt.) Act, 1975 (IV of 1976) s. 4."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. [Court to act on principles of English Divorce Court.] Omitted by the Federal Laws",
      "content": "(Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and II Sch."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. [Reference to High Court.] Omitted by the Divorce (Amdt.) Act, 1975 (IV of 1976), s.7",
      "content": "___________\n1\nSubs. by Act, 1975 (Act No. IV of 1976), s. 2.\n2\nSubs. by the Central Laws (Adaptation) Order, 1961 (President’s Order No. 1 of 1961), Art. 2 and Sch., (w. e. f. 23 March, 1956).\nIII.—DISSOLUTION OF MARRIAGE"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. When husband may petition for dissolution. Any husband may present a petition to the",
      "content": "1\n[Court of Civil Judge] praying that his marriage may be dissolved on the ground that this wife has,\nsince the solemnization thereof, been guilty of adultery.\nWhen wife may petition for dissolution. Any wife may present a petition to the 1[Court of\nCivil Judge] praying that her marriage may be dissolved on the ground that, since the solemnization\nthereof, her husband has exchanged his profession of Christianity for the profession of some other\nreligion, and gone through a form of marriage with another woman ;\nor has been guilty of incestuous adultery.\nor of bigamy with adultery.\nor of marriage with another woman with adultery.\nor of rape, sodomy or bestiality.\nor of adultery coupled with such cruelty as without adultery would have entitled her to a\ndivorce a mensa et toro.\nor of adultery coupled with desertion, without reasonable excuse, for two years or upwards.\nContents of petition. Every such petition shall state, as distinctly as the nature of the case\npermits, the facts on which the claim to have such marriage dissolved is founded."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Adulterer to be co",
      "content": "respondent. Upon any such petition presented by a husband, the\npetitioner shall make the alleged adulterer a co-respondent to the said petition, unless he is excused\nfrom so doing on one of the following grounds, to be allowed by the Court :―\n(1) that the respondent is leading the life of a prostitute, and that the petitioner knows of no\nperson with whom the adultery has been committed ;\n(2) that the name of the alleged adulterer is unknown to the petitioner although he has made\ndue efforts to discover it ;\n(3) that the alleged adulterer is dead."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Court to be satisfied of absence of collusion. Upon any such petition for the dissolution",
      "content": "of a marriage, the Court shall satisfy itself, so far as it reasonably can, not only as to the facts alleged,\nbut also whether or not the petitioner has been in any manner accessory to, or conniving at, the going\nthrough of the said form of marriage, or the adultery, or has condoned the same, and shall also\ninquire into any countercharge which may be made against the petitioner."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Dismissal of petition. In case the Court, on the evidence in relation to any such petition,",
      "content": "is satisfied that the petitioner’s case has not been proved, or is not satisfied that the alleged adultery\nhas been committed,\nor finds that the petitioner has, during the marriage, been accessory to, or conniving at, the\ngoing through of the said form of marriage, or the adultery of the other party to the marriage, or has\ncondoned the adultery complained of,\nor that the petition is presented or prosecuted in collusion with either of the respondents.\nthen and in any of the said cases the Court shall dismiss the petition.\n1\n[*                   *                     *                        *              *   *    *]\n1\nSubs. and omitted by Act, 1975 (Act No. IV of 1976), ss. 8 and 9."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Power to Court to pronounce decree for dissolving marriage. In case the Court is",
      "content": "satisfied on the evidence that the case of the petitioner has been proved,\nand does not find that the petitioner has been in any manner accessory to, or conniving at, the\ngoing through of the said form of marriage, or the adultery of the other party to the marriage, or has\ncondoned the adultery complained of,\nor that the petition is presented or prosecuted in collusion with either of the respondents.\nthe Court shall pronounce a decree declaring such marriage to be dissolved 1[* * *]\nProvided that the Court shall not be bound to pronounce such decree if it finds that the\npetitioner has, during the marriage, been guilty of adultery,\nor if the petitioner has, in the opinion of the Court, been guilty of unreasonable delay in\npresenting or prosecuting such petition,\nor of cruelty towards the other party to the marriage,\nor of having deserted or wilfully separated himself or herself from the other party before the\nadultery complained of, and without reasonable excuse.\nor of such wilful neglect or misconduct of or towards the other party as has conduced to the\nadultery.\nCondonation. No adultery shall be deemed to have been condoned within the meaning of\nthis Act unless where conjugal co-habitation has been resumed or continued."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Relief in case of opposition on certain grounds. In any suit instituted for dissolution of",
      "content": "marriage, if the respondent opposes the relief sought on the ground, in case of such a suit instituted\nby a husband, of his adultery, cruelty or desertion without reasonable excuse, or, in case of such a\nsuit instituted by a wife, on the ground of her adultery and cruelty, the Court may in such suit give to\nthe respondent, on his or her application, the same relief to which he or she would have been entitled\nin case he or she had presented a petition seeking such relief, and the respondent shall be competent\nto give evidence of or relating to such cruelty or desertion."
    },
    {
      "provision_ref": "sec17a",
      "section": "17A",
      "title": "Section 17A. [Appointment of officer to exercise duties of King’s Proctor.] Omitted by the Divorce",
      "content": "(Amdt.) Act. 1975 (IV of 1976), s. 11.\n________\nl\nOmitted by Act, 1975 (Act No. IV of 1976), s. 10.\nIV.–– NULLITY OF MARRIAGE"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Petition for decree of nullity. Any husband or wife may present a petition to the 1[Court",
      "content": "of Civil Judge], praying that his or her marriage may be declared null and void."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Grounds of decrees. Such decree may be made on any of the following grounds :―",
      "content": "(1) that the respondent was impotent at the time of the marriage and at the time of the\ninstitution of the suit ;\n(2) that the parties are within the prohibited degrees of consanguinity (whether natural or\nlegal) or affinity ;\n(3) that either party was a lunatic or idoit at the time of the marriage ;\n(4) that the former husband or wife of either party was living at the time of the marriage, and\nthe marriage with such former husband or wife was then in force.\nNothing in this section shall affect the jurisdiction of the 1[Court] to make decrees of nullity\nof marriage on the ground that the consent of either party was obtained by force or fraud."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Children of annulled marriage. Where a marriage is annulled on the ground that a",
      "content": "former husband or wife was living, and it is adjudged that the subsequent marriage was contracted in\ngood faith and with the full belief of the parties that the former husband or wife was dead, or when a\nmarriage is annulled on the ground of insanity, children begotten before the decree is made shall be\nspecified in the decree, and shall be entitled to succeed, in the same manner as legitimate children, to\n________\nV.—JUDICIAL SEPARATION"
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Bar to decree for divorce a mensa et toro but judicial separation obtainable by",
      "content": "husband or wife. No decree shall hereafter be made for a divorce a mensa et toro, but the husband\nor wife may obtain a decree of judicial separation, on the ground of adultery, or cruelty, or desertion\nwithout reasonable excuse for two years or upwards, and such decree shall have the effect of a\ndivorce a mensa et toro under the existing law, and such other legal effect as hereinafter mentioned."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Application for separation made by petition. Application for judicial separation on any",
      "content": "one of the grounds aforesaid may be made by either husband or wife by petition to the 1[Court of\nCivil Judge] and the Court, on being satisfied of the truth of the statements made in such petition,\nand that there is no legal ground why the application should not be granted, may decree judicial\nseparation accordingly."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Separated wife deemed spinster with respect to after",
      "content": "acquired property. In every\ncase of a judicial separation under this Act, the wife shall, from the date of the sentence, and whilst\nthe separation continues, be considered as unmarried with respect to property of every description\nwhich she may acquire, or which may come to or devolve upon her.\n1\nSubs. by Act, 1975 (Act No. IV of 1976), ss. 12, 13 and 15.\nSuch property may be disposed of by her in all respects as an unmarried woman, and on her\ndecease the same shall, in case she dies intestate, go as the same would have gone if her husband had\nbeen then dead :\nProvided that, if any such wife again cohabits with her husband, all such property as she may\nbe entitled to when such cohabitation takes place shall be held to her separate use, subject, however,\nto any agreement in writing made between herself and her husband whilst separate."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Separated wife deemed spinster for purposes of contract and suing. In every case of a",
      "content": "judicial separation under this Act, the wife shall whilst so separated, be considered as an unmarried\nwoman for the purposes of contract, and wrongs and injuries, and suing and being sued in any civil\nproceeding ; and her husband shall not be liable in respect of any contract, act or costs entered into,\ndone, omitted or incurred by her during the separation :\nProvided that where, upon any such judicial separation, alimony has been decreed or ordered\nto be paid to the wife, and the same is not duly paid by the husband, he shall be liable for necessaries\nsupplied for her use :\nProvided also that nothing shall prevent the wife from joining, at any time during such\nseparation, in the exercise of any joint power given to herself and her husband."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Decree of separation obtained during absence of husband or wife may be reversed",
      "content": "Any husband or wife, upon the application of whose wife or husband, as the case may be, a decree of\njudicial separation bas been pronounced, may, at any time thereafter, present a petition to the Court\nby which the decree was pronounced, praying for a reversal of such decree, on the ground that it was\nobtained in his or her absence, and that there was reasonable excuse for the alleged desertion, where\ndesertion was the ground of such decree.\nThe Court may, on being satisfied of the truth of the allegations of such petition, reverse the\ndecree accordingly ; but such reversal shall not prejudice or affect the rights or remedies which any\nother person would have had, in case it had not been decreed, in respect of any debts, contracts or\nacts of the wife incurred, entered into or done between the times of the sentence of separation and of\nthe reversal thereof.\n________\nVI.—PROTECTION-ORDERS"
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Deserted wife may apply to Court for protection. Any wife to whom section 4 of the",
      "content": "Indian Succession Act, 1865,1 (X of 1865), does not apply, may, when deserted by her husband,\npresent a petition to the 2[Court of Civil Judge] at any time after such desertion, for an order to\nprotect any property which she may have acquired or may acquire, and any property of which she\nmay have become possessed or may become possessed after such desertion, against her husband or\nhis creditors, or any person claiming under him."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Court may grant protection",
      "content": "order. The Court, if satisfied of the fact of such desertion,\nand that the same was without reasonable excuse, and that the wife is maintaining herself by her own\nindustry or property, may make and give to the wife an order protecting her earnings and other\nproperty from her husband and all creditors and persons claiming under him. Every such order shall\nstate the time at which the desertion commenced, and shall, as regards all persons dealing with the\nwife in reliance thereon, be conclusive as to such time.\n1\nSuccession Act, 1925 (Act No. XXXIX of 1925).\n2\nSubs. by Act, 1975 (Act No. IV of 1976), s. 15."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Discharge or variation of orders. The husband or any creditor of, or person claiming",
      "content": "under him, may apply to the Court by which such order was made for the discharge or variation\nthereof, and the Court, if the desertion has ceased, or if for any other reason it think fit so to do, may\ndischarge or vary the order accordingly."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Liability of husband seizing wife’s property after notice of order. If the husband, or",
      "content": "any creditor of, or person claiming under, the husband, seizes or continues to hold any property of\nthe wife after notice of any such order, he shall be liable, at the suit of the wife (which she is hereby\nempowered to bring), to return or deliver to her the specific property, and also to pay her a sum equal\nto double its value."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Wife’s legal position during continuance of order. So long as any such order of",
      "content": "protection remains in force, the wife shall be and be deemed to have been, during such desertion of\nher, in the like position in all respects, with regard to property and contracts and suing and being\nsued, as she would be under this Act if she obtained a decree of judicial separation.\n________\nVII.—RESTITUTION OF CONJUGAL RIGHTS"
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Petition for restitution of conjugal rights. When either the husband or the wife has,",
      "content": "wothout reasonable excuse withdrawn from the society of the other, either wife or husband may\napply, by petition to the l[Court of Civil Judge], for restitution of conjugal rights, and the Court, on\nbeing satisfied of the truth of the statements made in such petition, and that there is no legal ground\nwhy the application should not be granted, may decree restitution of conjugal rights accordingly."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Answer to petition. Nothing shall be pleaded in answer to a petition for restitution of",
      "content": "conjugal rights which would not be ground for a suit for judicial separation or for a decree of nullity\nof marriage.\n______________\nVIII.—DAMAGES AND COSTS"
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Husband may claim damages from adulterer. Any husband may, either in a petition",
      "content": "for dissolution of marriage or for judicial separation, or in a petition to the l[Court of Civil Judge]\nlimited to such object only, claim damages from any person on the ground of his having committed\nadultery with the wife of such petitioner.\nSuch petition shall be served on the alleged adulterer and the wife unless the Court dispenses\nwith such service, or directs some other service to be substituted.\nThe damages to be recoverd on any such petition shall be ascertained by the said Court,\nalthough the respondents or either of them may not appear.\nAfter the decision has been given, the Court may direct in what manner such damages shall\nbe paid or applied."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Power to order adulterer to pay costs. Whenever in any petition presented by a",
      "content": "husband, the alleged adulterer has been made a co-respondent, and the adultery has been established,\nthe Court may order the co-respondent to pay the whole or any part of the cost of the proceedings :\nProvided that the co-respondent shall not be ordered to pay the petitioner’s cost ––\nl\nSubs. by Act, 1975 (Act No. IV of 1976), s. 15.\n(1) if the respondent was, at the time of the adultery, living apart from her husband and\nleading the life of a prostitute, or\n(2) if the co-respondent had not, at the time of the adultery, reason to believe the respondent\nto be a married woman.\n1\n[*             *                   *                  *              *       *       *]\n________\nIX.—ALIMONY"
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Alimony pendente lite. In any suit under this Act, whether it be instituted by a husband or",
      "content": "a wife, and whether or not she has obtained an order of protection, the wife may present a petition for\nalimony pending the suit.\nSuch petition shall be served on the husband ; and the Court, on being satisfied of the truth of\nthe statements therein contained, may make such order on the husband for payment to the wife of\nalimony pending the suit as it may deem just :\nProvided that alimony pending the suit shall in no case exceed one-fifth of the husband’s\naverage net income for the three years next preceding the date of the order, and shall continue, in\ncase of a decree for dissolution of marriage or of nullity of marriage, until the decree is made\nabsolute or is confirmed, as the case may be."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Power to order permanent alimony.1[* * * * * * *]",
      "content": "1\n[*      *          *           *          *          *          *]\n1\n[The Court may, if it thinks fit, on any decree declaring a marriage to be dissolved or on any\ndecree of judicial separation obtained by the wife, order] that the husband shall, to the satisfaction of\nthe Court, secure to the wife such gross sum of money, or such annual sum of money for any term\nnot exceeding her own life, as having regard to her fortune (if any), to the ability of the husband, and\nto the conduct of the parties, it thinks reasonable, and for that purpose may cause a proper instrument\nto be executed by all necessary parties.\nPower to order monthly or weekly payments. In every such case the Court may make an\norder on the husband for payment to the wife of such monthly or weekly sums for her maintenance\nand support as the Court may think reasonable :\nProvided that if the husband afterwards from any cause becomes unable to make such\npayments, it shall be lawful for the Court to discharge or modify the order, or temporarily to suspend\nthe same as to the whole or any part of the money so ordered to be paid, and again to revive the same\norder wholly or in part, as to the Court seems fit."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Court may direct payment of alimony to wife or to her trustee. In all cases in which",
      "content": "the Court makes any decree or order for alimony it may direct the same to be paid either to the wife\nherself, or to any trustee on her behalf to be approved by the Court, and may impose any terms or\nrestrictions which to the Court seem expedient, and may from time to time appoint a new trustee, if it\nappears to the Court expedient so to do.\n________\n1\nOmitted and subs. by Act, 1975 (Act No. IV of 1976), s. 16, 17 (a) and (b).\nX.—SETTLEMENTS"
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Power to order settlement of wife’s property for benefit of husband and children",
      "content": "Whenever the Court pronounces a decree of dissolution of marriage or judicial separation for\nadultery of the wife, if it is made to appear to the Court that the wife is entitled to any property, the\nCourt may, if it think fit, order such settlement as it thinks reasonable to be made of such property or\nany part thereof, for the benefit of the husband, or of the children of the marriage, or of both.\nAny instrument executed pursuant to any order of the Court at the time of or after the\npronouncing of a decree of dissolution of marriage or judicial separation shall be deemed valid\nnotwithstanding the existence of the disability of coverture at the time of the execution thereof.\nSettlement of damages. The Court may direct that the whole or any part of the damages\nrecovered under section 34 shall be settled for the benefit of the children of the marriage, or as a\nprovision for the maintenance of the wife."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Inquiry into existence of ante",
      "content": "nuptial or post-nuptial settlements.\n1\n[*      *          *          *          *           *          *]\n1\n[*      *          *          *          *           *          *]\n1\n[The Court, after making a decree for dissolution of marriage or a decree of nullity of\nmarriage, may] inquire into the existence of ante-nuptial or post-nuptial settlements made on the\nparties whose marriage is the subject of the decree, and may make such orders, with reference to the\napplication of the whole or a portion of the property settled, whether for the benefit of the husband or\nthe wife, or of the children (if any) of the marriage, or of both children and parents, as to the Court\nseems fit :\nProvided that the Court shall not make any order for the benefit of the parents or either of\nthem at the expense of the children.\nXI.— CUSTODY OF CHILDREN"
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Power to make orders as to custody of children in suit for seperation. In any suit for",
      "content": "obtaining a judicial separation the Court may from time to time, before making its decree, make such\ninterim orders, and may make such provision in the decree, as it deems proper with respect to the\ncustody, maintenance and education of the minor children, the marriage of whose parents is the\nsubject of such suit, and may, if it thinks fit, direct proceedings to be taken far placing such children\nunder the protection of the said Court."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Power to make such orders after decree. The Court, after a decree of judicial",
      "content": "separation, may upon application (by petition) far this purpose make, from time to time, all such\norders and provision, with respect to the custody, maintenance and education of the minor children,\nthe marriage of whose parents is the subject of the decree, or for placing such children under the\nprotection of the said Court, as might have been made by such decree or by interim orders in case the\nproceedings far obtaining such decree were still pending.\n1\n[43. Power to make orders as to custody of children in suits for dissolution or nullity.— In\nany suit for obtaining a dissolution of marriage or a decree of nullity of marriage, the Court may\nfrom time to time, before making its decree, make such interim orders, and may make such provision\nin the decree, as it deems proper with respect to the custody, maintenance and education of the minor\nchildren, the marriage of whose parents is the subject of the suit ; and may, if it thinks fit, direct\nproceedings to be taken far placing such children under the protection of the Court.].\n1\nOmitted and subs. by Act, 1975 (Act No. IV of 1976), ss. 18 (a) and (b) and 19.\n1\n[44. Power to make such orders after decree.—The Court, after a decree for dissolution of\nmarriage or a decree of nullity of marriage, may, upon application by petition for the purpose, make\nfrom time to time all such orders and provision, with respect to the custody, maintenance and educa-\ntion of the minor children, the marriage of whose parents was the subject of the decree, or for placing\nsuch children under the protection of the Court, as might have been made by such decree or by such\ninterim orders as aforesaid.].\nXII.—PROCEDURE"
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Code of Civil Procedure to apply. Subject to the provisions herein contained, all",
      "content": "proceedings under this Act between party and party shall be regulated by the Code of Civil\nProcedure2."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Forms of petitions and statements. The forms set forth in the Schedule to this Act, with",
      "content": "such variation as the circumstances of each case require, may be used for the respective purposes\nmentioned in such schedule."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Stamp on petition. Petition to state absence of collusion. Every petition under this Act",
      "content": "for a decree of dissolution of marriage or of nullity of marriage, or of judicial separation 3[* * *]\nshall 3[* * *] state that there is not any collusion or connivance between the petitioner and the other\nparty to the marriage ;\nStatements to be verified. the statements contained in every petition under this Act shall be\nverified by the petitioner or some other competent person in manner required by law for the\nverification of plaints, and may at the hearing be referred to as evidence."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Suits on behalf of lunatics. When the husband or wife is a lunatic or idiot, any suit",
      "content": "under this Act (other than a suit for restitution of conjugal rights) may be brought on his or her behalf\nby the committee or other person entitled to his or her custody."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Suits by minors. Where the petitioner is a minor, he or she shall sue by his or her next",
      "content": "friend to be approved by the Court ; and no petition presented by a minor under this Act shall be filed\nuntil the next friend has undertaken in writing to be answerable for costs.\nSuch undertaking 3[* * *] shall be filed in Court, and the next friend shall thereupon be\nliable in the same manner and to the same extent as if he were a plaintiff in an ordinary suit."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Service of petition. Every petition under this Act shall be served on the party to be",
      "content": "affected thereby, either within or without 4[Pakistan], in such manner as the High Court by general or\nspecial order from time to time directs :\nProvided that the Court may dispense with such service altogether in case it seems necessary\nor expedient so to do."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Mode of taking evidence. The witnesses in all proceedings before the Court, where their",
      "content": "attendance can be had, shall be examined orally, and any party may offer himself or herself as a\nwitness, and shall be examined and may be cross-examined and re-examined, like any other witness :\nProvided that the parties shall be at liberty to verify their respective cases in whole or in part\nby affidavit, but so that the deponent in every such affidavit shall, on the application of the opposite\nparty, or by direction of the Court, be subject to be cross examined by or on behalf of the opposite\nparty orally, and after such cross-examination may be re-examined orally as aforesaid by or on\nbehalf of the party by whom such affidavit was filed.\n1\nSubs. by Act, 1975 (Act No. IV of 1976), s. 20.\n2\nCode of Civil Procedure Act, 1908 (V of 1908).\n3\nRep. by the Court-Fees Act, 1870 (VII of 1870), see now Art. 7 of Sch. II to that Act.\n4\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (Ordinance No. XXI of 1960), s.3 and Sch. II (w. e. f. the 14th October, 1955)."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Competence of husband and wife to give evidence as to cruelty or desertion. On any",
      "content": "petition presented by a wife, praying that her marriage may be dissolved by reason of her husband\nhaving been guilty of adultery coupled with cruelty, or of adultery coupled with desertion without\nreasonable excuse, the husband and wife respectively shall be competent and compellable to give\nevidence of or relating to such cruelty or desertion."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Power to close doors. The whole or any part of any proceeding under this Act may be",
      "content": "heard, if the Court thinks fit, with closed doors."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Power to adjourn. The Court may from time to time adjourn the hearing of any petition",
      "content": "under this Act, and may require further evidence thereon if it sees fit so to do."
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Enforcement of and appeal from orders and decrees. All decrees and orders made by",
      "content": "the like manner as the decrees and orders of the Court made in the exercise of its original civil\njurisdiction are enforced and may be appealed from under the laws, rules and orders for the time\nbeing in force :\n2\n[*           *              *             *              *             *           *]\n2\nNo appeals as to costs. Provided [*] that there shall be no appeal on the subject of costs\nonly."
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. [Appeal to Supreme Court.] Omitted by the Divorce (Amdt.) Act, 1975 (IV of 1976), s. 22",
      "content": "XIII.—RE-MARRIAGE\n2\n[57. Liberty to parties to marry again.— After the expiry of six months from the date of a\ndecree for the dissolution of a marriage, or, where an appeal has been presented against any such\ndecree, after the dismissal of such appeal or the declaration of the marriage as dissolved as a result of\nsuch appeal, but not sooner, it shall be lawful for the parties to the marriage to marry again as if the\nprior marriage had been dissolved by death]."
    },
    {
      "provision_ref": "sec58",
      "section": "58",
      "title": "Section 58. English clergyman not compelled to solemnize marriages of persons divorced for",
      "content": "adultery. No clergyman in Holy Orders of the 3[*] Church of England 3[* *] shall be compelled to\nsolemnize the marriage of any person whose former marriage has been dissolved on the ground of\nhis or her adultery, or shall be liable to any suit, penalty or censure for solemnizing or refusing to\nsolemnize the marriage of any such person."
    },
    {
      "provision_ref": "sec59",
      "section": "59",
      "title": "Section 59. English minister refusing to perform ceremony to permit use of his church. When",
      "content": "any minister of any church or chapel of the said 3[*] Church refuses to perform such marriage service\nbetween any persons who, but for such refusal would be entitled to have the same service performed\nin such church or chapel, such minister shall permit any other minister in Holy Orders of the said\nChurch entitled to officiate within the diocese in which such church or chapel is situate, to perform\nsuch marriage service in such church or chapel.\n_______\n1\n2\nOmitted and subs. by Act, 1975 (Act No. IV of 1976), ss. 21 and 23.\n3\nRepealing by Act No. 12 of 1873.\nXIV.—MISCELLANEOUS"
    },
    {
      "provision_ref": "sec60",
      "section": "60",
      "title": "Section 60. Decree for separation or protection order valid as to persons dealing with wife",
      "content": "before reversal. Every decree for judicial separation or order to protect property obtained by a wife\nunder this Act shall, until reversed or discharged, be deemed valid, so far as necessary, for the\nprotection of any person dealing with the wife.\nNo reversal, discharge or variation of such decree or order shall affect any rights or remedies\nwhich any person would otherwise have had in respect of any contracts or acts of the wife entered\ninto or done between the dates of such decree or order and of the reversal, discharge or variation\nthereof.\nIndemnity of persons making payment to wife without notice of reversal of decree or\nprotection order. All persons who in reliance on any such decree or order make any payment to, or\npermit any transfer or act to be made or done by, the wife who has obtained the same shall,\nnotwithstanding such decree or order may then have been reversed, discharged or varied, or the\nseparation of the wife from her husband may have ceased, or at some time since the making of the\ndecree or order been discontinued, be protected and indemnified as if, at the time of such payment,\ntransfer or other act, such decree or order were valid and still subsisting without variation, and the\nseparation had not ceased or been discontinued,\nunless, at the time of the payment, transfer or other act, such persons had notice of the\nreversal, discharge or variation of the decree or order or of the cessation or discontinuance of the\nseparation."
    },
    {
      "provision_ref": "sec61",
      "section": "61",
      "title": "Section 61. Bar of suit for criminal conversation. After this Act comes into operation, no person",
      "content": "competent to present a petition under sections 2 and 10 shall maintain a suit for criminal\nconversation with his wife."
    },
    {
      "provision_ref": "sec62",
      "section": "62",
      "title": "Section 62. Power to make rules. The High Court shall make such rules under this Act as it may",
      "content": "from time to time consider expedient, and may from time to time alter and add to the same :\nProvided that such rules, alterations and additions are consistent with the provisions of this\nAct and the Code of Civil Procedure1.\nAll such rules, alterations and additions shall be published in the 2[official Gazette].\n1\n2\nSubs. by A. O., 1937.\nNo. 1.—PETITION BY HUSBAND FOR A DISSOLUTION OF MARRIAGE WITH\nDAMAGES AGAINST CO-RESPONDENT, BY REASON OF ADULTERY.\n(See sections 10 and 34)\nIn the 1[*]        Court of\n1\n[*                *                   *              *                  *          *               *]\nThe                    day of                      186.\nThe petition of A. B., of\nSHEWETH,"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. That on one Friday night in the month of , one thousand eight hundred and ,the",
      "content": "said C. B., in         , without provocation, threw a knife at your petitioner, thereby inflicting a\nsevere wound on her right hand."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. That there is no collusion or connivance between your petitioner and her said husband with",
      "content": "respect to the subject of the present suit.\n1\nOmitted by Act, 1975 (Act No. IV of 1976), s. 24.\nYour petitioner, therefore, prays that this 1[*] Court will decree a judicial separation\nbetween your petitioner and the said C. B., and also order that the said C.B. do pay the\ncosts of and incident to these proceedings.\n(Signed)                       A. B.\n_______\nForm of Verification : see No. 1\n______\nNo. 9.—STATEMENT IN ANSWER TO No. 8\nIn the 1[*]          Court of\nThe                                     day of                                                  .\nBetween A. B., petitioner, and C. B., respondent.\nC.B., the respondent, in answer to the petition filed in this cause, by W. J., his attorney [or\nvakil], saith that he denies that he has been guilty of cruelty towards the said A. B.. as alleged in the\nsaid petition.\n(Signed)                              C.B.\n_______\nNo. 10.—PETITION FOR REVERSAL OF DECREE OF SEPARATION\n(See section 24)\nIn the 2[*]                                 Court of\n1\n[*               *                      *               *             *               *               *]\nThe            day of              , 186.\nThe petition of A. B., of\nSHEWETH,"
    }
  ],
  "definitions": []
}
