{
  "id": "pk-dock-labourers-act-1934",
  "type": "statute",
  "title": "Dock Labourers Act, 1934",
  "title_en": "Dock Labourers Act, 1934",
  "short_name": "DLA",
  "status": "in_force",
  "issued_date": "1934-08-18",
  "in_force_date": "1934-08-18",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-b56V-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Dock Labourers Act, 1934 (XIX of 1934) published by The Pakistan Code (Labour Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, commencement and application",
      "content": "(1) This Act may be called the\n2\n[*] Dock Labourers Act, 1934.\n1\n[(2) It extends to the whole of Pakistan.]\n(3) It shall come into force on such date as the 3[Federal Government] may, by notification in\n4\nthe [official Gazette], appoint.\n(4) It shall not apply to any ship of war of any nationality."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(a)        “the processes” includes all work which is required for or is incidental to the\nloading or unloading of cargo or fuel into or from a ship and is done on board\nthe ship or alongside it ; and\n(b)        “worker” means any person employed in the processes."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Inspectors",
      "content": "(1) The 6[Federal Government] may, by notification in the 4[official\nGazette], appoint such persons as it thinks fit to be Inspectors for the purposes of this Act within\nsuch local limits as it may assign to them respectively.\n(2) All Principal Officers of the Mercantile Marine Department shall be Inspectors under this\nAct, ex-officio, within the limits of their charges.\n(3) Every Inspector shall be deemed to be a public servant within the meaning of the Pakistan\nPenal Code (XLV of 1860), and shall be officially subordinate to such authority as the 3[Federal\nGovernment] may direct.\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch.\n2\nOmitted by the Federal Laws (Revision and Declaration) Act, 1951 (XXVI of 1951), s. 3 and 2nd Sch.\n3\nSubs. by Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. 2 and Table.\n4\nSubs, by Adaptation Order, 1937."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers of Inspector. Subject to any rules made in this behalf under section 6, an Inspector",
      "content": "may, within the local limits for which he is appointed,—\n(a)        enter, with such assistants (if any) as he thinks fit, any premises or ship where\nthe processes are carried on ;\n(b)        make such examination of the premises or ship and the machinery and gear,\nfixed or loose, used for the processes, and of any prescribed registers and\nnotices, and take on the spot or otherwise such evidence of any person as he\nmay deem necessary for carrying out the purposes of this Act ; and\n(c)        exercise any other powers which may be conferred upon him by the\nregulations made under section 5."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power to Federal Government to make regulations",
      "content": "(1) The 1[Federal Government]\nmay make regulations—\n(a)        providing for the safety of working places on shore and of any regular\napproaches over a dock, wharf, quay or similar premises which workers have\nto use for going to or from a working place at which the processes are carried\non, and for the lighting and fencing of such places and approaches ;\n(b)        prescribing the nature of the means of access which shall be provided for the\nuse of workers proceeding to or from a ship which is lying alongside a quay,\nhulk or other vessel;\n(c)        prescribing the measures to be taken to ensure the safe transport of workers\nproceeding to or from a ship by water and the conditions to be complied with\nby the vessels used for the purpose ;\n(d)        prescribing the nature of the means of access to be provided for the use of the\nworkers from the deck of a ship to a hold in which the processes are carried\non;\n(e)        prescribing the measures to be taken to protect hatchways accessible to the\nworkers and other openings in a deck which might be dangerous to them ;\n(f)        providing for the efficient lighting of the means of access to ships on which\nthe processes are carried on and of all places on board at which the workers\nare employed or to which they may be required to proceed ;\n(g)        providing for the safety of the workers engaged in removing or replacing hatch\ncoverings and beams used for hatch coverings ;\n(h)        prescribing the measures to be taken to ensure that no hoisting machine, or\ngear, whether fixed or loose, used in connection therewith, is employed in the\nprocesses on shore or on board ship unless it is in a safe working condition ;\n(i)        providing for the fencing of machinery, live electric conductors and steam\npipes ;\n1\nSubs. by Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art.2 and Table.\n(j)   regulating the provision of safety appliances on derricks, cranes and winches ;\n(k)   prescribing the precautions to be observed in regard to exhaust and live steam;\n(l)   requiring the employment of competent and reliable persons to operate lifting\nor transporting machinery used in the processes, or to give signals to a driver\nof such machinery, or to attend to cargo falls on winch ends or winch drums,\nand providing for the employment of a signaller where this is necessary for the\nsafety of the workers;\n(m)   prescribing the measures to be taken in order to prevent dangerous methods of\nworking in the stacking, unstacking, stowing and unstowing of cargo, or\nhandling in connection therewith ;\n(n)   prescribing the precautions to be taken to facilitate the escape of the workers\nwhen employed in a hold or between decks in dealing with coal or other bulk\ncargo ;\n(o)   prescribing the precautions to be observed in the use of stages and trucks ;\n(p)   prescribing the precautions to be observed when the workers have to work\nwhere dangerous or noxious goods are, or have been, stowed or have to deal\nwith or work in proximity to such goods ;\n(q)   providing for the rendering of first-aid to injured workers and removal to the\nnearest place of treatment ;\n(r)   prescribing the provision to be made for the rescue of immersed workers from\ndrowning ;\n(s)   prescribing the abstracts of this Act and of the regulations required by section\n8;\n(t)   providing for the submission of notices of accidents and dangerous\noccurrences and prescribing the forms of such notices, the persons and\nauthorities to whom they are to be furnished, the particulars to be contained in\nthem and the time within which they are to be submitted ;\n(u)   specifying the persons and authorities who shall be responsible for compliance\nwith regulations made under this Act ;\n(v)   defining the circumstances in which and conditions subject to which\nexemptions from any of the regulations made under this section may be given,\nspecifying the authorities who may grant such exemptions and regulating their\nprocedure ;\n(w)   defining the additional powers which Inspectors may exercise under clause (c)\nof section 4 ; and\n(x)   providing generally for the safety of workers.\n(2) Regulations made under this section may make special provision to meet the special\nrequirements of any particular port or ports.\n(3) In making a regulation under this section, the 1[Federal Government] may direct that a\nbreach of it shall be punishable with fine which may extend to five hundred rupees, and when the\nbreach is a continuing breach, with a further fine which may extend to twenty rupees for every day\nafter the first during which the breach continues."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to Federal Government to make rules. 2[* * *], the 1[Federal Government] may",
      "content": "make rules regulating—\n(a)        the inspection of premises or ships where the processes are carried on ; and\n(b)        the manner in which Inspectors are to exercise the powers conferred on them\nby this Act."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. General provisions relating to regulations and rules",
      "content": "(1) The power to make\nregulations and rules conferred by sections 5 and 6 is subject to the condition of the regulations and\nrules being made after previous publication.\n(2) Regulations and rules shall be published in 2[the official Gazette]."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Abstracts of Acts and regulations to be conspicuously posted. There shall be affixed in",
      "content": "some conspicuous place near the main entrance of every dock, wharf, quay or similar premises\nwhere the processes are carried on, in English and in the language of the majority of the workers, the\nabstracts of this Act and of the regulations made thereunder which may be prescribed by the\nregulations."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Penalties. Any person who",
      "content": "(a)        wilfully obstructs an Inspector in the exercise of any power under section 4, or\nfails to produce on demand by an Inspector any registers or other documents\nkept in pursuance of the regulations made under this Act, or any gear, fixed or\nloose, used for the processes, or conceals or prevents or attempts to prevent\nany person from appearing before, or being examined by, an Inspector, or\n(b)        unless duly authorised, or in case of necessity, removes any fencing, gangway,\ngear, ladder, life-saving means or appliance, light, mark, stage or other thing\nrequired to be provided by or under the regulations made under this Act, or\n(c)        having in case of necessity removed any such fencing, gangway, gear, ladder,\nlife-saving means or appliance, light, mark, stage or other thing, omits to\nrestore it at the end of the period for which its removal was necessary,\nShall be punishable with fine which may extend to five hundred rupees.\n1\nSubs, by Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. 2 and Table.\n2\nRep. and subs. by Adaptation Order, 1937."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Provisions relating to jurisdiction",
      "content": "(1) No Court inferior to that of 1[* * *] a\nMagistrate of the first class shall try any offence under this Act or the regulations made thereunder.\n(2) No prosecution for any offence under this Act or the regulations made thereunder shall be\ninstituted except by or with the previous sanction of an Inspector.\n(3) No Court shall take cognizance of any offence under this Act or the regulations made\nthereunder, unless complaint thereof is made within six months of the date on which the offence is\nalleged to have been committed."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Power to exempt. The 2[Federal Government] may, by notification in the 3[official",
      "content": "Gazette], exempt from all or any of the provisions of this Act and of the regulations made\nthereunder, on such conditions, if any, as 3[it] thinks fit,-\n(a)        any port or place, dock, wharf, quay or similar premises at which the processes\nare only occasionally carried on or the traffic is small and confined to small\nships, or\n(b)        any specified ship or class of ship."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Protection to persons acting under this Act. No suit, prosecution or other legal",
      "content": "proceeding shall lie against any person for anything which is in good faith done or intended to be\ndone under this Act.\n___________\n61559                                                                                                   Date: 08-01-2025\n1\nOmitted by Adaptation Order, 1949.\n2\nSubs. by Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art 2 and Table.\n3\nSubs. by Adaptation Order, 1937."
    }
  ],
  "definitions": [
    {
      "term": "the processes",
      "definition": "all work which is required for or is incidental to the loading or unloading of cargo or fuel into or from a ship and is done on board the ship or alongside it ; and",
      "source_provision": "sec2"
    },
    {
      "term": "worker",
      "definition": "any person employed in the processes.",
      "source_provision": "sec2"
    }
  ]
}
