{
  "id": "pk-dock-workers-regulation-of-employment-act-1974",
  "type": "statute",
  "title": "Dock Workers (Regulation of Employment) Act, 1974",
  "title_en": "Dock Workers (Regulation of Employment) Act, 1974",
  "short_name": "DWOEA",
  "status": "in_force",
  "issued_date": "1974-02-28",
  "in_force_date": "1974-02-28",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2Ro-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Dock Workers (Regulation of Employment) Act, 1974 (IX of 1974) published by The Pakistan Code (Labour Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Act may be called the Dock Workers\n(Regulation of Employment) Act, 1974.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.___In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(a)       “cargo” means goods and merchandise carried or to be carried on a ship or other\nvessel;\n(b)       “dock worker” means a person employed or to be employed in any port on\nloading or unloading of ships or other vessels or on work in connection\ntherewith;\n(c)       “employer” in relation to a dock worker, means the person by whom a dock\nworker is employed or is to be employed; and\n(d)       “scheme” means a scheme made under this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Power to make scheme",
      "content": "_(1) The Federal Government may, by notification in the official\nGazette, make a scheme for the registration of dock workers with a view to ensuring greater regularity\nof employment and for efficient and economic turn-round of ships and vessels.\n(2) In particular and without prejudice to the generality of the foregoing power, such scheme\nmay provide for—\n(a)       the application of the scheme to such classes of dock workers and employers as\nmay be specified therein;\n(b)    defining the obligations of dock workers and employers subject to the fulfilment\nof which the scheme may apply to them and the circumstances in which the\nscheme shall cease to apply to any dock workers or employers;\n(c)     regulating the recruitment and entry of dock workers into the scheme and their\nregistration including the preparation and maintenance of registers, the removal,\neither temporarily or permanently, of names from the register and the imposition\nof fees for registration;\n(d)     regulating the employment and conduct of dock workers and the terms and\nconditions of such employment, including rates of remuneration, hours of work\nand conditions as to holidays and pay in respect thereof and safeguarding the\nrights, privileges and interests of dock workers under the scheme;\n(e)     securing that, in respect of periods during which employment or full\nemployment is not available for dock workers to whom the scheme applies and\nwho are available for work, such workers will, subject to the conditions of the\nscheme, receive a minimum pay;\n(f)     managing the property and funds created for the benefit of dock workers;\n(g)     prohibiting, restricting or otherwise controlling the employment of dock\nworkers to whom the scheme does not apply;\n(h)     the training and welfare of dock workers in so far as satisfactory provision\nthereof does not exist apart from the scheme;\n(i)     health and safety measures in places where dock workers are employed in so far\nas satisfactory provision therefor does not exist apart from the scheme;\n(j)     the manner in which, and the person by whom, the cost of operating the scheme\nis to be defrayed;\n(k)     constituting, whether as a body corporate or otherwise, the authority to be\nresponsible for the administration of the scheme; and\n(l)     such incidental and supplementary matters as may be necessary or expedient for\nthe purpose of the scheme.\n(3) A scheme shall apply to such port or group of ports as the Federal Government may, by\nnotification in the official Gazette, specify in this behalf.\n(4) A scheme may further provide that a contravention of any provision thereof shall be\npunishable with imprisonment for such term as may be specified but in no case exceeding six months\nin respect of a first contravention or one year in respect of any subsequent contravention, or with fine\nwhich may extend to such amount as may be specified but in no case exceeding two thousand five\nhundred rupees in respect of a first contravention or five thousand rupees in respect of any subsequent\ncontravention, or with both imprisonment and fine as aforesaid."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Funds to be handed over to Federal Government, etc",
      "content": "_(1) Notwithstanding anything to\nthe contrary contained in any other law or in any memorandum of settlement or award, all funds created\nfor the benefit of the dock workers in any manner whatsoever and under the control or management of\nany person, board or organisation or committee shall, immediately on the commencement of this Act,\nbe transferred, alongwith all records and accounts, to the Federal Government or to such other body\nas the Federal Government may, by notification in the official Gazette, specify in this behalf.\n(2) The person or persons in control or management of any such fund shall not, after the\ncommencement of this Act, spend any amount of such fund and shall be personally liable to make good\nany amount so spent.\n(3) Whoever contravenes the provisions of sub-section (1) or sub-section (2) shall, without\nprejudice to any action that may be taken against him under this Act, be punishable with imprisonment\nfor a term which may extend to two years, or with fine which may extend to five thousand rupees, or\nwith both."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Recovery of money due",
      "content": "_Any money due from any person, board, organisation or\ncommittee under sub-section (1) or sub-section (2) of section 5 shall be recoverable as an arrear of\nland revenue on the request of the body nominated by the Federal Government under the said sub-\nsection (1)."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Cognizance of offences",
      "content": "_(1) No court shall take cognizance of any offence punishable\nunder this Act or of any abetment thereof except on a report in writing of the facts constituting such\noffence or abetment made by an Inspector or a person specially authorised in this behalf by the Federal\nGovernment.\n(2) Notwithstanding anything contained in the Code of Criminal Procedure, 1898 (Act V of\n1898), an offence punishable under this Act or an abetment thereof shall be triable only by a Magistrate\nof the first class."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Act to over",
      "content": "ride other laws.___The provisions of this Act and any scheme prepared\nthereunder shall have effect notwithstanding anything to the contrary contained in any other law for\nthe time being in force."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Repeal",
      "content": "_The Dock Workers (Regulation of Employment) Ordinance, 1973 (XXVIII of\n1973), is hereby repealed.\n_____________________\nRGN Date: 29-05-2024\n1\nOmitted by the Federal Laws (Revision and Declaration) Ordinance No. XXVII of 1981, s.3 and Sch. II."
    }
  ],
  "definitions": [
    {
      "term": "cargo",
      "definition": "goods and merchandise carried or to be carried on a ship or other vessel;",
      "source_provision": "sec2"
    },
    {
      "term": "dock worker",
      "definition": "a person employed or to be employed in any port on loading or unloading of ships or other vessels or on work in connection therewith;",
      "source_provision": "sec2"
    },
    {
      "term": "scheme",
      "definition": "a scheme made under this Act.",
      "source_provision": "sec2"
    }
  ]
}
