{
  "id": "pk-drug-regulatory-authority-act-2012",
  "type": "statute",
  "title": "Drug Regulatory Authority Act, 2012",
  "title_en": "Drug Regulatory Authority Act, 2012",
  "short_name": "DRAA",
  "status": "in_force",
  "issued_date": "2012-11-12",
  "in_force_date": "2012-11-12",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Fqapo%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Drug Regulatory Authority Act, 2012 (XXI of 2012) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.",
      "content": "_ (1) This Act may be called the Drug\nRegulatory Authority of Pakistan Act, 2012.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. ⸻In this Act, unless there is anything repugnant in the subject or context,",
      "content": "_\n(i)     “Act” means the Drugs Act, 1976 (XXXI of 1976);\n(ii)    “Alternative Medicine” means a product used exclusively in\nHomeopathic, Unani, Ayurvedic, Biochemic, Chinese or other\ntraditional system of treatment;\n(iii)   “Appellate Board” means an Appellate Board constituted under\nSection 12 for the disposal of appeals against the decisions of the\nLicensing Board or the Registration Board or Pricing Committee;\n(iv)    “Authority” means the Drugs Regulatory Authority of Pakistan\nestablished under Section 3;\n(v)     “Biologicals” means biological drugs as defined in Schedule-I;\n(vi)     “Board” means the Policy Board of the Authority constituted under\nSection 9;\n(vii)    “CEO” means the Chief Executive Officer of the Authority appointed\nunder Section 5;\n(viii)   “Chairperson” means the Chairperson of the Board;\n(ix)     “civil servant” means a civil servant as defined in the Civil Servants\nAct, 1973 (LXXI of 1973);\n(x)      “decision” includes an order, determination or direction of the\nAuthority or the Board made in accordance with laws, rules and\nregulations;\n(xi)     “Director” means director of a department of the Authority;\n(xii)    “drug” means drug as defined in Schedule-I;\n(xiii) “fee” means fee prescribed by the Board for any service;\n(xiv)    “Fund” means the Drug Regulatory Authority of Pakistan Fund created\nunder Section 19;\n(xv)      “health and OTC Products (non-drugs)” include probiotics and\ndisinfectant, nutritional products, food supplements, baby milk and\nfoods, medicated cosmetics, medicated soaps and medicated\nshampoos;\n(xvi)     “Inspector” means the Inspector appointed under the Act as specified\nin Schedule-V;\n(xvii) “Licensing Board” means a Licensing Board constituted under Section\n7 sub-section (u) of this Act to regulate the grant of licenses for the\nmanufacture of therapeutic goods;\n(xviii) “Medical Device” means medical devices as specified in Schedule-I;\n(xix)    “Medicated Cosmetics” means cosmetics containing drugs as specified\nin Schedule-1;\n(xx)     “Member” means a member of the Board;\n(xxi)    “OTC” mean over-the-counter non-prescription products;\n(xxii)   “penalty” means penalty as specified in Schedule III;\n(xxiii) “person” means any individual or any legal entity;\n(xxiv) “Pension Endowment Fund” means an endowment fund separate from\nthe Fund of the Authority dedicated only for the payment of pension\nbenefits of Authority's employees;\n(xxv) “pharmaceutical field” means regulation, manufacturing, quality\ncontrol, quality assurance, research, academia, import, export, and\npharmacy services in drugs;\n(xxvi) “pharmacy services” means services rendered by a pharmacist in\npharmaceutical care, selection, posology, counseling, dispensing, use,\nadministration, prescription monitoring, pharmacoepidemiology,\ntherapeutic goods information and poison control, pharmacovigillance,\npharmacoeconomics, storage, sales, procurement, forecasting, supply\nchain management, distribution, drug utilization evaluation, drug\nutilization review, formulary based drug utilization and managing\ntherapeutic goods at all levels including pharmacy, clinic, medical\nstore, hospital or medical institution;\n(xxvii) “pharmaceutical evaluation” means the assessment of a detailed\npharmaceutical dossier submitted for the registration of a therapeutic\ngood;\n(xxviii) “pharmaceutical dossier” means a set of documents, as specified in\nSchedule-I;\n(xxix) “prescribed” means prescribed by rules or regulations under this Act;\n(xxx)   “Prohibitions” means Prohibitions as specified in Schedule-II;\n(xxxi) “regulation” means the regulations made under this Act;\n(xxxii) “Registration Board” means a Registration Board constituted under\nSection 7 sub-section (u) of this Act to regulate the grant of registration\nto therapeutic goods;\n(xxxiii) “rules” means the rules made under this Act;\n(xxxiv) “Secretary” means Secretary of the Board;\n(xxxv) “Schedule” means Schedule to this Act; and\n(xxxvi) “Therapeutic goods” includes drugs or alternative medicine or medical\ndevices or biologicals or other related products as may be notified by\nthe Authority."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Authority.",
      "content": "_ (1) As soon as may be, after the commencement of\nthis Act, the Federal Government shall, by notification in the official Gazette, establish an Authority\nto be known as the Drug Regulatory Authority of Pakistan, to carry out the purposes of this Act.\n(2) The Authority shall be a body corporate having perpetual succession and a common seal,\nand may sue and be sued in its own name and, subject to and for the purposes of this Act, may enter\ninto contracts and may acquire, purchase, take, hold and enjoy moveable and immovable property of\nevery description and may convey, assign, surrender, yield up, charge, mortgage, demise, reassign,\ntransfer or otherwise dispose of or deal with, any moveable or immovable property or any interest\nvested in it.\n(3) The Authority shall be an autonomous body under the administrative control of the\nFederal Government with its headquarters at Islamabad.\n(4) The Authority may set up its establishments including sub-offices and laboratories at\nprovincial capitals and such other places, as it may deem necessary from time to time. The existing\nFederal Drugs Control Administration and the sub-offices set up in all provinces and laboratories\ncalled the Central Drugs Laboratory, Karachi; the National Control Laboratory for Biologicals,\nIslamabad; and the Federal Drug Surveillance Laboratory, Islamabad shall, upon the commencement\nof this Act, become part of the Authority.\n(5) The common seal of the Authority shall be kept in the custody of the Chief Executive\nOfficer or such other person as may be prescribed by regulations and documents required or\npermitted to be executed under the common seal shall be specified and authenticated in such manner\nas may be prescribed by regulations."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Composition of the Authority.",
      "content": "_ (1) The Authority shall consist of a full time Chief\nExecutive Officer (CEO) and thirteen Directors who shall be appointed by the Federal Government\non the recommendation of Board, whose qualifications, terms and conditions shall be such as may be\nprescribed. The Directors shall be designated as: ⸻\n(a)    Director Pharmaceutical Evaluations and Registration.⸻He shall be incharge\nof the Division of Pharmaceutical Evaluations and Registration which shall be\nresponsible for the evaluation, assessment and registration of Pharmaceuticals\ndrugs for human beings, animals and to perform other functions connected\ntherewith and assigned by the Board;\n(b)    Director Drug Licensing.⸻He shall be the incharge of the Division of Drug\nLicensing which shall be responsible for the licensing of the drugs\nmanufacturing facilities and to perform other functions connected therewith;\n(c)    Director Quality Assurance and Laboratory testing.⸻He shall be incharge of\nthe Division of Quality Assurance and Laboratory testing which shall be\nresponsible for enforcement of current Good Manufacturing Practices under\nthe Act, and for testing or research of drugs and to perform other functions\nconnected therewith. The Division will also perform the functions related to\npost marketing surveillance and shall be responsible for the evaluation, co-\nordination and monitoring of safety, efficacy and quality of registered drugs\nand inactive materials including the clinical and toxicological study, drug\nrecalls and with drawls, and to perform other functions connected therewith;\n(d)   Director Medical Devices and Medicated Cosmetics.⸻He shall be incharge of\nthe Division of Medical Devices and Medicated Cosmetics which shall be\nresponsible for the assessment, enlistment or registration of medical devices\nand medicated cosmetics, medicated shampoos and medicated soaps for\nhuman beings, animals and to perform other functions connected therewith;\n(e)   Director Biological Drugs.⸻He shall be incharge of the Division of\nBiological Evaluation and Research which shall be responsible for the\nevaluation, assessment, registration and licensing of Biologicals for human\nbeings, animals and to perform other functions connected therewith including\nall the functions of national control authority for biologicals as required for the\nprequalification by World Health Organizations of locally manufactured\nhuman biological drugs;\n(f)   Director Controlled Drugs.⸻ He shall be incharge of the Division of\nControlled Drugs which shall in consultation with the Federal Government be\nresponsible for regulation and allocation of quota of narcotic drugs,\npsychotropic substances and precursor chemicals and to perform other\nfunctions connected therewith;\n(g)   Director Pharmacy Services.⸻ He shall be incharge of the Division of\nPharmacy Services which shall be responsible for the development and\npromotion of pharmacy services and to perform other functions connected\ntherewith;\n(h)   Director Health and OTC Products (non-drugs).⸻ He shall be incharge of the\nDivision of Health and OTC Products (non-drugs) which shall be responsible\nfor the assessment, licensing and registration of Alternative Medicines such as\nAyurvedic, Chinese, Unani and Homeopathy, enlistment or registration of\nnutritional products and food supplements for human beings, animals and to\nperform other functions connected therewith;\n(i)   Director Costing and Pricing.⸻He shall be incharge of the Division of\nCosting and Pricing which shall be responsible for the costing and pricing of\ntherapeutic goods and to perform other functions connected therewith;\n(j)    Director Budget and Accounts.⸻He shall be incharge of the Division for\nBudget and Accounts which shall be responsible for budgetary and financial\naspects of the Authority and other daily accounting matters connected\ntherewith or ancillary thereto;\n(k)   Director Administration, Human Resource and Logistics.⸻He shall be\nincharge of the Division for Administration, Human Resource and Logistics\nwhich shall be responsible for administration, recruitment, appointment,\ncapacity building and development for the Authority and other matters\nconnected therewith and ancillary there to;\n(l)     Director Legal Affairs.⸻He shall be incharge of the Division for Legal\nAffairs which shall be responsible for legal aspects of the Authority and other\nmatters connected with Drug Court and other Court cases therewith or\nancillary thereto; and\n(m)     Director Management Information Services.⸻He shall be in charge of the\nDivision for Management Information Services which shall be responsible for\ndevelopment of automation of functions using information technology for the\nAuthority and other matters connected therewith and ancillary there to;\n(2) The Federal Government, on the recommendations of the Board may increase or decrease\nthe number of Divisions or Director and prescribe their functions and the relevant experience,\nqualification, terms, mode and manner of appointment of Directors and related staff in each Division."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Chief Executive Officer",
      "content": "_ (1) The Federal Government may, on the recommendations of\nthe Board appoint a person as Chief Executive Officer who, ⸻\n(a)      has a post graduate degree in Pharmacy or medicine with an age not less than\n45 years or more than 56 years, with a minimum of twenty years experience in\nmanagement or pharmaceutical field or regulatory affairs, in public sector, or\nif no such person of aforesaid qualifications is available in the public sector,\nthen a person possessing above qualifications and experience from the private\nsector;\n(b)     the tenure of appointment of CEO shall be for a period of three years,\nextendable on the recommendation of the Board for one year only; and\n(c)     the CEO shall exercise general Control and supervision over the affairs of the\nAuthority and shall ensure the provisions of the Act, the rules, and that the\nregulations, policies and directions of the Board are properly executed;\n(2) The CEO shall discharge such duties and perform such functions as are assigned to him\nby or under this Act or as may be prescribed by the Board and in particular shall,—\n(a)     keep in custody the records and seal of the Authority;\n(b)     submit plan of work and budget estimates of the Authority for approval of the\nBoard; and\n(c)     submit to the Board, in accordance with the rules and regulations reports on\nthe activities of the Authority.\n(3) The CEO shall also have the power to, —\n(a)    supervise the activities connected with the execution of programs for training,\nresearch, institutional consultancies, and other services;\n(b)    authorize expenditure provided for in the budget in accordance with the rules\nand regulations;\n(c)    re-appropriate funds within the approved budget;\n(d)     delegate his powers to appropriate levels of management subject to such\nconditions as he may deem fit;\n(e)    issue notices of meetings of the Board and Appellate Board and to maintain\nproper record of the minutes and proceedings thereof;\n(f)     execute deeds and documents on behalf of the Board; and\n(g)     perform any other duty assigned to him by the Board.\n(4) The CEO shall not, except with the prior approval of the Board in each case or unless\nalready approved in the budget duly itemized, allow expenditure on items of civil works, or capital\nexpenditure on office or laboratory equipment or automobiles,\n(5) The CEO may tender his resignation under his own hand.\n(6) In case of occurrence of vacancy of CEO the Federal Government is authorised to\nappoint any person having prescribed qualification as CEO for a period of three months or till the\nappointment of CEO, whichever is earlier."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Meeting of the Authority.",
      "content": "_ (1) Save as hereinafter provided, the Authority shall regulate\nthe procedure for its meetings.\n(2) The meetings of the Authority shall be convened by the CEO at any time on his own or\nas directed by the Policy Board on any matter requiring decision by the Authority."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Powers and functions of the Authority.",
      "content": "_The powers and functions of the Authority\nshall be to, —\n(a)    administer the laws specified in the Schedule-VI that apply to Federal\nGovernment, and advise the Provincial Governments for the laws that are\napplicable to the Provinces;\n(b)    monitor the enforcement of laws specified in the Schedule-VI and collect\nrelevant data and information;\n(c)    issue guidelines and monitor the enforcement of, —\n(i)    licensing of the manufacture of therapeutic goods;\n(ii)   registration of therapeutic goods;\n(iii)   regulation for the advertisement;\n(iv)    drug specifications and laboratory practices;\n(v)      prosecution and appeals under this Act and the Drugs Act, 1976\n(XXXI of 1976) relating to Federal subject;\n(vi)     regulation and allocation of quota of narcotic drugs, psychotropic\nsubstances and precursor substances (chemicals) in consultation with\nFederal Government;\n(vii)    regulation for pricing and mechanism for fixation of prices of various\ntherapeutic goods under its ambit;\n(viii) determining standards for biological manufacturing and testing;\n(ix)    implementation of internationally recognized standards such as good\nlaboratory practices, current good manufacturing practices, good\ndistribution practices, cold chain management, bioequivalence studies,\nstability studies, anti-spurious codes, clinical trials, biosimilar\nevaluations, and endorsement and systematic implementation of World\nHealth Organization, International Conference on Harmonizations and\nFood and Drug Administration guidelines etc.;\n(x)      regulation, enforcement and monitoring of advertisement rule and ban\non false advertisement;\n(xi)    manufacturing of active pharmaceutical ingredients in all its forms;\nand\n(xii)   use of central research fund.\n(d)   co-ordinate, monitor or engage, in conjunction with other organizations,\nProvincial Governments and international agencies, in training, study or\nproject related to therapeutic goods. The Authority may engage any individual\nor counsel to advise or work for managing national and international\nopportunities for training, education, seminars, conferences etc., with a view\nto improve capacity building;\n(e)   facilitate advancement and up gradation of the sector to meet international\nstandards and also to promote manufacture and export of active\npharmaceutical ingredients and therapeutic goods;\n(f)   coordinate at policy level and provide policy guidance to the Provincial\nGovernment in the performance of their functions with a purpose to bring\nuniformity;\n(g)   facilitate the procurement and implementation of foreign aided technical\nassistance on therapeutic goods where such expertise does not exist but its\nexistence would promote public good;\n(h)   take steps for development and promotion of pharmacy services;\n(i)    undertake awareness campaigns regarding prevention of diseases, patients'\nrights, healthcare privileges etc., through media, seminars, publications, and\nother available means of information technology;\n(j)    issue guidelines and monitor proceedings and funding and accounts of health\nseminars, workshops and conferences;\n(k)    advise the Federal Government on issues related to obligations and\ncommitments related to therapeutic goods;\n(l)   appoint such employees, consultants and experts as deemed necessary on\nprescribed terms and conditions including their salaries and remunerations\nwith consultation and approval of the Board. Such recruitment, continuation\nand remuneration shall be based on merit and productivity;\n(m)    prescribe rules for seniority, promotion, code of conduct and terms and\ncondition of service of its employees;\n(n)    levy such charges or fees as may be prescribed for services and facilities\nprovided by the Authority and its offices;\n(o)   enter into contract for the supply of materials or for the execution of works as\nmay be necessary for the discharge of any of its duties and functions;\n(p)   prepare annual budget to be approved by the Board;\n(q)    to monitor and regulate the marketing practices, so as to ensure rational use of\ndrugs, and ethical criteria for promotion of therapeutic goods in line with\ninternational practices;\n(r)    develop working manuals, guidelines, references, materials and procedures in\norder to improve the working environment of offices etc., set up under the\nAuthority;\n(s)   prescribe, regulate or implement measures and standards on matters related or\nconnected with the Authority;\n(t)    develop, issue, adopt, and enforce the standards and guidelines to ensure\nsafety, efficacy, and quality of therapeutic goods with rational use at\nreasonable price;\n(u)   perform licensing, registration, pricing and appellate function thereof;\n(v)     coordinate with Provincial Governments and International agencies for\nsmooth implementation of laws, capacity building and training of the\nregulatory staff;\n(w)    develop standard operating procedures, manuals, guidelines for transparent\nworking of offices and conduct quality audits for conformance of the same;\n(x)    establish system of cost recovery to ensure financial autonomy and efficient\nfunctioning of the authority without becoming burden on the Government; and\n(y)    perform and carry out any other act, duty or function as may be assigned to it\nby the Policy Board and the Federal Government for furthering the provisions\nof this Act."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Delegation of powers.",
      "content": "_ The Authority may with the approval of the Board, by general or\nspecial order in writing subject to such conditions or limitations, delegate any of its powers and\nfunctions to any of its officers as it may deem appropriate."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Policy Board",
      "content": "__ (1) The general direction, administration and monitoring of the Authority\nshall vest in the Policy Board which shall consist of fifteen members, namely:⸻\n(a)  Secretary of the concerned Division (Federal Secretary BS-             Chair\n22)                                                                   person\n(b) CEO                                                                    Member\n(c)   Representative of Ministry of Law and Justice not below              Member\nBPS-20\n(d) Secretary of the concerned Department, Government of the               Member\nBalochistan\n(e) Secretary of the concerned Department, Government of the               Member\nSindh\n(f) Secretary of the concerned Department, Government of the               Member\nKhybcr Pakhtunkhwa\n(g) Secretary of the concerned Department, Government of the               Member\nPunjab\n(h) Secretary of the concerned Department, Government of the               Member\nGilgil-Bultistan\n(i) Representative from Federally Administered Tribal Area                 Member\n(j) Six experts from the public and private sector with equal              Member\nrepresentation from each Province, these members shall be\nfrom different specialties as defined in sub-section (3)\nbelow.\n(2) The CEO shall also be the Secretary of the Board. The Board shall look after and be\nresponsible for the affairs of the Authority.\n(3) The Federal Government shall, by notification in the official Gazette, appoint six expert\nmembers, with representation from the Provinces, under Clause (j) of sub-section (1) preferably one\nfrom each province having specialty in the fields of drug manufacturing, quality control, drug\nregulation, public health, pharmacy services, health finance, health economics, health management,\npharmacology, or biotechnology:\nProvided that unless earlier removed by the Federal Government the term of the expert\nmember shall be two years and shall be eligible for one more similar term only. The expert member\nmay resign his office by writing under his hand addressed to the Federal Government:\nProvided further that the expert member shall himself attend the meeting and shall not send a\nrepresentative;\n(4) No act or proceeding of the Board shall be invalid by reason only if the existence of a\nvacancy in the constitution of the Board.\n(5) Notwithstanding the composition of the Board constituted by the Federal Government\nunder sub-section (1), the Board may increase or decrease the number of its members and prescribe\nthe qualifications and procedure for their appointment."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Meeting of the Policy Board.",
      "content": "__ (1) The meetings of the Board shall be convened by the\nSecretary of the Board with the prior approval of the Chairperson. In case of absence of the\nChairperson, the members present may elect the Chairperson for that meeting.\n(2) The meetings of the Board shall be held at twice a year or more as and when required. A\nspecial meeting may also be called at any time to deal with any urgent business.\n(3) Save as hereinafter provided, the Board shall make regulations for the conduct of its\nbusiness.\n(4) A simple majority of the total membership shall constitute the quorum for a meeting of\nthe Board and in case of equality of votes, the Chairperson or the person presiding over the meeting\nshall have a casting vote.\n(5) All decisions or determinations taken by the Board shall be recorded in writing.\n(6) The Board meeting shall be called by giving an advance notice of at least seven days."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Functions of the Board.",
      "content": "_ (1) The Board shall have the following functions, namely: ___\n(a)     frame the policy and provide guidelines based on global and regional trends to\nthe Authority and monitor the implementation and performance of the\nguidelines and of the functions of the Authority ensuring good governance and\naccountability;\n(b)     monitor and supervise all the functions of the Authority;\n(c)     approve the Budget of the Authority; and\n(d)     determine all fees and levies."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Appellate Board and Committees of the Policy Board.",
      "content": "_ (1) The Board may constitute\nAppellate Board and Committees of experts as it considers necessary or expedient to assist it in the\nperformance of its functions under this Act.\n(2) A Board and Committee constituted under sub-section (1) shall act in accordance with the\nregulations made by the Board."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Invitation by Board.",
      "content": "_ The Board may invite any person to attend its meeting or\ndeliberations including any meeting of the Appellate Board or its Committees constituted under\nSection 12, for the purpose of advising it on any matter under discussion but such person shall have\nno right to vote at the meeting or deliberation."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Appointment of officers and employees etc., of the Authority.",
      "content": "_(1) The Authority,\nwith approval of the Board, may create posts and appoint such officers, employees, experts and\nconsultants, as it may consider necessary, for the performance of its functions in the prescribed\nmanner. The criteria for recruitment and selection of employees and officers will be determined by\nthe Board according to the rules as prescribed.\n(2) The age of superannuation for each employee shall be sixty years.\n(3) No person shall be appointed as the CEO or Director of the Authority unless he is a\ncitizen of Pakistan."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Integration of Federal Drugs Control Administration its sub",
      "content": "offices and\nLaboratories. ___ (1) Upon the commencement of this Act the Drugs Control Administration, its sub-\noffices and its Laboratories hereinafter referred to as the said offices as referred in sub-section (4) of\nSection 3 shall become part of the Authority.\n(2) All assets, rights, powers, authorities and privileges and all properties, movable and\nimmovable, cash and bank balance, reserve funds, investment and all other interest rights in, or\narising out of such properties and all debts, liabilities and obligation of whatever kind of the said\noffices subsisting immediately before there integration shall stand transferred to and vest in the\nAuthority.\n(3) All debts and obligation incurred or contracts entered into or rights acquired and all\nmatters and things engaged to be done by, with or for the said offices before their integration, shall\nbe deemed to have been incurred, entered into, acquired or engaged to be done by for the Authority.\n(4) All suits and other legal proceedings instituted by or against the said offices before their\nintegration shall be deemed to be suits and proceedings by or against the Authority and may be\nproceeded or otherwise dealt with accordingly.\n(5) Notwithstanding anything contained in any contract or agreement or in the conditions of\nservices, __\n(a)      every employee of the said offices under the Federal Government\nimmediately after the commencement of this Act shall be required to exercise\nan irrevocable option either to continue in the present pay and service structure\nas a civil servant or to opt for absorption in the Authority within a period of\nthirty days from the date of commencement of this Act;\n(b)      all employees who opt to be included in the Authority under its rules shall be\ngoverned by this Act and the terms and conditions so prescribed;\n(c)     no health personnel who opts to be governed under this Act shall be entitled to\nany compensation because of such transfer; and\n(d)      the terms and conditions of service of all officers and staff employed in the\nDrug Regulatory Agency of Pakistan under Ordinance I of (2012) before the\ncommencement of this Act shall not be varied to their disadvantage under the\nAuthority."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Experts, consultants and advisers not to be civil servants.",
      "content": "_ The experts, consultants,\nemployees or advisers employed by the Authority shall be governed by the terms and conditions of\ntheir appointment and shall not be deemed to be civil servant within the meaning of Civil Servants\nAct, 1973 (LXXI of 1973)."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. CEO and officers etc., to be public servants.",
      "content": "_The CEO. officers, employees, experts\nand consultant of the Authority shall, when acting or purporting to act in pursuance of any of the\nprovisions of this Act, be deemed to be public servants within the meaning of Section 21 of the\nPakistan Penal Code (Act, XLV of 1860)."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Conflict of interest.",
      "content": "_ (1) No person shall be appointed as CEO, Director, consultant,\nadvisor, officer or employee of the Authority if he or she has any financial or professional conflict of\ninterest.\n(2) No person shall be member of the Board or Director if he has immediate family members\n(parent, child, sibling or spouse) as senior officials or owners of concerns dealing in therapeutic\ngoods.\nFUND, BUDGET AND ACCOUNTS"
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Drug Regulatory Authority of Pakistan Fund",
      "content": "_(1) There shall be a fund to be known\nas the Drug Regulatory Authority of Pakistan Fund which shall vest in the Authority and shall be\nutilized by the Authority to meet us expenses and charges properly incurred in connection with the\ncarrying out of its functions and duties assigned or transferred to it under this Act, including but not\nlimited to the payment of salaries and other remuneration to the CEO, Director, members of the\ndifferent Boards, employees, experts, consultants and advisers of the Authority.\n(2) The Drug Regulatory Authority Funds shall be financed from the following sources\nnamely:⸻\n(a)     grant-in-aid in terms of salaries and retirement benefits of the existing staff to\nbe provided by the Federal Government;\n(b)    donations and endowments;\n(c)    grants and loans by the Federal Government or a Provincial Government;\n(d)    loans and grants from the national and international agencies received by the\nFederal Government and Provincial Governments to finance the function of\nthe Authority;\n(e)    charges and fees collected by the Authority to recover the costs of regulated\nactivities under this Act;\n(f)     proceeds of any investments made by the Authority which are not required for\nimmediate use. All investments to be made by the Authority shall be with the\napproval of the Board;\n(g)     proceeds from any other service rendered by the Authority, including\nInspection Services, foreign or local, or sale of any publication; and\n(h)     Central Research Fund collected from the pharmaceutical industry.\n(3) At the end of each financial year, the balance sheet shall be prepared and any un-spent\nremaining amount and all other collections including Central Research Fund shall be securely\ninvested only in Government schemes in order to achieve self-sufficiency of the Authority.\n(4) A separate pension endowment fund shall be established for the payment of pensions of\nemployees recruited in the Authority."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Fees and other charges to be levied by the Authority.",
      "content": "__ (1) The Authority shall levy\nand collect such fees, in respect of any of its functions at such rates as may be determined, from time\nto time by the Authority, with the approval of the Policy Board, in accordance with rules.\n(2) The Central Research Fund fee shall be deposited in the non-lapsable sub-account of the\nAuthority to be utilized as per existing rules.\n(3) The existing Central Research Fund kept with the Federal Government shall be\ntransferred to the Authority immediately after the notification of establishment of the Authority."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Budget.",
      "content": "_ (1) The Authority shall, in respect of each financial year prepare on such date\nas may be prescribed a statement of the estimated receipts and expenditure, including the revised and\nestimated budgets, requirements of grant-in-aid from Federal Government, and foreign exchange for\nthe next financial year for consideration and approval of the Board. Any foreign exchange\nrequirements within the overall annual approved budget by the Board shall be sent to Federal\nGovernment for appropriate provision and allocation.\n(2) It shall not be necessary for the Authority to take prior approval from the Government to\nspend money from its own generated funds, and shall practice financial freedom as the Board deem\nfit for furtherance of its functions."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Accounting and Audit.",
      "content": "_ (1) The Authority may open its accounts with any scheduled\nBank or financial institution within the framework of the prescribed rules. The Authority may\napproach the Government, for the grant of initial funds in this respect.\n(2) The accounts of the Authority shall be maintained as a double entry system and in the\nmanner prescribed by the Controller General of Accounts.\n(3) The Authority shall cause to be carried out audit of its accounts by one or more auditors\nregistered as chartered accountants within the meaning of the Chartered Accountants Act, 1961 (X of\n1961).\n(4) Notwithstanding the audit provided by in sub-section (3) the Auditor General shall have\nthe power to audit or cause to be audited the accounts of the Authority.\n(5) A copy of the audit report shall be sent to the Federal Government along with the\ncomments of the Authority.\n(6) The Authority shall take the requisite steps for the rectification of any objection raised by\nthe Auditor-General of Pakistan."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Power to make rules.",
      "content": "_ The Authority may, with the approval of the Federal\nGovernment, by notification in the official Gazette, make rules for carrying out the purposes of this\nAct."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Power to make regulations.",
      "content": "_ The Authority may, by notification in the official\nGazette, with the approval of the Board, make regulations, for its internal working and terms and\ncondition of employees not inconsistent with the provisions of the Act or the rules, for the carrying\nout of its functions under this Act."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Submission of annual reports and returns.",
      "content": "__ (1) Within three months of the\nconclusion of each financial year, the Authority shall submit an annual report to the Federal\nGovernment in respect of the activities of the Authority including the status of its existing programs,\nprojects and further plans formulated in furtherance of its aims and objectives.\n(2) The Federal Government may require the Authority to furnish: ⸻\n(a)     any return, statement, estimate, statistics or other information regarding any\nmatter under the control of the Authority;\n(b)     a report on any subject related to the Authority; and\n(c)     a copy of any document in the custody of the Authority;\n(3) The Authority shall expeditiously comply with such directions."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Power to call for information",
      "content": "_The Authority may call for any person, involved\ndirectly or indirectly, and reasonably believed to having such information in his control or possession\nwhich is required for carrying out the purposes of this Act. The person so called upon to provide\nsuch information shall do so within the period prescribed by the Authority and in case of failure to do\nso he shall be punished by imposition of such penalty which may not exceed one hundred thousand\nrupees."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Offences, penalties etc.____ (1) The offences shall be such as specified in Schedule",
      "content": "III.\n(2) The prohibition specified in Schedule-II shall be punished in accordance with Schedule-\nIII."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Offences by companies etc",
      "content": "_Where the person guilty of an offence under this Act or\npartner and employee of the company, corporation, firm or institution with whose knowledge or\nconsent the offence was committed shall be guilty of the offence."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Cognizance of offences.",
      "content": "_ Cognizance of offences shall be taken by the Inspector in the\nmanner specified in Schedule-IV."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Complaints.",
      "content": "_ (1) Any aggrieved person may file a written complaint with the Authority\nagainst contravention of any provision of this Act or any law specified in Schedule-VI.\n(2) The Authority shall, on receipt of a complaint cause it to be investigated as may be\nprescribed and provide an opportunity to the complainant as well as the person against whom such\ncomplaints has been made. The Authority may, on completion of investigation, take any action as\nmay be prescribed under this Act or as the case may be subject to the provisions of any law specified\nin the Schedule-VI.\n(3) Appeals against the decisions of the Authority shall be referred to the Board, which shall\nformulate an Appellate Board from among its members, who shall decide the case on merit."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Confidential information.",
      "content": "__ (1) Except as provided under the regulations, no person\nshall communicate, or allow to be communicated, any record or information obtained under this Act\nto a person not legally entitled to that record or information or allows any person not legally entitled\nto that record or information to have access to any record obtained under this Act.\n(2) A person who knowingly receives records or information obtained under this Act shall\nhold the record or information subject to the same restrictions under sub-section (1) as apply to the\nperson from who the records or information were received."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Act not to override other laws.",
      "content": "__ (1) The provisions of this Act shall be in addition to\nand not in derogation of the provisions made in the Drugs Act, 1976 (XXXI of 1976) and any other\nlaw for the time being in force.\n(2) In case of inconsistency between the provisions of this Act and any other law for the time\nbeing in force, the provisions of this Act shall prevail."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Recovery of arrears.",
      "content": "_ All amounts due to the Authority may be recovered as arrears of\nland revenue."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Indemnity.",
      "content": "__ No suit prosecution or other legal proceeding shall lie against any person\nfor anything which is in good faith done or intended to be done under this Act or any rules or\nregulations made there under."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Power to amend Schedule.",
      "content": "__ The Federal Government may, by notification in the\nofficial Gazette, amend the Schedule so as to add any entry thereto or modify or omit any entry\ntherefrom on the recommendation of the Board."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Removal of difficulties.",
      "content": "___If any difficulty arises in giving effect to any of the\nprovisions of this Act, the Federal Government may make such Order by notification in the Official\nGazette, not inconsistent with the provisions of this Act, for the purpose of removing the difficulty."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Employment under the Authority to be employment under the Federal",
      "content": "Government.___ Every employment under the Authority shall, for the purpose of Pakistan Essential\nServices (Maintenance) Act, 1952 (LIII of 1952), be deemed to be employment under Federal\nGovernment and the said Act shall have effect accordingly."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Act X of 2012 not to apply to the Authority.",
      "content": "__ Nothing contained in the Industrial\nRelation Act (X of 2012), shall apply to or in relation to the Authority or any of the officers and\nemployees of the Institute."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Co",
      "content": "operation with international organizations. ____ The Authority may, subject to the\nprior approval of the Federal Government, co-operate with any foreign authority or international\norganization in the field of health on the terms and conditions of any program or agreement for co-\noperation to which such authority or organization is a party, or pursuant to any other international\nagreement made or after the commencement of this Act."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Repeal and Savings.",
      "content": "__ (1) The Drug Regulatory Agency of Pakistan Ordinance, 2012\n(Ordinance I of 2012) is hereby repealed.\n(2) Notwithstanding the repeal of the Drug Regulatory Agency of Pakistan Ordinance, 2012\n(Ordinance I of 2012) by sub-section (1),⸻\n(a)    any license to manufacture or any registration or maximum retail price fixed\nfor sale issued thereunder to any person, or for the revalidation of an license or\nregistration issued earlier under the Act, for which an application has been\nmade to the Licensing Board, Registration Board, and Drug Pricing\nCommittee as the case may be within the specified time, shall continue to be\nvalid;\n(b)    any license for import or export or sale of drugs issued thereunder to any\nperson, shall, unless it expires earlier under the terms thereof, continue to be\nvalid for such periods as the Federal Government, may by notification in the\nofficial Gazette, specify in this behalf.\n(3) All such actions of the Federal Government as mentioned in sub-section (2) since 20th\nApril, 2010 shall be deemed to have validly made under this Act."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Policy Directive of Federal Government.",
      "content": "__ (1) The Federal Government may issue\npolicy directives in accordance with the law and Constitution to the Board in respect of any of its\nactivities, powers and functions and whose compliance shall be binding on the Authority, within a\nstipulated time.\n(2) Notwithstanding anything contained in sub-section (1) if there is any difficulty in\nimplementation of the directions and guidelines of the Policy Board or the Federal Government, the\nAuthority shall refer the case back to the Federal Government for its review specifying reasons for\nnon-implementation, within the stipulated time, whose decision in this respect shall be final."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Winding up of Authority.",
      "content": "__ No provision of any law relating to winding up of bodies\ncorporate shall apply to the Authority. The Authority shall only be wound up by the law to be\nenacted by the Parliament for winding up of the Authority.\n[See Section 2 (v, xii, xviii, xix, & xxviii)]"
    }
  ],
  "definitions": [
    {
      "term": "Act",
      "definition": "the Drugs Act, 1976 (XXXI of 1976);",
      "source_provision": "sec2"
    },
    {
      "term": "Alternative Medicine",
      "definition": "a product used exclusively in Homeopathic, Unani, Ayurvedic, Biochemic, Chinese or other traditional system of treatment;",
      "source_provision": "sec2"
    },
    {
      "term": "Appellate Board",
      "definition": "an Appellate Board constituted under Section 12 for the disposal of appeals against the decisions of the Licensing Board or the Registration Board or Pricing Committee;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "the Drugs Regulatory Authority of Pakistan established under Section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Biologicals",
      "definition": "biological drugs as defined in Schedule-I;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Policy Board of the Authority constituted under Section 9;",
      "source_provision": "sec2"
    },
    {
      "term": "CEO",
      "definition": "the Chief Executive Officer of the Authority appointed under Section 5; (viii) “Chairperson” means the Chairperson of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "civil servant",
      "definition": "a civil servant as defined in the Civil Servants Act, 1973 (LXXI of 1973);",
      "source_provision": "sec2"
    },
    {
      "term": "decision",
      "definition": "an order, determination or direction of the Authority or the Board made in accordance with laws, rules and regulations;",
      "source_provision": "sec2"
    },
    {
      "term": "Director",
      "definition": "director of a department of the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "drug",
      "definition": "drug as defined in Schedule-I; (xiii) “fee” means fee prescribed by the Board for any service;",
      "source_provision": "sec2"
    },
    {
      "term": "Fund",
      "definition": "the Drug Regulatory Authority of Pakistan Fund created under Section 19;",
      "source_provision": "sec2"
    },
    {
      "term": "Inspector",
      "definition": "the Inspector appointed under the Act as specified in Schedule-V; (xvii) “Licensing Board” means a Licensing Board constituted under Section 7 sub-section (u) of this Act to regulate the grant of licenses for the manufacture of therapeutic goods; (xviii) “Medical Device” means medical devices as specified in Schedule-I;",
      "source_provision": "sec2"
    },
    {
      "term": "Medicated Cosmetics",
      "definition": "cosmetics containing drugs as specified in Schedule-1;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "a member of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "pharmaceutical field",
      "definition": "regulation, manufacturing, quality control, quality assurance, research, academia, import, export, and pharmacy services in drugs; (xxvi) “pharmacy services” means services rendered by a pharmacist in pharmaceutical care, selection, posology, counseling, dispensing, use, administration, prescription monitoring, pharmacoepidemiology, therapeutic goods information and poison control, pharmacovigillance, pharmacoeconomics, storage, sales, procurement, forecasting, supply chain management, distribution, drug utilization evaluation, drug utilization review, formulary based drug utilization and managing therapeutic goods at all levels including pharmacy, clinic, medical store, hospital or medical institution; (xxvii) “pharmaceutical evaluation” means the assessment of a detailed pharmaceutical dossier submitted for the registration of a therapeutic good; (xxviii) “pharmaceutical dossier” means a set of documents, as specified in Schedule-I; (xxix) “prescribed” means prescribed by rules or regulations under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Prohibitions",
      "definition": "Prohibitions as specified in Schedule-II; (xxxi) “regulation” means the regulations made under this Act; (xxxii) “Registration Board” means a Registration Board constituted under Section 7 sub-section (u) of this Act to regulate the grant of registration to therapeutic goods; (xxxiii) “rules” means the rules made under this Act; (xxxiv) “Secretary” means Secretary of the Board; (xxxv) “Schedule” means Schedule to this Act; and (xxxvi) “Therapeutic goods” includes drugs or alternative medicine or medical devices or biologicals or other related products as may be notified by the Authority.",
      "source_provision": "sec2"
    }
  ]
}
