{
  "id": "pk-dyslexia-special-measures-act-2022",
  "type": "statute",
  "title": "Dyslexia Special Measures Act, 2022",
  "title_en": "Dyslexia Special Measures Act, 2022",
  "short_name": "DSMA",
  "status": "in_force",
  "issued_date": "2022-10-23",
  "in_force_date": "2022-10-23",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5lqaw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Dyslexia Special Measures Act, 2022 (XXIV of 2022) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Dyslexia\nSpecial Measures Act, 2022.\n(2)     It shall extend to the Islamabad Capital Territory.\n(3)     It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act unless there is anything repugnant in the subject or context, __\n(a)     “associated disorders” include but is not limited to dysgraphia, dyscalculia and\ndyspraxia, ‘dysgraphia’ refers to difficulties in the ability to write, primarily in\nterms of handwriting and content; ‘dyscalculia’ refers to difficulties in the\nability to learn class/age appropriate mathematics; ‘dyspraxia’ refers to\ndifficulties of motor coordination usually apparent in childhood;\n(b)     “child” means a child having dyslexia or, associated disorder who is below the\nage of eighteen years;\n(c)     “dyslexia” means a disorder manifested by a difficulty in learning to read, write,\nor spell, despite conventional instruction, adequate intelligence, and socio-\ncultural opportunity;\n(d)     “Government” means the Federal Government;\n(e)     “rules” means rules framed under this Act; and\n(f)     “special educator” includes teachers, trainers, resource persons trained to\naddress the general and particular learning needs of children with dyslexia or\nassociated disorders."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Right of dyslexic, etc. to education",
      "content": "(1) All children with dyslexia or associated\ndisorder have a right to education to enable the full development of their human potential, sense of\ndignity and self-worth; to develop their personality, talents and creativity, mental and physical abilities\nto their fullest potential; and to enable their effective participation in an inclusive society.\n(2)      No child with dyslexia or associated disorder shall be excluded from the education\nsystem on the basis of it, and the Government shall ensure that all persons with dyslexia or associated\ndisorder, especially girls, have access to education, without discrimination and on an equal basis with\nothers, at all levels."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Identification and screening test",
      "content": "(1) The Government shall prescribe procedure\nfor identifying children having dyslexia or associated disorder.\n(2)    It shall also ensure the dyslexia and associated disorder screening test of all the children\nat the time of their admission in schools."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Special educators",
      "content": "(1) Every school shall have a staff of special educators who have\nthe requisite qualifications and training to cater to the needs of students with dyslexia or associated\ndisorder.\n(2)    Teachers in all types of schools shall be imparted orientation and training to understand\nspecific needs of children with dyslexia or associated disorder."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Instructional services",
      "content": "(1) All schools shall provide appropriate instructional services\nand other accommodations to the children identified having dyslexia or associated disorder.\n(2)     They shall ensure that instructions to the children having dyslexia or associated disorder\nare simple, clear, and complete.\n(3)     Once a child has been identified with dyslexia or associated disorder, the child or parent\nshall be entitled to ask for specific instructions for that child’s specific needs."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Appointment of dyslexia therapists",
      "content": "(1) The Government shall appoint sufficient\nnumber of professional dyslexia therapists in every school having children identified with dyslexia or\nassociated disorder.\n(2)     It shall also ensure that training programs for such therapists are conducted on regular\nbasis and at least once in a calendar year."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Bar on disciplinary measures",
      "content": "No child shall be subjected to physical punishment\nor mental harassment or in any manner discriminated on the basis of dyslexia or associated disorder."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Handbook",
      "content": "All schools shall develop and maintain a handbook for use in the schools\nfor guidance of children, parents and teachers about dyslexia and associated disorders."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Awareness programs",
      "content": "(1) The Government shall conduct, sponsor, encourage,\nsupport or promote awareness programs to ensure that rights recognized in this Act are respected,\nprotected and promoted.\n(2)       Such programs should aim at enabling both state and civil society to recognize the\ncapabilities of children with dyslexia or associated disorders; to combat the stereotypes, prejudices and\nharmful practices which impede their active participation in the field of education."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Power to make rules",
      "content": "The Government may, by notification in the official Gazette,\nmake rules for carrying out the purposes of this Act within one hundred and twenty days.\n____________\nRGN Date: 08-01-2026"
    }
  ],
  "definitions": [
    {
      "term": "child",
      "definition": "a child having dyslexia or, associated disorder who is below the age of eighteen years;",
      "source_provision": "sec2"
    },
    {
      "term": "dyslexia",
      "definition": "a disorder manifested by a difficulty in learning to read, write, or spell, despite conventional instruction, adequate intelligence, and socio- cultural opportunity;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules framed under this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "special educator",
      "definition": "teachers, trainers, resource persons trained to address the general and particular learning needs of children with dyslexia or associated disorders.",
      "source_provision": "sec2"
    }
  ]
}
