{
  "id": "pk-earthquake-reconstruction-and-rehabilitation-authority-act-2011",
  "type": "statute",
  "title": "Earthquake Reconstruction and Rehabilitation Authority Act, 2011",
  "title_en": "Earthquake Reconstruction and Rehabilitation Authority Act, 2011",
  "short_name": "ERARA",
  "status": "in_force",
  "issued_date": "2011-03-11",
  "in_force_date": "2011-03-11",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FsZp4%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Earthquake Reconstruction and Rehabilitation Authority Act, 2011 (V of 2011) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Act may be called the Earthquake",
      "content": "Reconstruction and Rehabilitation Authority Act, 2011.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once and shall be deemed to have taken effect on the 1st day\nof July, 2007."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(a)     “affected areas” means areas affected by the earthquake and its aftershocks\nand notified as such by the Federal Government;\n(b)     “Authority” means the Earthquake Reconstruction and Rehabilitation Authority\n(ERRA);\n(c)     “Board” means the Board of the Authority established under section 12;\n(d)     “Chairman” means Chairman of the Authority;\n(e)     “Council” means the Earthquake Reconstruction and Rehabilitation Council\nconstituted under section 8;\n(f)      “Deputy Chairman” means Deputy Chairman of the Authority;\n(g)     “ECNEC” means Executive Committee of the National Economic Council;\n(h)      “fund” means the fund established under section 15;\n(i)     “regulations” means regulations made under this Act; and\n(j)      “rules” means rules made under this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Earthquake Reconstruction and Rehabilitation Authority",
      "content": "(1) Immediately after commencement of this Act, the Federal Government shall, by notification in\nthe official Gazette, establish the Earthquake Reconstruction and Rehabilitation Authority (ERRA) for\ncarrying out the purposes of this Act.\n(2) Subject to the provisions of this Act, the Authority shall be autonomous in its functions\nand operations and shall be a body corporate having perpetual succession and a common seal, with\npower to acquire, hold and dispose of property, both moveable and immoveable, and enter into\ncontracts and shall by its name sue and be sued.\n(3) For the purpose of coordination, the Authority will be administratively attached with\nthe Prime Minister's Secretariat."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Principal office.The principal office of the Authority shall be in Islamabad and",
      "content": "it may establish regional offices at such other place or places as it considers necessary."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Functions of Authority.Subject to the provisions of this Act, the Authority shall be",
      "content": "responsible for all reconstruction, rehabilitation and early, recover y programmes and projects in\nthe affected areas and, towards this end, may perform the following functions, namely:\n(a)      to conduct surveys to assess damage and carry out future planning in the\naffected areas;\n(b)     to formulate a comprehensive umbrella development program to provide for\n(i)     reconstruction of the government buildings and offices, utilities and\nservices, infrastructure, roads, subways and bridges, potable water,\ndrainage system, health and education facilities, tourism, irrigation and\nagriculture facilities in the affected areas;\n(ii)    environmental protection and rehabilitation; and\n(iii)   restoration of economic activities and livelihoods;\n(c)      to prepare resettlement and rehabilitation plan for the affected population in\nconsultations with the respective Governments of the affected areas;\n(d)      to approve projects, programmes and schemes identified, prepared and\nsubmitted by the respective Governments of the affected areas;\n(e)      to take steps for monitoring and evaluation of the approved projects,\nprogrammes and schemes;\n(f)       to prescribe cost-effective technology, building codes or construction\nguidelines, architectural designs, specifications, and construction materials for\nhousing and other buildings in the affected areas to safeguard against future\nseismic threats.\n(g)      To facilitate the establishment of the reconstruction-related industry and\nbusiness in the affected areas in consultation with the respective Governments;\n(h)    To perform such other functions supplemental, incidental or consequential to\nthe purposes and functions aforesaid and any other function assigned to it by\nthe Federal Government in accordance with the purposes of this Act; and\n(i)     to keep the two Houses of Majlis-e-Shoora (Parliament) informed of its\nactivities through six monthly reports of its performance for discussion."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Powers of the Authority. To perform its functions, the Authority may",
      "content": "(a)      undertake any work, incur any expenditure, procure plant, machinery, services,\nequipment, vehicles and any other moveable and immoveable property,\nand procure stores required for the implementation of approved development\nprojects, programmes and schemes;\n(b)       dispose of such plant, machinery, equipment, vehicles property and stores as\nare no longer required in the manner as prescribed by rules;\n(c)      seek or call for any information from any person or any institution, department\nor agency, as may be required for carrying out its purposes;\n(d)      seek and obtain from any department or agency (including the armed forces)\nadvice and assistance to discharge its functions and for execution of its\napproved projects, programmes and schemes;\n(e)      approve individual projects, programmes and schemes, within the scope of the\napproved umbrella programme;\n(f)      transfer any project on its completion to any department or agency of the\nFederal Government or respective Governments of the affected areas; and\n(g)      re-appropriate funds from one project, programme, scheme etc. to another\nproject, programme or scheme."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Management and administration. (1) The general direction in all matters of policy",
      "content": "and administration of the Authority and its affairs shall vest in the Council.\n(2) The Council may, by general or special order, delegate to any body or any officer of the\nAuthority to exercise any of its powers, duties or functions under this Act, subject to such conditions\nas it may deem fit."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. The Council. (1) There shall be established the Earthquake Reconstruction and",
      "content": "Rehabilitation Council which shall consist of the following members, namely: \n(a)     Prime Minister of Pakistan                                    Chairperson\n(b)     Prime Minister of Azad Jammu and Kashmir                        Member\n(c)     Chief Ministers of Punjab, Khyber Pakhtunkhwa,\nSindh and Balochistan                                          Members\n(d)    Chief Minister, Gilgit-Baltistan                               Member\n(e)     The Federal Minister for Finance or Advisor to the\nPrime Minister on Finance as the case may be; and               Member\n(f)    Deputy Chairman, Planning Commission                            Member\n(g)    Chairman of the Authority                                       Member\n(h)   Deputy Chairman of the Authority                                Member\n(i)    two members each from the National Assembly and the\nSenate to be nominated by the Speaker and Chairman\nrespectively in consultation with the Leaders of the\nHouse and Leaders of the Opposition in the two Houses.          Members\n(2) The Council may co-opt such other members as it deems necessary for the conduct of\nits business.\n(3) The Federal Government may, by notification in the official Gazette, increase the\nmembership of the Council."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Functions of the Council. The Council shall provide policy guidelines and approve the",
      "content": "policies, plans, programmes, projects and scheme, submitted by the Chairman or the Board."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Chairman of the Authority. (1) The Federal Government shall appoint Chairman of",
      "content": "the Authority in accordance with the qualifications and procedure laid down by the Council. The\nChairman shall be responsible far the policy matters for such period and such terms and conditions as\nmay be determined by the Council.\n(2) The Chairman shall perform such function and carry out such responsibilities as may\nbe delegated to him by the Council or the Board."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Deputy Chairman of the Authority. (1) The Federal Government shall appoint Deputy",
      "content": "Chairman for such period and on such terms and conditions as the Council may determine.\n(2) The Deputy Chairman shall be responsible for the day-to-day administration of the Authority\nand may exercise such administrative and financial powers as delegated to him by the Council or\nthe Board."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. The Board. (l) There shall be a Board which shall be responsible for the implementation",
      "content": "of the approved policy decisions, plans, programmes, projects and schemes and shall have such\nadministrative and financial powers as may be delegated to it by the Council.\n(2) The Board shall consist the following members, namely:\n(a)     Chairman of the Authority                                    Chairman\n(b)     Deputy Chairman of the Authority                              Member\n(c)     Additional Finance Secretary                                  Member\n(d)     Additional Secretary Defence                                    Member\n(e)      Additional Secretary Planning Division                          Member\n(f)     Additional Secretary Economic Affairs Division                   Member\n(g)     Chief Secretaries of four Provinces and Gilgit-Baltistan         Members\n(h)     Chief Secretary AJ&K                                              Member\n(i)     Four representatives of civil society to be nominated\nby the Federal Government                                         Members\n(j)    A representative of civil society to be nominated by\nthe Government of an affected Area.                               Member\n(3) The Deputy Chairman of the Authority shall also act as Secretary of the Board.\n(4) The Board may co-opt such other members as are deemed necessary for the conduct of its\nbusiness.\n(5) The terms and conditions of the non-official members and their privileges will be such as\nmay be determined by the Council.\n(6) The Federal Government may, by notification in the official Gazette, increase or decrease\nthe membership of the Board and for that matter amend sub-section (2) so as to add any entry thereto\nor modify or omit any entry therein."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Powers and functions of the Board.  (1) The Board shall exercise such powers and",
      "content": "perform such functions as the Council may assign to it.\n(2) Subject to the provision of sub-section (1) and subject to the overall supervision and control\nof the Council, the Board shall perform the following functions, namely:\n(a)     approve projects upto one billion rupees and any project beyond that\nlimit shall be submitted to ECNEC for approval;\n(b)      approve the budget and accounts;\n(c)     consider the quarterly and annual reports of the Authority for making\nrecommendations to the Council;\n(d)      appoint advisors and consultants and determine their conditions of\nappointment; and\n(e)     constitute such committees as it may consider appropriate."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Meetings. (1) Meetings of the Council and of the Board shall be held at such time, place",
      "content": "and in such manner as may be specified.\n(2) The Council shall meet once in three months or as often as the Chairman of the Council\nmay direct.\n(3) The Board shall meet as often as is expedient to discharge its responsibilities and shall\nprescribe procedure for regulating its proceedings.\n(4) The decisions of the Council and of the Board shall be taken by the majority of members\npresent and, in the event of a tie, the Chairperson or, as the case may be the Chairman shall have\na casting vote."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. ERRA Fund. (l) There shall be established a fund for reconstruction and rehabilitation",
      "content": "to be known as the ERRA Fund which shall vest in and be utilized by the Authority to meet the\nexpenses and carry out the objectives of this Act.\n(2) The Fund shall consist of\n(a)      such sums as the Federal Government may, from time to time, allocate to it; and\n(b)      all other sums or properties which may in any manner become payable to,\nor vest in, Authority"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Annual budget. The Authority shall prepare its annual budget for each financial year, to",
      "content": "be considered by the Board, for submission to the Council for final approval."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Accounts. The Authority shall maintain complete and accurate books of accounts and shall,",
      "content": "after the end of each financial year, prepare for the financial year a statement of accounts of the\nAuthority in such form as may be prescribed by the Controller General of Accounts for submission to\nthe Federal Government."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Audit. (1) The accounts of the Authority shall he audited annually by the Auditor",
      "content": "General of Pakistan.\n(2) The Authority, in addition to the audit by the Auditor General, may cause its accounts\nto be audited by internal auditors and arrange for third party validation of the projects on need basis."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Exemption from taxes. Notwithstanding anything contained in the Income Tax",
      "content": "Ordinance, 2001 (XLIX of 2001), or in other law for the time being in force relating to income-tax,\ncapital gains- tax, the Authority shall not be liable to pay and shall be exempted from paying any\nsuch taxes as aforesaid on its incomes, profits or gains."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Appointment of officers, etc. (1) The Board may, from time to time, appoint such",
      "content": "officers, employees, experts and consultants as it may consider necessary for the performance of its\nfunctions.\n(2) The Board shall, prescribe by regulations the procedure for appointment of its officers,\nemployees, experts and consultants and the terms and conditions of their service."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Validity of proceedings. No act, decision or proceedings of the Authority or its Council",
      "content": "or Board shall be invalid by reason only of the existence of a vacancy in, or defect in the constitution\nof, the Authority or its Council or Board."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Indemnity. No suit, prosecution or other legal proceedings shall lie against the Authority,",
      "content": "theCouncil, the Board, the Chairperson, the Chairman, or any member, officer, servant, advisor,\nconsultant or expert of the Authority, for anything done in good faith under this Act."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Offiers etc., to be public servant. Every officer, employee expert and consultant of",
      "content": "the Authority shall be deemed to be a public servant within the meaning of section 21 of the\nPakistan Penal Code, 1860 (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Ordinance XCI of 2002 not to apply to the Authority. Nothing contained in the",
      "content": "Industrial Relations Ordinance, 2002 (XCI of 2002), shall apply to, or in relation to, the Authority\nor its establishments or in its officers or employees."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Winding up of the Authority. No provision of any law relating to winding up of",
      "content": "bodies corporate shall apply to the Authority and the Authority shall not be wound up except\nthrough resolution passed by both Houses of Majlis-e- Shoora (Parliament)."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Powers to make rules. The Council may, by notification in the official Gazette, make",
      "content": "rules for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Powers to make regulations. The Board may make regulations not inconsistent with",
      "content": "this Act and the rules made thereunder, to provide for all matters for which provision is necessary\nor expedient for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Removal of difficulties. If any difficulty arises in giving effect to any of the provisions",
      "content": "of this Act, the Federal Government may make such order, not inconsistent with the provisions of\nthis Act as may appear to be necessary, for the purpose of removing the difficulty."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Power of the Federal Government to issue directives. The Federal Government",
      "content": "may, as and when it considers necessary, issue directives to the Authority on matters of policy, and\nsuch directives shall be binding on the Authority and if a question arises whether any matter is a matter\nof policy or not, the decision of the Federal Government shall be final."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Act to override other laws. The provisions of this Act shall have effect",
      "content": "notwithstanding anything inconsistent contained in any other law for the time being in force and any\nsuch law, rule or regulation shall, to the extent of any inconsistency, cease to have effect from the date\nthis Act comes into force."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Repeal and savings. Upon the commencement of this Act",
      "content": "(a)     the Prime Minister's Secretariat's Notification No. F.1(4)/2005-Admin, dated\n24th October, 2005, shall stand rescinded;\n(b)     all funds, properties, rights and interests of whatsoever kind issued, used,\nenjoyed, possessed or owned, vested in the Earthquake Reconstruction and\nRehabilitation Authority (ERRA) in existence before such commencement\nand of liabilities legally subsisting against the said Authority shall pass to the\nAuthority established under this Act; and\n(c)   all employees, advisors, consultants and experts appointed by the Authority in\nexistence before the commencement of this Act shall become employees,\nadvisors, consultants and experts of the Authority established under this Act."
    }
  ],
  "definitions": [
    {
      "term": "affected areas",
      "definition": "areas affected by the earthquake and its aftershocks and notified as such by the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "the Earthquake Reconstruction and Rehabilitation Authority (ERRA);",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of the Authority established under section 12;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "Chairman of the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "Council",
      "definition": "the Earthquake Reconstruction and Rehabilitation Council constituted under section 8;",
      "source_provision": "sec2"
    },
    {
      "term": "Deputy Chairman",
      "definition": "Deputy Chairman of the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "ECNEC",
      "definition": "Executive Committee of the National Economic Council;",
      "source_provision": "sec2"
    },
    {
      "term": "fund",
      "definition": "the fund established under section 15;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act.",
      "source_provision": "sec2"
    }
  ]
}
