{
  "id": "pk-ehtram-e-ramazan-ordinance-1981",
  "type": "statute",
  "title": "Ehtram-e-Ramazan Ordinance, 1981",
  "title_en": "Ehtram-e-Ramazan Ordinance, 1981",
  "short_name": "Ehtram-e-Ramazan Ordinance, 1981",
  "status": "in_force",
  "issued_date": "1981-06-24",
  "in_force_date": "1981-06-24",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bZ2V-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Ehtram-e-Ramazan Ordinance, 1981 (XXIII of 1981) published by The Pakistan Code (Islamic/Religious Laws).",
  "provisions": [
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Cinema",
      "content": "houses, theatres, etc., to remain closed during Ramazan"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Ordinance to override other laws",
      "content": "ORDINANCE No. XXIII OF 1981\n[25th June, 1981]\nAN\nto provide for measures observe the sanctity of the month of Ramazan\nWHEREAS, in view of the tenets of Islam, it is necessary to provide for measures to observe\nthe sanctity of the month of Ramazan;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in exercise of the powers conferred by Article 89 of the Constitution,\nread with the Provisional Constitution Order, 1981 (C. M. L. A. Order No. 1 of 1981), the President is\npleased to make and promulgate the following Ordinance:-"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.___ (1) This Ordinance may be called the Ehtram",
      "content": "e-\nRamazan Ordinance, 1981.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definition",
      "content": "_In this Ordinance, unless there is anything repugnant in the subject or context,\n“public place” includes any hotel, restaurant, canteen, house room, tent, enclosures, road lane, bridge\nor other place to wich the public have access."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Prohibition of eating, etc., in public places",
      "content": "_ (1) No person who, according to the tenets\nof Islam, is under an obligation to fast shall eat, drink or smoke in a public place during fasting hours\nin the month of Ramazan.\n(2) Whoever contravenes the provisions of sub-section (1) shall be punishable with simple\nimprisonment for a term which may entend to three months, or with fine which may extend to five\nhundred rupees, or with both."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Prohibition of serving eatables in certain public places",
      "content": "_ (1) No proprietor, manager,\nservant, or other person in charge of a hotel, restaurant or canteen, or other public place, shall\nknowingly and wilfully offer or serve or cause to be offered or served any eatables during fasting hours\nin the month of Ramazan to any person who, according to the tenets of Islam, is under an obligation\nto fast.\n(2) Whoever contravenes the provisions of sub-section (1) shall be punishable with simple\nimprisonment for a term which may extend to three months, or with fine which may extend to five\nhundred rupees, or with both."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Exemptions.___Nothing contained in section 4 shall apply in respect of",
      "content": "(a)     a canteen or kitchen maintained in a hospital for serving food to patients;\n1\n[(b)   a restaurant, canteen, stall or wheel barrow, or the holder of a vending contract,\nwithin the premises of a railway station or in a train or a restaurant or canteen\nwithin the premises of an airport, seaport or bus stand or in a or in an aircraft;]\n(c)        a kitchen or dining-car of a train; or\n(d)        a kitchen or canteen meant for children within the premises of a primary school."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power to enter and arrest",
      "content": "_ (1) If any Magistrate, the Chairman of a District Council or\na Municipal Committee or a Town Committee, the Mayor of a Municipal Corporation, or the Chairman\nor a Member of a District Zakat and Ushr Committee has reason to believe that any offence punishable\nunder this Ordinance has been committed by any person in or at a public place he may enter the public\nplace and arrest such person.\n(2) Where the Magistrate arresting any person under sub-section (1) is for the time being\nempowered to try in a summary way the offences specified in sub-section (1) of section 260 of the\nCode of Criminal Procedure, 1898 (Act V of 1898), such Magistrate may try such person at the place\nwhere he is arrested in accordance with the provisions contained in sections 262 to 265 of the said\nCode.\n(3) When any person is arrested under sub-section (1) by a person other than a Magistrate\nreferred to in sub-section (2) such person shall, if a bond to his satisfaction is not executed, forward\nthe person arrested to the nearest Police Station, with a report of the circumstances in which such arrest\nwas made."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Cognizance of offences and procedure.___ (1) Save as provided in sub",
      "content": "section (2) of section\n7, no Court shall take cognizance of any offence punishable under this Ordinance except on a\ncomplaint in writing made by a person authorised to arrest under sub-section (1) of that section or by\nthe officer in charge of the Police-Station in whose jurisdiction the offence is alleged to have been\ncommitted.\n(2) Any Magistrate empowered for the time being to try in a summary way the offence specified\nin sub-section (1) of section 260 of the Code of Criminal Procedure, 1898 (Act V of 1898), may try\nany offence punishable under this Ordinance in accordance with the provisions contained in sections\n262 to 265 of the said Code.\n(3) The Officer in charge of the police-station to which a person arrested is forwarded under\nsub-section (3) of section 7 shall make a complaint to a Magistrate within twenty-four hours of the\ntime on which such person is brought to the Police Station.\n1\nSubs. and shall be deemed always to have been so subs. by Ordinance No. XXIX of 1981, s. 2.\n(4) The trial of an offence publishable under this Ordinance shall be taken up on a priority\nbasis and shall be concluded as expeditiously as may be administratively possible."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Power to make rules",
      "content": "_ (1) The Federal Government may make rules for carrying out the\npurposes of this Ordinance.\n(2) In particular, and without prejudice to the generality of the foregoing provisions, such rules\nmay provide that, in a canteen, restaurant or dining-car referred to in clause (a), (b), (c) or (d) of section\n5, eatables or articles of smoking shall only be served at a place protected from public view by means\nof a curtain or otherwise, and specify the classes of persons who may be admitted to any such canteen,\nrestaurant or dining-car during fasting hours in the month of Ramazan.\n(3) A person contravening any rule made under sub-section (1) shall be deemed to be guilty of\nan offence punishable under section 4 and shall be punishable accordingly."
    }
  ],
  "definitions": []
}
