{
  "id": "pk-electoral-rolls-act-1974-repeal-by-no-f-8-9-2017-dated-23-10-2017",
  "type": "statute",
  "title": "Electoral Rolls Act, 1974(Repeal by No.F.8(9)/2017 dated 23-10-2017)",
  "title_en": "Electoral Rolls Act, 1974(Repeal by No.F.8(9)/2017 dated 23-10-2017)",
  "short_name": "ERABN",
  "status": "repealed",
  "issued_date": "1974-04-21",
  "in_force_date": "1974-04-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2Rr-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Electoral Rolls Act, 1974(Repeal by No.F.8(9)/2017 dated 23-10-2017) (XXI of 1974) published by The Pakistan Code (Election Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Electoral\nRolls Act, 1974.\n(1) It shall come into force at once.\n(2) It extends to the whole of Pakistan."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "2[(1) “Commissioner”\nmeans the Chief Election Commissioner appointed under the\nElection Commission Order, 1977 [President’s (PP) Order No. 4 of 1977];].\n3[(1A) \"Commission\" means the Elecxtion Commission constituted under Article 218 of\nthe Constitution of the Islamic Republic of Pakistan.\n(1B) \"data\" means, any information in digital form contained in a database mainained by\nthe Commission.\n(1C) \"database\" for the purpose of this Act, means the database of the Electoral Rolls\nmaintained by the Commission\"]\n(2) \"electoral area\" means—\n1 For Statement of Objects and Reasons, see Gaz. of P., 1974. Ext., Pt. III, p. 301.\nThis Act has been applied to the Provincially Administered Tribal Areas of Baluchistan. see Notification No. SO (TA) 3/32/73 dated the 25th Sep., 1974 see Gaz of Baluchistan Ext Issue\nNo. 71 of 1974.\n2 Subs. by the Electoral Rolls (Amdt.) Ordinance, 1978 (39 of 1978), s. 2.\n3 Added and subs. by Act XI of 2011, 2 and 6.\n*Amendment in Electoral roll Act 1974, See Ordinance No. VII of 2014, Amendment in section 2, 4 in new section 4A Also amendment in section 27 (valid upto 10­02­2015)\n1[(a) in rural areas, a village or a census block; and\n(b) in urban areas,___\n(i) where there is a municipal ward or census block, such ward or census block;\n(ii) where there is no municipal ward or a census block, a well­defined mohallah or a\nstreet; and\n(iii) where the ward or census block, mohallah or street is too big, a well­defined part\nthereof; or]\n(c) such other areas as may be determined by 2[Commission];\n4[(2A) \"local government\" means the local government established under a Federal or a\nProvincial law relating to local government;\n(2B) \"local government law\" means a Federal or a Provincial law relating to local government;]\n(3) \"prescribed\" means prescribed by rules made under this Act;\n(4) \"Registration Officer\" means a Registration Officer appointed under section 5, and includes an\nAssistant Registration Officer performing the functions of a Registration Officer; and\n(5) \"Revising Authority\" means a person appointed under section 9 to hear and dispose of claims\nand objections and applications for correction relating to the electoral rolls."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Assistance to 3[Commission]",
      "content": "(1) The 3[Commission] may require any person or authority\nto perform such function or render such assistance for the purposes of this Act as the 3[Commission]\nmay direct.\n(2) All executive authorities of the Federal Government, each Provincial Government, the\nFederal Capital and the Federally Administered Tribal Areas shall assist the 3[Commission] in the\nperformance of 3[its] functions under this Act and for this purpose the 3[Commission] may issue such\ndirections as 3[it] may consider necessary.\n1 Subs. by Ord. 9 of 02, s. 2.\n2 Added and subs. by Act XI of 2011, 2 and 6.\n3 Subs. by Act XI of 2011, s. 6.\n4 Ins. by Act XXVIII of 2016, s. 2.\n(3) The Federal Government and each Provincial Government shall make available to the\n1[Commission] such staff as 1[it] may require for the performance of 1[its] functions under this Act.\n2[4. Preparation and computerization of electoral rolls for election to the Assemblies.___(1)\nThe 1[Commission] shall cause to be prepared the electoral rolls for election to the National\n\"Assembly\"3[,] Provincial Assemblies, 3[and Local Government] afresh or by revising the electoral\nrolls existing immediately before the commencement of electoral Rolls (Amendment)\nOrdinance, 2000 and revised from time to time in the prescribe manner.\n(2) The 1[Commission] shall make arrangements for the computerization of the electoral rolls in\nthe manner as 1[it] may determine and any printout of the computer maintained by, or with the\nauthority of, the 1[Commission] shall be deemed to be an electoral roll published under this Act.\n3[4A. Procedure of Commission._The Commission shall regulate its own procedure.]."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Appointment of Registration Officers, etc",
      "content": "(1) The 1[Commission] shall appoint a\nRegistration Officer for an electoral area or group of electoral areas for the purpose of preparation,'\nrevision, correction and amendment of the electoral rolls and may, for the purpose, appoint as many\nAssistant Registration Officers as may be necessary.\n(2) Subject to such instructions as may be given in this behalf by the 1[Commission],—\n(a) an Assistant Registration Officer may, under the control of the Registration Officer,\nperform the functions of a Registration Officer; and\n(b) a Registration Officer may require any person to assist him in the performance of ; 1[its]\nfunctions."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. 2[(1) Subject to the superintendence, directions and control of the 1[Commission], the",
      "content": "Registration Officer shall prepare the electoral rolls by including therein the name of every person\nentitled to be enrolled as voter in the electoral area under this Act.]\n(2) A person shall be entitled to be enrolled as a voter in an electoral area if he—\n(a) is a citizen of Pakistan;\n4(b) is not less than eighteen years of age and possesses National Identity Card issued by the\nNational Database and Registration Authority constituted under the National Database\nand Registration Authority Ordinance, 2000 (VIII of 2000), or comes in possession of\nsuch National Identity Card on the last date fixed for inviting claims, objections and\napplications for corrections, if any, for the purpose of preparing or revising the electoral\nrolls:\n1 Subs. by Act XI of 2011, s. 6.\n2 Subs. by Ord. 51 of 2000, s. 2 and 3.\n3 Ins & Omitteded by Act XXVIII of 2016, s, 3­4.\n4 Subs by Act XI of 2011, s. 3.\nProvided that National Identity Card issued by National Database and Registration\nAuthority shall be deemed to be valid for the purpose of registration as voter or casting\nvote at a poll, notwithstanding the expiry of its validity period.]\n1* * * * * * *\n(c) is not declared by a competent court to be of unsound mind; and\n(d) is, or is deemed under section 7 to be, resident in the electoral area;\n2* * * * * * *"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Meaning of resident",
      "content": "(1) Save as hereinafter provided, a person shall be deemed to be\nresident in an electoral area if he ordinarily resides, or owns or is in possession of a dwelling house or\nother immovable property, in that area.\n(2) Where a person owns or possesses dwelling houses or other immovable property in more than\none electoral area, he may, at his option, be enrolled in any one such area.\n(3) A person who is in the service of Pakistan or holds any public office shall be deemed to be\nresident in the electoral area where he is posted, unless he applies in writing to the Registration\nOfficer for enrolment in the electoral area in which he would have been enrolled if he had not been in\nsuch service or had not held such office.\n(4) The wife of any such person as is referred to in sub­section (3) and such of his children as are\nentitled to be enrolled shall, if they ordinarily reside with such person, be deemed to be residents in\nthe electoral area in which such person is deemed to be resident under that sub­section.\n(5) A person who is detained in prison or held in other custody at any place in Pakistan shall be\ndeemed to be resident in the electoral area in which he would have been resident if he had not been\nso detained or held in such custody."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Preliminary publication. The preliminary electoral rolls prepared under section 6, together",
      "content": "with a notice inviting claims and objections and applications for corrections, if any, with respect\nthereto, shall be published and displayed in such manner and form as may be prescribed."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Appointment of Revising Authorities. The 3[Commission] shall appoint a. Revising Authority",
      "content": "for any electoral area or group of electoral areas, for the purpose of receiving and deciding claims,\nobjections and applications for corrections relating thereto.\n1 Omitted, Ord. 9 of 02, s. 3.\n2 The proviso which was subs. by Ord. 43 of 1978 has been omitted ibid.,\n3 Subs by Act XI of 2011, s. 6."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Period for lodging claims and objections. Every claim for inclusion of a name in the",
      "content": "electoral roll, and every objection to, or application for correction of, any entry theirin shall be made\nto the Revising Authority on the prescribed form within a period of twenty­one days next following\nthe date of the publication of the preliminary electoral rolls under section 8."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Transfer of name from one electoral area to another. A person may apply for transfer of his",
      "content": "name from the electoral roll of one electoral area to the electoral roll of another by filing—\n(a) an objection to the inclusion of his name in the roll in which it has been included, and\n(b) a claim for the inclusion of his name in the other, with the appropriate Revising Authority\nor Revising Authorities, if it is preferred before the final publication of the electoral roll\nunder section 16, or with the appropriate Registration Officer or Registration Officers, if it\nis preferred after such final publication."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Rejection of claims and objections. Any claim or objection or application for correction not",
      "content": "made within the period specified in section 10 or in the prescribed manner shall be rejected."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Application by the Registration Officer for inclusion of names. The Registration Officer",
      "content": "may, within the period mentioned in section 10, apply to the Revising Authority,—\n(a) for the inclusion in the electoral roll of the name of any person left out due to\ninadvertence or the absence of timely information while preparing the preliminary\nelectoral rolls; or\n(b) for the exclusion of any name from the electoral roll or any correction of clerical, printing\nor other error which he is himself authorised to make under sub­section (2) of section 15."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Enquiry into claims and objection, etc",
      "content": "(1) Except where a claim or objection or an\napplication for correction is rejected under section 12, or is decided without further inquiry being\nvalid prima facie, the Revising Authority shall, give its decision after holding a summary inquiry into\neach claim, objection or application, after giving notice to the parties concerned.\n(2) Every decision of the Revising Authority under sub­section (1) shall be final and be\ncommunicated to the appropriate Registration Officer.\n1 Ins. by Ord. 34 of 07, s. 2 (valid upto 30­10­07).\nSubs. by Act XI of 2011, s. 6."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Correction of electoral rolls. The Registration Officer",
      "content": "(i) shall correct the electoral roll in accordance with the decisions of the Revising Authority\nunder section 14; and\n(ii) may further correct any clerical, printing or. other error subsequently discovered in the\nroll, but not so as to include therein or exclude therefrom, the name of any elector."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Final publication. After making additions, deletions, modifications or corrections, if any,",
      "content": "under section 15, the Registration Officer shall publish in the prescribed manner and form the final\nelectoral roll for each electoral area."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Annual revision of electoral roll. An electoral roll shall be revised and corrected annually in",
      "content": "the prescribed manner and form—\n(a) so as to include the name of any qualified person whose name does not appear on such\nroll, or\n(b) so as to delete the name of any person who has died or who is or has become disqualified\nfor enrolment, or\n(c) for correcting any entry or for supplying any omission in such roll:\nProvided that, if for any reason, the electoral roll for any electoral area is not revised, the validity\nor continued operation of the electoral roll shall not thereby be affected."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Enrolment and correction at a time other than the annual revision",
      "content": "(1) Any person\nwhose name is not included in an electoral roll for the time being in force and who claims that he was\nor is entitled to be enrolled on that roll may apply to the appropriate Registration Officer 1[along with\na photo state copy of identity card 2[issued, or deemed to have been issued, to him under the National\nDatabase and Registration Authority Ordinance, 2000 (VIII of 2000).] for the inclusion of his name\ntherein, and if the Registration Officer is satisfied after giving such notice and making such inquiry as\nhe may consider necessary that the applicant was or in entitled to have his name enrolled, he shall for\nthe purpose of further correcting the roll insert the name of such person in that roll [;]3\n2[Provided that if the name of applicant is already included in the electoral roll of any other\nelectoral area of the same district or any other district, the Registration Officer shall strike off his\nname from the roll of that other electoral area of the same district and inform the Registration Officer\nof other district who shall, on receipt of the information, strike off the name of the applicant from that\nroll\n(2) Any person may apply to the Registration Officer for the correction of any entry in an\nelectoral roll for the time being in force; and\n1 Ins. by the Electoral Rolls (Amdt.) Ordinance, 1982 (20 of 1982), s. 2.\n2 Subs and added by Ord 51 of 2000, s. 5.\n3 Omitted Subs by Act XI of 2011, S. 4 & 6.\n(a) if the entry relates to the applicant and the Registration Officer is satisfied after giving\nsuch notice and making such inquiry as he may consider necessary that the entry relates\nto the applicant and is erroneous or defective in any particular, he shall correct the roll\naccordingly; and\n(b) if the entry does not relate to the applicant and the Registration Officer is satisfied after\ngiving notice to the person to whom the entry relates and after making such inquiry as he\nmay consider necessary that the entry is erroneous or defective or should be deleted, he\nshall correct the electoral roll accordingly.\n1[(3) Where the Registration Officer rejects application made under sub­section (1) or sub­section\n(2), he shall record in writing brief reasons of his decision.\n(4) A person aggrieved by the order of the Registration Officer made under sub­section (1) or\nsub­section (2) may, within thirty days of such order, appeal to the appellate authority to be appointed\nby the Commissioner and the decision of such authority given thereon shall be final)."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Preparation of rolls afresh. If the 1[Commission], on account of any gross error or",
      "content": "irregularity in or in the preparation of an electoral roll for any electoral area or a part thereof,\nconsiders it necessary so to do, 2[it] may by order direct that the roll for such area or part shall stand\ncancelled and that a fresh electoral roll for that area or part be prepared in accordance with the\nprovisions of this Act."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. No correction to be made after constituency called upon in elect. No revision or",
      "content": "correction of any electoral roll for an electoral area shall be made nor shall any order under section\n19 be made in respect of any electoral roll at any time after the constituency of which such electoral\narea forms part has been called upon to elect its representative and before such representative has\nbeen elected."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Maintenance of electoral rolls. An electoral roll as revised and corrected shall be",
      "content": "maintained in the prescribed manner and shall be kept open to public inspection; and copies of such\nroll shall be supplied to any person applying therefor, on payment of such fee as may be prescribed."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Departure from normal procedure in exceptional circumstances. Where the",
      "content": "1[Commission] is satisfied that it is not possible to follow the procedure laid down for the preparation\nof an electoral roll in respect of any electoral area, he may direct that an electoral roll for such\nelectoral area shall be prepared in such manner as 1[it] deems fit."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Duration of the electoral rolls. The electoral roll for any electoral area prepared under this",
      "content": "Act shall come into force immediately upon its final publication and shall remain in force until\nrevised.\n1 Subs. by Act XI of 2011, s. 6\n2 Subs and Omitted by Act XI of 2011 s. 4 and 6."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Access to register of births and deaths, etc",
      "content": "(1) The person in charge of any register of\nbirths and deaths and any authority to whom an application for registration is to be made under\n1[National Database and Registration Authority Ordinance, 2000 (VIII of 2000)], shall at the request\nof a Registration Officer furnish him with such information, including extracts from such register of,\nas the case may be, application, as may be necessary for the purposes of this Act.\n(2) Sub­section (1) shall have effect notwithstanding anything contained 1[section 28 of the\nNational Database and Registration Authority Ordinance, 2000 (VIII of 2000) and no person who\nfurnishes any information to a Registration Officer in pursuance of the said sub­section shall be liable\nto any punishment."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. No person to be enrolled more than once or in more than one electoral area. No person",
      "content": "shall be enrolled—\n(a) on the electoral roll for any electoral area more than once; or\n(b) on the electoral rolls for more than one electoral area."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Validity of electoral rolls, etc, not affected by reason of any mistake. An electoral roll shall",
      "content": "not be invalid by reason of any misdescription of a person enrolled thereon or of omission of the\nname of any person entitled to be so enrolled or of inclusion of the name of any person not so\nentitled."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. 2[Commission's] power to include a name in an electoral roll. Subject to section 20 the",
      "content": "2[Commission] may, at any time, order—\n(a) the inclusion in an electoral roll of the name of any person entitled to be enrolled on such\nelectoral roll, and such name shall, from the date of such order, form part of the electoral\nroll;\n(b) the exclusion from an electoral roll of the name of any person who has died or has\nbecome disqualified to be a voter, and such name shall, from the date of such order, stand\nexcluded from that roll; and\n(c) the removal of the name of any person from an electoral roll where such removal becomes\nnecessary due to the repetition of the name in the same electoral roll or in the electoral\nrolls of more than one electoral area.\n1 Subs. by Ord. 51 of 2000, s. 5.\n2 Subs. by Act XXVIII of 2016, s. 5."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Power to make rules",
      "content": "1[(1)] The 2[Commission] may, with the approval of the President\nand by notification in the official Gazette, make rules3 for carrying out the purposes of this Act.\n4[(2) Where a form has been prescribed for any of the purposes of this Act or the rules made\nthereunder, the Commissioner may, by notification in the official Gazette, make such modifications or\nadditions in the form as may in 2[its] opinion be necessary :\nProvided that the validity of an electoral roll prepared in the prescribed form for the time being in\nforce shall not be affected by any modification or addition made in the form subsequent to the\npreparation of the roll.].\n5[28A. Emoval of difficulties. If any difficulty arises in giving effect to any of the provisions of\nthis Act, the President may make such provision for the removal of the difficulty as 2[it] may deem\nfit.]."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Bar of Jurisdiction. No court shall question the validity of the electoral rolls prepared or",
      "content": "revised under this Act or the legality of or propriety of any proceedings or action taken thereunder by\nor under the authority of the Commissioner or a Registration Officer."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. [Repeal of P.O. No. 6 of 1969.] Omitted by the Federal Laws (Revision and Declaration)",
      "content": "Ordinance, 1981 (XXVII of 1981) s. 3 and Sch., II.\n6[30. Breach of official duty. Where a Registration Officer, an Assistant Registration Officer or\nany other person appointed in connection with official duly under this Act, willfully or without\nreasonable cause, commits breach of official duty by any act or omission, the Commissioner may\nsuspend such officer or person and initiate proceedings against him and refer the ease along with\nstatement of allegations to the Federal Government where such officer or person is serving under the\nFederal Government and in other cases the Provincial Government.\n2[30A. Information not to be divulged.__Any person who__\n(a) being an employee of the Commission publishes or communicates to any person, any\ninformation or data acquired by him in the course of such employment without being so\nauthorized by the Commission.\n(b) breaches, in any manner, the security or integrity of the information or data contained in\nthe electoral rolls database.\n(c) having possession of any information or data which to his knowledge has been obtained\nor disclosed in contravention of this Act or in breach of the security, secrecy or integrity\nthereof, publishes or communicates that information or data to any other person ; or\n1 Re­numbered by the Electoral Rolls (Amdt) Ordinance, 1978 (39 of 1978), s. 5.\n2 Subs by Act XI of 2011, s. 6.\n3 For the Electoral Rolls Rules: 1947 see S.R.O. No. 1035 (I)/74. dated 31­7­1974. Gaz. of P., 1974 Ext., (Islamabad) Pt. II. pp. 1447—53.\n4 Sub­section (2) which was originally added by Ord. 39 of 1978 s. 6, have been subs, by Electoral Rolls (Amdt.) Ord.. 1984 (25 of 1984), s. 2.\n5 ins. by the Electoral Rolls (Amdt.) Ordinance 1984 (48 of 1984), s. 2.\n6 Added by Ord. 51 of 2000, s.6.\n(d) misuses or abuses, in any manner, the information or data contained in the electoral rolls\ndatabase,\nshall be punishable with imprisonment for a term which may extend to five years, with fine which\nmay be extend to five million rupees, or with both.]."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Certain offences triable by Registration officer",
      "content": "Notwithstanding anything contained in\nthe 1[Commission] in this behalf, may—\n(a) exercise the powers of a Magistrate of the first class under the said Code in respect of the\noffences punishable under sections 172, 173, 174, 175, 177, 178, 179, 180, 182, 186, 187,\n188, 189, 191, 196, 197, 198. 199, 200,464 and 471 of the Pakistan Penal Code, 1860\n(Act XLV of 1860); and\n(b) take cognizance of any such offence and shall try it summarily in accordance with the\nprovisions of Code of Criminal Procedure, 1898 (Act V of 1898), relating to summary\ntrials.]\n1 Subs by Act XI of 2011, s. 6."
    }
  ],
  "definitions": []
}
