{
  "id": "pk-electricity-control-ordinance-1965",
  "type": "statute",
  "title": "Electricity Control Ordinance, 1965",
  "title_en": "Electricity Control Ordinance, 1965",
  "short_name": "ECO",
  "status": "in_force",
  "issued_date": "1965-09-11",
  "in_force_date": "1965-09-11",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cZaV-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Electricity Control Ordinance, 1965 (XXVIII of 1965) published by The Pakistan Code (Criminal Laws).",
  "provisions": [
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Service of Order (IX of 1910)",
      "content": "ORDINANCE NO. XXVIII of 1965\n[10th September, 1965]\nAN\nto provide for powers to control the production, distribution, use and consumption of\nelectrical energy during an emergency throughout Pakistan\nWHEREAS it is expedient to provide for powers to control the production, distribution, use\nand consumption of electrical energy throughout Pakistan;\nAND WHEREAS the National Assembly is not in session and the President is satisfied that\ncircumstances exist which render immediate legislation necessary;\nNOW, THEREFORE, in exercise of the powers conferred by Article 29 of the Constitution,\nread with clause (2) of Article 131 thereof and of all other powers enabling him in that behalf the\nPresident is pleased to make and promulgate the following Ordinance:⸻"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.⸻(1) This Ordinance may be called the",
      "content": "Electricity Control Ordinance, 1965.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Control of production, distribution, etc. of electrical energy.⸻(1) The 1[Federal",
      "content": "Government] so far as it appears to it to be necessary or expedient for maintaining supplies and\nservices essential to the life of the community in an emergency, may, by order in writing, provide\nfor⸻\n(a)       regulating or prohibiting the production, distribution, use or consumption, of\nelectrical energy;\n(b)       collecting any information or statistics for the purpose of any of the matters\nmentioned in clause (a);\n(c)        any incidental or supplementary matter including, in particular,⸻\n(i)       the entering and inspection of premises to which the order relates with\na view to securing compliance therewith; and\n(ii)      the grant or issue of a licence, permit, certificate or other document.\n1\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n(2) An order made under sub-section (1) may apply either to persons or undertakings\ngenerally or to any particular person or undertaking or class of persons or undertakings, and either to\nthe whole or any part of any undertaking, and may have effect either generally or in any particular\narea."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Penalty, etc.⸻(1) Whoever contravenes any order made under section 2, shall be",
      "content": "punishable with imprisonment for a term which may extend to six months, or with fine, or with both.\n(2) Where the person, guilty of an offence under sub-section (1), is a company or other body\ncorporate, every director, manager, secretary, agent, or other officer or person concerned with the\nmanagement of its business shall, unless he proves that the offence was committed without his\nknowledge or consent or that he exercised due diligence to prevent its commission be deemed to be\nguilty of such offence and be punishable accordingly."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Saving as to orders",
      "content": "No order, made under section 2, shall be called in question in any\ncourt."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Indemnity.⸻(1) No suit, prosecution or other legal proceeding shall lie against any person",
      "content": "for anything in good faith done or intended to be done, in pursuance of any order made under this\nOrdinance.\n(2) No suit or other legal proceeding shall lie against the 1[Federal Government] for any\ndamage caused or likely to be caused by anything in good faith done or intended to be done, in\npursuance of any order made under this Ordinance."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Cognizance of offences",
      "content": "No court shall take cognizance of any offence punishable under\nthis Ordinance except on a report in writing of the facts constituting the offence made by an officer\nauthorized in this behalf by the 1[Federal Government]."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Delegation of powers",
      "content": "The 1[Federal Government] may, by notification in the official\nGazette, direct that any power conferred on it by this Ordinance shall, in such circumstances and\nunder such conditions, if any, as may be specified in the notification, be exercisable also by a\nProvincial Government or by any officer or authority subordinate to the 1[Federal Government] or to\nthe Provincial Government."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Effect of provisions inconsistent with other enactments",
      "content": "The provisions of this\nOrdinance or any order made thereunder shall have effect notwithstanding anything inconsistent\ntherewith contained in any other law."
    }
  ],
  "definitions": []
}
