{
  "id": "pk-elephants-preservation-act-1879",
  "type": "statute",
  "title": "Elephants' Preservation Act, 1879",
  "title_en": "Elephants' Preservation Act, 1879",
  "short_name": "EPA",
  "status": "in_force",
  "issued_date": "1879-03-21",
  "in_force_date": "1879-03-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bZk%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Elephants' Preservation Act, 1879 (VI of 1879) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Killing and capture of wild elephants prohibited. No person shall kill, injure or capture,",
      "content": "or attempt to kill, injure or capture, any wild elephant unless–\n(a)        in defence of himself or some other person;\n(b)        when such elephant is found injuring houses or cultivation, or upon, or in the\nimmediate vicinity of, any main public road or any railway or canal; or\n(c)        as permitted by a license granted under this Act.\n3\n[4. Rights of Government with respect to certain elephants and tusks. Every wild elephant\ncaptured, and the tusks of every wild elephant killed, by any person not licensed under this Act, shall\nbe the property of Government.]"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. License to kill and capture wild elephants. The Collector or Deputy Commissioner of any",
      "content": "district may, subject to such rules as may for the time being be in force under this Act, grant licenses\nto kill, or to capture, or to kill and capture, wild elephants in such district:\nProvided that no such license shall authorize any person to enter upon any land without the\nconsent of the owner or occupier thereof."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Power of Provincial Government to declare what are main roads and canals, and to",
      "content": "make rules as to licenses. The 5[Provincial Government] may from time to time , 6[* * *] declare what\nshall be deemed to be main public roads and canals within the meaning of this Act, and make rules\nconsistent with this Act for regulating—\n1\nwhich was temporarily enacted by the Punjab Act, VI of 1973 and on the expiry of the Ordinance as so enacted by Punjab Act No. II of 1974, s. 48.\nThis Act has been repealed to the extent of Islamabad Capital Territory, See Ordinance No. XXVII of 1981 s. 4 and 3rd Sch.\n2\nSubs. by Adaptation Order, 1949, Sch., for the original paragraph, as amended by Adaptation Order, 1937 and Act No. XXXVIII of 1920, s. 2 and Sch. I.\n3\nSubs. by Act No. II of 1883.\n4\nFor rules under this section, see different local R. and O.\n5\nSubs. by Adaptation Order, 1937.\n6\nThe words “subject to the control of the Governor General in Council” rep. by Act No. XXXVIII of l920, s. 2 and Sch. I.\n(a)        the grant and renewal of licenses under this Act;\n(b)        the fees (if any) in money, tusks or captured elephants to be charged on such\ngrant and renewal;\n(c)        the time during which such licenses shall continue in force; and\n(d)        the conditions (if any) on which they shall be granted.\nAll such declarations and rules shall be published in the 1[official Gazette] and shall thereupon\nhave the force of law."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Penalty for contravening section 3. Whoever, in contravention of section 3, kills, injures",
      "content": "or captures, or attempts to kill, injure or capture, any wild elephant, shall be punished with fine which\nmay extend to five hundred rupees for each elephant concerned;\nand whoever breaks any condition contained in a license granted under this Act shall be\npunished with fine which may extend to five hundred rupees.\nAny person convicted of a second offence under this section shall be punished with\nimprisonment which may extend to six months, or with fine, or with both.\nWhen any person holding a license under this Act is convicted under this section, such license\nshall become void and shall be delivered up to the convicting Magistrate."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. License to be produced and shown on requisition of certain officers. Any officer of",
      "content": "Revenue or Police, or any Forest-officer, who may find any person killing, injuring or capturing, or\nattempting to kill, injure or capture, any wild elephant, except in the cases mentioned in section 3,\nclauses (a) and (b), may require him to produce and show a license granted to him under this Act.\nAny person who, on such request, wilfully refuses or is unable to produce and show such\nlicense as aforesaid, shall, in addition to any other punishment to which he may be liable under this\nAct, be punished with fine which may extend to one hundred rupees."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Limitation of prosecution. Every prosecution under this Act shall be commenced within",
      "content": "six months from the commission of the offence in respect of which it is instituted."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Recovery of fees. The amount or value of any fee payable under any license granted under",
      "content": "this Act may be recovered from the licensee as if it were an arrear of land-revenue.\n__________\nDate; 16-09-2024\n1\nSubs. by Adaptation Order, 1937."
    }
  ],
  "definitions": []
}
