{
  "id": "pk-employees-old-age-benefits-act-1976",
  "type": "statute",
  "title": "Employees' Old-Age Benefits Act, 1976",
  "title_en": "Employees' Old-Age Benefits Act, 1976",
  "short_name": "EOBA",
  "status": "in_force",
  "issued_date": "1976-04-14",
  "in_force_date": "1976-04-14",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2Rt-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Employees' Old-Age Benefits Act, 1976 (XIV of 1976) published by The Pakistan Code (Labour Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, commencement and application. (1) This Act may be called",
      "content": "(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once.\n2\n[(4) It applies to every industry or establishment\n(i)         wherein 3[five] or more persons are employed by the employer, directly or\nthrough any other person, whether on behalf of himself or any other person, or\nwere so employed on any day during the preceding twelve months, and shall\ncontinue to apply to every such industry or establishment even if the number\nof persons employed therein is, at any time after this Act becomes applicable\nto it, reduced to less than 3[five]3[.]\n3\n*     *          *           *          *          *          *\n4\n[(ia)    wherein less than 3 [five] persons are employed if such industry or\nestablishment voluntarily applies for application of this Act and this Act shall\napply to such industry or establishment from the date of submission of an\napplication by such industry or establishment; or]\n(ii)        which the Federal Government may, by notification in the official Gazette,\nspecify in this behalf.]\n1\nFor Statement of Objects and Reasons, see Gaz., of P., 1976, Ext., Pt. III, p.146.\n2\nSubs. by the Employees’ Old-Age Benefits (Amdt.) Ordinance, 1983 (17 of 1983), s. 3, (w.e.f. 1-7-83).\n3\nSubs. and Omitted by Finance Act I of 2008, s. 9 (w.e.f. 1-07-08).\n4\nIns. by ord. LIII of 2001 s.2.sch."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless the context otherwise requires,",
      "content": "1\n[(a)   ‘benefits’ mean old-age pension, invalidity pension 2[survivor’s] pension,\nold-age grant and such other payments as may be determined by the Federal\nGovernment from time to time;]\n1\n[(aa)] “Board” means the Board of Trustees constituted under section 7 ;\n(b)        “contribution” means the sum of money payable to the Institution by the\nemployer 3[or by the Federal Government] in respect of an insured person\nunder the provisions of the Act;\n1\n[(bb) “employee” means any person employed, whether directly or through any\nother person, for wages or otherwise, to do any skilled or unskilled,\nsupervisory, clerical, manual or other work in, or in connection with the affairs\nof, an industry or establishment, under a contract of service or apprenticeship,\nwhether written or oral express or implied, and includes such person when\nlaid off ;] 4[:]\n5\n*   *       *      *      *       *       *\n6\nProvided * that a director of a limited company or of a corporation set\nup under any law shall not be treated as an employee under this Act,\nirrespective of his wages or emoluments.] ;\n7\n[(c)   ‘employer’, in relation to an industry or establishment, means any person who\nemploys, either directly or through any other person, any employee, and\nincludes \n(i)        in the case of an individual, an heir, successor, administrator or assign;\n(ii)       a person who has ultimate control over the affairs of an industry\nor establishment, or where the affairs an industry or establishment are\nentrusted to any other person (whether called a managing agent,\nmanaging director, manager, superintendent, secretary or by any other\nname), such other person; and\n3\n*      *          *          *          *          *          *\n(d)        “employment injury” means a personal injury to an insured person caused\nby an accident, or by such occupational disease as may be specified in\nthe regulations, arising out of and in the course of his employment;\n1\nRe-numbered and ins. by the Employees’ Old Age Benefits (Amdt.) Ordinance, 1983 (17 of 1983), s. 4 (w.e.f. 1-7-83).\n2\nSubs. by Ord. 46 of 02, s. 2.\n3\nIns. and Omitted by the Finance Act, 1986 (1 of 1986), s. 11.\n4\nAdded, ibid.\n5\nProviso omitted by the Labour Laws (Amdt.) Act, 1994 (11 of 1994), s. 8 and fourth Sch.\n6\nThe word “further” omitted ibid.\n7\nSubs. by Ord. 17 of 1983, s. 4, (w.e.f. 1-7-83).\n1\n[(e)    “establishment” means-\n(i)        an establishment to which the West Pakistan shops and Establishments\nOrdinance, l969 (West Pakistan Ordinance No. VIII of 1969) for the\ntime being applies, and, notwithstanding anything contained in section\n5 thereof, includes clubs, hostels, organisations and messes not\nmaintained for profit or gain and establishments, including hospitals,\nfor the treatment or care of sick, infirm, destitute or mentally unfit\npersons;\n(ii)       a construction industry as defined in the West Pakistan Industrial and\nCommercial Employment (Standing Orders) Ordinance, 1968 (West\nPakistan Ordinance No. VI of 1968);\n(iii)      a factory as defined in the Factories Act, 1934 (XXV of 1934);\n(iv)       a mine as defined in the Mines Act, 1923(IV of 1923);\n(v)        a road transport service as defined in the Road Transport Workers\nOrdinance,1961 (XXVIII of 1961) ; and\nincludes any class of industries or establishments which the Federal\nGovernment may, by notification in the official Gazette, declare to be\nestablishments for the purposes of this Act,];\n(f)        “fund” means the Employees’ Old-Age Benefits Fund set up under section l7 ;\n(g)        “industry” means any business, trade, undertaking, manufacture or calling of\nemployers, and includes any calling, service, employment, handicraft\nindustrial occupation or a vocation of workmen ;\n(h)        “institution” means the Employees’ Old-Age Benefits Institution established\nor nominated under section 4 1[or section 5];\n(i)        “insured person” means                   2\n[an employee] who is or was in insurable\nemployment;\n(j)        “insurable employment” means employment of a person under a contract of\nservice or apprenticeship, whether written or oral, express or implied and in\nrespect of which contributions are payable under this Act;\n(k)        “invalidity” means a condition, other than that caused by an employment\ninjury, as a result of which an insured person is permanently incapacitated to\nsuch an extent as to be unable earn from his usual or other occupation more\nthan one third of the normal rates of earning in his usual occupation ;\n(1)        “member” means a member of the Board ;\n(m)        “prescribed” means prescribed by rules ;\n(n)        “regulations” means regulations made by the Board ;\n(o)        “rules” means rules made under this Act;\n1\nSubs. and Added by the Employees’ Old Age Benefits (Amdt.) Ordinance, 1983 (17 of 1983), s. 4, (w.e.f. 1-7-83).\n2\nSubs. by the Finance Act, 1986 (1 of 1986), s. 11.\n(oa) 1*              *          *           *          *          *          *\n1\n[(p)   “wages” means the rates of wages as declared under the Minimum Wages for\nUnskilled Worker Ordinance, 1969 (W.P. Ordinance XX of 1969)]\n2\n[(q)   “year”, with respect to insurable employment, means a total of three hundred\nand sixty-five days for which contribution are payable, or, in the case of\ninsured persons who are not paid for weekly holidays, a minimum of three\nhundred and twelve days.]\n__________\n3\n[3. Compulsory insurance.All employees in an industry or establishment shall be insured\nin the manner prescribed by or under this Act.]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Administration. (1) As soon as may be, after the commencement of this Act, the",
      "content": "Federal Government shall establish or nominate by notification an Institution to be called the\nEmployees’ Old-Age Benefits Institution.\n(2) The Institution shall be a body corporate having perpetual succession and a common seal,\nwith powers, subject to the provisions of this Act, to acquire, hold and dispose of property, both\nmovable and immovable, and shall by the aforesaid name sue or be sued."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Nomination of a body corporate pending establishment of an institution. (1)",
      "content": "Notwithstanding anything contained in section 4, the Federal Government may, pending the\nestablishment of an Institution, by notification in the official Gazette, nominate a body corporate\nto exercise and perform all the powers and functions of the Institution under this Act and appoint\nthe head of such body corporate, by whatever name called, to be the 2[Chairman] of the Institution.\n(2) The nomination of a body corporate under sub-section (1) shall be subject to such terms\nand conditions as the Federal Government may, from time to time, determine."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Management.(1) The general direction and superintendence of the affairs of the",
      "content": "Institution shall vest in a Board which may, with the assistance of the 2[Chairman] of the Institution,\nexercise all powers and do all acts and things which may be exercised or done by the Institution.\n(2) In discharging its functions, the Institution shall be guided by such instructions on\nquestions of policy as may be given to it from time to time, by the Federal Government, which\nshall be the sole judge as to whether any instructions are on a question of policy or not.\n1\nOmitted and subs. by Finance Act 7 of 05, s. 5.\n2\nSubs. by the Employees’ Old Age Benefits (Amdt.) Ordinance, 1983 (17 of 1983), ss. 4-6, (w.e.f. 1-7-83).\n3\nSubs. by the Finance Act, 1986 (1 of 1986), s. 11."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Board of Trustees.(1) The Board of Trustees shall consist of the following members to",
      "content": "be appointed by the Federal Government, by notification, namely:\n(a)        the Secretary or Additional Secretary in the Labour Division, who shall also\nbe the 1[President] of the Board of Trustees;\n2\n(b)        [two] persons to represent the Federal Government, one each from the\nMinistries of Finance, 2* * and Labour;\n(c)        four persons to represent the Provincial Governments, one to be nominated by\neach by the Provincial Government;\n(d)        four persons to represent employers;\n(e)         four persons to represent insured persons; and\n2\n(f)            [one] persons to represent the Institution.\n(2) Members to be appointed under clauses (d) and (e) of sub-section (1) shall respectively be\nchosen from a list of names submitted in the prescribed manner by the organisations of employers\nand employees recognised by the Federal Government for that purpose:\nProvided that, pending the making of rules in this behalf, the first members to be so\nappointed shall be chosen from such persons as the Federal Government may deem fit."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Powers and Functions of the Board of Trustees. In addition to the powers",
      "content": "conferred on, and the functions entrusted to it by the other provisions of this Act or by the rules, the\nBoard shall have powers—\n(a)        to approve the budget estimates, the audited accounts and the annual report of\nthe Institution for submission to the Federal Government in accordance with\nthe provisions of this Act; 3*\n(b)        to call for any information or direct any research to be made for the\nfurtherance of the objects of the Act 3[; and]\n3\n[(c)    to co-opt any other technical person by name as member on the Board for the\nspecific purpose and such limited period as decided by the Board.]\n4\n[8A. Appointment, powers and functions of Chairman. —(1) The Chairman of the\nInstitution shall be appointed by the Federal Government for such term and on such terms and\nconditions as it may determine.\n(2) The Chairman of the Institution shall exercise such powers and perform such\nfunctions as may be prescribed.]\n1\nSubs. by the Finance Act, 1986 (1 of 1986), s. 11.\n2\nSubs. and Omitted by Finance Act VII of 05, s. 5.\n3\nOmitted, subs. and added by Ord. 46 of 02, s. 3.\n4\nIns. by the Employees’ Old Age Benefits (Amdt.) Ordinance, 1983 (17 of 1983 ), s. 7 (w.e.f. 1-7-83)."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Rates and assessment",
      "content": "(1) On and from the first day of July, 1976, contributions shall\nbe payable every month by the employer to the Institution in respect of every person in his insurable\nemployment, at the rate of 1[five] percent of his wages in the prescribed manner 2[:]\n3\n*      *       *      *        *    *       *\n4             3\n[Provided [ *] that no contribution shall be payable in respect of an insured person\nwho is in receipt of 5[old-age pension] under this Act or has attained the age of sixty years, or fifty-\nfive years in the case of a woman 3[.]]\n3\n*      *       *        *      *       *      *\n(2) Where an insured person does not receive any wages from the employer for any period,\nthe Institution shall, subject to regulations, determine the amount of wages with reference to which\nthe contributions shall be computed.\n(3) Notwithstanding any agreement to the contrary, the employer shall not deduct from the\nwages of an insured person or otherwise recover from him any portion of 5[employer’s share of\ncontribution].\n3\n*       *        *      *      *      *       *\n6\n[9A. Contribution by Government. The Federal Government may make such contribution\nto the Institution as it may determine from time to time.]\n7\n[9B. Contribution by insured person. — On and from the 1st day of July, 2001 the\ncontribution shall be payable every month by an insured person at the rate of 3[one per cent of the\nwages] in the prescribed manner.]"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Records and returns by employers. Every employer shall keep such records and",
      "content": "shall submit to the Institution such returns, at such times, in such form and containing such\nparticulars relating to persons employed by him, as may be provided in regulations."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Registration of establishments, etc",
      "content": "(1) Every employer shall, before the expiration\nof thirty days from the day on which this Act becomes applicable to the industry or establishment in\nrespect of which he is the employer, communicate to the Institution the name and other\nprescribed particulars of the industry or establishment and of every insured person employed in the\nindustry or establishment.\n(2) Every insured person may also communicate his name and other prescribed particulars to\nthe Institution.\n(3) On receipt of a communication under sub-section (1) or sub-section (2), the Institution\nshall register the name of the industry or establishment or the insured person in such manner, and\nissue to the insured person a registration card in such form, as may be prescribed.\n1\nSubs. by Finance Act I of 08, s. 9 (w.e.f. 1-7-08).\n2\nSubs. Employees’ Old Age Benefits (Amdt.) Ordinance, 1983 (17 of 1983), s. 8 (w.e.f. 1-7-83).\n3\nOmitted and Subs. by Finance Act VII of 05, s. 5.\n4\nSubs. by the Finance Act, 1986. (1 of 1986), s. 11.\n5\nSubs. by Ord. 46 of 02, s. 4.\n6\nSubs. by the Finance Act, 1995, (I of 1995) s 8 for section 9A. which was previously ins. by Act I of 1986, s. 11.\n7\nIns. by Ord. 53 of 2001, s. 2 and Sch.\n1\n[11A. Cancellation of registration of establishments, etc. The Board may, on the basis of\nsuch evidence as the Board may find satisfactory for the purpose, cancel the registration of any\nestablishment or industry which has ceased to exist:\nProvided that the cancellation of the registration of an establishment or industry shall not\naffect its liabilities incurred before the date of such cancellation.]"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Officials of Institution to check employer’s books",
      "content": "(1) Any official of the Institution,\nduly authorised by a certificate in a form specified in the regulations, may, for the purpose of\ninquiring into the correctness of any of the particulars stated in the records or returns referred to in\nsection 10 or for the purpose of ascertaining whether any of the provisions of this Act have been\ncompiled with—\n(a)        require an employer to furnish to him such information as he may consider\nnecessary; or\n(b)         at any reasonable time, enter any establishment or other premises occupied\nby such employer and require any person found in charge thereof to produce\nand allow him to examine such accounts books and other documents relating\nto the employment of persons and payment of wages, or to furnish to him such\ninformation, as he may consider necessary; or\n(c)        examine, with respect to any matter relevant to the purposes aforesaid, the\nemployer, his agent or any other person found in such establishment or other\npremises, or any other person whom the said official has reasonable cause to\nbelieve to be or to have been an insured person 2[.]\n2\n*      *       *       *       *      *       *\n3\n[(2) The official reffered to in sub-section (1) shall not demand production of account book\nand other documents referred to in clause (b) of sub-section (1) for a period of two years from the date\nof registration of the establishment or the 1st day of July, 2005, whichever is later, if the employer\ndoes not reduce the number of insured persons in respect of whom contribution are paid under section\n9:\nProvided that on expiry of two years’ period, if the employer enhances the number of insured\npersons by at least ten percent, it shall be accepted without any question otherwise checking of record\nshall be done as provided in sub-section (1), by an officer not below the rank of Assistant Director,\nduly authorized in this behalf and no question shall be asked about the previous two years.]\n(3) If an employer fails to maintain records or to submit returns as required by the\nregulations, or otherwise fails to comply with the provisions of sub-section (1) and thereby makes it\ndifficult to ascertain the identity of persons required to be insured or the amount of contribution\npayable, the contribution shall be assessed on the basis of such evidence as the Institution may find\nsatisfactory for this purpose 3[in the prescribed manner].\n12A.3*                *           *          *             *   *       *\n1\nIns by the Finance Act, 1986 (1 of 1986) s.11.\n2\nSubs. & Omitted by ord. 46 of 2002, s. 5.\n3\nSubs. added and omitted by Finance Act VII of 05, s. 5"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Increase of unpaid contribution and recovery of contribution etc., as arrears of land",
      "content": "revenue. — (1) If any employer fails to pay, on the due date the contribution payable by him under\nsub-section (1) of section 9, the amount so payable by him shall be increased by such percentage or\namount as may be prescribed :\nProvided that in no case shall such increase exceed fifty per cent of the amount due.\n(2) Without prejudice to any other remedy, the amount of contribution due, together with the\nincrease provided for under sub-section (1), may be recovered as an arrears of land revenue.\n1\n[14. Safeguard of insured person’s right in default of payment of contributions by\nemployer. Notwithstanding anything contained in this Act, if an insured person has communicated\nhis name and other prescribed particulars to the Institution under sub-section (2) of section 11 and\nhas been issued by the Institution a registration card under sub-section (3) thereof and, in case of\nchanging employment from one industry or establishment to another industry or establishment, has\nalso informed the Institution about such change of employment, then, in the event of default in\npayment of contributions by the employer in respect of such insured person, such insured person\nshall have and enjoy the same rights under this Act as if no such default had occurred.]"
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Refund of contributions paid erroneously. An employer shall be entitled to the refund",
      "content": "of any contribution paid to the Institution under erroneous belief that it was payable under the\nprovisions of this Act, and shall be entitled to the refund of excess amount of the contribution where\nsuch contribution had been paid at a higher rate than the rate prescribed:\nProvided that no contribution or excess amount of any contribution shall be refunded unless\nan application for such refund is made within six months of the date on which the contribution was\npaid."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Extinguishment of claims to contributions. Any claims of the Institution for unpaid",
      "content": "contributions shall be extinguished in the manner provided in the regulations.\n___________"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Employees’ Old",
      "content": "Age Benefits Fund.—(1) The Institution shall have its own fund, to be\ncalled the Employees’ Old-Age Benefits Fund and may incur out of the Fund such expenditure as\nmay be necessary for the purposes of this Act.\n(2) All contributions paid under this Act and all other moneys received by or on behalf\nof the Institution shall be paid into the Fund.\n(3) The Institution shall derive its revenues from the following sources—\n(a)        contributions payable under this Act and the rules;\n(b)        all other payments made by the employers under this Act and the\nregulations;\n(c)        income from investment of the moneys of the Institution; and\n(d)        donations and bequests for the purposes of this Act.\n(4) The assets of the Institution shall be utilized solely for the purposes of this Act.\n(5) The moneys of the Institution shall be deposited in such banks as may be approved by the\nBoard for the purpose.\n1\nSubs. by the Employees’ Old Age Benefits (Amdt.) Ordinance, 1983 (17 of 1983), s. 9 (w.e.f. 1783)."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Investment and loans",
      "content": "(1) Subject to rules, the Institution may, from time\nto time, invest any moneys which are not immediately required for expenses under this\nAct, and may reinvest or realise such investment.\n(2) The Institution may, with the previous sanction of the Federal Government and on\nsuch terms as it may specify, raise loans and take measures for discharging such loans."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Budget, accounts and audit",
      "content": "(1) The Institution shall draw up annually a\nbudget showing the anticipated receipts and expenditure during the following year and\nshall submit it to the Board for the approval of the Federal Government.\n(2) The Institution shall maintain accounts of its income and expenditure in such\nform and manner as may be prescribed.\n(3) The books of account of the Institution shall be balanced on the thirtieth of June\neach year and its accounts shall be audited by auditors approved by the Federal Government\nat such time and in such manner as may be prescribed.\n(4) The auditors shall at all reasonable times have access to the books of accounts and\nother documents of the Institution and may, for the purposes of the audit call for such\nexplanation and information as they may require and may examine any principal or other\nofficer of the Institution.\n(5) The auditors shall forward to the Federal Government their report together with\nan audited copy of the accounts of the Institution."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Annual Report. The Institution shall submit to the Federal Government an annual",
      "content": "report of its work and activities.\n1\n[21. The Institution shall, at intervals of not more than three years, have an actuarial\nvaluation made in the prescribed manner of its assets and liabilities and no change in rate of\ncontribution or benefit under this Act shall be made without proper actuarial valuation.]\n____________"
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. 2[Old",
      "content": "age pension].—2[(1)An insured person shall be entitled to a monthly old-age\npension at the rate specified in the Schedule:\nProvided that—\n(a)        he is over 3[sixty] years of age, or 3[fifty-five] years in the case of a women;\nand\n1\nSubs. by Ord. 46 of 02, s. 7.\n2\nSubs. by the Employees’ Old-Age Benefits (Amdt) Ordinance, 1983 (17 of 1983). ss. 2 & 10, (w.e.f. 1-7-83),\n3\nSubs. by the Finance Act, 1986 (I of 1986), s. 11.\n(b)         contribution in respect of him were 1[paid] for not less than fifteen years 2[:]\n3\n[Provided further that the age specified in clause (a) will be reduced by five years in the case\nof an insured person employed in the occupation of mining for at least ten years immediately\npreceding retirement 1[:]]\n1\n[Provided also that where the employee was insured under the provisions of this Act on or\nbefore 30th June 2002, and contributions payable under the Act by the employer prior to 30th June,\n2002, in respect of said insured person had not been paid, the insured person shall enjoy the rights\nunder this Act as if for the word “payable” the word “paid” were not substituted:\nProvided further that where the contribution under section 9B is paid regularly by the insured\nperson himself in accordance with prescribed procedure, his entitlement, to the benefit shall not be\naffected by default in payment of employer’s share of contribution under section 9.]\n(2) If an insured person was on the first day of July, 1976 or is on any day thereafter on\nwhich this Act becomes applicable to an industry or establishment,—\n(i)          over forty years of age, or thirty-five years in the case of a woman, clause\n(b) of sub-section (1) shall have effect as if for the word “fifteen” therein\nthe word “seven” were substituted; or\n(ii)        over forty-five years of age, or forty years in t h e case of a woman, clause\n(b)of sub-section (1) shall have effect as if for the word “fifteen” therein the\nword “five” were substituted 4[:]\n4\n[Provided that nothing in this section shall apply to an employee insured under this Act on\nor after 1st day of July, 2008.]\n3\n[(2A) Notwithstanding anything contained in sub-section (1), an insured person—\n(a)         who was insured under the provisions of this Act on or before the 30th\nJune, 1986, and will attain the age of fifty-five years (fifty years in the case of\na woman) on or before the 30th June, 1991, and\n(b)         in respect of whom contributions were payable to the Institution for the\nperiod required under the provisions of this Act,\nshall be entitled to old-age pension at the age of fifty-five year (fifty years in the case of a\nwoman).\n(2B) An insured person already in receipt of an old-age or invalidity pension, or entitled to\nan old-age pension under the provisions of sub-section (2A), shall be entitled to a minimum pension\nat the rate specified in the Schedule.\n1\nSubs. and added by Ord. 46 of 02, s. 8.\n2\nSubs. by the Finance Act, 1986 (I of 1986), s. 11.\n3\nAdded and Ins., ibid.\n4\nSubs. and added by Finance Act, 2008 (I of 08), s. 9 (w.e.f. 1-07-08).\n(2C) An insured person who retires from insurable employment before attaining the age of\nsixty years (fifty-five years in the case of a woman) but after attaining the age of fifty-five years\n(fifty years in the case of a woman) shall be entitled to a reduced old-age pension on fulfilling\nthe following conditions, namely:—\n(a)        the Institution is satisfied through documentary evidence that the employer\nhas a definite established retirement age of less than sixty years (fifty-five\nyears in the case of a woman);\n(b)        the employer certifies that the insured person has been retired by him on\nattaining the age of superannuation; and\n(c)        the contributions in respect of him were 1 [paid] for the period required under\n(2D) The old age pension shall be reduced by one-half per cent of the old-age pension\nspecified in the Schedule for each completed month by which the age falls short of sixty years\n(fifty-five years in the case of a woman) and the minimum old age pension shall also be reduced in\nthe aforesaid manner in the case of retirement from insurable employment before attaining the age\nof sixty years (fifty-five years in the case of a woman).\n(2E) The reduction in old-age pension specified in sub-section (2D) shall be for life and shall\nnot be restored on the insured person’s attaining the normal pension age.]\n(3) Subject to regulations, the 2 [old-age pension] shall commence as from the month\nfollowing that in which the insured person satisfies the condition for entitlement thereto, provided\nthat no allowance shall be payable retroactively for more than six months preceding the month in\nwhich an application for 2[old-age pension] is submitted.\n(4) Insurable employment of a person for the purposes of this Act shall commence on the\ndate from which the first contribution in respect of him becomes payable.\n(5) The 2[old-age pension] payable to an insured person shall be terminated at the end of the\nmonth in which the death of such person occurs.\n3\n*       *      *        *     *      *      *\n4\n[22A. Old-age grant. If an insured person, not otherwise entitled to old-age pension, retires\nfrom insurable employment after attaining the age of sixty years, or fifty-five years in the case of a\nwoman and a mine workers, and contributions in respect of him were 1[paid] for less than fifteen\nyears, but not less 5[than two] years, he shall be entitled to an old-age grant 1[paid] in a lump sum\nequal to his one month’s average monthly wages for every completed year of insurable employment\nor part thereof in excess of six months 1[:]\n1\nSubs. by Ord. 46 of 02, ss. 8 and 9.\n2\nSubs by Employees’ Old-Age Benefits (Amdt) Ordinance. 1983 (17 of 1983), s. 2. (w.e.f. 1-7-83).\n3\nOmitted by the Finance Act, 1986 (I of 1986), s. 11.\n4\nSubs. ibid.\n5\nSubs. by the Labour Laws (Amdt.) Act 1994. (11 of 1994), Sr. no.8 of Sch., for “than five”.\n1\n[Provided that where the employee was insured under the provisions of this Act on or before\n30th June, 2002, and contributions payable under the Act by the employer prior to 30th June,\n2002, in respect of said insured person had not been paid, the insured person shall enjoy the rights\nunder this Act as if for the word “payable” the word “paid” were not substituted:\nProvided further that where the contribution under section 9B is paid regularly by the insured\nperson himself in accordance with prescribed procedure, his entitlement to the benefit shall not be\naffected by default in payment of employer’s share of contribution under section 9.]"
    },
    {
      "provision_ref": "sec22b",
      "section": "22B",
      "title": "Section 22B. Survivors’ pension",
      "content": "(1) In the case of the death of an insured person while in\ninsurable employment but after he had completed not less than thirty six months insurable\nemployment, the surviving spouse, if any, shall be entitled to a life pension 2[at the rate specified in\nthe Schedule.]\n3\n[(1A) In the case of the death of an insured person, while not in insurable employment but\nafter he had completed five years insurable employment, the surviving spouse, if any, shall be\nentitled to a life pension 2[at the rate specified in the Schedule.]]\n(2) In the case of the death of an insured person who had become entitled to old-age pension\n4\n[or invalidity pension], before his death, the surviving spouse shall, if the spouse had married the\ndeceased person before he had attained the minimum age prescribed for old-age pension 4[or\ninvalidity pension], receive a life pension 5[equal to] the pension of such person.\n6\n[(3) In the case of death of the surviving spouse in receipt of survivor’s pension, the\nminor children of the deceased insured person, if any, shall be entitled to the survivors; pension, in\nthe following equal shares, namely :\n(i)         in case of a male child, until he attains eighteen years of age, and\n(ii)       in case of a female child, until she attains eighteen years of age or until\nmarriage, whichever is earlier.\n(3A) In the case of cessation of survivor’s pension of any of the children of the deceased\ninsured person on his attaining the age of eighteen years or marriage in case of female, or death, as\nthe case may be the share of survivor’s pension received by such child shall be distributed\nequally among the rest of the minor children of the deceased insured person.\n1\nadded by Ord. 46 of 02, s.9.\n2\nSubs. by Finance Act IV of 07, s. 12 (w.e.f. 1-7-07)\n3\nNew sub-section (1A) ins. by the Labour Laws (Amdt.) Act 1994, (II of 1994) s. 8 and Sch.\n4\nThe certain words ins. ibid.\n5\nSubs. ibid., for “of sixty per cent of”.\n6\nSubs. ibid., for sub-section (3).\n(3B) In the case of death of the surviving spouse in receipt of a survivor’s pension\nwithin five years after the death of the insured person and not survived by any minor child of\nthe deceased insured person, the survivor’s pension shall be paid to the surviving parents of\nthe deceased insured person, if any, for a period of five years from the death of the said\nspouse.].\n1\n[(4) In the case of death of an insured person who is not survived by a spouse, the\nsurvivors’ pension shall be paid to the minor children of the deceased insured person\nreferred to in sub-section (3) and sub-section (3A), and in the case of the insured person not\nsurviving by any minor child, the survivor’s pension shall be paid to the surviving parents\nof the deceased insured person, if any, for a period of five years from the death of the\ninsured person.]]"
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. 2 [ Invalidity pension]",
      "content": "(1) An insured person who sustains invalidity shall be\nentitled to 2[invalidity pension] at the rate 3[to be calculated according to the formula set out in the\nschedule] provided that—\n(a)        contribution in respect of him were 4[paid] for not less than fifteen years ; or\n(b)        contributions in respect of him were 4[paid] for not less than five years since\nhis entry into insurable employment and for not less than three years during\nthe period of five years preceding the month in which he sustains invalidity ;\nand\n(c)  in either case, he is under 5[sixty] years of age, or 5[fifty-five] years in the case\nof woman 4[:]\n4\n[Provided that where the employee was insured under the provision of this Act on or before\n30th June 2002, and the contribution payable under the Act by the employer prior to 30th June\n2002, in respect of said insured person had not been paid, the insured person shall enjoy the rights\nunder this Act as if for the word “payable” the word “paid” were not substituted in clause (a)\nand (b):\nProvided further that where the contribution under section 9B is paid regularly by the insured\nperson himself in accordance with prescribed procedure, his entitlement to the benefit shall not be\naffected by default in payment of employer’s share of contribution under section 9.]\n(2) Subject to regulations the 2[invalidity pension] shall be payable from the month following\nthat in which the insured person satisfies the conditions for entitlement thereto :\nProvided that the 2[invalidity pension] shall not be 4[paid] retoactively for more than six\nmonths preceding the month in which an application for the 2[invalidity pension] is\nsubmitted.\n1\nSubs. sub-section (4) by the Labour Laws (Amdt.) Act 1994, (II of 1994) s. 8 and Sch.\n2\nSubs. by the Employees’ Old-Age Benefits (Amdt.) Ordinance, 1983 (17 of 1983), s. 2 (w.e.f. 1-7-83).\n3\nSubs. ibid., s. 12 (w.e.f. 1-7-83).\n4\nSubs. and added by Ord. 46 of 02, s.10.\n5\nSubs. by the Finance Act, 1986 (1 of 1986) s. 11.\n(3) The 1[invalidity pension] shall be 2[paid] so long as invalidity continues:\nProvided that an insured person who has been in receipt of the 1[invalidity pension] for not\nless than five continuous years or attains the age specified in clause (a) of sub-section (1) of section\n22 shall be entitled to the 1[invalidity pension] for life.\n_______________"
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Calculation of qualifying contribution periods. In calculating the contribution periods",
      "content": "for entitlement to a benefit under this Act, periods in respect of which 1[invalidity pension] has been\npaid to an insured person prior to his reaching the age of 3[sixty] years, or 3[fifty-five] years in the\ncase of woman, or periods in respect of which maternity benefit, or sickness benefit or injury benefit\nor total disablement pension have been paid under the West Pakistan Employees’ Social Security\nOrdinance, 1965(W.P. Ordinance No. X of 1965), to an insured person shall be deemed to be\ncontribution periods to such extent as may be provided by regulations."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Benefit claims and payments",
      "content": "(1) All claims for a n a l l o w a n c e under this Act\nshall be made in writing and shall be accompanied by such documents, information and evidence as\nto entitlement as may be provided, by regulations.\n(2) Payment of a n a l l o w a n c e shall be made in such manner, and at such times and\nplaces, as may be provided by regulations."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Extinguishment of benefits. A right to the 1[any benefit] shall stand extinguished where",
      "content": "a claim therefor is not made within twelve months of the date on which the allowance becomes\npayable 4[:]\n4\n[Provided that the Institution may condone the delay and admit the claim if it is satisfied\nthat the delay was caused for reasons, beyond the control of the insured person or the 3[survivor].]\n1\n[27. Suspension of old-age pension and 3[survivor’s pension]. Subject to regulations,\npayment of old-age pension and 3[survivor’s pension] shall be suspended when and so long as\nthe insured person or the 3[survivor] entitled to it is absent from Pakistan, except where the\nregulations provide otherwise.]"
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Non",
      "content": "duplication of allowance.—(1) An insured person shall not be paid for the same\nperiod more than one of the 1[benefit] provided for in this Act.\n(2) Where an insured person is entitled to more than one allowance under this Act, he shall be\ngiven the higher of such 1[benefit].\n_____________________________________________________________________\n1\nSubs. by the Employees’ Old-Age Benefits (Amdt.) Ordinance, 1983 (17 of 1983), ss. 2, 13 and 14 (w.e.f. 1-7-83).\n2\nSubs. by Ord. 46 of 2002, s.10.\n3\nSubs. by the Finance Act, 1986 (1 of 1986) s. 11.\n4\nSubs. and added by the Employees’ Old-Age Benefits (Amdt.) Ordinance. 1983 (17 of 1983), s. 13 (w.e.f. 1-7-83).\n(3) Where an insured person is entitled to a n a l l o w a n c e under this Act and to a\ndisablement pension under the West Pakistan Employees’ Social Security Ordinance; 1965(W.P.\nOrdinance No. X of 1965) he shall be given the higher of the two.\n(4) The 1[invalidity pension] shall not be payable to an insured person so long as he receives\nOrdinance No. X of 1965)."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. 1 [ Benefit] not attachable, chargeable or assignable. A n a l l o w a n c e payable",
      "content": "under this Act shall not be liable to attachment in the execution of a decree, not shall it be\nchargeable or assignable; and any agreement to charge or assign a n a l l o w a n c e shall be void,\nand on the bankruptcy of an insured person, the allowance payable to him shall not pass to any\ntrustee or person acting on behalf of his creditors."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Repayment of allowance improperly received",
      "content": "(1) When a person has received any\nallowance under this Act to which he is not lawfully entitled, he shall be liable to repay to the\nInstitution the amount of the allowance in such manner as may be provided by regulations :\nProvided that the Institution may waive repayment of a n a l l o w a n c e where payment\nthereof was not due to misrepresentation on the part of the insured person receiving it and the\nrepayment would cause undue hardship to him.\n(2) Sums due to the Institution by virtue of the foregoing sub-section may be recovered by\ndeduction from a n a l l o w a n c e payable under this Act."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Institution’s right to be indemnified in certain cases. Where the contingency for",
      "content": "which a n a l l o w a n c e is payable under this Act was caused under circumstances creating a legal\nliability in some person, the Institution shall be entitled to substitute itself for the insured\nperson in bringing a suit for damages against that person."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Recovery of amounts due. Any amount recoverable under this Chapter may be",
      "content": "recovered as an arrear of land revenue.\n__________"
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Decisions on complaints, questions and disputes. If any complaint is received or any",
      "content": "question or dispute arises as to—\n(a)        whether a person is an insured person within the meaning of this Act;\n(b)        the amount of wages of an insured person for the purposes of this Act;\n(c)        the amount of contribution payable by an employer in respect of an insured\nperson;\n(d)        the person who is the employer in respect of an insured person;\n2\n[(e)   entitlement to any benefit under this Act or as to the amount and duration\nthereof;]\n1\nSubs. by the Employees’ Old-Age Benefits (Amdt.) Ordinance. 1983 (17 of 1983), s. 2 (w.e.f. 1-7-83).\n2\nSubs, ibid. s.15 (w.e.f. 1-7-83), for “Clause (e)”.\n1\n[(ee) registration of an industry or establishment; or]\n(f)       any other matter in respect of any contribution or any allowance referred to in\nclause (e), or dues payable or recoverable under this Act relating to\ncontributions Or the aforesaid 2[benefit]\nthe matter shall be decided by the Institution, in such manner, and within such time, as the\nregulations may provide and the Institution shall notify its decision to the person concerned in\nwriting, stating therein the reason for its decision."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Review of decisions. The Institution may, subject to regulations, on new facts being",
      "content": "brought to its notice, review a decision given by it under section 33:\nProvided that no decision shall be so reviewed without giving the person concerned an\nopportunity of being heard and adducing evidence in support of, or against, the decision, as the\ncase may be."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Appeal to Board. Subject to rules, a person aggrieved by a decision of the",
      "content": "Institution under section 33 or on a review under section 34, may appeal to the Board."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Assessment of invalidity. The Institution shall appoint medical boards which shall,",
      "content": "in such manner as may be provided by regulations, assess the degree of invalidity sustained by an\ninsured person.\n_________"
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Offences. If any person",
      "content": "(a)        for the purpose of obtaining a n a l l o w a n c e or denial of any payment or\nallowance, under this Act, whether for himself or some other person, or for the\npurpose of avoiding any payment to be made by himself or any other person\nunder this Act—\n(i)        knowingly makes or causes to be made false statement or false\nrepresentation ; or\n(ii)        produces or furnishes, or causes or knowingly allows to be produced\nor furnished, any document or information which he knows to be\nfalse in any material particular; or\n(b)        fails to pay any contribution which under this Act he is liable to pay; or\n1\nIns. by the Employees’ Old-Age Benefits (Amdt.) Ordinance. 1983 (17 of 1983), s. 15, (w.e.f. 1-7-83).\n2\nSubs. ibid., s. 2, (w.e.f. 1-7-83).\n(c)        recovers or attempts to recover from an insured person, or deducts or attempts\nto deduct from his wages the whole or any part of the 1 [ employers share\nof contribution]; or\n(d)        fails or refuses to submit any return required by this Act, or regulations or\nmakes a false return; or\n(e)        obstructs any official of the Institution in the discharge of his duties; or\n(f)        is guilty of any contravention of, or non-compliance with, any of the\nprovisions of this Act or the rules or the regulations;\nhe shall be punished with imprisonment for a term which may extent to two years, or with\nfine which may extent to ten thousand rupees, or with both."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Prosecution. (1) No prosecution under this Act shall be instituted except with the",
      "content": "previous sanction of the Federal Government or any officer or authority authorised in this behalf by\nit.\n(2) No court inferior to that of a Magistrate of the first class shall try any offence under\nthis Act.\n(3) No court shall take cognizance of any offence under this Act except on a complaint made\nin writing within six months of the date on which the offence comes to the knowledge of the Federal\nGovernment or an officer or authority referred to in sub-section (1).\n______________"
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Contributions, etc. In any proceedings of insolvency against a person or proceedings for",
      "content": "winding up of a company, any contribution or other amount payable under this Act by such person\nor company shall be deemed to be included among debts to be paid in priority to all other debts."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Exemption from stamp duty. Stamp duty shall not be chargeable upon any documents",
      "content": "used in connection with 2[benefit] payable under this Act."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Exemption from taxes. Notwithstanding anything contained in any other law, the",
      "content": "Federal Government may, by order in writing, exempt the Institution from any tax, duty, or rate\nleviable by the Federal Government or by a local authority under the control of the Federal\nGovernment."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Member and servants of the Institution to be public servants. The members and",
      "content": "employees of the Board and all officers and servants of the Institution shall be deemed to be public\nservants within the meaning of section 21 of the Pakistan Penal Code (Act XLV of 1860).\n1\nSubs. by Ord. 46 of 2002, s.11.\n2\nSubs. by the Employees’ OldAge Benefits (Amdt.) Ordinance, 1983 (17 of 1983). s. 2 (w.e.f. 1783)."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Delegation of powers. The Board may direct that all or any of its powers and functions",
      "content": "may, in relation to such matters and subject to such conditions, if any, as may be specified, be also\nexercisable by any, officer or authority subordinate to the Institution."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Power to make rules",
      "content": "(1) The Federal Government may, subject to the condition of\nprevious publication, by notification in the official Gazette, make rules 1to carry out the purposes of\nthis Act.\n(2) In particular, and without prejudice to the generality of the foregoing power, such rules\nmay provide for all or any of the following matters, namely:—\n(i)        the tenure of office of members of the Board, other than the 2[President], and\nother terms and conditions of appointment of the members of the Board and\nthe manner in which the Board shall conduct its business, including the\nnumber of members required to form a quorum at the meetings thereof;\n(ii)       the manner in which names of persons from whom member of the Board may\nbe appointed shall be submitted by organisations of employers and employees\nrecognised by the Federal Government for that purpose;\n(iii)      powers and functions of the Board;\n(iv)       fees and 3[a benefit] of the members of the Board;\n(v)        times and rates at which, and conditions subject to which, contributions shall\nbe payable;\n(vi)       percentage or amount by which contributions in arrears may be increased\nunder section 13;\n(vii)      investment of surplus moneys, realisation of investments and reinvestment of\nproceeds;\n(viii)     terms at which and the manner in which the budget of the Institution shall be\nprepared and submitted to the Federal Government;\n(ix)       the forms and manner in which the Institution shall keep accounts of its\nincome and expenditure and of its assets and liabilities;\n(x)        the times at which, and the manner in which, the accounts of the Institution\nshall be audited;\n1\nFor the Employees’ Old:Age Benefit (Contributions) Rules, 1976, see S.R.O. No. 802(I)/76, dated 9-8-1976, vide Gaz., of P., 1976, Ext.\n(Islamabad) Pt. II, page 1642. For the Employees’ Old-Age Benefits (Registration of Employees and Insured Persons) Rules, 1976, see S.R.O.\nNo. 709(I)/76 dated 12-7-76, ibid., page 1427; and for Employee’s Old-Age Benefits (Board of Trustees) Rules, 1977, see S.R.O. No. 438(l)/77. dated\n12-5-77. ibid.. Pages 849—853 ; and for the Employees’ Old-Age Benefits (Audit and Accounts) Rules. 1977, see S.R.O. No. 349(I)77, dated 19-3-"
    },
    {
      "provision_ref": "sec44a",
      "section": "44A",
      "title": "Section 44A. ibid",
      "content": "2\nSubs. by Ord. 46 of 02, s. 12.\n3\nSubs. by the Employees’ OldAge Benefits (Amdt.) Ordinance, 1983 (17 of 1983). s. 2 (w.e.f. 1783).\n(xi)      the matters which the annual report of Institution shall cover;\n(xii) the times in which claims for a n a l l o w a n c e shall be made;\n(xiii) the manner and procedure for disposal of appeals by the Board; and\n(xiv)       any other matter which is required to be or may be prescribed."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Power to make regulations",
      "content": "(1) The Board may subject to the condition of previous\npublication, by notification in the official Gazette, make regulations not inconsistent with the\nprovision of this Act or the rules.\n(2) In particular, and without prejudice to the generality of the foregoing power, such\nregulation may provide for all or any of the following matters, namely:—\n(i)        the time and places at which meetings of the Board shall be held;\n(ii)       the manner in which daily wages shall be calculated for the purpose of\ndetermining the contribution payable;\n(iii)      determination of wages for computation of contributions where the mode of\npayment of remuneration, in cash or kind, makes such computation difficult;\n(iv)       records to be kept and returns to be submitted by employers, time at which and\nthe form in which such returns are to be submitted, and particulars relating to\nbe insured persons to be stated in such returns and the manner and form for\nregistration of employers and insured persons;\n(v)        the manner in which any claims of the Institution for unpaid contributions may\nbe extinguished;\n(vi)       powers and duties of internal auditors;\n1\n*      *           *         *      *       *   *\n(viii)     the form and manner in which claims for a n a l l o w a n c e shall be\npreferred, and the documents, information and evidence which shall\naccompany such claims:\n(ix)       the manner in which and the time and places at which payment in respect\nof a n a l l o w a n c e shall be made;\n(x)        the manner in which and the time within which complaints questions and\ndisputes shall be decided;\n(xi)       circumstances and the manner in which, on new facts coming to light, the\nInstitution may review decisions;\n(xii)      the method of payment of contributions and liability thereof;\n1\nOmitted by the Finance Act. 1986 (1of 1986) s. 11.\n(xiii) the manner in which invalidity shall be assessed and the procedure thereof;\n(xiv) the manner in which proof of age shall be furnished for the purposes of this Act;\n(xv) the manner in which the services of the Institution shall be organised; and\n(xvi) any other matter not provided for in this Act or the rules and necessary to give\neffect to the provisions of this Act."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Power to exempt. The Federal Government may, subject to such conditions as it thinks",
      "content": "fit to impose, by notification in the official Gazette, exempt any establishment or industry from all or\nany of the provisions of this Act."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Act not to apply to certain persons. Nothing in this Act shall apply to",
      "content": "(a)        persons in the service of the State, including members of the armed forces,\npolice force and Railway servants;\n(b)        persons in the service of a local council, a municipal committee, a cantonment\nboard or any other local authority;\n(c)         persons who are employed in services or installations connected with or\nincidental to the Armed Forces of Pakistan including an ordnance factory\nmaintained by the Federal Government or Railway administration;\n(c)        persons in the service of Water and Power Development Authority;\n1\n*         *       *      *       *       *      *\n(f)        persons in the service of statutory bodies other than those employed in or in\nconnection with the affairs of a factory 2[as defined in] section 20 (j) of the\nFactories Act, 1934 (XXV of 1934) 2[or a mine as defined in the] Mines Act\n(IV of 1923), 1923:\nProvided that workshops maintained exclusively for the purposes of\nrepair or maintenance of equipment or vehicles used in such statutory bodies\nshall not be treated as factories for the purposes of this clause;\n(g)        members of the employer’s family 2[,that is to say, the husband or wife and\ndependent children of the employer.] living in his house, in respect of\ntheir work for him; and\n3\n*       *         *          *          *          *           *"
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. [Repeal.] Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981",
      "content": "(XXV/I of 1981), s. 3 and Sch., II.\n1\nOmitted by Finance Act I of 08, s.9 (w.e.f. 1-7-08).\n2\nSubs. & Ins. by the Employee’s Old-Age Benefits (Amdt.) Ordinance 1983 (17 of 1983), s. 16.\n3\nOmitted by the Finance Act, 1986 (I of 1986), s. 11.\n1\n[SCHEDULE\n(See sections 22 2[22-B] and 23)\n(1) The monthly rate of old-age pension or invalidity pension payable to an insured person\n2\n[and surviors’s pension payable to surviving spouse] shall be calculated in accordance with the\nfollowing formula, namely:—\n2\n* monthly wages x Number of years of insurable employment.\nA period of six months or more of insurable employment shall be treated as one full year. No\naccount shall be taken of any period of insurable employment completed by the insured person after\nbecoming entitled to old-age pension.\n3\n[(2) The monthly wages of an insured person, referred to in paragraph (1), shall be\ncalculated on the basis of wages on which contributions were paid in respect of the twelve calendar\nmonths immediately preceding the date on which the insured person fulfils the conditions for\nentitlement to any benefits under this Act:\nProvided that the old-age pension or invalidity pension payable to an insured person and\nsurvivor’s pension payable to the survivors of the deceased insured person shall not be less than two\nthousands rupees per month for pension commencing on or after 1st day of July, 2008.]\n2\n[(3) The monthly rate of old-age pension, invalidity pension and survivors pension being\npaid on or before first day of July, 3[2008], under paragraph (1) shall be increased by fifteen per\ncent.]]\n________________\n1\nSch. added by Ordinance, 17 of 1983, s. 17 have been subs. by Act I of 1986, s. 11.\n2\nAdded, ins. & omitted by Finance Act IV of 07, s. 12 (w.e.f. 1-7-07).\n3\nSubs. by Finance Act I of 08, s. 9 (w.e.f. 1-7-08)."
    }
  ],
  "definitions": [
    {
      "term": "contribution",
      "definition": "the sum of money payable to the Institution by the employer 3[or by the Federal Government] in respect of an insured person under the provisions of the Act; 1 [(bb) “employee” means any person employed, whether directly or through any other person, for wages or otherwise, to do any skilled or unskilled, supervisory, clerical, manual or other work in, or in connection with the affairs of, an industry or establishment, under a contract of service or apprenticeship, whether written or oral express or implied, and includes such person when laid off ;] 4[:] 5 * * * * * * * 6 Provided * that a director of a limited company or of a corporation set up under any law shall not be treated as an employee under this Act, irrespective of his wages or emoluments.] ; 7 [(c) ‘employer’, in relation to an industry or establishment, means any person who employs, either directly or through any other person, any employee, and includes  (i) in the case of an individual, an heir, successor, administrator or assign; (ii) a person who has ultimate control over the affairs of an industry or establishment, or where the affairs an industry or establishment are entrusted to any other person (whether called a managing agent, managing director, manager, superintendent, secretary or by any other name), such other person; and 3 * * * * * * *",
      "source_provision": "sec2"
    },
    {
      "term": "employment injury",
      "definition": "a personal injury to an insured person caused by an accident, or by such occupational disease as may be specified in the regulations, arising out of and in the course of his employment; 1 Re-numbered and ins. by the Employees’ Old Age Benefits (Amdt.) Ordinance, 1983 (17 of 1983), s. 4 (w.e.f. 1-7-83). 2 Subs. by Ord. 46 of 02, s. 2. 3 Ins. and Omitted by the Finance Act, 1986 (1 of 1986), s. 11. 4 Added, ibid. 5 Proviso omitted by the Labour Laws (Amdt.) Act, 1994 (11 of 1994), s. 8 and fourth Sch. 6 The word “further” omitted ibid. 7 Subs. by Ord. 17 of 1983, s. 4, (w.e.f. 1-7-83). 1 [(e) “establishment” means- (i) an establishment to which the West Pakistan shops and Establishments Ordinance, l969 (West Pakistan Ordinance No. VIII of 1969) for the time being applies, and, notwithstanding anything contained in section 5 thereof, includes clubs, hostels, organisations and messes not maintained for profit or gain and establishments, including hospitals, for the treatment or care of sick, infirm, destitute or mentally unfit persons; (ii) a construction industry as defined in the West Pakistan Industrial and Commercial Employment (Standing Orders) Ordinance, 1968 (West Pakistan Ordinance No. VI of 1968); (iii) a factory as defined in the Factories Act, 1934 (XXV of 1934); (iv) a mine as defined in the Mines Act, 1923(IV of 1923); (v) a road transport service as defined in the Road Transport Workers Ordinance,1961 (XXVIII of 1961) ; and includes any class of industries or establishments which the Federal Government may, by notification in the official Gazette, declare to be establishments for the purposes of this Act,];",
      "source_provision": "sec2"
    },
    {
      "term": "fund",
      "definition": "the Employees’ Old-Age Benefits Fund set up under section l7 ;",
      "source_provision": "sec2"
    },
    {
      "term": "industry",
      "definition": "any business, trade, undertaking, manufacture or calling of employers, and includes any calling, service, employment, handicraft industrial occupation or a vocation of workmen ;",
      "source_provision": "sec2"
    },
    {
      "term": "institution",
      "definition": "the Employees’ Old-Age Benefits Institution established or nominated under section 4 1[or section 5];",
      "source_provision": "sec2"
    },
    {
      "term": "insured person",
      "definition": "2 [an employee] who is or was in insurable employment;",
      "source_provision": "sec2"
    },
    {
      "term": "insurable employment",
      "definition": "employment of a person under a contract of service or apprenticeship, whether written or oral, express or implied and in respect of which contributions are payable under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "invalidity",
      "definition": "a condition, other than that caused by an employment injury, as a result of which an insured person is permanently incapacitated to such an extent as to be unable earn from his usual or other occupation more than one third of the normal rates of earning in his usual occupation ; (1) “member” means a member of the Board ;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules ;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made by the Board ;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act; 1 Subs. and Added by the Employees’ Old Age Benefits (Amdt.) Ordinance, 1983 (17 of 1983), s. 4, (w.e.f. 1-7-83). 2 Subs. by the Finance Act, 1986 (1 of 1986), s. 11. (oa) 1* * * * * * * 1 [(p) “wages” means the rates of wages as declared under the Minimum Wages for Unskilled Worker Ordinance, 1969 (W.P. Ordinance XX of 1969)] 2 [(q) “year”, with respect to insurable employment, means a total of three hundred and sixty-five days for which contribution are payable, or, in the case of insured persons who are not paid for weekly holidays, a minimum of three hundred and twelve days.] __________ 3 [3. Compulsory insurance.All employees in an industry or establishment shall be insured in the manner prescribed by or under this Act.]",
      "source_provision": "sec2"
    }
  ]
}
