{
  "id": "pk-employment-record-of-services-act-1951",
  "type": "statute",
  "title": "Employment (Record of Services) Act, 1951",
  "title_en": "Employment (Record of Services) Act, 1951",
  "short_name": "EOSA",
  "status": "in_force",
  "issued_date": "1952-04-17",
  "in_force_date": "1952-04-17",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap%2BYZA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Employment (Record of Services) Act, 1951 (XIX of 1952) published by The Pakistan Code (Service Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, application and commencement",
      "content": "_(1) This Act may be called the\nEmployment (Record of Services) Act, 1951.\n2\n[(2) It extends to the whole of Pakistan.]\n(3) It applies to all persons concerned as employers or employees in such classes of\nemployment and in such areas as the 3[Provincial Government] may specify by notification in this\nbehalf.\n(4) It shall come into force on such date as the 3[Provincial Government] may, by notification\nin the official Gazette, appoints."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "_\n3\n[*      *          *           *          *          *          *]\n(b)        “employee” means a person to whom this Act applies engaged for hire or for\nany other pecuniary consideration by an employer, or an apprentice;\n(c)        “employer” means any person to whom this Act applies engaging the services___\nmanual or clerical, skilled or unskilled___of another for hire or for any other\npecuniary consideration or an apprentice for the purpose of carrying on his\ncalling, trade, business, undertaking or manufacture or for personal or domestic\nservice and includes any body of persons whether incorporated or not and any\nmanaging agent of any employer;\n1\nThe Act has been extended to__\n(i) the Baluchistan States Union, by the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G.G.O. 4 of 1953).\n(ii) the State of Bahawalpur by the Bahawalpur (Extension of Federal Laws) Order, 1953 (G.G.O. 11 of 1953) ; and\n(iii) Khairpur State, by the Khairpur (Federal Laws) (Extension) Order, 1953 (G.G.O. of 5 of 1953).\nThe Act has been and shall be deemed to have been brought into force in Gwadur (with effect from the 8th September, 1958), by the Gwadur (Application\nof Central Laws) Ordinance, 1960 (37 of 1960), s. 2.\nThe Act has been brought into force throughout the Province of West of Pakistan (with effect from the 15th August, 1961), see Gazette of West Pakistan,\n1961, Ext., p. 1855.\nThis Act has been applied to certain classes of employment throughout the Province of West Pakistan see Gazette of West Pakistan, 1961, Ext, p. 1855.\nThe Act has been applied to the Provincially Administered Tribal Areas or to the parts or those areas to which it does not already apply, see Regulation\nNo. 1 of 1972, s. 2 and Sch.\n2\nSubs. by the Central Laws (Statute Reform) Ordinance No XXI of 1960, s. 3 and 2nd Sch.\n3\nSubs. and omitted by A.O., 1964, Art. 2 and Sch.\n(d)        “Labour Commissioner” means the officer so designated and appointed by the\n1\n[Provincial Government];\n(e)        “prescribed” means prescribed by rules made under this Act; and\n(f)        “wages” has the same meaning as in the Payment of Wages Act, 1936 (IV of\n1936)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Exemptions. The 1[Provincial Government] may exempt from the provisions of this Act any",
      "content": "establishment or undertaking where records of service are maintained to the satisfaction of the\nGovernment."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Service book to be produced by employee",
      "content": "_(1) Before engaging an employee the\nemployer shall require from him his service book, if he asserts that he has been previously in\nemployment under any other employer and the employee shall produce the service book if he has one.\n2\n[(2) If the employee has no service book, the employer shall, at his own cost, provide one and\nkeep it with himself.]\n(3) The service book 2[if any, produced by the employee under subsection (1)] shall be kept by\nthe employer, who shall give the employee a receipt therefor in the prescribed form.\n(4) Nothing in this section shall prevent an agreement between the employee and the employer\nwhereby it is provided that the employee shall keep and maintain a duplicate of his service book.\n(5) The employer shall hand over service book to the employee on the termination of the\nemployee’s service with the employer, except where the 2[employee] has kept and maintained a\nduplicate of his service book.\n2\n[(6) If the service book handed over to the employee under sub-section (5), or the duplicate\nthereof maintained by him, is lost by him, the employer shall provide him with a duplicate service\nbook and may charge him the prescribed price.]"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Form of the service book. The service book shall be of the size and in the form as may be",
      "content": "prescribed and a passport size photo of the employee if a male shall be affixed to it. The service book\nshall contain particulars of identification of the employee, the name and other particulars of the persons\nunder whom employed from time to time, period of employment, occupation, rate of wages including\nallowances, if any, leave taken and records of conduct and efficiency by employers."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Entries in the service book. The employer shall at the commencement of the employment",
      "content": "and during the continuance of the same make such entries therein from time to time as are required by\nthis Act and the rules made thereunder and he and the employee shall sign the entries as they are made."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power of Inspection. The Labour Commissioner or an officer authorised by him in writing",
      "content": "may by written notice require an employer or an employee to produce the service book or the duplicate\nservice book or any other paper or document which he may have reason to believe contains the\nparticulars noted in the service book and thereupon the employer or the employee, as the case may be,\nshall comply if he is in possession of the said book, paper or document.\n1\nSubs. by A.O., 1964, Art. 2 and Sch.\n2\nSubs., ins and added by Ordinance No. XVIII of 1960, s. 2."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Penalty. Any breach of the provisions of this Act or the rules made thereunder shall be",
      "content": "punishable in the case of an employer with fine which may extend to fifty rupees, and in the case of\nan employee with a fine which may extend to five rupees, and for the purposes of this section any\nfailure or refusal to comply with a requirement duly made by a person empowered under this Act or\nunder the rules made thereunder to make it shall be deemed to be a breach of the said provisions."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Cognizance of offences. No court shall take cognizance of an offence punishable under this",
      "content": "Act unless previous sanction for prosecution has been accorded on the prescribed form by the Labour\nCommissioner and except upon complaint by any public servant or by a person authorised in this behalf\nby the Labour Commissioner in writing on the said form."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Prosecution. Any infringement of or refusal or omission to carry out the provisions of this",
      "content": "Act or the rules made thereunder by any person may be reported to the Labour Commissioner or to\nany other officer appointed in this behalf by him by an order in writing for such local limits as may be\nassigned in the order, for sanction of prosecution or for such other action as he may deem proper to\ntake."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Protection of action taken under the Act. No suit, prosecution or legal proceeding shall",
      "content": "lie against any person in respect of anything in good faith done or intended to be done under this Act\nor the rules made thereunder."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to make rules",
      "content": "_ (i) The 1[Provincial Government] may after previous publication,\nmake rules for carrying into effect the purposes of this Act.\n(ii)   In particular and without prejudice to the generality of the foregoing power such rules may\nprovide for___\n(a)        the form of the service book and the particulars to be entered therein ;\n(b)        the quality of paper and covering page of the service book;\n(c)        the number of pages of the book;\n(d)        the time within which any entry in the service book shall be made and the\noccasions on which a fresh entry shall be made;\n(e)        the authorisation of persons to manufacture and sell service books and\nprescribed forms;\n(f)        the procedure at any investigation and for proceeding before the grant of\nsanction for prosecution by the Labour Commissioner;\n(g)        the persons and class of public servants who may be authorised by the Labour\nCommissioner to make complaints under this Act, and\n(h)        the manner of calculation of monthly wages.\n______________\nRGN Date: 22-05-2024\n1\nSubs. by A.O., 1964, Art. 2 and Sch."
    }
  ],
  "definitions": [
    {
      "term": "employee",
      "definition": "a person to whom this Act applies engaged for hire or for any other pecuniary consideration by an employer, or an apprentice;",
      "source_provision": "sec2"
    },
    {
      "term": "employer",
      "definition": "any person to whom this Act applies engaging the services___ manual or clerical, skilled or unskilled___of another for hire or for any other pecuniary consideration or an apprentice for the purpose of carrying on his calling, trade, business, undertaking or manufacture or for personal or domestic service and includes any body of persons whether incorporated or not and any managing agent of any employer; 1 The Act has been extended to__ (i) the Baluchistan States Union, by the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G.G.O. 4 of 1953). (ii) the State of Bahawalpur by the Bahawalpur (Extension of Federal Laws) Order, 1953 (G.G.O. 11 of 1953) ; and (iii) Khairpur State, by the Khairpur (Federal Laws) (Extension) Order, 1953 (G.G.O. of 5 of 1953). The Act has been and shall be deemed to have been brought into force in Gwadur (with effect from the 8th September, 1958), by the Gwadur (Application of Central Laws) Ordinance, 1960 (37 of 1960), s. 2. The Act has been brought into force throughout the Province of West of Pakistan (with effect from the 15th August, 1961), see Gazette of West Pakistan, 1961, Ext., p. 1855. This Act has been applied to certain classes of employment throughout the Province of West Pakistan see Gazette of West Pakistan, 1961, Ext, p. 1855. The Act has been applied to the Provincially Administered Tribal Areas or to the parts or those areas to which it does not already apply, see Regulation No. 1 of 1972, s. 2 and Sch. 2 Subs. by the Central Laws (Statute Reform) Ordinance No XXI of 1960, s. 3 and 2nd Sch. 3 Subs. and omitted by A.O., 1964, Art. 2 and Sch.",
      "source_provision": "sec2"
    },
    {
      "term": "Labour Commissioner",
      "definition": "the officer so designated and appointed by the 1 [Provincial Government];",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act; and",
      "source_provision": "sec2"
    }
  ]
}
