{
  "id": "pk-enforcement-of-shari-ah-act-1991",
  "type": "statute",
  "title": "Enforcement of Shari'ah Act, 1991",
  "title_en": "Enforcement of Shari'ah Act, 1991",
  "short_name": "EOSA",
  "status": "in_force",
  "issued_date": "1991-11-30",
  "in_force_date": "1991-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apmXZA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Enforcement of Shari'ah Act, 1991 (X of 1991) published by The Pakistan Code (Islamic/Religious Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Enforcement of\nShari’ah Act, 1991.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once.\n(4) Nothing contained in this Act shall affect the personal laws, religious freedom, traditions,\ncustoms and way of life of the non-Muslims."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definition",
      "content": "In this Act “Shari’ah” means the Injunctions of Islam as laid down in the Holy\nQuran and Sunnah.\nExplanation.—While interpreting and explaining the Shari’ah the recognized principles of\ninterpretation and explanation of the Holy Quran and Sunnah shall be followed and the expositions\nand opinions of recognised jurists of Islam belonging to prevalent Islamic schools of jurisprudence\nmay be taken into consideration."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Supremacy of Shari’ah",
      "content": "(1) The Shari’ah that is to say, the Injunctions of Islam as laid\ndown in the Holy Quran and Sunnah, shall be the supreme law of Pakistan.\n(2) Notwithstanding anything contained in this Act, the Judgement of any court or any other\nlaw for the time being in force, the present political system, including the Majlis-e-Shoora (Parliament)\nand Provincial Assemblies and the existing system of Government, shall not be challenged in any\ncourt, including Supreme Court, the Federal Shariat Court or any authority or tribunal:\nProvided that nothing contained herein shall affect the rights of the non-Muslims guaranteed\nby or under the Constitution."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Laws to be interpreted in the light of Shari’ah",
      "content": "For the purpose of this Act—\n(a)     while interpreting the statute-law, if more than one interpretation is possible, the\none consistent with the Islamic principles and jurisprudence shall be adopted by\nthe Court; and\n(b)     where two or more interpretations are equally possible, the interpretation which\nadvances the Principles of Policy and Islamic provisions in the Constitution\nshall be adopted by the Court."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Observance of Shari’ah by Muslim citizens",
      "content": "All Muslim citizens of Pakistan shall\nobserve Shari'ah and act accordingly and in this regard the Majlis-e-Shoora (Parliament) shall\nformulate code of conduct for Government functionaries."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Teaching of, and training in, Shari’ah etc",
      "content": "The State shall make effective\narrangements—\n(a)     for the teaching of, and training in, the Shari’ah, Islamic jurisprudence and all\nother branches of Islamic law at appropriate levels of education and professional\ntraining;\n(b)     to include courses on the Shari’ah in the syllabi of the law colleges ;\n(c)     for the teaching of the Arabic language ; and\n(d)     to avail the services of persons duly qualified in Shari’ah, Islamic jurisprudence\nand Ifta in judicial system."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Islamization of education",
      "content": "(1) The State shall take necessary steps to ensure that the\neducational system of Pakistan is based on Islamic values of learning, teaching and character building.\n(2) The Federal Government shall, within thirty days from the commencement of this Act,\nappoint a Commission consisting of educationists, jurists, experts, ulema and elected representatives\nas it may deem fit and appoint one of them to be its Chairman.\n(3) The functions of the Commission shall be to examine the educational system of Pakistan to\nachieve the objectives referred to in sub-section (1) and make recommendations in this behalf.\n(4) A report containing the recommendations of the Commission shall be submitted to the\nFederal Government which shall cause it to be placed before both the Houses of Majlis-e-Shoora\n(Parliament).\n(5) The Commission shall have the power to conduct its proceedings and regulate its procedure\nin all respects as it may deem fit.\n(6) All executive authorities, institutions and local authorities shall act in aid of the\nCommission.\n(7) The Ministry of Education in the Government of Pakistan shall be responsible for the\nadministrative matters relating to the Commission."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Islamization of economy",
      "content": "(1) The State shall take steps to ensure that the economic system\nof Pakistan is constructed on the basis of Islamic economic objectives, principles, and priorities.\n(2) The Federal Government shall, within thirty days from the commencement of this Act,\nappoint a Commission consisting of economists, bankers, jurists, ulema, elected representatives and\nsuch other persons as it may deem fit and appoint one of them to be its Chairman.\n(3) The functions of the Commission shall be—\n(a)    to recommend measures and steps, including suitable alternatives, by which the\neconomic system enunciated by Islam could be established ;\n(b)    to recommend the ways, means and strategy for such changes in the economic\nsystem of Pakistan so as to achieve the social and economic well being of the\npeople as envisaged by Article 38 of the Constitution ;\n(c)    to undertake the examination of any fiscal law or any law relating to the levy\nand collection of taxes and fees or banking or insurance law or practice and\nprocedure to determine whether or not these are repugnant to the Shari’ah and\nto make recommendations to bring such laws, practices and procedure in\nconformity with the Shari’ah ; and\n(d)    to monitor progress in respect of the Islamization of economy, identifying lapses\nand bottlenecks if any and suggest alternatives to remove any difficulty.\n(4) The Commission shall oversee the process of elimination of riba from every sphere of\neconomic activity in the shortest possible time and also recommend such measures to the Government\nas would ensure the total elimination of riba from the economy.\n(5) The Commission shall submit its reports on a regular basis and at suitable intervals to the\nFederal Government which shall place the same before both the Houses of Majlis-e-Shoora\n(Parliament) and shall also respond to any queries sent to it by the Federal Government in respect of\nestablishment of the Islamic economic order.\n(6) The Commission shall have the power to conduct its proceedings and regulate its procedure\nin all respects as it may deem fit.\n(7) All executive authorities, institutions and local authorities shall act in aid of the\nCommission.\n(8) The Ministry of Finance in the Government of Pakistan shall be responsible for the\nadministrative matters relating to the Commission."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Mass media to promote Islamic values",
      "content": "(1) The State shall take steps to promote Islamic\nvalues through the mass media.\n(2) The publication and promotion of programmes against or in derogation to the Shari’ah,\nincluding obscene material shall be forbidden."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Protection of life, liberty, property, etc",
      "content": "In order to protect the life, honour, liberty,\nproperty and the rights of the citizens, the State shall take legislative and administrative measures to—\n(a)     introduce administrative and police reforms;\n(b)     prevent acts of terrorism and sabotage and disruptive activities ; and\n(c)     prevent the possession and display of illicit arms."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Elimination of bribery and corruption",
      "content": "The State shall take legislative and\nadministrative measures, to eliminate bribery, corruption and malpractices and provide for exemplary\npunishment for such offences."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Eradication of obscenity, vulgarity, etc",
      "content": "Effective legal and administrative measures\nshall be taken by the State to eradicate obscenity, vulgarity and other moral vices."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Eradication of social evils",
      "content": "The State shall take effective measures for enactment of law\neradicating social evils and promoting Islamic virtues on the principles of amr bil Ma’roof wa nahi’anil\nMunkar as laid down in the Holy Quran."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Nizam",
      "content": "i-adl.—The State shall take adequate measures for the Islamisation of the Judicial\nsystem by eliminating laws delays, multiplicity of proceedings in different courts, litigation expenses\nand ensuring the quest for truth by the court."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Bait",
      "content": "ul-Mal (Welfare Fund).—The State shall take steps to set-up a Bait-ul-Mal for\nproviding assistance to the poor, needy, helpless, handicapped, invalids, widows, orphans and the\ndestitute."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Protection of the ideology of Pakistan, etc",
      "content": "The State shall enact laws to protect the\nideology, solidarity and integrity of Pakistan as an Islamic State."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Safeguard against false imputations, etc",
      "content": "The State shall take legislative and\nadministrative measures to protect the honour and reputation of the citizens against false imputations,\ncharacter assassination and violation of privacy."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. International financial obligations, etc",
      "content": "Notwithstanding anything contained in this Act\nor any decision of any court, till an alternative economic system is introduced, financial obligations\nincurred and contracts made between a National Institution and a Foreign Agency shall continue to,\nremain, and be, valid, binding and operative.\nExplanation.—In this section, the expression “National Institution” shall include the Federal\nGovernment or a Provincial Government, a statutory corporation, company, institution, body,\nenterprise or any person in Pakistan and the expression “Foreign Agency” shall include a foreign\ngovernment, a foreign financial institution, foreign capital market, including a bank and any foreign\nlending agency, including an individual and a supplier of goods and services."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Fulfillment of existing obligations",
      "content": "Nothing contained in this Act or any decision made\nthereunder shall affect the validity of any financial obligations incurred, including under any\ninstruments, whether contractual or otherwise, promise to pay, or any other financial commitments\nmade by or on behalf of the Federal Government or a Provincial Government or a financial or statutory\ncorporation or other institution to make payments envisaged therein, and all such obligations promises\nand commitments shall be valid, binding and operative till an alternative economic system is evolved."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Rights of women not to be affected",
      "content": "Notwithstanding anything contained in this Act,\nthe rights of women as guaranteed by the Constitution shall not be affected."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Laws to be enacted by Majlis",
      "content": "e-Shoora (Parliament) and Provincial Assembly only.—\nNotwithstanding anything contained in this Act or the judgement of any court, including the Supreme\nCourt, all laws shall be enacted exclusively by the Majlis-e-Shoora (Parliament) and the Provincial\nAssembly, as the case may be, and no law shall be made or be deemed to have been made unless it is\nmade in the manner laid down in the Constitution."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Rules",
      "content": "The Federal Government may, by notification in the official gazette, make rules\nfor carrying out the purposes of this Act.\n________\n71994                                                               RGN Date: 17-01-2025"
    }
  ],
  "definitions": []
}
