{
  "id": "pk-epidemic-diseases-act-1897-repeal-by-w-p-act-xxxvi-of-1958",
  "type": "statute",
  "title": "Epidemic Diseases Act, 1897 (Repeal by W.P. Act. XXXVi of 1958))",
  "title_en": "Epidemic Diseases Act, 1897 (Repeal by W.P. Act. XXXVi of 1958))",
  "short_name": "EDABW",
  "status": "repealed",
  "issued_date": "1897-02-03",
  "in_force_date": "1897-02-03",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cZo%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Epidemic Diseases Act, 1897 (Repeal by W.P. Act. XXXVi of 1958)) (III of 1897) published by The Pakistan Code (Health/Medical Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent",
      "content": "(1) This Act may be called the Epidemic Diseases Act, 1897.\n2[(2) It extends to the whole of Pakistan].\n3*                  *                *               *                *                *                *"
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Power to take special measures and prescribe regulations as to dangerous epidemic",
      "content": "disease.__(1) When at any time the 5[Provincial Government] is satisfied that 6[the Province] or any\npart thereof is visited by, or threatened with, an outbreak of any dangerous epidemic disease, the\n5[Provincial Government], if 7[it] thinks that the ordinary provisions of the law for the time being in\nforce are insufficient for the purpose, may take, or require or empower any person to take, such\nmeasures and, by public notice, prescribe such temporary regulations to be observed by the public or\nby any person or class of persons as 7[it] shall deem necessary to prevent the outbreak of such disea­\n1 For Statement of Objects and Reasons, see Gazette of India, 1897, Pt. V, p. 21; for Report of the Select Committee, see ibid., p. 23 ; and for Proceed ings in Council, see ibid., Pt. VI, pp. 18\nand 24. .\nThis Act has been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.W.F.P., subject to certain modifications, see N.W.F.P. (Upper\nTanawal) (Excluded Area) Laws Regulation, 1950.\nIt has also been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950); and applied in the Federated Areas of Baluchistan, see\nGazette of India, 1937, Pt. I, 'P. 1499.\nIt has been extended to the Excluded Area of Upper Tanawal other than Phulera by the N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regu lation, 1950 and declared to be in force in\nthat area with effect from the 1st June, 1951, see N.W.F.P. Gazette, Ext. dated the 1st June, 1951.\nIt has also been amended in the Punjab by the Epidemic Diseases (Punjab Amdt.) Act, 1944 (pun. Act 3 of 1944).\nThis Act has been repealed in its application to the Province of West Pakistan by West Pakistan Act 36 of 1958.\n2 Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for the original sub­section (2), as amended by the\nBurma Laws Act, 1898 (13 of 1898), the Repealing and Amending Act, 1914 (10 of 1914), A.O., 1949 and the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 8.\n3 Sub­section (3), rep. by Act 10 of 1914, s. 3 and Sch.II.\n4 For notifications issued under this section, see different local Rules and Orders.\n5 Subs. by A.O., 1937, for “G. G. in C.”.\n6 Subs. ibid., for “India.”.\n7 Subs. ibid., for “he”.\nse or the spread thereof, and may determine in what manner and by whom any expenses incurred (in­\ncluding compensation if any) shall be defrayed.\n(2) In particular and without prejudice to the generality of the foregoing provisions, the\n1[provincial Government] may take measures and prescribe regulations for­\n2*                  *                *                 *                 *         *                *\n(b) the inspection of persons travelling by railway or otherwise, and the segregation, in hospital,\ntemporary accommodation or otherwise, of persons suspected by the inspecting officer of being\ninfected with any such disease.\n3*                  *                *                 *                 *         *                *\n4[2A. Powers of Federal Government. When the 5[Federal Government] is satisfied that\n6[Pakistan] or any part thereof is visited by, or threatened with, any out­break of any dangerous\nepidemic disease and that the ordinary provisions of the law for the time being in force are\ninsufficient to prevent the outbreak of such disease or the spread thereof, the 5[Federal Government]\nmay take measures and prescribe 7regulations for the inspection of any ship or vessel leaving or\narriving at any port in 8[Pakistan] and for such detention thereof, or of any person intending to sail\ntherein, or arriving thereby, as may be necessary.]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Penalty. Any person disobeying any regulation or order made under this Act shall be deemed",
      "content": "to have committed an offence punishable under section 188 of the Pakistan Penal Code (XLV of\n1860)."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Protection to persons acting under Act. No suit or other legal proceeding shall lie against any",
      "content": "person for anything done or in good faith intended to be done under this Act.\nlSubs. by A. O.,1937, for “G. G. in C.”.\n2 Clause (a) rep. ibid.\n3 Sub­section (3) rep. by the Devolution Act, 1920 (38 of 1920) s.2 and Sch. I.\n4 Subs. by A. O., 1937, for s. 2A as ins. by Act, 38 of 1920, s. 2 and Sch. I.\n5 Subs. by F. A. O., 1975, Art. 2 and Table, for “Central Government”.\n6 Subs. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 4 and 3rd Sch., for “India”.\n7 For such Regulations, see Gaz. of P., 1958, Pt. I, p. 167.\n8 Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “the Provinces and the Capital of the\nFederation” which had been subs. by A. O., 1949, Arts, 3 (2) and 4, for “British India”."
    }
  ],
  "definitions": []
}
