{
  "id": "pk-estacode",
  "type": "statute",
  "title": "Estacode",
  "title_en": "Estacode",
  "short_name": "Estacode",
  "status": "in_force",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tibQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Estacode published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. A question has arisen as to how the seniority of those probationers should",
      "content": "be fixed who are not able to qualify the Final Passing Out Examination in the first and\nsecond attempt. Matter is considered in Establishment Division and clarified as under:—\n(a)    A probationer failing to qualify FPOE in first attempt will only have\nincrements withheld while his/her seniority will not be affected so long as\nhe/she passes in second attempt. To determine inter-se-seniority aggregate\nmarks obtained (as stated in sub paras i-iv above) will be used to calculate\nthe probationer‘s placement in the seniority list.\n(b)    A probationer who fails to qualify FPOE in second attempt but does it in\nthird attempt will be relegated to the bottom of the seniority list\nirrespective of aggregate marks obtained."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Ministries/Divisions/Departments concerned of all Occupational Groups",
      "content": "and Services should follow the above mentioned guidelines to determine inter-se-\nseniority of the probationers in future.\n[Authority:— Establishment Division‘s O.M.No.1/3/2014-T.V dated 21-04-2014].\n4.3     Determination of Inter-se-Seniority of Officers of\nAll Occupational Groups and Services\nRefer to the subject cited above and to state that in continuation to this\nDivision‘s O.M. No.1/3/2014-T.V dated 21-04-2014, it is clarified that inter-se-seniority\nof probationers within a batch will be determined as per para 2 of the O.M. ibid from the\ndate of insertion of Rule 6(2) in Occupational Groups and Services (Probation, Training\nand Seniority) Rules,1990 vide SRO 257(I)/2011 dated 15-03-2011."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Controlling Ministries/Divisions/Departments of the various Occupational",
      "content": "Groups/Services should follow the abovementioned guidelines for consideration in case\nof repeaters.\n[Authority:- Establishment Division‘s O.M. No.2/3/2015-T-V dated 17-03-2015].\n4.5      Determination of Inter-se-Seniority of Officers of\nAll Occupational Groups and Services\nRefer to the subject cited above and to convey the following decisions taken by\nthe competent authority:—\n\na.        [All cases pending or future of probationers / officers received for\ndetermination of seniority due to deferment will have seniority fixed with\nthe batch, these probationers/officers undergo CTP and not their original\nCSS batch. Accordingly, all past cases that have been decided otherwise\ni.e., seniority fixed with original CSS batch will be reverted to bring these\nat par with the new policy issued vide Establishment Division‘s O.M No.\n1/3/2014-.T-V dated 05-03-2015.\nb.      If a probationer is granted deferment after joining CTP with original CSS\nbatch, his/her seniority will be fixed with the batch he/she undergoes/\ncomplete the CTP.]\n\nSubs. vide Establishment Division‘s O.M No. 2/3/2015-T-V dated 15-03-2016.\n\nNote:—\nParas a & b of Establishment Division‟s O.M No. 1/3/2014-T.V dated 23-09-2015 were substituted vide\nEstablishment Division‟s O.M No. 1/3/2014-T.V dated 26-12-2016 from ab-initio. On the directions of\nIslamabad High Court vide Writ Petition No. 2557 of 2017 dated 07-12-2017 which was withdrawn and stands\nrestored to original status vide Establishment Division‟s O.M No. 5/6/2017-T.V dated 01-02-2018.\nCHAPTER-2                     ESTACODE (EDITION-2021)                            Page -83\nc.    Marks of first attempt of FPOE minus marks of failed subject will be\nconsidered for the purpose of inter-se-seniority. The same principle is\nadopted in the CSS optional papers result. The illustration below explains\nthe issue further.\nLet us assume:—\n(i)      Total Marks of FPOE -           1000\n(ii)     Passing Marks          -        50%\nPaper        Total Marks       Marks Obtained            Remarks\nA.              100                   60                 Passed\nB.              100                   60                 Passed\nC.              100                   60                 Passed\nD.              100                   60                 Passed\nE.              100                   60                 Passed\nF.              100                   60                 Passed\nG.              100                   60                 Passed\nH.              100                   60                 Passed\nI.              100                   60                 Passed\nJ.              100                   30                 Passed\nTotal            1000                  570                Passed\n(iii)    Total marks including marks of failed subject i.e. J =       570\n(iv)     Total marks excluding marks of failed subject i.e. J=        540\n(v)      In order to determine inter-se-seniority, 540 marks will be added to\nthe CSS,CTP and STP marks. Hence, as already explained and as\nfurther illustrated in the column below, 1900 marks will determine\nan individual‘s seniority:—\nExams       Total Marks            Marks                         Remarks\nObtained\nCSS               1400            800          Passed\nCTP                500            300          Passed\nSTP                600            350          Passed\nFPOE               1000            540          Failed in one subject in first attempt\nTotal              3500           1990"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. (1) Every Probationer shall undergo training at such institutions, at such",
      "content": "places, and for such periods as the Government may decide, in consultation with the\nCommission.\n(2) The curricula for training shall be such as may be prescribed by the\nGovernment in consultation with the Commission."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. The officers under whom a probationer is trained or works for any period",
      "content": "shall prepare and submit to the Government a confidential report in respect of such\nprobationer on his work, conduct and performance during such period."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. (1) The annual increment of a probationer may be withheld for such period",
      "content": "as the Government may direct if he fails to qualify in any of the examinations referred to\nin rules 8 and 10, or if the Government considers his work, conduct, or performance\nunsatisfactory.\n(2) The withholding of increments under this rule shall not affect a\nprobationer's future increments."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. (1) Every probationer shall, after the conclusion of his institutional",
      "content": "training, be required to qualify at an examination to be held by the Commission.\n(2) The examination shall be in such subjects, carrying, in the aggregate, a\nmaximum of one thousand marks as the *Central Government may prescribe specifying the\ndistribution of marks among the various subjects.\n\n(3) A probationer who fails to qualify in any subject or subjects in an\nexamination referred to in sub-rule (1) shall be allowed two more chances to appear at the\nexaminations to be held subsequently by the Commission in such subject or subjects.\n*(4) If a probationer fails to qualify in all the subjects of the examination\nreferred to in sub-rule (2) even after having been allowed the subsequent chances as\nprovided in sub-rule (3), his services shall be terminated except in the case of a\nprobationer who has failed to qualify in one subject only, in which case he will be\nreduced in seniority and placed at the bottom of the batch with which he appears in the\nexamination in his third chance and forfeit one increment for a period of one year.\n(5) If any probationer is prevented by sickness or any other adequate cause\nfrom appearing in the whole or part of the examinations referred to in sub-rule (1) or (3)\nthe Government may arrange for him to be specially examined in any or all of the\nsubjects prescribed for such examinations after such interval as it may, after consulting\nthe Commission and having regard to the circumstances of the case, consider suitable."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. (1) The period of probation of a probationer shall not end until he has fully",
      "content": "qualified in the examinations referred to in rules 8 and 10 has earned satisfactory\nconfidential reports under rule 6.\n\nSubs. vide Estt. Division‘s Notification No.9/2/66-C.III(B), dated 28-12-1972.\nPage -88                     ESTACODE (EDITION-2021)                                   CHAPTER-2\n(2) Every probationer shall, before commencement of his training, execute a bond\nin the form prescribed by the Government with one surety to refund all moneys paid to him or\nspent in connection with his training, as may be determined by the President, in the event of\nhis resigning the service during the period of probation or within 3 years thereafter."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. After he has completed his institutional training, a probationer shall be",
      "content": "posted to such Ministry, Division or other office as the Government may direct, and shall\nthere perform the duties allotted to him, and pass such departmental examinations by\nsuch standards as the Government may prescribe in this behalf."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. (1) All persons to whom these rules apply and who have been appointed",
      "content": "on the basis of the same examination shall rank in seniority amongst themselves in the\ndescending order of the sum of the marks obtained by them in (i) the competitive\nexamination on the basis of which they were selected for appointment; and (ii) the first\nattempt in the examination held under sub-rule (1) of rule 8.\n(2) For the purposes of the fixation of the seniority of a probationer whose case\nfalls within sub-rule (5) of rule 8, the Government may, in consultation with the\nCommission, pass such orders as it may consider equitable."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. The service of a probationer shall count for leave and pension from the date",
      "content": "of his first joining an institution for training under rule 5.\n[Authority.- Estt. Division‘s Notification No. S.R.O.90(R), dated 2-9-1964].\n4.11    Fixation of ‘Inter-se-Seniority’ of Section Officers\nAppointed by Direct Recruitment\nPrinciples regarding the fixation of inter-se-seniority of Section Officers\nappointed by direct recruitment on the basis of competitive examinations conducted by\nthe Federal Public Service Commission are contained in the Section Officers (Probation,\nTraining and Seniority) Rules, 1964."
    },
    {
      "provision_ref": "sec1972",
      "section": "1972",
      "title": "Section 1972. Consequently, the seniority of an officer who had been holding a post in Senior",
      "content": "Administrative Grade and was later appointed as Joint Secretary would be reckoned from\n1st March, 1972, or the date of appointment as Joint Secretary, whichever is earlier.\n[Authority.-Estt. Division‘s O.M.No.1/1/75-ARC-II, dated 4-4-1973].\nPage -90                      ESTACODE (EDITION-2021)                                         CHAPTER-2\nIII. CHANGE OF OCCUPATIONAL\nGROUPS/SERVICES\n5.1    Change of Occupational Groups/Services\nAllocation to various occupational groups/services are made on the basis of\ncompetitive examinations conducted annually by the Federal Public Service Commission\n(FPSC). While recommending candidates for allocations to different groups/services, the\nFPSC takes into consideration the merit position, number of vacancies available,\nregional/provincial quota, suitability and preferences of candidates."
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Accounts Group Paragraph 4(e) of O.M.No.1/2/74",
      "content": "ARC, dated 23-1-1974\nconstituting the Group*."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Pakistan Agriculture Research Council (PARC)",
      "content": "National Health Services, Regulation & Coordination Division"
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Pakistan Sports Board (PSB)",
      "content": "Information Technology and Telecommunication Division"
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Pakistan Telecommunication Authority (PTA)",
      "content": "Page -112                 ESTACODE (EDITION-2021)               CHAPTER-3\nInterior Division"
    },
    {
      "provision_ref": "sec65",
      "section": "65",
      "title": "Section 65. Water and Power Development Authority (WAPDA)",
      "content": "CHAPTER-3                       ESTACODE (EDITION-2021)                                 Page -113\n1.6   Procedure for Making Recruitment\nfrom Abroad\nThe question of the procedure which should be adopted when it becomes\nnecessary to resort to recruitment from abroad to civil posts under the Central\nGovernment has been engaging the attention of the Establishment Division for some\ntime. It has now been decided by the Government of Pakistan that recruitment from\nabroad should be made in the manner indicated in the following paragraphs."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Right of living",
      "content": "(1) Every person with disability shall have right to a\ndecent place of living of his choice and no person shall discriminate against a person with\ndisability by way of refusing to rent him or sell to a place of living because of him being\na person with disability.\n(2)   The government shall evolve a policy towards fair and affordable housing\nfor persons with disabilities in government owned, sponsored or assisted projects and\nalso in the private housing schemes. The authorities approving establishment of new\nhousing schemes and plans shall ensure that appropriate number of affordable housing\nunits are included in each such scheme or plan.\n(3)  The government may set up maintain decent housing facilities for the\npersons with disabilities who do not have a place to live and need a decent temporary\nshelter. The Council shall with the help from the authorities of the Federal Capital, civil\nsociety organizations and society at large assist to arrange temporary shelter for such\npersons."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Right to home and family",
      "content": "(1) No person with disability especially a\nchild or adult or senior citizen shall be separated from his family on the grounds of\ndisability unless a court of law requires him to be so separated in his best interest.\n(2)   Where the immediate family of person with disability is unable to cater a\nperson with disability, especially a child with disabilities, the Court shall make effort to\nplace such person at a setup suitable for his safe living.\n(3)   All persons with disabilities shall have the right to marry a person of their\nown choice and raise their family without any discrimination.\n(4)     No person with disability shall be subjected to any medical procedure\nleading to infertility and forced sterilization shall be a non-compoundable offence.\n(5)    The government shall provide free services regarding reproductive health\nespecially to women with disabilities."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Freedom of expression and information",
      "content": "(1) The government shall\nensure that persons with disabilities have full and equitable rights regarding freedom of\nCHAPTER-3                    ESTACODE (EDITION-2021)                              Page -139\nspeech, right to expression and information and effective measures shall be taken for their\nsuch rights to be enjoyed.\n(2)   The Council shall take necessary measures to convey the voice of persons\nwith disabilities and their organizations across the governments, civil society and\ninternational community.\n(3)   The Council shall encourage the state and private run electronic and print\nmedia to promote awareness on the rights of persons with disabilities through public\nservice messages and programming inclusive for all types of disabilities.\n(4)    The government may provide advertisements to publications dedicated\nfor persons with disabilities.\n(5)    The government shall ensure that all websites hosted by Pakistani website\nservice providers are accessible for persons with disabilities."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Right of political participation",
      "content": "(1) Persons with disabilities shall\nhave full right to participate in the political activity in the country including exercising\nright of vote and right to be elected to an elected body.\n(2)    The election Commission of Pakistan shall ensure that each polling\nstation is accessible to persons with disabilities and necessary arrangements are made for\nthem to case their Votes confidentially and without any difficulty. Any act by any person\nto cause restriction on exercise of right of vote by a person with disability shall be\ndeemed as forceful obstruction as defined in the Election Act, 2017 (XXXIII of 2017)\nand shall be prosecuted and punished accordingly.\n(3)    The Council shall, with the help of the Election Commission of Pakistan,\neducate political parties on the issues and problems of the persons with disabilities.\n(4)    The Election Commission of Pakistan shall be mandated to develop voter‘s\naccessibility mechanism for persons with disabilities such as brail voting paper etc."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Access to Justice",
      "content": "The government shall ensure that persons with\ndisabilities are provided with assistance, including sign language interpreters and\nattendants to access to the justice system."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Right to own property",
      "content": "Persons with disabilities shall not be denied the\nright to own, sell or inherit property."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Participation in Sports, cultural and recreational activities",
      "content": "(1) The\ngovernment shall ensure that no person is discriminated against in participation of any\nsports, games, cultural and recreational activities on ground of his disability. Assistive\ndevices, equipment and latest technology shall be made available for their inclusion in\nsports, culture, recreational and leisure activities. One seat for persons with disabilities in\nPage -140                    ESTACODE (EDITION-2021)                            CHAPTER-3\nthe sports board shall be ensured and the government shall ensure linkages of the\nmonitoring mechanism for para Olympics and special Olympics sports association.\n(2)    Access to cultural materials, programs and activities shall be provided in\naccessible and appropriate formats to person with disabilities.\n(3)   Barrier-free and discrimination-free access to media programs, films,\ntheaters, parks, stadiums, play grounds, beaches and other places of leisure, recreation,\nsports and cultural activities shall be provided to such persons with disabilities.\n(4)    The government shall facilitate participation of persons with disabilities\nin scouting, art classes, outdoor camps, hunting, tourism and adventure activities and\nshall also help to develop and utilize their artistic, creative and intellectual capabilities.\n(5)    The government shall ensure that talent-enhancing abilities in both public\nand private schools including sports activities are developed.\n(6)    The government shall ensure that courses and activities are designed to\npromote arts and culture to enhance talent of persons with disabilities.\n(7)  The government shall take steps so that access to cultural materials,\nprograms and activities in accessible and appropriate formats to persons with disabilities\nare ensured."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Protection of persons with disabilities in risk and disaster situation",
      "content": "(1) All persons with disabilities shall be given top priority in providing suitable\nprotection and safety in situations of risk and natural disaster and shall immediately be\nremoved from such areas and moved to a safe place on priority.\n(2)    In situations of armed conflict, the police, civil armed forces and the\narmed forces shall take appropriate measures on priority to ensure safety, protection and\nremoval of such persons.\n(3)    All authorities engaged in reconstruction activity subsequent to any\nsituation of armed conflict, humanitarian emergencies or natural disaster shall ensure that\npersons with disabilities are accorded priority in reconstructing their institutions, homes\nand other facilities and restoring services.\n(4)   The Council shall keep a close coordination with the disaster\nmanagement authorities for protection and removal to safety and keep record of such\npersons caught in such situation and ensure early rehabilitation.\n(5)    Needs and concerns of persons with disabilities should be included in\ndisaster risk reduction.\nCHAPTER-3                    ESTACODE (EDITION-2021)                           Page -141"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Strengthening and reconstitution of the National Council for the",
      "content": "Rehabilitation of Disabled Persons.- (1) The National Council for the Rehabilitation of\nDisabled Persons constituted under the Disabled Persons (Employment and\nRehabilitation) Ordinance, 1981 (XL of 1981) shall stand reconstituted as the Council on\nRights of Persons with Disabilities and shall consist of-\n(a)   Minister-in-Charge;                                     Chairperson\n(b)   Secretary of the Division allocated with business of    Vice Chairperson\nthis Act;\n(c)   Two members from the Senate, one each from              Members\ngovernment and the opposition;\n(d)   Two members from the National Assembly one              Members\neach from government and the opposition;\n(e)   One representative from Ministry of Information,        Member\nBroadcasting, National History and Literary\nHeritage not below the rank of Joint Secretary;\n(f)   One representative from Ministry of Finance,            Member\nRevenue and Economic Affairs not below the rank\nof Joint Secretary;\n(g)   One representative from the Division allocated with     Member\nbusiness of education not below the level of Joint\nSecretary;\n(h)   One representative from the Division allocated with     Member\nthe business of poverty alleviation and social safety\nnot below the rank of Joint Secretary;\n(i)   An officer not below the rank of a Joint Secretary of   Member\nallocated;\n(j)   Chairman, Capital Development Authority (CDA);          Member\n(k)   Chief Executive or Head of National Institute of        Member\nRehabilitation Medicine (NIRM)\n(l)   Three persons with disability                           Members\n(2)   Member at clause (i) of sub-section (1) shall also act as Secretary of the\nCouncil.\n(3)   The Council may co-opt any person as a member.\n(4)   The government functionaries represented in the Council shall hold their\nmemberships on ex officio basis. The tenure of the members shall be three years.\nPage -142                    ESTACODE (EDITION-2021)                            CHAPTER-3\n(5)   The Council shall meet at-least quarterly and the quorum of each meeting\nshall be one-fourth of the total number of the composition of the Council."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Function of the Council",
      "content": "(1) The Council shall have the responsibility\nto achieve and implement objectives of this Act and to assist the government in\ndeveloping legal and institutional frame work.\n(2)    The Council shall be the executive authority to implement this Act, to\ndevelop a legal and social environment and to help persons with disabilities to have the\nprotection of law in enjoying their fundamental rights.\n(3)   The Council shall, with the help of other authorities and persons, take all\npossible measures to protect persons with disabilities from discrimination, exploitation,\ntorture, inhuman or degrading treatment on the hands of any one including their families\nand caregivers.\n(4)    The Council shall coordinate implementation of the principles of relevant\nconvention at provincial and lower administrative levels through providing technical\nassistance to various organs of the provincial legislatures and governments in developing\nappropriate legal and institutional frameworks in their jurisdictions and making them\nachieve the objective of protection and enforcement of rights.\n(5)    The Council shall evaluate the effectiveness of laws and policies and\nassess the implementation of laws and policies at the national level and recommend to the\ngovernment any changes required in the policies, laws and practices.\n(6)    The Council shall conduct or cause to conduct research on the status of\npersons with disabilities and matters related to the promotion and protection of their rights.\n(7)   The Council shall put into place an institutional mechanism to regularly\nmonitor performance of various departments and organizations in the government and\nissue a performance score card to each such entity and organization at least once in every\nthree years. Similarly, the Council shall devise and maintain score cards for private\nentities that seek such evaluation and assessment. Such performance audits shall be\nconducted by third party professionals and the employees of the Council.\n(8)     The Council shall assess its own performance in creating legal and social\nenvironment in the country and issue an annual status report at the end of every calendar\nyear to present its report to the Parliament through Minister-in-charge.\n(9)   The Council shall be responsible to monitor the activities of private and\ncommunity bases organizations to ensure that required standards of service are\nmaintained. The Council may enforce and institutional mechanism for effective,\nefficacious and transparent functions of such organizations and may impose restrictions\non organizations not meeting the objective criteria laid down by it.\nCHAPTER-3                   ESTACODE (EDITION-2021)                             Page -143\n(10) The Council shall have the powers to address individual and collective\ncomplaints of violations of human rights of persons with disabilities."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Registration of persons with disabilities",
      "content": "(1) Any person with disability\ndesirous of being employed or otherwise rehabilitated may have his name registered in\nthe register maintained by the Council or its designated office in such form and in such\nmanner as may be prescribed by the Council.\n(2)    The Council shall, if it thinks necessary, cause each person with the\ndisability registered under sub-section(1) to be assessed as to the nature of his functional\ndisability and also as to his aptitude and the nature of work he is fit to do by a medical\nofficer authorized by it or by such assessing board as it may appoint having at least one\nmedical officer and the medical officer or, as the case may be, the assessing board shall\nsubmit its report to the Council in such form as may be prescribed by the Council.\n(3)    If the person with disability is considered by the Council fit to work, he\nshall be informed indicating the nature of work for which he may be employed or the\ntrade or vocation in which he may be trained and an endorsement to that effect shall be\nmade against his name in the register.\n(4)   If the person with disability is not considered by the Council fit to work,\nhe shall be informed accordingly for an endorsement to that effect being made against his\nname in the register and the Council shall take such measures for his rehabilitation as it\nthinks fit.\n(5)     If a person is declared by the Council not to be a disabled person, his\nname shall be struck off from the register."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Establishment to employ persons with disabilities",
      "content": "(1) Not less than\none percent of the total number of persons employed by and establishment at any time\nshall be persons whose names have been registered with the Council or its designated\noffice of the area in which such establishment is located and against whose names in the\nregister maintained under section 23 an-endorsement exists to the effect that they are fit\nto work.\n(2)    The persons with disabilities employed against any post in pursuance of\nsub-section(1) shall be entitled to the terms and conditions which are not less favourable\nthan those of the other persons employed by the establishment against similar posts.\n(3)   When calculating the percentage of the posts in an establishment for the\npurposes of employment of persons with disabilities, the fraction of 0.5 and above shall\ncount as a whole-number."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Establishment to pay to the Fund",
      "content": "An establishment which does not\nemploy a person with disability as required by section 24 shall pay in the Fund each\nPage -144                    ESTACODE (EDITION-2021)                          CHAPTER-3\nmonth the sum of money it would have paid as salary or wages to a disabled person had\nhe been employed."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Dissolution of the Council",
      "content": "On the commencement of this Act, the\ncouncil formed under the Disable Persons (Employment and Rehabilitation) Ordinance,\n1981 (XL of 1981) shall stand dissolved and on such dissolution all assets, rights,\npowers, authorities and privileges and property, movable and immovable, cash and bank\nbalance, reserve funds, investments and all other interests and rights in, or arising out of\nsuch property and all debts, liabilities and obligations of whatever kind of the dissolved\ncouncil subsisting immediately before its dissolution shall stand transferred to and vest in\nthe Council."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Government authorities and other persons to assist the Council",
      "content": "(1)\nAll the functionaries of the government shall extend full and effective cooperation to the\nCouncil in ensuring the enforcement of this Act and other laws for protecting the rights of\nthe persons with disabilities.\n(2)    Any person in the governmental position not effectively cooperating with\nthe Council shall be deemed to have committed misconduct and shall be proceeded\nagainst accordingly."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Creating public awareness",
      "content": "(1) The Council shall take immediate,\nappropriate and result oriented measures to raise awareness amongst the society as whole\nwith regards to recognition and respect for persons with disabilities and their rights.\nCHAPTER-3                    ESTACODE (EDITION-2021)                             Page -145\n(2)  The Council shall recommend to the Federal and Provincial Governments\nmeasures to include topics on disability in educational curriculum and to create\nawareness among young students about persons with disabilities.\n(3)    The government shall include topics on addressing problems of persons\nwith disabilities in training programs of institutions responsible for imparting trainings to\nofficers and officials of the government, including judges and court officials."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Rehabilitation",
      "content": "(1) The government shall take all possible measures to\nensure that persons with disabilities attain maximum independence and ability to\nparticipate in activities of life including getting education, doing business, getting\nemployed and participating in sports and cultural activities.\n(2)    The government shall promote continuing skill development and training\nin existing advance skills and technologies to persons with disabilities for effective\nparticipation and integration in the community.\n(3)   The government shall undertake initiatives to promote, support and\nimplement community bases rehabilitation and research initiatives of its own."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Insurance cover",
      "content": "(1) the Council may devise and put in place\ncomprehensive group medical and accident insurance for persons with disabilities and\nmay also facilitate such persons in getting affordable life and other forms of insurance.\n(2)    The Council may pay the premium for persons with disabilities who\ncannot pay the premium from their own sources."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Special disability courts",
      "content": "(1) For speedy justice, the government may\ndesignate and may encourage provincial governments to designate, courts to hear cases\nunder this Act or other laws in which one or more parties are persons with disabilities.\n(2)   There shall be an effective institutionalized mechanism to monitor cases\nin courts under sub-section (1) by appropriate judicial forums as devised by the\nrespective High Court."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Power to make rules",
      "content": "(1) The Council may, in consultation with the\nFederal Government and by notification in the official Gazette, make rules to carry out\npurposes of this Act.\n(2)   The rules made under the Disabled Persons (Employment and\nrehabilitation) Ordinance, 1981 (XL of 1981) so far as they are not inconsistent with the\nprovisions of this Act shall continue to be in force until altered, amended or repealed."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Power to make regulation",
      "content": "The Council may, by notification in the\nofficial Gazette, make regulations for its own efficient and professional working and for\neffective achievement of objectives of this Act.\nPage -146                     ESTACODE (EDITION-2021)                                 CHAPTER-3"
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Repeal",
      "content": "The Disabled Persons (Employment and Rehabilitation)\nOrdinance, 1981 (XL of 1981) is, to the extent of Islamabad Capital Territory, hereby\nrepealed.\n4.12 Uniform Instructions on 2% Disability Quota\nRefer to the subject cited above and to say that at present the quota reserved for\n―Person with Disability‖ (PWD‘s) is reserved at 2% in the Federal Government. The Prime\nMinister has been pleased to direct that the said quota of 2% is to be implemented against\ntotal strength of Ministries/Divisions/Departments. It is further stated:—\na.    Disabled Persons (Employment and Rehabilitation) Ordinance,1981 and now\n―ICT Rights of Person with Disabilities Act,2020‖, promulgated on 23rd\nSeptember,2020 provides reservation of quota on the total number of persons\nemployed by an establishment (on the overall strength of the organization\nconcerned and not against each basic scale).\nb.    The total number of persons employed means the total sanctioned posts of the\nestablishment, that is, an Organization, Authority, Department or Ministry.\nThis should apply such that 2% of the total sanctioned posts or workforce of\nthe establishment becomes the Disability Quota for that establishment."
    },
    {
      "provision_ref": "sec1968",
      "section": "1968",
      "title": "Section 1968. It has been observed that the instructions contained therein for determining the domicile",
      "content": "of candidates while making appointment to posts are not being complied with faithfully in\nsome cases. These instructions clearly provide that a candidate belonging to Pakistan by\norigin should be considered for appointment on the basis of domicile of his father. Similarly, a\nmigrant candidate should be considered only against the quota of the province/region where\nhis parents are domiciled and where they have resided for at least three years. In case the\nparents of a migrant candidate have not migrated to Pakistan, he should be considered for\nappointment on the basis of his own domicile. All the Ministries/Divisions are requested that,\nwhile making ad-hoc appointments against the posts required to be filled through FPSC, they\nshould carefully examine the domicile of the candidates in the light of the above instructions.\nThis may also kindly be brought to the notice of all the departments/organizations under their\nadministrative control for strict compliance.\n[Authority:– Estt. Division‘s O.M.No.2/2/77-W.C/R.2 dated 13-10-1987].\n5.2       Determination of Domicile for the Purpose of\nAppointments Against Provincial/Regional Quotas\nAccording to the decisions contained in the Establishment Division Office\nMemorandum No.25/113/ 54-SE I, dated the 4th January, 1956 (Annex-I) and Office\nMemorandum No. 1/12/56-R, dated the 14th February, 1958 (Annex-II), while a\ncandidate belonging to Pakistan by origin can claim appointment only against the quota\nof the province/ region to which the father of such a candidate belongs, the candidates\nwho have migrated to Pakistan have different options for claiming appointment against\nprovincial/regional quotas. The matter has, therefore, been reconsidered with a view to\nrationalizing the policy regarding determination of domicile of the candidates for\ngovernment service, and the following revised orders are issued, in partial modification\nof the existing instructions:—\n(i)      There should be no change in the policy regarding the persons belonging\nto Pakistan by origin, i.e., they should continue to be considered for\nappointment only against the quota of the province/region to which the\nfather of such a candidate belongs.\n(ii)     A migrant candidate, whether residing in Pakistan or abroad, should be\nconsidered for appointment only against the quota of the province/region\nwhere his parents are domiciled and where they have resided for at least 3\nyears. However, the condition of 3 years' residence should be deemed to\nbe fulfilled if the parents are officially domiciled in a particular\nprovince/region but have been living in some other areas for a number of\nyears due to exigencies of service. For this purpose, the candidate will be\nrequired to produce a domicile certificate from a competent authority that\nhis parents are domiciled in the province/region concerned.\n(iii) In case the parents of a migrant candidate have not been considered for\nappointment against the quota of the province/region where he himself is\ndomiciled and has resided or has been educated for a continuous period of\nPage -148                        ESTACODE (EDITION-2021)                              CHAPTER-3\nthree years immediately before applying for                  appointment   and\nconsideration against the quota of a province/region."
    },
    {
      "provision_ref": "sec03",
      "section": "03",
      "title": "Section 03. Name:",
      "content": "____________ 04. Father's Name:___________"
    },
    {
      "provision_ref": "sec07",
      "section": "07",
      "title": "Section 07. Date of Birth:",
      "content": "_________ Day ____ Month _______ Year _____"
    },
    {
      "provision_ref": "sec09",
      "section": "09",
      "title": "Section 09. Marital status: (Please mark only one put a tick mark ( ) in the relevant box)",
      "content": "Single                           Married                 Divorced/Widow"
    },
    {
      "provision_ref": "sec66",
      "section": "66",
      "title": "Section 66. Khakroob 01 15",
      "content": "Total                          620\nCHAPTER-3                           ESTACODE (EDITION-2021)                                  Page -257\n7.3     Federal Public Service Commission\n(Functions) Rules, 1978\nIn exercise of the powers conferred by section 10 of the Federal Public Service\nCommission Ordinance, 1977 (XLV of 1977), the Federal Government is pleased to\nmake the following rules, namely:-"
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. This Office Memorandum issued with the concurrence of the Ministry of",
      "content": "Finance.\n[Authority:– Estt. Division‘s O.M. No. 14/5/78-D. III, dated 10-2-1980].\n9.12 Application of Instructions for Induction/\nRe-employment of Armed Forces Officers\nto Autonomous Bodies\nThe President has also been pleased to decide that instructions contained in the\nEstablishment Division O.M. No. 14/5/78-D. III, dated 10th February, 1980 will also\napply, mutatis mutandis to the corporations and other autonomous bodies set up by the\nFederal Government or working under their administrative control."
    },
    {
      "provision_ref": "sec23b",
      "section": "23B",
      "title": "Section 23B. Jurisdiction barred.– Save as provided under this Act and the Service",
      "content": "Tribunals Act, 1973 (LXX of 1973), or the rules made thereunder, no order made or\nproceedings taken under this Act, or the rules, made thereunder by the President or any\nofficer authorized by him shall be called in question in any Court and no injunction shall\nbe granted by any Court in respect of any decision made, or proceedings taken in\npursuance of any power conferred by, or under, this Act or the rules made thereunder]."
    },
    {
      "provision_ref": "sec20a",
      "section": "20A",
      "title": "Section 20A. Appointment on deputation",
      "content": "(1) A person in the service of a Provincial\nGovernment or an autonomous, semi-autonomous body or corporation or any other\norganization set-up, established owned, managed or controlled by the Federal Government\nwho possesses the minimum educational qualifications, experience or comparable length of\nservice prescribed for a post shall be eligible for appointment to the said post on deputation for\na period not exceeding three years which may be extended for another period of two years on\nsuch terms and conditions as may be sanctioned [by the appointing authority] in consultation\nwith the lending Organization.\n(2) Subject to any rule or orders on the subject **[*****] a civil servant who\nfulfills the conditions and is considered suitable may be sent on deputation to an\nautonomous, semi-autonomous body or corporation established by law or to the\nProvincial Government on such terms and conditions as may be decided by the lending\nand borrowing organizations.\n(3) In case of appointment under sub-rule (1) or sub-rule (2) pension contribution\nshall invariably be made by the borrowing organizations.\n***\nProvided that posting of serving husband and wife at the same station, unmarried\nfemale government servants at the place of residence of their parents/family and that of\nmarried female government servants at the place of residence/posting of their husbands who\nare not in government employment shall be exempted from the said rule.\n@\nPART V –- PROBATION"
    },
    {
      "provision_ref": "sec3a",
      "section": "3A",
      "title": "Section 3A. This means that contract appointment to posts in BPS 20 and above are required to be",
      "content": "Page - 370                        ESTACODE (EDITION-2021)                            CHAPTER-04\napproved by the Chief Executive*, and extension of such appointments beyond two years\nwould also require the approval of the Chief Executive*."
    },
    {
      "provision_ref": "sec1973",
      "section": "1973",
      "title": "Section 1973. Page",
      "content": "426 ESTACODE (EDITION-2021) CHAPTER-04\nii.    Extension in contract appointments is governed by instructions contained\nin Establishment Division‘s O.M No. 8/10/2000-CP-I dated 23-12-2000.\niii.   Revision made to the subject Package vide Establishment Division‘s O.M\nNo. 8/10/2013-E-2 dated 20-10-2014 has since been held in abeyance,\ntherefore, all cases are to be dealt under Establishment Division‘s O.M\nNo. 8/10/2013-E-2 dated 13-06-2006, till further orders/instructions.\n[Authority:— Establishment Division‘s O.M No. 8/10/2013-(E-II) dated 25-05-2015].\n13.6 Revision of Assistance Package for Families of\nGovernment Employees Who Die in Service\nRefer to Establishment Division‘s O.M No. 7/40/2005-E-2, dated 13th\nJune,2006, O.M No.8/10/2013-E-2, dated 20th October, 2014, O.M No. 8/10/ 2013-E-2\ndated 9th February,2015 and O.M No. 8/10/2013 (E-II) (PT) dated 25th May,2015\nincluding amendments thereof issued from time to time on the subject noted above and to\nstate that the Prime Minister has been pleased to approve the following revised Assista-\nnce Package for Government employees, who die in service w.e.f 9 th February,2015:—\nLump Sum Grant        300% increase over the package-         a. Upto Rs.10 million according to\n2006 for in service death of civilian      following scales:—\nemployees. This increase will be                 BS           Amount\ngiven on the 2006 package as per                1-16          3 Million\nfollowing scales:—                               17           5 Million\nBS            Amount                   18-19          9 Million\n1-4         Rs.600,000               20 & above       10 Million\n5-10        Rs.900,000\nb. Rs.700,000/- to the officers/\n11-15         Rs.1,200,000\nofficials incapacitated and released\n16-17        Rs.1,500,000\nfrom service for having become\n18-19        Rs.2,400,000\ninvalid as a result of injury in\n20 & above      Rs.3,000,000         encounters/bomb blasts, riots/ watch\nand ward duty or terrorist activity.\nc. Rs. 500,000/- to the officers /\nofficials incapacitated as a result of\nthe injury in accidents as stated in\npara ―b‖ above but who are still\nserving in the department.\nPension               100% pension to the families of a       100% pension to the families of a\ndeceased Government servants as         deceased Government servants as\nper their length of service and last    per their length of service and last\npay drawn. In case of less than 10      pay drawn. In case of less than 10\nyears service of the deceased           years service of the deceased\nemployees, rate of minimum 10           employees, rate of minimum 10\nyears service will be applicable.       years service will be applicable.\nAccommodation         Retention of Government house or        Retention of Government house or\npayment of rent of hired house till     payment of rent of hired house till\nthe age of superannuation.              the age of superannuation.\nCHAPTER-04                         ESTACODE (EDITION-2021)                               Page - 427\nEducation            Free education to all the children of   Free education to all the children of\nthe deceased government employ-         the deceased government employees\nees up to graduation in any public/     up to graduation in any public/\ngovernment educational institution      government educational institution\nincluding expenses of tuition fee,      including expenses of tuition fee,\nbooks related material and living       books related material and living\nallowances etc.                         allowances etc.\nAllotment of Plot    Discontinuation of the entitlement      Discontinuation of the entitlement of\nof 2% quota for allotment of plot.      2% quota for allotment of plot.\nPayment of lump sum grant in lieu       Payment of lump sum grant in lieu\nof plot subject to the condition that   of plot subject to the condition that\nno plot had been allotted in the        no plot had been allotted in the past,\npast, as per scale given below:—        as per scale given below:—\nBS            Amount                     BS           Amount\n1-8           2 Million                 1-8          2 Million\n9-16           5 Million                 9-16         5 Million\n17 and above       7Million             17 and above       7Million\nEmployment                                                  *\n[Employment for posts in BS-01 to\n[Employment for posts in BS-01\nto BS-15 on five (05) years             BS-15 on five (05) years contract\ncontract     appointment      without   appointment without advertisement\nadvertisement which may further         which may further be extendable till\nbe extendable till the age of           the age of superannuation or\nsuperannuation or regularization as     regularization as the case may be].\nthe case may be].                       **\n[Provided further that in case the\n**\n[Provided further that in case the   deceased government servant is\ndeceased government servant is          survived by two or more widows\nsurvived by two or more widows          and/or children from these widows,\nand/or children from these widows,      right of contract appointment shall\nright of contract appointment shall     be decided in the following manner\nbe decided in the following manner      and order:\nand order:\na) the first widow or a child (18          a) the first widow or a child (18\nyears or above in age) from the          years or above in age) from the\nfirst widow or a minor child             first widow or a minor child\nfrom the first widow as soon             from the first widow as soon as\nas he/she attains age of 18              he/she attains age of 18 years\nyears but he/she has to                  but he/she has to exercise the\nexercise the option within the           option within the time period\ntime period (one year from               (one year from date of death)\ndate of death) stipulated vide           stipulated vide Establishment\nEstablishment Division‘s O.M             Division‘s O.M No.4/1/2005-\nNo.     4/1/2005-CP-I     dated          CP-I dated 13-04-2005 and\n13-04-2005 and failing that:             failing that:\n\nAmended vide Establishment Division‘s O.M No. 8/65/2016-E-2 dated 09-09-2016.\n**\nAdded vide Establishment Division‘s O.M No. 1/39/2013-E-2 (pt) dated 03-08-2016.\nPage - 428                ESTACODE (EDITION-2021)                                   CHAPTER-04\nshall stand transferred to the 2nd     shall stand transferred to the 2nd\nwidow or to a child (18 years or       widow or to a child (18 years or\nabove in age) from the 2nd widow       above in age) from the 2nd widow or\nor to a child (18 years or above in    to a child (18 years or above in age)\nage) from the 2nd widow or a minor     from the 2nd widow or a minor child\nchild from the 2nd widow as soon       from the 2nd widow as soon as\nas he/she attains age of 18 years      he/she attains age of 18 years but\nbut he/she has to exercise the         he/she has to exercise the option\noption within two years of death.]     within two years of death.]\nMarriage Grant       Marriage grant amounting to Rs. 8      Marriage grant amounting to Rs. 8\nlac on wedding of one daughter,        lac on wedding of one daughter, may\nmay be granted to family of            be granted to family of deceased\ndeceased Government employees.         Government employees.\nHealth               Free health facilities as per their    Free health facilities as per their\nentitlement during service.            entitlement during service.\nHouse   Building     In case of advance against salaries    In case of advance against salaries\nAdvance              sanctioned by the AGPR or the          sanctioned by the AGPR or the\nprovincial AG Office, the unpaid       provincial AG Office, the unpaid\nbalance to be waived.                  balance to be waived.\nNomination of an     An officer of BS-17 or BS-18 may       An officer of BS-17 or BS-18 may\nofficer as council   be nominated by each Ministry/         be nominated by each Ministry/\nDivision/Department as council         Division/Department as council who\nwho will be responsible for            will be responsible for finalization/\nfinalization/provision of all the      provision of all the facilities under\nfacilities under the package, to the   the package, to the families of Govt.\nfamilies of Govt. employees who        employees who die in service within\ndie in service within one month of     one month of the incident.\nthe incident.\nSpecial Lump Sum                                            A special lump sum grant from\nGrant        from                                           Benevolent Fund ranging from\nBenevolent Fund                                             Rs.200,000 to Rs.500,000\nSr.      Pay Scales      Lump Sum\n#           (BS)         Grant\n1.     1-10              200,000\n2.     11-16             300,000\n3.     17-19             400,000"
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Hospital leave and study leave.– Subject to these rules, the provisions",
      "content": "regarding hospital leave and study leave contained in the Fundamental Rules and\nSupplementary Rules shall apply to the civil servants.\n*\n[40. Relaxation of Rules.– The Federal Government may, in a case of hardship,\nrelax all or any of the provision of these Rules:\nProvided that such relaxation shall not be less favourable to any benefit available to\na Civil Servant under these Rules].\n[Authority:- Finance Div.‘s S.R.O. No.1313(I)/80, dated 20-12-1980, as amended from time to time].\n*\nAdded vide Finance Division Notification No. F.1(4)-R.4/92, dated 01-10-1992.\nCHAPTER-5                               ESTACODE (EDITION-2021)                                       Page - 479\nForm-I\nSignature of applicant\nI,.........................after careful .............................. personal examination of\nthe case, hereby certify that ......................... whose signature is given above, is suffering\nfrom ......... and I consider that a period of absence from duty of ....................... with effect\nfrom ...................... is absolutely necessary for the restoration of his health.\nDated, the.........\nGovernment Medical Attendant\n**\nor\nOther Registered Medical Practitioner\nForm-II\n[***FORM OF MEDICAL CERTIFICATE OF FITNESS TO RETURN TO DUTY\nI, .................. do hereby certify that I have carefully examined .............. of the\n.................. department, and find that he has recovered from his illness and is now fit to\nresume duties in Government service. I also certify that before arriving at this decision I\nhave examined the original medical certificate(s) and statement(s) of the case (or certified\ncopies thereof) on which leave was granted or extended, and have taken these into\nconsideration in arriving at my decision.\nDated, the .........\nGovernment Medical Attendant\n*or\nOther Registered Medical Practitioner]\n**\nAdded vide Finance Division‘s O.M No. F.1(22)R.4/82, dated 22-12-1982.\n***\nAdded vide Finance Division‘s Notification No. 847-R. 4/83 dated 19-11-1983.\nPage - 480                     ESTACODE (EDITION-2021)                         CHAPTER-5\nForm-III\nG.F. R.13\nNotes.-Items 1 to 9 must be filled in by all applicants. Item 12 applies only in the\ncase of Government servants of Grade 16 and above."
    },
    {
      "provision_ref": "sec2a",
      "section": "2A",
      "title": "Section 2A. The words \"leave salary\" and *\"one year\" used in para 25 of the Scheme of Basic Pay",
      "content": "Scales contained in Finance Division's O.M. No.F.1(1)-Imp/83, dated 18.8.1983, shall,\ntherefore, mean \"leave pay\" and *\"three hundred and sixty five days\" respectively, as in para\n17 of Revised Leave Rules 1980."
    },
    {
      "provision_ref": "sec1953",
      "section": "1953",
      "title": "Section 1953. It has been reported by the F.P.S.C. that in several cases the applications from",
      "content": "departmental candidates for the various competitive examinations/selections held by the\nF.P.S.C. are forwarded by the department concerned very late, without regard to the last date\nprescribed for receipt of applications announced by the Commission. To avoid that\ndepartmental delays, the Commission have decided that departmental delays in forwarding\nthe applications of the departmental candidates will not normally be condoned. They will be\ncondoned only in exceptional circumstances, which will be considered by the Commission\non the merit of each case."
    },
    {
      "provision_ref": "sec1980",
      "section": "1980",
      "title": "Section 1980. 2. It has further been decided by the Special Selection Board that a copy of",
      "content": "the letter sanctioning terms and conditions of the officers (including the condition that\none third of the fee/ remuneration may be deposited into the General Revenues) may be\nendorsed, in future, to the AGPR and Accountants General of the Provinces in the case of\nfederal and provincial employees respectively as well as to the Pakistan Embassy in the\ncountry where the officer is taking up the consultancy. One copy should also be sent to\nthe Training Wing, Establishment Division.\n[Authority.- Estt. Division‘s O.M. No. 1/27/80-T. IV, dated 22-9-1980].\n21.1 Policy Concerning Promotion of Civil\nServants on Deputation Abroad\nA civil servant, if selected for appointment in any international agency, foreign\ngovernment or private organization abroad, is permitted to go on deputation for a period\nof 3 years extendable to 5 years on the request of the deputationist or his employer. After\nexpiry of the approved period of deputation, the deputationist is required to come back\nand resume duty in the country."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Training Need Assessment One week NIM/PASC",
      "content": "\nRemoval from Service (Special Powers) Ordinance, 2000 has been ceased to exit.\n**\nNational Centre for Rural Development.\nPage - 720                            ESTACODE (EDITION-2021)                              CHAPTER-7\nSl. No.              Training Course             Duration                Training Institution"
    },
    {
      "provision_ref": "sec78",
      "section": "78",
      "title": "Section 78. (a) Financial Management 6 days FTIP/PIM/IBA",
      "content": "(b)   Information Technology, &\nE-Commerce and MIS             6 days\n[Note–      The list of above training institutions is tentative. Training may be arranged as per available\ntraining facilities at any training institutions in the relevant field at the nearest station].\nCHAPTER-7                    ESTACODE (EDITION-2021)                              Page - 721\n11.2    Criteria for Nomination of Officers to National Management\nCollege/National Institute of Management (NIMs)\nRefer to the subject noted above and to state that the competent authority i.e.\nSecretary, Establishment Division has been pleased to approve the following criteria/\nguidelines for mandatory courses i.e. Mid-Career Management Course (MCMC), Senior\nManagement Course (SMC) and National Management Course (NMC)/National Security\nand War Course (NS&WC) 2020-21 as under:—\n(i)     Officer(s) is/are in BS-18/19/20 or equivalent on regular basis.\n(ii)    The Officer(s) is/are in the promotion zone.\n(iii)   The officers may be considered in order of seniority in their respective\ncadres and the officers otherwise senior to them should not be ignored.\n(iv)    The officers who are on deputation in international organizations, may not\nbe nominated. Similarly, officer posted in Pakistan‘s Missions abroad,\nexcept those belonging to Foreign Service of Pakistan, may also not be\nnominated.\n(v)     The officers on long leave/EOL and are undergoing disciplinary\nproceedings may not be nominated. However, those accused officers\nwhose disciplinary proceedings are pending for over one year may also be\nnominated."
    },
    {
      "provision_ref": "sec33d",
      "section": "33D",
      "title": "Section 33D. The Chairman NAB shall as soon as possible after the",
      "content": "an annual                 end of every calendar year but before the last day of March next\nreport                    following, submit to the President a report of its affairs for that year\nwhich report shall be a public document and on its publication\ncopies thereof shall be provided to the public at a reasonable cost.\nRecovery of amount              33E. Any fine or other sum due under this Ordinance, or as\nof fines, etc., as\ndetermined to be due by a Court, shall be recoverable as arrears of\narrears of land\nrevenue                   land revenue.]\nPower to make\n[34. The Chairman NAB may, with the approval of the\nrules                     President, by notification in the official Gazette, make rules for\ncarrying out the purposes of this Ordinance.]\nDelegation of                  2[34A. The Chairman NAB may, by an order in writing,\nPowers                    delegate any of his powers to and authorise performance of any of\nhis functions by, an officer of the NAB as he may deem fit and\nproper, subject to such conditions, if any, as may be specified in the\norder, for carrying out the purposes of this Ordinance.]\nRepeal                      35. (a) The Ehtesab Act 1997 (Act IX of 1997) shall stand\nrepealed from the date of promulgation of this Ordinance, provided\nthat notwithstanding the repeal of the said Act, any proceedings\npending under Ordinance CXI of 1996, Ordinance No. XX of 1997\nand the Ehtesab act, 1997, before any Court established under the\nsaid Act, of 1997 3* or any of the aforesaid Ordinances amending the\nsame, shall 4[continue under this Ordinance as transferred under 5***\nsection 33 to 6[a] Court.\n7\n[(b) Any case or proceeding pending under the aforesaid\nOrdinances and the Act of 1997 immediately before the\ncommencement of this Ordinance and transferred to\nany 8[Court] 9***shall be proceeded with and all subsequent\nproceedings shall be completed in accordance with, and under the\nprovisions of, this Ordinance.]\n\nSubs. by the National Accountability Bureau (Amdt.) Ordinance, 2002(133 of 2002), s. 41, for section 34,\nwhich was previously amended by Ord. No. 4 of 2000, s.24, for certain words.\n2\nNew section 34A ins. by the National Accountability Bureau (Amdt.) Ordinance 2001 (35 of 2001), s. 29.\n3\nThe word ―and/‖ omitted by Ord. No. 133 of 2002, s. 42.\n4\nSubs. by the National Accountability Bureau (Amdt.) Ordinance, 2000 (4 of 2000), s. 25, for certain words,\nwhich was previously ins. by Ord. No. 19 of 1999. s.4.\n5\nOmitted by Ord. No. 35 of 2001, s. 30.\n6\nSubs. by Ord. No. 133 of 2002, s. 42, for ―an Accountability‖.\n7\nSubs. by Ord. No. 4 of 2000, s. 25, for the original sub-section (b).\n8\nSubs. by Ord. No. 133 of 2002, s. 42, for ―court‖.\n9\nThe words ―established under this Ordinance‖ omitted ibid.,\nCHAPTER-8                        ESTACODE (EDITION-2021)                                     Page - 891\nIndemnity"
    },
    {
      "provision_ref": "sec1a",
      "section": "1A",
      "title": "Section 1A. (2) It extends to the whole of Pakistan",
      "content": "(3)    It shall come into force at once."
    }
  ],
  "definitions": []
}
