{
  "id": "pk-evacuee-trust-properties-management-and-disposal-act-1975",
  "type": "statute",
  "title": "Evacuee Trust Properties (Management and Disposal) Act, 1975",
  "title_en": "Evacuee Trust Properties (Management and Disposal) Act, 1975",
  "short_name": "ETPAD",
  "status": "in_force",
  "issued_date": "1975-01-24",
  "in_force_date": "1975-01-24",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUZWNp-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Evacuee Trust Properties (Management and Disposal) Act, 1975 (XIII of 1975) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Evacuee Trust\nProperties (Management and Disposal) Act, 1975.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once and shall be deemed to have taken effect on the first\nday of July, 1974."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the subject or\ncontext,—\n(a)         “Act” means the Displaced Persons (Compensation and Rehabilitation) Act,\n1958 (XXVIII of 1958), or the Disabled Persons (Land Settlement) Act, 1958\n(XLVII of 1958), as the case may be;\n(b)         “Board” means the Evacuee Trust Property Board constituted under section 3 ;\n(c)         “Chairman” means the Chairman of the Board ;\n(d)         evacuee trust property” means the evacuee trust properties attached to\ncharitable, religious or educational trusts or institutions or any other properties\nwhich form part of the Trust Pool constituted under this Act ;\n(e)         “member” means a member of the Board ;\n(f)         “public dues” includes arrears of rent or any charges due in respect of any\nevacuee trust property ;\n(g)         “regulations” means regulations made under this Act ;\n(h)         “rules” means rules made under this Act ;\n(i)         “rural area” means the area other than the urban area ;\n(j)         “scheme” means a scheme for the management and disposal of evacuee trust\nproperty ;\n(k)         “Secretary” means the Secretary to the Board ; and\n1\nFor Statement of Objects and Reasons, see Gaz. of P., 1974, Ext., Pt.III, p.1085\n(l)    “urban area” means the area situated within the limits of a municipal\ncorporation, a municipal committee, a notified area committee, a town area\ncommittee, a small town committee, a sanitary committee or a cantonment as\nthose limits existed on the fourteenth day of August, 1947.\n(2) All other words and expressions used but not defined in this Act shall have the same\nmeaning as in the Registration of Claims (Displaced Persons) Act, 1956 (III of 1956), the Pakistan\nRehabilitation Act, 1956 (XLII of 1956), the Pakistan Administration of Evacuee Property Act, 1957\n(XII of 1957) the Displaced Persons (Compensation and Rehabilitation) Act, 1958 (XXVIII, of\n1958),or the Displaced Persons (Land Settlement) Act, 1958 (XLVII of 1958)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Constitution of the Board",
      "content": "(1) The Federal Government shall constitute a Board, to be\nknown as the Evacuee Trust Property Board, for the management and disposal of evacuee trust\nproperty.\n(2) The Board shall be a body corporate by the name aforesaid having perpetual succession\nand a common seal, with power to acquire, hold and dispose of property, both movable and\nimmovable, and to contract, and shall. by the said name sue and be sued.\n(3) The Board shall consist of a Chairman and such members as the Federal Government\nmay, by notification in the official Gazette, appoint.\n(4) The Chairman shall be appointed by the Federal Government on such terms and\nconditions as it may determine, shall hold office during the pleasure of the Federal Government and\nshall be the administrative and executive head of the Board.\n(5) A member shall, unless he earlier resigns his office under sub-section (6) or is removed\nunder sub-section (7), hold office for a period of three years on such terms and conditions as the\nFederal Government may determine.\n(6) A member may at any time, resign his office by writing under his hand addressed to the\nFederal Government.\n(7) The Federal Government shall have the power to remove any member if he—\n(i)     is disqualified for employment in, or dismissed from; the service of Pakistan;\nor\n(ii)    is, or at any time has been, convicted of an offence; involving moral turpitude;\nor\n(iii)   is, or at any time has been, adjudicated an insolvent ; or\n(iv)    is of unsound mind and has been so declared by a competent Court ; or\n(v)     absents himself from three consecutive meetings of the Board without any\nreasonable cause ; or\n(vi)    is found by the Federal Government to be acting in any manner prejudicial to"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Functions of the Board",
      "content": "(1) The general supervision and control of all evacuee trust\nproperty shall, subject to any directions that may be given by the Federal Government, vest in the\nBoard, and the Board shall take such action as it deems fit for the proper management, maintenance\nand disposal of such property in accordance with the provisions of this Act and the rules, scheme, or\ndirections made or issued thereunder.\n(2) In particular and without prejudice to the generality of the foregoing power, the functions\nof the Board shall be―\n(a)        to maintain a complete and authentic record of all evacuee trust property;\n(b)        to prepare and submit, by the 31st of May each year, to the Federal\nGovernment for its approval, the annual budget estimates alongwith detailed\nstatements of receipts and expenditure;\n(c)        to buy out of surplus income, if any, or by taking loan from any statutory\ncorporation, with the approval of the Federal Government, any other property\nwhich may be considered to be beneficial for promoting the objects of this Act\nor any scheme;\n1\n[(d)   to sell, dispose of, or transfer to such person or body, and on such terms and\nconditions, as the Federal Government may direct or, with the prior approval\nof the Federal Government, make an endowment of, or otherwise manage\nevacuee trust property consistent with the objects of this Act or a scheme or\nfor any other object approved by the Federal Government;].\n(e)        to mortgage or lease any evacuee trust property in accordance with the\ninstructions of the Federal Government;\n(f)        to assess or reassess the rent or lease amount of the evacuee trust property;\n(g)        with the prior approval of the Federal Government, to extinguish a trust or to\nwind up an institution the original object of which has wholly or partly ceased\nto exist;\n(h)        to incur expenditure on repairs or maintenance of holy shrines not exceeding\nsuch amount as the Federal Government may approve;\n(i)        to maintain religious shrines and provide facilities for the pilgrims;\n(j)        to set up, or make grants-in-aid to, orphanages, leper houses, widow houses,\npoor houses and educational, vocational, technical or health institutions and\nhospitals subject to the general control and directions of the Federal\nGovernment;\n(k)        to order sealing of any evacuee trust property in an appropriate case pending\npayment of the Board's dues by the person concerned;\n(l)        to undertake development programmes for increasing the productivity of\nagricultural land forming part of the Trust Pool and for enhancing the\ncommercial value of an evacuee trust property;\n1\nSubs. by the Evacuee Trust Properties (Management and Disposal) (Amdt.) Ordinance, 1984 (39 of 1984),s.2.\n(m)        to invest money, with the prior approval of the Federal Government, for any\nother social welfare or charitable purpose;\n(n)        to set up, with the prior approval of the Federal Government, any industrial or\ncommercial undertaking;\n(o)        to enter upon and inspect evacuee trust property;\n(p)        to appoint such staff on such terms and conditions as may be approved by the\nFederal Government consistent with the sanctioned budget;\n(q)        to exercise financial and administrative control over offices attached to or\nunder it;\n(r)        to prepare a scheme or schemes with the prior approval of the Federal\nGovernment for promoting the objects of this Act; and\n(s)        to institute and defend suits and proceedings in a court of law."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Meetings of the Board",
      "content": "(1) Save as hereinafter provided, the Board shall regulate the\nprocedure for its meetings.\n(2) The meetings of the Board shall be called by the Chairman on such date, time and place\nas he may deem fit:\nProvided that not less than one meeting shall be held in every two months.\n(3) The Chairman shall1preside at every meeting of the Board.\n(4) If the Chairman is absent from any meeting, the members present shall elect one from\namongst themselves to preside at the meeting; and the member so elected shall at that meeting\nexercise all the powers of the Chairman."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Trust Pool. For the purposes of management, maintenance and disposal of evacuee trust",
      "content": "property a Trust Pool consisting of the following shall be constituted, namely:\n(a)        all evacuee trust property which immediately before the commencement of\nthis Act formed part of the Trust Pools constituted under the Acts;\n(b)        any evacuee property declared under section 8 to be evacuee trust property;\n(c)        Government property or any other property exchanged with any evacuee trust\nproperty;\n(d)        any property purchased or constructed by the Board;\n(e)        sale proceeds of any evacuee trust property;\n(f)     all profits and income received or derived from any evacuee trust property;\n(g)     all rents and other amounts received, realized or recoverable in respect of\nevacuee trust property."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Declaration of Property as evacuee trust property",
      "content": "(1) If a question arises whether an\nevacuee property is attached to a charitable, religious or educational trust or institution or not, it shall\nbe decided by the Chairman whose decision shall be final and shall not be called in question in any\nCourt.\n(2) If the decision of the Chairman under sub-section (1) is that an evacuee property is\nevacuee trust property, he shall, by notification in the official Gazette, declare such property to be\nevacuee trust property.\n(3) If a property is declared to be evacuee trust property under sub-section (2), the Chairman\nmay pass an order canceling the allotment or alienation, as the case may be, take possession and\nassume administrative control, management and maintenance thereof:\nProvided that no declaration under sub-section (2) or order under sub-section (3) shall be\nmade or passed in respect of any property without giving the persons having interest in that property\na reasonable opportunity of being heard."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Exemption of property in Trust Pool from process. No evacuee trust property shall be",
      "content": "liable to be proceeded against for any claim in any manner whatsoever in execution of any decree or\norder or by any other process of Court or other authority."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Validation of certain transfers",
      "content": "(1) An immovable evacuee trust property, —\n(a)     if situated in a rural area and utilised bona fide under any Act prior to\nJune, 1964, for allotment against the satisfaction of verified claims;\nand\n(b)     if situated in an urban area and utilised bona fide under any Act for\ntransfer against the satisfaction of verified claims in respect of which\nPermanent Transfer Deeds were issued prior to June, 1968,\nshall be deemed to have been validly transferred by sale to the Chief Settlement Commissioner, and\nthe sale proceeds thereof shall be re-imbursed to the Board and shall form part of the Trust Pool.\n(2) If a question arises whether a transaction referred to in sub-section (1) is bona fide or not,\nit shall be decided by the Chairman whose decision shall be final and shall not be called in question\nin any Court.\n(3) If it is decided that a transaction referred to in sub-section (1) is not bona fide, the\nChairman may pass an order canceling the allotment or transfer of such property;\nProvided that no decision under sub-section (2) or order under sub-section (3) shall be taken\nor passed in respect of any property without giving the person affected a reasonable opportunity of\nbeing heard."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Appointment and functions of Secretary",
      "content": "(1) The Federal Government shall appoint a\nperson to be Secretary to the Board on such terms and conditions as it may determine.\n(2) Subject to the provisions of this Act, the Secretary shall discharge his functions and\nperform his duties under the general superintendence, and control of the Chairman."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Appointment and duties of officers and staff",
      "content": "(1) The Chairman may, with the prior\napproval of the Federal Government and on such terms and conditions as the Board may determine,\nappoint administrators, Deputy Administrators and Assistant Administrators, and may also appoint\nsuch other officers and staff as may be necessary for the efficient performance of the functions of the\nBoard.\n(2) The Chairman may, by general or special order, provide for the distribution or allocation\nof work to be performed by the persons appointed under sub-section (1)."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Officers and staff to be public servants. All persons appointed under this Act, shall,",
      "content": "subject to any special contract to the contrary, be deemed to be public servants within the meaning of\nsection 21 of the Pakistan Penal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Bar of jurisdiction. Save as otherwise provided in this Act, no civil court shall have",
      "content": "jurisdiction in respect of any matter which the Federal Government or an officer appointed under this\nAct is empowered under this Act to determine, and no injunction, process or order shall be granted or\nissued by any Court or other authority in respect of any action taken or to be taken in exercise of any\npower conferred by or under this Act."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Protection of action taken in good faith. No suit, prosecution or other legal proceeding",
      "content": "shall lie against then Federal Government, the Board or any person appointed under this Act in\nrespect of anything which is in good faith done or intended to be done in pursuance of this Act or any\nrules, scheme or order made thereunder."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Appeal. Save as otherwise provided in this Act, any person aggrieved by an order passed",
      "content": "under this Act may, within fifteen days of the passing of such order, prefer an appeal__\n(a)     in the case of an order passed by an Assistant Administrator or a Deputy\nAdministrator, to the Administrator; and\n(b)     in the case of an order passed by an administrator, not being an order passed in\nappeal by the Administrator confirming an order of an Assistant Administrator\nor a Deputy Administrator, to the Chairman."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Revision. The Federal Government may at any time, of its own, motion or otherwise, call",
      "content": "for the record of any case or proceedings under this Act, which is pending or in which the Chairman,\nan Administrator, a Deputy Administrator or an Assistant Administrator has passed an order, for the\npurpose of satisfying itself as to the correctness, legality or propriety of such an order, and may pass\nsuch order in relation thereto as the Federal Government thinks fit:\nProvided that the record of any case or proceedings in which the Chairman, an Administrator,\na Deputy Administrator or an Assistant Administrator has passed an order shall not be called for\nunder this section on the application of any aggrieved person made after the expiration of fifteen\ndays from the date of such order."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Power to transfer cases. The Chairman may, at any stage, by order in writing, transfer a",
      "content": "case pending before an Administrator or a Deputy Administrator or an Assistant Administrator to\nany other Administrator, Deputy Administrator or Assistant Administrator, as the case may be, and,\nthe officer to whom it is so transferred may, subject to such direction, if any, as may be given in the\norder of transfer, proceed from the stage at which the' case was so transferred."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Computation of limitation. In computing the period of limitation provided for in",
      "content": "sections 16 and 17 the provisions of sections 5 and 12 of the Limitation Act, 1908 (IX of 1908), shall\napply."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Form of appeal or revision. An appeal under section 16 and an: application for revision",
      "content": "shall be presented in such form and manner as may be specified by rules."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Power of Chairman etc., as civil court.(1) The Federal Government or any person",
      "content": "authorized by it, the Chairman and every officer appointed under this Act shall, for the purposes of\nmaking any enquiry or hearing any appeal or revision under this Act, have the same powers as are\nvested in a civil Court under the Code of Civil Procedure, 1908 (Act V of 1908), when trying a suit\nin respect of the following matters, namely :—\n(a)    summoning and enforcing the attendance of any person and examining him on\noath;\n(b)    requiring the discovery and production of any documents;\n(c)    requisitioning any public record from any Court or office;\n(d)    issuing commissions for the examination of witnesses;\n(e)    appointing guardians or next friends of persons who are minors or of unsound\nmind;\n(f)    adding legal representatives of deceased applicants or claimants, as parties;\n(g)    restoration of cases dismissed for default;\n(h)    substituting the names of the rightful claimants;\n(i)    consolidation of cases;\n(j)    any other matter which may be prescribed by rules made under this Act.\n(2) The Chairman and every officer appointed under this Act shall be deemed to be a Court\nfor the purposes of sections 480 and 482 of the Code of Criminal Procedure, 1898 (Act V of 1898),\nand any proceedings before the Chairman or any such officer shall be deemed to be a judicial\nproceeding within the meaning of sections 193 and 228 of the Pakistan Penal Code (Act XLV of\n1860) and for the purposes of sections 196, 199 and 200 thereof."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Penalty for Concealment of evacuee trust property. Any person who is in occupation",
      "content": "or possession of any property which he knows or has reason to believe to be an evacuee trust\nproperty and conceals or misrepresents facts regarding such property or misappropriates the proceeds\nof such property or abets such concealment, misrepresentation or misappropriation shall be\npunishable with imprisonment for a term which may extend to three years and with fine."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Cognizance of offence by courts. No Court shall take cognizance of an offence",
      "content": "punishable under this Act save upon a complaint in writing made by the Federal Government or an\nofficer appointed under this Act."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Recovery of arrears. Any sum due to the Board in respect of any evacuee trust property",
      "content": "which is not paid within thirty days of its having become due shall be recoverable as an arrear of\nland revenue."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Ejectment. The Chairman, an Administrator, a Deputy Administrator, or an Assistant",
      "content": "Administrator may eject or cause to be ejected any person in possession or occupation of any\nevacuee trust property whose possession or occupation is not authorised by or under any of the\nprovisions of this Act or who contravenes or may have contravened any of the terms and conditions\nunder which the property is held by him, or who has failed to pay public dues, or has willfully caused\ndamage to any such property or any person in occupation or possession of any evacuee trust property\nwhich is required for an object which is considered to be a public purpose by the Federal\nGovernment, after giving him notice, and for the purposes of such ejectment may use or cause to be\nused such force as may be considered necessary."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Delegation of powers",
      "content": "(1) The Federal Government may, by notification in the official\nGazette, delegate any of its powers under this Act to such authority or person and subject to such\nconditions, if any, as may be specified in the notification.\n(2) Subject to the provisions of this Act and the rules, the Board may by resolution delegate\nall or any of its powers to the Chairman, or any officer or authority, subject to such conditions, if\nany, as may be specified in the resolution.\n(3) Subject to the provisions of this Act and the rules the Chairman may by order in writing\ndelegate all or any of his powers under this Act to an Administrator, a Deputy Administrator or an\nAssistant Administrator subject to such conditions, if any, as may be specified in the order.\n(4) Any order passed by an Administrator, a Deputy Administrator or an Assistant\nAdministrator, in exercise of any power delegated to him under sub-section (3), shall be subject to\nthe provisions of sections 16 and 17 in the same manner and to the same extent as any other order\npassed by an Administrator, a Deputy Administrator or an Assistant Administrator, as, the case may\nbe, is so subject."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Appearance by counsel or agent. Any person who is entitled or required to attend",
      "content": "before the Chairman or any other authority in connection with any proceeding under this Act,\notherwise than when called upon to attend personally for examination on oath or affirmation, may\nattend or be represented by his duly authorised agent, and any application, appeal or revision may be\npresented by counsel or such agent.\nExplanation.— In this section, “counsel” means an Advocate or any, person entitled or\nallowed to plead in any civil court."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Power to make rules. The Federal Government may, by notification, in the official",
      "content": "Gazette, make rules for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Power to make regulations. The Board may with the approval of the Federal",
      "content": "Government, make regulations regarding appointments, promotions, conditions of service,\npensionary and other benefits in respect of the officers and staff of the Board."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Preparation of scheme for management etc. Subject to the provisions of this Act and",
      "content": "the rules, the Board shall, with the prior approval of the Federal Government, prepare one or more\nschemes for the management, maintenance and disposal of evacuee trust property and for the\nefficient performance of its functions."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Act to override other laws. The provisions of this Act and any rule or scheme or order",
      "content": "made thereunder shall have effect notwithstanding anything inconsistent therewith contained in any\nother law for the time being in force or in any instrument having effect by virtue of such law."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Savings. Anything done, action taken, appointment made, order passed, rule or scheme",
      "content": "made, notification or instruction issued, or purporting to have been done, taken, made, passed or\nissued by or under the provisions of either Act immediately before the commencement of this Act\nshall be deemed to have been done, taken, made, passed or issued under this Act and shall have\neffect accordingly."
    }
  ],
  "definitions": [
    {
      "term": "Act",
      "definition": "the Displaced Persons (Compensation and Rehabilitation) Act, 1958 (XXVIII of 1958), or the Disabled Persons (Land Settlement) Act, 1958 (XLVII of 1958), as the case may be;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Evacuee Trust Property Board constituted under section 3 ;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Board ; (d) evacuee trust property” means the evacuee trust properties attached to charitable, religious or educational trusts or institutions or any other properties which form part of the Trust Pool constituted under this Act ;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of the Board ;",
      "source_provision": "sec2"
    },
    {
      "term": "public dues",
      "definition": "arrears of rent or any charges due in respect of any evacuee trust property ;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Act ;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act ;",
      "source_provision": "sec2"
    },
    {
      "term": "rural area",
      "definition": "the area other than the urban area ;",
      "source_provision": "sec2"
    },
    {
      "term": "scheme",
      "definition": "a scheme for the management and disposal of evacuee trust property ;",
      "source_provision": "sec2"
    },
    {
      "term": "Secretary",
      "definition": "the Secretary to the Board ; and 1 For Statement of Objects and Reasons, see Gaz. of P., 1974, Ext., Pt.III, p.1085",
      "source_provision": "sec2"
    },
    {
      "term": "urban area",
      "definition": "the area situated within the limits of a municipal corporation, a municipal committee, a notified area committee, a town area committee, a small town committee, a sanitary committee or a cantonment as those limits existed on the fourteenth day of August, 1947. (2) All other words and expressions used but not defined in this Act shall have the same meaning as in the Registration of Claims (Displaced Persons) Act, 1956 (III of 1956), the Pakistan Rehabilitation Act, 1956 (XLII of 1956), the Pakistan Administration of Evacuee Property Act, 1957 (XII of 1957) the Displaced Persons (Compensation and Rehabilitation) Act, 1958 (XXVIII, of 1958),or the Displaced Persons (Land Settlement) Act, 1958 (XLVII of 1958).",
      "source_provision": "sec2"
    }
  ]
}
