{
  "id": "pk-exit-from-pakistan-control-ordinance-1981",
  "type": "statute",
  "title": "Exit from Pakistan (Control) Ordinance, 1981",
  "title_en": "Exit from Pakistan (Control) Ordinance, 1981",
  "short_name": "EFPO",
  "status": "in_force",
  "issued_date": "1981-12-30",
  "in_force_date": "1981-12-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bZ%2BY-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Exit from Pakistan (Control) Ordinance, 1981 (XLVI of 1981) published by The Pakistan Code (Criminal Laws).",
  "provisions": [
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power to make rules",
      "content": "ORDINANCE No. XLVI OF 1981\n[31st December, 1981]\nAn Ordinance to provide for the control of exit of certain persons from Pakistan.\nWHEREAS it is expedient to provide for the control of exit of certain persons from Pakistan;\nAND WHEREAS the President is satisfied that circumstances exist which render it\nnecessary to take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, read\nwith the Provisional Constitution Order, 1981 (C.M.L.A. Order No. 1 of 1981), and in exercise of all\npowers enabling him in that behalf, the President is pleased to make and promulgate the following\nOrdinance:"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Ordinance may be called the Exit\nfrom Pakistan (Control) Ordinance, 1981.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Power to prohibit exit from Pakistan",
      "content": "(1) The Federal Government may, by order,\nprohibit any person or class of persons from proceeding from Pakistan to a destination outside\nPakistan, notwithstanding the fact that such person is in possession of valid travel documents.\n(2) Before making an order under sub-section (1), it shall not be necessary to afford an\nopportunity of showing cause against the order.\n(3) If, while making an order under sub-section (1) it appears to the Federal Government that\nit will not be in the public interest to specify the grounds on which the order is proposed to be made,\nit shall not be necessary for the Federal Government to specify such grounds."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Review",
      "content": "(1) Any person aggrieved by an order of the Federal Government under\nsub-section (1) of section 2 may, within fifteenth days of the making of the order, make a\nrepresentation to the Federal Government for a review of the order, setting out in the representation\nthe grounds on which he seeks the review.\n(2) The Federal Government may, after giving the person making a representation an\nopportunity of being heard, make such order as it may deem fit.\n(3) Subject to the order of the Federal Government in review, an order under sub-section (1)\nof section 2 shall be final and shall not be called in question before any court or other authority."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Punishment",
      "content": "Whoever contravenes, or attempts or conspires to contravene, or abets the\ncontravention of, any order made under sub-section (1) of section 2 shall be punishable with\nimprisonment for a term which may extend to five years."
    }
  ],
  "definitions": []
}
