{
  "id": "pk-export-development-fund-act-1999",
  "type": "statute",
  "title": "Export Development Fund Act, 1999",
  "title_en": "Export Development Fund Act, 1999",
  "short_name": "EDFA",
  "status": "in_force",
  "issued_date": "1999-07-30",
  "in_force_date": "1999-07-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUaA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Export Development Fund Act, 1999 (VI of 1999) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Export\nDevelopment Fund Act, 1999.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(a)          “Board” means the Board of Administrators constituted under section 5;\n(b)         “Chairman” means the Chairman of the Board;\n1\n(c)             [*     *          *      *      *      *   *]\n(d)         “Fund” means the Export Development Fund established under section 3;\n(e)         “member” means a member, permanent or co-opted, of the Board;\n(f)         “prescribed” means prescribed by rules made under this Act; 1[and]\n(g)         “Secretary” means Secretary of the Board 1[.]\n1\n(h)             [*     *          *      *      *      *   *]\n1\nOmitted, subs. and ins. by Act No. XI of 2026, s. 2.\n1\n[3. Establishment of Export Development Fund.—(1) The Federal Government shall\nestablish a Fund to be known as the Export Development Fund.\n(2) The Fund shall consist of.–\n(i) the whole receipts of Export Development Surcharge;\n(ii) donations and endowments;\n(iii) grants made by the Federal Government; and\n(iv) any income accruing to the Fund from its investments and property.\n(3) Each year, the Principal Accounting Officer (PAO) with the approval of the Board, shall\nprepare annual estimates of receipts into and plan-based payments out of the Fund and shall submit\nthe same to the Finance Division, by end of April, for inclusion in the Annual Budget Statement.\n(4) The Fund shall be non-lapsable and shall be maintained in the Public Account of the\nFederation, in accordance with the provisions of the Public Finance Management Act, 2019, and the\nRules, Regulations and Procedures made thereunder.]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Administration of Export Development Fund. The Fund shall be administered by the",
      "content": "Board and the money in the Fund shall be utilized for the following purposes, namely:—\n(i)     establishment of training institutes for export oriented trading and industrial\nsectors;\n(ii)    subsidizing of delegations and sale missions going abroad;\n(iii) establishment of offices abroad of the Federation of Pakistan Chambers of\nCommerce and Industry and Exporters Association;\n(iv) subsidizing participation in exhibitions abroad including single country fairs;\n(v)     publicity;\n(vi) research and Development activities of Exporters Association, Federation of\nPakistan Chambers of Commerce and Industry;\n(vii)      market and product Development by trade associations, Federation of Pakistan\nChambers of Commerce and Industry, Chambers of Commerce and Industry\nand individual exporters;\n1\nSubs. by the Finance Act, 2022 (XIII of 2022) s.3A.\n(viii)     engagement of consultants;\n(ix)       strengthening of Pakistan Trade Offices abroad;\n(x)        establishment and maintenance of display centers in and outside Pakistan;\n(xi)       support to export services; and\n(xii)      any other activity which is relevant for promotion of exports and approved by\nthe Board.\n[5. Board of Administrators of Export Development Fund. —(1) There shall be a Board\n1\nof Administrators, to be appointed by the Federal Government. consisting of the following members,\nnamely:—\n(a)       top four exporters based on previous three years data   Member\n(b)       one top non-textile and apparel exporter based on Member\nprevious three-year data\n(c)       one each from the Agriculture, IT, and industry Members\nsectors to be nominated by the Division to which\nbusiness of this Act stands allocated\n(d)       Chairperson of Pakistan Business Council                Member\n(e)       President of Federation of Pakistan Chamber of Member\nCommerce and Industry\n(f)       Secretary of the Division to which the business of Member\nFinance is allocated or his representative not below\nBPS-21\n(g)       Secretary of the Division to which the business of Member\nCommerce is allocated or his representative not\nbelow BS-21\n(h)       Secretary of the Division to which the business of Member\nNational Food Security & Research is allocated or\nhis representative not below BS-21\n(i)       Secretary of the Division concerned to which the Member\nbusiness of Industries and Production is allocated or\nhis representative not below BS-21\n(j)       Chief Executive, Trade Development Authority of Member\nPakistan\n(k)       Executive Director, Export Development Fund     Member\n1\nSubs. by Act No. XI of 2026, s. 3.\nProvide that in case any of the exporter(s) under clause (a) and (b) of this sub-section opts not\nto accept the membership of the Board of Administrators, the next top exporter(s) from the same\ncategories specified in said clauses shall be offered the membership of the Board:\nProvided further that one of the three members nominated under clause (c) shall be from the\nSmall and Medium Enterprises (SME):\nProvided also that exporters nominated under clause (c) shall not be amongst the sectors\nrepresented in paragraphs (a) and (b).\n(2) The Chairman of the Board shall be appointed by the Federal Government from amongst\nthe private members.\n(3) The Secretary to the Board shall be appointed by the Board from amongst its’ members.\n(4) The Federal Government may appoint additional members as and when considered\nnecessary provided that the majority of the Board members shall be from private sector.\n(5) Meeting of the Board shall be presided over by the Chairman and, in his absence, by a\nprivate member elected by the Board.]\n6. 1[*                *                     *                *       *              *              *]"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Powers of the Board. The board shall have powers to",
      "content": "(a)     frame rules for the administration of the Fund;\n(b)     administer all matters of the Fund in accordance with the rules;\n(c)     approve annual budgets of the Fund’s operations and make such re-\nappropriation therein as may be necessary;\n(d)     incur expenditure within the sanctioned budget;\n(e)     delegate to the Chairman such powers as may be necessary;\n(f)     appoint committees and delegate to the committees such powers as may be\nnecessary; 1[*]\n(g)     accept donations and endowments provided that these are consistent with\nobjectives of the Fund and rules made under this Act 1[;]\n1\n[(h) review the viability and feasibility of existing portfolio of projects and decide as\nto whether they shall continue or be discontinued; and\n1\nOmitted, subs. and added by Act No. XI of 2026, ss. 4 and 5.\n(i)        review the performance of already executed projects under the EDF, oversee\nand steer the capacity building and reform process of EDF governance\nstructure and associated institutional arrangements.]"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Meetings",
      "content": "(1) Every meeting of the Board shall be presided over by the Chairman. 1[* *\n* * * * *]\n(2) Four members of the Board shall constitute quorum for a meeting of the Board.\n(3) The date, time and place of the meeting shall be notified not less than a week in advance\nand in case of emergent nature meeting, the meeting may be held on short notice.\n(4) At least two meetings of the Board shall be held every year commencing on the 1st day of\nJuly and terminating on the 30th day of June.\n(5) All disputed questions at any meeting of the Board shall be decided by a majority of the\nmembers present at the meeting and the Chairman shall have a casting vote.\n(6) Any business, which may be necessary for the Board to transact urgently, may be carried\nout by circulation among all its members and any proposal so circulated and approved by the\nmajority of the members shall require the approval of the Chairman.\n(7) The Secretary shall record all the proceedings of the meetings of Board.\n9. 1[*                *                *          *               *           *             *]\n10. 1[*               *                *          *               *           *             *]\n11. 1[*               *                *          *               *           *             *]\n12. 1[*               *                *          *               *           *             *]"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Employment of officers and servants. The Board may employ such officers and",
      "content": "servants or appoint such experts, consultants or advisers, from time to time, as it may consider\nnecessary for the performance of its functions on such terms and conditions as it may deem fit."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Recruitment and terms and conditions of service and disciplinary powers. The Board",
      "content": "shall prescribe the procedure for appointment and conditions of service for its officers and servants\nincluding disciplinary action and penalties."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Financial powers",
      "content": "(1) The powers to incur expenditure shall be as follows:—\n(i)        The Board                   ............ Full powers\n1\n(ii)           [*      *    *   *      *       *        *]\n(2) Expenditure from the Fund shall be made according to the merits and feasibility of\nprojects sponsored and export promotion needs of the exporters, trade promotion offices and trade\nbodies.\n1\nOmitted by Act No. XI of 2026, ss. 6, 7 and 8."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Maintenance of accounts.⸻ The Federal Government may, with the approval of the",
      "content": "Auditor General of Pakistan and the Ministry of Finance, make financial rules and procedures for\nmaintenance of accounts."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Audit",
      "content": "(1) The accounts of the Fund shall be audited every year by the Auditor General\nof Pakistan.\n(2) A copy of the Audit Report shall be sent to the Secretariat of the Board for comments and\nremedial action.\n1\n[19. Statements of Account.⸻ With the approval of the Board, the Principal Accounting\nOfficer shall submit quarterly and annual statements of actual receipt and expenditure to the relevant\nAccounting Office or Federal Treasury Office, and the Finance Division.]"
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Submission of annual reports",
      "content": "(1) As soon as possible, an annual report on the\nconduct of its affairs shall be submitted by the Board to the Federal Government after the end of the\nevery financial year but before the last day of December next following during the year.\n(2) A copy of the report referred to in sub-section (1) together with a copy of the audit report\nreferred to in section 18 shall be placed by the Federal Government before the National Assembly.\n(3) The Federal Government may call upon the Board to supply any information pertaining to\nits responsibilities under this Act and the Board shall comply with such requirements without\nunnecessary delay."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Officers and servants, etc to be public servants",
      "content": "(1) The Chairman, members, officers\nand servants of the Board and Committee shall, when acting or purporting to act, in pursuance of any\nof the provisions of this Act, be deemed to be public servants within the meaning of section 21 of the\nPakistan Penal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Delegation.⸻ The Board may, by general or special order, delegate to the Chairman,",
      "content": "member or an officer of the Board any of its powers, duties or functions under this Act subject to\nsuch conditions as it may think fit to approve.\n1\nSubs. by the Finance Act, 2022 (XIII of 2022) s. 3A."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Power to make regulations.⸻ The Board may, with the approval of the Federal",
      "content": "Government, make regulations not in consistent with the rules, for conduct of its business and its\nmeetings."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Repeal.⸻ The Government of Pakistan, Ministry of Commerce, Resolution S.R.O. No",
      "content": "843(I)/92, dated the 1st September, 1992, is hereby repealed."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Savings. Upon the commencement of this Act",
      "content": "(a) all funds, properties, rights and\ninterests of whatsoever kind issued, used, enjoyed, possessed, owned or vested in the Board set up\nunder Government of Pakistan, Ministry of Commerce Resolution No. 843 (I)/92, dated the 1st\nSeptember, 1992, and all liabilities legally subsisting against the said Board shall stand transferred to\nthe Board established under this Act; and\n(b) everything done, action taken, obligations or liabilities incurred, rights and assets\nacquired, persons appointed or authorized, powers conferred, funds or trusts created, donations or\ngrants made, orders issued and rules or regulations made by the Board established under the\nResolutions referred to in clause (a) shall be deemed to have been respectively done, taken, incurred,\nacquired, appointed, authorised, conferred, created, made or issued under this Act.\n_____________\nRGN Date: 04-02-2026"
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Board of Administrators constituted under section 5;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Board; 1 (c) [* * * * * * *]",
      "source_provision": "sec2"
    },
    {
      "term": "Fund",
      "definition": "the Export Development Fund established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member, permanent or co-opted, of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act; 1[and]",
      "source_provision": "sec2"
    },
    {
      "term": "Secretary",
      "definition": "Secretary of the Board 1[.] 1 (h) [* * * * * * *] 1 Omitted, subs. and ins. by Act No. XI of 2026, s. 2. 1 [3. Establishment of Export Development Fund.—(1) The Federal Government shall establish a Fund to be known as the Export Development Fund. (2) The Fund shall consist of.– (i) the whole receipts of Export Development Surcharge; (ii) donations and endowments; (iii) grants made by the Federal Government; and (iv) any income accruing to the Fund from its investments and property. (3) Each year, the Principal Accounting Officer (PAO) with the approval of the Board, shall prepare annual estimates of receipts into and plan-based payments out of the Fund and shall submit the same to the Finance Division, by end of April, for inclusion in the Annual Budget Statement. (4) The Fund shall be non-lapsable and shall be maintained in the Public Account of the Federation, in accordance with the provisions of the Public Finance Management Act, 2019, and the Rules, Regulations and Procedures made thereunder.]",
      "source_provision": "sec2"
    }
  ]
}
