{
  "id": "pk-export-processing-zones-authority-ordinance-1980",
  "type": "statute",
  "title": "Export Processing Zones Authority Ordinance, 1980",
  "title_en": "Export Processing Zones Authority Ordinance, 1980",
  "short_name": "EPZAO",
  "status": "in_force",
  "issued_date": "1980-02-05",
  "in_force_date": "1980-02-05",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NpbZY%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Export Processing Zones Authority Ordinance, 1980 (IV of 1980) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Zone to be bonded area",
      "content": "Every Zone shall be a bonded area.\nCHAPTER II.—CONSTITUTION OF THE AUTHORITY"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Establishment of the Authority",
      "content": "(1) There shall be established an Authority to be\nknown as the Export Processing Zones Authority for carrying out the purposes of this Ordinance.\n(2) The Authority shall be a body corporate, having perpetual succession and a common seal,\nwith power, subject to the provisions of this Ordinance, to acquire and hold property, both moveable\nand immovable, and shall by the said name sue and be sued."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Management",
      "content": "The general direction and administration of the Authority and its affairs\nshall vest in a Board."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Constitution of the Board",
      "content": "(1) The Board shall consist of not more than nine members,\nincluding the Chairman to be appointed by the Federal Government.\n(2) The Chairman and other members of the Board shall hold office during the pleasure of the\nFederal Government and unless sooner removed shall hold office for a period of three years.\n(3) No act or proceeding of the Board shall be invalid merely on the ground of the existence\nof any vacancy in, or defect in the constitution of, the Board.\n(4) The Chairman and each member of the Board shall receive such salaries and allowances\nor such fee as may be determined by the Federal Government in each case.\n1\nSubs. by Act No. XXXVI of 2023, s.2."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Duties and functions of Chairman and Members",
      "content": "(1) The Chairman and members\nshall discharge such duties and perform such functions as are assigned to them under this Ordinance\nor by the Federal Government.\n(2) Until the Board is duly constituted, the Chairman shall, subject to such directions as the\nFederal Government may, from time to time, give, exercise the powers, discharge the duties and\nperform the functions of the Board."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Headquarters of the Authority",
      "content": "The headquarters of the Authority shall be situated at\nKarachi.\nCHAPTER III.—POWERS AND DUTIES OF THE AUTHORITY"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Master plan and master programme",
      "content": "The Authority shall prepare a master plan and a\nphased master programme for the development of the Zones.\n1[9A. Establishment of Private and Public Participated Export Processing Zones.—(1)\nThe Authority may, with the approval of the Federal Government establish Private and Public\nParticipated Export Processing Zones:\nProivded that existing industry or industries, as the case may be, subject to fulfillment of\ncriteria, may be declared part of a Private and Public Participated Exprot Processing Zone:\nProvided further that the Private and Public Participated Export Processing Zones may be\nestablished in the area contiguous to the industry or industries so declared under sub-seciton (1).\n(2) The Private and Public Participated Export Processing Zones established under sub-\nsection(1) shall operate subject to such terms approved by the Federal Government.]"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Preparation of schemes for infrastructure",
      "content": "The Authority may, pursuant to the master\nplan, prepare schemes in respect of—\n(a)       land use, zoning and land reservation;\n(b)       public buildings;\n(c)       industrial warehousing and buildings;\n(d)       transportation and communications ; roads, streets, railways, jettys walls,\nworkshops, sheds, godowns, navigation channels;\n(e)       telecommunications, including wireless, telex and telephones;\n(f)       community facilities, including water supply, sewerage disposal, electricity\nsupply, gas supply and other public utilities; and\n(g)       environmental control and prevention of pollution."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Sanctioning of industries, etc",
      "content": "(1) The Authority may, with the approval of the Federal\nGovernment, frame schemes and lay down procedure in respect of sanctioning the establishment and\noperation of industries in the Zones.\n1\nIns. by Act No. XXXVI of 2023, s.3.\n(2) Any industry sanctioned under sub-section (1) shall operate subject to such terms and\nconditions as may be enunciated in the letter of sanction issued by the Authority.\n(3) The materials and manufactured goods shall not be exported from the Zones into the tariff\narea except to the extent and in the manner to be specified by the Authority in each case with the\nprior approval of the Federal Government."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Powers of the Authority",
      "content": "(1) Subject to the other provisions of this Ordinance and the\nrules, the Authority may take such measures and exercise such powers as may be necessary for\ncarrying out the purposes of this Ordinance.\n(2) In particular, and without prejudice to the generality of the powers conferred by\nsub-section (1), the Authority may—\n(i)     incur any expenditure;\n(ii)    undertake any work in the Zones in pursuance of any scheme;\n(iii)   procure plants, machinery, instruments and material required for its use;\n(iv)    enter into and perform all such contracts as it may consider necessary;\n(v)     cause studies, surveys, experiments and technical research to be made or\ncontribute towards the cost of any such studies, surveys, experiments or\ntechnical research;\n(vi)    restrict or prohibit by general or special order any change in the use of land\nand alteration in buildings and installations; and\n(vii)   cause removal of any work obstructing the execution of any of its schemes.\nCHAPTER IV—ACQUISITION OF LAND"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Liability to acquisition",
      "content": "All land within the Zones shall be liable to acquisition at any\ntime in accordance with the provisions of this Chapter."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Acquisition of Land",
      "content": "(1) Where any land or interest in any land within any Zone is\nrequired by the Authority for any of its purposes, that land or interest shall be acquired under the\nLand Acquisition Act, 1894 (I of 1894), by the Provincial Government concerned at the request of\nthe Authority.\n(2) The acquisition of land or interest therein shall, for the purposes of the Land Acquisition\nAct, 1894 (I of 1894), be deemed to be required for a public purpose.\nCHAPTER V—ESTABLISHMENT"
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Establishment",
      "content": "(1) The Authority may, from time to time, appoint such officers,\nservants, experts or consultants as it may consider necessary for the performance of its functions, on\nsuch terms and conditions as it may deem fit:\nProvided that the Chairman may, in cases of urgency, appoint such officers, servants, experts\nor consultants and on such terms and conditions as he deems fit, subject to subsequent approval by\nthe Board.\n(2) The Authority shall be competent to take disciplinary action against its officers and\nservants."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Chairman, members, officers, etc., to be public servants",
      "content": "The Chairman, members,\nofficers, servants, experts and consultants of the Authority shall, when acting or purporting to act in\npursuance of any of the provisions of this Ordinance, be deemed to be public servants within the\nmeaning of section 21 of the Pakistan Penal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Indemnity",
      "content": "No suit, prosecution or other legal proceeding shall lie against the\nAuthority, the Chairman, any member, officer, servant, expert, or consultant of the Authority in\nrespect of anything done or intended to be done in good faith under this Ordinance."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Delegation of powers",
      "content": "The Authority may, by general or special order, delegate to the\nChairman or a member or officer of the Authority any of its powers, duties or functions under this\nOrdinance, subject to such conditions as it may think fit to impose.\nCHAPTER VI—FINANCE"
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Authority Fund",
      "content": "(1) There shall be established a fund to be known as the Export\nProcessing Zones Authority Fund which shall vest in the Authority and shall be utilised by the\nAuthority, in accordance with the general or specific directions of the Federal Government to meet\ncharges in connection with its functions under this Ordinance, including the payment of salaries and\nother remuneration to the Chairman, members, officers, servants, experts and consultants of the\nAuthority.\n(2) The Export Processing Zones Authority Fund shall consist of—\n(a)    grants made by the Federal Government ;\n(b)    loans obtained from Government ;\n(c)    grants made by the local bodies ;\n(d)    sale proceeds of moveable and immoveable property and receipts for services\nrendered ;\n(e)    loans obtained by the Authority with the special or general sanction of the\nFederal Government ;\n(f)    foreign aid and loans obtained from any source outside Pakistan with the\nsanction of, and on such terms as may be approved by, the Federal\nGovernment ;\n(g)    all rates, taxes, fees, charges levied and fines imposed by the Authority under\nthe regulations made under this Ordinance ;\n(h)    all revenues derived by the Authority from any property administered by the\nAuthority ; and\n(i)    all other sums receivable by the Authority."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Authority to be deemed to be a local Authority",
      "content": "The Authority shall be deemed to be\na local authority within the meaning of the Local Authorities Loans Act, 1914 (IX of 1914), for the\npurpose of borrowing money in accordance with the said Act and the execution of any scheme under\nthis Ordinance shall be deemed to be a work which such authority is legally authorized to carry out."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Borrowing, etc., by the Authority",
      "content": "The Authority may, with the prior approval in\nwriting of the Federal Government, raise funds for the purpose of its working capital by issuing\nbonds and debentures carrying interest at such rates as may be approved by the Federal Government."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Budget",
      "content": "In the month of January each year, the Authority shall submit to the Federal\nGovernment for approval a statement of the estimated receipts and expenditure in respect of the next\nfinancial year in such manner and form as may be prescribed."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Audit and accounts",
      "content": "(1) The accounts of the Authority shall be audited every year by\nthe Auditor-General of Pakistan in such manner as may be prescribed.\n(2) Copies of the audit report shall be sent to the Authority and the Authority shall send the\nreport along with is comments to the Federal Government.\n(3) The audit report shall be available for public inspection.\n(4) The Federal Government may issue directions to the Authority for the rectification of\nmatters objected to by the Auditor-General and the Authority shall comply with every such direction.\nCHAPTER VII—MISCELLANEOUS"
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Disputes to be referred to arbitration",
      "content": "(1) Any dispute relating to the interpretation of\nthe provisions of any agreement made under any scheme prepared under section 10 between the\nAuthority and an investor or the rights of the parties to such agreement or any rights conferred or any\nliability imposed by this Ordinance shall be referred for arbitration to an arbitrator appointed by the\nparties.\n(2) Any award made upon such reference shall be final and binding on the parties and shall\nnot be subject to any appeal or any other remedy.\n(3) The provisions of the Arbitration Act, 1940 (X of 1940), shall, so far as they can be made\napplicable, apply to arbitrations under sub-section (1)."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Power to exempt",
      "content": "The Federal Government may, by notification in the official Gazette,\nexempt any Zone from the operation of all or any of the provisions of any law for the time being in\nforce which relates to any matter within the legislative competence of Parliament."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Power to make rules",
      "content": "The Federal Government may, by notification in the official\nGazette, make rules for carrying out the purposes of this Ordinance."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Power to make regulations",
      "content": "(1) The Authority may, with the approval of the Federal\nGovernment, make regulations, not inconsistent with the provisions of this Ordinance or the rules,\nfor carrying out the purposes of this Ordinance.\n(2) In particular and without prejudice to the generality of the foregoing power, such\nregulations may provide for the levy of fees, rates and charges for services rendered by the\nAuthority.\n_________________"
    }
  ],
  "definitions": []
}
