{
  "id": "pk-export-import-bank-of-pakistan-act-2022",
  "type": "statute",
  "title": "Export-Import Bank of Pakistan Act, 2022",
  "title_en": "Export-Import Bank of Pakistan Act, 2022",
  "short_name": "EBOPA",
  "status": "in_force",
  "issued_date": "2022-10-17",
  "in_force_date": "2022-10-17",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5lraw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Export-Import Bank of Pakistan Act, 2022 (XXII of 2022) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act shall be called the Export-\nImport Bank of Pakistan Act, 2022.\n(2) It extends to the whole of Pakistan.\n(3) This Act shall come into force at once, save for sections 35 and 36 which shall, to the\nextent provided therein, come into force on the date of the notification issued by the Federal\nGovernment or the respective Provincial Governments."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,\n—\n(i)        “Bank” means the Export-Import Bank of Pakistan established under\nsection 3;\n(ii)       “Board” means the Board of Directors of the Bank;\n(iii)      “chairman” means the chairman of the Board;\n(iv)       “director” means a member of the Board and shall include the President\nof the Bank;\n(v)        “entity” means any entity other than a natural person and shall include\na company, sole proprietorship, a partnership or association of persons,\na trust, body corporate, society and foreign agencies;\n(vi)      “equity participation” means participation by the Bank in a trade\ninvestment by way of an equity investment in an entity in or outside\nPakistan;\n(vii)     “export” shall have the same meaning assigned to it under the Imports\nand Exports (Control) Act, 1950 (XXXIX of 1950);\n(viii)    “finance” shall have the same meaning assigned to it under the\nFinancial Institutions (Recovery of Finances) Ordinance, 2001 (XLVI\nof 2001);\n(ix)      “financial institution” shall have the same meaning assigned to it\nunder the Financial Institutions (Recovery of Finances) Ordinance,\n2001 (XLVI of 2001);\n(x)       “foreign agencies” means any national, provincial, state or local\ngovernment of a foreign country or any political sub-division and any\nagency thereof, including but not limited to a foreign export credit\nagency;\n(xi)      “import” shall have the same meaning assigned to it under the Imports\nand Exports (Control) Act, 1950 (XXXIX of 1950);\n(xii)     “international trade” means the export or export-oriented import of\ngoods and services to and from Pakistan in accordance with laws for the\ntime being in force and shall include re-export and merchanting trade;\n(xiii)    “international trade schemes” means any existing or future funds,\nschemes and programs that are launched and implemented for the\nsupport, development and promotion of international trade;\n(xiv)     “negotiable instrument” shall have the same meaning as is assigned to\nit under the Negotiable Instruments Act, 1881 (XXVI of 1881);\n(xv)      “person” includes a natural person or any legal entity, in or outside\nPakistan;\n(xvi)     “prescribed” means prescribed by rules or regulations made under this\nAct;\n(xvii)    “President” means the chief executive officer of the Bank appointed\nunder section 15;\n(xviii)   “private sector director” means a director appointed under section 17;\n(xix)      “prudential regulations” means the rules, regulations, directions,\norders and circulars issued, from time to time, by the State Bank under\nlaw administered by the State Bank and constituting the regulatory\nframework applicable to the Bank;\n(xx)       “regulations” means regulations made under section 41;\n(xxi)      “rules” mean the rules made under section 40;\n(xxii)     “securities” shall have the same meaning as is assigned to it under the\nCompanies Act, 2017 (XIX of 2017);\n(xxiii)    “security interest” means an interest in a or a charge on property by\nway of mortgage, lien, pledge or otherwise taken to secure the payment\nor performance of an obligation;\n(xxiv)     “State Bank” means the State Bank of Pakistan established under the\nState Bank of Pakistan Act, 1956 (XXXIII of 1956) and being the\ncentral bank of the Islamic Republic of Pakistan;\n(xxv)      “trade credit insurance” means a transaction to provide conventional\nor Shariah compliant insurance or reinsurance to any person in relation\nto risks associated with international trade or a trade investment;\n(xxvi)     “trade financing” means a transaction to provide conventional or\nShariah compliant finance to any person in relation to international\ntrade or a trade investment;\n(xxvii)    “trade investment” means an investment transaction, by way of debt\nor equity, by any person in or outside Pakistan for the establishment,\nexpansion or acquisition of, or technology transfer, technical\ncooperation or development of intellectual property in relation to, an\nexport or export oriented or import substituting business or industry;\nand\n(xxviii)   “trade services” means a transaction to provide advisory, consulting or\nother support services to any person in connection with international\ntrade or a trade investment."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Bank",
      "content": "(1) On commencement of this Act, the Export-Import\nBank of Pakistan shall stand established.\n(2) The Bank shall be a body corporate having perpetual succession and a\ncommon seal, and shall by the said name sue and be sued.\n(3) The head office of the Bank shall be situated in Islamabad, or at such other place\nas the Federal Government may, by notification in official Gazette, specify. The Bank may\nestablish branches and offices anywhere in or outside Pakistan."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Bank deemed a financial institution",
      "content": "Immediately on the commencement of this Act,\nthe Federal Government shall, by notification in the official Gazette, declare the Bank as a financial\ninstitution under section 3A of the Banking Companies Ordinance, 1962 (LVII of 1962)."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Dissolution and Transfer of assets of EXIM Bank of Pakistan Limited",
      "content": "(1)\nNotwithstanding anything contained in the Companies Act, 2017 (XIX of 2017) and any other\nPakistan law for the time being in force, the Federal Government shall, by an order published in\nthe official Gazette, transfer to the Bank the whole of the undertaking of the existing EXIM Bank\nof Pakistan Limited.\n(2) The order under sub-section (1) shall provide for—\n(a)     that all the assets, rights, powers, authorities, privileges and all paroperties,\nmovable and immovable, cash and bank balances, reserve funds,\ninvestments and all other interests and rights in, or arising out of such\nproperties and all, or part of, debts, liabilities and obligations of whatever\nkind of the existing Export-Import Bank of Pakistan Limited Subsisting\nimmediately before the date of the order shall stand transferred to and vest\nin the Bank;\n(b)     that all the contracts entered into, or the rights, licences, approvals and\nconsents acquired and all matters and things engaged to be done by, with or\nfor the existing Export-Import Bank of Pakistan Limited before the date of\nthe order shall be deemed to have been incurred, entered into, acquired or\nengaged to be done by, with or for the Bank, as the case may be;\n(c)     that all suits and other legal proceedings instituted by or against the existing\nExport-Import Bank of Pakistan Limited before the date of the order shall\nbe deemed to be suits and proceedings instituted by or against the Bank as\nthe case may be and be dealt with accordingly; and\n(d)     that the continuance of the services of all the permanent employees\n(excluding personnel on secondment, deputation or probation) of the EXIM\nBank of Pakistan Limited in the Bank on not less favorable than the existing\nterms and conditions of their services, rights and privileges and other\nmatters as were applicable to them before the date of the order.\n(3) Upon issuance of the order under sub-section (1), the registrar of companies shall strike\noff the name of Export-Import Bank of Pakistan Limited which shall, with effect from the date of\nthe order, cease to exist.\n(4) Notwithstanding any law for the time being in force, transfer of any property, asset or\nliability pursuant to the said order shall not constitute a conveyance, novation or assignment, and\nno fees, taxes, levies, stamp duties or any other charges shall be payable by the Bank or the EXIM\nBank of Pakistan Limited on the transfer and vesting of the whole or any part of the undertaking\nand property and liabilities of existing EXIM Bank of Pakistan Limited to the Bank pursuant to\nthe order issued under sub-section (1)."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Share capital of the Bank",
      "content": "(1) The authorized share capital of the Bank shall be one\nhundred billion Rupees, or such other amount as the Federal Government may, from time to time,\nspecify by notification in the official Gazette, and shall be divided into ten billion shares of a par\nvalue of Rupees ten each.\n(2) The initial paid up capital of the Bank shall be ten billion Rupees divided into one\nbillion fully paid-up shares at par value which shall be wholly subscribed by the Federal\nGovernment.\n(3) On the recommendation of the Board, the paid-up capital of the Bank may, from time\nto time, be increased through subscription of shares by the Federal Government for such amount\nand on such terms as the Federal Government may approve.\n(4) The Federal Government shall, at all times, be the sole shareholder of the Bank."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Borrowings",
      "content": "The Bank may, for the purposes of the Bank’s business, borrow in local\nor foreign currency on such terms and conditions as may be prescribed by the Board and subject\nto the provisions of other laws, from the following sources, namely\n(a)     the Federal Government;\n(b)     international bilateral and multilateral agencies;\n(c)     financial institutions;\n(d)    the public by issuing, on its own or through a wholly owned or controlled\nsubsidiary, securities in or outside Pakistan; or\n(e)    through such other means as may be permitted under the prudential\nregulations or is otherwise approved by the State Bank."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Reserves and provisions",
      "content": "The Bank may, in accordance with the prudential\nregulations, establish one or more general or special purposes reserves or provisions out of which\nmay be paid any losses sustained by the Bank in the conduct of its business."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Purpose of the Bank",
      "content": "The Bank is established for the purposes of—\n(a)    supporting, promoting and developing international trade, trade\ninvestments, export-oriented and imported substituting businesses and\nindustries in accordance with the provisions of this Act and the national\ntrade policies and programs of the Federal Government;\n(b)    the administration, operation and management of such international trade\nschemes as may be transferred or outsourced to the Bank by the Federal\nGovernment or any of its agencies, or the State Bank, as a trustee, agent, or\nservice provider, on such terms and conditions as may be prescribed through\nthe rules under this Act; and\n(c)    the discharge of any function entrusted to it by the Federal Government by\nnotification in official Gazette for the advancement of the purposes of the\nBank under this Act and on such terms and conditions as may be specified,\nsubject to the provisions of this Act, by the Federal Government in such\nnotification."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Powers and business of the Bank",
      "content": "(1) The Bank shall carry on such business and\nexercise such powers as are necessary or expedient for, or are incidental to, for the advancement\nof the purposes of the Bank under this Act, having due regard to the principles of financial\nsoundness and sustainability.\n(2) Without prejudice to the generality of the foregoing, and subject to other laws and any\nconditions as, may be prescribed, the Bank may—\n(a)    acquire, hold, possess, lease or otherwise dispose of any interest in any\nmovable and immovable property in or outside Pakistan;\n(b)   provide, on its own or with other financial institutions or insurance\nproviders in or outside Pakistan, trade financing, trade credit insurance and\nequity participation;\n(c)   provide trade services;\n(d)   restructure, reschedule or write-off any trade financing, trade credit\ninsurance or equity participation by the Bank;\n(e)   acquire or dispose of any interest in an entity, other than foreign agencies,\nin or outside Pakistan;\n(f)   purchase, hold and sell local and foreign securities;\n(g)   charge, receive and utilize fees, premium, and charges for carrying out its\nbusiness;\n(h)   take any security interest in any property;\n(i)   obtain reinsurance from any foreign agencies or any insurance companies\nin or outside Pakistan;\n(j)   draw, buy, sell, accept, negotiate, avalise, factor, discount or rediscount\nnegotiable instruments drawn or payable in or outside Pakistan;\n(k)   open, maintain and operate banks accounts in local and foreign currency\nwith financial institutions in and outside Pakistan;\n(l)   enter into and perform all contracts and agreements for conducting any of\nits business;\n(m)   invest surplus funds of the Bank in accordance with the directions of the\nBoard;\n(n)   carry out insurance agency or brokerage activities;\n(o)   act as an agent for any person or authorize any person to act as agent for the\nBank;\n(p)   incorporate subsidiaries and enter into joint ventures in or outside Pakistan\nwith any person or foreign agency to conduct any form of business that can\nbe conducted by the Bank or is incidental to the purpose of the Bank under\nthis Act;\n(q)     sell and realize all property, whether movable or immovable, which may in\nany way come into the possession of the Bank in satisfaction, or part\nsatisfaction of, any of its claims; and\n(r)     purchase, sell and otherwise deal in foreignn exchange and derivative\ntransactions."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Board of directors",
      "content": "(1) The general superintendence, direction and management\nof the affairs and business of the Bank and overall policy making in respect of its operations\nshall, vest in the Board constituted under sub-section (2) which may exercise all such powers\nand do all such acts, deeds and things that may be exercised or done by the Bank.\n(2) The composition of the Board shall be as under—\n(a)      A person, nominated by the Federal               Chairman\nGovernment.\n(b)      Secretary, Ministry of Commerce                  ex-officio director\n(c)      Additional Secretary, Ministry of Finance        ex-officio director\n(d)      three directors to be appointed by the           Independent director\nFederal Government from the private sector\nin accordance with section 17\n(e)      The President to be appointed under section      ex-officio director\n15\n(3)     Each director shall exercise his powers and carry out his duties with due and\nreasonable care, skill and diligence and with a sense of objective judgment and independence, for\nthe promotion of the objects, and in the best interests, of the Bank."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Functions of the Board",
      "content": "Without prejudice to the generality of sub-section (1) of\nsection 11, the Board shall perform the following functions, namely—\n(a)     formulate, approve and ensure implementation and periodic review of\npolicies to carry out effectively the provisions of this Act, including but not\nlimited to, policies on trade financing, trade credit insurance, equity\nparticipations, risk management, treasury and investment, corporate\ngovernance, procurement, internal control system and audit, information\ntechnology (IT) security, human resource, expenditure, accounting and\ndisclosure and any other operational area which the Board may deem\nappropriate from time to time;\n(b)     approve and monitor the implementation of any long-term strategic plan,\nthe annual business plan and operating and capital budgets for the Bank;\n(c)     formulate, approve and issue regulations under section 41; and\n(d)     discharge all such functions as are assigned to it under this Act or as may\nbe prescribed."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Committees of directors",
      "content": "(1) The Board shall, from amongst the directors,\nConstitute an audit committee and may constitute such other committees as it considers necessary\nto assist it in carrying out its functions under this Act, and shall prescribe through regulations the\nconstitution, powers and functions of such committees.\n(2)      The minutes of every meeting of a committee of directors shall be presented before\nthe Board at its next meeting following the meeting of the committee.\n(3)    The Board or any of its committees may invite a representative of the Federal\nGovernment, a reputable private institution or a technical or professional expert to assist in the\nperformance of its functions."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Chairman and Deputy Chairman",
      "content": "(1) The office of the Chairman shall be separate\nand his responsibilities distinct, from those of the President.\n(2)    In the event of the absence or incapacity of the Chairman, or if the office of the\nChairman is vacant, the Deputy Chairman shall perform the functions of the Chairman during such\nabsence, incapacity or vacancy."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Appointment of President",
      "content": "(1) The Board shall appoint a full-time President in\naccordance with the procedure set forth in sub-section (2):\nProvided that the President of the existing EXIM Bank of Pakistan Limited shall, in terms\nof clause (d) of sub-section (2) of section 5, be the first President of the Bank.\n(2) The Board shall shortlist and recommend at least three candidates for the approval by\nthe Federal Government of one of the candidates for the office of the President of the Bank. On\nreceiving the approval of the Federal Government, the Board shall appoint such candidate as the\nPresident for a term of three years and on such terms and conditions as may be prescribed by the\nBoard under this Act.\n(3) A person from the private sector shall be eligible for recommendation as candidate and\nappointment as the President if he meets the fit and proper criteria as specified in the prudential\nregulations.\n(4) The President shall be the chief executive officer of the Bank and shall, subject to the\ncontrol, policies and directions of the Board, be responsible for the management and day to day\naffairs of the Bank, and shall have such powers for this purpose as are delegated to him, from time\nto time, by the Board and that are not by this Act or by any rules or regulations expressly directed\nor required to be done by the Board.\n(5) On the expiry of his term of office, the President shall, with the prior approval of the\nFederal Government, be eligible for reappointment for upto one term of three years each or less,\nand on such terms and conditions as may be determined by the Board."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Ex",
      "content": "officio directors.—(1) An ex-officio director shall hold office as director till such\ntime as he holds the office by virtue of which he is a director and upon his transfer, retirement,\nresignation, death or removal from such office, the person appointed in place of such director shall\nhold office for the remaining term of that director.\n(2) If an official ex-officio director is absent from Pakistan or is unable to attend a meeting\nof the Board, he may authorize an officer not below the rank of additional secretary or joint\nsecretary, as applicable, or equivalent to attend the meeting and take decisions on behalf of such\ndirector. A non-official ex-officio director may, in similar situation, authorize his Vice-chairman\nor equivalent for the purpose of attending the meeting and take decisions on behalf of such director."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Appointment of private sector director",
      "content": "(1) The Federal Government shall appoint\nsuch person from the private sector as a private sector director who meets the fit and proper criteria\nas specified in the prudential regulations.\n(2) A private sector director shall be appointed for a term of three years and on such terms\nand conditions as the Board may determine under section 19.\n(3) On the expiry of his term of office, a private sector director may be reappointed by the\nFederal Government for an additional term of three years or less and on such terms and conditions\nas may be determined by the Board."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Disqualification of directors",
      "content": "No person shall continue to hold office as director\nwho—\n(a)     fails to meet the fit and proper criteria as specified in the prudential regulations;\n(b)     is incapable of discharging his duties by reasons of physical or mental unfitness for\na period of six months or more; or\n(c)     has been absent from three or more successive meetings of the Board without leave\nof the Board and in the case of an ex-officio director fails to appoint another person\nto act as director as required under section 16."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Remuneration of directors",
      "content": "(1) The Board shall, determine the remuneration\npackage of the directors in the prescribed manner, and such remuneration package shall not be\nvaried to their disadvantage during the term of their office.\n(2) For the purposes of this section, remuneration package shall include fees and\nreimbursement of reasonable travel, accommodation and related expenses, for attending meetings\nof the Board and any extra services to be provided by the directors, other than the President."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Removal of directors",
      "content": "(1) The Federal Government may remove a director, other\nthan the President, from his office in accordance with this section for any one or more reasons\nunder sub-section (3).\n(2) The President may be removed from his office by the Board, with the prior approval of\nthe Federal Government, in accordance with this section and for any one or more reasons under\nsub-section (3).\n(3) A director shall be removed if he—\n(a)     becomes ineligible for one or more reasons under section 18; or\n(b)     is not discharging his responsibilities and functions under this Act based on\na performance evaluation carried out by the Board.\n(4) A director shall not be removed unless he has been given an opportunity of being heard\nin the manner prescribed before taking any such action."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Resignation of directors",
      "content": "The President and any private sector director may, at any\ntime, resign from his office by giving a written notice of at least two months to the Board and\nFederal Government respectively."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Casual vacancies",
      "content": "(1) The office of a director shall become vacant if he—\n(a)     dies;\n(b)     completes the term of his office and is not re-appointed;\n(c)     is removed from office under section 20; or\n(d)     resigns from office under section 21.\n(2) If the office of the President is vacant, the Board may appoint any director or senior\nofficer of the Bank to act as the President for the time being and shall fix the terms and conditions\nof his appointment and his remuneration, provided that such acting President shall not continue in\noffice for a period exceeding one month without prior approval of the Federal Government.\n(3) If the office of the President or a private sector director becomes vacant, a person shall\nbe appointed to fill the vacancy at the earliest and no later than two months from the date on which\nsuch vacancy occurs.\n(4) The person appointed under sub-section (3) to fill a vacancy created under clause (a),\n(c) or (d) of sub-section (1), shall hold office for the remainder of the term of the director in whose\nplace he is appointed.\n(5) Upon resignation or expiration of the term of office, if the new director has not yet been\nappointed, the director resigning or retiring at the end of such term, shall remain in office until the\nappointment of the new director."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Board meetings",
      "content": "(1) There shall be at least one meeting of the Board every quarter\nto be convened by the Chairman, provided that the Chairman shall convene a meeting at any time\non the request, in writing, of three or more directors.\n(2) The Chairman shall preside the meetings of the Board. If the Chairman is not present\nat the meeting, the Deputy Chairman shall preside over such meeting. If the Chairman and the\nDeputy Chairman are not present at the meeting, the directors attending the meeting shall, if they\nconstitute a quorum, elect a director to act as the Chairman and preside over such meeting.\n(3) The quorum for a meeting of the Board shall not be less than five directors attending in\nperson or through video-link.\n(4) The Board shall make decisions by a majority of the votes of the directors present and\nvoting at a meeting of the Board at which quorum is present. Each director shall have one vote. In\ncase of an equality of votes, the Chairman shall have a casting vote.\n(5) A resolution in writing signed by all directors shall be as effective as if such resolution\nhas been passed at a meeting of the Board.\n(6) Minutes shall be kept of the proceedings of every meeting of the Board and all\ndeterminations and decisions of the Board shall be in writing and signed by the President.\n(7) The Board shall meet at such times and places and shall observe such rules of Procedure\nin regard to the business transacted at its meetings as may be prescribed by the Board.\n(8) No act or proceedings of the Board or any committee of the Board shall be invalid\nmerely on the ground of the existence of any vacancy in, or defect in the constitution of, the Board\nor such committee."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Delegation of powers",
      "content": "(1) The Board may, for the purpose of ensuring smooth and\nefficient functioning of the Bank and subject to the conditions and limitations as it may impose,\ndelegate any of its functions or powers to the President or any director or any officer of the Bank.\n(2) The President may, at his discretion, and subject to the conditions and limitations as he\nmay impose, delegate any of his functions to any other officers of the Bank with the approval of\nthe Board.\nSOVEREIGN SUPPORT AND REPORTING, REGULATION AND APPLICATION OF"
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Sovereign guarantee",
      "content": "(1) The Federal Government hereby guarantees all liabilities\nand obligations of the Bank in relation to its business, subject to such limits on the amount and\nvalidity period of the sovereign guarantee as may, from time to time, be notified by the Federal\nGovernment by way of a notification in the official Gazette. No amounts may be payable by the\nFederal Government in excess of, or beyond the validity period of, the sovereign guarantee as\nnotified by the Federal Government pursuant to this sub-section.\n(2) Before issuing a notification under sub-section (1), the Federal Government shall\ndetermine, with the prior consultation of the Board and the State Bank, the limits on the amount\nof the sovereign guarantee in accordance with the existing laws and the exposure limits specified\nin the prudential regulations.\n(3) No fees shall be payable by the Bank to the Federal Government in relation to the\nsovereign guarantee under sub-section (1)."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Regulatory authority",
      "content": "Subject to the provisions of sections 27 of this Act, the Bank\nshall be subject to regulatory supervision by the State Bank."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Application of other laws",
      "content": "(1) The provisions of the Banking Companies Ordinance,\n1962 (LVII of 1962) and rules, regulations, and directions issued there under, as applicable to\nfinancial institutions notified under the said Ordinance, shall be applicable to the Bank in relation\nto the Bank’s activities, subject to such modifications as may be determined, from time to time, by\nthe State Bank, to be necessary or expedient for the advancement of the objectives of the Bank\nunder this Act in the public interest.\n(2) The provisions of the Foreign Exchange Regulation Act, 1947 (VII of 1947), and rules,\nregulations, and directions issued thereunder, shall be applicable to the Bank in relation to its\ndealings with foreign exchange, subject to such modifications as may be determined, from time to\ntime, by the State Bank, to be necessary or expedient for the advancement of the objectives of the\nBank under this Act in the public interest.\n(3) For the advancement of the objectives of the Bank under this Act in the public interest,\nthe laws specified in the Schedule and any rules, regulations, orders and directions issued there\nunder, shall not apply to the Bank. The Federal Government may, by notification in the official\nGazette, make such additions to the Schedule as it deems fit."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Bank to furnish performance report",
      "content": "(1) The Bank shall, at the end of each\nfinancial year, furnish, through the Ministry of Finance, to the Federal Government, a performance\nreport with respect to the implementation by the Bank of the national trade policies and programs\nof the Federal Government it is pursuing or proposes to pursue in the conduct of its business under\nthis Act.\n(2) The performance report under sub-section (1) shall be approved by the Board and shall\nbe signed by the Chairman and the President."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Strategic policy directions from Federal Government",
      "content": "(1) If in the opinion of the\nFederal Government, the Bank is carrying out its business, operations and activities in a manner\nthat is inconsistent with the national trade policies and programs of the Federal Government, the\nFederal Government may, by notification in the official Gazette, and after prior consultation with\nthe State Bank and the Board, issue such strategic policy directions to the Bank as it considers\nnecessary in the public interest and not otherwise inconsistent with the principles of financial\nsoundness and sustainability and prudential regulations.\n(2) Policy directions issued by the Federal Government under sub-section (1) shall be\nbinding on the Bank."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Accounts",
      "content": "(1) The financial year of the Bank shall commence on the first day of\nJanuary and end on the thirty-first day of December.\n(2) The Bank shall maintain proper accounts and other records to reflect a true and fair\nview of its state of affairs and prepare quarterly, half-yearly and annual statement of accounts in\naccordance with the prudential regulations, and any regulations prescribed by the Board.\n(3) The statement of accounts of the Bank shall be approved by the Board and shall be\nsigned by the Chairman and the President, or in the absence of the Chairman, by the President and\nany two directors."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Audit",
      "content": "(1) The annual statement of accounts of the Bank shall be audited each\nfinancial year by an independent external auditor appointed under sub-section (2) in accordance\nwith the directions of the State Bank, as applicable to the Bank, and any regulations prescribed by\nthe Board.\n(2) The Board shall appoint a duly qualified firm of chartered accountants within the\nmeaning of the Chartered Accountants Ordinance, 1961 (XII of 1961) from the panel of auditors\nmaintained by the State Bank from time to time, as the independent auditor of the Bank for such\nterm and such remuneration as the Board may determine.\n(3) The Board shall, in addition to the audit under sub-section (1), cause to be carried out\ninternal audit of the Bank’s statement of accounts, systems, and procedures, and the internal\nauditors’ reports shall be submitted to the Board.\n(4) Notwithstanding anything contained in sections 30 and 31, the maintenance and audit\nof accounts of the Bank shall be subject to the provisions of Articles 169 and 170 of the\nConstitution of the Islamic Republic of Pakistan."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Review report to Parliament",
      "content": "(1) The Federal Government shall review, or shall\ncause the review of, the Act and the Bank and its activities after three years of the date of\ncommencement of this Act and every five years thereafter.\n(2) The Federal Government shall, within one year after the review undertaken under sub-\nsection (1), submit a report on such review to both houses of the Parliament for consideration."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Appointment of employees, advisors, consultants, etc",
      "content": "In order to carry on its\nbusiness under this Act, the Bank may—\n(a)     on full time, temporary or on deputation basis, employ officers and other\nemployees in the manner and on the terms and conditions as may be\nprescribed by regulations; and\n(b)     appoint technical, professional and other advisers, agents, consultants and\nexperts to advise the Bank or do any act in relation to the Bank’s business\nunder this Act on such terms and conditions as it may consider appropriate."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Directors, officers, etc. not to be civil servants",
      "content": "Save as otherwise provided or\ncontemplated by this Act and only for the purposes so provided or contemplated, nothing herein\ncontained shall be construed to mean that any director, officer, employee and other person\nemployed by the Bank is or shall be deemed to be in the service of Pakistan or is to be regarded or\ntreated as a civil servant."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Exemption from stamp duty",
      "content": "Notwithstanding anything contained in the Stamp\nAct, 1899 (II of 1899), the Bank shall not be liable to the payment of any stamp duty in respect of\nany instrument by, or in favour of, the Bank:\nProvided that this section shall within the jurisdiction of the Islamabad Capital Territory,\nbecome applicable immediately on commencement of this Act and each of the Provinces, shall\nbecome applicable upon notification or legislation by the respective Provincial Governments."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Exemption from taxes",
      "content": "Notwithstanding anything contained in the Wealth Tax Act,\n1963 (XV of 1963), the Income Tax Ordinance, 2001 (XLIX of 2001), the Sales Tax Act, 1990\n(III of 1951), the Federal Excise Act, 2005 (VII of 2005) or any other law for the time being in\nforce relating to wealth tax, income tax, super tax, sales tax, excise tax, or any other tax, the Bank\nshall not be liable to pay any wealth tax, income tax, super tax, sales tax, excise tax, or any other\ntax on its income, wealth, or services:\nProvided that, in relation to income tax, this section shall become applicable upon\nnotification by the Federal Government under the Income tax Ordinance, 2001 (XLIX of 2001)."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Protection of actions taken in good faith",
      "content": "(1) No suit, prosecution, reference, or\nother legal proceedings, shall lie against the Bank, the Board, the Chairman, the President or any\nother director, officer, employees, advisers, consultants or experts of the Bank in respect of any\nact, omission, interpretation or determination taken or made in good faith with respect to or under\nthis Act or any rule or regulation made thereunder, or under any order made or direction issued by\nthe Federal Government, State Bank or the Bank.\n(2) Without prejudice to the provisions of sub-section (1), the Bank shall indemnify and\nkeep indemnified any person who is or has been the Chairman, President or any other director,\nofficer or employee, adviser or consultant of the Bank against any liability, costs or expenses\nincurred by him for anything done or deemed to have been done in good faith."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Confidentiality of information",
      "content": "(1) Except as permitted under sub-section (2), every\ndirector, officer, employee or adviser of the Bank shall preserve and aid in preserving\nconfidentiality with regard to the following information that may come to his knowledge in the\nperformance of his duties:\n(a)     confidential information relating to the affairs of the Bank;\n(b)     confidential information relating to the affairs of its customers; and\n(c)     confidential information relating to any foreign agency, the Federal\nGovernment or any agency thereof.\n(2) Confidential information under sub-section (1) may be disclosed by any director,\nofficer, employee or adviser of the Bank where such disclosure in accordance with Pakistan law,\nis necessary for the performance of his duties or enforcement of this Act, or with the written\nconsent of the person to whom the information relates.\n(3) Every such director, officer, employee or adviser who discloses any confidential\ninformation in violation of this section, shall be punishable with fine which may extend to one\nmillion Rupees, and where a contravention or default is a continuing one, with a further fine which\nmay extend to one hundred thousand rupees for every day during which such contravention or\ndefault continues.\n(4) A fine under sub-section (3) shall be imposed and recovered by the State Bank."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Common seal",
      "content": "(1) The Bank shall have a common seal which shall be kept by the\nPresident or such other person as the Chairman may authorize.\n(2) The seal shall be authenticated in the manner as may be prescribed by regulations and\nany document purported to be sealed with the seal so authenticated shall be receivable as evidence\nof the particulars stated in the document."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Power to make rules",
      "content": "(1) The Federal Government may, by notification in the\nofficial Gazette, make rules, not inconsistent with the provisions of this Act, for carrying out the\npurposes of this Act.\n(2) In particular and without prejudice to the generality of the power in sub-section (1), the\nFederal Government may make rules in respect of the following matters, namely—\n(a)     administration, operation and management of the international trade\nschemes and matters in connection with and incidental thereto; and\n(b)     any other matter which has to be, or may be, prescribed by rules."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Power to make regulations",
      "content": "(1) The Board may, by notification in the official\nGazette, make regulations, not inconsistent with the provisions of this Act and the rules made\nthereunder, for or with respect to any matter that by this Act is required or permitted to be\nprescribed by regulations or that is necessary to be prescribed for carrying out the purposes of this\nAct.\n(2) In particular, and without prejudice to the generality of the power under sub-section\n(1), the Board may make regulations for the following matters, namely—\n(a)     general administration and management of the Bank, including powers and\nresponsibilities of the Chairman, Deputy Chairman and President,\nprocedure of the Board and its committees, constitution and powers of\ncommittees of the Board, including the audit committee, disclosure of\nconflict of interest, appointment of secretary; and matters in connection\ntherewith and ancillary thereto;\n(b)     procedure for determination of remuneration of directors;\n(c)     procedure for preparation, adoption and amendment to long term strategic\nplans and annual business plan and operating budgets of the Bank;\n(d)     mode of recruitment, salary and allowances and other conditions of service\nof officers and employees of the Bank and matters in connection therewith\nand incidental thereto;\n(e)    establishment, management and administration of employees’ benefit trusts\nand schemes for the officers and employees of the Bank and matters in\nconnection therewith and ancillary thereto;\n(f)    the manner in which the common seal may be authenticated and matters in\nconnection therewith and incidental thereto;\n(g)    the manner and form in which contracts binding on the Bank may be\nexecuted;\n(h)    types and term and conditions of the trade financing, trade credit insurance\nand trade services, including levy and rates of fees, charges and premiums\nin respect thereof;\n(i)    procedures for preparation and audit of statement of accounts and matters\nin connection therewith and ancillary thereto;\n(j)    issuance of securities by the Bank and matters in connection therewith and\nincidental thereto; and\n(k)    any other matter which has to be, or may be, prescribed by regulations."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Liquidation of the Bank",
      "content": "No provision of the Banking Companies Ordinance, 1962\n(LVII of 1962), Companies Act, 2017 (XIX of 2017) or any other law relating to the winding up\nof bodies corporate shall apply to the Bank, and the Bank shall not be placed in liquidation save\nby the order of the Federal Government, and in sued manner and under terms and conditions as\nthe Federal Government may by its order of liquidation direct."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to any provision of\nthis Act or rules or regulations issued thereunder, the Federal Government may, by order published\nin the official Gazette, make such provisions, not inconsistent with the provisions of this Act, as\nmay appear to it to be necessary for the purpose of removing such difficulty.\n_________\n[ see section 27(3)]\n(1)     Companies Act, 2017 (XIX of 2017), including as applicable to body corporates.\n(2)     Insurance Ordinance, 2000 (XXXIX of 2000).\n(3)     Competition Act, 2010 (XIX of 2010).\n(4)     The Public Investment (Financial Safeguard) Ordinance, 1960 (XLVI of 1960).\n_________                        RGN Date: 18-12-2025"
    }
  ],
  "definitions": [
    {
      "term": "Bank",
      "definition": "the Export-Import Bank of Pakistan established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of Directors of the Bank;",
      "source_provision": "sec2"
    },
    {
      "term": "chairman",
      "definition": "the chairman of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "director",
      "definition": "a member of the Board and shall include the President of the Bank;",
      "source_provision": "sec2"
    },
    {
      "term": "entity",
      "definition": "any entity other than a natural person and shall include a company, sole proprietorship, a partnership or association of persons, a trust, body corporate, society and foreign agencies;",
      "source_provision": "sec2"
    },
    {
      "term": "equity participation",
      "definition": "participation by the Bank in a trade investment by way of an equity investment in an entity in or outside Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "foreign agencies",
      "definition": "any national, provincial, state or local government of a foreign country or any political sub-division and any agency thereof, including but not limited to a foreign export credit agency;",
      "source_provision": "sec2"
    },
    {
      "term": "international trade",
      "definition": "the export or export-oriented import of goods and services to and from Pakistan in accordance with laws for the time being in force and shall include re-export and merchanting trade; (xiii) “international trade schemes” means any existing or future funds, schemes and programs that are launched and implemented for the support, development and promotion of international trade;",
      "source_provision": "sec2"
    },
    {
      "term": "person",
      "definition": "a natural person or any legal entity, in or outside Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules or regulations made under this Act; (xvii) “President” means the chief executive officer of the Bank appointed under section 15; (xviii) “private sector director” means a director appointed under section 17;",
      "source_provision": "sec2"
    },
    {
      "term": "prudential regulations",
      "definition": "the rules, regulations, directions, orders and circulars issued, from time to time, by the State Bank under law administered by the State Bank and constituting the regulatory framework applicable to the Bank;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under section 41;",
      "source_provision": "sec2"
    },
    {
      "term": "trade credit insurance",
      "definition": "a transaction to provide conventional or Shariah compliant insurance or reinsurance to any person in relation to risks associated with international trade or a trade investment; (xxvi) “trade financing” means a transaction to provide conventional or Shariah compliant finance to any person in relation to international trade or a trade investment; (xxvii) “trade investment” means an investment transaction, by way of debt or equity, by any person in or outside Pakistan for the establishment, expansion or acquisition of, or technology transfer, technical cooperation or development of intellectual property in relation to, an export or export oriented or import substituting business or industry; and (xxviii) “trade services” means a transaction to provide advisory, consulting or other support services to any person in connection with international trade or a trade investment.",
      "source_provision": "sec2"
    }
  ]
}
