{
  "id": "pk-extradition-act-1972",
  "type": "statute",
  "title": "Extradition Act, 1972",
  "title_en": "Extradition Act, 1972",
  "short_name": "Extradition Act, 1972",
  "status": "in_force",
  "issued_date": "1972-09-23",
  "in_force_date": "1972-09-23",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2Vq-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Extradition Act, 1972 (XXI of 1972) published by The Pakistan Code (Criminal Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, commencement and application",
      "content": "(1) This Act may be called the\nExtradition Act, 1972.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force on such date as the Federal Government may, by notification in the\nofficial Gazette, appoint.\n(4) It shall apply in relation to the return of persons to, and to persons returned from,—\n(a)    a treaty State, subject to a declaration under section 3, if any; and\n(b)    a foreign State not being a treaty State, subject to a direction under section 4."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the subject or context,—\n(a)    “extradition offence” means an offence the act or omission constituting which\nfalls within any of the descriptions set out in the Schedule and, if it took place\nwithin, or within the jurisdiction of, Pakistan, would constitute an offence\nagainst the law of Pakistan and also—\n(i)     in the case of a treaty State, an offence a person accused of which is,\nunder the extradition treaty with that State, to be returned to or from that\nState; and\n(ii)    in the case of a foreign State not being a treaty State, an offence specified\nin a direction issued under section 4;\n(b)    “extradition treaty” means a treaty or agreement between Pakistan and a foreign\nState for the extradition to or from such State of a person accused or convicted\nof an extradition offence;\n(c)    “foreign State” includes every constituent part, colony or dependency of such\nState;\n(d)     “fugitive offender” means the person who, being accused or convicted of an\nextradition offence is, or is suspected to be, in any part of Pakistan;\n(e)     “prescribed” means prescribed by rules made under this Act;\n(f)     “treaty State” means a foreign State with which an extradition treaty is for the\ntime being in operation.\n(2) In determining for the purposes of this Act whether an offence against the law of a foreign\nState falls within a description set out in the Schedule, any special intent or state of mind or special\ncircumstances of aggravation which may be necessary to constitute that offence under the law shall be\ndisregarded."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Treaty State",
      "content": "(1) As soon as may be after the commencement of this Act, the Federal\nGovernment shall publish in the official Gazette a list of the foreign States with which an extradition\ntreaty is in operation, specifying in respect of each such State the offences persons accused of which\nare, under the treaty, to be returned to or from that State.\n(2) Whenever there is concluded an extradition treaty between Pakistan and a foreign State, the\nFederal Government may, by notification in the official Gazette, declare such State to be a treaty State\nfor the purposes of this Act.\n(3) A declaration under sub-section (2) in relation to a foreign state shall specify the offences\npersons accused of which are, under the extradition treaty with that State, to be returned to or from that\nState and may provide that this Act shall apply in relation to that State with such modification as may\nbe set out therein; and the provisions of this Act shall have effect accordingly."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Application of Act to non",
      "content": "treaty States.—(1) Where the Federal Government considers it\nexpedient that the persons who, being accused or convicted of offences at places within, or within the\njurisdiction of, a foreign State, are or are suspected to be in Pakistan should be returned to the State,\nnotwithstanding that there is no extradition treaty with that State, it may, by notification in the official\nGazette, direct that the provisions of this Act shall, with respect to such offences and subject to such\nmodifications, exceptions, conditions and qualifications, if any, as may be specified therein, have effect\nin relation to that State.\n(2) Where a direction under sub-section (1) in relation to a foreign State is in force, the\nprovisions of this Act shall, with respect to the offences specified in that direction, have effect in\nrelation to such State as if it were a treaty State."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Liability of fugitive offenders to be surrendered",
      "content": "(1) Subject to the provisions of sub-\nsection (2), every fugitive offender shall be liable to be apprehended and surrendered in the manner\nprovided in this Act, whether the offence in respect of which his surrender is sought was committed\nbefore or after the commencement of this Act and whether or not a court in Pakistan has jurisdiction\nto try that offence.\n(2) No fugitive offender shall be surrendered—\n(a)     if the offence in respect of which his surrender is sought is of a political\ncharacter or if it is shown to the satisfaction of the Federal Government or of\nthe Magistrate or court before whom he may be produced that the requisition\nfor his surrender has, in fact, been made with a view to his being tried or\npunished for an offence of a political character;\n(b)        if the offence in respect of which his surrender is sought is not punishable with\ndeath or with imprisonment for life or a term which is not less than twelve\nmonths;\n(c)        if the prosecution for the offence in respect of which the surrender is sought is,\naccording to the law of the State asking for the surrender, barred by time;\n(d)        if there is no provision in the law of, or in the extradition treaty with, the State\nasking for the surrender that the fugitive offender shall not, until he has been\nrestored or has had an opportunity of returning to Pakistan, be detailed or tried\nin that State for any offence committed prior to his surrender, other than the\nextradition offence proved by the facts on which the surrender is based;\n(e)        if it appears to the Federal Government that he is accused or alleged to have\nbeen convicted of such an offence that if he were charged with that offence in\nPakistan he would be entitled to be discharged under any law relating to\nprevious acquittal or conviction ;\n(f)        if he has been accused of some offence in Pakistan, not being the offence for\nwhich his surrender is sought, or is undergoing sentence under any conviction\nin Pakistan, until after he has been discharged, whether by acquittal or on the\nexpiration of his sentence or otherwise;\n(g)        if it is shown to the satisfaction of the Federal Government or of the Magistrate\nor court before whom he may be produced that he might if surrendered be\nprejudiced at his trial or punished, detained or restricted in his personal liberty\nby reason of his race, religion, nationality or political opinions."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Requisition for surrender of fugitive offender. A requisition for the surrender of a fugitive",
      "content": "offender shall be made to the Federal Government—\n(a)        by a diplomatic representative in Pakistan of the State asking for the surrender;\nor\n(b)        by the Government of the State asking for the surrender through the diplomatic\nrepresentative of Pakistan in that State; or\n(c)        in such other manner as may have been settled by arrangement between the\nFederal Government and the Government of the State asking for the surrender."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Order of Magisterial enquiry. Where a requisition is made under section 6, the 1[Secretary",
      "content": "of the Division to which business of this Act stands allocated may, if he] thinks fit, issue an order to\n1\nSubs. by Act No. XXI of 2025, s. 2.\nenquire into the case to any Magistrate of the first class who would have had jurisdiction to enquire\ninto the extradition offence to which the requisition relates if it had been an offence committed within\nthe local limits of his jurisdiction."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Magisterial enquiry",
      "content": "(1) On receipt of an order under section 7, the Magistrate shall issue\na summon or a warrant for the arrest of the fugitive offender according as the case appears to be one\nin which according to the law of Pakistan a summon or warrant would ordinarily issue.\n(2) When the fugitive offender appears or is brought before him, the Magistrate shall enquire\ninto the case in the same manner, and have the same jurisdiction and powers, as nearly as may be, as\nif the case were one triable by a court of session and shall take such evidence as may be produced in\nsupport of the requisition and on behalf of the fugitive offender, including any evidence to show that\nthe offence of which the fugitive offender is accused or alleged to have been convicted is an offence\nof a political character or is not an extradition offence."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Receipt in evidence of exhibits, depositions, etc",
      "content": "(1) In any proceedings against a fugitive\noffender under this Act, exhibits and depositions, whether or not they are received or taken in the\npresence of the person against whom they are used, and copies thereof, and official certificates of facts\nand judicial documents stating facts, may, if duly authenticated, be received as evidence.\n(2) Warrants, depositions or statements on oath which purport to have been issued, received or\ntaken by any Court of Justice outside Pakistan, or copies thereof, and certificates of, or judicial\ndocuments stating the fact of, conviction before any such Court, shall be deemed duly authenticated—\n(a)     if the warrant purports to be signed by a Judge, Magistrate, or officer of the State\nwhere the same was issued or acting in or for such State;\n(b)     if the depositions or statements or copies thereof purport to be certified, under\nthe hand of a Judge, Magistrate or officer of the State where the same were taken\nor acting in or for such State, to be the original depositions or statements or to\nbe true copies thereof, as the case may require;\n(c)     if the certificate of, or judicial document stating the fact of, a conviction purports\nto be certified by a Judge, Magistrate or officer of the State where the conviction\ntook place or acting in or for such State; and\n(d)     if the warrant, depositions, statements, copies, certificates and judicial\ndocuments, as the case may be, are authenticated by the oath of some witness or\nby the official seal of a minister of the State where the name were respectively\nissued, taken or given.\n(3) For the purposes of this section, “warrant” includes any judicial document authorising the\narrest of any person accused or convicted of an offence."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Magistrate to report after enquiry. If, after the enquiry under section 8, the Magistrate is",
      "content": "of opinion—\n(a)     that a prima facie case has not been made out in support of the requisition for\nsurrender of the fugitive offender, he shall discharge the fugitive offender and\nmake a report to that effect to the Federal Government;\n(b)     that a prima facie case has been made out in support of such requisition, he\nshall—\n(i)     report the result of his enquiry to the Federal Government ;\n(ii)    forward, together with such report, any written statement which the\nfugitive offender may desire to submit for the consideration of the\nFederal Government; and\n(iii)   subject to any provision relating to bail, commit the fugitive offender to\nprison to await the orders of the Federal Government."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Removal and delivery of the fugitive offender. If, upon receipt of the report and statement",
      "content": "under clause (b) of section 10, the Federal Government is of opinion that the fugitive offender ought\nto be surrendered, it may issue a warrant for the custody and removal of the fugitive offender and for\nhis delivery at a place and to a person to be named in the warrant:\nProvided that the fugitive offender shall not be so delivered until after the expiration of fifteen\ndays from the date he has been taken in custody under such warrant."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Discharge of person apprehended if not surrendered within two months. If a fugitive",
      "content": "offender who, in pursuance of this Act, has been taken into custody to await his surrender, is not\nconveyed out of Pakistan within two months after such committal, the High Court, upon application\nmade to it by or on behalf of the fugitive offender and upon proof that reasonable notice of the intention\nto make such application has been given to the Federal Government, may order such prisoner to be\ndischarged unless sufficient cause is shown to the contrary."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Power to the Federal Government to discharge a fugitive offender. If it appears to the",
      "content": "Federal Government that by reason of the trivial nature of the case or by reason of the application for\nthe surrender of a fugitive offender not being made in good faith or in the interest of justice or for any\nother reason it would be unjust or inexpedient to surrender the fugitive offender, it may, by order, at\nany time stay the proceedings under this Act against him and direct any summons or warrant issued\nunder this Act to be cancelled and the fugitive offender, if he is in custody or under detention, to be\ndischarged."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Simultaneous requisitions. If requisitions for the surrender of a fugitive offender are",
      "content": "received from more than one treaty State, the Federal Government may, having regard to the\ncircumstances of the case, surrender the fugitive offender to such State as it may think fit."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Requisition for surrender of persons to Pakistan. A requisition for the surrender to",
      "content": "Pakistan of a person who, being accused or convicted of an extradition offence, is or is suspected to be\nin a treaty State may be made by the Federal Government—\n(a)     to the diplomatic representative in Pakistan of that State;\n(b)     to the Government of that State through the diplomatic representative of\nPakistan in that State; or\n(c)     in such other manner as may have been settled by arrangement between the\nFederal Government and the Government of that State."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. A person surrendered by a treaty State not to be tried for previous offence. A person",
      "content": "surrendered by a treaty State in pursuance of a requisition under section 15 shall not, until he has been\nrestored or has had an opportunity of returning to that State, be tried in Pakistan for an offence\ncommitted prior to the surrender, other than the extradition offence proved by the facts on which the\nsurrender is based."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Return of the persons surrendered to Pakistan. The Federal Government may, if it thinks",
      "content": "fit, on the request of a person surrendered to Pakistan in pursuance of a requisition under section 15,\narrange for him to be sent back at the cost of the Federal Government and with as little delay as possible\nto the State by which he was so surrendered if—\n(a)     proceedings against him for the offence for which he was surrendered are not\nbegun within the period of six months from the day of his arrival in Pakistan; or\n(b)     he is acquitted or discharged on his trial for that offence."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Jurisdiction as to offences committed at sea or in air. Where the offence in respect of",
      "content": "which the surrender of a fugitive offender is sought was committed on board any vessel on the high\nseas or any aircraft in the air outside Pakistan or the Pakistan territorial waters and such vessel or\naircraft comes into any port or aerodrome of Pakistan with the fugitive offender on board, the Federal\nGovernment and any Magistrate having jurisdiction in such port or aerodrome may exercise the powers\nconferred on it or him by this Act."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Release of persons arrested on bail. The provisions of the Code of Criminal Procedure,",
      "content": "1898 (Act V of 1898), relating to bail shall apply to a fugitive offender arrested or detained under this\nAct in the same manner as they would apply if he were accused of committing in Pakistan the offence\nof which he is accused or has been convicted; and in relation to such bail the Magistrate before whom\nhe is brought shall have, as far as may be, the same powers and jurisdiction as a court of session under\nthat Code."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Property found on fugitive offender. Everything found in the possession of a fugitive",
      "content": "offender at the time of his arrest which may be material as evidence in proving the extradition offence\nmay be delivered up with the fugitive offender on his surrender, subject to the rights, if any, of third\nparties with respect thereto."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Lawfulness of custody and re",
      "content": "taking under warrant issued under Act. It shall be lawful\nfor any person to whom a warrant is directed in pursuance of the provisions of this Act to receive, hold\nin custody and convey the fugitive offender mentioned in the warrant to the place named in the warrant,\nand, if such offender escapes out of any custody to which he may be delivered in pursuance of such\nwarrant, he may be re-taken as a person accused of an offence against the law of Pakistan may be re-\ntaken upon an escape."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Power to make rules",
      "content": "_(1) The Federal Government may, by notification in the official\nGazette, make rules for carrying out the purposes of this Act.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules may\nprovide for all or any of the following matters, namely:—\n(a)        the form in which a requisition for the surrender of a fugitive offender may be\nmade;\n(b)        the removal of fugitive offenders apprehended or in custody under this Act and\ntheir control and maintenance until such time as they are handed over to the\npersons entitled to receive them;\n(c)        the seizure and disposition of any property which is the subject of, or required\nfor proof of, any alleged offence with respect to which this Act applies; and\n(d)        the form and manner in which the Magistrate may be required to make his report\nto the Federal Government under this Act."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Power to amend the Schedule. The Federal Government may, by notification in the",
      "content": "official Gazette, amend the Schedule so as to add any entry thereto or modify or omit any entry therein."
    }
  ],
  "definitions": [
    {
      "term": "extradition offence",
      "definition": "an offence the act or omission constituting which falls within any of the descriptions set out in the Schedule and, if it took place within, or within the jurisdiction of, Pakistan, would constitute an offence against the law of Pakistan and also— (i) in the case of a treaty State, an offence a person accused of which is, under the extradition treaty with that State, to be returned to or from that State; and (ii) in the case of a foreign State not being a treaty State, an offence specified in a direction issued under section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "extradition treaty",
      "definition": "a treaty or agreement between Pakistan and a foreign State for the extradition to or from such State of a person accused or convicted of an extradition offence;",
      "source_provision": "sec2"
    },
    {
      "term": "foreign State",
      "definition": "every constituent part, colony or dependency of such State;",
      "source_provision": "sec2"
    },
    {
      "term": "fugitive offender",
      "definition": "the person who, being accused or convicted of an extradition offence is, or is suspected to be, in any part of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "treaty State",
      "definition": "a foreign State with which an extradition treaty is for the time being in operation. (2) In determining for the purposes of this Act whether an offence against the law of a foreign State falls within a description set out in the Schedule, any special intent or state of mind or special circumstances of aggravation which may be necessary to constitute that offence under the law shall be disregarded.",
      "source_provision": "sec2"
    }
  ]
}
