{
  "id": "pk-eye-surgery-restriction-ordinance-1960",
  "type": "statute",
  "title": "Eye Surgery (Restriction) ordinance, 1960",
  "title_en": "Eye Surgery (Restriction) ordinance, 1960",
  "short_name": "ESO",
  "status": "in_force",
  "issued_date": "1960-12-30",
  "in_force_date": "1960-12-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-a5acaQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Eye Surgery (Restriction) ordinance, 1960 (LI of 1960) published by The Pakistan Code (Health/Medical Laws).",
  "provisions": [
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Trial of offences",
      "content": "ORDINANCE No. LI OF 1960\n[21st December, 1960]\nAN\nto prevent surgery on the eye by persons other than registered medical practitioners\nWHEREAS it is expedient to prevent surgery on the eye by persons other than registered\nmedical practitioners;\nNow, THEREFORE, in pursuance of the Proclamation of the seventh day of October 1958,\nand in exercise of the powers conferred by Article 2 of the State Arrangements Order, 1959, and of\nall other powers enabling him in that behalf, the Minister exercising the functions of President under\nthe said Article makes and promulgates the following Ordinance :⎯"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.⎯(1) This Ordinance may be called the Eye",
      "content": "Surgery (Restriction) Ordinance, 1960.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.⎯In this Ordinance, unless there is anything repugnant in the subject or",
      "content": "context⎯\n(1)    “complete blindness” means absence of sight through total loss of perception\nof light in both eyes;\n(2)    “eye surgery” means any surgical operation performed on or in relation to the\neye by means of any instrument of whatever kind;\n(3)    “partial blindness” means total loss of perception of light in one eye or sub-\ntotal loss of perception of light in both eyes resulting in restriction of visual\nfield and acuity; and\n(4)    “registered medical practitioner” means a person who is, for the time being,\nregistered under any law relating to the registration of medical practitioners in\nPakistan."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Punishment for performing eye surgery in certain cases.⎯(1) Any person, not being a",
      "content": "registered medical practitioner, who performs eye surgery upon another, whether with or without the\nlatter's consent, shall be punishable with imprisonment for a term which may extend to one year, and\nwith fine which may extend to one thousand rupees.\n(2) The term of imprisonment under sub-section (1) may extend__\n(a)    to three years, if the offence results in partial blindness, and\n(b)    to seven years, if the offence results in complete blindness."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Punishment for unlawful practice or holding out.⎯Any person not being a registered",
      "content": "medical practitioner who practises, or holds himself out, whether directly or by implication, as\npractising, or as being prepared to practise, eye surgery shall be punishable with imprisonment for a\nterm which may extend to six months, and with fine which may extend to five hundred rupees."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Offences to be cognizable.⎯An offence punishable under sub",
      "content": "section (1) of section 3 or\nunder section 4 shall be a cognizable offence for the purposes of the Code of Criminal Procedure,\n1898 (Act V of 1898), notwithstanding anything to the contrary contained therein."
    }
  ],
  "definitions": []
}
