{
  "id": "pk-federal-board-of-intermediate-and-secondary-education-act-1975",
  "type": "statute",
  "title": "Federal Board of Intermediate and Secondary Education Act, 1975",
  "title_en": "Federal Board of Intermediate and Secondary Education Act, 1975",
  "short_name": "FBOIA",
  "status": "in_force",
  "issued_date": "1975-08-28",
  "in_force_date": "1975-08-28",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUZmVo-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Federal Board of Intermediate and Secondary Education Act, 1975 (LXVIII of 1975) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Act may be called the Federal Board of\nIntermediate and Secondary Education Act, 1975.\n(2) It shall come into force on such date as the Federal Government may, by notification in the\nofficial Gazette, appoint in this behalf."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,__\n(a)         “Board” means the Federal Board of Intermediate and Secondary Education;\n(b)         “Chairman” means Chairman of the Board;\n(c)         “college” means an institution within the jurisdiction of the Board and\n1\n[affiliated] by it for Intermediate education, and includes a college having\nIntermediate and Degree classes and affiliated to a University for the Degree\nclasses;\n(d)         “committee” means a committee constituted under this Act;\n(e)         “head of an institution” means the principal of a college or the headmaster or\nheadmistress of a school;\n(f)         “headmaster” and “headmistress” include the principal of a school;\n(g)         “institution” means a college or a school;\n(h)         “Intermediate college” means an institution 1[affiliated] for imparting\nIntermediate education, and includes an institution imparting both Intermediate\neducation and Secondary education ;\n(i)         “Intermediate education” means education pertaining to class XI and class XII;\n(j)         “prescribed” means prescribed by regulations;\n1\nSubs. by Act No. XIII of 2017, s. 2.\n(k)         “principal” means head of a college ;\n(l)         “1[affiliated]” means 1[affiliated] by the Board ;\n(m)         “school” means an institution within the jurisdiction of the Board and\n1\n[affiliated] by it only for imparting Secondary education ;\n(n)         “regulations” means regulations made under this Act ;\n(o)         “Secondary education” means education pertaining to class IX and class X and\nsuch other classes as may be declared by the Federal Government to be classes\nof Secondary education ; and\n(p)         “Secretary” means Secretary of the Board."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Constitution of the Board",
      "content": "(1) The Federal Government shall, as soon as may be after the\ncommencement of this Act, establish a Board to be known as the Federal Board of Intermediate and\nSecondary Education.\n(2) The Board shall be a body corporate having perpetual succession and a common seal with\npowers to acquire, hold and dispose of property, both movable and immovable, and shall by the\naforesaid name sue and be sued."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Jurisdiction of the Board",
      "content": "The Board shall exercise the powers conferred on it by or under\nthis Act in respect of the institutions within the Federal Capital, the Federally Administered Tribal\nAreas, and such states 1[including] territories, not forming part of a Province, as are or may be included\nin Pakistan, whether by accession or otherwise, institutions established by Pakistan Missions or\ncitizens of Pakistan in foreign countries 1[and all other educational institutions desirous to seek\naffiliation with the Board from within the country and from abroad] and such institutions located within\nseek 1[affiliation] of the Board."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Composition of the Board",
      "content": "The Board shall consist of the following members, namely:__\n(a)         the Chairman, to be appointed by the 2[Prime Minister] ;\n(b)         two Vice‑Chancellors to be nominated by the 2[Higher Education Commission];\n(c)         a nominee of the 1[Division administering the Board] not below the rank of\n2\n[Joint Secretary] in the Federal Government ;\n(d)         a nominee of the Directorate of Military Lands and Cantonments to represent\nthe Cantonment Boards;\n(e)         one principal to be elected in the prescribed manner by the principals from\namongst themselves ;\n(f)         one headmaster of a school for boys to be elected in the prescribed manner by\nthe headmasters of schools for boys from amongst themselves ;\n1\nSubs. and Ins. by Act No. XIII of 2017, ss.2,3 and 4.\n2\nSubs. by Act No. XXII of 2025, s.2.\n(g)        one headmistress of a school for girls to be elected in the prescribed manner by\nthe headmistresses of schools for girls from amongst themselves ;\n(h)        the Director, Federal Government Educational Institutions, Islamabad ;\n(i)        the Director, Institute of Islamic Research, Islamabad ;\n(j)        three members, of whom one shall be a woman, to be elected by the National\nAssembly from amongst its members ;\n(k)        two members to be elected by the Senate from amongst its members ; 1[*]\n1\n[(l)   one representative of each Provincial Government in the field of education and\nSecretary School Education of the Government of Azad Jammu and Kashmir\nand Government of Gilgit-Baltistan respectively;]\n1\n[(m) Chief Executive Officer of the Software Export Board;\n(n)        Chairperson of the Information Technology Department of the National\nUniversity of Science and Teclinolowy;\n(o)        Chairperson of the Information Technology Department of the National\nUniversity of Technology; and\n(p)        Director of the National Curriculum Council.]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Terms of members of the Board",
      "content": "(1) Unless the Federal Government, being of the opinion\nthat it is necessary in the public interest so to do, removes him from office, a member, other than an\nex‑officio member, shall hold office for a period of three years from the date of his election or\nnomination, as the case may be.\n(2) No ex-officio member shall continue to be a member if he ceases to hold the office by virtue\nof holding which he was appointed.\n(3) Any casual vacancy in the office of a member, other than an ex-officio member, shall be\nfilled by election or nomination, as the case may be and the person so elected or nominated shall hold\noffice for the unexpired period of the term of his predecessor.\n(4) Any member of the Board may, by writing under his hand addressed to the Chairman, resign\nhis office, provided that the resignation shall not have effect until it is accepted by the Chairman.\n(5) A member shall, on the expiry of his term of office, be eligible for re-election or re-\nnomination."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Meetings of the Board",
      "content": "(1) The meetings of the Board shall be held in such manner and\nat such time as may be prescribed:\nProvided that, until regulations are made in this behalf, such meetings shall be called by the\nChairman.\n1\nOmitted, subs. and ins. by Act No. XXII of 2025, s. 2.\n(2) In the absence of the Chairman from any meeting of the Board, the members present shall\nelect a member from among themselves to preside at that meeting.\n(3) No act or proceedings of the Board shall be invalid merely on the ground of the existence\nof a vacancy in or defect in the constitution of, the Board."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Powers and functions of the Board",
      "content": "(1) Subject to the other provisions of this Act, the\nBoard shall have power to organize, regulate, develop and control Intermediate education and\nSecondary education.\n(2) In particular, and without prejudice to the generality of the foregoing power, the Board shall\nhave the power to__\n(a)        hold and conduct examinations pertaining to Intermediate education and\nSecondary education;\n(b)        prescribe courses of instruction for examinations conducted by the Board,\nprovided that the Board may prescribe different courses of instruction for\ndifferent classes of institutions;\n(c)        admit candidates to the examinations conducted by it and prescribe the\nconditions for admission to such examinations;\n1\n(d)            [affiliate] institutions in Pakistan or outside Pakistan:\nProvided that, in the case of a Government institution, such 1[affiliation]\nshall not be withheld without the prior approval of the Federal Government;\n2\n[(da) to collaborate with national and international boards;]\n(e)        control and regulate, with the approval of the 2[Prime Minister], the\nexaminations held at the Intermediate education and Secondary education level\nin Pakistan by foreign agencies, professional institutions or bodies or\nuniversities;\n(f)        withdraw 1[affiliation] if it is satisfied after inspection carried out under clause\n(h) that the standards of management and instruction in an institution justify\nwithdrawal, provided that the 1[affiliation] shall not be withdrawn without the\nprior approval of the 2[Prime Minister] ;\n(g)        fix, demand and receive such fees as may be prescribed;\n(h)        cause an inspection to be made by such person or persons as the Board may\nnominate of 1[affiliated] institutions or institutions applying for 1[affiliation];\n(i)        adopt measures to promote the physical and moral well‑being of students of\n1\n[affiliated] institutions, and supervise their residence, health and discipline;\n1\nSubs. by Act No. XIII of 2017, s. 5.\n2\nIns. and subs. by Act No. XXII of 2025, s.3.\n(j)         organize and provide lectures, demonstrations, educational exhibitions and take\nsuch other measures as are necessary to promote the standards of Intermediate\neducation and Secondary education ;\n(k)         institute and award scholarships, medals and prizes subject to such conditions\nas may be prescribed and to accept endowments for the same subject to such\nconditions as the Board may deem fit;\n(l)         prescribe text-books or other, books study and to arrange for publication of such\ntext­books or other books;\n(m)         regulate the imposing of penalties for misconduct of students, teachers,\nexaminers and examinees ;\n(n)         prescribe qualifications for the appointment of teachers in the institutions\n1\n[affiliated] by the Board;\n(o)         submit to the Federal Government its views on any matter with which it is\nconcerned or which the Federal Government or any Provincial Government or\na educational institution may refer to it for its advice;\n(p)         deposit its surplus funds in any nationalized bank of Pakistan;\n(q)         enter into and carry out contracts in exercise of its powers and in the\nperformance of its duties under this Act and the regulations ;\n(r)         regulate and decide all administrative matters including the creation and\nabolition of posts under the Board ;\n(s)         appoint such officers and staff as it may consider necessary for the performance\nof its functions and to define their duties and conditions of service ;\n(t)         make provision for buildings, premises, furniture, apparatus, books and other\nmeans required for carrying out the purposes of this Act ;\n(u)         pass its annual budget ;\n(v)         sanction or incur such expenditure as may be necessary for carrying out the\npurposes of this Act ; and\n(w)         do all other acts necessary for carrying out the purposes of this Act.\n(3) The Board may delegate any of its powers to the Chairman or any officer of the Board or\nto a committee or sub‑committee appointed by it."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Power of the Federal Government",
      "content": "(1) The Federal Government shall have the power to\ncause inspection to be made by such person or persons as it may direct, of the offices, activities and\nfunds of, and all the examinations conducted by, the Board and to cause an inquiry to be made in like\nmanner in respect of any matter concerning the Board.\n1\nSubs. by Act No. XIII of 2017, s. 5.\n(2) The Federal Government shall communicate to the Board the result of such inspection or\ninquiry and may advise the Board to take such actions and within such period as may be specified.\n(3) The Board shall report to the Federal Government the action it proposes to take or has taken\non such communication.\n(4) Where the Board does not, within a reasonable time, take action to the satisfaction of the\nFederal Government, the Federal Government may, after considering any explanation made by the\nBoard, issue such directions as it thinks fit and the Chairman shall comply with such directions.\n(5) The Federal Government may, from time to time, direct the Board to conduct its affairs and\nperform its functions in such manner as may be specified.\n(6) The Federal Government may require the Board to furnish it with__\n(i)       any return, statement, estimate, statistics or other information regarding any\nmatter relating to, or under the control of, the Board ; or\n(ii)      a report on any such matter ; or\n(iii)     a copy of any document in the charge of the Board ;\nand the Chairman shall comply with every such requisition.\n(7) If the Board fails or neglects to comply with the directives or orders given to it under sub-\nsection (5) or if, in the opinion of the Federal Government, the Board persistently makes defaults in\nappoint the Chairman in the place of such Board until a new Board is established in accordance with"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Officers of the Board",
      "content": "The following shall be the officers of the Board, namely:__\n(i)       the Chairman;\n(ii)      the Secretary ; and\n(iii)     such other officers as may be appointed by the Board."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Appointment, powers and duties of the Chairman",
      "content": "1[(1) The Chairman may be\nappointed by the Prime Minister either through initial appointment on such terms and conditions as\nmay be determined by the Prime Minister or on deputation basis, a government servant not less than\nBS-20.]\n(2) The Chairman shall hold office for a term of three years but shall be eligible for\nreappointment for a 1[renewable terms] not exceeding three years:\nProvided that, notwithstanding the expiry of the term of his office, he shall continue to hold\noffice until his successor is appointed and enters upon his office.\n(3) If at any time the office of Chairman is vacant, or he is unable to perform his functions,\n1\nSubs. by Act No. XXII of 2025, s.4.\ntemporarily or otherwise, by reason of leave, illness or other cause for a period not exceeding one year,\nthe Federal Government shall make such arrangements for carrying on the duties of the Chairman as\nit may think fit ; and, until such arrangements are made, the Secretary shall perform the duties of the\nChairman.\n(4) It shall be the duty of the Chairman to ensure that the provisions of this Act and the\nregulations are faithfully observed, and he shall exercise all powers necessary for this purpose.\n(5) If an emergency arises out of the administrative business of the Board which, in the opinion\nof the Chairman, requires that immediate action should be taken, the Chairman may take such action\nas he deems necessary and shall report the action taken to the Federal Government and to the Board as\nits next meeting for approval.\n(6) The Chairman shall exercise such other powers as may be prescribed."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Appointment, powers and duties of the Secretary",
      "content": "(1) The Secretary shall be appointed\nby the 1[Prime Minister] on such terms and conditions and for such period as the Federal Government\nmay think fit.\n(2) The Secretary shall, subject to the control of the Chairman, be the chief administrative\nofficer of the Board, shall be responsible for ensuring that the orders of the Board and the Chairman\nare carried out and shall execute all contracts for and on behalf of the Board.\n(3) The Secretary shall be responsible for ensuring that all moneys are expended on the purpose\nfor which they are granted or allotted and for preparing and submitting to the Board for approval an\nannual statement of accounts and budget estimates.\n(4) The Secretary shall exercise such other powers as may be prescribed."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Appointment and constitution of committees",
      "content": "(1) The Board shall appoint Committees\nof Courses, a Finance Committee and such other committees as it may deem necessary for the proper\nexecution of its business.\n(2) Each committee shall consist of members of the Board and of such other persons, if any, as\nthe Board, in each case, may think fit to appoint:\n1\n[Provided that member of the Finance Committee shall be appointed by the Prime Minister.]\n(3) A committee may, subject to the approval of the Chairman, co‑opt persons if the committee\nso feels.\n(4) The term of office of a member of a Committee co‑opted under sub-section (3) shall be one\nyear from the date of co-opetion:\nProvided that a person co‑opted in his capacity as a member of a particular body or as the\nholder of a particular appointment shall hold office only for so long as he is a member of that body or\nthe holder of that appointment, as the case may be.\n1\nSubs. by Act No. XXII of 2025, ss.5-6"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Fund",
      "content": "The Board shall have a fund to which shall be credited all income of the Board,\nincluding income from fees, endowments, grants and contributions."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Annual audit of accounts",
      "content": "(1) The accounts of the Board shall be maintained in such\nform and in such manner as may be prescribed.\n(2) The accounts of the Board shall be audited every year by the Accountant General, Pakistan\nRevenues.\n(3) The Board shall, at the time of audit, produce all accounts, registers, documents and other\npapers which may be required by the auditor to assist him in his investigation:\nProvided that, if the Federal Government certifies, that a particular document is secret, the\nauditor shall accept in lieu of such documents a statement in respect there of duly certified by the\nChairman:\nProvided further that, if such a document is confidential, the auditor shall be responsible for\npreventing disclosure of its contents.\n(4) The Board shall, as soon as possible after the end of each financial year, submit to the\nFederal Government the annual statement of the accounts of the Board, duly audited, together with the\nreport of the auditor."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Provident fund",
      "content": "The Board may establish a provident fund for the benefit of its\nemployees and, where it establishes such fund, the provisions of the Provident Funds Act, 1925 (XIX\nof 1925), shall apply to such fund."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Powers of the Board to make regulations",
      "content": "(1) The Board may, with the approval of the\nFederal Government, make regulations for carrying out the purposes of this Act.\n(2) In particular, and without prejudice to the generality of the foregoing power, the regulations\nmay provide for all or any of the following matters, namely:__\n(a)         the procedure for the conduct of, and the number of members required to form\na quorum at, meetings of the Board and the committees;\n(b)         the conduct of examinations, including the appointment of examiners and their\nduties, powers and remuneration;\n(c)         the conditions for admission of candidates to the examinations held by the\nBoard and their eligibility for diplomas, certificates and titles;\n(d)         the conditions for the 1[affiliation] of institutions and the withdrawal of\n1\n[affiliation];\n(e)         the courses of study to be followed in the institutions imparting Intermediate\neducation or Secondary education or education for other examinations\nconducted by the Board;\n1\nSubs. by Act No. XIII of 2017, s. 6.\n(f)   the institution of scholarships and prizes;\n(g)   the election and co‑option of members of the Board and its committees;\n(h)   the constitution, powers and duties of committees;\n(i)   the appointment of employees of the Board and the conditions of their service;\n(j)   the constitution of a provident fund for the benefit of the employees of Board;\nand\n(k)   such other matters as may be necessary for giving effect to the provisions of this\nAct.\n____________\nRGN-Dated. 03-09-2025"
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Federal Board of Intermediate and Secondary Education;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "Chairman of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "college",
      "definition": "an institution within the jurisdiction of the Board and 1 [affiliated] by it for Intermediate education, and includes a college having Intermediate and Degree classes and affiliated to a University for the Degree classes;",
      "source_provision": "sec2"
    },
    {
      "term": "committee",
      "definition": "a committee constituted under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "head of an institution",
      "definition": "the principal of a college or the headmaster or headmistress of a school;",
      "source_provision": "sec2"
    },
    {
      "term": "institution",
      "definition": "a college or a school;",
      "source_provision": "sec2"
    },
    {
      "term": "Intermediate college",
      "definition": "an institution 1[affiliated] for imparting Intermediate education, and includes an institution imparting both Intermediate education and Secondary education ;",
      "source_provision": "sec2"
    },
    {
      "term": "Intermediate education",
      "definition": "education pertaining to class XI and class XII;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by regulations; 1 Subs. by Act No. XIII of 2017, s. 2.",
      "source_provision": "sec2"
    },
    {
      "term": "principal",
      "definition": "head of a college ;",
      "source_provision": "sec2"
    },
    {
      "term": "1[affiliated]",
      "definition": "1[affiliated] by the Board ;",
      "source_provision": "sec2"
    },
    {
      "term": "school",
      "definition": "an institution within the jurisdiction of the Board and 1 [affiliated] by it only for imparting Secondary education ;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Act ;",
      "source_provision": "sec2"
    },
    {
      "term": "Secondary education",
      "definition": "education pertaining to class IX and class X and such other classes as may be declared by the Federal Government to be classes of Secondary education ; and",
      "source_provision": "sec2"
    },
    {
      "term": "Secretary",
      "definition": "Secretary of the Board.",
      "source_provision": "sec2"
    }
  ]
}
