{
  "id": "pk-federal-constitutional-court-judges-leave-pension-and-privileges-order-2025",
  "type": "statute",
  "title": "Federal Constitutional Court Judges (Leave, Pension and Privileges) Order, 2025",
  "title_en": "Federal Constitutional Court Judges (Leave, Pension and Privileges) Order, 2025",
  "short_name": "FCCJP",
  "status": "in_force",
  "issued_date": "2025-12-09",
  "in_force_date": "2025-12-09",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5toaQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Federal Constitutional Court Judges (Leave, Pension and Privileges) Order, 2025 (3 of 2025) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Facilities to retired Judges",
      "content": "THE FEDERAL CONSTITUTIONAL COURT JUDGES (LEAVE,\nPENSION AND PRIVILEGES) ORDER, 2025\n[10th December, 2025]\nPRESIDENT’S ORDER NO. 3 OF 2025\nWHEREAS paragraph 2 of the Fifth Schedule to the Constitution of Islamic Republic of Pakistan\nrelating to the Federal Constitutional Court provides that every Judge of the Federal Constitutional Court\nshall be entitled to such privileges and allowances, and to such rights in respect of leave of absence and\npension, as may be determined by the President;\nNOW THEREFORE, in exercise of the said powers the President is pleased to make the\nfollowing Order:"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This order may be called the Federal Constitutional\nCourt Judges (Leave, Pension and Privileges) Order, 2025.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Order, unless there is anything repugnant in the subject or context,—\n(a)     “acting Chief Justice” means a Judge appointed under Article 175J of the Constitution to\nact as Chief Justice;\n(b)     “acting Judge” means a Judge of a High Court appointed under Article 175K of the\nConstitution to act temporarily as a Judge;\n(c)     “actual service” means the time spent by a Judge on duty as such or in the performance\nof such other functions as he may perform under the Constitution and law, or at the request\nof the President, and includes vacations;\n(d)     “Chief Justice” means the Chief Justice of the Federal Constitutional Court;\n(e)     “High Court” means the High Court of a Province and shall includes a High Court which\nexisted in Pakistan at any time before the commencement of the Constitution.\n(f)     “Judge” means a Judge of the Federal Constitutional Court and includes the Chief Justice,\nan acting Chief Justice and an acting Judge;\n(g)     “Judge of a High Court” includes the Chief Justice of a High Court;\n(h)     “service as Judge” means service rendered as a Judge either in the Federal Constitutional\nCourt only or in that Court, the Supreme Court and in one or more of the High Court(s);\n(i)     “service for pension” means actual service and includes thirty days of the amount actually\ntaken, whichever is less of each period of leave on full allowance;\n(j)     “Federal Constitutional Court” means the Federal Constitutional Court of Pakistan; and\n(k)     “vacation” means a vacation fixed by or under the rules of the Federal Constitutional\nCourt."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Kinds of leave",
      "content": "(1) Subject to the provisions of this Order, leave granted to a Judge may, at\nhis option, be either—\n(a)     leave on full salary; or\n(b)     leave on half salary; or\n(c)     leave partly on full salary and partly on half salary.\n(2) For the purposes of this part, any period of leave on full salary shall be reckoned as double\nthat period of leave on half salary."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Leave account",
      "content": "A leave account shall be kept for each Judge showing therein the amount of\nleave due to him in terms of leave on half salary and in such account there shall be—\n(i)     credited to him in two separate columns—\n(a)     a period equal to one-fourth of actual service; and\n(b)     where any duties are assigned to a Judge and, for reasons of such assignment, the\nJudge does not avail of any vacation or avails of less than thirty days of vacation\nin any calendar year, in addition to the leave credited under the preceding sub-\nclause, a further period equal to double the period by which the vacation availed\nof by him falls short of thirty days; and\n(ii)    debited to him the period of all leave on full or half salary granted to him:\nProvided that the opening credit at the commencement of this order shall not\nexceed six months in the case of any Judge."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Aggregate amount of leave",
      "content": "(1) The aggregate amount of leave granted to a Judge during\nhis whole period of service as such shall not exceed, in terms of leave on half salary, thirty-six months.\n(2) The aggregate amount of leave on full salary granted to a Judge during his whole period of\nservice as such shall not exceed one twenty-fourth of the period spent by him on actual service,\nbut the leave credited to a Judge under sub-clause (b) of clause (i) of paragraph 4 shall not be subject to\nthe limit herein specified.\n(3) The period of leave granted at any one time shall not exceed, in the case of leave on full salary\nsix months and, in the case of leave of any other kind specified in paragraph 3, sixteen months."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Grant of leave not due",
      "content": "Subject to the maximum limit specified in sub-paragraph (1) of\nparagraph 5, leave on half salary may be granted to a Judge in excess of the amount at his credit—\n(a)     on a medical certificate; and\n(b)     for a period not exceeding six months and not more than once during the whole period of\nhis service as Judge, otherwise than on medical certificate."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Leave salary",
      "content": "(1) The monthly rate of leave salary payable to a Judge while on leave on full\nsalary shall be equal to the monthly rate of his salary.\n(2) The monthly rate of the leave salary payable to a Judge while on leave on half-salary shall be\nequal to half the monthly rate of his salary.\n(3) A Judge appointed after the commencement of this Order, shall not be entitled to draw his\nleave salary, otherwise than in Pakistan rupees unless he, immediately before such appointment, was\nentitled, in the service of Pakistan to draw leave salary in foreign exchange in which case he may draw\nleave salary in foreign exchange on the same terms and conditions as were applicable to him as a person\nin the service of Pakistan.\n(4) A Judge who was holding office as such immediately before the commencement of this Order\nmay draw leave salary in foreign exchange in respect of any period of leave spent outside Pakistan as if\nhe were a Federal Government servant recruited prior to the 17th May, 1958."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Encashment of leave",
      "content": "A Judge who has, at the time of retirement, three hundred and sixty-\nfive days leave on full salary to his credit, shall be paid with effect from the first day of July, 2012 twelve\nmonths salary in lieu of leave not availed of.\n9 Extraordinary leave.—(1) Leave in excess of any leave admissible under the foregoing\nprovisions of this Order may be granted to a Judge for a period not exceeding six months and not more\nthan once during the whole period of his service.\n(2) No leave under sub-paragraph (1) shall be granted to a Judge so as to terminate with his\nretirement nor after he has tendered his resignation.\n(3) No leave salary shall be payable to a Judge in respect of the period of leave granted under\nsub-paragraph (1)."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Combining leave with vacation",
      "content": "A Judge may be permitted to combine vacation with leave\nof any kind if the leave is either at the commencement or at the end of vacation but not at both:\nProvided that no such permission shall be granted to a Judge if it becomes necessary thereby to\nappoint an acting Judge."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Overstaying leave or vacation",
      "content": "If a Judge overstays his leave or any vacation, whether\ncombined with leave or not, he shall receive no salary for the period of his absence in excess of the leave\ngranted to him or beyond the end of the vacation, as the case may be:\nProvided that, if such absence is due to circumstances beyond his control, the period thereof may\nbe treated as leave admissible to him."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Abeyance of acting appointments in vacation",
      "content": "Nothing in this Order shall be construed\nas authorising any acting Chief Justice or acting Judge to continue to hold his acting appointment during\nvacation."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Special Disability Leave",
      "content": "Special disability leave may be granted to a Judge when he is\ndisabled by injury intentionally inflicted or caused in, or in consequence of, the due performance of his\nofficial duties or in consequence of his official position and the provisions of Fundamental Rule 83 shall,\nso far as may be, apply to a Judge as they apply to a Government servant under the rule making power\nof the President."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Authority competent to grant leave",
      "content": "The authority competent to grant or refuse, within or\nex-Pakistan leave, or to revoke or curtail leave already granted, shall, in the case of the Chief Justice, be\nthe President and, in the case of other Judges, the Chief Justice."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Entitlement",
      "content": "A Judge shall, on his retirement, resignation or removal, be paid a pension in\naccordance with the provisions of this Order if he has—\n(a)     attained the retiring age; or\n(b)     completed not less than ten years’ service as Judge or not less than seven years’ service\nfor pension and before attaining the retiring age resigned or sought retirement; or\n(c)     completed not less than five years’ service as Judge or not less than three years’ service\nfor pension and, before attaining the retiring age, resigned, his resignation having been\nmedically certified to be necessitated by ill health or been removed for physical or mental\nincapacity or been allowed by the President for sufficient cause to retire."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Payable pension",
      "content": "(1) Subject to sub-paragraph (2), the Chief Justice and a Judge on his\nretirement or resignation as provided in paragraph 15 shall be entitled to the minimum amount of pension\nequal to seventy-five per cent of the salary determined by the President from time to time payable to the\nChief Justice, or as the case may be, a Judge plus five per cent of the said salary for each completed year\nof service either as the Chief Justice or as the Judge not exceeding the maximum amount of pension\nequal to ninety per cent of the said salary.\nExplanation:—The expression “salary” means the salary referred to in paragraph 1 of Fifth\nSchedule to the Constitution of the Islamic Republic of Pakistan or such higher salary as the President\nmay determine from time to time and shall include Superior Judicial Allowance but shall not include any\nother allowance or amount representing any privilege or facility.\n(2) If a Chief Justice or a Judge before his appointment in the Federal Constitutional Court was\nthe Chief Justice or a Judge of a High Court and the pension payable to him as Chief Justice or Judge of\nthe High Court would have been more than the pension payable to him under sub-paragraph if he would\nhave retired on the day he was appointed in the Federal Constitutional Court would have the option to\nreceive pension either under sub-paragraph (1) or of the High Court."
    },
    {
      "provision_ref": "sec16a",
      "section": "16A",
      "title": "Section 16A. Pension on re",
      "content": "employment etc.—(1) Where a Judge in receipt of a pension is appointed\nto a post in connection with affairs of the Federation or a Province or a body owned or controlled by any\nsuch Government or is holding any such post he shall draw the pay sanctioned for the post minus his\ngross pension.\n(2) Where a Judge who is receiving a pension—\n(a) a Commission of Inquiry; or\n(b) is appointed to act an arbitrator by the Federal Government or Provincial Government or is\nrequired by such Government to give a legal opinion in any matter,\nhe shall not receive any fee or compensation for so acting or tendering a legal opinion except\nreimbursement of out of pocket expenses."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Commutation of pension",
      "content": "The Civil Pension (Commutation) Rules shall, with necessary\nmodifications, apply to a Judge.\n(2) Where the pension of a Judge increase at any time after his retirement on account of a\nsubsequent increase of salaries payable to Judges, he shall not be entitled to have the different of the\npension payable to him at the time of his retirement and the subsequent increase in pension commuted.\n(3) A Judge at the time of his appointment to a High Court was in receipt of a pension in respect\nof any post and had got any part of the said pension commuted, the amount of commutation so paid shall\nbe deducted from the amount of commutation arrived at under sub-paragraph (1)."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Extraordinary pension",
      "content": "The Central Civil Services (Extraordinary Pension) Rules shall\napply to a Judge, who may suffer injury or die as a result of violence as they apply to an officer of the\nFederal Government subject to the modification that reference in those rules to tables relating to injury\ngratuities and pensions and family gratuities and pensions, shall be construed as reference to the\ncorresponding tables in the Schedule to this Order."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Subsidiary conditions of service",
      "content": "Subject to the provisions of this Order and such other\nprovisions as the President may make in this behalf, other privileges and rights of a Judge shall be\ndetermined by the rules for the time being applicable to an officer appointed by the President holding the\nrank of Secretary to the Federal Government:\nProvided that a Judge shall be entitled to be paid monthly, a Medical Allowance amounting to\none hundred and fifty thousand rupees:\nProvided further that nothing in this paragraph shall have effect so as to give to a Judge who is a\nmember of a civil service less favourable terms in respect of his conditions of service than those to which\nhe would be entitled as a member of such service if he had not been appointed as a Judge, his service as\na Judge being treated as service for the purpose of determining those privileges and rights."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Official residence",
      "content": "(1) A Judge shall be entitled, without payment of rent, to the use of a\nresidence throughout his term of office and for a period of one hundred and eighty days thereafter and\nno charge shall fall on him personally in respect of its maintenance.\n(2) Where a Judge chooses to reside in a house not provided by Government he shall be entitled\nto be paid a monthly allowance of three hundred fifty thousand rupees and his residence shall also be,\nmaintained at Government expense.\nExplanation.—In this paragraph—\n(a)     maintenance in relation to a residence includes the payment of local rates and taxes and\nthe provision of electricity, gas and water; and\n(b)     residence includes the staff quarters and other building appurtenant to, and the gardens of\nthe residence."
    },
    {
      "provision_ref": "sec20a",
      "section": "20A",
      "title": "Section 20A. Temporary residence",
      "content": "cum-office.—If the official residence of the Chief Justice provided\nunder paragraph 20, is located at a place other than Islamabad, he shall be entitled, with payment of rent,\nto the use of a designated house, i.e. the Chief Justice House, as a temporary residence-cum-office and\nno charge shall fail on him personally in respect of its maintenance."
    },
    {
      "provision_ref": "sec20b",
      "section": "20B",
      "title": "Section 20B. A Judge shall also be entitled throughout his term of office, without payment of rent, to the",
      "content": "use of single accommodation consisting of at payment of rent, to the use of single accommodation\nconsisting of at least one bed room, office, study, living room etc. duly furnished and maintained at the\ngovernment expense in all the Rest Houses of the Federal Constitutional Court located at Islamabad, if\nhis residence whether official or private is located at place other than Islamabad."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Official car",
      "content": "(1) A Judge shall be entitled to the use of official car(s), to be determined by\nthe Chief Justice, maintained at Government expense, but shall have to bear the cost of petrol used in the\ncar(s) during a month in excess of eight hundred litres.\n(2) Car(s) provided for the use of a Judge shall be used by him until he retires, subject to its\nreplacement earlier, either because of its having completed the specified number of years of service or\ndistance to be covered or of its having become unserviceable in accordance with the rules."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Superior judicial allowance",
      "content": "A Judge shall be entitled to be paid monthly, a Superior\nJudicial Office Allowance amounting to one million and five hundred thousand rupees.\nExplanation.—For the purposes of this paragraph, “Judge” shall include the “Chief Justice” or\nan “Acting Chief Justice”."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Exemption from income",
      "content": "tax.—No income-tax shall be payable in respect of the allowance\nadmissible to a Judge under paragraph 20 or paragraph 22 or the other benefits and perquisites to which\na Judge is entitled under the said paragraph 20 or paragraph 21 or medical allowance admissible under\nparagraph 19."
    }
  ],
  "definitions": [
    {
      "term": "acting Chief Justice",
      "definition": "a Judge appointed under Article 175J of the Constitution to act as Chief Justice;",
      "source_provision": "sec2"
    },
    {
      "term": "acting Judge",
      "definition": "a Judge of a High Court appointed under Article 175K of the Constitution to act temporarily as a Judge;",
      "source_provision": "sec2"
    },
    {
      "term": "actual service",
      "definition": "the time spent by a Judge on duty as such or in the performance of such other functions as he may perform under the Constitution and law, or at the request of the President, and includes vacations;",
      "source_provision": "sec2"
    },
    {
      "term": "Chief Justice",
      "definition": "the Chief Justice of the Federal Constitutional Court;",
      "source_provision": "sec2"
    },
    {
      "term": "High Court",
      "definition": "the High Court of a Province and shall includes a High Court which existed in Pakistan at any time before the commencement of the Constitution.",
      "source_provision": "sec2"
    },
    {
      "term": "Judge",
      "definition": "a Judge of the Federal Constitutional Court and includes the Chief Justice, an acting Chief Justice and an acting Judge;",
      "source_provision": "sec2"
    },
    {
      "term": "Judge of a High Court",
      "definition": "the Chief Justice of a High Court;",
      "source_provision": "sec2"
    },
    {
      "term": "service as Judge",
      "definition": "service rendered as a Judge either in the Federal Constitutional Court only or in that Court, the Supreme Court and in one or more of the High Court(s);",
      "source_provision": "sec2"
    },
    {
      "term": "service for pension",
      "definition": "actual service and includes thirty days of the amount actually taken, whichever is less of each period of leave on full allowance;",
      "source_provision": "sec2"
    },
    {
      "term": "Federal Constitutional Court",
      "definition": "the Federal Constitutional Court of Pakistan; and",
      "source_provision": "sec2"
    },
    {
      "term": "vacation",
      "definition": "a vacation fixed by or under the rules of the Federal Constitutional Court.",
      "source_provision": "sec2"
    }
  ]
}
