{
  "id": "pk-federal-judicial-academy-act-1997",
  "type": "statute",
  "title": "Federal Judicial Academy Act, 1997",
  "title_en": "Federal Judicial Academy Act, 1997",
  "short_name": "FJAA",
  "status": "in_force",
  "issued_date": "1997-11-30",
  "in_force_date": "1997-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apqZag%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Federal Judicial Academy Act, 1997 (XXVIII of 1997) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Delegation of powers",
      "content": "_(1) The Board may delegate all or any of its powers and\nfunctions to the Chairman, Vice-Chairman, any member of the Board, the Director-General or any\nMember of the staff.\n(2) The Director-General may, in any emergency which in his opinion requires immediate\naction, exercise such powers as he may consider necessary in the circumstances, and shall report\nthe action taken by him for approval of the Board at its next meeting."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Appointment of advisors, consultants and experts",
      "content": "_The Board may appoint advisors,\nconsultants and experts for assisting the Board in fulfilment of its aims and objects."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Meetings of the Board",
      "content": "_(1) The meetings of the Board shall be called by the\nChairman on such date and at such time and place as he may specify.\n(2) Subject to subsection (1) the intervening period between two meetings of the Board\nshall not exceed six months.\n(3) The Chairman or, in his absence, the Vice-Chairman, or if the Vice-Chairman is also\nabsent, the member elected by the members for the purpose, shall preside at a meeting of the Board.\n(4) The Quorum for the meetings of the Board shall be four members.\n(5) The Board may, from time to time, appoint such committees and working groups, from\namongst its members or otherwise, as it may consider necessary."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Director",
      "content": "General.___(1) The Director-General shall be appointed by the Chairman\non such terms and conditions as may be approved by the Board.\n(2) The management of the Academy shall be carried on by the Director-General under the\ngeneral directions of the Board.\n(3) The Director-General shall be the academic and administrative head of the Academy\nand shall be responsible for the maintenance of good order and discipline.\n(4) The Director-General shall be the Principal Accounting Officer of the Academy."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Appointment of officers and members of staff of the Academy",
      "content": "_(1) The members of\nthe staff of the Academy shall be appointed by direct recruitment or transfer, or deputation or on\ncontract basis or otherwise in such manner and on such terms and conditions as may be approved by\nthe Board.\n(2) All appointments of the members of the staff to posts in Basic Pay Scales 1 to 16 shall\nbe made by the Director-General with the approval of the Chairman.\n(3) Appointment of the members of the staff to posts in Basic Pay Scale 17 and above shall\nbe made by the Chairman.\n(4) Notwithstanding anything contained in any contract or agreement or in the conditions of\nservice, all persons serving in connection with the affairs of the Academy immediately before the\ncommencement of this Act, other than persons so serving on deputation, shall stand transferred to\nthe Academy and become the employees of the Academy on the same terms and conditions to\nwhich they were entitled immediately before such commencement and shall, on such transfer, cease\nto be persons in the service of Pakistan."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Funds of the Academy",
      "content": "_(1) There shall be a Fund of the Academy to be known as the\n“Academy Fund” to which all its income shall be credited and from which all its expenditures shall\nbe met.\n(2) The following shall be the sources of income for the Academy Fund,___\n(i)     grants from the Federal Government ;\n(ii)    grants from the Provincial Governments ;\n(iii)   sale and other proceeds of the Academy’s publications ;\n(iv)    aid from national and international agencies ; and\n(v)     fees, charges and donations.\n(3) The Academy Funds shall vest in the Board and the moneys to the credit of the Fund\nshall be kept in a personal ledger account in the Government Treasury or, with the approval of the\nBoard, in a scheduled bank."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Budget.___(1) The Director",
      "content": "General shall, in respect of each financial year, submit for\napproval of the Board, by such date and in such form as may be prescribed, a statement showing the\nestimated receipts the current and development expenditures and the sums required as grant-in-aid\nfrom the Federal Government.\n(2) The Director-General shall not incur any expenditure from the Fund which is not\nprovided for in the Budget approved by the Board."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Annual reports, etc",
      "content": "_(1) Within two months of the conclusion of each financial year,\ncarried out by the Academy during the previous year.\n(2) The Board shall submit an annual report to the Federal Government relating to the\nAcademy Fund and the Academy's programmes."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Power to make rules",
      "content": "_The Board may, with the approval of the Federal\nGovernment, make rules for carrying out the purposes of this Act.\n___________"
    }
  ],
  "definitions": []
}
