{
  "id": "pk-federal-public-service-commission-ordinance-fpsc-1977",
  "type": "statute",
  "title": "Federal Public Service Commission Ordinance (FPSC), 1977",
  "title_en": "Federal Public Service Commission Ordinance (FPSC), 1977",
  "short_name": "FPSCO",
  "status": "in_force",
  "issued_date": "1977-12-21",
  "in_force_date": "1977-12-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Fua5w%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Federal Public Service Commission Ordinance (FPSC), 1977 (XLV of 1977) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Ineligibility for further employment",
      "content": "5 A. Appointment of a serving member as a chairman."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Functions of the Commission",
      "content": "7 A. Conduct of business of Commission, etc."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. [Repeal]",
      "content": "ORDINANCE, 1977.\nORDINANCE No. XLV OF1977\n[22nd December, 1977]\nAn Ordinance to repeal and, with certain modifications, re-enact the Federal\nPublic Service Commission Act, 1973.\nWHEREAS it is expedient to repeal and, with certain modifications, re-enact the\nFederal Public Service Commission Act, 1973 (LXVI of 1973);\nAND WHEREAS the President is satisfied that circumstances exist which render it\nnecessary to take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977,\nread with the Laws (Continuance in Force) Order, 1977 and in exercise of all powers enabling him\nin that behalf, the President is pleased to make and promulgate the following Ordinance: —"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Ordinance may be called the Federal\nPublic Service Commission Ordinance, 1977.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definition. In this Ordinance, unless there is anything repugnant in the subject or",
      "content": "context, —\n(a)     “Commission” means the Federal Public Service Commission; and\n(b)     “member” means a member of the Commission and includes the\nChairman thereof."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Composition of commission, etc",
      "content": "(1) There shall be a Federal Public Service\nCommission.\n(2) The President shall by regulations determine—\n(a)    the number of members of the Commission and their conditions of service;\nand\n(b)    the number of members of the staff of the Commission and their conditions\nof service:\nProvided that, the salary, allowances and privileges of a member of\nthe Commission shall not be varied to his disadvantage during his term of\noffice.\n(3) The Chairman and other members of the Commission shall be appointed by the\nPresident.\n1\n[(4) The Commission shall have—\n(a) not less than one half of the members who shall be persons having held\noffice in the service of Pakistan in basic pay scale 21 or above post:\nProvided that no serving Government servant shall be appointed as a member:\n(b) at least one member each from—\n(i)    retired judges of the superior judiciary;\n(ii) retired officers not below the rank of Major-General or equivalent of the\nArmed Forces; and\n(iii) women and the private sector possessing such qualifications and\nexperience as the Federal Government may by rules prescribe.]\n2\n[(5) No proceedings or act of the Commission shall be invalid merely on the ground of the\nexistence of a vacancy in, or a defect in the constitution of, the Commission]."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Term of office members, etc",
      "content": "3[(1) A member of the Commission shall hold office\nfor a term of three years from the date on which he enters upon office or till he attains the age of\nsixty-five years whichever is earlier:\nProvided that a member of the Commission who is a retired Judge of the Supreme Court or a\nHigh Court shall hold office for a term of three years within five years from the date of his\nretirement:\nProvided further that a member of the Commission shall not be eligible for re- appointment.\n(1A) Notwithstanding anything in any contract, agreement or any instrument containing\nterms and conditions of the service, a member who, on or after the commencement of the Federal\nPublic Service Commission (Amendment) Act, 2006 (V of 2006), completes his tenure or attains\nupper age-limit specified in sub-section (1) shall on such commencement forthwith cease to be\nmember as defined in clause (b) of section 2.]\n(2) A member may resign his office by writing under his hand addressed to the President.\n1\n[4A. Oath of office. Before entering upon office the Chairman and a member shall make\noath in the form set out in the Schedule to this Ordinance before the President in case of Chairman\nand before the Chairman in case of a member.]\n1[5. Ineligibility for further employment. On ceasing to hold office a member shall not\nbe eligible for further employment in the service of Pakistan.]\n_____________________________________________________________________________\n1\nSubs. and Ins. by Ord. (LVI of 2000), ss. 2, 4 and 5.\n2\nIns. and shall be deemed always to have been so Ins. by the Federal Public Service Commission (Amdt.) Ordinance, 1978. (25 of 1978), s.2.\n3\nSubs. by Act (V of 06), s. 2 and shall be deemed always to have been substituted.\n1[5A.Appointment of a serving member as a chairman. A serving member of the\nCommission shall be eligible for appointment as Chairman for a term not exceeding the unexpired\nportion of his term as such member.]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Removal from office. A member shall not be removed from office except in the manner",
      "content": "applicable to a Judge of a High Court.\n1\n[7. Functions of the Commission.— (1) The functions of the Commission shall be—\n2\n[(a)   to conduct tests and examinations for recruitment of persons to All-Pakistan\nServices, the civil services of the Federation and civil posts in connection with\nthe affairs of the Federation in basic pay scales 16 and above or\nequivalent;]\n2\n[(1a) The recruitment to the post in basic pay scale 11 to 15 made by any authority\nor person on or after 28th May 2003, other than through the Commission, shall,\nnotwithstanding any provision of this Ordinance or any other law, rule,\nnotification or any order, decision of judgment of any court or forum, be\ndeemed to be, and always to have been, validly made, taken or done and shall\nnot be called in question in any court or forum or any ground whatsoever.]\n(b)     to advise the President—\n(i)    on matters relating to qualifications for and method of recruitment to,\nservices and posts referred to in clause (a);\n(ii)     on the principles to be followed in making initial appointments to the\nservices and posts referred to in clause (a) and in making\nappointments by promotion to posts in BS 18 and above and transfer\nfrom one service or occupational group to another; and\n(iii) on any other matter which the President may refer to the commission\n3\n[; and]\n3\n[(c)   to hold examinations for promotion for such posts as the Federal Government\nmay, from time to time, by notification in the official Gazette, specify.]\nExplanation. — In this section, “recruitment” means initial appointment other than\nby promotion or transfer\n(2) Recruitment to the following posts shall be outside the purview of the Commission:—\n_____________________________________________________________________________________\n1\nIns and subs by Ord. (LVI of 2000), s. 6-7.\n2\nSubs and ins by Act (X of 05), s. 2 (w.e.f 28-05-2003)\n3\nSubs and added by Ord. (XLIX of 2002), s.2.\n(i)       in the President’s Secretariat;\n1\n[(ia) in the Directorate General of Inter Services Intelligence (ISI);]\n(ii)      filled by appointing a person on contract for a specified period 2[* * * *];\n(iii)     filled on ad hoc basis for a period of six months or less\nProvided that—\n(1) no ad hoc appointment shall be made before placing or requisition with\nthe Commission for regular appointment; and\n(2) before filling the post on ad hoc basis, prior approval shall be obtained\nfrom the Commission;\n(iv)       filled by re-employing or retired officers, provided that the re-employment is\nmade for a specified period 2[* * * *] in a post not higher than the post in which\nthe person was employed on regular basis before retirement; and\n(v)       filled by the employment or re-employment of persons on the recommendations\nof the High Powered Selection Board, constituted by the President who are,\nor have been, Officers of the Armed Forces and hold, or have held, such posts\ntherein as are declared by the President to the equivalent to the posts to be so\nfilled.]\n3\n[(3)(a)         A Candidate aggrieved by any decision of the Federal Public Service\nCommission may, within thirty days of such decision, make a representation\nto the Commission and the Commission shall decide the representation within\nfifteen days after giving the candidate a reasonable opportunity of hearing.\nThe decision of the Commission, subject to the result of review petition, shall\nbe final.\n(b)       A candidate aggrieved by the decision of the Commission made under paragraph\n(a) may, within fifteen days of the decision, submit a review petition to the\nCommission and the Commission shall decide the review petition within thirty\ndays under intimation to the petitioner.\n(c)       Save as provided in this Ordinance, no order made or proceeding taken under\nthis Ordinance, or rules made thereunder, by the Commission shall be called in\nquestion in any court and no injunction shall be granted by any court in respect\nof any decision made or taken in pursuance of any power conferred by, or\nunder, this Ordinance.\n(d)       Any candidate aggrieved by a decision of the Commission under paragraph (b)\nmay, within thirty days of the decision, prefer an appeal to the High Court.]\n4\n[7A. Conduct of Business of Commission, etc. The Chairman of the Commission may,\nwith the approval of the Federal Government, make rules for regulating the conduct of the business\nof the Commission, and such rules may provide for any of the functions of the Commission specified\nby it being performed by a Committee composed of two or more members constituted by the\nChairman for the purpose.]\n1\nIns. by Act (XI of 04), s. 2.\n2\nOmitted by Ord. (XLVI of 2007), s. 2.\n3\nAdded by Ord. (XVI of 2001), s. 2.\n4\nIns. by the Federal Public Service Commission (Amdt.) Ordinance, 1978 (25 of 1978), s.3."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Commission to be informed when its advice not accepted. Where the President does",
      "content": "not accept the advice of the Commission, he shall inform the Commission accordingly."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Reports of Commission",
      "content": "(1) It shall be the duty of the Commission to present to the\nPresident annually a report on the work done by the Commission, and the President shall cause a\ncopy of the report to be laid before the National Assembly and the Senate.\n(2) The report referred to in sub-section (1) shall be accompanied by a memorandum setting\nout so far as is known to the Commission—\n(a)        the cases, if any, in which the advice of the Commission was not accepted and\nthe reasons therefor: and\n(b)        the matters, if any, on which the Commission ought to have been consulted\nbut was not consulted and the reasons therefor."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Rules. The Federal Government may, by notification in the official Gazette, make rules",
      "content": "for carrying out the purposes of this Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "Commission",
      "definition": "the Federal Public Service Commission; and",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of the Commission and includes the Chairman thereof.",
      "source_provision": "sec2"
    }
  ]
}
