{
  "id": "pk-fee-charging-employment-agencies-regulation-act-1976",
  "type": "statute",
  "title": "Fee-Charging Employment Agencies (Regulation) Act, 1976",
  "title_en": "Fee-Charging Employment Agencies (Regulation) Act, 1976",
  "short_name": "FEAA",
  "status": "in_force",
  "issued_date": "1976-11-30",
  "in_force_date": "1976-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUZWRw-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Fee-Charging Employment Agencies (Regulation) Act, 1976 (LXXVII of 1976) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Fee-Charging\nEmployment Agencies (Regulation) Act, 1976.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force in such areas and on such dates2 as the Federal Government may,\nby notification in the official Gazette, specify in this behalf:\nProvided that the Federal Government may, by notification in the official Gazette, exclude\ncertain industries or establishments or classes of employment or employment agencies from the\noperation of all or any of the provisions of this Act."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(a)         “competent authority” means an officer appointed to be the competent\nauthority under section 4;\n(b)         “employment agency” means a person, company, institution, agency, firm or\nother organization who or which acts as intermediary for the purpose of\nprocuring employment for a worker, or supplying a worker for an employer, in\nPakistan;\n(c)         “establishment” means any office, firm, industrial unit, undertaking, shop or\npremises in which persons are employed;\n(d)         “industry” means any business, trade, manufacture, calling, service\nemployment or occupation;\n(e)         “fee-charging employment agency” means—\n(i)        an employment agency conducted with a view to deriving either\ndirectly or indirectly any pecuniary or other material advantage from\nan employer or worker;\n1\nFor Statement of Objects and Reasons, see Gaz. of P., 1976, Ext., Pt. 111. p. 1149.\n2\ni.e. 8.1.2003, whole of Pakistan, see SRO 5(1)/03 dated 1.1.2003.\n(ii)    an employment agency though not conducted with a view to deriving\nany pecuniary or other material advantage, levies on the employer or\nworker for its services an entrance fee, a periodical contribution or any\nother charge;\n(f)    “licence” means a licence issued under section 5;\n(g)    “prescribed” means prescribed by rules;\n(h)    “public employment service” means any office, agency or service set up and\nmaintained by the Federal Government or a Provincial Government to find or\nprocure employment for workers, or to supply, or assist in the supply of,\nworkers to employers;\n(i)    “rules” means rules made under this Act; and\n(j)    “worker” means a person seeking employment."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Prohibition to act as fee",
      "content": "charging employment agency. After the enforcement of this\nAct, no employment agency shall, save as hereinafter provided, act as a fee-charging employment\nagency in any area:\nProvided that an employment agency acting immediately before the enforcement of this Act\nas a fee-charging employment agency may continue so to act for, and may apply for a licence\nwithin, a period of six months from such enforcement."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Appointment and powers of competent authority",
      "content": "(1) The Federal Government may,\nby notification in the official Gazette, appoint an officer to be the competent authority for the\npurposes of this Act.\n(2) The competent authority or an officer uthorized by it in writing in this behalf may,\nwith a view to securing compliance with the provisions of this Act or the rules, or any order or\ndirection made or issued thereunder, or the terms or conditions of any licence,—\n(a)    require any person to give such information or produce such documents in his\npossession with respect to any business or service of the nature of employment\nagency carried on or rendered by such person or any person employed by him\nas the competent authority or such officer may demand;\n(b)    enter into and search any premises of an establishment or industry with such\nassistance as may be necessary and inspect any book or other document\nbelonging to or under the control of any person acting or reasonably suspected\nto be acting as an employment agency; and\n(c)    take on the spot or otherwise such evidence of any person as the competent\nauthority or such officer may deem necessary:\nProvided that no one shall be required under this section to answer any question or give any\nevidence tending to incriminate himself."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Issue, renewal, cancellation and suspension of licence",
      "content": "(1) The competent authority\nmay issue a licence for operating a fee-charging employment agency to—\n(a)       a person who is a citizen of Pakistan;\n(b)       a firm, all the partners of which are citizens of Pakistan; or\n(c)       a company, the majority of the shares of which is held by citizens of Pakistan.\n(2) A licence shall be issued in such manner and form, and on payment of such fee and\ndeposits, as may be prescribed.\n(3) A licence shall, unless earlier cancelled or suspended, be valid for one year, and may, in\nthe discretion of the competent authority and on payment of the prescribed fee, be renewed for a like\nperiod.\n(4) A licence shall be liable to be cancelled or suspended and the deposits forfeited in whole\nor in part by the competent authority for the contravention of any of the provisions of this Act or the\nrules, or any order or direction made or issued thereunder, or the breach of any of its terms and\nconditions.\n1\n[(5) Any person aggrieved by an order under sub-section (4) may, within sixty days of the\ndate of the order, appeal to the Federal Government, and the Federal Government may pass such\norder thereon as it may deem fit.\n(6) No order affecting any person under sub-section (4) or sub-section (5) shall be passed\nwithout giving such person a reasonable opportunity of being heard.]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Prohibition of operation of fee",
      "content": "charging employment agency in certain cases. Where a\npublic employment service has been set up for any area, the competent authority may, by\nnotification in the official Gazette, prohibit from such date as may be specified therein the\noperation of, or the rendering of any service by, all or any of the fee-charging employment agencies\noperating in such area, and on such prohibition the licences issued for such area shall stand\ncancelled from the date specified in the notification and no compensation shall be paid therefor:\nProvided that the competent authority may, in consultation with the organisations of\nemployers, and workers in that area, exempt from the operation of the notification the placing or\nrecruitment of specified categories of workers with respect to whom appropriate arrangements for\nplacing or recruitment cannot conveniently be made by a public employment service."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Offences and penalties",
      "content": "(1) Whoever wilfully contravenes any provision of this Act or\nthe rules, or any order or direction made or issued thereunder, or the terms or conditions of any\nlicence, shall be punishable with imprisonment for a term which may extend to one year, or\nwith fine which may extend to five thousand rupees, or with both.\n1Added by the Fee-Charging Employment Agencies (Regulation) (Amdt.) Ordinance, 1984, (12 of 1984), s. 2.\n(2) Where an offence punishable under sub-section (1) is committed by a corporation, firm,\nestablishment, industry or undertaking, every director, manager, secretary, partner, agent or other\nofficer or person concerned with the management thereof shall, unless he proves that the offence\nwas committed without his knowledge or consent or that he exercised due diligence to prevent its\ncommission, be deemed to be guilty or such offence."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Cognizance of offences. No court shall take cognizance of an offence under this Act",
      "content": "except upon a complaint in writing made by the competent authority or an officer authorised\nby it in this behalf."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Competent authority, etc., to be public servants. The competent authority or the officer",
      "content": "authorised by it under sub-section (2) of section 4 shall be deemed to be a public servant within the\nmeaning of section 21 of the Pakistan Penal Code (Act. XLV of 1860)."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Indemnity. No suit, prosecution or other legal proceedings shall lie against any person",
      "content": "for anything which is in good faith done or intended to be done in pursuance of this Act or any\nrule."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Power to make rules",
      "content": "(1) The Federal Government may, by notification in the official\nGazette, make rules for carrying out the purposes of this Act.\n(2) In particular, and without prejudice to the generality of the foregoing power, such rules\nmay provide for all or any of the following matters, namely:—\n(a)        form of licence to be issued;\n(b)        procedure for the issue and renewal of licences, the fees and deposits for their\nissue and renewal;\n(c)        procedure for the cancellation or suspension of a licence, or prohibition of\noperation of fee-charging employment agencies;\n(d)        fees and expenses to be charged by the fee-charging employment agencies;\n(e)        manner of recruitment and placement of various type of workers;\n(f)        returns and forms; and\n(g)        procedure of consultation with organisation of workers and employers."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Act not to apply to certain, persons. Nothing in this Act shall apply to",
      "content": "(a)        any person licensed under the Merchant Shipping Act, 1923 (XXI of 1923) to\nengage or supply seamen to merchant ships;\n(b)        employment exchanges or any other public employment service managed by\nthe Federal Government or a Provincial Government; and\n(c)        any person permitted under the 1 [Emigration Ordinance, 1979 (XVII of1979)]\nto engage persons for placement abroad.\nLast Uploaded on 13.11.2023\n1Subs. by the Federal Laws (Revision and Declaration) Ordinance. 1981 (27 of 1981), s. 3 and Sch., II."
    }
  ],
  "definitions": [
    {
      "term": "competent authority",
      "definition": "an officer appointed to be the competent authority under section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "employment agency",
      "definition": "a person, company, institution, agency, firm or other organization who or which acts as intermediary for the purpose of procuring employment for a worker, or supplying a worker for an employer, in Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "establishment",
      "definition": "any office, firm, industrial unit, undertaking, shop or premises in which persons are employed;",
      "source_provision": "sec2"
    },
    {
      "term": "industry",
      "definition": "any business, trade, manufacture, calling, service employment or occupation;",
      "source_provision": "sec2"
    },
    {
      "term": "licence",
      "definition": "a licence issued under section 5;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules;",
      "source_provision": "sec2"
    },
    {
      "term": "public employment service",
      "definition": "any office, agency or service set up and maintained by the Federal Government or a Provincial Government to find or procure employment for workers, or to supply, or assist in the supply of, workers to employers;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "worker",
      "definition": "a person seeking employment.",
      "source_provision": "sec2"
    }
  ]
}
