{
  "id": "pk-financial-institutions-recovery-of-finances-ordinance-2001",
  "type": "statute",
  "title": "Financial Institutions (Recovery of Finances) Ordinance, 2001",
  "title_en": "Financial Institutions (Recovery of Finances) Ordinance, 2001",
  "short_name": "FIOFO",
  "status": "in_force",
  "issued_date": "2001-08-29",
  "in_force_date": "2001-08-29",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5lk-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Financial Institutions (Recovery of Finances) Ordinance, 2001 (XLVI of 2001) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Repeal",
      "content": "ORDINANCE NO. XLVI OF 2001\n[30th August, 2001]\nAn Ordinance to repeal, and, with certain modifications, re-enact, the Banking Companies\n(Recovery of Loans, Advances, Credits and Finances), Act, 1997\nWHEREAS it is expedient to repeal and with certain modifications, re-enact the Banking\nCompanies (Recovery of Loans, Advances, Credits and Finances) Act, 1997, for the purposes\nhereinafter appearing;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the proclamation of Emergency of the fourteenth day\nof October, 1999 and Provisional Constitution Order No. I of 1999, read with the Provisional\nConstitution (Amendment) Order No. 9 of 1999, and in exercise of all powers enabling him in that\nbehalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the\nfollowing Ordinance:___"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Ordinance may be called the Financial\nInstitutions (Recovery of Finances) Ordinance, 2001.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context",
      "content": "_\n(a)     “financial institution” means and includes___\n(i)     any company whether incorporated within or outside Pakistan which\ntransacts the business of banking or any associated or ancillary business\nin Pakistan through its branches within or outside Pakistan and includes\na government savings bank, but excludes the State Bank of Pakistan;\n(ii)    a modaraba or modaraba management company, leasing company,\ninvestment bank, venture capital company, financing company, unit\ntrust or mutual fund of any kind and credit or investment institution,\ncorporation or company; and\n(iii)   any company authorised by law to carry on any similar business, as the\nFederal Government may by notification in the official Gazette, specify;\n(b)     “Banking Court” means___\n(i)        in respect of a case in which the claim does not exceed 1[hundred]\nmillion rupees or for the trial of offences under this Ordinance, the Court\nestablished under section 5; and\n(ii)       in respect of any other case, the High Court.\n(c)        “customer” means a person to whom finance has been extended by a financial\ninstitution 1[within or outside Pakistan] and includes a person on whose behalf\na guarantee or letter of credit has been issued by a financial institution as well\nas a surety or an indemnifier;\n(d)        “finance” includes___\n(i)        an accommodation or facility provided on the basis of participation in\nprofit and loss, mark-up or mark-down in price, hire-purchase, equity\nsupport, lease, rent-sharing, licensing charge or fee of any kind,\npurchase and sale of any property including commodities, patents,\ndesigns, trade marks and copy-rights, bills of exchange, promissory\nnotes or other instruments with or without buy-back arrangement by a\nseller, participation term certificate, musharika, morabaha, musawama,\nistisnah or modaraba certificate, term finance certificate;\n(ii)       facility of credit or charge cards;\n(iii)      facility of guarantees, indemnities, letters of credit or any other financial\nengagement which a financial institution may give, issue or undertake\non behalf of a customer, with a corresponding obligation by the\ncustomer to the financial institution;\n(iv)       a loan, advance, cash credit, overdraft, packing credit, a bill discounted\nand purchased or any other financial accommodation provided by a\nfinancial institution to a customer;\n(v)        a benami loan or facility that is, a loan or facility the real beneficiary or\nrecipient whereof is a person other than the person in whose name the\nloan or facility is advanced or granted;\n(vi)       any amount due from a customer to a financial institution under a decree\npassed by a civil court or an award given by an arbitrator;\n2\n[(vii)] any amount due from a customer to a financial institution which is the\nsubject matter of any pending suit, appeal or revision before any court;\n2\n[(viii) any amount of loan or facility availed by a person from a financial\ninstitution outside Pakistan who is for the time being resident in\nPakistan;]\n2\n[(ix)] any other facility availed by a customer from a financial institution.\n1\nSubs & ins by Act XXXVIII of 2016, s. 2.\n2\nNumbered and ins. by Act XXXVIII of 2016, s. 2.\n(e)       “obligation” includes___\n(i)       any agreement for the repayment or extension of time in repayment of\na finance or for its restructuring or renewal or for payment or extension\nof time in payment of any other amounts relating to a finance or\nliquidated damages; and\n(ii)      any and all representations, warranties and covenants made by or on\nbehalf of the customer to a financial institution at any stage, including\nrepresentations, warranties and covenants with regard to the ownership,\nmortgage, pledge, hypothecation or assignment of, or other charge on,\nassets or properties or repayment of a finance or payment of any other\namounts relating to a finance or performance of an undertaking or\nfulfillment of a promise; and\n(iii)     all duties imposed on the customer under this Ordinance; and\n(f)       “rules” means rules made under this Ordinance.\n1\n[(g) “willful default”means___\n(i)       deliberate or intentional failure to repay any finance, loan, advance or\nany financial assistance received by any person from a financial\ninstitution after such payment has become due under the terms of any\nlaw or an agreement, rules or regulations issued by the State Bank of\nPakistan;\n(ii)      utilization of finance, loan, advance or financial assistance or a\nsubstantial part thereof, obtained by any person from a financial\ninstitution for a purpose other than that for which such finance, loan,\nadvance or financial assistance had been obtained and payment in part\nor full not made to the financial institution; or\n(iii)     removal, transfer, misappropriation or sale of any assets collateralized\nto secure a finance, loan, advance or financial assistance obtained from\na financial institution without permission of such institution.]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Duty of a customer",
      "content": "_(1) It shall be the duty of a customer to fulfil his obligations to the\nfinancial institution.\n(2) Where the customer defaults in the discharge of his obligation, he shall be liable to pay, for\nthe period from the date of his default till realization of the cost of funds of the financial institution as\ncertified by the State Bank of Pakistan from time to time, apart from such other civil and criminal\nliabilities that he may incur under the contract or rules or any other law for the time being in force.\n(3) For purposes of this section a judgment against a customer under this Ordinance shall mean\nthat he is in default of his duty under sub-section (1) and the ensuing decree shall provide for payment\nof the cost of funds as determined under sub-section (2)."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Ordinance to override other laws. The provisions of this Ordinance shall have effect",
      "content": "notwithstanding anything inconsistent therewith contained in any other law for the time being in force.\n1\nAdded by Act XXXVIII of 2016. s.2."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Establishment of Banking Court",
      "content": "_(1) The Federal Government may, by notification in\nthe Official Gazette, establish as many Banking Courts as it considers necessary to exercise\njurisdiction under this Ordinance and appoint a Judge for each of such Courts and where it establishes\nmore Banking Courts than one, it shall specify in the notification the territorial limits within which\neach of the Banking Courts shall exercise its jurisdiction.\n(2) Where more Banking Courts than one have been established to exercise jurisdiction in the\nsame territorial limits, the Federal Government shall define the territorial limits of each such court.\n(3) Where more Banking Courts than one have been established in the same or different\nterritorial limits, the High Court may, if it considers it expedient to do so in the interest of justice or\nfor the convenience of the parties or of the witnesses, transfer any case from one Banking Court to\nanother.\n1\n[(4) A Judge of a Banking Court shall be appointed by the Federal Government after\nconsultation with the Chief Justice of the High Court of the Province in which the Banking Court is\nestablished and no person shall be qualified for appointment as the Judge of a Banking Court unless\nhe is, or has been, or is qualified to be a District Judge.]\n(5) A Banking Court shall hold its sitting at such places within its territorial jurisdiction as may\nbe determined by the Federal Government.\n(6) A Judge of a Banking Court, not being a District Judge, shall be appointed for a term of\nthree years from the date on which he enters upon his office.\n2\n[(7) The salary, allowances and other terms and conditions of service of a person appointed\nas a Judge of a Banking Court shall be such as the Federal Government may determine.]\n(8) The Banking Court may, if it so requires, be assisted in technical aspects of banking\ntransactions involved in any case by an amicus curiae who has at least ten years experience of banking\nat a senior management level in a Financial institution of repute or the State Bank of Pakistan and has\nthe following qualifications, namely:___\n(i)        a degree in Commerce and Account or in Economics; or\n(ii)       a degree in Business Administration; or\n(iii)      has completed a course in banking from the Institute of Bankers, Pakistan.\n(9) Remuneration of the amicus curiae, and the party or parties by whom it will be payable will\nbe determined by the Banking Court, keeping in view the circumstances of each case.\n1\n[(10) A Judge of a Banking Court shall submit to the Chief Justice of the High Court of the\nProvince in which the Banking Court is established, reports on a quarterly basis regarding the number\nof cases filed, heard and disposed of by the Banking Court during each relevant quarterly period.]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Resignation and removal of Judges",
      "content": "_(1) A person, not being a District Judge, appointed\nas a Judge of a Banking Court under section 5 may, by notice in writing under his hand addressed to\nthe Federal Government, resign from his office.\n1\nSubs. and added by Act XXXVIII of 2016 s. 3.\n2\nSubs. by the Financial Institutions (Recovery of Finances) (Amdt.) Ordinance, 2001 (51 of 2001), s. 2, for “sub-section (7)”, (w.e.f.\n30-8-2001).\n(2) A person appointed as a Judge of a Banking Court under section 5 may be removed from\noffice in consultation with the Chief Justice of the High Court."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Powers of Banking Courts",
      "content": "_(1) Subject to the provisions of this Ordinance, a Banking\nCourt shall___\n(a)     in the exercise of its civil jurisdiction have all the powers vested in a civil court\nunder the Code of Civil Procedure, 1908 (Act V of 1908).\n(b)     in the exercise of its criminal jurisdiction, try offences punishable under this\nOrdinance and shall, for this purpose have the same powers as are vested in a\nCourt of Sessions under the Code of Criminal Procedure, 1898 (Act V of 1898):\nProvided that a Banking Court shall not take cognizance of any offence punishable under this\nOrdinance except upon a complaint in writing made by a person authorized in this behalf by the\nfinancial institution in respect of which the offence was committed.\n(2) A Banking Court shall in all matters with respect to which the procedure has not been\nprovided for in this Ordinance, follow the procedure laid down in the Code of Civil Procedure, 1908\n(Act V of 1908), and the Code of Criminal Procedure, 1898 (Act V of 1898).\n(3) All proceedings before a Banking Court shall be deemed to be judicial proceedings within\nCourt shall be deemed to be a Court for purposes of the Code of Criminal Procedure, 1898 (Act V of\n1898).\n(4) Subject to sub-section (5), no Court other than a Banking Court shall have or exercise any\njurisdiction with respect to any matter to which the jurisdiction of a Banking Court extends under this\nOrdinance, including a decision as to the existence or otherwise of a finance and the execution of a\ndecree passed by a Banking Court.\n(5) Nothing in sub-section (4) shall be deemed to affect___\n(a)     the right of a financial institution to seek any remedy before any court or\notherwise that may be available to it under the law by which the financial\ninstitution may have been established; or\n(b)     the powers of the financial institution, or jurisdiction of any court such as is\nreferred to in clause (a); or\nrequire the transfer to a Banking Court of any proceedings pending before any\nfinancial institution or such court immediately before the coming into force of\nthis Ordinance.\n(6) All proceedings pending in any Banking Court constituted under the Banking Companies\n(Recovery of Loans, Advances, Credits or Finances) Act, 1997; (XV of 1997), including suits for\nrecovery of “loans” as defined under that Act shall stand transferred to, or be deemed to be transferred\nto, and heard and disposed of by, the Banking Court having jurisdiction under this Ordinance. On\ntransfer of proceedings under this sub-section, the parties shall appear before the Banking Court\nconcerned on the date previously fixed.\n(7) In respect of proceedings transferred to a Banking Court under sub-section (6), the Banking\nCourt shall proceed from the stage which the proceedings had reached immediately prior to the transfer\nand shall not be bound to recall and re-hear any witness and may act on the evidence already recorded\nor produced before the Court from which the proceedings were transferred."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Suit for recovery of written off finances etc.___1[(1) Subject to sub",
      "content": "section (2) and\nnotwithstanding anything contained in the Limitation Act, 1908 (IX of 1908) or any other law, a\nfinancial institution may, within five years, file a suit for the recovery of any amount written-off,\nreleased or adjusted under any agreement, contract, or consent, including a compromise or withdrawal\nof any suit or legal proceedings or adjustment of a decree between a financial institution and a\ncustomer, if it has reasons to believe that the amount was written-off, released or adjusted for political\nreasons or considerations other than bona fide business considerations.]"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Procedure of Banking Courts",
      "content": "_(1) Where a customer or a financial institution commits a\ndefault in fulfillment of any obligation with regard to any finance, the financial institution or, as the\ncase may be, the customer, may institute a suit in the Banking Court by presenting a plaint which shall\nbe verified on oath, in the case of a financial institution by the Branch Manager or such other officer\nof the financial institution as may be duly authorized in this behalf by power of attorney or otherwise.\n(2) The plaint shall be supported by a statement of account which in the case of a financial\ninstitution shall be duly certified under the Bankers Books Evidence Act, 1891 (XVII of 1891), and\nall other relevant documents relating to the grant of finance. Copies of the plaint, statement of account\nand other relevant documents shall be filed with the Banking Court in sufficient numbers so that there\nis one set of copies for each defendant and one extra copy.\n(3) The plaint, in the case of a suit for recovery instituted by a financial institution, shall\nspecifically state___\n(a)    the amount of finance availed by the defendant from the financial institution;\n(b)        the amounts paid by the defendant to the financial institution and the dates of\npayment; and\n(c)        the amount of finance and other amounts relating to the finance payable by the\ndefendant to the financial institution upto the date of institution of the suit.\n(4) The provisions of section 10 of the Code of Civil Procedure, 1908 (Act V of 1908), shall\nhave no application for and in relation to suits filed hereunder.\n(5) On a plaint being presented to the Banking Court, a summons in Form No. 4 in Appendix\n‘B’ to the Code of Civil Procedure, 1908 (Act V of 1908) or in such other form as may, from time to\ntime, be prescribed by rules, shall be served on the defendant through the bailiff or process-server of\nthe Banking Court, by registered post acknowledgement due, by courier and by publication in one\nEnglish language and one Urdu language daily newspaper, and service duly effected in any one of the\naforesaid modes shall be deemed to be valid service for purposes of this Ordinance. In the case of\nservice of the summons through the bailiff or process-server, a copy of the plaint shall be attached\ntherewith and in all other cases the defendant shall be entitled to obtain a copy of the plaint from the\noffice of the Banking Court without making a written application but against due acknowledgement.\nThe Banking Court shall ensure that the publication of summons takes place in newspapers with a\nwide circulation within its territorial limits.\n1\nSubs. by Act XXXVIII of 2016, s. 4."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Leave to defend",
      "content": "_(1) In any case in which the summons has been served on the defendant\nas provided for in sub-section (5) of section 9, the defendant shall not be entitled to defend the suit\nunless he obtains leave from the Banking Court as hereinafter provided to defend the same; and, in\ndefault of his doing so, the allegations of fact in the plaint shall be deemed to be admitted and the\nBanking Court may pass a decree in favour of the plaintiff on the basis thereof or such other material\nas the Banking Court may require in the interests of justice.\n(2) The defendant shall file the application for leave to defend within thirty days of the date of\nfirst service by any one of the modes laid down in sub-section (5) of section 9:\nProvided that where service has been validly effected only through publication in the\nnewspapers, the Banking Court may extend the time for filing an application for leave to defend if\nsatisfied that the defendant did not have knowledge thereof.\n(3) The application for leave to defend shall be in the form of a written statement, and shall\ncontain a summary of the substantial questions of law as well as fact in respect of which, in the opinion\nof the defendant, evidence needs to be recorded.\n(4) In the case of a suit for recovery instituted by a financial institution the application for leave\nto defend shall also specifically state the following___\n(a)        the amount of finance availed by the defendant from the financial institution;\nthe amounts paid by the defendant to the financial institution and the dates of\npayments;\n(b)        the amount of finance and other amounts relating to the finance payable by the\ndefendant to the financial institution upto the date of institution of the suit;\n(c)        the amounts of finance and other amounts relating to the finance payable by the\ndefendant to the financial institution upto the date of institution of the suit,\n(d)        the amount if any which the defendant disputes as payable to the financial\ninstitution and facts in support thereof:\nExplanation. For the purposes of clause (b) any payment made to a financial institution by a\ncustomer in respect of a finance shall be appropriated first against other amounts relating to the finance\nand the balance, if any, against the principal amount of the finance.\n1\n[(5) Where application for leave to defend submitted under the preceding sub-section is found\nto be materially incorrect at any stage of the proceedings, the defendant shall lose the right to defence\nand shall also be liable to pay penalty of not less than five percent of the amount of the claim, unless\nthe defendant can establish that incorrect information was submitted as a result of a bona fide mistake.]\n1\n[(6)] The application for leave to defend shall be accompanied by all the documents which, in\n1\n[(7)] An application for leave to defend which does not comply with the requirements of sub-\nsections (3), (4) where applicable and (5) shall be rejected, unless the defendant discloses therein\nsufficient cause for his inability to comply with any such requirement.\n1\nIns and renumberd by Act XXXVIII of 2016, s. 5.\n1\n[(8)] The plaintiff shall be given an opportunity of filing a reply to the application for leave to\ndefend, in the form of a replication.\n1\n[(9)] Subject to section 11, the Banking Court shall grant the defendant leave to defend the\nsuit if on consideration of the contents of the plaint, the application for leave to defend and the reply\nthereto it is of the view that substantial questions of law or fact have been raised in respect of which\nevidence needs to be recorded.\n1\n[(10)] In granting leave under sub-section (8), the Banking Court may impose such conditions\nas it may deem appropriate in the circumstances of the case, including conditions as to deposit of cash\nor furnishing of security.\n1\n[(11)] Where the application for leave to defend is accepted, the Banking Court shall treat the\napplication as a written statement, and in its order granting leave shall frame issues relating to the\nsubstantial questions of law or fact, and, subject to fulfilment of any conditions attached to grant of\nleave, fix a date for recording of evidence thereon and disposal of the suit.\n1\n[(12)] Where the application for leave to defend is rejected or where a defendant fails to fulfill\nthe conditions attached to the grant of leave to defend, the Banking Court shall forthwith proceed to\npass judgment and decree in favour of the plaintiff against the defendant.\n1\n[(13)] Where an application for leave to defend has been filed before the coming into force of\nthis Ordinance, the defendant shall be allowed a period of twenty-one days from the date of coming\ninto force of this Ordinance, or from the date of first hearing thereafter, whichever is later, for filing\nan amended application for leave to defend in accordance with the provisions of this Ordinance."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Interim Decree",
      "content": "_2[(1) If the Banking Court on consideration of affidavit under oath by\nthe customer supported by certificate of a chartered accountant on the approved panel of auditors of\n1962) is of the opinion that the dispute between the parties does not extend to the whole of the claim\nor that part of the claim is either undisputed or is clearly due or that the dispute is mainly limited to a\npart of the principal amount of the finance or to any other amounts relating to the finance, it shall,\nwhile granting leave and framing issues with respect to the disputed amounts, pass an interim decree\nin respect of that part of the claim which relates to the principal amount and which appears to be\npayable by the defendant to the plaintiff.]\n(2) The interim decree passed under sub-section (1) shall, for all purposes including appeal and\nexecution, be deemed to be a decree passed under this Ordinance, and any amount covered thereby or\nrecovered in execution thereof shall be adjusted at the time of the final decree:\nProvided that it shall be open to the Banking Court notwithstanding the pendency of any\nappeal, to modify, in part or in whole, or reverse, the terms of the interim decree at the time of the final\ndisposal of the suit and pass such order as it may deem just and proper:\nProvided further that neither the Banking Court nor the High Court acting under sub-section\n(3) of section 22 shall stay execution of an interim decree unless the judgment-debtor deposits in cash\nwith the Banking Court the amount or amounts admitted by the judgment-debtor to be payable to the\nfinancial institution under clause (c) of sub-section (4) of section 10, and furnishers security for the\nbalance decretal amount if any, inclusive, in the case of a suit filed by a financial institution, of cost\nof funds determined under section 3, and other costs.\n1\nRenumberd by Act XXXVIII of 2016, s. 5.\n2\nSubs. by Act XXXVIII of 2016, s. 6."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to set aside decree. In any case in which a decree is passed against a defendant",
      "content": "under sub-section (1) of section 10 he may, within twenty-one days of the date of the decree, or where\nthe summons was not duly served when he has knowledge of the decree, apply to the Banking Court\nfor an order to set it aside; and if he satisfies the Banking Court that he was prevented by sufficient\ncause from making an application under section 10, or that the summons was not duly served, 1[nor\npublished in newspapers] the Court shall make an order setting aside the decree against him upon such\nterms as to costs, deposit in cash or furnishing of security 1[which shall not be less than one third of\nthe amount of the decree] and allow him to make the application within ten days of the order."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Disposal of suit",
      "content": "_(1) A suit in which leave to defend has been granted to the defendant\nshall be disposed of within ninety days from the day on which leave was granted, and in case\nproceedings continue beyond the said period the defendant may be required to furnish security in such\namount as the Banking Court deems fit, and on the failure of the defendant to furnish such security,\nthe Banking Court shall pass an interim or final decree in such amount as it may deem appropriate.\n(2) The requirement of furnishing security under sub-section (1) shall be dispensed with if, in\nthe opinion of the Banking Court, the delay is not attributable to the conduct of the defendant.\n(3) Suits before a Banking Court shall come up for regular hearing as expeditiously as possible\nand except in extraordinary circumstances and for reasons to be recorded, a Banking Court shall not\nallow adjournments for more than seven days.\n(4) Where leave to defend is granted and evidence is to be recorded, the parties may file\naffidavits in respect of the examination-in-chief of any witness who is not to be summoned through\nthe Banking Court, and where such affidavits are filed, the Banking Court shall give notice thereof to\nthe other contesting parties and on the date fixed for recording evidence, shall, subject to such\nmodifications as may be required for purposes of production and exhibiting of documents, or otherwise\nin accordance with law, treat the affidavit as examination-in-chief and allow the contesting parties an\nopportunity for cross-examination on the basis thereof."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Decree in suits relating to mortgages. Where the suit filed by a financial institution before",
      "content": "the Banking Court is for the enforcement of a mortgage of immovable property the Banking Court\nwill not be required to pass a preliminary decree as provided in Order XXXIV of the First Schedule\nto the Code of Civil Procedure, 1908 (Act V of 1908), but shall directly pass an interim or final decree\nfor foreclosure or sale.\n2[15. Sale of mortgaged property.___(1) In this section, unless there is anything repugnant in\nthe subject or context,___\n(a)        “mortgage” means the transfer of an interest in specific immovable property for\nthe purpose of securing the payment of the mortgage money or the performance\nof an obligation which may give rise to a pecuniary liability;\n1\nIns and subs. by Act XXXVIII of 2016, s. 7.\n2\nSubs. by Act XXXVIII of 2016, s. 8.\n(b)     “mortgage money” means any finance or other amounts relating to a finance,\npenalties, damages, charges or pecuniary liabilities, payment of which is\nsecured for the time being by the document by which the mortgage is effected\nor evidenced, including any mortgage deed or memorandum of deposit of title\ndeeds;\n(c)     “mortgaged property” means immovable property mortgaged to a financial\ninstitution; and\n(d)     “reserve price” means forced sale value of the mortgaged property determined\nby a reputable valuation company under clause (a) of sub-section (4).\n(2) In case of default in payment by a customer, the financial institution may send a notice to\nthe mortgagor demanding payment of the mortgage money outstanding within fourteen days from\nservice of the notice and failing payment of the amount within due date, it shall send a second notice\nof demand for payment of the amount within fourteen days. In case the customer on the due date given\nin the second notice sent, continues to default in payment, financial institution shall serve a final notice\non the mortgager demanding the payment of the mortgage money outstanding within thirty days from\nservice of the final notice on the customer.\n(3) When a financial institution serves a final notice of demand, all powers of the mortgagor in\nregard to recovery of rents and profits from the mortgaged property shall stand transferred to the\nfinancial institution until such notice is withdrawn and it shall be the duty of the mortgagor to pay all\nrents and profits from the mortgaged property to the financial institution:\nProvided that where the mortgaged property is in possession of any tenant or occupier, other\nthan the mortgagor, it shall be the duty of such tenant or occupier, on receipt of notice in this behalf\nfrom the financial institution, to pay to the financial institution the rent or lease money or other\nconsideration agreed with the mortgagor.\n(4) Where a mortgagor fails to pay the amount as demanded within the period prescribed under\nsub-section (2) and after the due date given in the final notice has expired, the financial institution\nmay, without the intervention of any court and subject to any rules made by the Federal Government\nunder sub-section (5), sell the mortgaged property or any part thereof by public auction and apply the\nproceeds thereof towards total or partial satisfaction of the outstanding mortgage money in the\nfollowing manner, namely:___\n(a)     the financial institution shall have the mortgaged property evaluated by a\nreputable valuation company on the panel of the Pakistan Banks Association as\non the date of the final notice sent to the mortgagor under sub-section (2);\n(b)     the financial institution shall cause to be published a notice in one reputable\nEnglish daily newspaper with wide circulation and one reputable Urdu daily\nnewspaper with wide circulation in the Province in which the mortgaged\nproperty is situated specifying the following, namely:___\n(i)     detailed particulars of the mortgaged property;\n(ii)    name and address of the mortgagor;\n(iii)   amount of the outstanding mortgage;\n(iv)    any encumbrances which the mortgaged property may be subject to\nwhich the financial institution is aware of;\n(v)      the financial institution's intention to sell the mortgaged property\nthrough a public auction;\n(vi)     the reserve price below which the mortgaged property cannot be sold;\n(vii)    the time and place at which the public auction is to take place, provided\nthat the public auction shall take place in the city where the mortgaged\nproperty is located; and\n(viii)   any other information, which may be relevant;\n(c)     the financial institution shall send a notice with the information, specified in\nclause (b), to the mortgagor and to all persons who, to the knowledge of the\nfinancial institution, have an interest in the mortgaged property as mortgagees;\nand\n(d)     the public auction for the sale of the mortgaged property shall not take place\nbefore the expiration of three business days of the publication of the notice as\nrequired under clause (b).\n(5) In addition to its powers under sections 25 and 26, the Federal Government may, by\nnotification in the official Gazette, make rules specifying the mode, conduct or method of sale of the\nmortgaged property and in addition to the conditions stipulated in sub-section (4).\n(6) The financial institution shall be entitled, in its discretion, to participate in the public auction\nand to purchase the mortgaged property for an amount ten percent higher than the highest bid obtained\nin the public auction, provided that where the financial institution chooses to purchase the mortgaged\nproperty at the highest bid obtained in the public auction, it shall issue notice to the mortgagor who\nshall have three business days from the service of the notice to match the financial institution's bid. If\nthe mortgagor is able to match the financial institution's bid, he shall be allowed to purchase the\nmortgaged property.\n(7) Where the mortgagor or his agent or servant or any person put in possession by the\nmortgagor or on account of the mortgagor does not voluntarily give possession of the mortgaged\nproperty sought to be sold or sought to be purchased or purchased by the financial institution, a\nBanking Court on application of the financial institution or purchaser shall put the financial institution\nor purchaser, as the case may be, in possession of the mortgaged property in any manner deemed fit\nby it:\nProvided that the Banking Court may not order eviction of a person who is in occupation of the\nmortgaged property or any part thereof under a bona fide lease, except on expiry of the period of the\nlease, or on payment of such compensation as may be agreed between the parties or as may be\ndetermined by the Banking Court to be reasonable.\nExplanation.___Where the lease is created after the date of the mortgage and it appears to the\nBanking Court that the lease was created so as to adversely affect the value of the mortgaged property\nor to prejudice the rights and remedies of the financial institution, it shall be presumed that the lease is\nnot bona fide, unless proved otherwise.\n(8) For purposes of execution and registration of the sale deed in respect of the mortgaged\nproperty, the financial institution shall be deemed to be the duly authorized attorney of the mortgagor\nand a sale deed executed and presented for registration by duly authorized attorneys of the financial\ninstitution shall be accepted for such purposes by the Registrar and Sub-Registrar under the\nRegistration Act, 1908 (XVI of 1908).\nProvided that no such sale deed shall be executed or registered until expiry of seven days after\nthe completion of the public auction for the sale of the mortgaged property.\n(9) Upon execution and registration of the sale deed of the mortgaged property in favor of the\npurchaser all rights in such mortgaged property shall vest in the purchaser free from all encumbrances\nand the mortgagor shall be divested of any right, title and interest in the mortgaged property.\n(10) Net sale proceeds of the mortgaged property, after deducting all expenses of sale or\nexpenses incurred in any attempted sale, shall be distributed ratably amongst all mortgagees in\naccordance with their respective rights and priorities in the mortgaged property. Any surplus left, after\npaying in full all the dues of mortgagees, shall be paid to the mortgagor.\n(11) A financial institution which has sold mortgaged property in exercise of powers conferred\nherein shall file proper accounts of the sale proceeds in Banking Court within fourteen days of the sale.\n(12) All disputes relating to the sale of the mortgaged property under this section including\ndisputes amongst mortgagees in respect of the mode, conduct or method of the sale or the distribution\nof the sale proceeds, shall be decided by the Banking Court to the exclusion of any other court of law,\nincluding the High Court.\n(13) The Banking Court may grant an injunction restraining the sale or proposed sale of\nmortgaged property, if___\n(a)     it is satisfied that no mortgage in respect of the immovable property has been\ncreated; or\n(b)     it is satisfied that there is fraud in the proposed mode, conduct or method of the\nsale, provided that no injunction shall be granted on the ground of fraud unless\nupon the facts proved the Banking Court is satisfied that the applicant has\nsustained substantial injury by reason of such fraud and such injury cannot be\ncompensated by damages; or\n(c)     all moneys secured by mortgage of the mortgaged property have been paid; or\n(d)     the mortgagor or objector deposits in the Banking Court in cash the outstanding\nmortgage money.\n(14) Where any mortgaged property has been sold, the mortgagor or any person entitled to a\nshare in the rateable distribution of assets or whose interest is affected by the sale, may apply to the\nBanking Court to set aside the sale on the ground of fraud:\nProvided that no sale shall be set aside on the ground of fraud unless, upon the facts proved,\nthe Banking Court is satisfied that the applicant has sustained substantial injury by reason of such fraud\nand such injury cannot be compensated by damages.\n(15) An application for setting aside the sale under sub-section (14) must be made within seven\ndays of completion of the public auction for the sale of the mortgaged property and shall not be\nentertained by the Banking Court unless the applicant deposits an amount equal to twenty-five percent\nof the reserve price or furnishes security for the same amount to the satisfaction of the Banking Court.\n(16) The rights and remedies provided under this section are in addition to and not in lieu of\nany other rights or remedies a financial institution may have under this Ordinance.\n(17) The provisions contained in this section shall have effect notwithstanding anything\ncontained in this Ordinance or any other law for the time being in force or any judgment of any court\nand in case of any conflict between the provisions contained in this section and any other law for the\ntime being in force or any judgment of any court, the provisions contained in this section shall prevail.]"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Attachment before judgment, injunction and appointment of Receivers.",
      "content": "_(1) Where\nthe suit filed by a financial institution is for the recovery of any amount through the sale of any property\nwhich is mortgaged, pledged, hypothecated, assigned, or otherwise charged or which is the subject of\nany obligation in favour of the financial institution as security for finance or for or in relation to a\nfinance lease, the Banking Court may, on application by the financial institution, with a view to\npreventing such property from being transferred, alienated, encumbered, wasted or otherwise dealt\nwith in a manner which is likely to impair or prejudice the security in favour of the financial institution,\nor otherwise in the interest of justice___\n(a)     restrain the customer and any other concerned person from transferring,\nalienating, parting with possession or otherwise encumbering, charging,\ndisposing or dealing with the property in any manner,\n(b)     attach such property;\n(c)     transfer possession of such property to the financial institution; or\n(d)     appoint one or more Receivers of such property on such terms and conditions\nas it may deem fit.\n(2) An order under sub-section (1) may also be passed by the Banking Court in respect of any\nproperty held benami in the name of an ostensible owner whether acquired before or after the grant of\nfinance by the financial institution.\n(3) In cases where a customer has obtained property or financing through a finance lease, or\nhas executed an agreement in connection with a mortgage, charge or pledge in terms whereof the\nfinancial institution is authorized to recover or take over possession of the property without filing a\nsuit, the financial institution may, at its option:\n(a)     directly recover the same if the property is movable; or\n(b)     file a suit hereunder and the Banking Court may pass an order at any time, either\nauthorising the financial institution to recover the property directly or with the\nassistance of the court:\nProvided that in the event the financial institution wrongly or unjustifiably exercises the direct\npower of recovery hereunder it shall be liable to pay such compensation to the customer as may be\nadjudged by the Banking Court in summary proceedings to be initiated on the application of the\ncustomer and concluded in thirty days.\n(4) Nothing in sub-sections (1) to (3) shall affect the powers of the Banking Court under Order\nXXXVIII Rules 5 and 6 of the Code of Civil Procedure, 1908 (Act V of 1908), to attach before\njudgment any property other than property mentioned in sub-section (1)."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Final Decree",
      "content": "_(1) The final decree passed by a Banking Court shall provide for payment\nfrom the date of default of the amounts found to be payable on account of the default in fulfillment of\nthe obligation, and for costs including, in the case of a suit filed by a financial institution cost of funds\ndetermined under section 3.\n(2) The Banking Court may, at the time of passing a final decree, also pass an order of the\nnature contemplated by sub-section (1) of section 16 to the extent of the decretal amount."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Banking Documents",
      "content": "_(1) No financial institution shall obtain the signature of a customer\non banking document which contains blanks in respect of important particulars including the date, the\namount, the property or the period of time in question.\n(2) Finance agreements executed by or on behalf of a financial institution and a customer shall\nbe duly attested in the manner laid down in Article 17 of the Qanun-e-Shahadat Order, 1984 (P.O. 10\nof 1984).\n(3) Nothing contained in sub-section (1) and (2) shall affect the validity of any document\nexecuted prior to the date of enforcement of this Ordinance.\n(4) Notwithstanding anything contained in this section or any other law, the Banking Court\nshall not refuse to accept in evidence any document creating or purporting to create or indicating the\ncreation of a mortgage, charge, pledge or hypothecation in relation to any property or assumption of\nany obligation by a customer, guarantor, mortgagor or otherwise merely because it is not duly stamped\nor is not registered as required by any law or is not attested or witnessed as required by Article 17 of\nthe Qanun-e-Shahadat Order, 1984 (P.O. 10 of 1984), and no such document shall be impoundable by\nthe Banking Court or any other Court or authority:\nProvided that nothing contained in this sub-section shall operate to defeat the legal rights of a\nbona fide purchaser for value without notice of a document which ought to have been registered."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Execution of decree and sale with or without intervention of Banking Court",
      "content": "_(1)\nUpon pronouncement of judgment and decree by a Banking Court, the suit shall automatically stand\nconverted into execution proceedings without the need to file a separate application and no fresh notice\nneed be issued to the judgment-debtor in this regard. Particulars of the mortgaged, pledged or\nhypothecated property and other assets of the judgment-debtor shall be filed by the decree-holder for\nconsideration of the Banking Court and the case will be heard by the Banking Court for execution of\nits decree on the expiry of 30 days from the date of pronouncement of judgment and decree:\nProvided that if the record of the suit is summoned at any stage by the High Court for purposes\nof hearing an appeal under section 22 or otherwise, copies of the decree and other property documents\nshall be retained by the Banking Court for purposes of continuing the execution proceedings.\n(2) The decree of the Banking Court shall be executed in accordance with the provisions of the\nCode of Civil Procedure, 1908 (Act V of 1908) or any other law for the time being in force or in such\nmanner as the Banking Court may at the request of the decree-holder consider appropriate, including\nrecovery as arrears of land revenue.\nExplanation.___The term assets or properties in sub-section (2) shall include any assets and\nproperties acquired benami in the name of an ostensible owner.\n(3) In cases of mortgaged, pledged or hypothecated property, the financial institution may sell\nor cause the same to be sold with or without the intervention of the Banking Court either by public\nauction or by inviting sealed tenders and appropriate the proceeds towards total or partial satisfaction\nof the decree. The decree passed by a Banking Court shall constitute and confer sufficient power and\nauthority for the financial institution to sell or cause the sale of the mortgaged, pledged or hypothecated\nproperty together with transfer of marketable title and no further order of the Banking Court shall be\nrequired for this purpose.\n(4) Where a financial institution wishes to sell mortgaged, pledged or hypothecated property\nby inviting sealed tenders, it shall invite offers through advertisement in one English and one Urdu\nnewspaper which are circulated widely in the city in which the sale is to take place giving not less than\nthirty days time for submitting offers. The sealed tenders shall be opened in the presence of the\ntenderers or their representatives or such of them as attend:\nProvided that the financial institution shall be entitled in its discretion, to purchase the property\nat the highest bid received.\n(5) The provisions of sub-sections (5), (6), (7), (8), (9), (10), (11) and (12) of section 15 shall,\nmutatis mutandis, apply to sales of mortgaged, pledged or hypothecated property by the financial\ninstitution in exercise of its powers conferred by sub-section (3).\n(6) The Banking Court and the financial institution shall be entitled to seek the services and\nassistance of the police or security agency in the exercise of powers conferred by this section.\n(7) Notwithstanding anything contained in the Code of Civil Procedure 1908 (Act V of 1908),\nor any other law for the time being in force___\n(a)     the Banking Court shall follow the summary procedure for purposes of\ninvestigation of claims and objections in respect of attachment or sale of any\nproperty, whether or not mortgaged, pledged or hypothecated, and shall\ncomplete such investigation within 30 days of filing of the claims or objections;\n(b)     if the claims or objections are found by the Banking Court to be malafide or\nfiled merely to delay the sale of the property, it shall impose a penalty upto\ntwenty percent of the sale price of the property;\n(c)     the Banking Court may, in its discretion, proceed with the sale of the mortgaged,\nor pledged or hypothecated property if, in its opinion the interest of justice so\nrequire:\nProvided that the financial institution gives a written undertaking that in\nthe event the objections are found to be valid, or are sustained, it shall in addition\nto compensating the aggrieved party by the payment of such amount as may be\nadjudged by the Banking Court also pay a penalty upto twenty percent of the\nsale proceeds and such amounts shall be recoverable from the financial\ninstitution in the same manner as in execution of decrees passed hereunder."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Provisions relating to certain offences",
      "content": "_(1) Whoever___\n(a)     dishonestly commits a breach of the terms of a letter of hypothecation, trust\nreceipt or any other instrument or document executed by him whereby\npossession of the assets or properties offered as security for the re-payment of\nfinance or fulfillment of any obligation are not with the financial institution but\nare retained by or entrusted to him for the purposes of dealing with the same in\nthe ordinary course of business subject to the terms of the letter of hypothecation\nor trust receipt or other instrument or document or for the purpose of effecting\ntheir sale and depositing the sale proceeds with the financial institution; or\n(b)     makes fraudulent mis-representation or commits a breach of an obligation or\nrepresentation made to a financial institution on the basis of which the financial\ninstitution has granted a finance; or\n(c)     subsequent to the creation of a mortgage in favour of a financial institution,\ndishonestly alienates or parts with the possession of the mortgaged property\nwhether by creation of a lease or otherwise contrary to the terms thereof, without\nthe written permission of the financial institution; or\n(d)     subsequent to the passing of a decree under section 10 or 11, sells, transfers or\notherwise alienates, or parts with possession of his assets or properties acquired\nafter the grant of finance by the financial institution, including assets or\nproperties acquired benami in the name of an ostensible owner,\nshall, without prejudice to any other action which may be taken against him\nunder this Ordinance or any other law for the time being in force, be punishable\nwith imprisonment of either description for a term which may extend to three\nyears and shall also be liable to a fine which may extend to the value of the\nproperty or security as decreed or the market value whichever is higher and shall\nbe ordered by the Banking Court trying the offence to deliver up or refund to\nthe financial institution, within a time to be fixed by the Banking Court, the\nproperty or the value of the property or security.\nExplanation.___Dishonesty may be presumed where a customer has not deposited the sale\nproceeds of the property with the financial institution in violation of the terms of the agreement\nbetween the financial institution and the customer.\n(2) Whoever knowingly makes a statement which is false in material respects in an application\nfor finance and obtains a finance on the basis thereof, or applies the amount of the finance towards a\npurpose other than that for which the finance was obtained by him, or furnishes a false statement of\nstocks in violation of the terms of the agreement with the financial institution or falsely denies his\nsignatures on any banking document before the Banking Court, shall be guilty of an offence punishable\nwith imprisonment of either description for a term which may extend to three years, or with fine, or\nwith both.\n(3) Whoever resists or obstructs, either by himself or on behalf of the judgment debtor, through\nthe use of force, the execution of a decree, shall be punishable with imprisonment which may extend\nto one year, or with fine, or with both.\n(4) Whoever dishonestly issues a cheque towards re-payment of a finance or fulfillment of an\nobligation which is dishonoured on presentation shall be punishable with imprisonment which may\nextend to one year, or with fine or with both, unless he can establish, for which the burden of proof\nshall rest on him, that he had made arrangements with his bank to ensure that the cheque would be\nhonoured and that the bank was at fault in not honouring the cheque.\n(5) Where the person guilty of an offence under this Ordinance is a company or other body\ncorporate, the chief executive by whatever name called, and any director or officer involved shall be\ndeemed to be guilty of the offence and shall be liable to be prosecuted against and punished\naccordingly.\n1\n[(6) All offences under this Ordinance shall be triable by a Banking Court in accordance with\nsection 7. All offenses, except for the offence of willful default, shall be bailable, non-cognizable and\ncompoundable.]\n1\n[(7) Notwithstanding anything to the contrary provided in any other law for the time being in\nforce, action in respect of an offence of willful default shall be taken by an investigating agency, to be\nnominated in this behalf by the Federal Government, on a complaint in writing filed by an authorized\nofficer of a financial institution after it has served a thirty days notice upon the borrower demanding\npayment of the loan, advance or financial assistance.\n(8) An offence of willful default shall be cognizable, non-bailable and non-compoundable and\npunishable with imprisonment which may extend to seven years or fine not exceeding the amount of\ndefault or with both.\n(9) Any person convicted of the offence of willful default by a Banking Court shall not be\neligible to receive any loan, advance or finance from any financial institution for a period of ten years\nand shall not be permitted to contest any election as a member of the Majlis-e-Shoora (Parliament),\nany Provincial Assembly or a local body for a period of five years, after serving out a sentence after\nconviction.]"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Application of fines and costs",
      "content": "_(1) A Banking Court may direct that the whole or part of\nany fine or costs imposed under this Ordinance shall be applied in or towards___\n(a)        payment of costs of all or any proceedings under this Ordinance; and\n(b)        payment of compensation to an aggrieved party.\n(2) An order under sub-section (1) shall be deemed to be a decree passed under this Ordinance\nfor purposes of execution."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Appeal.___(1) Subject to sub",
      "content": "section (2), any person aggrieved by any judgment, decree\nsentence, or final order passed by a Banking Court may, within thirty days of such judgment, decree\nsentence or final order prefer an appeal to the High Court.\n(2) The appellant shall give notice of the filing of the appeal in accordance with the provisions\nof Order XLIII Rule 3 of the Code of Civil Procedure, 1908 (Act V of 1908) to the respondent who\nmay appear before the Banking Court to contest admission of the appeal on the date fixed for hearing.\n1\nSubs. and added by Act XXXVIII of 2016, s. 9.\n(3) The High Court shall at the stage of admission of the appeal, or at any time thereafter either\nsuo motu or on the application of the decree holder, decide by means of a reasoned order whether the\nappeal is to be admitted in part or in whole depending on the facts and circumstances of the case, and\nas to the security to be furnished by the appellant:\nProvided that the admission of the appeal shall not per se operate as a stay, and no shall any\nstay be granted therein unless the decree-holder has been given an opportunity of being heard and\nunless the appellant deposits in cash with the High Court an amount equivalent to the decretal amount\ninclusive of costs, or in the case of an appeal other than an appeal against an interim decree, at the\ndiscretion of the High Court furnishes security equal in value to such amount; and in the event of a\nstay being granted for a part of the decretal amount only, the requirement for a deposit in cash or\nfurnishing of security shall stand reduced accordingly.\n(4) An appeal under sub-section (1) shall be heard by a bench of not less that two Judges of the\nHigh Court and, in case the appeal is admitted, it shall be decided within 90 days from the date of\nadmission.\n(5) An appeal may be preferred under this section from a decree passed ex-parte.\n(6) No appeal, review or revision shall lie against an order accepting or rejecting an application\nfor leave to defend, or any interlocutory order of the Banking Court which does not dispose of the\nentire case before the Banking Court other than an order passed under sub-section (11) of section 15\nor sub-section (7) of section 19.\n(7) Any order of stay of execution of a decree passed under sub-section (2) shall automatically\nlapse on the expiry of six months from to date of the order whereupon the amount deposited in Court\nshall be paid over to the decree-holder or the decree-holder may enforce the security furnished by the\njudgment-debtor."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Restriction on transfer of assets & properties",
      "content": "(1) After publication of summons\nunder sub-section (5) of section 9, no customer shall, without the prior written permission of the\nBanking Court transfer, alienate, encumber, remove or part with possession of any of his asset or\nproperty furnished to the financial institution as security by way of mortgage, pledge, hypothecation,\ncharge, lien or otherwise pending final decision of the suit filed by the financial institution under this\nOrdinance, and any such transfer, alienation, encumbrance or other disposition by the customer in\nviolation of this sub-section shall be void and of no legal effect:\nProvided that the customer may sell any such asset or property which has been retained by or\nentrusted to him for purposes of dealing with the same in the ordinary course of business subject to the\nterms of the letter of hypothecation or trust receipt or other instrument or document executed by him,\nor for purposes of effecting their sale and depositing the sale proceeds with the financial institution:\nProvided further that the customer before making the sale shall file in the Banking Court a\nstatement supported by affidavit, containing full particulars of such asset or property, and within three\ndays after the sale shall submit a full account thereof to the Banking Court and the financial institution.\n(2) After pronouncement of judgment and decree by the Banking Court, including an interim\ndecree under section 11, no judgment-debtor shall without the prior written permission of the Banking\nCourt transfer, alienate, encumber or part with possession of any assets or properties and any such\ntransfer, alienation, encumbrance or other disposition by a judgment-debtor in violation of this sub-\nsection shall be void and of no legal effect.\n(3) The provisions of sub-section (1) shall also apply to a person who has furnished any security\non behalf of a customer to the financial institution on the basis of which finance was granted, provided\nsuch person is a defendant in the suit filed under section 9 or is added as a defendant thereafter."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Application of the Limitation Act, 1908 (Act IX of 1908)",
      "content": "_(1) Save as otherwise\nprovided in this Ordinance, the provisions of the Limitation Act, 1908 (Act IX of 1908) shall apply to\nall cases instituted or filed in a Banking Court after the coming into force of this Ordinance.\n(2) A suit under section 9 may be entertained by a Banking Court after the period of limitation\nprescribed therefor, if the plaintiff satisfies the Banking Court that he had sufficient cause for not filing\nthe suit within such period."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Power to make rules. The Federal Government may, by notification in the official Gazette,",
      "content": "make rules for carrying out the purposes of this Ordinance."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Removal of difficulties. If any difficulty arises in giving effect to any of the provisions of",
      "content": "this Ordinance, the Federal Government may, by notification in the official Gazette, make such\nprovisions as it thinks fit for removing such difficulties."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Finality of order. Subject to the provisions of section 22, no court or other authority shall",
      "content": "revise or review or call, or permit to be called, into question any proceeding, judgment, decree,\nsentence or order of a Banking Court or the legality or propriety of anything done or intended to be\ndone by the Banking Court in exercise of jurisdiction under this Ordinance:\nProvided that the Banking Court may, on its own accord or on application of any party, and\nwith notice to the other party or, as the case may be, to both the parties, correct any clerical or\ntypographical mistake in any judgment, decree, sentence or order passed by it;"
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Indemnity. No suit, prosecution or other legal proceeding shall lie against the Federal",
      "content": "Government or a Banking Court or a financial institution or any person for any thing which is in good\nfaith done or intended to be done under this Ordinance or any rule made thereunder."
    }
  ],
  "definitions": [
    {
      "term": "financial institution",
      "definition": "and includes___ (i) any company whether incorporated within or outside Pakistan which transacts the business of banking or any associated or ancillary business in Pakistan through its branches within or outside Pakistan and includes a government savings bank, but excludes the State Bank of Pakistan; (ii) a modaraba or modaraba management company, leasing company, investment bank, venture capital company, financing company, unit trust or mutual fund of any kind and credit or investment institution, corporation or company; and (iii) any company authorised by law to carry on any similar business, as the Federal Government may by notification in the official Gazette, specify;",
      "source_provision": "sec2"
    },
    {
      "term": "customer",
      "definition": "a person to whom finance has been extended by a financial institution 1[within or outside Pakistan] and includes a person on whose behalf a guarantee or letter of credit has been issued by a financial institution as well as a surety or an indemnifier;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Ordinance. 1 [(g) “willful default”means___ (i) deliberate or intentional failure to repay any finance, loan, advance or any financial assistance received by any person from a financial institution after such payment has become due under the terms of any law or an agreement, rules or regulations issued by the State Bank of Pakistan; (ii) utilization of finance, loan, advance or financial assistance or a substantial part thereof, obtained by any person from a financial institution for a purpose other than that for which such finance, loan, advance or financial assistance had been obtained and payment in part or full not made to the financial institution; or (iii) removal, transfer, misappropriation or sale of any assets collateralized to secure a finance, loan, advance or financial assistance obtained from a financial institution without permission of such institution.]",
      "source_provision": "sec2"
    }
  ]
}
