{
  "id": "pk-financial-institutions-secured-transactions-act-2016",
  "type": "statute",
  "title": "Financial Institutions (Secured Transactions) Act, 2016",
  "title_en": "Financial Institutions (Secured Transactions) Act, 2016",
  "short_name": "FITA",
  "status": "in_force",
  "issued_date": "2016-06-28",
  "in_force_date": "2016-06-28",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Jvb50%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Financial Institutions (Secured Transactions) Act, 2016 (XXXI of 2016) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, commencement and a p p l i c a t i o n",
      "content": "(1) This Act may be called the\nFinancial Institutions (Secured Transactions) Act, 2016.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force upon issuance of the notification by the 1[Commission]under\nsub-section (2) of section 19."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the subject or context,—\n(i)       “account debtor” means any person liable, whether under a contract or\notherwise, to pay any receivables or discharge any obligation in respect of\nreceivables;\n1\n[(ia)     “acquisition security interest” means a security interest in tangible movable\nproperty which secures an obligation to pay any unpaid portion of the\npurchase price of that property, or other credit extended to enable the customer\nto acquire rights in the property to the extent that the credit is used for that\nPurpose;]\n(ii)      “after-acquired 1[and future] property” means movable property that is\nacquired by a customer after entering into a security agreement, and includes\nfuture receivables as specified in the explanation to sub-section (4) of section\n53;\n(iii)     “agricultural produce” means —\n(a)     any produce of agriculture or horticulture, including but not limited to\ncrops (including growing crops), standing timber, poultry, fish and\nlivestock (including unborn offspring); and\n1\nSubs. and ins. by the Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), ss. 2 -3\n(b)     products derived from any produce under clause (i), including but\nnot limited to meat, eggs, hides, bones, skins, wool and hair;\n(iv)          “assignee” means a person in whose favour the receivables are assigned;\n(v)           “assignment of receivables” means a transfer of rights, title, interests and\nbenefits of the receivables by the assignor to the assignee;\n(vi)          “assignor” means a person who assigns the receivables;\n(vii)         “book-entry security” shall have the same meaning as is assigned to it under\nclause (5) of section 2 of the Central Depositories Act, 1997 (XIX of 1997);\n(viii)        “collateral” means the movable property, located in or outside Pakistan,\nthat is subject to a security interest;\n(ix)          “commingled goods 1[and products]” means a product or mass that is\nproduced or manufactured by physically associating or uniting collateral with\nother movable property in such a manner that the identity of the collateral is\nlost in such product or mass;\n(x)           “company” shall have the same meaning as is assigned to it under 1[clause\n(17) of sub-section (1) of section 2 of the Companies Act];\n1\n[(xa)     “Companies Act” means the Companies Act, 2017 (XIX of 2017);\n(xb)      “Commission” shall have the same meaning as assigned to it under clause (g)\nof sub-section (l) of section 2 of the Securities and Exchange Commission of\nPakistan Act, 1997 (XLII of 1997);]\n(xi)          “control” with respect to a deposit account exists —\n(a)        automatically upon the creation of the security interest if the\nsecured creditor is the depository bank; or\n(b)        if the depository bank has entered into a control agreement with\nthe customer and the secured creditor;\n(xii)         “control agreement” means an agreement in writing between the secured\ncreditor, customer and the depository bank according to which the depository\nbank has agreed to follow instructions from the secured creditor with respect\nto the payment of funds credited in the deposit account without further consent\nfrom the customer;\n(xiii)        “customer” shall have the same meaning as is assigned to it under clause (c)\nof section 2 of the Recovery Ordinance and shall be deemed to include an\nentity;\n1\nIns. and Subs. by the Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), s. 3\n(xiv)       “deposit account” includes a current or a savings account maintained with\na depository bank to which funds may be credited;\n(xv)        “depository bank” means the financial institution maintaining a deposit\naccount;\n(xvi)       “electronic” shall have the same meaning as is assigned to it under clause\n(1) of section 2 of the Electronic Transactions Ordinance, 2002 (Ordinance\nNo. Ll of 2002);\n(xvii)      “entity” means a person other than a company, and includes a natural\nperson, a sole proprietorship, a partnership or association of persons, a\nnon-govenment organization registered under the Voluntary Social Welfare\nAgencies (Registration and Control) Ordinance, 1961 (XLVI of 1961) or any\nother law for the time being in force for the registration of a non-government\norganization, a cooperative society registered under the Co-operative\nSocieties Act, 1925 (VII of 1925) or any other law for the time being in\nforce for the registration of a cooperative society, a society registered under\ntime being in force for the registration of a society, a trust created under\nthe Trusts Act, 1882 (II of 1882); and a body corporate established pursuant\nto a law;\n(xviii) “event of default”, in relation to a security agreement, means —\n(a)     the failure to pay or to otherwise perform the obligation secured\nunder the security agreement when due; or\n(b)     an event that gives the secured creditor the right to enforce the\nsecurity interest under the security agreement;\n(xix)       “exempted property” means movable property as notified by the Federal\nGovernment for the purposes of sub-section (2) of section 4 notwithstanding\nanything inconsistent therewith contained in the proviso to sub-section (1) of\nsection 60 of the Code of Civil Procedure, 1908 (Act V of 1908) or any\nother law for the time being in force, provided that until such notification\nhas been issued the proviso to sub-section (1) of section 60 of the Code of\nCiviI Procedure, 1908 (Act V of 1908) shall continue to apply;\n1\n[(xx) “financing statement” means the prescribed form to be filed in the register\nfor the purposes of perfecting one or more security interests;]\n1\n[(xxi) *                 *            *            *            *            *            *]\n(xxii) “Form 10” means the prescribed form to be filed with the registrar of\ncompanies for the purposes of entering the particulars of a security interest\ncreated by a company in the register of mortgages and charges under the\n1\n[ Companies Act, 2017 (XIX of 2017)];\n1\nSubs. and omitted by the Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), s. 3\n(xxiii)        “Form 16” means the prescribed form to be filed with the registrar of\ncompanies for the purposes of modifying the particulars of a security\ninterest created by a company in the register of mortgages and charges\nunder the 1[Companies Act, 2017 (XIX of 2017)];\n1\n[(xxiv) *               *            *            *            *            *            *]\n(xxv)          “immovable property” shall include land, benefits to arise out of land,\nand things attached to the earth, or permanently fastened to anything\nattached to the earth, and shall, notwithstanding anything inconsistent\ntherewith contained in the General Clauses Act, 1897 (X of 1897),\nTransfer of Property Act, 1882 (IV of 1882), Registration Act 1908, (XVI\nof 1908) and any other law for the time being in force, exclude property\nattached to immovable property as defined in clause (xxxviii) of this\nsub-section;\n(xxvi)         “information system” shall have the same meaning as is assigned to it in\nsection 2 (p) of the Electronic Transactions Ordinance, 2002 (LI of 2002);\n(xxvii)        “modification statement” means the prescribed form to be filed in the\nregister for the purposes of effecting the modification to a registered\nfinancing statement;\n(xxviii)       “motor vehicle” shall have the same meaning as is assigned to it under\nsub-section (23) of section 2 of the Motor Vehicles Ordinance, 1965 (XIX\nof 1965);\n(xxix)         “movable property” means any tangible or intangible property other than\nimmovable property, including but not limited to receivables; rights\nunder letters of credit; rights under trust receipts; securities (including\nGovernment securities) other than hook-entry securities; right to funds\ncredited in a deposit account; title documents; negotiable instruments;\nintellectual property, including patents, trademarks, copy rights, trade\nnames, goodwill, royalties; stock in trade; inventory; interest in\npartnership and other form of entity; ornaments; jewellery; stones;\ngoods-in-transit; agricultural produce; leaves; grass, including growing\ngrass; petroleum or minerals that have been extracted; motor vehicles\nand property attached to immovable property as defined in clause\n(xxxviii) of this sub-section;\n(xxx)          “negotiable instrument” shall have the same meaning as is assigned to\nit under section 13 of the Negotiable instruments Act, 1881 (XXVI of\n1881);\n(xxxi)         “notification” means a notification published in the official Gazette;\n1\nSubs. and Omitted by the Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), s. 3\n(xxxii)         “perfection” means the act required to be done in terms of section 14 to\nmake a security interest effective against third parties;\n1\n[(xxxiii)               *            *             *            *            *            *            *]\n(xxxiv) “possession” means the actual possession of collateral by a person\nor an agent or employee of that person, or by an independent person\nthat acknowledges holding it for that person;\n1\n[(XXXV) “possession of an electronic title document by a person” means the\ntransfer of exclusive control of the electronic title document to that person\nin accordance with the procedures established by the system under which\nthe electronic title document is issued;]\n(xxxvi)          “prescribed” means prescribed by rules 1[**] made under this Act;\n(xxxvii) “proceeds” means identifiable or traceable movable property derived from\ncollateral including (a) movable property acquired, directly or\nindirectly, upon the sale, lease, licence, exchange, 1[replacement] or any\nother mode of alienation of collateral; (b) natural fruits of the collateral,\nincluding harvested produce where the collateral is crops or wool, meat\nor offspring where the collateral is livestock; (c) any and all amounts,\nrevenues and receivables paid or payable under or in connection with\nthe collateral; (d) rights arising out of the collateral, including a right to\nan insurance payment or any other payment as indemnity or\ncompensation for loss of, or damage to the collateral; and (e) proceeds\nof proceeds;\n(xxxviii) “ property attached to immovable property” means the following property\nirrespective of whether it is attached to the earth or permanently fastened to\nanything attached to the earth:\n(a)             plant, equipment or machinery;\n(b)             fixtures and fittings;\n(c)             cables or pipelines embedded in the earth or otherwise;\nand\n(d)             any other item of property as may be notified by the\nFederal Government for the purposes of this Act\nnotwithstanding anything inconsistent therewith\ncontained in the General Clauses Act, 1897 (X of 1897),\nTransfer of Property Act, 1882 (IV of 1882),\nRegistration Act, 1908 (XVI of 1908) and any other law\nfor the time being in force;\n(xxxix) “receivables” means a contractual or non-contractual right to\nreceive money, whether such right is existing, future, accruing,\nconditional or contingent and includes rents; profits; dues;\n1\nOmitted, Subs. and ins. by the Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), s. 3\na money award by an arbitrator; monies payable as salaries of\nemployees; dividends; tolls, user-fees or any sum, by whatever name\ncalled; monies payable under decrees; monies payable under\nguarantees; actionable claims and all kinds of actual or contingent\nmonetary obligations; and excludes a right to payment of funds\ncredited in a deposit account and right to payment under a negotiable\ninstrument;\n(xl)           “Recovery Ordinance” means the Financial Institutions (Recovery of\nFinances) Ordinance, 2001 (XLVI of 2001);\n(xli)          “register” means the electronic register set up under section 21;\n(xlii)         “registrar” means the person in-charge of the Registry appointed under\nsub-section (1) of section 20 and shall include, unless the context requires\notherwise, a deputy registrar discharging the functions, duties and powers\nof the registrar pursuant to sub­section (2) of section 20;\n(xliii)        “registration”—\n(a)      in relation to a security interest created by an entity, means that a\nfinancing statement and modification statements in relation\nthereto, if any, have been registered in the register in respect of\nsuch security interest in accordance with the provisions of Part\nIV of this Act; or\n(b)      in relation to a security interest created by a company, means\nthat a Form 10 and Form 16, if any, have been registered in the\nregister of mortgages and charges in respect of such security\ninterest in accordance with the provisions of the 1 [Companies\nAct, 2017 (XIX of 2017)];\n(xliv)           “registration number” is the number assigned to a registered\nmodification statement and termination statement by the register\npursuant to clause (b) of sub-section (1) of section 22;\n(xlv)            “Registry” means the Secured Transactions Registry established under\nsection 19;\n1\n[(xlvi)      “secured creditor” means a financial institution or a consortium of\nfinancial institutions in whose favour a security interest is created by the\ncustomer and in the case of a security interest that is an absolute\nassignment of receivables, the secured creditor is the assignee;]\n(xlvii)          “security agreement” means an agreement, instrument or any other\ndocument in writing that creates or provides for a security interest in\nfavour of a secured creditor;\n1\nSubs. by the Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), s. 3\n1\n[(xlviii)     “security interest” means, —\n(a) a right, title, encumbrance or interest of any kind upon movable\nproperty created or provided for by a security agreement in relation\nto a transaction that in substance secures the payment or\nperformance of a customer’s obligation without regard to the form\nof the transaction or the terminology used by the parties or the\nidentity of the person who has title to the movable property, and\nincludes any charge, mortgage, hypothecation, fixed charge,\nfloating charge, assignment, lien, pledge, assignment of receivables\nby way of security and transactions under which a secured creditor\nretains title such as a finance lease, hire purchase agreement, sale\nand lease back arrangement, conditional sale agreement and\nretention of title arrangement, having similar effect; and\n(b) an absolute assignment of receivables;]\n1\n[(xlviiia) “specified” means specified through regulations made by the\nCommission;]\n(xlix)       “statement” means the financing statement, modification statement\nand termination statement;\n(l)           “termination statement” means the prescribed form to be filed in the\nregister for the purposes of rendering a registered financing statement\nand modification statements in relation thereto, if any, ineffective;\n1\n[(li)     “title document” means a document in writing evidencing title to goods\nwhich is, by law or custom, transferable by delivery (whether with or\nwithout endorsement) or control and includes a bill of lading, dock\nwarrant, warehouse receipt, railway receipt, airway bill, truck receipts\nor similar record issued by a person in the business of transporting or\nstoring goods;]\n(lii)     “unique registration number” is the number assigned to a registered\nfinancing statement by the register pursuant to clause (a) of sub-section\n(1) of section 22;\n(liii)    “value” means the consideration that a person gives where such person\nacquires the rights —\n(a)      in return for a binding commitment to give finance;\n(b)      as security for, or satisfaction of, a pre-existing claim, in whole\nor in part;\n(c)      in return for a promise or anything given in exchange; and\n(liv)     “vehicle registration number” means the number assigned to a motor\nvehicle by the relevant registering authority for the purposes of\nregistration of such motor vehicle under the Motor Vehicles Ordinance,\n1965 (XIX of 1965).\n1\nSubs. and ins. by the Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), s. 3\n(2) Words and expressions used but not defined herein shall, unless repugnant to the\ncontext, have the same meaning as is assigned to them under the Recovery Ordinance."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Scope of Act",
      "content": "This Act shall not apply to or affect any of the following,\nnamely: —\n(a)       a security interest in any immovable property;\n(b)       a security interest in a book-entry security;\n(c)       a security interest created by operation of law, including but not limited to a\nlien on movable property under the Sale of Goods Act, 1930 (III of 1930) or the\nContract Act, 1872 (IX of 1872), except for the purposes of determining\npriority of such security interests as set forth in Part V of this Act;\n(d)       a security interest in any aircraft as defined in sub-clause (b) of section 2 of\nthe Civil Aviation Ordinance, 1960 (XXXII of 1960); and\n(e)       a security interest in any vessel as defined in sub-section (56) of section 2 of the\nMerchant Shipping Ordinance, 2001 (LII of 2001).\n___________"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Right to create a security interest",
      "content": "(1) Subject to sub-section (2), a customer may\ncreate a security interest to secure its own obligation or that of another person in\naccordance with the provisions of this Act.\n(2) A customer shall not create a security interest in exempted property and, if created,\nsuch security interest shall be void."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Effectiveness of a security interest",
      "content": "A security interest created in favour of a\nsecured creditor shall be effective against the customer only if —\n(a)       the customer and the secured creditor have agreed to create a security\ninterest in favour of the secured creditor;\n(b)       in the case of a 1 [security interest that is perfected by possession of collateral] and\nsecurity interests created pursuant to sections 11 and 12, the customer has also\ngiven possession of the collateral to the secured creditor;\n(c)       the secured creditor has given value to the customer; and\n(d)\nthe customer has rights in the collateral or the power to transfer rights in the\ncollateral.\n____________________________________________________________________________\n1\nSubs. by the Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), s. 4."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Security agreement",
      "content": "(1) The secured creditor and the customer shall enter into a security\nagreement in terms of sub-section (2) for all security interests other than security interests created\npursuant to sections 11 and 12.\n(2) A security agreement shall state —\n(a)       the name and address of the secured creditor and customer;\n1\n[(b) for all security interests other than an absolute assignment of receivables, the\nobligations secured by the security interest, in accordance with sub-section (3);\n(c)       a description of the collateral in accordance with sub-section (3); and]\n(d)       the date of its execution.\n1\n[(3) The obligations and the collateral may be described in the security agreement in a manner\nthat reasonably allows their identification.\n(4) A description of secured obligations that indicates that the security interest secures all\nobligations owed to the secured creditor at any time or that states a maximum amount satisfies the\nstandard referred to in sub-section (3).\n(5) A description of collateral that indicates that the collateral consists of all of the\ncustomer’s movable property, or of all the customer’s movable property within a generic category,\nsatisfies the standard referred to in sub-section (3).]"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Security interest in proceeds",
      "content": "(1) A security interest shall extend to the proceeds of the\ncollateral, unless the security agreement provides otherwise.\n(2) A security interest in proceeds shall be effective against the customer whether or not the\nsecurity agreement contains a description of the proceeds."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Security interest in commingled goods 1[and products]",
      "content": "(1) A security interest shall\nextend to commingled goods 1[and products], unless the security agreement provides otherwise.\n(2) The security interest in the commingled goods 1[and products] shall be limited to the value\nof the collateral immediately before it became part of such commingled goods 1[and products]."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Security interest in after",
      "content": "acquired 1[and future] property.— (1) A security agreement\nmay provide for a security interest in after-acquired 1[and future] property.\n(2) Unless otherwise provided in a security agreement, the security interest shall attach to after-\nacquired 1[and future] property on the acquisition by the customer of rights in the after-acquired 1[and\nfuture] property."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. 1[Obligations that may be secured]",
      "content": "1[(1) Subject to sub-section (1A), a security interest\nmay secure one or more obligations of any type, whether monetary or non-monetary, present or future,\ndetermined or determinable, conditional or unconditional, or fixed or fluctuating.]\n_______________________________________________________________________________\n1\nSubs., Added and Ins. by the Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), ss. 5-8.\n1\n[(1A)] Subject to sub-section (2), a security interest shall not extend to future finance that has\nnot been committed to be extended to the customer at the time of the creation of security interest,\nunless the security agreement provides otherwise.\n(2) Section 174 of the Contract Act, 1872 (IX of 1872) shall apply in the case of a 1[security\ninterest that is perfected by possession of the collateral or, in the case of collateral covered by a title document,\nby possession of the title document]."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Security interest in collateral covered by a title document",
      "content": "(1) A security interest may\nbe created in collateral covered by a title document by giving possession to the secured creditor of\nthe title document duly endorsed in favour of such secured creditor or issued in his name.\n(2) A security agreement shall not be required where a security interest in collateral covered\nby a title document is created in accordance with sub-section (1).\nExplanation—Collateral shall be covered by a title document where such collateral is in\nthe possession of the issuer of the title document."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Security interest in a negotiable instrument",
      "content": "(1) A security interest may be created\nin a negotiable instrument by issuing it in the name of the secured creditor or negotiating it in favour\nof the secured creditor in accordance with the Negotiable Instruments Act, 1881 (XXVI of 1881).\n(2) A security agreement shall not be required where a security interest in a negotiable instrument\nis created in accordance with sub-section (1).\n(3) If a negotiable instrument is secured by movable property, then, unless otherwise agreed\nbetween the secured creditor and the customer, such security shall stand automatically transferred to\nand vest in the secured creditor upon creation of the security interest in terms of sub-section (1)."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Security interest in a right to payment of funds credited in a deposit account",
      "content": "Where\nthe depository bank is not the secured creditor, creation of a security interest in a right to payment of\nfunds credited in a deposit account shall not bind or otherwise impose any obligation on the\ndepository bank with respect to the security interest unless such security interest has been created\nwith the prior written consent of such depository bank.\n____________________\n1\n[14. Perfection.― (l) A security interest in movable property may be perfected by registration\nas provided under this Act.\n(2) A security interest in a right to payment of funds credited in a deposit account may also be\nperfected by control.\n(3) A security interest in collateral covered by a title document may also be perfected by\npossession of the title document by the secured creditor.\n1\nRenumbered and Subs.by the Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), ss. 8-9.\n(4) A security interest in tangible movable property may also be perfected by possession of the\nproperty by the secured creditor.\nIllustrations\n(a)    Customer A (an entity) entered into a security agreement over shares with Secured\nCreditor B and delivered possession of the share certificates to Secured Creditor B\non the 1st December. A financing statement was registered in the register in respect\nof the security interest on the 3rd December. The security interest in the shares was\nperfected by registration on the 3rd December.\n(b)    Customer C (an entity) created a security interest over all present and\nafter―acquired inventory in favour of Secured Creditor D on the 1st January. A\nfinancing statement was registered in the register in respect of the security interest\non the 3rd January. The security interest was perfected by registration on the 3rd\nJanuary.\n(c)    Customer N (an entity) enters into an assignment agreement with Secured Creditor\nM on the 1st March pursuant to which Customer N assigns receivables under a\nsupply agreement as security in favour of Secured Creditor M. A financing statement\nwas registered in the register in respect of the assignment on the 3rd March. The\nassignment of receivables by way of security was perfected by registration on the\n3rd March.\n(d)    Customer G (an entity) leases a car from Secured Creditor H pursuant to a finance\nlease agreement on the 1st December. Secured Creditor H is registered as the\nowner of the car. A financing statement was registered in the register in respect of\nthe finance lease on the 2nd December. The finance lease was perfected by\nregistration on the 2nd December.\n(e)    Customer F (a company) created a security interest in a right to payment of funds\ncredited in a deposit account in favour of Secured Creditor G on the 1st December.\nThe deposit account was maintained with the Depository Bank H. A control\nagreement was entered into between Customer F, Secured Creditor G and\nDepository Bank H on the 2nd December. The security interest in a right to payment\nof funds credited in a deposit account was perfected by control on the 2nd December.\n(f)    Customer H (an entity) created a security interest over all its present and\nafter―acquired movable property (including funds held in deposit accounts) in\nfavour of Secured Creditor P on the 1st March. A financing statement in respect of\nthe security interest was registered in the register on the 4th March. The\nhypothecation was perfected by registration on the 4th March. In this case, the\nsecurity interest in a right to payment of funds credited in a deposit account was also\nperfected by registration.\n(g)    Customer M (a company) created a security interest over its equipment in favour of\nSecured Creditor N on the 5th April. The security interest extended to any proceeds\nreceived from the sale of the equipment with the Creditor N.A financing statement\nwas registered in the companies’ register of mortgages and charges on the 10th April\nin respect of the security interest. The security interest was perfected by registration\non the 10th April. The Secured Creditor N authorized in writing the sale of the\nequipment by Customer M on the 5th May which resulted in Customer M receiving\na cheque of one hundred thousand rupees in the form of proceeds arising from the\nsale of such equipment. In this case, Secured Creditor N’s security interest in the\ncheque of one hundred thousand rupees (a negotiable instrument) was also perfected\nby registration on the 10th April.]"
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Perfection in after",
      "content": "acquired 1[and future] property, proceeds and commingled goods\n1\n[and products].—(1) A security interest in after-acquired 1[and future] property, proceeds or\ncommingled goods 1[and products], where applicable, shall stand automatically perfected by virtue\nof the perfection of the security interest in the collateral.\n(2) Where a security interest is perfected by registration as provided under this Act,\nsub-section (1) shall not apply if the after-acquired 1[and future] property, non-cash proceeds or\ncommingled goods 1[and products], as applicable, is not covered in the registered financing\nstatement or Form 10, as applicable.\nExplanation. For the purposes of sub-section (2), non-cash proceeds shall include all\nproceeds other than money, cheques, funds credited in a deposit account or the like."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Specialized registry",
      "content": "A security interest in intellectual property that requires\nregistration in a specialized registry pursuant to any other law currently in force, may,\nnotwithstanding the provisions of such law, be perfected only by registration as provided under this\nAct."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Unperfected security Interests",
      "content": "A security interest that is not perfected shall be void\nagainst the liquidator, administrator or receiver but shall not prejudice the secured creditor’s right to\nrepayment of finance as an unsecured creditor.\n___________________"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Application o f this Part",
      "content": "(1) This Part shall apply only to an entity creating a\nsecurity interest.\n(2) This Part of the Act shall not apply to a company and shall not affect the provisions\ncontained in the 1 [Companies Act, 2017 (XIX of 2017)] requiring registration of security interests\ncreated by a company."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Secured Transactions Registry",
      "content": "(1) The Federal Government shall, by notification in\nthe official Gazette, establish or cause to be established a registry to be known as the ‘Secured\nTransactions Registry’ for the purposes of registration of security interests created by an entity and\nall matters incidental thereto.\n(2) The 1 [Commission] shall, by notification in the official Gazette, specify the date from\nwhich the Registry established under sub-section (1) shall be operational.\n1\n[(3) The head office of the Registry shall be at such place as the Commission may specify and,\nif considered necessary, the Registry may establish branch offices of the Registry at such other places\nas the Commission deems fit for the purposes of facilitating registration of security interests created\nby an entity and to perform any or all of the functions of the Registry, as may be determined by the\nCommission.]\n________________________________________________________________________________\n1\nIns. and Subs. by The Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), s s. 10-12.\n(4) The 1 [Commission] may, by notification in the official Gazette, define the territorial\nlimits within which an office of the Registry may exercise its functions.\n(5) The Registry shall have its own seal 1 [as approved by the Commission].\n[20. Appointment of registrar, deputy registrars and other officers.―(1) The Commission\n1\nmay empower or appoint any officer of the Commission as the head of the Registry for the purposes\nof managing and controlling the register set up pursuant to section 21 and such other functions as may\nbe determined by the Commission.\n(2) The Commission may also appoint deputy registrars for each branch office of the Registry\nto perform, under the direction of the registrar, such functions, duties and powers of the registrar\nunder this Act as may be notified by the Commission.\n(3) The Commission may appoint such other officers with such designations as it may think fit\nfor the purposes of this Act, to perform under the direction of the registrar, such functions, duties and\npowers under this Act as may be determined by the Commission.]"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Register of security interests",
      "content": "(1) A register shall be maintained in electronic format\n1\n[*******] to record statements in relation to security interests created by an entity.\n(2) The register shall be maintained and operated under control and management of the\nregistrar.\n(3) The register shall be operated using an automated information system which shall —\n(a)      allow a secured creditor to file a statement in terms of sections 23, 24 and 26;\n1\n[(b) *       *           *            *           *            *           *]\n(c)      reject filing of a statement in terms of section 28;\n(d)      issue a verification statement in terms of section 29;\n(e)      allow a person to search the register in terms of section 33;\n(f)      issue search reports under sub-section (3) of section 33;\n(g)      allow a secured creditor to pay the prescribed fees, if any, for filing statements\nin the register;\n(h)      allow a person to pay the prescribed fees for searching the register in terms of\nsection 33;\n(i)      allow an entity or any person having rights in the collateral to file an application\nunder sub-section (3) of section 31; and\n(j)      allow a person to do such other things as are required or permitted by, or under,\nthis Act to be done by a person in relation to the register.\n________________________________________________________________________________\n1\nSubs., ins. and omitted by The Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), ss. 1 2-14.\n(4) The 1 [Commission] may, by way of regulations, 1 [specify] requirements for the use of"
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Organization of the register",
      "content": "(1) The register shall assign—\n(a)         a unique registration number to each registered financing statement; and\n(b)         a registration number to each registered modification statement and termination\nstatement relating to a registered financing statement under clause (a) in a\nmanner that associates them with the unique registration number assigned to\nsuch registered financing statement.\n(2) The register shall index registered financing statements by —\n1\n[ (a)        *           *           *            *           *            *]\n(b)         where the entity is a natural person, the National Identity Card number or\nNational Identity Card for Overseas Pakistanis number, or in the case of a\nforeign national, the passport number;\n1\n[(ba) in the case of any other entity, as may be specified;]\n1\n[(c) the vehicle registration number in case of a motor vehicle for which the vehicle\nregistration number is given in the financing statement; and]\n(d)         the unique registration number."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Financing statement",
      "content": "(1) The secured creditor may, in respect of a security interest,\nfile a financing statement in the register.\n(2) The financing statement shall 1 [*******] contain the following particulars of a security\ninterest:\n(a)         name of the entity;\n(b)         address of the entity;\n(c)         type of the entity;\n(d)         where the entity is a natural person, the National Identity Card number or\nNational Identity Card for Overseas Pakistanis number, or in the case of a\nforeign national, the passport number;\n(e)         name and address of the secured creditor;\n1\n[(f) term of the registration up to a maximum of five years;]\n1\n[(g) maximum amount secured by the security interest unless the financing\nstatement relates to an absolute transfer of receivables; and]\n1\n[(h)    description of the collateral and its proceeds, where applicable:\n________________________________________________________________________________\n1\nSubs., Omitted and Ins. by The Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), ss. 14 -16.\nProvided that a description of collateral is sufficient if it reasonably allows its identification.\nA description of collateral that is a motor vehicle may, but need not, include its vehicle registration\nnumber.]\n(i) 1 [* *            *       *         *         *         *        *        *]\n1\n[(3)     A financing statement may be filed before a security agreement is entered into and\na financing statement may perfect security interests created by more than one security agreements.]\n1\n[(4)      A financing statement is only effective if it has been authorized in writing by the\nentity and an entity shall be deemed to have authorized the registration of a financing statement that\ndescribes collateral if the entity enters into a security agreement that covers that collateral.]"
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Modification of registered financing statement",
      "content": "(1) The secured creditor may,\nin relation to a registered financing statement, file a modification statement in the register in respect\nof —\n(a) transfer of all or part of the security interest to which the registered financing\nstatement relates;\n(b)     change in description of collateral;\n(c)     addition or omission of collateral;\n(d)     change in maximum amount secured by the security interest;\n(e)     change in name of the entity;\n(f)     change in address of the entity;\n(g)     where the entity is a natural person, change in the National Identity Card\nnumber or National Identify Card for Overseas Pakistanis number, or, in case\nof a foreign national, passport number;\n(h)     change in type of the entity;\n(i)     change in name or address of the secured creditor; 1[*]\n1\n[(ia) extension of the term of the registration, in accordance with sub-section (2A);\nor]\n(j)     any other alteration to the information contained in the registered Financing\nstatement.\n(2)                 The modification statement shall 1 [*******] contain the following particulars,\nnamely:—\n(a)     unique registration number; and\n(b)     nature of modification to the registered financing statement.\n1\n[(2A) The term of a registration may for a maximum period of five years from its expiry be\nextended at any time within six months before the then-current expiry date by filing a modification\n_________________________________________________________________________________________________\n1\nSubs., omitted and added by the Act of The Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), ss. 16,17.\nstatement to that effect. The term of a registration may be extended in this way more than once.]\n(3) The filing of the modification statement by the secured creditor under sub-section (1) shall\nnot require authorization in writing by the entity, unless the modification is in respect of an increase in\nthe maximum amount secured by the security interest or is in respect of an addition of collateral or\notherwise increases the exposure of the entity to the secured creditor.\n1\n25.              [*       *           *           *           *            *           *]"
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Termination of a registered financing statement",
      "content": "(1) A secured creditor shall, in\nrelation to a registered financing statement, file a termination statement in the register within fifteen\nworking days from the date of payment or satisfaction, in full, of the obligation to which the registered\nfinancing statement relates.\n(2) The termination statement shall 1[*******] contain the following particulars, namely:—\n(a)       unique registration number; and\n(b)       date on which the obligation was paid or satisfied, in full."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Effectiveness of filing",
      "content": "A statement shall stand registered when a unique registration\nnumber or registration number, as applicable, date and time is assigned to it in the register and such\nstatement becomes publicly searchable."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. 1[Incomplete filings]. A statement shall not be registered, if",
      "content": "(a)       the particulars required to be entered in a statement are incomplete; or\n(b)       the secured creditor has failed to pay the prescribed fee, if any, for filing the\nstatement in the register."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Verification statement",
      "content": "(1) In respect of a registered statement, a verification\nstatement shall be issued to the secured creditor in such form as may be prescribed by rules and\ncontain the following information:\n(a)       unique registration number or registration number, as applicable;\n(b)       particulars as stated in the statement; and\n(c)       date and time on which the statement was registered.\n(2) The verification statement shall be conclusive evidence that a statement has been\nregistered in accordance with the requirements of Part IV of this Act."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Ineffectiveness of a registered financing statement and modification statement",
      "content": "(1)\nA registered financing statement shall be ineffective, if—\n1\nOmitted and subs. by the Act of The Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), ss. 18-20.\n1\n[(a) particulars of an entity under clause (a) (for entities other than natural persons)\nor (d) (for natural persons) of sub-section (2) of section 23 are stated incorrectly\nsuch that a search of the register using the correct particulars would not retrieve\nthe registered financing statement;]\n(b)       description of the collateral is stated insufficiently 1[*******] provided that the\nregistered financing statement shall be ineffective only to the extent of the\ncollateral which has been insufficiently described and will not render the\nregistered financing statement ineffective with respect to other collateral\nsufficiently described; 1[or]\n1\n(c)           [*            *          *            *            *           *            *]\n1\n[(d) the entity has not authorized the filing of a financing statement.]\n(2) If the secured creditor fails to file a modification statement in relation to a registered\nfinancing statement in respect of a change under 1 [clause (e) for entities other than natural persons\nor (g) for natural persons] under sub-section (1) of section 24 within ten days of acquiring actual\nknowledge of such change 1 [ * * * ] the registered financing statement shall be ineffective against—\n(a)       a competing security interest that has been perfected after such change but\nbefore filing of the modification statement by the secured creditor; and\n(b)       a purchaser, lessee or licensee acquiring rights in the collateral after such\nchange but before filing of the modification statement by the secured creditor.\n(3) A registered modification statement shall be ineffective if it has been filed without\nthe authorization in writing by the entity where such authorization is required under sub-section (3)\nof section 24."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Rectification of register",
      "content": "(1) The entity or any person having rights in the collateral\ncovered in a registered financing statement may give a written demand to the secured creditor to\n(a)       file a modification statement, if —\n(i) description of the collateral is insufficient or refers to movable property\nthat is not collateral under 1[a] security agreement;\n(ii) the vehicle registration number is incorrect;\n(iii) the secured creditor has agreed to release part of the collateral and has\nfailed to file a modification statement in respect thereof as required under\nsub-section (1) of section 24; or\n(iv) there is any other omission or misstatement of any particular in 1[the]\nregistered financing statement that detrimentally affects rights of the\nentity:\n(b)            file a termination statement, if—\n(i) the obligation to which the registered financing statement relates has\nbeen paid or satisfied, in full, and the secured creditor has failed to file\n1\nOmitted and ins. by The Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), s. 21-22.\na termination statement within the prescribed period under sub-section\n(1) of section 26; or\n(ii) the entity has not entered into a security agreement with the secured\ncreditor. 1[* *        *        *         *      *        *]\n(2) A demand under sub-section (1) shall require the secured creditor to file, at its own expense,\na modification statement or termination statement, as applicable, within fifteen days from the date of\nreceiving such demand.\n(3) If the secured creditor fails to file a modification statement or termination statement, as\napplicable, within fifteen days of receiving the demand under sub-section (1), the entity or person\nmaking the demand may, by filing an application in writing, request the registrar to file such\nmodification statement or termination statement, as applicable, along with a copy of the written\ndemand and response, if any, from the secured creditor.\n(4) On receipt of an application under sub-section (3), the registrar shall cause a written\nnotice to be sent to the secured creditor calling upon him to show cause, within a time not exceeding\ntwenty days from the date of receiving such notice, as to why the modification statement or\ntermination statement, as applicable, should not be filed.\n(5) The registrar shall, if no cause is shown, file the modification statement or\ntermination statement, as applicable, in the register.\n(6) Where cause is shown, the registrar shall inform the entity or person making the\ndemand under sub-section (3) in writing that the modification statement or termination statement,\nas applicable, cannot be filed for reasons stated therein."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Removal of a registered financing statement",
      "content": "1[(1) A registered financing\nstatement and any modification statements in relation thereto shall be removed from the register, if,―\n(a)    the term of the registration has expired without being extended under sub-\nsection (2A) of section 24; or\n(b)    a termination statement has been filed in the register in respect of such\nregistered financing statement.]\n(2) Upon removal from the register, the registered financing statement and any modification\nstatements in relation thereto shall not be publicly searchable.\n(3) Notwithstanding removal from the register, the Registry shall retain records of a\nregistered financing statement and any modification statement and termination statement in respect\nthereof for a period of ten years from the date on which the termination statement was filed pursuant\nto section 26 or section 31."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Right to search the register",
      "content": "(1) Any person shall be entitled to search the\nregister and obtain reports therefrom on payment of a prescribed fee.\n(2) The register may be searched by reference to the following criteria, namely:—\n1\n(a)        [****]\n1\nSubs, Omitted and Ins. by the Act of The Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), s s. 23-24.\n(b)       where the entity is a natural person, the National Identity Card Number or\nNational Identity Card for Overseas Pakistanis number, or in case of a\nforeign national, the passport number;\n1\n[(ba) in case of any other entity, against the name of the entity, as may be\nprescribed;]\n(c)   unique registration number;\n(d)   the vehicle registration number; or\n(e)   any other criteria 1[specified] by regulations.\n(3) On a search of the register, a search report shall be issued in such form as may be\n1\n[specified] and shall set forth all registered financing statements and modification statements in\nrelation thereto in the register relating to the search criterion used:\nProvided that where the search does not produce any results, the search report shall state\nand confirm that there are no registered financing statements relating to the search criterion used.\n(4) A search report issued under sub-section (3) shall be conclusive evidence of the\nregistered financing statements and modification statements in relation thereto to which the search\nrelates including —\n(a)   unique registration number or registration number, as applicable, date and time\non which the financing statements and modification statements in relation\nthereto were registered; and\n(b)   order of the registered financing statements and modification statements\nin relation thereof set out in the search report."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Outsourcing",
      "content": "The 1 [Commission] may issue a licence to any local or foreign entity\nfor operating and maintaining the register or for performing any of the functions of the Registry\nin respect of the register.\n______________"
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Priority of security interests in the same collateral where there is no other way of",
      "content": "determining priority. Unless otherwise provided in this Part V, the following rules shall apply, to\ndetermine priority of security interests over the same collateral, namely: —\n(a)   between security interests that have not been perfected, the first in time to\ncreate the security interest shall prevail;\n(b)   a perfected security interest has priority over a security interest that has not\nbeen perfected; and\n1\nIns. and subs by The Act of Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), ss. 24-25.\n(c)     between perfected security interests, the first in time to perfect the security\ninterest in accordance with section 14 shall prevail.\nExplanation. —\n(i)     Between security interests that have been perfected by registration as\nprovided under this Act, priority will be determined by the order of registration.\n(ii) Between security interests that have been perfected by possession or control,\npriority will be determined by the order of possession or control.\n(iii) Between a security interest that has been perfected by registration as provided\nunder this Act and a security interest that is perfected otherwise than by\nregistration, priority will be determined by the order of registration or\nperfection otherwise than by registration, whichever occurs first."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Priority of security interest in proceeds. A security interest in proceeds shall have the",
      "content": "same priority as the security interest in the collateral."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Priority extending to future finance. Where a security interest extends to future",
      "content": "finance, the security interest shall have the same priority in respect of existing and future finance."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Priority of security interest in after",
      "content": "acquired 1[and future] property. The priority of\na security interest that is perfected by registration as provided under this Act shall extend to all the\ncollateral stated in the registered financing statement or Form 10, as applicable, regardless of whether\nit is present 1[property] or after-acquired 1[and future] property."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Extent of priority",
      "content": "1[(1) If a financing statement or Form 10 is required to state a\nmaximum amount secured, then the priority of a security interest that is perfected by that financing\nstatement or Form 10 is limited to the maximum amount as stated in the registered financing statement\nor Form 10, as applicable.]\n(2) Where the maximum amount secured by the security interest as stated in the registered\nfinancing statement or Form 10, as applicable, is increased by way of a registered modification\nstatement or Form 16, the priority of the security interest in respect of such increase shall be from the\ndate the modification statement or Form 16, as applicable, was registered.\n(3) Where a modification statement or Form 16, as applicable, has been registered in respect\nof an addition of collateral, other than by way of proceeds, the priority of the security interest in\nrespect of such additional collateral shall be from the date the modification statement or Form\n16, as applicable, was registered."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Subordination",
      "content": "An agreement may be entered into between secured creditors of\na customer or between a secured creditor and a customer pursuant to which one secured creditor\nsubordinates his security interest to the security interest of another secured creditor."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Right of secured creditor to follow the collateral",
      "content": "(1) Unless otherwise provided\nin Chapter III of this Part V of this Act, if a customer transfers, leases or licenses collateral that is, at\nthe time of transfer, lease or license, subject to a perfected security interest, the transferee, lessee or\nlicensee shall acquire the collateral subject to such perfected security interest.\n1\nIns. and subs by The Act of Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), ss. 2 6-27.\n(2) A secured creditor's right to follow the collateral under sub-section (1) shall be without\nprejudice and in addition to the secured creditor's right to the proceeds of the collateral, where\napplicable.\n______________"
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. 1 [Priority of acquisition security interest]",
      "content": "1[(1) An acquisition security interest in\ncollateral that is perfected by registration as provided under this Act within ten days of the date on\nwhich the customer takes possession of the collateral shall have priority over all other competing\nsecurity interests in the same collateral irrespective of the time of perfection of such competing\nsecurity interests.]\n1\n(2)               [*       *            *            *            *            *            *            *]\nIllustration\nSecured Creditor A has a 1[a security interest over all present and] after-acquired movable property\nof Customer B (an entity) that was perfected by registration in the register on 1st December.\nCustomer B leases a car from Secured Creditor C pursuant to a finance lease agreement on 1st\nFebruary. The ownership of the car is registered in the name of the Secured Creditor C.\nSecured Creditor C also perfects its security interest in the car by registration in the register on 4th\nFebruary.\nSecured Creditor C will have priority over Secured Creditor A."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Priority between secured creditor and bailee providing services in respect of the",
      "content": "collateral. — A secured creditor shall have priority over a bailee having a lien in respect of\ninterest was perfected before the bailment was created."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Priority between secured creditor and unpaid seller",
      "content": "An unpaid seller having a\nlien in respect of the collateral under the Sale of Goods Act, 1930 (III of 1930) shall have priority\nover a secured creditor."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Priority between secured creditor and a bank having a bankers' lien",
      "content": "A bank\nhaving a bankers 'lien under section 171 of the Contract Act, 1872 (IX of 1872) shall have priority\nover a secured creditor unless such bank has in writing waived of its bankers' lien."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Priority of security interest in a right to payment of funds credited in a deposit",
      "content": "account. —(1) A security interest in a right to payment of funds credited in a deposit account that is\nperfected by control has priority as against a security interest in a right to payment of funds credited\nin a deposit account that is perfected other than by control 1[******].\n1\nSubs. and omitted by the Act of The Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), ss. 28-29.\n(2) A depository bank's right of set-off against the customer's obligations shall have priority\nover a security interest in the right to payment of funds credited in a deposit account unless the\ndepository bank has, in terms of the control agreement, waived of its right of set-off.\n(3) Sub-section (2) shall not in any way affect the depository bank's right of set-off under the\ninsolvency laws.\nIllustrations\n(a)     Secured Creditor A has a security interest in a right to payment of funds credited in a\ndeposit account of Customer B (a company) that was perfected by control on the 25th\nDecember.\nSecured Creditor C has a 1 [security interest] on all the present and after-acquired\nmovable property (including funds credited in deposit accounts) of Customer B that\nwas perfected by registration on the 1st December.\nSecured Creditor A shall have priority over Secured Creditor C.\n(b)     Secured Creditor A has a security interest in a right to payment of funds credited in a\ndeposit account of Customer B (an entity) that was perfected by control on the 25th\nDecember.\nSecured Creditor C has a 1 [security interest] on Customer B's present and\nafter-acquired inventory that was perfected by registration on the 1st December.\nSecured Creditor C's 1 [security interest] shall extend to the proceeds, i.e. sale proceeds\nof inventory that are credited in a deposit account over which Secured Creditor C has\nno control.\nSecured Creditor A shall have priority over Secured Creditor C."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Priority of security interest in collateral covered by title document",
      "content": "A security\ninterest in collateral covered by title document that is perfected by possession has priority as\nagainst a security interest in collateral covered by title document that is perfected other than by\npossession pursuant to sub-section (3) of section 14.\nIllustration\nSecured Creditor A has a security interest in collateral covered by a title document of\nCustomer B (an entity) that was perfected by possession on the 25th December.\nSecured Creditor C has a 1 [security interest] on all the present and after-acquired movable property\n(including goods-in-transit covered by title documents) of Customer B that was perfected by\nregistration on the 1st December.\nSecured Creditor A shall have priority over Secured Creditor C.\n48. 1 [*           *            *           *          *            *            *]\n1\nSubs and omitted by The Act of Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), ss. 29-31."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Priority of security interest in a negotiable instrument",
      "content": "(1) A security interest\nin a negotiable instrument that is perfected by possession has priority as against a security interest\nin a negotiable instrument that is perfected other than by possession 1[******].\n(2) A security interest in a negotiable instrument is sub-ordinate to the rights of a holder in\ndue course as defined in section 9 of the Negotiable Instruments Act, 1881 (XXVI of 1881).\nIllustration\n(a) Secured Creditor A has a security interest in a negotiable instrument issued in favour\nof Customer B (an entity) that was perfected by possession on the 25th December.\nSecured Creditor C has a 1 [security interest] on all the present and after-acquired\nmovable property (including right to payment under negotiable instruments) of\nCustomer B that was perfected by registration on the 1st December.\nSecured Creditor A shall have priority over Secured Creditor C.\n(b) Secured Creditor A has a security interest in a negotiable instrument of Customer B\n(a company) that was perfected by possession on the 25th December.\nSecured Creditor C has a 1 [security interest] on Customer B's present and after-acquired\ninventory that was perfected by registration on the 1st December. Secured Creditor C's\n1\n[security interest] extends to proceeds, i.e. sale proceeds of inventory that may be\nin the form of a negotiable instrument of which the Secured Creditor C will have no\npossession.\nSecured Creditor A shall have priority over Secured Creditor C.\n__________________"
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Purchaser taking free of security interest",
      "content": "(1) A purchaser for value will\nacquire collateral (other than a negotiable instrument or collateral covered by title document) free of\nany security interest, where the customer—\n(a) sells the collateral in ordinary course of business, provided that the\ncustomer shall not conduct a bulk sale of collateral without the prior written\nconsent of the secured creditor.\nExplanation:— Unless otherwise provided in the security agreement, a bulk sale shall mean\nany transfer of all or major part of the collateral of a customer or of the collateral held at a particular\nplace of business of a customer; or\n(b) is authorized in writing by the secured creditor to sell the collateral free\nof the security interest.\n1\n[(1A) A purchaser for value of a motor vehicle shall acquire the motor vehicle free of a\nsecurity interest if the security interest is perfected by registration and the registration does not\ninclude the correct vehicle registration number.]\n1\nOmitted and subs. by The Act of Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), s. 32.\n(2) A purchaser for value shall not acquire collateral free of security interest under clause\n(a) of sub-section (1) 1[or under sub-section (1A)] if, at the time of the acquisition, the purchaser\nhas actual knowledge that the sale of the collateral is prohibited under the security agreement."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Rights of a lessee and licensee",
      "content": "(l) The rights of a lessee and licensee in the\ncollateral are not affected by a security interest where the customer—\n(a)     leases or licenses the collateral in ordinary course of its business; or\n(b)     is authorized in writing by the secured creditor to lease or license the\ncollateral.\n(2) Clause (a) of sub-section (1) shall not apply if, at the time of the conclusion of the lease\nor license agreement, the lessee or licensee has actual knowledge that the lease or licence of the\ncollateral is prohibited under the security agreement."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Transferee of funds held in a deposit account taking free of security interest",
      "content": "Where the customer has initiated a transfer of funds from a deposit account that is subject to a\nsecurity interest, the transferee of the funds takes the funds free of any security interest unless\n[52A Transferee of money. ― A person that obtains possession of money that is subject to\n1\na security interest acquires its rights in the money free of the security interest, unless the person had\nactual knowledge that its obtaining the money is prohibited under the security agreement.]\n_____________________"
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Assignment of receivables by way of security and absolute",
      "content": "1[(1) This Act shall\napply to an assignment of receivables as a security interest, whereby―\n(a) a customer may assign its rights, title, interests and benefits in receivables to\na secured creditor in accordance with Part II of this Act;\n(b) the secured creditor may perfect the security interest created by the\nassignment,―\n(i) if the customer is an entity, in accordance with Part III of this Act; or\n(ii) if the customer is a company, in accordance with the Companies Act,\n2017 (XIX of 2017);\n(c) the priority of the secured creditor’s interest in the receivables shall be\ndetermined in accordance with Part V of this Act; and\n(d) the secured creditor must enforce its security interest, unless it is an absolute\nassignment of a receivable, in accordance with Part VII of this Act.]\n1\nIns. by the Act of The Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), ss. 33-35.\n(2) 1[*         *          *           *            *           *           *]\n(3) 1[Subject to this Act, upon an assignment of receivables], —\n(a) the rights and remedies of the 1[customer], whether by damages or\notherwise, shall vest in the 1[secured creditor] ; and\n(b) the 1[secured creditor] may sue or institute proceedings in respect of the\nassignment of receivables in 1[its] own name without obtaining the\n1\n[customer’s] consent to such suit or proceedings and without making him a\nparty thereto.\n(4) 1[       *            *           *            *           *           *            *]\nExplanation.—Future receivables are receivables that are generated as a result of a contract\nthat is concluded after the conclusion of the agreement assigning the receivables.\n1\n[(5) If receivables subject to a security interest are secured by movable property, then, unless\notherwise agreed between the customer and the secured creditor, the secured creditor shall\nautomatically benefit from that security without the need for any new act of transfer.]\n1\n[(6) The rights of a secured creditor in respect of the receivables that are subject to a security\ninterest are subject to―\n(a) all defences and right to set-off arising from the original contract between the\naccount debtor and the customer that the account debtor could have asserted\nagainst the customer:\nProvided that the secured creditor shall, unless otherwise agreed with\nthe customer, be entitled to recover from the customer, any loss suffered by it\nas a result of the account debtor exercising any such defences and right to set-\noff; and\n(b) any rights to set-off that the account debtor could have asserted against the\ncustomer in respect of claims against the customer accruing before the account\ndebtor received notice in writing of the security interest.]\n(7) Sub-section (6) shall not apply if the account debtor has agreed in writing with the\n1\n[customer] that it shall not assert any defences or right to set-off.\n54. 1[       *            *           *            *           *           *            *]\n1\n[55. Protections for the account debtor.― (1) Subject to subsection (4), an account debtor\nshall be bound by a security interest over the receivables and have a duty to make payment to the\nsecured creditor where the account debtor receives notice of security interest in writing.\n(2) The notice to be given under sub-section (1) to the account debtor may be given by the\ncustomer or secured creditor and shall at the minimum―\n1\nOmitted, Subs. by the Act of The Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 202 1), ss. 35-37.\n(a) state name and address of the customer;\n(b) state name and address of the secured creditor;\n(c) identify the receivables; and\n(d) require the account debtor to pay to the secured creditor in accordance with\npayment instructions stated therein.\n(3) If notice has not been given to an account debtor under subsection (1), of a security interest\nin receivables, he shall be entitled to make payments to the customer in respect of the receivables in\naccordance with the original contract between the account debtor and the customer and such payment\nshall fully discharge the account debtor:\nProvided that payment made to the customer in respect of such receivables shall be held in\ntrust for the benefit of the secured creditor and the customer shall forthwith make payment of such\namount to the secured creditor or its agent duly authorised in this behalf, unless otherwise agreed\nbetween the customer and secured creditor.\n(4) If an account debtor receives notices under sub-section (1) in relation to more than one\nsecurity interest created by the same customer, it is discharged by paying in accordance with the first\nnotice received. If an account debtor receives more than one notice under sub-section (1) in relation to\nsecurity interests created in favour of a secured creditor by the initial or any other secured creditor, it\nis discharged by paying in accordance with the last notice.]\n[55A Contractual limitations on security interests in receivables. ― (1) A security\n1\ninterest in receivables shall be effective notwithstanding any agreement between the initial or any\nsubsequent assignor and the account debtor or any secured creditor limiting in any way the assignor’s\nright to create a security right.\n(2) Nothing in this section affects any obligation or liability of the customer for breach of the\nagreement referred to in sub-section (1), but the other party to the agreement may not avoid the contract\ngiving rise to the receivable or the security agreement on the sole ground of the breach of the\nagreement, or raise against the secured creditor any claim it may have as a result of such a breach\nagainst the customer. A person that is not a party to the agreement referred to in sub-section (1) is not\nliable for the customer’s breach of the agreement on the sole ground that it had knowledge of the\nagreement.\n(3) This section shall apply only to receivables―\n(a) arising from a contract that is a contract for the supply or lease of goods or\nservices other than financial services, a construction contract or a contract for\nthe sale or lease of immovable property;\n(b) arising from a contract for the sale, lease or license of industrial or other\nintellectual property or of proprietary information;\n(c) representing the payment obligation for a credit card transaction; or\n(d) arising upon net settlement of payments due pursuant to a netting agreement\ninvolving more than two parties.]"
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. Applicability of the Transfer of Property Act, 1882 (IV of 1882)",
      "content": "Sections 130,\n131, 132 and 134 of the Transfer of Property Act, 1882 ( IV of 1882) shall not apply to an assignment\nof receivables under this Act.\n1\nIns. by the Act of The Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), s.38.\n1\n[56A. Applicable law.― The law applicable to the creation, perfection and priority of a\nsecurity interest granted by a customer in a receivable and any other intangible property shall be the\nlaw of the jurisdiction in which the customer is located."
    },
    {
      "provision_ref": "sec56b",
      "section": "56B",
      "title": "Section 56B. Part does not apply to absolute assignments of receivables. ― This Part does not",
      "content": "apply to an absolute assignment of receivables and nothing in this Act shall prejudice a secured\ncreditor’s right to enforce an absolute assignment of receivables without the intervention of the courts.]\n________________________"
    },
    {
      "provision_ref": "sec57",
      "section": "57",
      "title": "Section 57. Modes of enforcement. A secured creditor may, after an occurrence of an event of",
      "content": "default, enforce a security interest in accordance with section 58 or 59."
    },
    {
      "provision_ref": "sec58",
      "section": "58",
      "title": "Section 58. Recovery suit",
      "content": "(1) A secured creditor may enforce a security interest by filing a\nrecovery suit against the customer in the Banking Court.\n(2) The provisions of the Recovery Ordinance shall apply mutatis mutandis for the\npurposes of filing a recovery suit against the customer.\nExplanation. —The provisions of the Recovery Ordinance relating to the enforcement\nof a mortgage over immovable property shall not be applicable."
    },
    {
      "provision_ref": "sec59",
      "section": "59",
      "title": "Section 59. Other enforcement modes",
      "content": "(1) A secured creditor may enforce the following security\ninterests without the intervention of the courts:\n1\n[(a)    a security interest that is perfected by possession] ;\n(b)    an assignment of receivables by way of security;\n(c)    a security interest in a negotiable instrument that is perfected by\npossession;\n(d)    a security interest in a right to payment of funds credited in a\ndeposit account that is perfected by control;\n(e)    a security interest in a motor vehicle based on retention of title\narrangement; and\n(f)    a security interest in a title document that is perfected by possession.\n(2) At any time after a secured creditor decides to enforce a 1[ security interest referred\nto in sub-section (1)] after an occurrence of an event of default, the secured creditor may give a\nwritten notice of demand to the customer in writing and require the customer to satisfy his obligation\nwithin fourteen days from the date of receipt of the notice. The notice shall give details of the amount\npayable by the customer and specify the collateral that may be enforced in the event of the customer\nfailing to satisfy his obligation:\nProvided that the secured creditor may dispense with such notice if —(a) in the\nreasonable opinion of the secured creditor, the collateral is in danger of being wasted,\nmisappropriated or is perishable; or (b) the amount of finance exceeds ten million rupees and the\nsecurity agreement provides for such dispensation.\n1\nIns. by The Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), s. 3 9-40.\n(3) The right to enforce an assignment of receivables by way of security and a security\ninterest in a negotiable instrument in terms of this section includes the right to enforce any\nsecurity over movable property or a mortgage of immovable property by deposit of title deeds as\nprovided in sub- section (1) of section 58 of the Transfer of Property Act. 1882 (IV of 1882) that\nsecures the payment of the receivables or the negotiable instrument.\n(4) In case of a security interest in a right to payment of funds credited in a deposit account,\nthe secured creditor shall —\n(a) where such secured creditor is the depository bank, be entitled to\nappropriate and set-off the funds credited in the deposit account against\nthe customer's obligation; or\n(b) where such secured creditor is not the depository bank, be entitled to\ninstruct the depository bank to pay the funds credited in the deposit\naccount to or for the benefit of the secured creditor in terms of the control\nagreement.\n(5) Nothing in this Act shall prejudice a secured creditor's right to enforce a security interest\nwithout the intervention of the courts under any other law for the time being in force."
    },
    {
      "provision_ref": "sec60",
      "section": "60",
      "title": "Section 60. Enforcement where collateral is in the nature of property attached to immovable",
      "content": "property.—(1) If the collateral is in the nature of property attached to immovable property, the\nsecured creditor may, upon enforcement of the security interest in accordance with the provisions of\nthis Part, remove such property and shall reimburse the mortgagee or owner of the immovable\nproperty to which such property is attached for the cost of repair of any damage to the immovable\nproperty resulting from the removal:\nProvided that the secured creditor shall not be required to reimburse the mortgagee or\nowner of the immovable property for any reduction in value of the immovable property resulting\nfrom the removal of the property attached to immovable property.\n(2) The secured creditor shall be entitled to recover from the customer any expenses\nincurred by him for the purposes of removing the property attached to immovable property."
    },
    {
      "provision_ref": "sec61",
      "section": "61",
      "title": "Section 61. Fresh election of directors on request of the secured creditor",
      "content": "Notwithstanding\nanything contained in the 1 [Companies Act, 2017 (XIX of 2017)], where a secured creditor acquires\ntwenty percent or more of the voting securities of a company in his own name upon enforcement of a\n1\n[security interest over] securities, he may require the company to hold a fresh election of directors\nin accordance with the procedure laid down in section 178 of the Companies Act, 2017 (XIX of 2017)\nwithin sixty days of the secured creditor requesting the same.\n_______________________\n1\nSubs. by The Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), s. 41."
    },
    {
      "provision_ref": "sec62",
      "section": "62",
      "title": "Section 62. Duties of customer in case of a non",
      "content": "possessory security interest.—(1) A customer shall\nexercise as much care in the custody, preservation, operation, maintenance, use or other enjoyment or\nexploitation of collateral in the customer's possession as a man of ordinary prudence would as if the\ncollateral had been free of any security interest and shall not take any action, directly or indirectly,\nthat may waste, misappropriate or otherwise prejudice the value of the collateral.\n(2) A customer shall be liable to the secured creditor for any loss or damage to the collateral\nas a result of a breach of the obligations under sub-section (1).\n(3) Subject to the terms of the security agreement, the secured creditor and its agents shall\nhave the right to inspect, value, insure, superintend, take samples and particulars of the collateral and\nto check any statements, accounts, reports and information pertaining to the collateral."
    },
    {
      "provision_ref": "sec63",
      "section": "63",
      "title": "Section 63. Duties of secured creditor in case of a 1[possessory security interest] and security",
      "content": "interest in collateral covered by a title document. —Sections 150, 151, 152, 153, 154, 155, 156, 157.\n173 and 175 of the Contract Act, 1872 (IX of 1872) shall apply mutatis mutandis to a secured creditor\nin the case of a 1 [security interest that is perfected by possession of the collateral or, in the case of\ncollateral covered by a title document, by possession of the title document.]"
    },
    {
      "provision_ref": "sec64",
      "section": "64",
      "title": "Section 64. Material information from secured creditor",
      "content": "(1) The customer may send a written\ndemand to the secured creditor to provide material information in respect of a security interest.\n(2) A secured creditor shall, upon receiving a written demand under sub-section (1), provide\nthe material information to the customer within fourteen days of receiving the demand.\n(3) A secured creditor may charge the customer a reasonable fee for responding to a\nwritten demand under sub-section (1) provided that such fee shall not exceed the cost of processing\nsuch demand.\n(4) For the purposes of this section, material information shall mean—\n(a) a copy of the security agreement and any amendments thereto;\n(b) a statement in writing of the amount of the aggregate outstanding\nobligation of the customer secured by the collateral as of the date\nspecified in the written demand under sub-section (1); and\n(c) a statement in writing that approves or corrects an itemized list of what\nthe customer believes to be the collateral securing an obligation as of the\ndate specified in the written demand under sub-section (1) and duly\nauthenticated by the customer.\n________________________\n1\nSubs. by the Act of The Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), s.42."
    },
    {
      "provision_ref": "sec65",
      "section": "65",
      "title": "Section 65. Notice",
      "content": "(1) A notice or demand required to be given pursuant to any provision in Part\nIV of this Act may be given to the secured creditor or entity, as applicable, through courier or\nregistered post with acknowledgement due at the address provided in the registered financing\nstatement.\n(2) A notice or demand given in accordance with sub-section (1) shall be deemed to have\nbeen given and received —\n(a) on the day of actual delivery, where the notice is sent by a courier; or\n(b) four days after the notice has been posted, where the notice is sent by\nregistered post with acknowledgement due.\n(3) The registrar may prescribe by regulations additional modes of providing a notice or\ndemand to the secured creditor or entity, as applicable, pursuant to any provision in Part IV of this\nAct and matters ancillary thereto.\n1\n[65A. Security interests take precedence. ― Subject to this Act and notwithstanding any\nother law for the time being in force, a perfected security interest takes absolute precedence over all\nother claims, including those of the Government.]\n[66. Provisions of insolvency laws. ― Subject to section 65A, if a customer becomes\n1\ninsolvent, the same rules shall prevail and be observed with regard to the priority of debts upon the\ndistribution of the insolvent customer’s estate, the respective rights of the secured and unsecured\ncreditors and to debts provable as are in force for the time being under the applicable insolvency laws.]"
    },
    {
      "provision_ref": "sec67",
      "section": "67",
      "title": "Section 67. Protection of action taken in good faith",
      "content": "No suit, claim or other legal proceedings\nshall lie against the Registry or the registrar, deputy registrar or officers, staff and other employees of\nor any rules and regulations made thereunder."
    },
    {
      "provision_ref": "sec68",
      "section": "68",
      "title": "Section 68. The provisions of this Act to override other laws",
      "content": "(1) The provisions of this Act shall\nbe in addition to, and not, save as expressly provided in this Act, in derogation of any other law for\nthe time being in force.\n(2) In the event of any inconsistency or conflict between the provisions of this Act and\nany other law for the time being in force including but not limited to the 1 [Companies Act, 2017 (XIX\nof 2017)], Recovery Ordinance, Contract Act 1872 (IX of 1872), Transfer of Property Act, 1882\n(IV of 1882), Specific Relief Act, 1877 (I of 1877), Sale of Goods Act, 1930(III of 1930), and\nGeneral Clauses Act, 1897 (X of 1897), the provisions of this Act shall prevail."
    },
    {
      "provision_ref": "sec69",
      "section": "69",
      "title": "Section 69. Power to remove difficulties",
      "content": "If any difficulty arises in giving effect to the\nprovisions of this Act, the Federal Government may, by order published in the official Gazette,\nmake such provisions, not inconsistent with the provisions of this Act, as may appear to be necessary\nfor removing such difficulty.\n1\nSubs. by the Act of The Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), ss. 43-45."
    },
    {
      "provision_ref": "sec70",
      "section": "70",
      "title": "Section 70. Power to make rules",
      "content": "(1) The Federal Government may, by notification in the\nofficial Gazette. make rules, not inconsistent with the provisions of this Act, for carrying out the\npurposes of this Act.\n1\n(2)        [*                   *            *           *           *            *           *]"
    },
    {
      "provision_ref": "sec71",
      "section": "71",
      "title": "Section 71. Public Servants",
      "content": "(1) The registrar, deputy registrars, officers, employees of the\nRegistry and other persons authorized to perform or exercise any function or power under this\nAct or rendering services to the Registry as consultant or adviser shall be deemed to be public\nservants within the meaning of section 21 of the Pakistan Penal Code, 1860 (Act XLV of 1860).\n(2) Save as otherwise provided by this Act and only for the purposes so provided, nothing\nherein contained shall be construed to mean that any person referred to in sub-section (1) is or shall\nbe deemed to be in the service of Pakistan or is to be regarded or treated as a civil servant.\n[72. Power to make regulations. ― The Commission may, by notification in the official\n1\nGazette, make regulations, not inconsistent with the provisions of this Act and the rules made\nthereunder for carrying out the purposes of this Act.]"
    },
    {
      "provision_ref": "sec73",
      "section": "73",
      "title": "Section 73. Transitional provisions",
      "content": "(1) For the purposes of this section,—\n(a) “prior security interest” means a security interest created or provided\nfor by a security agreement or other transaction entered into by an entity\nbefore the commencement of this Act;\n(b) “prior law” means any law, whether statutory, equitable or common law,\nthat was in force before the commencement of this Act;\n(c) “transitional period” means the period of six months after the\nnotification of 1[operationalization] of the Registry is published by the in\nterms of 1 [Commission in terms of sub-section (2)] of section 19.\n(2) Secured creditors may perfect prior security interests in accordance with this Act\nduring the transitional period.\n(3) Upon perfection under sub-section (2), a prior security interest shall retain priority\nfrom the date it was perfected under prior law and shall have priority over a security interest created\nand perfected after the commencement of this Act.\n(4) If a prior security interest is perfected after the transitional period, such prior security\ninterest shall be deemed to have priority from the date of actual perfection in the event of a conflict\nwith a security interest created and perfected after the commencement of this Act or a prior security\ninterest perfected during the transitional period.\n(5) Nothing in this Act shall prejudice a security interest created and perfected by a\ncompany before the commencement of this Act and such security interest shall continue to be\ngoverned by prior law.\n_______________________________\n1\nOmitted and Subs. by the Act of The Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), ss. 4 6-48."
    }
  ],
  "definitions": [
    {
      "term": "account debtor",
      "definition": "any person liable, whether under a contract or otherwise, to pay any receivables or discharge any obligation in respect of receivables; 1 [(ia) “acquisition security interest” means a security interest in tangible movable property which secures an obligation to pay any unpaid portion of the purchase price of that property, or other credit extended to enable the customer to acquire rights in the property to the extent that the credit is used for that Purpose;]",
      "source_provision": "sec2"
    },
    {
      "term": "after-acquired 1[and future] property",
      "definition": "movable property that is acquired by a customer after entering into a security agreement, and includes future receivables as specified in the explanation to sub-section (4) of section 53;",
      "source_provision": "sec2"
    },
    {
      "term": "agricultural produce",
      "definition": "— (a) any produce of agriculture or horticulture, including but not limited to crops (including growing crops), standing timber, poultry, fish and livestock (including unborn offspring); and 1 Subs. and ins. by the Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), ss. 2 -3 (b) products derived from any produce under clause (i), including but not limited to meat, eggs, hides, bones, skins, wool and hair;",
      "source_provision": "sec2"
    },
    {
      "term": "assignee",
      "definition": "a person in whose favour the receivables are assigned;",
      "source_provision": "sec2"
    },
    {
      "term": "assignment of receivables",
      "definition": "a transfer of rights, title, interests and benefits of the receivables by the assignor to the assignee;",
      "source_provision": "sec2"
    },
    {
      "term": "assignor",
      "definition": "a person who assigns the receivables;",
      "source_provision": "sec2"
    },
    {
      "term": "commingled goods 1[and products]",
      "definition": "a product or mass that is produced or manufactured by physically associating or uniting collateral with other movable property in such a manner that the identity of the collateral is lost in such product or mass;",
      "source_provision": "sec2"
    },
    {
      "term": "Companies Act",
      "definition": "the Companies Act, 2017 (XIX of 2017);",
      "source_provision": "sec2"
    },
    {
      "term": "control agreement",
      "definition": "an agreement in writing between the secured creditor, customer and the depository bank according to which the depository bank has agreed to follow instructions from the secured creditor with respect to the payment of funds credited in the deposit account without further consent from the customer; (xiii) “customer” shall have the same meaning as is assigned to it under clause (c) of section 2 of the Recovery Ordinance and shall be deemed to include an entity; 1 Ins. and Subs. by the Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), s. 3",
      "source_provision": "sec2"
    },
    {
      "term": "deposit account",
      "definition": "a current or a savings account maintained with a depository bank to which funds may be credited;",
      "source_provision": "sec2"
    },
    {
      "term": "depository bank",
      "definition": "the financial institution maintaining a deposit account;",
      "source_provision": "sec2"
    },
    {
      "term": "exempted property",
      "definition": "movable property as notified by the Federal Government for the purposes of sub-section (2) of section 4 notwithstanding anything inconsistent therewith contained in the proviso to sub-section (1) of section 60 of the Code of Civil Procedure, 1908 (Act V of 1908) or any other law for the time being in force, provided that until such notification has been issued the proviso to sub-section (1) of section 60 of the Code of CiviI Procedure, 1908 (Act V of 1908) shall continue to apply; 1 [(xx) “financing statement” means the prescribed form to be filed in the register for the purposes of perfecting one or more security interests;] 1 [(xxi) * * * * * * *] (xxii) “Form 10” means the prescribed form to be filed with the registrar of companies for the purposes of entering the particulars of a security interest created by a company in the register of mortgages and charges under the 1 [ Companies Act, 2017 (XIX of 2017)]; 1 Subs. and omitted by the Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), s. 3 (xxiii) “Form 16” means the prescribed form to be filed with the registrar of companies for the purposes of modifying the particulars of a security interest created by a company in the register of mortgages and charges under the 1[Companies Act, 2017 (XIX of 2017)]; 1 [(xxiv) * * * * * * *]",
      "source_provision": "sec2"
    },
    {
      "term": "Recovery Ordinance",
      "definition": "the Financial Institutions (Recovery of Finances) Ordinance, 2001 (XLVI of 2001);",
      "source_provision": "sec2"
    },
    {
      "term": "register",
      "definition": "the electronic register set up under section 21; (xlii) “registrar” means the person in-charge of the Registry appointed under sub-section (1) of section 20 and shall include, unless the context requires otherwise, a deputy registrar discharging the functions, duties and powers of the registrar pursuant to sub­section (2) of section 20; (xliii) “registration”— (a) in relation to a security interest created by an entity, means that a financing statement and modification statements in relation thereto, if any, have been registered in the register in respect of such security interest in accordance with the provisions of Part IV of this Act; or (b) in relation to a security interest created by a company, means that a Form 10 and Form 16, if any, have been registered in the register of mortgages and charges in respect of such security interest in accordance with the provisions of the 1 [Companies Act, 2017 (XIX of 2017)]; (xliv) “registration number” is the number assigned to a registered modification statement and termination statement by the register pursuant to clause (b) of sub-section (1) of section 22;",
      "source_provision": "sec2"
    },
    {
      "term": "Registry",
      "definition": "the Secured Transactions Registry established under section 19; 1 [(xlvi) “secured creditor” means a financial institution or a consortium of financial institutions in whose favour a security interest is created by the customer and in the case of a security interest that is an absolute assignment of receivables, the secured creditor is the assignee;] (xlvii) “security agreement” means an agreement, instrument or any other document in writing that creates or provides for a security interest in favour of a secured creditor; 1 Subs. by the Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), s. 3 1 [(xlviii) “security interest” means, — (a) a right, title, encumbrance or interest of any kind upon movable property created or provided for by a security agreement in relation to a transaction that in substance secures the payment or performance of a customer’s obligation without regard to the form of the transaction or the terminology used by the parties or the identity of the person who has title to the movable property, and includes any charge, mortgage, hypothecation, fixed charge, floating charge, assignment, lien, pledge, assignment of receivables by way of security and transactions under which a secured creditor retains title such as a finance lease, hire purchase agreement, sale and lease back arrangement, conditional sale agreement and retention of title arrangement, having similar effect; and (b) an absolute assignment of receivables;] 1 [(xlviiia) “specified” means specified through regulations made by the Commission;] (xlix) “statement” means the financing statement, modification statement and termination statement;",
      "source_provision": "sec2"
    },
    {
      "term": "termination statement",
      "definition": "the prescribed form to be filed in the register for the purposes of rendering a registered financing statement and modification statements in relation thereto, if any, ineffective; 1 [(li) “title document” means a document in writing evidencing title to goods which is, by law or custom, transferable by delivery (whether with or without endorsement) or control and includes a bill of lading, dock warrant, warehouse receipt, railway receipt, airway bill, truck receipts or similar record issued by a person in the business of transporting or storing goods;]",
      "source_provision": "sec2"
    },
    {
      "term": "vehicle registration number",
      "definition": "the number assigned to a motor vehicle by the relevant registering authority for the purposes of registration of such motor vehicle under the Motor Vehicles Ordinance, 1965 (XIX of 1965). 1 Subs. and ins. by the Financial Institutions (Secured Transactions) (Amendment) Act, 2021 (XXXIII of 2021), s. 3 (2) Words and expressions used but not defined herein shall, unless repugnant to the context, have the same meaning as is assigned to them under the Recovery Ordinance.",
      "source_provision": "sec2"
    }
  ]
}
