{
  "id": "pk-flying-clubs-appointment-of-administrators-ordinance-1978",
  "type": "statute",
  "title": "Flying Clubs (Appointment of Administrators) Ordinance, 1978",
  "title_en": "Flying Clubs (Appointment of Administrators) Ordinance, 1978",
  "short_name": "FCOAO",
  "status": "in_force",
  "issued_date": "1978-06-08",
  "in_force_date": "1978-06-08",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cZqZ-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Flying Clubs (Appointment of Administrators) Ordinance, 1978 (XXVII of 1978) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Power to make rules",
      "content": "THE FLYING CLUBS (APPOINTMENT OF ADMINISTRATORS)\nORDINANCE, 1978\n(ORDINANCE NO. XXVII OF 1978)\n[9th June, 1978]\nAn Ordinance to provide for the appointment of Administrators of Flying Clubs.\nWHEREAS it is expedient to provide for the appointment of Administrators for the\nmanagement of the affairs of Flying Clubs;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, read\nwith the laws (Continuance in Force) Order, 1977, (C.M.L.A. Order No. I of 1977), and in exercise\nof all powers enabling him in that behalf, the President is pleased lo make and promulgate the\nfollowing Ordinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Ordinance may be called the Flying\nClubs (Appointment of Administrators) Ordinance, 1978.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once.\n2.Definitions. In this Ordinance, unless there is anything repugnant in the subject or\ncontext,—\n(a)     “Administrator”, in. respect of a Club, means the Administrator of the Club\nappointed under section 4;\n(b)     “Committee”, in respect of a Club, means the Managing Committee of the\nClub; and\n(c)     “Club” means a Flying Club."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Ordinance to override other laws, etc. The provisions of this Ordinance shall have effect",
      "content": "notwithstanding anything contained in the Companies Act, 1913 (VII of 1913.), or any memorandum\nor articles of association or bye-laws."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Appointment of Administrator",
      "content": "(1) If at any time the Federal Government has reason\nto believe that the Committee is unable to function properly for any reason whatever or that for the\nproper management of the affairs and business of a Club it is necessary or proper so to do, the\nFederal Government may, after giving to the Committee an opportunity of showing cause against the\naction proposed to be taken, appoint an Administrator to manage the affairs and business of the Club.\n(2) The Administrator shall receive such remuneration as the Federal Government may direct\nand shall hold office during the pleasure of the Federal Government.\n(3) On the appointment of the Administrator, the management of the affairs and business of\nthe Club shall vest in the Administrator and the Committee shall be divested of that management and\nthe members thereof shall cease to hold Office.\n(4) The Administrator shall, subject to such directions as the Federal Government may issue\nfrom time to time, exercise and perform all the powers and functions of the Committee, including\npowers and functions connected with or incidental to the management of the affairs and business of\nthe Club, such as the powers to have the accounts of the Club audited, institute inquiries and initiate\nproceedings, both civil and criminal, against any person responsible for committing irregularities in\nfinancial, flying, administrative and other matters connected with the Club.\n(5) The Federal Government may, on the recommendation of the Administrator, make such\nmodifications in the articles of association of the Club as it may consider necessary for the efficient\nmanagement of the affairs of the Club; and such modifications shall form part of the articles of\nassociation."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Termination of appointment of Administrator",
      "content": "(1) If at any time it appears to the\nFederal Government that the purpose of the order appointing the Administrator has been fulfilled, the\nFederal Government may require the Administrator to have a Committee elected in accordance with\nthe articles of association of the Club within such time as the Federal Government may specify.\n(2) After the Committee has been elected in pursuance of sub-section (1), the Federal\nGovernment shall cancel the order appointing the Administrator and thereupon the Administrator\nshall be divested of the management of the affairs and business of the Club, which shall best in the\nCommittee."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Penalty for withholding property, etc. from Administrator. If any member of the",
      "content": "Committee or any other person fails to deliver to the Administrator any books of account, registers or\nany other documents in his custody relating to the affairs or business of the Club the management of\nwhich has vested in the Administrator, or retains any property of the Club, or obstructs or hinders the\nAdministrator in the exercise or performance of his powers or functions, he shall be punishable with\nimprisonment for a term which may extend to six months, or with fine which may extend to one\nthousand rupees, or with both."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Indemnity",
      "content": "(1) No suit, prosecution or other legal proceeding shall lie against the\nAdministrator or any other officer or authority in respect of any thing which is in good faith done or\nintended to be done under this Ordinance.\n(2) No suit or other legal proceeding shall lie against the Federal Government for any damage\ncaused or likely to be caused by anything which is in good faith done or intended to be done under\nthis Ordinance."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Bar of Jurisdiction. No court shall, grant an injunction, make any order or entertain any",
      "content": "proceedings in respect of anything done or action taken, or intended to be done or taken, under this\nOrdinance"
    }
  ],
  "definitions": []
}
