{
  "id": "pk-pta-1996",
  "type": "statute",
  "title": "Pakistan Telecommunication (Re-organization) Act 1996",
  "title_en": "Pakistan Telecommunication (Re-organization) Act 1996",
  "short_name": "PTA-Act",
  "status": "in_force",
  "issued_date": "1996-06-17",
  "in_force_date": "1996-06-17",
  "url": "https://www.pta.gov.pk/en/telecom-act",
  "description": "The Pakistan Telecommunication (Re-organization) Act 1996 established the regulatory framework for the telecommunications sector in Pakistan, creating the Pakistan Telecommunication Authority (PTA) as the independent regulatory body and Pakistan Telecommunication Company Limited (PTCL) as the incumbent operator. The Act governs licensing, spectrum management, interconnection, consumer protection, and the regulation of digital content and internet services.",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short Title, Extent and Commencement",
      "content": "This Act may be called the Pakistan Telecommunication (Re-organization) Act, 1996. It extends to the whole of Pakistan. It shall come into force at once. The Act applies to all telecommunications services and service providers operating in Pakistan, including those providing international telecommunications services, internet services, broadcasting transmission services, and value-added telecommunications services. The Act recognizes telecommunications as an essential public utility, the provision of which is subject to licensing and regulation by the Pakistan Telecommunication Authority. The Federal Government retains the right to issue policy directions to the Authority in the public interest."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Pakistan Telecommunication Authority",
      "content": "There shall be established an Authority to be known as the Pakistan Telecommunication Authority (PTA). The Authority shall be a body corporate having perpetual succession and a common seal, with power to acquire and hold property and enter into contracts, and shall sue and be sued in its own name. The Authority shall consist of a Chairman and not less than two and not more than five members. The Chairman and members shall be appointed by the Federal Government and shall be persons of integrity and ability, having knowledge and experience in telecommunications, law, finance, or public administration. The Authority shall be operationally independent of the Federal Government in the exercise of its functions, subject to policy directions issued by the Federal Government. The accounts of the Authority shall be audited by the Auditor-General of Pakistan."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Functions and Powers of the Authority",
      "content": "The Authority shall have the following functions and powers: (a) to regulate the establishment, operation and maintenance of telecommunications systems and the provision of telecommunications services; (b) to issue, modify, suspend or revoke licences for telecommunications services; (c) to allocate and administer the radio frequency spectrum; (d) to prescribe and enforce technical standards for telecommunications equipment and services; (e) to regulate tariffs for telecommunications services where competition is inadequate; (f) to resolve disputes between telecommunications service providers; (g) to promote fair competition in the telecommunications sector; (h) to protect the interests of users of telecommunications services; (i) to block, remove or filter content transmitted through telecommunications networks that is in violation of applicable laws; (j) to prevent cyber crimes as set forth in applicable legislation."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Licensing of Telecommunications Services",
      "content": "No person shall establish, operate or maintain a telecommunications system or provide a telecommunications service without a licence granted by the Authority. Licences may be granted in the following categories: (a) Local loop telecommunications; (b) Long distance and international telecommunications; (c) Cellular mobile telecommunications; (d) Internet services; (e) Value-added telecommunications services; (f) Satellite-based services; (g) Such other categories as the Authority may determine. Applications for licences shall be processed in accordance with procedures established by the Authority and shall be subject to competitive bidding where the Authority determines that the number of licences to be issued should be limited. Licences shall set out the terms and conditions for the provision of the licensed services, including coverage obligations, quality standards, and consumer protection requirements. Licence fees shall be prescribed by the Federal Government."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Radio Frequency Spectrum Management",
      "content": "The radio frequency spectrum is a national resource and the right to use any part of the spectrum shall only be acquired through a licence or authorization granted by the Authority. The Authority shall maintain a National Frequency Allocation Table prepared in accordance with the Radio Regulations of the International Telecommunication Union. The Authority shall manage the spectrum in a manner that promotes its efficient use, taking into account national security requirements, public interest, international coordination obligations, and the need to promote competition in the telecommunications sector. Spectrum licences may be granted through competitive bidding where demand for spectrum exceeds supply. The Authority may require spectrum licensees to share spectrum or infrastructure in the public interest. Unauthorized use of the radio frequency spectrum shall be subject to criminal prosecution and seizure of the equipment used."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Interconnection",
      "content": "Every licensee providing a public telecommunications network shall, within the limits of its technical capability, make available to other licensees the ability to interconnect with its network for the provision of telecommunications services. Interconnection shall be provided in accordance with interconnection agreements negotiated between the parties on the basis of transparency, non-discrimination, cost-orientation, and technical feasibility. The Authority shall publish reference interconnection offers for dominant operators setting out standard terms and conditions for interconnection. In cases where interconnection cannot be agreed by negotiation within a period not exceeding ninety days from initiation of negotiations, either party may request the Authority to determine the terms and conditions of interconnection. The Authority shall resolve interconnection disputes within sixty days of receiving a request. Charges for interconnection shall be determined by the Authority where parties cannot agree, taking into account the efficient costs of providing interconnection."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Consumer Protection",
      "content": "Telecommunications service providers shall maintain minimum quality of service standards as prescribed by the Authority. Service providers shall provide consumers with clear, complete, and accurate information about their tariffs, services, and contractual terms. The Authority shall maintain a consumer grievance resolution mechanism and shall require service providers to establish internal complaint handling mechanisms. Service providers shall not unreasonably terminate or degrade services without adequate notice to the consumer. Service providers shall implement number portability to enable consumers to switch service providers without losing their telephone numbers. Service providers shall make emergency services (rescue, police, fire, ambulance) accessible free of charge from any telephone. Consumer data shall be protected in accordance with applicable data protection legislation, and service providers shall not use consumer data for purposes beyond those necessary for the provision of the subscribed service without the consumer's informed consent."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Universal Service Obligation",
      "content": "The Federal Government may impose universal service obligations on telecommunications service providers requiring them to provide affordable access to telecommunications services to all persons in Pakistan, including in rural and under-served areas. The Universal Service Fund shall be administered by the Universal Service Fund Company to finance projects that extend telecommunications infrastructure and services to rural and under-served areas of Pakistan. Service providers shall contribute to the Universal Service Fund as prescribed by the Federal Government. The Universal Service Fund shall be used exclusively for projects that achieve the universal service objectives set by the Federal Government. The provision of broadband internet services is included within the scope of universal service. The Universal Service Fund may subsidize demand as well as supply, including providing vouchers to low-income households for the purchase of internet services and devices."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Offences and Penalties",
      "content": "Any person who: (a) establishes, operates or maintains a telecommunications system without a licence; (b) uses a telecommunications system for fraudulent or unlawful purposes; (c) intercepts or discloses the content of telecommunications without authorization; (d) uses telecommunications equipment not approved by the Authority; (e) fails to comply with an order of the Authority — shall be guilty of an offence and shall be liable on conviction to imprisonment for a term which may extend to three years or a fine which may extend to ten million rupees or both. Violations of technical regulations and standards by service providers shall attract administrative penalties imposed by the Authority of up to one million rupees per day for each day of violation. The Authority may suspend or revoke the licence of a service provider that repeatedly violates the provisions of this Act or the Authority's regulations. Appeals against decisions of the Authority lie to the High Court."
    }
  ],
  "definitions": [
    {
      "term": "telecommunications system",
      "definition": "Any transmission, emission or reception of signs, signals, written images, sounds or intelligence by wire, optical, radio, electromagnetic or other means, including related equipment or services.",
      "source_provision": "sec1"
    },
    {
      "term": "PTA",
      "definition": "Pakistan Telecommunication Authority, the independent regulatory body established under the Pakistan Telecommunication (Re-organization) Act 1996, responsible for regulating the telecommunications sector in Pakistan.",
      "source_provision": "sec3"
    },
    {
      "term": "interconnection",
      "definition": "The linking of two or more telecommunications networks so that users of one network can communicate with users of another network or access services provided on another network.",
      "source_provision": "sec14"
    },
    {
      "term": "radio frequency spectrum",
      "definition": "A national resource consisting of all electromagnetic frequencies assigned in accordance with the Radio Regulations of the International Telecommunication Union, the right to use which can only be acquired through a licence or authorization granted by PTA.",
      "source_provision": "sec10"
    }
  ]
}
