{
  "id": "pk-foreign-assets-declaration-and-repatriation-act-2018",
  "type": "statute",
  "title": "Foreign Assets (Declaration and Repatriation) Act, 2018",
  "title_en": "Foreign Assets (Declaration and Repatriation) Act, 2018",
  "short_name": "FAARA",
  "status": "in_force",
  "issued_date": "2018-05-21",
  "in_force_date": "2018-05-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pjbw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Foreign Assets (Declaration and Repatriation) Act, 2018 (XXX of 2018) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Act may be called the Foreign Assets\n(Declaration and Repatriation) Act, 2018.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the subject or context,—\n(a)     “cost of acquisition of the mortgaged asset” means the sum of mortgaged\npayments and other mortgaged cost of acquisition;\n(b)     “court of law” means an Appellate Tribunal, a High Court or Supreme\nCourt of Pakistan;\n(c)     “declarant” means a person making a declaration under section 5;\n(d)     “fair market value” means price of foreign asset determined and declared by\na declarant himself, but in no case is less than the cost of acquisition of the\nforeign assets;\n(e)     “foreign assets” means any movable or immovable assets held outside Pakistan\nand includes real estate, mortgaged assets, stock and shares, bank accounts,\nbullion, cash, jewels, paintings, accounts and loan receivables, beneficial\nownership or beneficial interests or contribution in offshore entities and trusts;\n(f)     “government security” means a bond, note or other debt instrument issued by the\nFederal Government with a promise of repayment upon maturity;\n(g)     “liquid assets” means cash or an asset that can be readily converted into\ncash with a minimal impact on the assets’ value and\nincludes bank notes, marketable securities, stocks, promissory\nnotes, government       bonds,       deposit   certificates   and   other   similar\ninstruments; and\n(h)   “holder of public office” means a person who is or has been, during the\npreceding ten years,—\n(i)     the President of the Islamic Republic of Pakistan or the Governor of\na Province;\n(ii)    the Prime Minister, Chairman Senate, Speaker of the National\nAssembly, Deputy Chairman Senate, Deputy Speaker National\nAssembly, Federal Minister, Minister of State, Attorney-General for\nPakistan and other Law Officers appointed under the Central Law\nOfficers Ordinance, 1970 (VII of 1970), Adviser or Consultant or\nSpecial Assistant to the Prime Minister and holds or has held a post or\noffice with the rank or status of a Federal Minister or Minister of\nState, Federal Parliamentary Secretary, Member of Parliament,\nAuditor-General of Pakistan, Political Secretary;\n(iii)   the Chief Minister, Speaker Provincial Assembly, Deputy Speaker\nProvincial     Assembly,      Provincial Minister,  Adviser     or\nConsultant or Special Assistant to the Chief Minister and\nwho holds or has held a post or office with the rank or status\nof a Provincial Minister, Provincial Parliamentary Secretary,\nMember of the Provincial Assembly, Advocate-General for a Province\nincluding Additional Advocate-General and Assistant Advocate-\nGeneral, Political Secretary;\n(iv)    the Chief Justice or, as the case may be, a Judge of the Supreme\nCourt, Federal Shariat Court, a High Court or a Judicial Officer\nwhether exercising judicial or other functions or Chairman or member\nof a Law Commission, Chairman or Member of the Council of Islamic\nIdeology;\n(v)     holding an office or post in the service of Pakistan or any service in\nconnection with the affairs of the Federation or of\na Province or of a local council constituted under any Federal or\nProvincial law relating to the constitution of local councils, co-\noperative societies or in the management of corporations, banks,\nfinancial institutions, firms, concerns, undertakings or any other\ninstitution or organization established, controlled or administered\nby or under the Federal Government or a Provincial Government or a\ncivilian employee of the Armed Forces of Pakistan:\nProvided that a member of the Board, not actively engaged\nin the business and day-today affairs of the said corporations,\nbanks, financial institutions, firms, concerns, undertakings or any other\ninstitution or organization shall not be treated as holder of public\noffice under this sub-clause;\n(vi)    the Chairman or Mayor or Vice Chairman or Deputy Mayor of a zila\ncouncil, a municipal committee, a municipal corporation or a\nmetropolitan corporation constituted under any Federal or Provincial\nlaw relating to local councils;\nExplanation.—For the purpose of this sub-clause the\nexpressions “Chairman” and “Vice Chairman” shall include “Mayor”\nand “Deputy Mayor” as the case may be, and the respective councilors\ntherein; and\n(vii)   a District Nazim or District NaibNazim, Tehsil Nazim or Tehsil\nNaibNazim or UnionNazim or Union NaibNazim;\n(2) All other words and expressions used but not defined in this Act shall have the same\nmeaning assigned to them under the Income Tax Ordinance, 2001 (XLIX of 2001) and the rules\nmade thereunder."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Act to override other laws",
      "content": "The provisions of this Act shall have effect notwithstanding\nanything to the contrary contained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Application",
      "content": "(1) The provisions of this Act shall apply to—\n(a)     all citizens of Pakistan wherever they may be, except holders of public office,\ntheir spouses and dependent children; and\n(b)     all foreign assets held by the persons mentioned in clause (a) and tax paid on\nthe value of such assets under section 8, except where proceedings are pending\nin any court of law in respect of the foreign assets.\n(2) The provisions of this Act shall not apply to any proceeds or assets that are involved in or\nderived from the commission of a criminal offence."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Declaration and repatriation of assets held outside Pakistan",
      "content": "(1) Subject to\nspecified in section 6, a declaration in respect of foreign assets acquired before the tenth day of April,"
    },
    {
      "provision_ref": "sec5a",
      "section": "5A",
      "title": "Section 5A. (2) The value of a foreign asset shall be fair market value as defined in section 2",
      "content": "(3) The declaration of value and tax paid in respect of the foreign assets shall be in the\nmanner as set out in Form A of the Schedule to this Act.\n(4) The description of the foreign assets declared under sub-section (1) and (3) shall be in the\nmanner as set out in Form B of the Schedule to this Act.\n(5) A person declaring foreign assets under sub-section (1), may by the due date as\nspecified in section 6 also repatriate the said foreign assets in Pakistan.\n(6) The declaration of foreign assets shall be made in the manner as set out in Form A of the\nSchedule to this Act, electronically on Federal Board of Revenue’s web portal and shall be valid\nonly if it is accompanied by the evidence of payment of tax. The declarant may be required to\nprovide additional item-wise details of such assets while filing declaration on Federal Board of\nRevenue’s web portal."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Period of applicability",
      "content": "The declaration and repatriation under section 5 shall be made\non or after the tenth day of April, 2018 but on or before the thirtieth day of June, 2018."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Charge of tax",
      "content": "The foreign assets declared and repatriated into Pakistan within the due\ndate shall be chargeable to tax at the rates specified in the Table below, namely:—\nS.No.                        Foreign assets                           Rate (as a\npercentage of the\nvalue of foreign\nassets)\n.\n(1)                                (2)                                    (3)"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Payment of tax",
      "content": "(1) The due date for the payment of tax chargeable under section\n7 shall be the date on which declaration is made under section 6.\n(2) No tax shall be payable by the declarant under any law for the time being 2%\nin force including\nrespect of the foreign assets declared under section 5."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Currency and rate of conversion",
      "content": "(1) The value of a foreign asset under sub-section\n(2) of section 5 shall be in Rupees.\n(2) The tax payable under section 8 shall be paid in United States dollars as specified in\nForm A of the Schedule to this Act.\n(3) The value in Rupees under sub-section (1) shall be converted into United States dollars\nat the State Bank of Pakistan’s rate applying between the United States dollar and the Rupee\non the date the declaration is made under section 6 and tax is paid under section 8."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Mode and manner",
      "content": "The State Bank of Pakistan (SBP) shall notify the mode and\nmanner of—\n(a)     repatriation of liquid assets in Pakistan;\n(b)     deposit of tax in US dollars in SBP; and\n(c)     deposit of tax in Rupees in the income tax account of the Federal\nConsolidated Fund."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Incorporation in books of account",
      "content": "(1) Where a declarant has paid tax under section\n8 in respect of foreign assets declared under section 5, the declarant shall be entitled to incorporate in\nhis books of account such foreign assets.\n(2) For the purpose of the Income Tax Ordinance, 2001 (XLIX of 2001), the cost of\nacquisition of foreign assets and date of acquisition shall be deemed to be the value declared by the\ndeclarant and the date on which declaration has been made by the declarant, respectively."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Investment in Government securities",
      "content": "Investment in Government securities\nunder S. No. 3 of the Table in section 7 shall be made in accordance with a scheme to be introduced\nby the Government of Pakistan through the State Bank of Pakistan, by notification in the official\nGazette, specifying periodic rate of return, the period for the rate of return and period of\nmaturity."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Confidentiality",
      "content": "(1) Notwithstanding the provisions of sub-section (3) of section\n216 of the Income Tax Ordinance, 2001 (XLIX of 2001), the Right of Access to Information Act,\n2017 (XXXIV of 2017) and any other law for the time being in force, particulars of any person making\na declaration under this Act or any information received in any declaration made under this Act shall\nbe confidential.\n(2) A person who discloses any particulars in contravention of sub-section (1) shall commit\nan offence punishable on conviction with a fine of not less than five hundred thousand Rupees but\nnot exceeding one million Rupees or imprisonment for a term not exceeding one year or with both."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Declaration not admissible in evidence",
      "content": "Notwithstanding anything contained in\nany other law for the time being in force, nothing contained in any declaration made under section 5\nshall be admissible in evidence against the declarant for the purpose of any proceedings relating to\nimposition of penalty or for the purposes of prosecution under any law including Income Tax\nOrdinance, 2001 (XLIX of 2001)."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Removal of difficulty",
      "content": "If any difficulty arises in giving effect to the provisions of this\nAct, the Federal Government may make such order in writing, as is not inconsistent with the\nprovisions of this Act, for removal of such difficulty."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Misrepresentation",
      "content": "Notwithstanding anything contained in this Act, where a\ndeclaration has been made by misrepresentation or suppression of facts, such declaration shall be\nvoid and shall be deemed never to have been made under this Act.\nSchedule\nForm A\nDECLARATION UNDER SECTION 5\nCNIC*                                   -                                         -\nNTN (if available)\nTELEPHONE NUMBER:\nEmail:\nS.No.              Nature of assets       Amount          in Tax Rate   Tax in Pak Rupees\nRupees"
    }
  ],
  "definitions": [
    {
      "term": "cost of acquisition of the mortgaged asset",
      "definition": "the sum of mortgaged payments and other mortgaged cost of acquisition;",
      "source_provision": "sec2"
    },
    {
      "term": "court of law",
      "definition": "an Appellate Tribunal, a High Court or Supreme Court of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "declarant",
      "definition": "a person making a declaration under section 5;",
      "source_provision": "sec2"
    },
    {
      "term": "fair market value",
      "definition": "price of foreign asset determined and declared by a declarant himself, but in no case is less than the cost of acquisition of the foreign assets;",
      "source_provision": "sec2"
    },
    {
      "term": "foreign assets",
      "definition": "any movable or immovable assets held outside Pakistan and includes real estate, mortgaged assets, stock and shares, bank accounts, bullion, cash, jewels, paintings, accounts and loan receivables, beneficial ownership or beneficial interests or contribution in offshore entities and trusts;",
      "source_provision": "sec2"
    },
    {
      "term": "government security",
      "definition": "a bond, note or other debt instrument issued by the Federal Government with a promise of repayment upon maturity;",
      "source_provision": "sec2"
    },
    {
      "term": "liquid assets",
      "definition": "cash or an asset that can be readily converted into cash with a minimal impact on the assets’ value and includes bank notes, marketable securities, stocks, promissory notes, government bonds, deposit certificates and other similar instruments; and",
      "source_provision": "sec2"
    },
    {
      "term": "holder of public office",
      "definition": "a person who is or has been, during the preceding ten years,— (i) the President of the Islamic Republic of Pakistan or the Governor of a Province; (ii) the Prime Minister, Chairman Senate, Speaker of the National Assembly, Deputy Chairman Senate, Deputy Speaker National Assembly, Federal Minister, Minister of State, Attorney-General for Pakistan and other Law Officers appointed under the Central Law Officers Ordinance, 1970 (VII of 1970), Adviser or Consultant or Special Assistant to the Prime Minister and holds or has held a post or office with the rank or status of a Federal Minister or Minister of State, Federal Parliamentary Secretary, Member of Parliament, Auditor-General of Pakistan, Political Secretary; (iii) the Chief Minister, Speaker Provincial Assembly, Deputy Speaker Provincial Assembly, Provincial Minister, Adviser or Consultant or Special Assistant to the Chief Minister and who holds or has held a post or office with the rank or status of a Provincial Minister, Provincial Parliamentary Secretary, Member of the Provincial Assembly, Advocate-General for a Province including Additional Advocate-General and Assistant Advocate- General, Political Secretary; (iv) the Chief Justice or, as the case may be, a Judge of the Supreme Court, Federal Shariat Court, a High Court or a Judicial Officer whether exercising judicial or other functions or Chairman or member of a Law Commission, Chairman or Member of the Council of Islamic Ideology; (v) holding an office or post in the service of Pakistan or any service in connection with the affairs of the Federation or of a Province or of a local council constituted under any Federal or Provincial law relating to the constitution of local councils, co- operative societies or in the management of corporations, banks, financial institutions, firms, concerns, undertakings or any other institution or organization established, controlled or administered by or under the Federal Government or a Provincial Government or a civilian employee of the Armed Forces of Pakistan: Provided that a member of the Board, not actively engaged in the business and day-today affairs of the said corporations, banks, financial institutions, firms, concerns, undertakings or any other institution or organization shall not be treated as holder of public office under this sub-clause; (vi) the Chairman or Mayor or Vice Chairman or Deputy Mayor of a zila council, a municipal committee, a municipal corporation or a metropolitan corporation constituted under any Federal or Provincial law relating to local councils; Explanation.—For the purpose of this sub-clause the expressions “Chairman” and “Vice Chairman” shall include “Mayor” and “Deputy Mayor” as the case may be, and the respective councilors therein; and (vii) a District Nazim or District NaibNazim, Tehsil Nazim or Tehsil NaibNazim or UnionNazim or Union NaibNazim; (2) All other words and expressions used but not defined in this Act shall have the same meaning assigned to them under the Income Tax Ordinance, 2001 (XLIX of 2001) and the rules made thereunder.",
      "source_provision": "sec2"
    }
  ]
}
