{
  "id": "pk-foreign-exchange-prevention-of-payments-act-1972",
  "type": "statute",
  "title": "Foreign Exchange (Prevention of Payments) Act, 1972",
  "title_en": "Foreign Exchange (Prevention of Payments) Act, 1972",
  "short_name": "FEOPA",
  "status": "in_force",
  "issued_date": "1972-09-23",
  "in_force_date": "1972-09-23",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUZWFs-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Foreign Exchange (Prevention of Payments) Act, 1972 (XXII of 1972) published by The Pakistan Code (Banking/Financial Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Foreign\nExchange (Prevention of Payments) Act, 1972.\n(2)        It extends to the whole of Pakistan.\n2\n[(3) It shall come into force at once and shall be deemed to have taken effect on the 10th\nday of March, 1972.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Power to direct State Bank to stop payment",
      "content": "(1) Notwithstanding anything\ncontained in the Foreign Exchange Repatriation Regulation, 1972,3* * * the State Bank of Pakistan\nmay, and if so required by the Federal Government by order in writing shall, direct—\n(a)        an authorised dealer in foreign exchange through whom any person has\nrepatriated any amount of foreign exchange to Pakistan in pursuance of the said\nRegulation; or\n(b)        any other person with whom the whole or part of the rupee equivalent of the\namount so repatriated and other amount payable in respect of such repatriation\nis or has been deposited,\nto deposit with the State Bank, within the time specified by it, the amount representing the aggregate\nof the rupee equivalent of the amount so repatriated and any other amount payable in respect of such\nrepatriation or, as the case may be, the part thereof so deposited.\n(2)     Any person or authority to whom any amount of money is payable by the person\nrepatriating the amount of foreign exchange or who has against such person any claim the value of\nwhich can be expressed in terms of money, may, within such time and in such manner as the Federal\nGovernment may, by notification in the official Gazette specify, apply to the Federal Government for\npayment of the amount so payable or, as the case may be, of the amount representing the value of such\nclaim.\n(3)   Upon the receipt of an application under sub-section (2), an officer authorised by the\nFederal Government in this behalf may, after making such inquiries as he may consider necessary,\nmake such order as he may deem fit:\n1\nFor Statement of Objects and Reasons, see Gaz., of P., 1972, Ext., Pt-III, p. 415\n2\nSubs, by the Foreign Exchange (Prevention of Payments) (Amdt) Act, 1974 (6 of 1974), s. 2, for the original sub-section (3).\n3\nThe words \"(M.L.R. 104), as continued in force by Article 280 of the Interim Constitution of the Islamic Republic of Pakistan\" omitted by the Federal\nAdaptation of Laws Order, 1975 (P.O. 4 of 1975), Art. 2 and Sch.\n1\n*      *          *          *          *          *          *\nProvided 2* that no order for the payment of money to any person or authority shall be so made\nunless the person repatriating the amount of foreign exchange has had an opportunity of showing cause\nagainst it.\n(4)      The officer making an order under sub-section (3) shall forward a copy thereof to the\nState Bank who shall make to the person or authority specified in the order the payment required by\nthe order, if any.\n(5)     The deposit by an authorised dealer of foreign exchange or any other person referred to\nin sub-section (1) of any amount of money he is required to deposit with the State Bank under sub-\nsection (1), and the payment by the State Bank of any amount of money in pursuance of an order under\nsub-section (3), shall be a full discharge of the authorised dealer or that other person or, as the case\nmay be, of the State Bank from all liabilities in respect of the amount so deposited or paid."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Indemnity",
      "content": "(1) No suit, prosecution or other legal proceeding shall be against the\nFederal Government, the State Bank of Pakistan or an authorised dealer in foreign exchange or any\nother person for anything in good faith done or intended or purporting to be done under this Act.\n(2) If any such suit, prosecution or other legal proceeding as is referred to in sub-section (1) is\npending immediately before the commencement of this Act or if any judgement, decree or order has\nbeen passed in any such or similar suit, prosecution or other legal proceeding, the same shall abate\nforthwith or, as the case may be, be of no effect as if it had never been passed."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power to make rules. The Federal Government may, by notification in the official",
      "content": "Gazette, make rules for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Penalty. Any person who contravenes or attempts to contravene or abets the",
      "content": "contravention of any provision of this Act or of the rules made thereunder or disobeys any direction or\norder made under this Act or any rule thereunder shall be punishable with imprisonment for a term\nwhich may extend to three years and shall also be liable to fine.\n3[6A. Validation. All directions or instructions issued by the State Bank of Pakistan from the\ndate of the commencement of this Act till the 25th day of September, 1972, to any person or authorised\ndealer in foreign exchange as specified in clauses (a) and (b) of sub-section (1) of section 2 of the said\nAct to withhold payment to any person of any amount repatriated under the Foreign Exchange\n(Repatriation) Regulation, 1972, and of any amount payable in respect of such repatriation, shall be\ndeemed to have been validly issued under this Act."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. [Repeal.] Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981",
      "content": "(XXVII of 1981), s. 3 and Sch. II.\n1\nProviso omitted by the Foreign Exchange (Prevention of Payments) (Amdt.) Act 1996,(14 of 1996) s. 2.\n2\nThe word \"further\" omitted ibid.,\n3\nNew section 6A ins. by the Foreign Exchange (Prevention of Payments) (Amdt.) Act, 1974 (6 of 1974), s. 3 (w.e.f. 10-3-72)"
    }
  ],
  "definitions": []
}
