{
  "id": "pk-foreign-exchange-temporary-restrictions-act-1998",
  "type": "statute",
  "title": "Foreign Exchange (Temporary Restrictions) Act, 1998",
  "title_en": "Foreign Exchange (Temporary Restrictions) Act, 1998",
  "short_name": "FERA",
  "status": "in_force",
  "issued_date": "1998-11-30",
  "in_force_date": "1998-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apqbaA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Foreign Exchange (Temporary Restrictions) Act, 1998 (IV of 1998) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Foreign\nExchange (Temporary Restrictions) Act, 1998.\n(2) It extends to the whole of Pakistan.\n(3) It shall be deemed to have come into force on the twenty-eighth day of May, 1998."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Restriction on withdrawal of foreign exchange etc",
      "content": "Notwithstanding anything\ncontained in the Protection of Economic Reforms Act, 1992 (XII of 1992), or in any other law for the time\nbeing in force, or in any agreement or contract, it is hereby provided that the right to hold, sell, withdraw,\ntransfer, pay or take out foreign exchange held by any person in Pakistan as on the twenty-eighth day of May,\n1998, (the “specified date”) without the prior permission of the State Bank of Pakistan shall remain\nsuspended:\nProvided that there shall be no legal restriction on any person converting his foreign exchange\nheld as above into rupees at the officially notified rate of exchange.\nExplanation.—For the purpose of this section “foreign exchange” means foreign exchange\nheld in a foreign currency account or in such other form as the Federal Government may specify."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Certain protection to remain unaffected",
      "content": "(1) Subject to the provisions of this Act all\n(XII of 1992), shall remain unaffected.\n(2) The Federal Government may—\n(a)     make provision for the grant of further concessions for, or in relation to,\namounts converted from the foreign exchange referred to in section 2 held as\non the specified date into rupees, or assets acquired therefrom; and\n(b)     issue financial instruments including bonds of varying maturities against the\naforesaid foreign exchange which shall carry with them not less than the same\nentitlements, protections and immunities, as the foreign exchange held on the\naforesaid date save and except for the right to immediate repayment in foreign\nexchange."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to make rules",
      "content": "(1) The Federal Government by rules empower theState Bank of\nPakistan to—\n(a)     pass general orders suspending the right of persons to repayment except in\nrupees in relation to the foreign exchange referred to in section 2 as on the\nspecified date;\n(b)    make provision for the payment of profit to persons holding foreign exchange\nreferred to in section 2 as on the specified date in foreign exchange or in\nrupees; and\n(c)    classify citizen of Pakistan on the basis of their status being resident or non-\nresident of Pakistan or other persons on the basis of residence or nationality\nor otherwise for the purpose aforesaid.\n(2) Pending the framing of rules under subsection (1) withdrawals, remittances or payments\nin foreign exchange shall be made with the prior permission of the State Bank of Pakistan."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Repeal and saving",
      "content": "(1) The Foreign Exchange (Temporary Restrictions) Ordinance,\n1998 (VII of 1998), is hereby repealed.\n(2) Any rules, orders or instructions regarding foreign exchange made or issued by the\nFederal Government or the State Bank of Pakistan and in force before the commencement of this Act\nshall, in so far as such rules, orders or instructions are not inconsistent with the provisions of this\nAct, be deemed to have been made or issued under this Act.\n_______________"
    }
  ],
  "definitions": []
}
