{
  "id": "pk-foreign-private-investment-promotion-and-protection-act-1976",
  "type": "statute",
  "title": "Foreign Private Investment (Promotion and Protection) Act, 1976",
  "title_en": "Foreign Private Investment (Promotion and Protection) Act, 1976",
  "short_name": "FPIAP",
  "status": "in_force",
  "issued_date": "1996-06-03",
  "in_force_date": "1996-06-03",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUZWRv-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Foreign Private Investment (Promotion and Protection) Act, 1976 (XLII of 1976) published by The Pakistan Code (Banking/Financial Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, commencement and application",
      "content": "(1) This Act may be called the Foreign\nPrivate Investment (Promotion and Protection) Act, 1976.\n(2) It shall come into force at once.\n(3) It shall apply to all industrial undertakings in Pakistan having foreign private investment\nestablished with the approval of the Federal Government after the first day of September, 1954:\nProvided that nothing in this Act shall be in derogation of any facilities or protection\nspecifically sanctioned by the Federal Government to foreign private investment in the case of a\nparticular industrial undertaking or a class of industrial undertakings or such facilities or protection as\nmay be available to foreign private investment under a bilateral investment treaty."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the subject or context,—\n(a)        “foreign capital” means investment made by a foreigner 2[or by a person who,\nbeing a citizen of Pakistan, is also the citizen of any other country] in an\nindustrial undertaking in Pakistan—\n(i)        in the form of foreign exchange, imported machinery and equipment, or\n(ii)       in any other form which the Federal Government may approve for the\npurpose;\n(b)        “foreign private investment” means investment in foreign capital by a person\nwho is not a citizen of Pakistan 1[or who, being a citizen of Pakistan, is also the\ncitizen of any other country] or by a company incorporated outside Pakistan,\nbut does not include investment by a foreign Government or agency of foreign\nGovernment;\n(c)        “industrial undertaking” means an industry, undertaking or establishment\nengaged in the production, distribution or processing of any goods, the\nproviding of services specified in this behalf by the Federal Government or the\ndevelopment and extraction of such mineral resources and products as may be\nspecified in this behalf by the Federal Government 2[but, for the purpose of\ninvestment by a person who, being a citizen of Pakistan, is also the citizen of\nany other country, does not include an undertaking or establishment engaged in\nproviding banking or insurance services].\n1\nFor Statement of Objects and Reasons, see Gaz., of P., 1976, Ext., Pt. Ill, p. 392.\n2\nIns. by the Foreign Private Investment (Promotion and Protection) (Amdt.) Act. 1993 (4 of 1993), s. 2.\n(2) Words and expressions used but not defined in this Act shall have the same meanings as in"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Field for foreign private investment",
      "content": "The Federal Government may consistent with the\nnational interest, for the promotion of foreign private investment, authorise such investment in any\nindustrial undertaking—\n(a)        which does not exist in Pakistan and the establishment whereof in the opinion\nof the Federal Government, is desirable; or\n(b)        which is not being carried on in Pakistan on a scale adequate to the economic\nand social needs of the country; or\n(c)        which will contribute to—\n(i)         the development of capital, technical and managerial resources of\nPakistan;\n(ii)        the discovery, mobilisation or better utilization of the national resources;\n(iii)       the strengthening of the balance of payments of Pakistan;\n(iv)        increasing employment opportunities in Pakistan; or\n(v)         the economic development of the country in any other manner.\n1[4.\nApproval of Foreign Private Investment.—Any sanction granted by the Federal\nGovernment for investment in an industrial undertaking shall be subject to the following conditions\nand to such other conditions as the Federal Government may specify, namely:—\nWhen the foreign private investment is by a person who, being a citizen of Pakistan, is also the\ncitizen of any other country, he shall deposit the entire amount of repatriable foreign investment in a\nforeign exchange account in Pakistan for its subsequent use for the purchase of machinery and other\nfixed assets of the undertaking”."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Protection of agreements",
      "content": "(1) Where the Federal Government considers it necessary in\nthe public interest to take over the management of an industrial undertaking having foreign private\ninvestment or to acquire the ownership of the shares of citizens of Pakistan in the capital of such\nindustrial undertaking, any agreement approved by the Federal Government relating to such\nundertakings entered into between a foreign investor or creditor and any person in Pakistan shall not\nbe affected by such taking over or acquisition.\n(2) Foreign capital or foreign private investment in an industrial undertaking shall not be\nacquired except under due process of law which provides for adequate compensation therefor to be\nsettled in the currency of the country of origin of the capital or investment and specifies the principles\non and the manner in which compensation is to be determined and given."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Repatriation facilities",
      "content": "Subject to the provisions of the Foreign Exchange Regulation\nAct, 1947 (VII 1947).\nl\nSubs. by the Foreign Private Investment (Promotion and Protection) (Amdt.) Act, 1993 (4 of 1993), s. 3, for section 4.\n(a)     a foreign investor in an industrial undertaking established after the 1st day of\nSeptember, 1954, and approved by the Federal Government, may at any time\nrepatriate in the currency of the country from which the investment originated—\n(i)     foreign private investment to the extent of original investment;\n(ii)    profits earned on such investment; and\n(iii)   any additional amount resulting from the reinvested profits or\nappreciation of capital investment; and\n(b)     a creditor of an industrial undertaking referred to in clause (a) may repatriate\nforeign currency loans approved by the Federal Government and interest\nthereon in accordance with the terms and conditions of the said loan:\nProvided that nothing in this section shall affect the terms of the permission to make such\ninvestment granted to a foreign investor before the commencement of this Act."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Remittances by foreign employees",
      "content": "Foreign nationals employed with the approval of\nthe Federal Government in any industrial undertaking having foreign private investment may make\nremittances for the maintenance of their dependents in accordance with the rules, regulations or orders\nissued by the Federal Government or the State Bank of Pakistan."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Tax concession and avoidance of double taxation",
      "content": "(1) The Federal Government may\nallow such concessions to industrial undertakings having foreign private investment as may be\nadmissible under any law for the time being in force.\n(2) Foreign private investment shall not be subject to other or more burdensome taxes on\nincome than those applicable to investment made in similar circumstances by citizens of Pakistan.\n(3) Foreign private investment shall be allowed all the tax concessions which may be\nadmissible on the basis of any agreement for avoidance of double taxation which the Government of\nPakistan may have entered into with the Government of the country of origin of such investment."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Equal treatment",
      "content": "Industrial undertakings having foreign private investment shall be\naccorded the same treatment as is accorded to similar industrial undertakings having no such\ninvestment in the application of laws, rules and regulations relating to importation and exportation of\ngoods."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to any provisions of this\nAct, the Federal Government may make such order, not inconsistent with the provisions of this Act,\nas may appear to it to be necessary for the purpose of removing the difficulty:\nProvided that no such power shall be exercised after the expiry of one year from the\ncommencement of this Act."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Power to make rules",
      "content": "The Federal Government may, by notification in the official\nGazette, make rules for carrying out the purposes of this Act, and such rules may, among other matters,\nprovide for the employment of Pakistani and foreign nationals in industrial undertakings having\nforeign private investment."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. [Repeal]. Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981",
      "content": "(XXVII of 1981), s. 3 and Sch., II.\n_____________"
    }
  ],
  "definitions": [
    {
      "term": "foreign capital",
      "definition": "investment made by a foreigner 2[or by a person who, being a citizen of Pakistan, is also the citizen of any other country] in an industrial undertaking in Pakistan— (i) in the form of foreign exchange, imported machinery and equipment, or (ii) in any other form which the Federal Government may approve for the purpose;",
      "source_provision": "sec2"
    },
    {
      "term": "foreign private investment",
      "definition": "investment in foreign capital by a person who is not a citizen of Pakistan 1[or who, being a citizen of Pakistan, is also the citizen of any other country] or by a company incorporated outside Pakistan, but does not include investment by a foreign Government or agency of foreign Government;",
      "source_provision": "sec2"
    },
    {
      "term": "industrial undertaking",
      "definition": "an industry, undertaking or establishment engaged in the production, distribution or processing of any goods, the providing of services specified in this behalf by the Federal Government or the development and extraction of such mineral resources and products as may be specified in this behalf by the Federal Government 2[but, for the purpose of investment by a person who, being a citizen of Pakistan, is also the citizen of any other country, does not include an undertaking or establishment engaged in providing banking or insurance services]. 1 For Statement of Objects and Reasons, see Gaz., of P., 1976, Ext., Pt. Ill, p. 392. 2 Ins. by the Foreign Private Investment (Promotion and Protection) (Amdt.) Act. 1993 (4 of 1993), s. 2. (2) Words and expressions used but not defined in this Act shall have the same meanings as in",
      "source_provision": "sec2"
    }
  ]
}
