{
  "id": "pk-foundation-university-ordinance-2002",
  "type": "statute",
  "title": "Foundation University Ordinance, 2002",
  "title_en": "Foundation University Ordinance, 2002",
  "short_name": "FUO",
  "status": "in_force",
  "issued_date": "2002-10-24",
  "in_force_date": "2002-10-24",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FtbZY%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Foundation University Ordinance, 2002 (LXXXVIII of 2002) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Functions of the Discipline Committee",
      "content": "ORDINANCE LXXXVIII OF 2002\n[25th October, 2002]\nAn Ordinance, to provide for the establishment of a Foundation University at Islamabad\nWHEREAS it is in the interest of country to establish a centre of excellence to provide quality\neducation of international standard to talented students of Pakistan;\nAND WHEREAS it is expedient to provide for the establishment of the Foundation University\nand for matters ancillary thereto or connected therewith;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the Fourteenth day\nof October, 1999, and the Provisional Constitution Order No. 1 of 1999, read with the Provisional\nConstitution (Amendment) Order No.9 of 1999, and in exercise of all powers enabling him in that\nbehalf, the President of the, Islamic Republic of Pakistan is pleased to make and promulgate the\nfollowing Ordinance:―"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "_(1) This Ordinance may be called the Foundation\nUniversity Ordinance, 2002. (2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_ In this Ordinance, unless there is anything repugnant in the subject or\n___\ncontext\n(a)    “Academic Council” means the Academic Council of the University;\n(b)    “Affiliate Institution” means an institution authorised by the Board of\nGovernors to conduct academic programmes approved by the University in\naccordance with rules prescribed for the purpose;\n(c)    “Authority” means any of the authorities of the University specified in section\n7;\n(d)    “Board of Governor” means the Board of Governors of the University;\n(e)    “Chairman” means the Chairman of the Board of Governors;\n(f)    “Chancellor” means the Chancellor of the University;\n(g)    “College” means any college maintained by the University;\n(h)    “President” means the President of the University;\n(i)    “Committee” means the Executive Committee of the University;\n(j)    “Deans” means the Dean of a faculty of the University;\n(k)    “Director” means the Director of a constituent institute of the University;\n(l)    “Faculty” means the Faculty of the University;\n(m)     “Head” means Head of a Teaching Department of the University;\n(n)     “Patron” means the Patron of the University;\n(o)     “Prescribed” means prescribed by regulation;\n(p)     “Principal” means the Principal of a constituent college of the University;\n(q)     “Registrar” means the Registrar of the University;\n(r)     “Rector” means the Rector of the University;\n(s)     “Statutes”, “Regulations” and “Rules” means the Statutes, the Regulations and\nthe Rules respectively made under this Ordinance;\n(t)     “Teaching Department” means teaching department established and maintained\nby the University;\n(u)     “HEC” means the “Higher Education Commission” established under the\nHigher Education Commission Ordinance; 2002 (LIII of 2002);\n(v)     “University” means the Foundation University, Islamabad;\n(w)     “University Teacher” means Professor, Associate Professor, Assistant Professor\nand Lecturer engaged whole-time by the University for teaching;"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment and Incorporation of the University",
      "content": "_(1) There shall be established at\nIslamabad a University to be called the Foundation University consisting of--\n(a)     the Patron, the Chancellor, the President, the Rector, the Deans, the Directors,\nthe Principals and other members of the Board of Governors;\n(b)     the members of councils, boards, committees and other bodies as the Board may\nestablish;\n(c)     the teachers and students of the University and its constituent units; and\n(d)     such other officers and members of the staff as the Board may, from time to\ntime, specified;\n(2) The University shall be a body corporate by the name of the Foundation University,\nIslamabad having perpetual succession and a common seal, with power, among others, to acquire, hold\nand dispose of any property or investments and shall by the said name sue and be sued.\n(3) The principal seat of the University shall be at Islamabad and it may set up its campuses,\ncolleges, institutes, officers, research/study centres and other facilities at such places in Pakistan as\nBoard of Governors may determine. The additional campuses shall be set in other parts of the country\nonly after their evaluation by the Higher Education Commission to determine whether they meet the\neligibility criteria fixed by the Higher Education commission."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. University open to all classes, creeds, etc",
      "content": "_ The University shall be open to persons of\neither sex of whatever religion, rape, creed, colour or domicile who are academically qualified for\nadmission to the courses of study offered by the University and no such person shall be denied the\nprivileges of the University on the ground only for sex, religion, creed, race, class, colour or domicile."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Functions and powers of the University.___ The University shall have the powers",
      "content": "(a)     to provide for instruction and training in such branches of learning as it may\ndeem fit, and to make provisions for research, demonstrations and other\nservices, and for the advancement and dissemination of knowledge in such a\nmanner as it may determine;\n(b)    to select, admit and examine students;\n(c)    to hold examinations and confer or award degrees, diplomas certificates and\nother academic distinctions on and to persons who have passed its examinations\nunder prescribed conditions or have participated in its executive development\nprogrammes;\n(d)    to establish and promote faculties;\n(e)    to confer honorary degrees on persons as approved by the Board;\n(f)    to prescribe courses of studies in such branches of learning as the University\nmay determine;\n(g)     to establish and support other facilities for education, training and research;\n(h)     to enter into agreements, contracts and arrangements with universities,\norganisations, institutions, bodies and individuals for the purpose of carrying\nout its functions and activities in Pakistan or abroad;\n(i)    to decide teaching methods and strategies in order to ensure the most effective\neducational and training programmes;\n(j)    to create posts for teaching, research, administration and other related functions\nand to appoint persons thereto;\n(k)    to receive and manage property transferred and grants, bequests; trust, gifts,\ndonations, endowments and other contributions made to it and to invest any\nfunds representing such property, grants, bequests, trusts, gifts, donations,\nendowments or contributions and to convert one kind of property into another,\nin such manner as it may deem fit;\n(l)    to institute and award fellowships, scholarships, exhibitions, bursaries, medals\nand prizes under prescribed conditions;\n(m)     to demand and receive such fees and other charges as it may determine;\n(n)    to appoint members of various bodies and committees, as the Board may\ndetermine, for academic and administrative activities;\n(o)    to appoint such officers and staff and prescribe terms and conditions powers and\nduties of such officers and staff;\n(p)    to do all such other acts and things as may be required to further its objectives\nand\n(q)     in the exercise of above powers and functions the University shall be subject to\nany general rules, instructions or directions as the HEC may from time to time,\nissue."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Teaching and examination of University",
      "content": "_(1) The academic programmes of the\nUniversity shall be conducted in the prescribed manner.\n(2) The University shall associate external examiners for the conduct of examination.\n(3) No degree shall be granted unless a student has passed an examination in Islamic Studies\nand Pakistan Studies at the Bachelor's degree level or, in the case of a non- Muslim student, in Ethics\nand Pakistan Studies as his option.\n(4) In the prescribing syllabi, courses of studies and instructions for the conduct of studies, the\nUniversity shall abide by the directions given by the HEC under the Higher Education Commission\nOrdinance, 2002 (LIII of 2002). for Federal Supervision of Curricula. Textbooks and Maintenance of\nStandards of Education."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Authorities of the University",
      "content": "_ The Authorities of the University shall consist of.\n(a)     the Board of Governors;\n(b)     the Executive Committee;\n(c)     the Academic Council;\n(d)     the Board of Faculties;\n(e)     the Board of Advance Studies and Research;\n(f)     the Selection Board;\n(g)     the Finance and Planning Committee;\n(h)     the Governing Bodies of the Constituent Units in whatever manner designed;\nand\n(i)     any other Authority constituted by the Board of Governors."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Officers of the University",
      "content": "_ The following shall be officers of the University, namely:___\n(a)     the Patron;\n(b)     the Chancellor;\n(c)     the President;\n(d)     the Rector;\n(e)     the Deans;\n(f)     the Heads of Teaching Departments;\n(g)     the Registrar;\n(h)     the Director Finance;\n(i)     the Director Research and Development;\n(j)     the Heads of Constituent Units;\n(k)     such other persons as may be specified by regulations to be the officers."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. The Patron",
      "content": "_(1) The President of Pakistan shall be the Patron of the University.\n(2) The Patron, when present or his nominee shall preside at the convocations of the University.\n(3) Every proposal to confer an honorary degree shall be subject to confirmation by the Patron."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Visitation by the Patron",
      "content": "_(1) The Patron may cause an inspection or inquiry to be made\non his own motion or at the request of the HEC in respect of any matter connected with the affairs of\nthe University and shall, from time to time, direct any person of persons to inquire into or carry out\ninspection of___\n(a)     the University, its buildings, laboratories, libraries, and other facilities;\n(b)     any institution, department or hostel maintained by the University;\n(c)     the adequacy of financial and human resources;\n(d)     the teaching, research, curriculum, examination and other matters of th\nUniversity; and\n(e)     such other matters as the Patron may specify.\n(2) The Patron shall communicate to the respective Board his views with regard to the results\nof visitation and shall', after ascertaining the views of the respective Board, advise the Board on the\naction to be taken by it.\n(3) The respective Board shall, within such time as may be specified by the Chancellor,\ncommunicate to him such action, if any, as has been taken or may be proposed to be taken upon\nthe results of visitation.\n(4) Where the respective Board does not, within the time specified, take action to the\nsatisfaction of the Patron, the Patron may issue such directions as he deems fit and the respective\nBoard shall comply with all such direction."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. The Chancellor.",
      "content": "_(1) The Chairman of Fauji Foundation shall be the Chancellor of the\nUniversity.\n(2) The Chancellor shall appoint the Rector on the Recommendation on the Board of\nGovernors of the University.\n(3) If the Chancellor is satisfied that the proceedings of any Authority or orders of any officer\nare not in accordance with the provisions of this Ordinance, the statutes, the regulations or the rules,\nhe may after calling upon such Authority or officer to show- cause why such proceedings should not\nbe annulled by order in writing, annul such proceedings or order.\n(4) The Chancellor may remove any person from the membership of any Authority if such\nperson___\n(a)     has become of unsound mind; or\n(b)     has been incapacitated to function as a member of such Authority has been\nconvicted by a Court of law or an offence involving moral turpitude or has\nbeen found indulging in any activity against the interest of !he University.\n(c)     should the Chancellor be incapacitated from acting as such due to absence or\nany other cause, the President or a nominee of the Chancellor shall act for him."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. The President.___ The Managing Director of Fauji Foundation shall be the ex",
      "content": "officio\npresident and chief executive officer of the University."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. The Rector",
      "content": "_(1) The Rector, who shall be an eminent scholar of national repute and\nan educationist or scientist of distinction, shall be appointed by the Chancellor on the\nrecommendation of the President on such terms and conditions as he may determine.\n(2) At any time when the office of the Rector is vacant, or he is absent or unable to perform\nthe functions of his office due to illness or some other reason, the President shall make such\narrangements for the performance of the duties of the Rector as he may deem fit.\n(3) The Rector shall be the chief academic and administrative officer of the University and\nshall be responsible for the implementation of the decisions and for the execution of the programmes\nof the University in accordance with the guidelines and policies formulated by the Board of\nGovernors.\n(4) The Rector may, in an emergency which in his opinion requires immediate action, take\nsuch action as he may consider necessary and shall, thereafter, as soon as possible, report his action to\nthe officer, authority, or other body, which in the ordinary course would have dealt with the matter.\n(5) The Rector shall also have power___\n(a)     to regulate the activities connected with the execution of programmes for\ninstructions, training, research, and similar services;\n(b)     to create and fill temporary posts for a period not exceeding six months.\n(c)     to sanction all expenditure provided for in the approved budget and the re-\nappropriate funds within the same major head of expenditure;\n(d)     to sanction and, re-appropriate an amount not exceeding one hundred\nthousand rupees for an unforeseen item not provided for in the budget and\nreport it to the Board of Governors in the next meeting;\n(e)     to appoint, with the approval of the Board of Governors, teachers, officers and\nmembers of the staff of the University and such other persons as may be\nnecessary in accordance with policies and procedures approved by the Board\nof Governors;\n(f)    to submit to the Board of Governors, in accordance with the rules of procedure,\nreports on the activities of the University and the execution of the plans of\nwork;\n(g)    to appoint, paper setters and examiners for all examinations of the University;\n(h)    to direct teachers, officers and other employees of the University to take up\nsuch assignments in connection with teaching, research, examinations and\nadministration and such other activities in the University, as he may consider\nnecessary;\n(i)    to delegate, subject to such conditions, if any, as may be prescribed, any\nof his powers under this Ordinance, to an officer or other employee of the\nUniversity; and\n(j)    to exercise and perform such other powers and functions as may be prescribed."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. The Board of Governors",
      "content": "_(1) The general supervision and control of the affairs, and the\npower to lay down the policies of the University shall vest in the Board of Governors consisting of the\nfollowing members, namely:―\n(a)    the Chancellor who shall be the Chairman of the Board;\n(b)    the President who shall be the Vice-Chairman of the Board;\n(c)    the Rector of the University;\n(d)    a retired Judge of Supreme Court of Pakistan or a High Court to be nominated\nby the Chief Justice concerned;\n(e)    Chairman, Higher Education Commission or his nominee;\n(f)    Education Secretary of the Federal Government or his nominee not below the\nrank of a Joint Secretary;"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Powers and functions of the Board of Governors.___(1) The Board of Governors shall",
      "content": "(a)    hold, control and administer the property, funds and resources of the University\nand raise funds for the purpose of the University upon such security as may be\nrequired under regulations;\n(b)    undertake responsibility for the financial viability of the University including\nresponsibility for ensuring effectiveness of its operations, their continuity and\npreservation of the autonomy of the University;\n(c)    consider and pass the resolution of the annual report, plan of work, statements\nof accounts and the annual budget estimates:\n(a)    formulate or approve policies and plans governing the activities and operations\nof the University so as to facilitate research, teaching and other academic work;\n(b)    make statutes and rules;\n(c)    prepare or have prepared and revise from time to time statutes and rules for the\nefficient and effective operation of the University;\n(d)    establish faculties departments or institutes etc. under its jurisdiction and to\nconstitute such standing committees, councils and other administrative or\nacademic advisory bodies as it deems necessary and review their work;\n(e)    call for and consider reports relating to the activities of the University and the\nexecution of plans of work and to direct the Rector to furnish information\nrelating to any matter specified by the Board of Governors;\n(f)    create such academic or administrative, posts as it may deem necessary and to\napprove appointments to such posts as it may specify;\n(g)    constitute committees or sub-committees as it may deem necessary;\n(h)    take all such measures as it may consider necessary or desirable for the efficient\nand effective management and functioning of the University Board;\n(i)    appoint teachers and officers on the recommendation of the Selection\n(j)    delegate powers to an authority or officer or a committee.\n(2)    The Board of Governors may delegate any of its powers to the President subject\nto such conditions as it may deem fit to impose."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Meeting of the Board of Governors",
      "content": "_(1) The Board shall meet at least twice year on\ndates to be fixed by the Chancellor provided that a special meeting may be called at any time by the\nChancellor or on a request by not less than five members of the Board to consider any matter of urgent\nnature.\n(2) In the case of a special meeting not less than ten clear days notice shall be given to the\nmembers of the Board and the agenda of the meeting shall be restricted to the matter for which the\nspecial meeting is called.\n(3) The quorum for a meeting of the Board shall be one-half of its members, fraction being\ncounted as one.\n(4) The decisions of the Board shall be expressed in terms of the views of the majority and\nvoting of the members present. If the members are equally divided, the Chairman shall have the power\nto exercise a casting vote."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Executive Committee",
      "content": "_(1) The Executive Committee shall comprise of the Following\nmembers, namely:―\n(a)    the President who shall be its Chairman;\n(b)    the Rector;\n(c)    two members of Board of Governor to be nominated by the Board;\n(d)    all members of the Central Board of Directors of Fauji Foundation;\n(2) The Executive Committee shall deliberate on various aspects related to the functioning of\nthe University and recommend specific measures to the Board for consideration and shall in\nparticular___\n(a)     provide and raise funds for the purposes of the University;\n(b)     undertake responsibility for the financial viability of the University and ensure\neffectiveness of its operations;\n(c)     consider and pass the resolution on the annual report plan of work, statement of\naccounts and the annual budget estimates as recommended by the Board of\nGovernors;\n(d)     delineate priorities for research;\n(e)     recommend allocation of training and research funds to the Departments,\nInstitutes, Schools and Colleges;\n(f)     recommend such measures which ,would foster and enhance interaction and\ncollaboration between the University and other national and international\norganizations, institutions, research centres and industry;\n(g)     propose affiliation measures with foreign institutions of repute;\n(h)     decide methods and strategies in order to ensure 'the most effective scientific\nand technological programmes;\n(i)     co-ordinate with relevant Government Ministries, Departments, Universities,\nHigher Education Commission; and\n(j)     prescribe guidelines for proper and efficient 'functioning of the University."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Academic Council",
      "content": "_(1) The Academic Council shall consist of the following members,\nnamely:―\n(a)     the Rector who shall be its Chairman;\n(b)     all the Deans;\n(c)     all the Heads of the Departments, Institutes, Colleges and Schools;\n(d)     all Professors and Associate Professors of the University;\n(e)      A representative of the Federal Ministry of Education;\n(f)     two Assistant Professors and two Lecturers to be nominated by the Board of\nGovernors on the recommendations of the Rector;\n(g)     three persons eminent in the arts, the sciences and the professions of whom one\nshall be from each category to be nominate by the Board of Governors;\n(h)      Director (Academics), HEC;\n(i)     Controller of Examinations;\n(J)      Librarian; and\n(k)     the Registrar\n(2) The Registrar shall, ex-officio, act as Secretary of the Academic Council.\n(3) Members appointed by nomination shall hold office for three years.\n(4) the quorum for a meeting of the Academic Council shall be one-third of the total number\nof members, a fraction being counted as one."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Powers and duties of the Academic Council",
      "content": "_(1) The Academic Council shall be the\nhighest academic body of the University and shall, subject to the provisions of the Ordinance and the\nStatutes, have the powers to lay down proper standards of instruction, training, research, publications,\nexaminations and to regulate and promote the academic life of the University.\n(2) Without prejudice to the generality of the foregoing provisions and subject to the provisions\nof this Ordinance and the Statutes, the Academic Council shall have the power―\n(a)     to advise the Board of Governors on academic matters;\n(b)     to regulate the conduct of teaching, research, publications and examinations;\n(c)     to regulate the admissions of students to the courses of studies and examinations\nin the University;\n(d)     to regulate the conduct and discipline of the students of the University;\n(e)     to propose to the Board schemes for the constitution and organization of\nFaculties, Institutes, Schools, Colleges and Academic Departments;\n(f)     to consider or formulate proposals for planning and development of teaching\nand research in the University;\n(g)     to make Regulations prescribing the courses of studies; the syllabi and the\noutlines of tests for all University examinations subject to the approval of the\nBoard of Governors;\n(h)     to regulate the award of studentship, scholarships, exhibitions, medal and prizes;\n(i)     to frame Regulations for submission to the Board for approval;\n(j)     to appoint/nominate members to the various Authorities in accordance with the\nprovisions of this Ordinance;\n(k)      to recognise the examinations of other Universities or examining bodies\nequivalent to the corresponding examinations of the University; and\n(l)     to perform such other functions as may be prescribed by Statutes."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Appointments",
      "content": "_ The University may appoint such persons in its service as may be\nnecessary on such terms and conditions as the Board may by rules determine."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Committees",
      "content": "_ The Board, the Academic Council, and other Authorities may constitute\nsuch committees as may be deemed necessary for carrying out the purposes of this Ordinance."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Delegation of Powers",
      "content": "_ The Board may delegate to any person or a committee any of its\npowers, duties or functions."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. University Fund",
      "content": "_ There shall be a fund to be known as the “Foundation University\nFund” to which shall be credited all sums received by the University."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Budget and Accounts",
      "content": "_(1)The budget of the University shall be approved and its\naccounts shall be maintained and audited in such manner as may be prescribed."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Statutes",
      "content": "_(1) The Board may make Statutes for the administration and management of\nthe University .\n(2) The Statutes set out in the Schedule to this Ordinance shall be deemed to be the First Statutes\nframed under subsection (1) and shall remain in force until they are amended or replaced by new\nStatutes made in accordance with subsection."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Regulations",
      "content": "_ The Academic Council may with the approval of the Board, make\nRegulations for the proper standards of instruction, training, research and examinations."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Rules",
      "content": "_(1) Authorities and the other bodies of the University may make Rules consistent\nwith this Ordinance, Statutes and Regulations, to regulate the conduct of their business and the time\nand place of meetings and related matters.\n(2) The Board may make rules to regulate any matter relating to the affairs of the University,\nwhich under this Ordinance, are not specifically required to be provided for by the Statutes or the\nRegulations."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Discipline",
      "content": "_ The University shall have power to supervise and control the discipline of\nthe, students of the University in the prescribed manner."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Removal of difficulties.―If any difficulty arises in giving effect to any of the provisions",
      "content": "of this Ordinance, the President may, on the recommendations of the Board make such order not\ninconsistent with the said provisions, as it may consider necessary for the removal of such difficulty.\n________________\n[See section 26]"
    }
  ],
  "definitions": [
    {
      "term": "Academic Council",
      "definition": "the Academic Council of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Affiliate Institution",
      "definition": "an institution authorised by the Board of Governors to conduct academic programmes approved by the University in accordance with rules prescribed for the purpose;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "any of the authorities of the University specified in section 7;",
      "source_provision": "sec2"
    },
    {
      "term": "Board of Governor",
      "definition": "the Board of Governors of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Board of Governors;",
      "source_provision": "sec2"
    },
    {
      "term": "Chancellor",
      "definition": "the Chancellor of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "College",
      "definition": "any college maintained by the University;",
      "source_provision": "sec2"
    },
    {
      "term": "President",
      "definition": "the President of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Committee",
      "definition": "the Executive Committee of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Deans",
      "definition": "the Dean of a faculty of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Director",
      "definition": "the Director of a constituent institute of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Faculty",
      "definition": "the Faculty of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Head",
      "definition": "Head of a Teaching Department of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Patron",
      "definition": "the Patron of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Prescribed",
      "definition": "prescribed by regulation;",
      "source_provision": "sec2"
    },
    {
      "term": "Principal",
      "definition": "the Principal of a constituent college of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Registrar",
      "definition": "the Registrar of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Rector",
      "definition": "the Rector of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Teaching Department",
      "definition": "teaching department established and maintained by the University;",
      "source_provision": "sec2"
    },
    {
      "term": "HEC",
      "definition": "the “Higher Education Commission” established under the Higher Education Commission Ordinance; 2002 (LIII of 2002);",
      "source_provision": "sec2"
    },
    {
      "term": "University",
      "definition": "the Foundation University, Islamabad;",
      "source_provision": "sec2"
    },
    {
      "term": "University Teacher",
      "definition": "Professor, Associate Professor, Assistant Professor and Lecturer engaged whole-time by the University for teaching;",
      "source_provision": "sec2"
    }
  ]
}
