{
  "id": "pk-freedom-of-information-ordinance-2002-repealed-by-act-xxxiv-of-2017",
  "type": "statute",
  "title": "Freedom of Information Ordinance, 2002(Repealed by Act XXXIV of 2017))",
  "title_en": "Freedom of Information Ordinance, 2002(Repealed by Act XXXIV of 2017))",
  "short_name": "FOIOB",
  "status": "repealed",
  "issued_date": "2002-10-25",
  "in_force_date": "2002-10-25",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FtbZo%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Freedom of Information Ordinance, 2002(Repealed by Act XXXIV of 2017)) (XCVI of 2002) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.­(1) This Ordinance may be called the Freedom of",
      "content": "Inforniation Ordinance, 2002.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definition",
      "content": "In this Ordinance, unless there is anything repugnant in the subject or context,__\n(a) \"complainant\" means,__\n(i) a requester, or\n(ii) any person acting for and on behalf of requester;\n(b) \"complaint\" means any allegation in writing made by a complainant,__\n(i) where he is a requester, that access to record has been wrongfully denied to him by a\npublic body; .\n(ii) where he is a requester, that access to and/or correction of his personal information\nhas been wrongfully denied to him by a public body having the custody or control of\nthe record:\n(iii) where he is a requester that the information requested by him has been unduly\ndelayed by a public body.\n(c) \"designated official\" means an official of a public body designated under section 10;\n(d) \"employee\", in relation to a public body, means a person employed in a public body\nwhether permanently or temporary;\n(e) \"Federal Tax Ombudsman\" means Federal Tax Ombudsman appointed under section 3 of\n2000);\n(f) \"Mohtasib\" means the Wafaqi Mohtasib (Ombudsman) appointed under Article 3 of the\nEstablishment of the Office of the Wafaqi Mohtasib (Ombudsman) Order, 1983 (P.O. No.\n1 of 1983);\n(g) \"prescribed\" means prescribed by rules made under this Ordinance:\n(h) \"public body\" means,__\n(i) any Ministry, Division or attached department of the Federal Government;\n(ii) Secretariat of Majlis­e­Shoora (Parliament);\n(iii) any office of any Board, Commission, Council, or other body established by, or\nunder, a Federal law;\n(iv) courts and tribunals;\n(i) \"record\" means record in any form, whether printed or in writing and includes any map,\ndiagram, photography, film, microfilm, which is used for official purpose by the public\nbody which holds the record;"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Access to information not to be denied.­(1) Notwithstanding anything contained in any other",
      "content": "law for the time being to force, and subject to the provisions of this Ordinance, no requester shall be\ndenied access to any official record other than exemptions as provided in section 15.\n(2) This Ordinance shall be interpreted so as,\n(i) to advance the purposes of this Ordinance; and\n(ii) to facilitate and encourage, promptly and at the lowest reasonable cost, the disclosure of\ninformation."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Maintenance and indexing of records",
      "content": "_Subject to provisions of this Ordinance and in\naccordance with the rules that may be prescribed, each public body shall ensure that all records\ncovered under clause (i) of section 2 of this Ordinance are properly maintained."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Publication and availability of records",
      "content": "The acts and subordinate legislation such as rules\nand regulations, notifications, bye­laws manuals ,orders having the force of law in Pakistan shall be\nduly published and made available at a reasonable price at an adequate number of outlets so that\naccess thereof is easier, less time­consuming and less expensive."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Computerization of records",
      "content": "Each public body shall endeavour within reasonable time and\nsubject to availability of resources that all records covered by the provisions of this Ordinance are\ncomputerized and connected through a network all over the country on different systems so that\nauthorised access to such records is facilitated."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Declaration of public record",
      "content": "Subject to the provisions of section 8, the following record of\nall public bodies are hereby declared to be the public record, namely:__\n(a) policies and guidelines;\n(b) transactions involving acquisition and disposal of property and expenditure undertaken by\na public body in the performance of its duties;\n(c) information regarding grant of licensces, allotments and other benefits and privileges and\ncontracts and agreements made by a public body;\n(d) final orders and decisions, including decisions relating to members of public; and\n(e) any other record which may be notified by the Federal Government as public record for"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Exclusion of certain record",
      "content": "Nothing contained in section 7 shall apply to the following\nrecord of all public bodies, namely:__\n(a) noting on the files;\n(b) minutes of meetings;\n(c) any intermediary opinion or recommendation;\n(d) record of the banking companies and financial institutions relating to the accounts of their\ncustomers;\n(e) record relating to defence forces, defence installations or connected therewith or ancillary\nto defence and national security;\n(f) record declared as classified by the Federal Government;\n(g) record relating to the personal privacy of any individual;\n(h) record of private documents furnished to a public body either on an express or implied\ncondition that information contained in any such documents shall not be disclosed to a\nthird person; and\n(i) any other record which the Federal Government may, in public interest exclude from the\npurview of this Ordinance."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Duty to assist requesters",
      "content": "A public body shall take necessary steps as may be prescribed to\nassist any requester under this Ordinance."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Designation of official",
      "content": "(1) A public body shall designate and notify an officer or employee\nto whom requests under the Ordinance are to be made. These officials will be designated to ensure\neasy public access to information.\n(2) In case no such official has been designated or in the event of the absence or non­availability\nof the designated official, the person incharge of the public body shall be the designated official."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Functions of designated official",
      "content": "Subject to the provisions of this Ordinance and the rules\nmade thereunder and the instructions if any, of the Federal Government, the designated official shall\nprovide the information contained in any public record or, as the case may be, a copy of any such\nrecord."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Applications for obtaining information, etc",
      "content": "(1) Subject to sub­section (2), any citizen of\nPakistan may make an application to the designated official in the form as may be prescribed and\nshall with his application, furnish necessary particulars, pay such fee and at such time as may be\nprescribed.\n(2) Nothing contained in sub­section (1) shall apply to such public record as has been published in\nthe official Gazette or in the form of a book offered for sale."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Procedure for disposal of applications",
      "content": "(1) Subject to sub­section (2), on receiving an\napplication under section 12, the designated official shall, within twenty­one days of the receipt of\nrequest, supply to the applicant the required information or, as the case may be, a copy of any public\nrecord.\n(2) In case the designated official is of the opinion that__\n(a) the application is not in the form as has been prescribed;\n(b) the applicant has not furnished necessary particulars or has not paid such fee as has been\nprescribed;\n(c) the applicant is not entitled to receive such information;\n(d) the required information or, as the case may be, the required record does not constitute a\npublic record under section 7; and\n(e) the required information or, as the case may be, the required record constitutes a record\nwhich is excluded under section 8,\nhe shall record his decision in writing and the applicant shall be informed about such decision\nwithin twenty­one days of the receipt of the application.\n(3) The information from, or the copy of, any public record supplied to the applicant under sub­\nsection (1), shall contain a certificate at the foot thereof that the information is correct or, as the case\nmay be, the copy is a true copy of such public record, and such certificate shall be dated and signed\nby the designated official."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Exempt information from disclosure",
      "content": "Subject to the provisions of this Ordinance, a public\nbody shall not be required to disclose exempt information."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. International relations",
      "content": "(1) Information may be exempt if its disclosure would be likely to\ncause grave and significant damage in the interests of Pakistan to the conduct of international\nrelation.\n(2) In this Section, \"international relations\" means relations between Pakistan and,__\n(a) the Government of any other foreign State; or\n(b) an organisation of which only States are members."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Disclosure harmful to law enforcement",
      "content": "Information may be exempt if its disclosure is\nlikely to,__\n(a) result in the commission of an offences.\n(b) harm the detection, prevention, investigation or inquiry in a particular case;\n(c) reveal the identity of a confidential source of information;\n(d) facilitate an escape from legal custody; and\n(e) harm the security of any property or system, including a building, a vehicle, a computer\nsystem or a communications system."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Privacy and personal information",
      "content": "Information is exempt if its disclosure under this\nOrdinance would involve the invasion of the privacy of an identifiable individual (including a\ndeceased individual) other than the requester."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Economic and commercial affairs",
      "content": "Information is exempt if and so long as its disclosure,__\n(a) would be likely to cause grave and significant damage to the economy as a result of the\npremature disclosure of the proposed introduction, abolition of variation of any tax, duty,\ninterest rate, exchange rate or any other instrument of economic management;\n(b) would be likely to cause significant damage to the financial interests of the public body by\ngiving an unreasonable advantage to any person in relation to a contract which that\nperson is seeking to enter into with the public body for the acquisition or disposal of\nproperty or the supply of goods or services; or\n(c) by revealing information to a competitor of the public body, would be likely to cause\nsignificant damage to the lawful commercial activities of the public body."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Recourse to the Mohtasib and Federal Tax Ombudsman.­(1) If the applicant is not",
      "content": "provided the information or copy of the record declared public record under section 7 within the\nprescribed time or the designated official refuses to give such information or, as the case may be,\ncopy of such record, on the ground that the applicant is not entitled to receive such information or\ncopy of such record, the applicant may, within thirty days of the last date of the prescribed time for\ngiving such information or, as the case may be, of such record, or the communication of the order of\nthe designated official declining to give such information or copy of such record, file a complaint with\nthe head of the public body and on failing to get the requested information from him within the\nprescribed time may file a complaint with the\nMohtasib and in cases relating to Revenue Division, its subordinate departments, offices and agencies\nwith the Federal Tax Ombudsman.\n(2) The Mohtasib or the Federal Tax Ombudsman, as the case may be, may, after hearing the\napplicant and the designated official, direct the designated official to give the information or, as the\ncase may be, the copy of the record or may reject the complaint."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Dismissal of frivolous, vexatious and malicious complaint",
      "content": "Where a complaint instituted\nis found to be malicious, frivolous or vexatious, the complaint may be dismissed by Mohtasib, and\nfine may be imposed on the complainant up to an amount not exceeding ten thousands rupees."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Offence",
      "content": "Any person who destroys a record which at the time it was destroyed was the\nsubject of a request, or of a complaint with the intention of preventing its disclosure under this\nOrdinance, commits an offence punishable with imprisonment for a term not exceeding two years, or\nwith fine, or with both."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Indemnity",
      "content": "No suit, prosecution or other legal proceedings shall lie against any person for\nanything which is done in good faith or intended to be done in pursuance of this Ordinance or any\nrules made thereunder."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Ordinance not to derogate other laws",
      "content": "The provisions of this Ordinance shall be in\naddition to and not in derogation of anything contained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Power to remove difficulties",
      "content": "If any difficulty arises in giving effect to the provisions of\nthis Ordinance, the Federal Government may, by order in the official Gazette, make such provisions\nnot inconsistent with the provisions of this Ordinance as appear to it to be necessary or expedient for\nremoving the difficulty."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Power to make rules",
      "content": "(1) The Federal Government may, by notification in the official\nGazette, make rules for carrying out the purposes of this Ordinance.\n(2) In particular and without prejudice to the generality of the foregoing powers, such rules may\nprovide for,__\n(a) the fee payable for obtaining information from, and copies of the public record;\n(b) the form of application for obtaining information from, and copies of the public record;\nand\n(c) the form in which information from public record shall be furnished."
    }
  ],
  "definitions": [
    {
      "term": "complaint",
      "definition": "any allegation in writing made by a complainant,__ (i) where he is a requester, that access to record has been wrongfully denied to him by a public body; . (ii) where he is a requester, that access to and/or correction of his personal information has been wrongfully denied to him by a public body having the custody or control of the record: (iii) where he is a requester that the information requested by him has been unduly delayed by a public body.",
      "source_provision": "sec2"
    },
    {
      "term": "designated official",
      "definition": "an official of a public body designated under section 10;",
      "source_provision": "sec2"
    },
    {
      "term": "Federal Tax Ombudsman",
      "definition": "Federal Tax Ombudsman appointed under section 3 of 2000);",
      "source_provision": "sec2"
    },
    {
      "term": "Mohtasib",
      "definition": "the Wafaqi Mohtasib (Ombudsman) appointed under Article 3 of the Establishment of the Office of the Wafaqi Mohtasib (Ombudsman) Order, 1983 (P.O. No. 1 of 1983);",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Ordinance:",
      "source_provision": "sec2"
    },
    {
      "term": "record",
      "definition": "record in any form, whether printed or in writing and includes any map, diagram, photography, film, microfilm, which is used for official purpose by the public body which holds the record;",
      "source_provision": "sec2"
    }
  ]
}
