{
  "id": "pk-general-statistics-recorganization-act-2011",
  "type": "statute",
  "title": "General Statistics (Recorganization) Act, 2011",
  "title_en": "General Statistics (Recorganization) Act, 2011",
  "short_name": "GSA",
  "status": "in_force",
  "issued_date": "2011-11-30",
  "in_force_date": "2011-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FsZ5k%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of General Statistics (Recorganization) Act, 2011 (XIV of 2011) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.⎯ (1) This Act may be called the General",
      "content": "Statistics (Reorganization) Act, 2011.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.⎯ In this Act, unless there is anything repugnant in the subject or context, ⎯",
      "content": "(a)     “appropriate Government” means, ⎯\n(i)     in relation to the Federal Statistical Authority or any matter relating to\nthe collection and compilation of statistics for whole of Pakistan, the\nFederal Government; and\n(ii)    in relation to a Provincial Statistical Authority or any matter relating to\nthe collection and compilation of statistics for a Province or a part\nthereof, the Provincial Government;\n(b)      “Bureau” means the Pakistan Bureau of Statistics established under section 3;\n(c)      “census” means population and housing census under section 31, agriculture\ncensus under section 37 and other censuses under section 39;\n(d)      “census officer” means any person appointed under section 32;\n(e)      “Chairman” means the Chairman of the Governing Council appointed under\nsection 6;\n(f)   “Chief Statistician” means the Chief Statistician of the Bureau appointed\nunder section 14;\n(g)   “company” means any legal entity registered as such under the Companies\nOrdinance 1984 (XLVII of 1984), including association of persons,\nregistered partnership, corporation, statutory body, trust, society or any other\nlegal entity;\n(h)   “competent authority” means an authority or officer appointed as such by an\nappropriate Government under section 21;\n(i)   “functional member” means a professional appointed under section 18;\n(j)   “Governing Council” means the Council constituted under section 6;\n(k)   “house” includes a building, tent, vessel or abode used as human dwelling;\n(l)   “Institute” means the Statistics Training and Research Institute;\n(m)   “local council” means a local council constituted under any law relating\nto local government and includes a Cantonment Board constituted under the\nCantonments Act, 1924 (II of 1924);\n(n)   “member” means a member of the Governing Council;\n(o)   “prescribed” means prescribed by rules and regulations made under this Act;\n(p)   “Provincial Census Commissioner” means a person or authority appointed by\nthe Federal Government to conduct and supervise the census in a Province;\n(q)   “regulations” means the regulations made under this Act;\n(r)   “rules” means the rules made under this Act;\n(s)   “statistical agent” means any agency, authority or officer appointed for, or\nengaged in, the collection of statistics under section 22;\n(t)   “Statistical Authority” means the Federal Statistical Authority or a Provincial\nStatistical Authority appointed under section 19;\n(u)   “Statistics Fund” means the fund established under section 40; and\n(v)   “Users Council” means the National Users Council and Provincial Users\nCouncils constituted under section 12."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Pakistan Bureau of Statistics.⎯ (l) There shall be established a",
      "content": "bureau to be called the Pakistan Bureau of Statistics to carry out the purpose of this Act.\n(2) On the establishment of the Bureau, all assets, rights, powers, authorities and privileges and\nall movable and immovable property, cash and bank balances, investments and all other interests and\nrights in, or arising out of, such property and all debts liabilities and obligations of the Federal Bureau\nof Statistics, the Agricultural Census Organization and Population Census Organization shall vest in\nthe Bureau.\n(3) The head office of the Bureau shall be at Islamabad and the Bureau may establish\nregional and field offices at such other places and in such numbers as the Governing Council may,\nfrom time to time, deem fit.\n(4) The Federal Government shall provide grant-in-aid (annual or supplementary) for pay\nallowances, pension and other employees-related expenses, etc., as admissible to the civil servants,\nfrom time to time, for the staff of Bureau including that of Federal Bureau of Statistics, Population\nCensus Organization, Agricultural Census Organization and Technical Wing of Statistics Division and\noperation of the Bureau including funds needed for conduct of different departmental censuses,\nsurveys, studies, development projects, training of staff, purchase of durable goods, construction of\noffice buildings and operating expenses etc.\n(5) The design of all censuses, surveys or statistical studies proposed to be undertaken by the\nFederal Government or any organization of Federal Government shall be finalized in consultation\nwith the Bureau."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers and functions of the Bureau.⎯ (1) The Bureau shall have all such powers as",
      "content": "may be necessary to perform its duties and functions under this Act. These powers shall be exercised\nby the Chief Statistician on behalf of the Bureau.\n(2) Without prejudice to the generality of the foregoing provision, the Bureau shall exercise\nand perform the following powers and functions, namely:—\n(a)     to collect, compile, analyze, abstract, publish, market and disseminate statistical\ninformation relating to the commerce and trade, industrial, financial, social,\neconomic, demographic, agriculture and any other area to be specified by the\nFederal Government and conditions of the people of Pakistan and to foster the\nevolution of product lines in response to pressing needs of society;\n(b)     to plan, execute and publish the census of population and housing of Pakistan,\nthe census of agriculture of Pakistan or other censuses at national level as\nrequired from time to time;\n(c)     to facilitate policymaking by undertaking overall planning, coordination\nand annual programming of surveys and censuses in Pakistan;\n(d)   to develop programmes for national censuses and surveys in line with policy\npriorities and plan, coordinate, execute and publish them accordingly;\n(e)   to advise the Federal Government on the budget and development plans of the\nBureau, based on annual work plans;\n(f)   to formulate, prescribe and implement principles for conducting official\nstatistics in Pakistan including standardization and harmonization of concepts,\ndefinitions and classifications pertaining to official statistics;\n(g)   to draw up schemes to reduce duplication in the formulation and execution of\nstatistical programmes and to resolve differences in that respect;\n(h)   to regulate statistical activities of national interest and as appropriate to provide\noverall coordination, professional monitoring, evaluation and review of\nstatistics work in Pakistan;\n(i)   to act as a resource base for providing expertise, statistical data including but\nnot limited to, economic, commercial, business and industrial areas and to\nprovide, arrange and facilitate support services in this regard, both nationally\nand internationally;\n(j)   to engage in human resource development of its officers and staff, including\nrevision in pay structure, allowances and facilities and formulate career\nstructures as shall be prescribed by regulations;\n(k)   to promote education and research in the field of statistics;\n(l)   to coordinate, monitor, implement or engage, in conjunction with other\nauthorities, international organizations, in any study or cooperation project or\nforeign aided technical assistance projects in the statistical field;\n(m)   to strive and endeavour to ensure that collection of statistical data to be in\naccordance with practices and standards of the United Nations and other\ninternational bodies for the purpose of fulfilling the international obligations of\nPakistan in the field of statistics;\n(n)   to propose and recommend to the appropriate Government new laws or\namendments in existing laws for the purposes of achieving the objectives of this\nAct;\n(o)   to do all other acts, deeds and things incidental to or ancillary for the\npurposes of achieving the objectives of this Act and undertake any other work\nin relation to collection or compilation of data in accordance with directions of\nthe Federal Government; and\n(p)   to supervise the functioning of the Institute."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Over all superintendence etc. of the B ureau to vest in the G o vern i n g Council",
      "content": "⎯he powers and functions of the Bureau and the general and over all direction, management, control\nand superintendence of the affairs of the Bureau shall vest in the Governing Council and all actions,\ndecisions, guidelines, directions, orders and policies made or issued by the Governing Council in the\nexercise of the said powers and functions shall be sent to the Bureau for compliance and\nimplementation."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Composition of the Governing Council.⎯(1) The Federal Government shall constitute",
      "content": "the Governing Council consisting of at least seven members.\n(2) The Federal Government may also increase or decrease the number of members of the\nGoverning Council and prescribe the qualifications and mode of appointment of such members in\nsuch manner as Government may prescribe.\n(3) of the members, ⎯\n(a)     the following shall be ex-officio members, ⎯\n(i)     Minister for Finance, Revenue, Economic Affairs and Statistics or in his\nabsence the Advisor to the Prime Minister on Finance, Revenue,\nEconomic Affairs and Statistics who shall be the ex-officio Chairman of\nthe Governing Council;\n(ii)    Secretary, Statistics Division;\n(iii)   Chief Statistician of the Bureau; and\n(b)     four members shall be appointed by the Federal Government from private\nsector who shall be eminent professionals of known integrity and competence.\n(4) The Chief Statistician of the Bureau shall act as Secretary of the Governing Council."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Tenure of office.⎯ A member, other than an ex",
      "content": "officio member, shall hold office during\nthe pleasure of the Federal Government for a term of three years and if not earlier resigned or\nremoved, shall be eligible for reappointment for one additional term not exceeding three years."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Powers and functions of the Governing Council.⎯ Without prejudice to the",
      "content": "provisions of section 5, the Governing Council shall⎯\n(a)     be responsible for setting of objectives and policy guidelines of the Bureau in\naccordance with the powers and functions provided in section 4;\n(b)     provide guidance and oversee the management and administrative affairs of the\nBureau;\n(c)    review and approve policies and annual work plans relating to the aims and\nobjectives of the Bureau and prioritize programmes;\n(d)    formulate procedures for allocation and utilization of funds generated or\nacquired through services, donations or grants, etc;\n(e)    approve the annual financial budget of the Bureau and recommend to\nthe Federal Government;\n(f)    approve and make regulations on behalf of the Bureau subject to the provisions\nof section 62;\n(g)    review the performance of committees constituted under section 11; and\n(h)    do or perform such other acts, deeds and things as may be necessary and\nincidental thereto."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Meetings of the Governing Council. ⎯(1) The Governing Council shall meet as often",
      "content": "as may be necessary for the performance of its functions and shall meet atleast quarterly.\n(2) The meetings of the Governing Council may be convened by the Chairman or on request\nof any two members.\n(3) The meetings shall be presided over by the Chairman or, in his absence, by any other\nmember as the Governing Council may determine.\n(4) Three members shall constitute a quorum for a meeting of the Governing Council.\n(5) The decision of the Governing Council shall be taken by the majority of its members\npresent and in case of equality of votes, the person presiding the meeting shall have a casting vote.\n(6) Subject to the provisions of this Act, the procedure and conduct of business of the\nGoverning Council shall be regulated by the regulations made by the Governing Council with the\napproval of the Federal Government.\n(7) A member of the Council may resign from his office by writing under his hand addressed\nto the Federal Government or may be removed by the Federal Government from his office if, on an\ninquiry by the Federal Government, he is found unable to perform the functions of his office because\nof mental or physical disability or misconduct.\n(8) The Governing Council shall prepare and publish an annual report covering its activities\ncarried out during the financial year for submission to the Federal Government which shall lay the same\nbefore the Parliament."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Supplementary provisions. ⎯ All guidelines, decisions and directives of the Governing",
      "content": "Council or the Bureau shall be in writing expressed by resolutions, orders or in such other form as\nmay be appropriate in the circumstances and shall be authenticated in the manner prescribed by the\nregulations."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Committees. ⎯(1) The Governing Council may constitute the management",
      "content": "committee comprising of the Chief Statistician, functional members of the Bureau and any such\nmember(s) as the Council may consider appropriate, to carry out the day-to-day business of the\nBureau and to ensure the performance against work plan and goals of the Bureau.\n(2) The Governing Council may, for the purpose of obtaining advice and carry out any function\nor assignment under this Act, constitute committees consisting of suitable person or persons as\nmembers, as it may deem fit."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Users Councils. ⎯(1) For the whole of Pakistan, the Governing Council and for a",
      "content": "Province the Provincial Statistical Authority may, by notification in the official Gazette, constitute a\nUsers Council to be called the National Users Council and a Provincial Users Council\nrespectively consisting of such members with representation from private sector, including a\nChairperson, as it may appoint.\n(2) The Chairperson and members of the Users Council shall hold office during the pleasure\nof, and on such terms and conditions, as may be determined by the relevant appointing authority\nspecified in subsection (1).\n(3) The Users Council shall regulate its own procedures."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Functions of the Users Council.⎯The following shall be the functions of the Users",
      "content": "Council, namely:⎯\n(a)     to coordinate the policy forum and the functions of the Statistical\nAuthorities and competent authorities and to advise them as to the ways and\nmeans of achieving efficient, adequate and prompt results;\n(b)     to advise on priorities for filling gaps in statistical data and, for that\npurpose, to recommend allocation of functions to the Statistical Authorities;\n(c)     to advise on drawing up schemes for avoiding duplication in the\nformulation and execution of statistical programmes and to resolve differences\nin that respect;\n(d)     to provide advice and guidance to Statistical Authorities; and\n(e)     to perform such other functions as the relevant appointing authority may, from\ntime to time, direct."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. The Chief Statistician. ⎯(1) There shall be a Chief Statistician of the Bureau who",
      "content": "shall be appointed by the Federal Government on such terms and conditions as may be determined\nby the Federal Government and to be notified in the official Gazette. The Chief Statistician shall be\nan ex- officio Secretary to the Federal Government.\n(2) The Chief Statistician, before entering upon office, shall make before the President\nof Pakistan an oath of office and non-disclosure.\n(3) The Chief Statistician, unless he resigns or is removed from office earlier, shall hold office\nfor a period of five years and shall be eligible for reappointment for such term or terms as the Federal\nGovernment may determine, provided that the Chief Statistician shall cease to hold office on attaining\nthe age of sixty-five years or expiry of the tenure whichever is earlier."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Qualifications of the Chief Statistician. ⎯The Chief Statistician shall be a professional",
      "content": "with demonstrated technical knowledge of statistics and management skills. He shall have\nadvanced university degree in a relevant subject such as statistics and economics from a university\nrecognized by the Higher Education Commission of Pakistan or preferably from leading international\nuniversity having minimum twenty years experience with atleast five years in senior management\nposition within an organization of significant size and importance."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Powers and functions of the Chief Statistician. ⎯(1) The Chief Statistician shall be",
      "content": "the chief executive officer of the Bureau and shall perform the following functions, namely: ⎯\n(a)     to advise the appropriate Government and other authorities or persons on\nstatistical programmes at national level;\n(b)     to supervise the administration of this Act under the guidance of the Governing\nCouncil and control operations and staff of the Bureau;\n(c)     to decide in the manner in which data for statistical purposes are collected,\ntransmitted, processed and compiled and published;\n(d)     to supervise the taking of census throughout Pakistan through Provincial\nCensus Commissioners and assign such tasks to them as may be deemed\nnecessary to conduct and supervise the census;\n(e)     to appraise the quality of all statistics at national level;\n(f)     to ensure coordination with all the other statistical agencies, authorities and\nbodies;\n(g)     to ensure a high level of professionalism of the staff of the Bureau through\nensuring a continuous and high quality training programme;\n(h)     to promote, develop and maintain a strong analytical and research capacity\nwithin the Bureau;\n(i)     to review periodically the statistical progress on the basis of reports obtained\nfrom the relevant officers of the Bureau and the statistical agents and duly\ninform the Governing Council;\n(j)     to advise the appropriate Government and other authorities or persons on the\nuse and relevance of available statistics in relation to specific policy issues;\n(k)     to appraise and allocate technical resources for statistical projects;\n(l)    to ask for any information or call for the statistical record from any Federal\nMinistry or Provincial Department, statutory body, corporation or association\npertaining to statistical data subject to the constitutional and legal\nrequirements, for review, if necessary;\n(m)    to delegate all or such powers, duties or functions to member of the staff or\nofficer of the Bureau including census officer for the efficient performance of\nfunctions under this Act;\n(n)    to provide for the welfare or incentives of employees of the Bureau and\ncompensation packages for employees;\n(o)    to prepare annual work plans and five year work plans, progress reports and\nbudgets for the Bureau;\n(p)    to enter into all such negotiations, agreements and contracts and rescind or vary\nall such agreements or contracts, and to execute all such documents and do all\nacts, deeds and things, in the name and on behalf of the Bureau as may\nbe considered necessary, expedient or proper or in relation to any of the matters\naforesaid or otherwise with the approval of the Federal Government;\n(q)    to develop national statistical standards and promote standardization of\nconcepts and definitions conforming to international standards and to ensure\nobservance by Government departments, both Federal and Provincial,\nresearch and statutory bodies; and\n(r)    to employ experts and consultants for the Bureau and lay down such terms and\nconditions of their employment in the regulations and to undertake human\nresource development and restructure and modernize personnel policy and\nreview their performance from time to time, and in such manner as may be\nprescribed in the regulations.\n(2) The Chief Statistician shall comply with such other directions as the Governing Council\nmay give from time to time."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Removal. ⎯The Chief Statistician may resign from his office by writing under his",
      "content": "hand addressed to the Federal Government or may be removed by the Federal Government from his\noffice if, on any inquiry by the Governing Council, he is found unable to perform the functions of his\noffice because of mental or physical disability or misconduct including corruption or dishonesty or\nfound that such person fails to disclose his interest under section 56."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Functional member. ⎯(1) The Federal Government, based on a short list recommended",
      "content": "by the Chief Statistician, may appoint five functional members to assist the Chief Statistician for the\nefficient performance of functions of the Bureau, on such terms and conditions as may be prescribed\nby the Federal Government.\n(2) A functional member shall be a professional with demonstrated technical knowledge\nof relevant field. He shall have advanced university degree in a relevant subject from a university\nrecognized by the Higher Education Commission of Pakistan or preferably from leading international\nuniversity having minimum fifteen years experience with atleast five years in senior management\nposition within an organization of significant size and importance.\n(3) A functional member shall, other than an ex-officio member, unless he resigns or is\nremoved from office earlier, hold office for a period of four years and shall be eligible for\nreappointment for such term or terms as the Federal Government may determine, provided that the\nmember shall cease to hold office on attaining the age of sixty-five years or the expiry of the term\nwhichever is earlier.\n(4) A member shall exercise such powers and perform such functions as may be assigned to\nhim as shall be prescribed by rules.\n(5) A member may resign from his office by writing under his hand addressed to the Federal\nGovernment or may be removed from his office by the Federal Government if, on an inquiry by the\nGoverning Council, he is found unable to perform the functions of his office because of mental or\nphysical disability or misconduct including corruption or dishonesty or found that such person fails to\ndisclose his interest under section 56."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Statistical authorities. ⎯The Federal Government shall, by notification in the",
      "content": "official Gazette, appoint the Chief Statistician as the Federal Statistical Authority to oversee,\ncoordinate, monitor and assess independently all official statistics and the statistical system in the\ncountry and the Provincial Governments shall appoint, by notification in the official Gazette, a\nProvincial Statistical Authority, for carrying out the purposes of this Act and to supervise statistical\nactivities."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Functions of Provincial Statistical Authority. ⎯A Provincial Statistical Authority",
      "content": "shall, in accordance with such directions as the appropriate Government may, from time to\ntime issue, perform the following functions, namely:—\n(a)     to collect, compile, analyse, publish and disseminate statistical data relating\nto the provincial subjects in the Province;\n(b)     drawing up specific statistical programmes to carry out the instructions of\nthe Users Council;\n(c)     appraising the quality of the statistics in the Province;\n(d)     laying down and approving the questionnaires and procedures for statistical\nenquiries conducted by the Province in accordance with the provisions of this\nAct and ensuring against any duplication and sub-standard data collection;\n(e)     adopting the standards provided by the Bureau and ensuring harmonization at\nFederal and Provincial level;\n(f)     giving advice and guidance to and coordinating the functions of the relevant\nofficers of the Bureau and the Statistical Agents appointed in the Province;\n(g)     making recommendations to the appropriate Government and Users Council\nrelating to the standards of training of statisticians and statistical agents;\n(h)     laying down procedure for a continuing programme of in-service institutional\nand foreign training;\n(i)    periodically reviewing statistical progress;\n(j)     giving advice to the appropriate Government and other authorities or persons\non the use and relevance of available statistics in relation to specific problems\nof economic policy;\n(k)     identifying gaps in the provincial statistical series and developing prioritized\nproposals for filling these gaps;\n(l)     appraising and allocating technical resources required for statistical projects\ncarried out by the Province; and\n(m)     to perform such other functions as the appropriate Government may, from time\nto time, direct."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Competent authority. ⎯(1) The Statistical Authority may, for the purpose of collection",
      "content": "and compilation of statistics on any matter, appoint any authority, body corporate or officer or entity\nto be a competent authority for the purpose of this Act.\n(2) In the exercise of its powers and performance of its functions under this Act, a\ncompetent authority shall be subject to the superintendence, direction and control of the Statistical\nAuthority."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Statistical agents. ⎯(1) The Statistical Authority for the purpose of collection of statistics",
      "content": "or information under this Act, appoint or engage such officers or persons or body corporate or entity\nto be statistical agent as it may think fit.\n(2) A statistical agent shall perform such other functions as may be assigned to him by"
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Formulation of questionnaire. ⎯(1) For the purpose of collecting statistics on any",
      "content": "matter, the Statistical Authority shall declare in the official Gazette that information shall be collected\non a particular matter and formulate such questionnaire as it may think fit.\n(2) A competent authority or a statistical agent may require any person within its jurisdiction\nto give answers to such questionnaire and to such other questions relevant thereto as may be necessary\nto elicit full answers to the questionnaire.\n(3) Any person who is required to give answers to a questionnaire and other relevant question\nunder sub-section (1) shall give answers to the best of his knowledge and belief.\n(4) Nothing in this section shall authorize the Statistical Authority, the competent authority or\nthe statistical agent⎯\n(a)     to require a woman to state the name of her husband or deceased husband or\nany other person whose name is by custom forbidden to mention; or\n(b)     to insist on information of a purely private nature."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Power to call forreturnsand information. ⎯(1) A competent authority may, for",
      "content": "or otherwise, a notice requiring him to furnish to such authority or person in such manner, at such\ntime or intervals including replies to inquiries and supplementary information, and in such form and\nwith such particulars, such information or returns as may be prescribed, and a person served with such\nnotice shall accordingly furnish information or returns required thereby.\n(2) A census officer may, during the time of the taking of the census, within the local limits of\nhis jurisdiction leave a prescribed schedule at any dwelling house including any commercial, industrial\nor other premises or with the manager or officer of any commercial or industrial establishment or\ntrading concerned, or occupier of such house, for the purpose of its being filled up with respect to\nsuch particulars regarding the inmates of such house or part or the persons employed, as may be\nspecified in the schedule and the occupier, manager or officer concerned shall fill up or cause it to be\nfilled up as required to the best of his knowledge or belief, sign his name thereto and deliver it to the\ncensus officer or to such person as the census officer may direct."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Right to access record or document. ⎯(l) An authorized person shall, for the purpose",
      "content": "of collection of statistics under this Act, have access to any relevant record or document in\nthe possession of any person required to furnish information or return under section 24 and may, at\nany reasonable time after due notice, enter any premises, house, vessel, lands or other place wherein\nhe believes such record or document to be kept and inspect or take copies of relevant records or\ndocuments and ask any question necessary for obtaining any information required to be furnished by\nsuch person.\n(2) Every person in possession of or having custody or charge of relevant record or\ndocument, that are maintained in any Government department, business or in any office, public or\nprivate, from which information is sought, shall⎯\n(a)     grant access for the purposes of collection of statistics or census under this Act;\n(b)     supply information to the statistical agent relating to any matter under this Act;\nand\n(c)     allow the statistical agent to paint on, affix to or dig in the premises, house,\nvessel or lands such letters, marks or objects as may be necessary for the said\npurpose."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Dissemination of statistical data. ⎯(l) Any statistical data collected by the Statistical",
      "content": "Authority shall be in accordance with the provisions of this Act and, after ascertaining its quality for\naccuracy and ensuring confidentiality as set out in section 28, shall be released for general\ndissemination.\n(2) The Bureau shall ensure timely publication of data collected, to take reasonable steps\nto ensure public access to official statistics, to public information on what statistics are available\nand how that can be obtained by the users.\n(3) No user may have access to the data or statistics collected by the Bureau before release of\nits report with exception for special research, approval of which may be made at the level of Federal\nStatistical Authority."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Act not to authorize collection of certain information or statistics.⎯ Nothing in",
      "content": "this Act shall authorize the collection of statistics or of any information relating to any work of\ndefence, arsenal, naval, military or air force establishment or any other defence factory, installation or\nestablishment."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Secrecy of answers, information and returns. ⎯(l) All answers to the questions",
      "content": "received and all information and returns furnished under this Act shall be confidential and shall not\nbe⎯\n(a)     used for any purpose other than compilation of statistics under this Act;\n(b)     published in a form which may disclose the state of affairs of any particular\nindividual, firm or institution;\n(c)     divulged or furnishing the information or return, to any person not connected\nofficially with the enquiry in relation to which the said answers, information or\nreturns have been called for;\n(d)     accessible to the inspection of any person; or\n(e)     disclosed to any person, or used, notwithstanding anything contained in the\nQanun-e- Shahadat, 1984 (P.O. 10 of 1984), or be admissible in evidence in\nany proceedings to which the person giving the answer of furnishing the\ninformation or return is a party, except for the purpose of prosecution for\ncontravention of the provisions of this Act.\n(2) Notwithstanding the provisions of subsection (1), unit records may be released provided\nno individual or company can be identified and shall be used for genuine research purposes and such\nresearch findings thereafter shall acknowledge and made available to the Statistical Authority."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Permitted disclosure. ⎯The disclosure of information is authorized to be used if",
      "content": "such information has been made public through any authorized means or prior written consent\nof the person answering the questions has been duly obtained."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Joint collections. ⎯(1) The Statistical Authority may undertake a joint collection of",
      "content": "statistical information and shall enter in a contract with another Government department or\nauthority or statutory body where the relevant authority is duly authorized to collect such information,\nand the information collected shall be shared between the agreeing parties.\n(2) Any employee of any Government department or authority or statutory body engaged\nin a joint collection shall be bound by the provisions of secrecy and confidentiality under section 28.\nPOPULATION, AGRICULTURE AND OTHER CENSUSES"
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Population census. ⎯The Federal Government may, from time to time, by notification",
      "content": "in the official Gazette, declare that a census of population and housing conditions of Pakistan shall be\ntaken by the Bureau during such period as may be specified therein."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Census officers. ⎯(l) The Federal Government may⎯",
      "content": "(a)     designate the Chief Statistician as the Chief Census Commissioner to supervise\nthe taking of census throughout Pakistan;\n(b)     appoint the Provincial Census Commissioner to supervise the taking of census\nwithin a Province; and\n(c)     appoint the census officers to take, aid in or supervise the taking of census\nwithin any specified area.\n(2) The Chief Census Commissioner may, by order, delegate the powers conferred upon\nhim under clause (a) of sub-section (1) to such officer or authority as may be specified in the order.\n(3) A declaration in writing signed by any authority authorized in this behalf by the Chief\nCensus Commissioner that any person has been duly appointed a census officer shall be conclusive\nproof of such appointment."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Discharge of duties of census officers in certain cases. ⎯(1) If a District Magistrate",
      "content": "or District Coordination Officer, as the case may be, or any authority authorized in this behalf by\nthe appropriate Government, by an order in writing so directs,⎯\n(a)     every officer in command of any body of persons belonging to naval, military\nor air force of Pakistan or of any vessel of war;\n(b)     every person, other than a pilot or harbour-master, having charge or control of a\nvessel;\n(c)     every person in charge of a lunatic asylum, hospital, work-house, prison,\nreformatory or lock-up or of any public, charitable, religious or educational\ninstitutions;\n(d)     every keeper, owner, secretary or manager of any sarai, hotel, boarding-house,\nlodging-house, immigration depot or club;\n(e)     every manager or officer of a railway or any commercial or industrial\nestablishment or trading concern; and\n(f)     every occupant of immovable property wherein persons are living at the time\nof taking census,\nshall, in relation to the persons who, at the time of the taking of the census, are under his command or\ncharge, or are inmates of his sarai, hotel, house, depot or club, or are employed under him, or are present\non or in such immovable property, perform such duties of a census officer as may be required by such\norder.\n(2) The provisions of this Act relating to a census officer shall, mutatis mutandis, apply\nto a person performing the duties of a census officer in pursuance of an order under sub-section (1)."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Power to call upon certain persons to give assistance. ⎯A census officer appointed",
      "content": "under sub-section (1) of section 32 may, by order in writing, call upon-\n(a)     owners and occupiers of land, farmers, tenure holders and assignees of land\nrevenue or their agents;\n(b)     members of local councils and other local authorities and officers;\n(c)     school teachers, government servants and literate persons of good repute\nfor the time being residing in the area concerned; and\n(d)     to work as enumerators or give such assistance as may be specified in the\norder towards the taking of census of persons who and of houses which are, at\nthe time of taking census, on the lands of such owners, occupiers of land,\nfarmers, tenure holders and assignees, or within the areas which such members\nrepresent or for which local authorities are established, or, as the case may be,\nin which such teachers, government servants and literate persons are\nthemselves residing, and the persons to whom an order under this section is\ndirected shall be bound to comply the same and shall be deemed to be bound by\nthe provisions of secrecy and confidentiality under section 28."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Grant of statistical abstracts. ⎯The Chief Census Commissioner, the Provincial",
      "content": "Census Commissioner or an authority authorized in this behalf by the Federal Government may,\nat the request of any local council or local authority or person, cause abstracts to be prepared and\nsupplied containing such statistical information as can be derived from the census returns being\ninformation which is not contained in any published reports and which, in the opinion of\nthe Chief Census Commissioner, the Provincial Census Commissioner or an authority authorized,\nsuch local council or local authority or person may reasonably require."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Local councils and other local authorities to take census. ⎯ Notwithstanding",
      "content": "anything contained in any other law for the time being in force, a local council or other local authority\nshall, in consultation with the Provincial Census Commissioner or other officer authorized in this behalf\nby the Federal Government, cause, during the period, the census of the area within the jurisdiction of\na local council or other local authority to be taken wholly or in part in the manner authorized or\nrequired by or under this Act."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Agriculture census. ⎯The Federal Government may, from time to time, by notification",
      "content": "in the official Gazette declare that information shall be collected on or with respect to the following\nmatters, namely: ⎯\n(a)    land ownership and land tenure;\n(b)    land unit and sub-division of land;\n(c)    land utilization;\n(d)    crop acreage and production;\n(e)    livestock, poultry and fishery products;\n(f)    employment in agriculture;\n(g)    agricultural population;\n(h)    agricultural power and machinery;\n(i)    irrigation and drainage;\n(j)    fertilizers and soil dressing;\n(k)    wood and forests;\n(l)    agricultural credit;\n(m)    agriculture and sericulture;\n(n)    fruit and vegetable products; and\n(o)    such other matters as the Federal Government may, by notification in the\nofficial Gazette, specify."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Crop",
      "content": "cutting experiment. ⎯(1) For the purpose of collecting information referred\nto in section 37, crop-cutting experiments may be conducted and for such experiments any land\nin any area may be selected.\n(2) The owner of the crop shall be entitled to such compensation for any loss or damage caused\nto him by the conduct of crop-cutting experiment as is not less than such loss or damage and the\nassessment of the loss or damage shall be carried out in such manner as the Governing Council may\nprescribe under regulations."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Other censuses. ⎯The Federal Government may, by notification in the official Gazette,",
      "content": "direct the Bureau to collect, compile, analyse information and publish censuses in respect of census\nof manufacturing industries or economic census or other censuses it may consider necessary from\ntime to time and thereupon the provisions of this Act shall, mutatis mutandis, apply in relation to\nsuch censuses.\nFINANCE, AUDIT AND ACCOUNTS"
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Establishment of Statistics Fund. ⎯(1) There is hereby established, for the purposes",
      "content": "of this Act, a Fund to be called Statistics Fund which shall be administered and controlled by the\nBureau to meet costs and charges incurred in connection with its functions under this Act.\n(2) The Statistics Fund shall consist of⎯\n(a)     such sums as the Federal Government or a Provincial Government may, from\ntime to time, grant for the purposes of meeting any of its obligations or\ndischarging any of its duties;\n(b)     loans, aid, grants and donations from the national or international agencies;\n(c)     income from investments as provided under section 42;\n(d)     receipts from sale of publications, databases, statistical series, other products\nand services provided by Bureau; and\n(e)     all other sums or property which may in any manner become payable to or\nvested in the Bureau in respect of any matter incidental to the exercise of its\nfunctions and powers.\n(3) The Statistics Fund shall be managed and operated by the Chief Statistician."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Expenditure. ⎯(1) The Statistics Fund shall be expended for the purpose of⎯",
      "content": "(a)     paying any expenditure lawfully incurred by the Bureau;\n(b)     paying any other expenses, costs or expenditure properly incurred or accepted\nby the Bureau in the performance of its functions or the exercise of its powers\nunder this Act; and\n(c)     repaying any moneys borrowed under this Act and the profit, return, mark-up\nor interest due thereon howsoever called.\n(2) The Bureau shall, in respect of each financial year, submit for approval to the Federal\nGovernment, on such date as may be prescribed, a statement of the estimated receipts and\nexpenditure, including requirements of foreign exchange for the next financial year."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Investments. ⎯The Bureau may insofar as moneys available in the Statistics Fund are",
      "content": "not required to be expended under this Act, make such investments as it may determine from time\nto time, in accordance with policies formulated by the Federal Government."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Bank accounts. ⎯The Bureau may, with the approval of the Governing Council, open",
      "content": "and maintain accounts in rupees or in any foreign currency at such scheduled bank as it may from time\nto time determine in accordance with instructions of the Finance Division."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Audit and accounts. ⎯(1) The accounts of the Bureau shall be maintained in such",
      "content": "manner as Finance Division, in consultation with the Controller General of Accounts, determine.\n(2) The Auditor-General of Pakistan shall conduct audit of the accounts of the Bureau.\n(3) A copy of the audit report shall be sent to the Federal Government, along with the\ncomments of the Bureau."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Annual report. ⎯(1) The Bureau shall prepare and publish an annual report covering",
      "content": "its performance during the financial year for submission to the Federal Government which shall lay\nthe same before the Parliament.\n(2) The annual report shall include⎯\n(a)    activities of the Bureau during the financial year;\n(b)    an outline of programmes for the year ahead;\n(c)    a short financial statement of the preceding year;\n(d)    an audited balance sheet;\n(e)    an audited statement of income and expenditure; and\n(f)    any other matter which the Federal Government may direct or the Bureau\nmay consider appropriate."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Penalties. ⎯If any person⎯",
      "content": "(a)    required to furnish any information or return to an authorized officer of the\nBureau,⎯\n(i)     wilfully refuses or without lawful excuse neglects to furnish such\ninformation or return as may be required under this Act;\n(ii)    wilfully furnishes or causes to be furnished any information or\nreturn which he knows to be false or misleading;\n(iii)   refuses to answer or wilfully gives false answer to any question\nnecessary for obtaining any information required to be furnished under\nthis Act;\n(b)    obstructs on access to relevant records or documents or entry to any premises\nauthorized under section 25;\n(c)     who removes, obliterates, alters or damages without proper authority or\nbefore the completion of agriculture census or population census any letters,\nmark or objects which have been painted, affixed or dug for the purposes of\nthe agricultural census, population census or any other census;\n(d)     who otherwise in any way wilfully obstructs or seeks to obstruct any person\nemployed in the execution of any duty under this Act, shall for such offence be\npunishable with fine which may extend to fifty thousand rupees and in the case\nof continuing offence to a further fine which may extend to two hundred rupees\nfor each day during which the offence continues or with imprisonment for a\nterm not exceeding six months or with both."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Offences by companies. ⎯(1) If the person guilty of an offence under section 46",
      "content": "is a company, every person who at the time the offence was committed was in charge of and was\nresponsible for the conduct of the business of the company, shall be deemed to be guilty of the\noffence and shall be punishable with fine which may extend up to five hundred thousand rupees and\nin the case of continuing offence to a further fine which may extend to twenty-five thousand rupees\nfor each day during which the offence continues:\nProvided that nothing contained in this section shall render any such person liable to\nany punishment provided in this Act if he proves that the offence was committed without his\nknowledge or that he exercised all due diligence to prevent the commission of such offence.\n(2) A certificate under the hand of the Federal Statistical Authority or the Provincial Statistical\nAuthority stating that such return has not been furnished or the contents are incorrect, shall be prima\nfacie evidence of the facts stated in the certificate."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Desertion, impersonation or improper disclosure. ⎯Every person who⎯",
      "content": "(a)     deserts from his duty;\n(b)     impersonates as census officer or a statistical agent and seeks to obtain\ninformation which that person is not duly authorized to obtain; or\n(c)     discloses or knowingly cause to be disclosed or divulges directly or\nindirectly, any information obtained under this Act to any person not entitled\nunder this Act to receive the same,\nshall be punishable for such offence with imprisonment for a term which may extend to six months or\nwith fine which may extend to twenty-five thousand rupees."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Refusal to perform duties as census officer. ⎯Whoever refuses or neglects to",
      "content": "discharge the duties which he is directed under subsection (1) of section 33 to discharge shall be\ndeemed to have committed an offence under section 187 of the Pakistan Penal Code, 1860 (Act XLV\nof 1860)."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Falsification of return. ⎯Where an authorized officer duly appointed to collect",
      "content": "statistical data under the provisions of this Act refuses to perform his duties or willfully and\ndishonestly falsifies or alters information in a return without the presence of the respondent, or\nintentionally contravenes the rules made under section 61 shall be liable to disciplinary action under\nExplanation.—For the purpose of this section the expression “respondent” means any person,\ninstitution, company or establishment required to submit return or furnish information as required\nunder this Act."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Mode of recovery. ⎯Any sum payable to the Bureau under this Act shall be Mode",
      "content": "of recoverable as an arrear of land revenue."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Cognizance of offences",
      "content": "(1) No court shall take cognizance of any offence under this\nAct except upon a complaint in writing by an officer authorized by the Governing Council, the\nFederal Statistical Authority or the Provincial Statistical Authority, as the case may be.\n(2) No court inferior to that of Magistrate of first class shall try an offence under this Act.\n(3) The offences under this Act, shall be tried summarily in accordance with the provisions\nof Chapter XXII of the Code of Criminal Procedure, 1898 (Act V of 1898).\n(4) Notwithstanding anything contained in section 32 of the Code of Criminal Procedure,\n1898 (Act V of 1898), it shall be lawful for any Magistrate of the first class to pass any sentence\nauthorized by this Act."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Appeal against the orders of Federal Statistical Authority and the Provincial",
      "content": "Statistical Authorities. —(1) Appeal against the orders of Federal Statistical Authority shall lie to\nthe Secretary, Statistics Division while appeal against the orders of Provincial Statistical Authorities\nshall lie to the Chairman, Planning and Development Board or such authority as the Provincial\nGovernment may, by notification in official Gazette, specify.\n(2) An appeal under sub-section (1) shall be proposed within thirty days of order by the\nFederal Statistical Authority or the Provincial Statistical Authority, as the case may be."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Officer and employees to be public servants. ⎯The Chief Statistician, functional",
      "content": "members, all employees of the Bureau and other persons authorized to perform or exercise any\nfunction or power under this Act or rendering services to the Bureau as consultant or adviser, shall\nbe deemed to be public servants within the meaning of section 21 of the Pakistan Penal Code, 1860\n(Act XLV of 1860)"
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Certain employees to be civil servants. ⎯Subject to sub",
      "content": "section (5) of section 60, the\ncivil servants working in the Bureau at the time of commencement of this Act or transferred from\nFederal Bureau of Statistics, Agricultural Census Organization, Population Census Organization\nand the Technical Wing of Statistics Division subject to subsections (1) and (4) of section 60, shall\nbe governed by the Civil Servants Act, 1973 (LXXI of 1973) and rules made thereunder and shall\ncontinue of in service on the same terms and conditions as determined under 1973, the Civil Servants\nAct, 1973 (LXXI of 1973) including remuneration, tenure of service, rights and privileges as to\npension and gratuity and other matters which were applicable to them immediately prior to the of\ncommencement of this Act."
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. Disclosure of interest. ⎯Where a member or staff or other employee of the Bureau,",
      "content": "including an advisor or consultant or any officer exercising powers under this Act, has a direct or\nindirect interest in any matter relating to the business of the Bureau, such person shall forthwith\ndisclose that interest to the Bureau and the Bureau shall have the right to take such action as it\nconsiders appropriate."
    },
    {
      "provision_ref": "sec57",
      "section": "57",
      "title": "Section 57. Delegation of powers, duties and functions. ⎯The Governing Council may, subject",
      "content": "to such conditions and limitations as it may deem fit to impose, delegate all or such powers,\nduties or functions to the Chairman, the Chief Statistician, a member, a committee or an officer, as it\nmay deem fit for the efficient performance of functions of the Bureau."
    },
    {
      "provision_ref": "sec58",
      "section": "58",
      "title": "Section 58. Indemnity. ⎯No suit, prosecution or other legal proceeding shall lie against the Bureau",
      "content": "or any person acting under the Bureau for anything which is in good faith done or intended to be\ndone in pursuance of this Act or any rules or regulations made there under."
    },
    {
      "provision_ref": "sec59",
      "section": "59",
      "title": "Section 59. Power of Bureau to issue directions. ⎯Notwithstanding anything contained in any",
      "content": "other law for the time being in force, which provides for the collection of statistics, the Bureau may\nissue to any other authority functioning under any such law such directions as it may consider\nnecessary for the purpose of this Act."
    },
    {
      "provision_ref": "sec60",
      "section": "60",
      "title": "Section 60. Merger of existing organizations",
      "content": "(1) The Federal Bureau of Statistics, the\nAgricultural Census Organization, the Population Census Organization and the Technical Wing of\nStatistics Division shall stand merged in the Bureau on the commencement of this Act.\n(2) All instruments of whatever kind subsisting, owed or incurred by the Federal Bureau of\nStatistics, the Agricultural Census Organization, the Population Census Organization and the\nTechnical Wing of Statistics Division or to which these organizations may have been a party or which\nrelate or connected with these organizations shall remain in force and effect against the Bureau as\nthey were before the commencement of this Act against the Federal Bureau of Statistics, the\nAgricultural Census Organization, the Population Census Organization and the Technical Wing of\nStatistics Division.\n(3) All legal proceedings of whatever nature by or against or relating to the Federal Bureau\nof Statistics, the Agricultural Census Organization the Population Census Organization and the\ntechnical wing of Statistics Division which shall be pending on the commencement of this Act, in\nany court, tribunal or other authority shall be continued, prosecuted and in force in the same manner\nand to the same extent, as they would have been continued, prosecuted or enforced by and against\nthe same shall not abate, be discontinued or in any way prejudiced or affected by the provisions of this\nAct.\n(4) Subject to section 55 and notwithstanding anything contained in any other law,\nrules, regulations, contract, agreement or in the terms and conditions of their services, on the\nestablishment of the Bureau, all persons appointed or reemployed in the Federal Bureau of Statistics,\nPopulation Census Organization, Agricultural Census Organization and the Technical Wing of Statistics\nDivision, subject to sub-section (1), immediately before the establishment of the Bureau and other\nofficers and employees whether recruited initially or absorbed, or inducted, subsequently, including the\npersons on deputation of any other organization, department, agency or formation in Pakistan or\nabroad but not being person on deputation or secondment to Federal Bureau of Statistics,\nPopulation Census Organization, Agricultural Census Organization and the Technical Wing of\nStatistics Division from any other organization, department, agency or formation shall stand\ntransferred to and become employees of the Bureau and shall be governed by the Civil Servants Act,\n1973 (LXXI of 1973), for their terms and conditions including remuneration, tenure of service, rights\nand privileges as to of pension and gratuity and other matters which were applicable to them\nimmediately prior to the establishment of the Bureau.\n(5) Every person referred to in sub-section (4) shall have the right to opt to work in the Bureau\nas civil servant or under the new rules or regulations of the Bureau to be finalized soon after the\nestablishment of the Bureau. The option to be made in writing once exercised shall be final."
    },
    {
      "provision_ref": "sec61",
      "section": "61",
      "title": "Section 61. Powers to make rules",
      "content": "(1) The appropriate Government may, by notification in the\nofficial Gazette, make rules for carrying out the purposes of this Act.\n(2) Without prejudice to the foregoing powers, the Federal Government may make rules on\ncode of conduct for Chief Statistician and authorized officers, appointed by the Bureau under"
    },
    {
      "provision_ref": "sec62",
      "section": "62",
      "title": "Section 62. Powers to make regulations",
      "content": "The Bureau may, with the prior approval of the\nFederal Government, by notification in the official Gazette, make regulations not inconsistent with this\nAct or the rules made thereunder to carry out the purposes of this Act."
    },
    {
      "provision_ref": "sec63",
      "section": "63",
      "title": "Section 63. Repeal",
      "content": "The General Statistics Act, 1975 (LXIX of 1975), the Agricultural Census Act,\n1958 (XLI of 1958) and the Census Ordinance, 1959 (X of 1959) are hereby repealed.\n___________\nRI - Date: 14-05-2024"
    }
  ],
  "definitions": [
    {
      "term": "Bureau",
      "definition": "the Pakistan Bureau of Statistics established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "census",
      "definition": "population and housing census under section 31, agriculture census under section 37 and other censuses under section 39;",
      "source_provision": "sec2"
    },
    {
      "term": "census officer",
      "definition": "any person appointed under section 32;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Governing Council appointed under section 6;",
      "source_provision": "sec2"
    },
    {
      "term": "Chief Statistician",
      "definition": "the Chief Statistician of the Bureau appointed under section 14;",
      "source_provision": "sec2"
    },
    {
      "term": "company",
      "definition": "any legal entity registered as such under the Companies Ordinance 1984 (XLVII of 1984), including association of persons, registered partnership, corporation, statutory body, trust, society or any other legal entity;",
      "source_provision": "sec2"
    },
    {
      "term": "competent authority",
      "definition": "an authority or officer appointed as such by an appropriate Government under section 21;",
      "source_provision": "sec2"
    },
    {
      "term": "functional member",
      "definition": "a professional appointed under section 18;",
      "source_provision": "sec2"
    },
    {
      "term": "Governing Council",
      "definition": "the Council constituted under section 6;",
      "source_provision": "sec2"
    },
    {
      "term": "house",
      "definition": "a building, tent, vessel or abode used as human dwelling;",
      "source_provision": "sec2"
    },
    {
      "term": "Institute",
      "definition": "the Statistics Training and Research Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "local council",
      "definition": "a local council constituted under any law relating to local government and includes a Cantonment Board constituted under the Cantonments Act, 1924 (II of 1924);",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of the Governing Council;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules and regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Provincial Census Commissioner",
      "definition": "a person or authority appointed by the Federal Government to conduct and supervise the census in a Province;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "the regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "the rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "statistical agent",
      "definition": "any agency, authority or officer appointed for, or engaged in, the collection of statistics under section 22;",
      "source_provision": "sec2"
    },
    {
      "term": "Statistical Authority",
      "definition": "the Federal Statistical Authority or a Provincial Statistical Authority appointed under section 19;",
      "source_provision": "sec2"
    },
    {
      "term": "Statistics Fund",
      "definition": "the fund established under section 40; and",
      "source_provision": "sec2"
    },
    {
      "term": "Users Council",
      "definition": "the National Users Council and Provincial Users Councils constituted under section 12.",
      "source_provision": "sec2"
    }
  ]
}
