{
  "id": "pk-geneva-convention-implementing-act-1936",
  "type": "statute",
  "title": "Geneva Convention Implementing Act, 1936",
  "title_en": "Geneva Convention Implementing Act, 1936",
  "short_name": "GCIA",
  "status": "in_force",
  "issued_date": "1936-10-26",
  "in_force_date": "1936-10-26",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-b56c-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Geneva Convention Implementing Act, 1936 (XIV of 1936) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent",
      "content": "(1) This Act may be called the Geneva Convention Implementing\nAct, 1936.\n2\n[(2) It extends to the whole of Pakistan.]\n[2. Prohibition of use of emblems “Red Cross”, “Red Crescent”, etc.— No person other\n3\nthan a person entitled thereto under the Geneva Convention shall use, or in any manner exhibit,\nwhether for the purpose of trade or business or for any other purpose or object whatsoever, the\nemblem or the designation “Red Cross”, “Red Crescent”, “Red Lion and Sun” or “Sun” or any sign\nof designation constituting an imitation thereof, irrespective of the date of the adoption of any such\nemblems or designation by such person:\nProvided that the emblem “Red Cross” may, with the permission in writing of the Society, be\nused in time of peace to identify vehicles used as ambulances or to mark the position of aid stations\nset up exclusively for giving free medical treatment to the wounded or sick.\nExplanation.__ In this section,—\n(i)        “Geneva Convention” means the Geneva Convention for the Amelioration of\nthe Condition of the Wounded and Sick in Armed Forces in the Field, dated\nthe twelfth day of August, 1949 ; and\n*This Act has been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950, (G. G. O. 3 of 1950); and applied in the\nFederated Areas of Baluchistan, see Gazette of India, 1937, Pt. I, p. 1499.\n1\nIns. and subs. by Act No. III of 1954, s. 2 (with effect from the 7th Apri1,1955).\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960) s. 3 and 2nd Sch., (with effect from the 14th October,\n1955).\n3\nSubs. by Act No. XXI of 1963, s. 2.\n[(ii) “the Society” means the Pakistan Red Crescent Society constituted under the Pakistan\n1\nRed Crescent Society Act.]]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Prohibition of use of emblem of white cross on red ground or imitations thereof. No",
      "content": "person shall use for the purposes of his trade or business the heraldic emblem of the white cross on a\nred ground, being the federal colours of Switzerland, or any sign constituting a colourable imitation\nof that heraldic emblem."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Penalty. Any person contravening the provisions of section 2 or section 3 shall be",
      "content": "punishable with fine which may extend to fifty rupees, and when such contravention is committed by\na company, association or body of individuals, then, without prejudice to the liability of such\ncompany, association or body, every member thereof who is knowingly a party to the contravention\nshall be liable to the like penalty."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Previous sanction for prosecution. No criminal Court shall take cognizance of any",
      "content": "offence punishable under this Act except with the previous sanction of the 2[Federal Government] 3[*\n* *]."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. 4[Omitted]",
      "content": "______________________________\nDate: 08-05-2024\n1\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s.3 and Sch. II, for clause (ii).\n2\nSubs. by F.A.O., 1975 (P.O. No. 4 of 1975), Art. 2 and Table, for \"Central Government\".\n3\nOmitted by A.O., 1937.\n4\nOmitted by Act No. III of 1954, s. 4 (with effect from the 7th April, 1955)."
    }
  ],
  "definitions": []
}
