{
  "id": "pk-geographical-indications-registration-and-protection-act-2020",
  "type": "statute",
  "title": "Geographical Indications (Registration and Protection) Act, 2020",
  "title_en": "Geographical Indications (Registration and Protection) Act, 2020",
  "short_name": "GIAPA",
  "status": "in_force",
  "issued_date": "2020-03-26",
  "in_force_date": "2020-03-26",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NpaZ1j-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Geographical Indications (Registration and Protection) Act, 2020 (XVIII of 2020) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.―(1) The Act may be called the Geographical",
      "content": "Indications (Registration and Protection) Act, 2020.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force on such date as the Federal Government may by notification in\nthe Official Gazette appoint."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. (1) In this Act, unless there is anything repugnant in the subject or context;",
      "content": "(i)     “Applicant” means a natural or legal person. government organization or\nstatutory body, association, or group of producers, or producer organization,\nor operator having an interest in the registration;\n(ii)    “authorized user” means authorized user of a geographical indication\nregistered under this Act;\n(iii)   “book of specifications” means a document elaborated by the applicant,\nspecifying the geographical area of goods, production standards or product\nspecifications, and qualification process for Geographical Indication goods;\n(iv)     “certification body” means an organization issuing a certificate of\nconformity with the book of specifications;\n(v)      “deceptively similar” means a geographical indication which so nearly\nresembles to another geographical indication so as to be likely to deceive or\ncause confusion;\n(vi)     “Director General” means Director General, Intellectual Property\nOrganization of Pakistan appointed under section 12 of the Intellectual.\nProperty Organization of Pakistan Act, 201 2 (XXII of 2012);\n(vii)    “geographical indication” or GI in relation to goods includes an indication\nwhich identifies such goods as agricultural goods, natural goods or\nmanufactured goods originating or manufactured or produced in a territory or\na region or locality as determined by the country, where a given quality,\nreputation or other characteristics of the goods or the ingredients or\ncomponents, is essentially attributable to its geographical origin and in the\ncase of manufactured goods one of the activities of either the production or\nprocessing or preparation of the goods concerned takes place in such territory,\nregion or locality as the case may be. For the purpose of this clause any name\nwhich is not the name of a territory or a region a locality or a country shall\nalso be considered as a geographical indication if such name refers to or\nindicates origin of goods within or from a specific geographical area within\nthat country and is used upon or in relation to particular goods originating\nfrom or with in that country or a territory or a region or locality within that\ncountry;\n(viii)   “geographical origin” means an area of a country, region, locality and shall\nalso include the sea, lake, river, island, mountain or any other area of a similar\nnature;\n(ix)     “foreign geographical indication” means a geographical indication that\nidentifies a product as originating in a country other than Islamic Republic of\nPakistan;\n(x)      “generic name or indication” means a name which, may correspond to the\nname of a territory, region or locality, does not have in Pakistan any meaning\nas an indication or reference of geographical origin and has become a\ncommonly used name for the goods in question;\n(xi)     “goods” include any agricultural, horticulture, natural, raw or manufactured\ngoods or goods of any industry or handicraft or any food or drink product,\nwhether in a processed or semi-processed or semi-finished form;\n(xii)    “indication” includes any words, letters or numerals, geographical name or\nother name, device or any figurative representation, label or any combination\nthereof indicating or referring or suggesting or conveying the geographical\norigin of the goods to which it is applied;\n(xiii) ''IPO-Pakistan” means the Intellectual Property Organization of Pakistan,\nestablished under the Intellectual Property Organization of Pakistan Act, 2012\n(XXII of 2012);\n(xiv)   “limitation” with its grammatical variations means any limitation of the right\nto use of geographical indication given by registration to a registrant or an\nauthorized user thereof including limitations of that right as to mode of use, as\nto use in relation to goods to be sold or otherwise traded within Pakistan or as\nto use in relation to goods to be exported outside Pakistan;\n(xv)    “name” includes any abbreviation of a name;\n(xvi)   “operator” means a natural or legal person involved in the collection,\ntransformation, processing, trading, or distribution of geographical indication\ngoods;\n(xvii) “organization” means any entity, body, department, authority or organization\nso designated by the Division concerned;\n(xviii) “Pakistan geographical indication” means a geographical indication that\nidentifies a product as originating in the Islamic Republic of Pakistan;\n(xix)   “Paris Convention” means the Paris Convention of 20t11 March, 1883 for the\nprotection of industrial property, as revised or amended from time to time;\n(xx)    “package” includes any case, box, container, covering, folder, receptacle,\nvessel, casket, bottle, wrapper, label, band, ticket, reel, frame, capsule, cap,\nlid, stopper and cork;\n(xxi)   “Policy Board” means the Policy Board constituted under section 4 of\nlntellectual Property Organization Act, 2012 (XXII of 2012);\n(xxii) “prescribed” means prescribed by rules made under this Act;\n(xxiii) “producer”, in relation to goods, means any person who―\n(a)   if such goods are natural goods, exploits the goods;\n(b) if such goods are agricultural goods, produces the goods and includes the\nperson who is an operator or processes or packages such goods; and\n(c) if such goods are handicrafts or industrial goods, makes or manufactures\nthe goods, and includes an operator or any person who trades or deals in\nsuch production, exploitation, making or manufacturing, as the case may\nbe, of the goods;\n(xxix) “qualifying country” means any country or territory which is—\n(a) a member of the World Trade Organization;\n(b) a member of the World Intellectual Property Organization;\n(c) a party to the Paris Convention; or\n(d) any other country which the competent authority may designate as a\nqualifying country on the basis of reciprocity;\n(xxv) “register” means the register of geographical indications provided under\nsection 6;\n(xxvi) “registered” with its grammatical variations means registered under this Act;\n(xxvii) “registered geographical indication” means a geographical indication\nwhich is actually on the register;\n(xxviii) “registrant” means any statutory body, public body, local or provincial\nadministration, government enterprise or any government organization which\nis a juristic person having area of responsibility covering the geographical\nindication of the goods as referred to in this Act having obtained registration\nand entered in the register as proprietor of a geographical indication ;\n(xxix) “Registrar” means the Registrar of Geographical Indications referred to in\nsection 4;\n(xxx) “Registry” means the geographical indications registry mentioned in section 3;\n(xxxi) “Intellectual Property Tribunal” or “IP Tribunal” means the Intellectual\nProperty Tribunal established under the Intellectual Property Organization of\nPakistan Act, 2012 (XXII of 2012); and\n(xxxii) “use of a geographical indication” shall include but not be limited to, use in\nproduction, manufacturing, packing, stocking, importing, exporting,\ndistributing, selling, dealing and advertising or exploiting in any other manner\nand any reference to such use shall be construed to include a reference to the\nuse of a printed or other visual representation of the geographical indication.\n(2) Words and expressions used and not defined in this Act shall have the same meaning as\nare assigned to them in the Trade Marks Ordinance, 2001(XIX of 2001)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Geographical Indications Registry.―(1) For the purposes of this Act, the concerned",
      "content": "Division shall establish a Geographical Indications Registry under the management and control of\nIPO Pakistan. The Trade Marks Registry and its branches established under the Trade Marks\nOrdinance, 200 I (XIX of 2001) shall carry out functions of the Geographical Indications Registry\nand its branches till such time a separate GI Registry is established under this Act.\n(2) The GI Registry shall maintain a register of record to be called the register of\ngeographical indications. GI Register shall be maintained at Trade Marks Registry for the time being\nand shall he handed over and transferred to the GI Registry once it has been established under this\nAct.\n(3) For the facilitation of applicants, the IPO Pakistan with the prior approval of Policy\nBoard may set up offices of the Registry at such places, as deems necessary, as and when required.\n(4) The Geographical Indications Registry shall have its own seal."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Registrar geographical indications and other functionaries.― The IPO Pakistan may,",
      "content": "by notification in the official Gazette, appoint an officer who shall serve as the Registrar:\nProvided that the Registrar of Trade Marks, appointed under sub-section (1) of section 7 of\nGeographical Indications till the appointment of an officer as Registrar under this section, to carry\nout his functions under this Act:\nProvided further that the appointment of Registrar under this section shall be made within\nthree hundred and sixty days after the commencement of this Act."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Delegation of Authority of the Registrar",
      "content": "(1) The IPO Pakistan shall with the prior\napproval of the Policy Board appoint one or more deputy registrars and assistant registrars for the\npurposes of this Act.\n(2) Under direction of IPO Pakistan, the Registrar may delegate its powers to the deputy\nregistrars and assistant registrars who shall discharge such functions of the Registrar under this Act\nas the Registrar may delegate from time to time.\n(3) Any reference in this Act to the Registrar shall include a reference to any deputy registrar\nor assistant registrar in the discharge of such functions.\n(4) IPO Pakistan may authorize the Registrar to delegate any function of the Registrar to any other\nofficers of the GI Registry other than the deputy and assistant registrars."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Register of geographical indication. (1) There shall be kept at each branch, a copy of the",
      "content": "register of geographical indication which shall contain all registered geographical indications with\nnames, addresses and descriptions of the registrants, the names and addresses and descriptions of\nauthorized users and such registers may be maintained wholly or partly in electronic form. The\nregister shall be open for inspection of the public at all convenient times in the same manner as the\noriginals thereof.\n(2) The register shall contain list of registrants and authorized users of geographical\nindications.\n(3) The register shall be divided into two Parts called respectively Part A and Part B.\n(4) The particulars relating to the registration of the registrant of geographical indications\nshall be incorporated and included in Part A of the register in the prescribed manner.\n(5) The particulars relating to the registration of the authorized users shall be incorporated\nand included in Part B of the register in the prescribed manner.\n(6) Any person may obtain extracts from the register in the prescribed manner."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Registration of registrant of geographical indication",
      "content": "(1) Registration of proprietor\nof geographical indication of any or all goods subject to definite territory of a country shall comprise\nof such class of goods as may be classified by the Registrar in accordance with the international!\nclassification of goods for the purposes of registration of geographical indications."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Prohibition of registration of a geographical indication. ―(1) An indication shall not",
      "content": "be registered as a geographical indication,\n(i)      which does not correspond to the definition of geographical indication\ncontained in clause (vii) of sub-section (1) of section 2; or\n(ii)     the use of which is likely to deceive or case confusion; or\n(iii)    which is not or has ceased to be protected in its country of origin; or\n(iv)     which has fallen into disuse in that country; or\n(v)      which is determined by the Registrar to be a generic name or an indication; or\n(vi)     which is opposed to morality or public policy."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Registration of homonymous geographical indication",
      "content": "(1) A homonymous\ngeographical indication is entitled to be considered for registration under this Act.\n(2) Prior to registration under sub-section (1) he Registrar shall satisfy himself that he has\nconsidered-\n(i)      all practical conditions under which the homonymous indication in question\nshalt be differentiated from other homonymous indication;\n(ii)     equitable treatment of the producers of the goods concerned; and\n(iii)    that the consumers of such goods shall not be confused or misled in\nconsequence of such registration.\nExplanation.—Homonymous geographical indications (GI) are those that are\nspelled or pronounced alike, but which identify products originating in\ndifferent places, usually in different countries. In principle, these indications\nshould coexist, but such coexistence may be subject to certain conditions. For\nexample, it may be required that they be used only together with additional\ninformation as to the origin of the product in order to prevent consumers from\nbeing misled. A GI may be refused protection if, due to the existence of\nanother homonymous indication, its use would be considered potentially\nmisleading to consumers with regard to the product's true origin."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Registration of foreign geographical indication.― (1) A geographical indication of a",
      "content": "foreign country shall be registered in the Islamic Republic of Pakistan as long as it is registered in\naccordance with the local legislation in its country of origin. The title and date of the legislative or\nadministrative provisions or of judicial decisions regarding protection to the geographical indication\nin the country of origin shall be considered for accepting foreign GI application.\n(2) The Registry shall not allow the registration of a foreign Geographical Indication which is\nnot or has ceased to be protected in its country of origin or which has fallen into disuse in that\ncountry.\n(3) The application for registration of foreign geographical indication shall be made at the\nRegistry by its legal representative in Pakistan.\n(4) During the registration procedure, the Registry may require the applicant or its legal\nrepresentative to submit any information related to registration in the country of origin which may\naffect its registration in Pakistan."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Right to own and register geographical indication",
      "content": "(1) The Federal Government\nshall be the holder and exclusive owner of all the geographical indications of the Islamic Republic of\nPakistan.\n(2) The Federal Government may allow any statutory body, public body, local or provincial\nadministration, government enterprise or any government organization which is a juristic person\nhaving area of responsibility covering the geographical indications in the territory of Islamic\nRepublic of Pakistan to apply for and register the product as a geographical indication as a registrant\nin such form, manner and accompanied by such fees as may be prescribed.\n(3) When a product bearing geographical indication is registered at the Registry in\naccordance with the provisions of this Act, such producers or operators whose practices are in\ncompliance with the book of specification shall have the right to use the geographical indication as\nauthorized users. The producers or operators, with the formal assent of the Registrant, shall apply to\nthe Registry for obtaining registration as authorized users.\n(4) The concerned Division shall be responsible for conciliating any conflicts and engage in\nadvocacy in relation to drafting of book of specification during pre-registration phase of\ngeographical indications.\n(5) The concerned Division shall regulate cooperation agreement with organizations to\nenable pre-registration processes of geographical indication and facilitate in arranging consultations\nwith producers and operators in drafting book of specification."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Content of Application for registration of geographical indication. ―(1) The",
      "content": "application for registration of a geographical indication by the Applicant shall contain the following\ndocuments for registration, namely: —\n(i)      name and address of applicant filing the application;\n(ii)     geographical indication for which registration is sought;\n(iii)    class of goods to which the geographical indication shall apply;\n(iv)     geographical area to which the geographical indication applies and a map of\nthat area;\n(v)      title and date of the legislative or administrative provisions or of judicial\ndecisions regarding the protection to the geographical indication in the\nqualifying country of origin;\n(vi)     statement of such particulars in relation to the producers or operators of the\nconcerned goods, if any;\n(vii)    goods for which the geographical indication applies;\n(viii)    quality, reputation or other characteristics of the goods, geographical origin\nand other details as may be prescribed for which the geographical indication\nis used;\n(ix)     book of specifications containing product standards or product specifications;\nand\n(x)      such other particulars as may be prescribed and shall be subject to the\npayment of prescribed fee.\n(2) In addition to other factors, the reputation of products may also be determined on the\nbasis of their being widely known to and selected by consumers.\n(3) The quality and characteristics of products of geographical indication shall be defined by\none or several qualitative, quantitative or physically, chemically, microbiologically perceptible\ncriteria which can be tested by technical means or experts with appropriate testing methods as may\nbe prescribed."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Conformity of geographical indication with book of specification. ― (1) The",
      "content": "concerned Division, by notification in the official Gazette shall designate a certification body to\nguarantee, inspect, test and monitor quality, reputation or other characteristics of products seeking\nregistration of geographical indications in a prescribed manner.\n(2) The designated certification body shall confirm the specifications identified in the book\nof specifications from accredited confirmatory assessment bodies or research institutes or impartial\npublic authority or public organization or organization approved by concerned Division for this\npurpose.\n(3) In case there is non-compliance with the book of specifications by the producers or\noperators as authorized users of registered geographical indication, following measures may be\nadopted by the certification body, namely: —\n(i)     notice served to the authorized user for non-compliance;\n(i)     warning made to the producer or operator or authorized user:\n(ii)    in case no remedial action is taken within reasonable time, temporary\ndisqualification of the rights to use the geographical indication by the\nproducer or operator or authorized user by making an application to the\nRegistrar; and\n(iv)    application to the Registrar for suspension or cancellation of the rights to use\nthe geographical indication by the non-compliant authorized user.\n(4) The Registrar may approve the suspension after investigation and scrutiny as deemed fit.\n(5) The cost of such confirmation of compliance with the book of specifications shall be\nborne by the authorized users. The registrant may contribute to these costs as the case may be."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Technical assistance of experts",
      "content": "The Registrar may, if so require, be assisted in\ntechnical aspects in various fields such as geology or meteorology involved in any case by any\nexpert who has experience and\nexpertise in the matter in order to consider or make a decision or ascertain the correctness of the\nparticulars furnished in the application.\nI5. Examination for registration.―(1) The Registrar shall cause the application to be\nexamined to determine whether it fulfills the criteria and other requirements.\n(2) In examining the application, the Registrar may call the applicant or any person\nconcerned to give explanation or furnish additional evidence to him. Where it is necessary to have\nopinion of an expert in the field related to matter under consideration, the Registrar shall send the\nmatter to the expert for his consideration and opinion in the prescribed manner."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Grant of registration of registrant―{l) When an application for registration of a",
      "content": "geographical indication has been accepted, the Registrar shall register the registrant of the product\nbearing geographical indication mentioned in the application and the geographical indication shall\nstand registered from the date of making of said application and it shall be deemed to be the date of\nregistration.\n(2) On the registration of a geographical indication, the Registrar shall issue to the registrant,\na certificate in such form as may be prescribed, sealed with the seal of the Registry.\n(3) Subject to the provisions of this Act, the Registrar may accept an application absolutely\nor subject to such amendments, modifications, conditions or limitations, if any, as he may deem fit.\n(4) In case of conditional acceptance of application, the Registrar shall record in writing the\ngrounds for such conditional acceptance and the reasons to be recorded in writing for arriving at\nsuch decision.\n(5) The Registrar may amend the register or a-certificate of registration for the purpose of\ncorrecting a clerical error or an obvious mistake."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Application for registration of authorized user.―(1) Any natural or juristic person or",
      "content": "group of persons claiming to be an operator, producer or group of producers interested in the right to\nuse registered geographical indication, may apply in writing to the Registrar subject to the formal\nassent of the registrant in the prescribed manner for registering him as an authorized user of such\ngeographical indication.\n(2) The application under sub-section (1) shall be accompanied by a statement confirming\ncompliance with the book of specifications and such documents of facts as may be prescribed and\nrequired by the Registrar to determine as to whether such person is the producer or operator of the\ngoods referred to in the application and such fee as may be prescribed.\n(3) The Registrar shall cause the application to be examined to determine whether it fulfills\nthe criteria and other requirements.\n(4) In examining the application, the Registrar may call the applicant or any person\nconcerned to give explanation or furnish additional. evidence to him.\n(5) Where registration of a geographical indication as authorized user, is not completed\nwithin twelve months from the date of the application by reason of default on the part of the\napplicant, the Registrar may, after giving notice to the applicant in the prescribed manner, treat the\napplication as abandoned unless it is completed within the time specified."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Withdrawal of acceptance",
      "content": "(1) Where, after the acceptance of an application for\nregistration of an authorized user of geographical indication but before its registration, the Registrar\nis satisfied,\n(i)     that the application has been accepted in error; or\n(ii)    that in circumstances of the case the application for use of geographical\nindication should not be registered; or\n(iii)   that it should be registered subject to conditions or limitations; or\n(iv)    that it should be registered subject to conditions. additional to or other than the\nconditions or limitations subject to which the application has been accepted,\nhe may, after hearing the applicant, if he so desires, withdraw the acceptance\nand proceed as if the application had not been accepted."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Advertisement. ― (1) When an application for registration of an authorized user of the",
      "content": "product bearing geographical indication has been accepted, whether absolutely or subject to\nconditions or limitations, the Registrar shall advertise that application immediately in such manner\nas may be prescribed.\n(2) Where after the advertisement of an application, —\n(i) an error in the application has been corrected; or\n(ii) the application has been permitted to be amended,\nthe Registrar in his discretion may either cause the application to be advertised afresh, a new or may\nnotify such correction which has been made in the application in the prescribed manner."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Opposition to registration.―(1) Within a period of three months from the date of",
      "content": "advertisement or re-advertisement of the application for registration of authorized user of a product\nbearing geographical indication, any interested person may give to the Registrar notice of opposition\nin writing in prescribed manner for opposition to the registration.\n(2) This notice of opposition under sub-section (1) shall be made in such manner and on\npayment of such fee as may be prescribed.\n(3) The Registrar shall serve a copy of the notice of opposition to the Applicant for\nregistration as authorized user and within two months from the receipt by the applicant of the notice\nof opposition, the applicant shall send to the Registrar in the prescribed manner a counter-statement\nof the grounds on which he relies for his application and if he does not do so, he shall be deemed to\nhave abandoned the application.\n(4) Within two months from the receipt of copy of notice of opposition, the applicant may\nsend a counter-statement of the grounds on which he relies upon to the Registrar in the prescribed\nmanner.\n(5) If he fails to do so in the prescribed time limit he shall be deemed to have abandoned the\napplication.\n(6) If the applicant sends such counter-statement, the Registrar shall cause a copy thereof to\nbe served on the person giving notice of opposition.\n(7) Any evidence upon which the opponent and the applicant may rely shall be submitted in\nsuch manner and within such time as may be prescribed to the Registrar, and the Registrar shall give\nan opportunity to them to be heard, if they so desire.\n(8) After hearing the parties, considering the evidence and taking into account ground of\nobjection whether relied upon by the opponent or not, the Registrar shall decide whether the\nregistration is to be permitted absolutely or subject to conditions or limitations, if any, or not to be\npermitted.\n(9) If any party does not appear for hearing, the Registrar may ex parte decide on the notice\nof opposition on merits, upon- consideration of the evidence available on record.\n(10) Where a person giving notice of opposition or an applicant sending a counter statement\nneither resides nor carries on business in Pakistan, the Registrar may require him to give security for\nthe costs of proceeding before him.\n(11) The Registrar may, on request, permit correction of any error or any amendment in a\nnotice of opposition or a counter-statement in the prescribed manner."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Extension of time",
      "content": "(1) If the Registrar is satisfied, on application made to him in the\nprescribed manner and accompanied by the prescribed fee, that there is sufficient cause for\nextending the time for doing any act not being a time expressly provided in this Act, whether the\ntime so specified has expired or not, he may subject to such conditions as he may think fit to impose,\nextend the time and inform the parties accordingly.\n(2) Nothing in sub-section (1), shall be deemed to require the Registrar to hear the parties\nbefore disposing of an application for extension of time and no appeal shall lie from any order of the\nRegistrar under this section."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Correction and Amendment.⸺(1) The Registrar may, at any time, whether before or",
      "content": "after acceptance of an application for registration, permit the correction of any error or permit an\namendment of the application."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Grant of registration of an authorized user",
      "content": "(1) Where the\nRegistrar finds that conditions provided for in this Act are fulfilled and either-\n(i)     the registration of an authorized user has not been opposed within the\nprescribed time limit; or\n(ii)    the authorized user has provided statement affirming compliance with the\nbook of specifications; or\n(iii)   the registration of the authorized user has been opposed by notice and the\nopposition has been decided in the Applicant's favour; or\n(iv)    no appeal has· been filed against the Registrar's decision for registration as an\nauthorized user,\nthe Registrar shall, unless the concerned Division otherwise directs, register the said authorized users\nmentioned in the application.\n(2) The authorized users, when registered under sub-section (1), shall be registered from the\ndate of filing of said application.\n(3) The Registrar shall issue a certificate of the registration to the authorized users bearing\nthe seal of the Registry and shall publish a reference to the said registration in the prescribed manner.\n(4) The Registrar may amend the register for addition, correction or omission of entries\nrelating to authorized users.\n(5) Where an application is made by any aggrieved person or any legal person or an\norganization or designated certification body or registrant that an authorized user is dealing with a\nregistered geographical indication in a manner which is detrimental to the public interest at large and\nin non-compliance of book of specifications and the Registrar is satisfied according to all legal\nconsiderations contained in this Act, he may pass an order for rectification of the register or cancel\nthe registration as he may deem legally fit.\n(6) Such orders of the Registrar shall be binding on all the parties including the aggrieved\nparty or authorized user, provided that appeal against the Registrar's decision shall lie to the High\nCourt."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Regulatory mechanism for registered geographical indication.⸺ (1) The procedure",
      "content": "for inspection and monitoring shall be prepared by concerned Division for regulatory mechanism\nincluding scope, frequency, and procedures of monitoring activities and penalties to ensure the\ncompliance of geographical indication products with the book of specification.\n(2) The use of registered geographical indication by the authorized users shall be subject to\ncompliance with the book of specification.\n(3) IPO Pakistan shall facilitate in promotion, marketing and effective use of products\nbearing geographical indications.\n(4) The designated certification body conforming product specification and product\nstandards of geographical indication goods shall present an annual report to the concerned Division\nat the end of each calendar year containing a list of authorized users including but not limited to\ngoods, quantity and quality acknowledged and actions taken against non-compliance of the book of\nspecification.\n(5) Concerned Division shall oversee the efficiency of the designated certification body or\nbodies."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Duration, renewal, removal and restoration of registration. ―( 1) The registration of",
      "content": "a Registrant of geographical indication shall be perpetual.\n(2) The registration of an authorized user shall be for a period of ten years.\n(3) The Registrar shall, on application made in the prescribed manner, by the authorized user,\nwithin the prescribed period and subject to the payment of the prescribed fee, renew the registration\nof the authorized user, for a period of ten years from the date of expiration of the original registration\nor of the last renewal of registration, as the case may be (which date is in this section referred to as\nthe expiration of the last registration).\n(4) At the prescribed time, before the expiration of the last registration of the authorized user,\nthe Registrar shall send notice in prescribed manner to the authorized user regarding the date of\nexpiration and the conditions as to payment of fees and otherwise upon which a renewal of\nregistration may be obtained, and, if at the expiration of time prescribed in the notice, the said\nconditions are not been duly complied, the Registrar may remove the authorized user from the\nregister:\nProvided that the Registrar shall not remove the authorized user from the register, if an\napplication is made in the prescribed form and the prescribed fee and surcharge is paid within six\nmonths from the expiration of the last registration of the authorized user, as the case may be, and\nshall renew the registration of the authorized user for a period of ten years.\n(5) Where an authorized user has been removed from the register for non-payment of the\nprescribed fee, the Registrar shall, after six months and within one year from the expiration of the\nlast registration of the authorized user, on receipt of an application in the prescribed form and on\npayment of the prescribed fee, if satisfied that it is just so to do, restore the authorized user, as the\ncase may be, to the register and renew registration of authorized user, either generally or subject to\nsuch condition or limitation as he thinks fit to impose, for a period of ten years from the expiration\nof the last registration."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Rights conferred by registration",
      "content": "(1) The registration of a geographical indication\nshall give,-----\n(i)     to the registrant of the geographical indication and the authorized user to get\nrelief in respect of infringement of the registered geographical indication;\n(ii)    to the authorized user, the exclusive right to use the geographical indication in\nrelation to the goods in respect of which the geographical indication is\nregistered;\n(iii)   right to take action against an infringer or counterfeiter; and\n(v)     right to prevent the use of a registered geographical indication by any person\nin any manner in relation to the concerned products to which the geographical\nindication relates."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Use of geographical indication. ―(1) When Geographical Indication has been",
      "content": "registered for any particular product, the producers or operators of such product who is entered in the\nRegister as authorized users, is entitled to use the registered geographical indication for goods,\nsubject to compliance with product specification.\n(2) The use of registered geographical. Indication includes applying it on products, packages,\nadvertising material and any other document related to registered geographical products."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. National logo for certifying geographical indication products.⸺ (1) The Registry",
      "content": "shall establish a National Geographical Indication logo to certify all geographical indication products\nregistered in Pakistan.\n(2) National Geographical Indication logo along with registered name of product and any\nother mark and detail shall appear on the label of marked products in a prescribed manner."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Registration to be prima facie evidence of validity",
      "content": "(1) In all legal proceedings\nrelating to a geographical indication, the certificate of registration granted under this Act, being a\ncopy of the entry in the register under the seal of the Geographical Indications Registry, shall be\nprime facie evidence of the validity thereof and be admissible in all courts without further proof or\nproduction of the original.\n(2) Nothing in this section shall be deemed to affect right of action in respect of an\nunregistered geographical indication."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Infringement of geographical indication.―(l) A person shall infringe a registered",
      "content": "geographical indication if such person uses a geographical indication which is identical with the\nregistered geographical indication.\n(2) A person shall infringe a registered geographical indication, if such person uses it in the\ncourse of trade on following grounds, namely: —\n(i)      the use of a geographical indication in respect of goods of the same or similar\ndescription but not originating in the country indicated by the geographical\nindication in question or the true place of origin of the goods is falsely\nindicated or the geographical indication is used in translation or accompanied\nby expressions such as “kind, “type”, “style, “imitation” used in such a\nmanner which misleads the persons as to the geographical origin of such\ngoods; or\n(ii)    any use of a geographical indication that, even if it identifies goods truly\noriginating in the place designated by that geographical indication, designates\nproducts that do not comply with the relevant book of specification as\nrecorded on the register shall be deemed as an infringement; or\n(iii)   the mark is deceptively similar to the geographical indication and there exists\na likelihood of confusion on the part of public, which includes the likelihood\nof association with the geographical indication."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. When a geographical indication is not infringed",
      "content": "(1) A person shall not infringe a\nregistered geographical indication when the\n(i)     person uses it in good faith; or\n(ii)     person's name or the name of the person's place of business is used but such\nuse does not result in a likelihood of confusion or otherwise interfere with an\nexisting geographical indication; or\n(iii)    name of the predecessor in business of the person or the name of\nthe predecessor's place of business is used;\n(iv)    person uses the geographical indication in good faith to indicate the intended\npurpose of goods, in particular as accessories or spare parts, or services; or\n(v)     person uses the geographical indication for the purposes of comparative\nadvertising."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Action for infringement.― (1) Save as otherwise provided in this Act, an infringement",
      "content": "of a registered geographical indication shall be actionable by the holder or registrant and the\nauthorized user of the geographical indication.\n(2) In an action for infringement all such relief by way of damages, injunctions, accounts or\notherwise shall be available to the holder or registrant and the authorized user of the geographical\nindication as is available in respect of the infringement of any other property right.\n(3) Nothing in this Act shall be deemed to affect rights of action against any person for\npassing off goods as the goods of another person or the remedies in respect thereof."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Infringement of unregistered geographical indications",
      "content": "(l) No proceedings to\nprevent, or recover damages for, infringement of an unregistered geographical indication shall be\ninstituted by any person.\n(2) Nothing in this Act shall be deemed to affect rights of action against any person for\npassing off goods as goods of another person or any remedies available therein."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Infringement proceedings.― (1) No person shall be entitled to institute any proceeding",
      "content": "to recover damages for an unregistered geographical indication.\n(2) Any interested person and any interested group of producers or consumers may institute\nproceedings in the IP Tribunal to prevent infringement in respect of a registered geographical\nindication.\n(3) Following use of registered geographical indication shall constitute infringement, —\n(i)     use in the designation or presentation of a good that indicates or suggests that\nthe goods in question originates in a geographical area other than the true\nplace of origin in a manner which misleads the public as to the geographical\norigin of the goods; or\n(ii)    use which constitutes an act of unfair competition within the meaning of\nArticle 10 bis of the Paris Convention; or\n(iii)   use of a geographical indication in respect of goods of the same or similar\ndescription but not originating in the place indicated by the geographical\nindication in question, even where the true origin of the goods is indicated or\nthe geographical indication is used in translation or accompanied by\nexpressions such as “kind, “type” , “style”, “imitation” or the like; or .\n(iv)    use of a geographical indication that, even if it identifies goods truly\noriginating in the place designated by that geographical indication, designates\ngoods that do-not comply with the relevant specification as recorded on the\nregister.\n(4) The relief which a court may grant in any suit for infringement under this section may\ninclude\n(i)     an injunction and confiscation of the products; and\n(ii)    damages or share in the profits at the option of the plaintiff."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Suits for infringement to be instituted before IP Tribunals.⸺ (l) No suit in matters",
      "content": "relating to infringement of a geographical indication or otherwise relating to any right in a\ngeographical indication shall be instituted in any other court except an IP Tribunal."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Order for erasure of offending mark.―(1) Where a person is found to have infringed a",
      "content": "registered geographical indication, the High Court or an IP Tribunal may make an order requiring\nhim-\n(i)     to cause the offending geographical indication to be erased, removed or\nobliterated from any infringing goods, material or articles in his possession,\ncustody or control; or\n(ii)    to secure the destruction of the infringing goods, material or articles, if it is\nnot reasonably practicable for the offending geographical indication to be\nerased, removed or obliterated.\n(2) If an order under sub-section (1) is not complied with or it appears to the High Court or\nIP Tribunal, as the case may be, that such an order may not be complied with, the High Court or IP\nTribunal may order that infringement goods, material or articles be. delivered to such person and\nmay further direct for erasure, removal or obliteration of the mark or for destruction, as the case\nmaybe."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Infringing goods, material or articles",
      "content": "(1) Subject to sub-section (2), goods shall be\ninfringement goods in relation to a geographical indication. if those or packaging there of bear a\nmark identical or deceptively similar to that mark and―\n(i)     application of the mark to the goods or packaging thereof was an infringement\nof the registered geographical indication;\n(ii     the goods are proposed to be imported into Pakistan and application of the\nmark in Pakistan to those or packing thereof is an infringement of the\nregistered geographical indication; or\n(iii)   the mark otherwise been used in relation to the goods in such a way as to\ninfringe the registered geographical indication.\n(2) Nothing in sub-section (1) shall be construed as affecting the importation of goods which\nmay be lawfully imported into Pakistan.\n(3) Material shall be infringing material in relation to a registered geographical. indication, if\nit bears a mark identical or deceptively similar to that mark and either it is,\n(i)     used for labeling or packaging goods as a business paper or for advertising\ngoods, in such a way as to infringe the registered geographical indication; or\n(ii)   intended to be so used and such use would infringe the registered geographical\nindication.\n(4) Infringing articles in relation to a registered geographical indication means such articles\nwhich―\n(i)     are specifically designed or adapted for making copies of a mark identical or\nsimilar to that mark; and\n(ii)    a person has in bis possession, custody or control, knowing or having reason\nto believe that those have been or are to be used to produce infringing goods\nor material."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Order as to disposal of infringing goods, material or articles.⸺ ( 1) Where infringing",
      "content": "goods, material or articles have been confiscated, an application may be made to the High Court or\nIP Tribunal,—\n(i)      for an order that those be destroyed or forfeited; or\n(ii)    for a decision that no such order may be made.\n(2) In considering what order, if any, should be made, the IP Tribunal shall consider whether\nother remedies available in an action for infringement of the registered geographical indication may\nbe adequate to compensate the aggrieved party and protect their interests.\n(3) Where there are more persons than one interested in the goods, materials or articles, the\nIP Tribunal shall make such order as it thinks just.\n(4) If the IP Tribunal decides that no order should be made under this section. then the\nperson, in possession of the goods shall be entitled to retain them."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Meaning of applying Geographical Indications.―(1) A person shall be deemed to",
      "content": "apply a geographical indication for goods who-\n(i)     applies to the goods themselves or uses it in relation to goods;\n(ii)    applies to any package in or with which the goods are sold or exposed for sale\nor had in possession for sale or for any purpose of trade or manufacture; or\n(iii)   places, encloses or annexes any goods which are goods which are sold or\nexposed for sale or had in possession for sale or for any purpose of trade or\nmanufacture in or with any package or other thing to which a trade description\nhas been applied; or\n(iv)    uses a geographical indication in any manner reasonably likely to lead to the\nbelief that the goods in connection with which it is used are designed or\ndescribed by that geographical indication; or\n(v)     in relation to the goods uses a geographical indication in any sign,\nadvertisement, invoice, catalogue, business letter, price list or other\ncommercial documents and goods are delivered or services are rendered to a\nperson in pursuance of a request or order made by reference to the\ngeographical indication as so used.\n(2) A geographical indication shall be deemed to be applied to goods whether it is woven in,\nimpressed on, otherwise worked into or annexed or affixed to the goods or to any packaging or other\nthing."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. False application of geographical indication",
      "content": "(1) A person shall falsely apply\ngeographical indication if such person uses in the course of trade a geographical indication which-\n(i)     is used without the consent of the registrant or authorized user of geographical\nindication makes the geographical indication or deceptively similar\ngeographical indication; or\n(ii)    falsifies any genuine geographical indication, whether by alteration, addition,\neffacement or otherwise; or\n(iii)   where the geographical indication is a well-known geographical indication or\nhas a reputation in Pakistan. and the use of the Geographical Indication being\nwithout due cause, takes unfair advantage of or is detrimental to the\ndistinctive character or the repute of the geographical indication; or\n(iv)    uses such registered geographical indication as his trade name or part of his\ntrade name; or\n(v)     uses such registered geographical indication as his domain name or part of his\ndomain name or obtains such domain name without consent of the proprietor\nof the registered geographical indication, with the intention of selling such\ndomain name to another including the proprietor of the registered\ngeographical indication; or\n(vi)    uses any package bearing a geographical indication which is identical with or\ndeceptively similar to the geographical indication of such registrant or\nauthorized user, for the purpose of packing, filling or wrapping therein any\ngoods other than the genuine goods of the authorized user of the geographical\nindication.\n(2) Any geographical indication falsely applied as mentioned in sub-\nsection (1), is in this Act referred to as a false geographical indication.\n(3) In all legal proceedings, a person who sells or offers goods for sale or puts those on the\nmarket or has in possession for sale or any purpose of trade or manufacture any goods bearing a\nmark which infringes a registered geographical indication, the burden of proving the consent of the\nregistrant or authorized user shall lie on the accused and be treated as a party to infringement of a\nregistered geographical indication, unless he proves that, ―\n(i)     having taken all reasonable precautions, he had reasons to suspect the\ngenuineness of the geographical indication;\n(ii)    on demand made by IP Tribunal or High Court, as the case may be, he gave\nall the information in his power with respect to the persons from whom he\nobtained such goods; and\n(ii)    he had otherwise acted innocently."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Penalty for applying false geographical indication, etc",
      "content": "(1) Any person who,-----\n(i)     falsely applies geographical indication to goods; or\n(ii)    applies to any goods to which an indication of the country or place in which\nthey were made or produced or the name and address of manufacture or\nperson for whom the goods are manufactured is required\n(iii)    tampers with, alters or effaces an indication of origin which has been applied\nto any goods; or\n(iv)    causes any of the aforementioned things to be done, shall, unless he proves\nthat he acted without intent to defraud,\nshall be punished with imprisonment of either description for a term which shall not be less than six\nmonths but which may extend to three years, or with fine which shall not be less than ten hundred\nthousand rupees, or with both."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Penalty of falsely representing a geographical indication as registered.―(1) No",
      "content": "person shall make any representation-\n(i)     with respect to a mark not being a registered geographical indication to the\neffect that it is a registered geographical indication;\n(ii)    with respect to a part of a registered geographical indication not being a part\nseparately registered as a geographical indication, to the effect that it is\nseparately registered as a geographical indication;\n(ii)    to the effect that a registered geographical indication is registered in respect of\nany goods in respect of which it is not, in fact, registered; or\n(iv)    to the effect that the registration of a geographical indication gives an\nexclusive right to the use thereof in any circumstances in which, having regard\nto limitations entered on the register, the registration does not, in fact, give\nthat right.\n(2) If any person contravenes any of the provisions of sub-section (1), he shall be punishable\nwith imprisonment for a term which shall not be less than one month but which may extend to six\nmonths, or with fine which shall not be less than five hundred thousand rupees, or with both.\n(3) For the purposes of this section, the use in Pakistan in relation to a geographical\nindication of the word “registered, or of any other expression referring whether expressly or\nimpliedly to registration, shall be deemed to import a reference to registration in the register, except,\n(i)      where that other expression is of itself such as to indicate that the reference is\nto such registration as is mentioned in clause (i); or\n(ii)     where that word is used in relation to a mark registered as a geographical\nindication under the laws of a country other than Pakistan and in relation\nsolely to goods to be exported to that country.\n(4) The Registrar may, either himself or upon a complaint in writing made to him, call upon\nany person who is allegedly contravening any of the provisions of clauses (i) to (iii) of sub-section\n(1) to show cause as to why action should not be taken against him:\nProvided that power of the Registrar shall be limited to the imposition of fine as provided\nunder sub-section (2), in addition he may refuse the application for registration of the geographical\nindication if his application for registration of GI as authorized user is pending. In case the\nauthorized user of geographical indication is registered, Registrar may order invalidation of the\nregistration or any combination thereof, as the case may be."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Prohibition on transfer etc.⸺ Notwithstanding anything contained in any law for the",
      "content": "time being in force, any right to a registered geographical indication shall not be the subject matter\nof assignment, transmission, licensing, pledge, mortgage, licensing or any such other agreement by\nthe authorized user, provided that on the death of an authorized user his right. a registered\ngeographical indication shall devolve on his successor in title under the law for the time being in\nforce."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Power to vary a registration, and rectify or correct the Register",
      "content": "(1) Any person\nhaving a sufficient interest may apply for the rectification of an error or omission in the Register:\nProvided that an application for rectification may not be made in respect of a matter affecting\nvalidity of registration of a geographical indication.\n(2) The effect of rectification of the register shall be that the error or omission in question\nshall be deemed never to have been made.\n(3) The Registrar may, on application made in prescribed manner, by the registrant or an\nauthorized user enter any change in his name or address as recorded in the register.\n(4) The Registrar may, if he considers it necessary, implement any amended or substituted\nclassification of goods for purposes of registration of a geographical indication as may be prescribed.\n(5) The existing entries on the register may be amended to record any new classification as\nmay be prescribed."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Power to vary or cancel registration as an authorized user. ―( 1) The registration of",
      "content": "a person as an authorized user may be—\n(i)     amended, corrected or cancelled by the Registrar on the application by the\nRegistrant of the geographical indication or certification body or organization\nin the prescribed manner for failure to observe such conditions and restrictions\nwhich were pre-requisites of registration as an authorized user;\n(ii)    amended, corrected or cancelled by the Registrar on the application in writing\nin the prescribed manner by an authorized user of the geographical indication;\nand\n(iii)   cancelled by the Registrar as envisaged under clauses (i) and (ii).\n(2) Registration of authorized user may be varied or cancelled by IP Tribunal in case of\ninfringement of a registered geographical indication. It may be varied or cancelled by High Court in\ncase an appeal is filed against a decision of registrar or an appeal filed against the order of IP\nTribunal; in the prescribed manner by any person aggrieved or organization on the grounds that the\nauthorized user has used the geographical indication in violation of the provisions of this Act."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Rectification of registration of a trademark.― The Registrar of Trade Marks Registry",
      "content": "may, on his own motion or on application of an interested party, refuse or rectify the registration of a\ntrademark which consists of a geographical indication with respect to goods not originating in the\nterritory indicated, if use of the indication in the trademark for such goods is of such a nature so as to\nmislead the public with regard to the actual place of origin."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Power of Registrar to withdraw or transfer cases",
      "content": "The Registrar may, by order in\nwriting and for reasons to be recorded therein, withdraw any matter pending before an officer\nappointed under section 5 and deal with such matter himself either de novo or from the stage it was\nso withdrawn or transfer the same to another officer so appointed who may, subject to special\ndirections in the order of transfer, proceed with the matter either de novo or from the stage it was so\ntransferred."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Conflicting marks",
      "content": "Registrar shall, ex officio or at the request of an interested person,\nrefuse or invalidate registration of an authorized user which contains or consists of a geographical\nindication to be used with respect to goods of the same or similar description as those designated by\nthat geographical indication."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Procedure before the Registrar",
      "content": "(1) In all proceedings before the Registrar under this\nAct,―\n(i)    the Registrar shall have all the powers of a civil court for the purposes of\nreceiving evidence, administering oaths, enforcing attendance of witnesses,\ncompelling discovery and production of documents, issuing commissions for\nexamination of witness and granting a certificate of contested validity; and\n(ii)   evidence shall be given by affidavit, provided that the Registrar may, if he\nthinks fit, take oral evidence in lieu of or in addition to such evidence by\naffidavit.\n(2) The Registrar shall not exercise any powers vested in him under this Act or the rules\nmade thereunder adversely to any party duly appearing before him, without giving such party an\nopportunity of being heard."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Appeal against decision of the Registrar",
      "content": "(1) Save as otherwise expressly provided in\nthis Act, an appeal shall lie, within the prescribed period,\nagainst any decision of the Registrar under the is Act or rules made there under to the High Court\nhaving jurisdiction:\nProvided that if an y suit or other proceedings concerning the geographical indication in\nquestion is pending before an IP Tribunal, the appeal shall lie to the High Court with in whose\njurisdiction that IP Tribunal is situated.\n(2) Subject to the provision of this Act and of rules made there under, the provisions of the\nCode of Civil Procedure, 1908 (Act V of 1908), shall apply to appeal before the High Court."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Application of certain provisions of the Trade Marks Ordinance 2001 (XIX of 2001),",
      "content": "including provisions in relation to importation of infringing goods, material or articles.⸺ The\nprovisions of sections 52 to 68,101, 104,113, 119,126 of the Trade Marks Ordinance 2001(XIX of\n2001) shall have effect to proceedings under this Act, in relation to all such matters referred to and\nprovided therein as they have effect in relation to similar matters under the said Ordinance with\nrespect to goods, except that references to the Ordinance, trademark, Trademarks Registry and\ndistrict court they shall be deemed to be a reference to this Act, geographical indication,\nGeographical Indications Registry and IP Tribunal respectively."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Adaptation of classification of goods.⸺ For the purposes of this Act, the Registrar shall",
      "content": "use prescribed classifications, as revised or amended from time to time."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Revocation. ― Any interested person may request the Registrar within twelve months of",
      "content": "registration of an authorized user of geographical indication; or the High Court at any time after\nregistration of an authorized user to revoke the registration of a geographical indication on the\ngrounds provided under section 8:\nProvided that if any suit or other proceedings concerning the same geographical indication\nare pending before an IP Tribunal, the application shall be made to the High Court within whose\njurisdiction that IP Tribunal is located."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Power of fee setting and collection",
      "content": "The concerned Division shall prescribe a\nschedule of fee and charges for services rendered to the applicants and the public or as otherwise\nrequired under this Act. Any fee collected under this Act or the rules shall be deposited in the name\nof Director General IPO as demand draft or as may be prescribed."
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. Registrar and other officers not compellable to produce register. ―The Registrar or",
      "content": "any officer of the Registry shall not, in any legal proceedings to which he is not a party, be\ncompellable to produce the register or any other document in his custody, the contents of which can\nbe proved by the production of a certified copy issued under the Act or to appear as a witness to\nprove the matters therein recorded unless by order of the IP Tribunal made for special cause."
    },
    {
      "provision_ref": "sec57",
      "section": "57",
      "title": "Section 57. Power to remove difficulties",
      "content": "If any difficulty arises in giving effect to the provisions\nof this Act, the Federal Government may, by notification in the official Gazette, make such\nprovisions not inconsistent with the provisions of this Act as may appear to be necessary for\nremoving the difficulty."
    },
    {
      "provision_ref": "sec58",
      "section": "58",
      "title": "Section 58. Repeal and savings.⸺ (1) Clause (xix) of section 2 of the Trade Marks Ordinance,",
      "content": "2001(XIX of 2001) is hereby repealed.\n(2) On the commencement of this Act any geographical indication registered under the Trade\nMarks Ordinance, 200l (XIX of 2001), shall automatically stand repealed and a fresh registration\nprocess under this Act shall require to be initiated. A non-exhaustive indicative list of prospective\ngeographical indications of Islamic Republic of Pakistan is provided for fresh registration process in"
    }
  ],
  "definitions": [
    {
      "term": "Applicant",
      "definition": "a natural or legal person. government organization or statutory body, association, or group of producers, or producer organization, or operator having an interest in the registration;",
      "source_provision": "sec2"
    },
    {
      "term": "authorized user",
      "definition": "authorized user of a geographical indication registered under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "book of specifications",
      "definition": "a document elaborated by the applicant, specifying the geographical area of goods, production standards or product specifications, and qualification process for Geographical Indication goods;",
      "source_provision": "sec2"
    },
    {
      "term": "certification body",
      "definition": "an organization issuing a certificate of conformity with the book of specifications;",
      "source_provision": "sec2"
    },
    {
      "term": "deceptively similar",
      "definition": "a geographical indication which so nearly resembles to another geographical indication so as to be likely to deceive or cause confusion;",
      "source_provision": "sec2"
    },
    {
      "term": "Director General",
      "definition": "Director General, Intellectual Property Organization of Pakistan appointed under section 12 of the Intellectual. Property Organization of Pakistan Act, 201 2 (XXII of 2012);",
      "source_provision": "sec2"
    },
    {
      "term": "foreign geographical indication",
      "definition": "a geographical indication that identifies a product as originating in a country other than Islamic Republic of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "generic name or indication",
      "definition": "a name which, may correspond to the name of a territory, region or locality, does not have in Pakistan any meaning as an indication or reference of geographical origin and has become a commonly used name for the goods in question;",
      "source_provision": "sec2"
    },
    {
      "term": "indication",
      "definition": "any words, letters or numerals, geographical name or other name, device or any figurative representation, label or any combination thereof indicating or referring or suggesting or conveying the geographical origin of the goods to which it is applied; (xiii) ''IPO-Pakistan” means the Intellectual Property Organization of Pakistan, established under the Intellectual Property Organization of Pakistan Act, 2012 (XXII of 2012);",
      "source_provision": "sec2"
    },
    {
      "term": "name",
      "definition": "any abbreviation of a name;",
      "source_provision": "sec2"
    },
    {
      "term": "operator",
      "definition": "a natural or legal person involved in the collection, transformation, processing, trading, or distribution of geographical indication goods; (xvii) “organization” means any entity, body, department, authority or organization so designated by the Division concerned; (xviii) “Pakistan geographical indication” means a geographical indication that identifies a product as originating in the Islamic Republic of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "Paris Convention",
      "definition": "the Paris Convention of 20t11 March, 1883 for the protection of industrial property, as revised or amended from time to time;",
      "source_provision": "sec2"
    },
    {
      "term": "package",
      "definition": "any case, box, container, covering, folder, receptacle, vessel, casket, bottle, wrapper, label, band, ticket, reel, frame, capsule, cap, lid, stopper and cork;",
      "source_provision": "sec2"
    },
    {
      "term": "Policy Board",
      "definition": "the Policy Board constituted under section 4 of lntellectual Property Organization Act, 2012 (XXII of 2012); (xxii) “prescribed” means prescribed by rules made under this Act; (xxiii) “producer”, in relation to goods, means any person who― (a) if such goods are natural goods, exploits the goods; (b) if such goods are agricultural goods, produces the goods and includes the person who is an operator or processes or packages such goods; and (c) if such goods are handicrafts or industrial goods, makes or manufactures the goods, and includes an operator or any person who trades or deals in such production, exploitation, making or manufacturing, as the case may be, of the goods; (xxix) “qualifying country” means any country or territory which is— (a) a member of the World Trade Organization; (b) a member of the World Intellectual Property Organization; (c) a party to the Paris Convention; or (d) any other country which the competent authority may designate as a qualifying country on the basis of reciprocity;",
      "source_provision": "sec2"
    },
    {
      "term": "register",
      "definition": "the register of geographical indications provided under section 6; (xxvi) “registered” with its grammatical variations means registered under this Act; (xxvii) “registered geographical indication” means a geographical indication which is actually on the register; (xxviii) “registrant” means any statutory body, public body, local or provincial administration, government enterprise or any government organization which is a juristic person having area of responsibility covering the geographical indication of the goods as referred to in this Act having obtained registration and entered in the register as proprietor of a geographical indication ; (xxix) “Registrar” means the Registrar of Geographical Indications referred to in section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "Registry",
      "definition": "the geographical indications registry mentioned in section 3; (xxxi) “Intellectual Property Tribunal” or “IP Tribunal” means the Intellectual Property Tribunal established under the Intellectual Property Organization of Pakistan Act, 2012 (XXII of 2012); and (xxxii) “use of a geographical indication” shall include but not be limited to, use in production, manufacturing, packing, stocking, importing, exporting, distributing, selling, dealing and advertising or exploiting in any other manner and any reference to such use shall be construed to include a reference to the use of a printed or other visual representation of the geographical indication. (2) Words and expressions used and not defined in this Act shall have the same meaning as are assigned to them in the Trade Marks Ordinance, 2001(XIX of 2001).",
      "source_provision": "sec2"
    }
  ]
}
