{
  "id": "pk-glanders-and-farcy-act-1899",
  "type": "statute",
  "title": "Glanders and Farcy Act,1899",
  "title_en": "Glanders and Farcy Act,1899",
  "short_name": "GAFA",
  "status": "in_force",
  "issued_date": "1899-03-19",
  "in_force_date": "1899-03-19",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cpo%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Glanders and Farcy Act,1899 (XIII of 1899) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent",
      "content": "_ (1) This Act may be called the Glanders and Farcy Act, 1899.\n1\n[(2) It extends to the whole of Pakistan]; 2[*]\n2\n[*                 *                            *                 *                      *                        *                   *]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definition of “diseased”",
      "content": "_(1) In this Act, unless there is anything repugnant in the\nsubject or context, “diseased” means affected with glanders or farcy or any other dangerous epidemic\ndisease among horses which the 3[Provincial Government] may, by 4notification in the 5[official\nGazette], specify in this behalf 6* * *.\n(2) The provisions of this Act relating to horses shall apply also to 7[camels], asses and\nmules.\n8\n[3. Application of Act to local areas by Provincial Government.___ (1) The 9[Provincial\nGovernment] may, by notification10 in the 11[official Gazette], apply this Act or any provision of this\nAct to any local area, to be specified in such notification, within the Province.\n(2) In any such notification the 9[Provincial Government] may further direct that the Act or\nany provision so applied shall apply in respect of–\n(a)        all or any of the diseases mentioned or specified in a notification under section\n2, sub-section (1),\n(b)        all animals or any class of animals mentioned in section 2, sub-section (2).]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Provincial Government to appoint Inspectors",
      "content": "_ (1) When this Act has been so applied\nto a local area, the 9[Provincial Government] may, by notification in the 11[official Gazette],\nappoint12 such persons as it thinks fit to be Inspectors under this Act and to exercise and perform,\nwithin the whole of the local area or such portions thereof as it may prescribe, the powers conferred\nand the duties imposed by this Act on such officers.\n(2) Every person so appointed shall be deemed to be a public servant within the meaning of\nthe Pakistan Penal Code (XLV of 1860).\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955\n2\nRep. by the Repealing and Amending Act, 1914 (10 of 1914), s. 3 and Sch. II.\n3\nSubs. by A.O., 1937, for “L. G.” which were subs. by the Devolution Act, 1920 (38 of 1920), s. 2 and Sch. I, for “G. G. in C.”.\n4\nFor notifications under this sub-section as amended by Act 11 of 1901 as regards certain local areas, see Gaz. of India, 1906, Pt. I, p. 205, see also\ndifferent local Rules and Orders.\n5\nSubs. by A.O., 1937, for the words “local official Gazette” which were subs. by Act 38 of 1920, s. 2 and Sch. I, for “Gaz. of India”.\n6\nCertain words rep. by the Repealing Act, 1927 (12 of 1927), s. 2 and Sch.\n7\nIns. by the Glanders and Farcy (Amdt.) Act, 1920 (9 of 1920), s. 2.\n8\nSubs. ibid., s. 3, for the original section.\n9\nSubs. by A.O., 1937, for “L. G.”.\n10\nFor such notifications, see different local Rules and Orders.\nFor notifn. applying the Act to the whole Area of the Karachi Administration, see Gaz. of Karachi, 1959, Pt. II, p. 209.\n11\nSubs. by A.O., 1937, for “local official Gazette.”\n12\nFor instances of notifications under this section, see different local Rule s and Orders."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power of entry and search. Within the local limits for which he is so appointed, any such",
      "content": "Inspector as aforesaid may, subject to such rules as the l[Provincial Government] may make in this\nbehalf, enter and search any field, building or other place for the purpose of ascertaining whether\nthere is therein any horse which is diseased."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power of seizure. Within such limits as aforesaid, the Inspector may seize any horse",
      "content": "which he has reason to believe to be diseased."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Horse to be examined by Veterinary Practitioner",
      "content": "(1) On any such seizure as\naforesaid, the Inspector shall cause the horse seized to be examined as soon as possible by such\nVeterinary Practitioner as the 1[Provincial Government] may appoint2 in this behalf:\nProvided that, when the Inspector is also a Veterinary Practitioner so appointed, he may make\nthe examination himself.\n(2) For the purposes of the examination, the Veterinary Practitioner may submit the horse to\nany test or tests which the l[Provincial Government] may prescribe."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Horse to be destroyed if found diseased: otherwise restored",
      "content": "(1) If the Veterinary\nPractitioner certifies in writing that the horse is diseased, the Inspector shall cause the same to be\nimmediately destroyed :\nProvided that, in the case of any disease other than glanders or farcy, horses certified to be\ndiseased as aforesaid may, subject to any rules3 which the l[Provincial Government] may make in this\nbehalf, be either destroyed or otherwise treated or dealt with as the Veterinary Practitioner may deem\nnecessary.\n(2) If, after completing the examination, the Veterinary Practitioner does not certify that the\nhorse is diseased, the Inspector shall at once deliver the same to the person entitled to the possession\nthereof."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. When horse diseased, place where it has been to be disinfected, etc",
      "content": "(1) When any\ndiseased horse has been in any building, shed or other enclosed place, or in any open lines, the\nInspector may issue a notice to the owner of the building, shed, place or lines, or to the person in\ncharge thereof, directing him to have the same disinfected and the internal fittings thereof, or such\nother things found therein or near thereto as the l[Provincial Government] may by rule prescribe,\ndestroyed.\n(2) On the failure or neglect of such owner or other person as aforesaid to comply with the\nnotice within a reasonable time, the Inspector shall cause the building, shed, place or lines to be\ndisinfected and the fittings or other things to be destroyed, and the expense (if any) thereby incurred\nmay be recovered from the owner or other person as if it were a fine.\nl\nSubs. by A.O., 1937, for “L. G.”.\n2\nFor instances of notifications under this section, see different local Rules and Orders.\n3\nFor such rules, see different local Rules and Orders."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Owner or person incharge of diseased horse to give notice. The owner or any person in",
      "content": "charge of a diseased horse shall give immediate information of the horse being diseased to the\nInspector or to such authority as the l[Provincial Government] may appoint2 in this behalf."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Prohibition against removal, without license of horse which has been with diseased",
      "content": "horse. No person in charge of any horse which has been in the same field, building or place as, or in\ncontact with, a diseased horse, shall remove such horse except in good faith for the purpose of\npreventing infection, or under a license to be granted by the Inspector and subject to the conditions of\nthe license."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Vexatious entries, searches and seizures",
      "content": "_ (1) Whoever, being an Inspector appointed\nunder this Act, vexatiously and unnecessarily enters or searches any field, building or other place, or\nseizes or detains any horse on the pretence that it is diseased, shall be punishable with imprisonment\nfor a term which may extend to six months, or with fine which may extend to five hundred rupees, or\nwith both.\n(2) No prosecution under this section shall be instituted after the expiry of three months from\nthe date on which the offence has been committed."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Penalty for refusing to comply with notice under section 9, or for removing horse",
      "content": "contrary to section 11. Whoever refuses or neglects to comply with any notice issued by the\nInspector under section 9, or removes any horse in contravention of section 11, shall be punishable\nwith imprisonment for a term which may extend to one month, or with fine which may extend to\nfifty rupees, or with both."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Power to make rules",
      "content": "(1) The 1[Provincial Government] may make rules3 to carry out\n(2) In particular and without prejudice to the generality of the foregoing power, such rules as\naforesaid may___\n(a)         regulate entries, searches and seizures by Inspectors under this Act;\n(b)         regulate the use of test and the isolation of horses subjected thereto, and\nprovide for recovering the expense of detaining, isolating and testing horses\nfrom the owners or persons in charge thereof as if it were a fine;\n(c)          regulate the destruction or treatment, as the case may be, of horses certified\nunder section 8 to be diseased, and the disposal of the carcases of diseased\nhorses;\n(d)         regulate the disinfecting of buildings and places in which diseased horses have\nbeen, and prescribe what things found therein or near thereto shall be des-\ntroyed ; and\n(e)         regulate the grant of licenses under section 11 and the conditions on which\nthose licenses shall be granted.\nl\nSubs. by A.O.,1937, for “L. G.”.\n2\nFor officers so appointed, see different local Rules and Orders.\n3\nFor such rules, see different local Rules and Orders.\n(3) All rules under this section shall be published in the l[official Gazette], and, on such\npublication, shall have effect as if enacted by this Act.\n(4) In making any rule under this section, the 2[Provincial Government] may direct that a\nbreach of it shall be punishable with imprisonment for a term which may extend to one month, or\nwith fine which may extend to fifty rupees, or with both."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Appointment of same person to be both Inspector and Veterinary Practitioner. Any",
      "content": "Veterinary Practitioner may be appointed by the 2[Provincial Government] to be both Inspector and\nVeterinary Practitioner for all or any of the purposes of this Act or of any rule thereunder."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Protection to persons acting under Act. No suit, prosecution or other legal proceeding",
      "content": "shall lie against any person for anything which is, in good faith, done or intended to be done under\nthis Act."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. [Repeal.] Rep. by the Repealing and Amending Act, 1914 (X of 1914), s. 3 and Schedule",
      "content": "II.\n_____\nTHE SCHEDULE.—[Enactments repealed.] Rep. by the Repealing and Amending Act, 1914\n(X of 1914), s. 3 and Schedule II.\n__________\nDate: 11-09-2024\nl\nSubs. by A.O., 1937, for “local official Gazette.”\n2\nSubs. ibid., for “L. G.”"
    }
  ],
  "definitions": []
}
