{
  "id": "pk-global-climate-change-impact-studies-centre-act-2013",
  "type": "statute",
  "title": "Global Climate-Change Impact Studies Centre Act, 2013",
  "title_en": "Global Climate-Change Impact Studies Centre Act, 2013",
  "short_name": "GCISC",
  "status": "in_force",
  "issued_date": "2013-03-21",
  "in_force_date": "2013-03-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FqbJo%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Global Climate-Change Impact Studies Centre Act, 2013 (XVII of 2013) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the 1[Global\nClimate-Change] Impact Studies Centre Act, 2013.\n(2)           It extends to the whole of Pakistan.\n(3)           It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(a)        “Board” means the Board of Governors established under section 5;\n(b)        “Centre” means the 1[Global Climate-Change] Impact Studies Centre\n(GCISC) established under section 3;\n(c)         “Chairman” means the Chairman of the Board;\n(d)         “employees” means persons employed by the Centre;\n(e)        “Executive Director” means the Executive Director of the Centre appointed\nunder section 9;\n(f)        “Fund” means the 1[Global Climate-Change] Impact Studies Centre Fund\nestablished under section 10;\n(g)         “prescribed” means prescribed by rules; and\n1\nSubs. by the Global Change Impact Studies Centre (Amdt.) Act No VI of 2023, s.2.\n(h)        “research studies” means theoretical or experimental research work, including\nmodeling and simulation techniques undertaken to acquire knowledge of\nfundamental principles of the climate change phenomenon and its impacts.\n1[Global Climate-Change] IMPACT STUDIES CENTRE"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the 1[Global Climate",
      "content": "Change] Impact Studies Centre.—(1) There\nshall be established a 1[Global Climate-Change] Impact Studies Centre (GCISC), to carry out the\npurposes and objectives of this Act.\n(2) The Centre shall be a body corporate, having perpetual succession and a common seal,\nwith power to acquire and hold property, both moveable and immoveable, and sue and be sued in its\nown name.\n(3) The headquarters of the Centre shall be at Islamabad and it may establish its regional\noffices at such places as it may consider appropriate.\n(4) The Centre shall keep close liaison with the corresponding Province level Centres as and\nwhen they are established. The Centre shall also help in the capacity building of such Provincial\ninstitutions."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Functions of the Centre",
      "content": "(1) The Centre shall take all measures to accelerate research\nwork necessary for the study of climate change and its impacts on various sectors of socio-economic\ndevelopment such as water resources, agriculture, ecology, energy, health, bio-diversity, etc.\n(2) The Centre shall, in order to carry out its functions,—\n(a)        prepare and submit for approval of the Board schemes or projects, including\njoint projects with national, foreign or international entities;\n(b)        proceed to give effect to proposals, schemes or projects as approved by the\nBoard;\n(c)        enter into collaboration and joint ventures with domestic and foreign entities\nfor research studies related to the climate change phenomenon;\n(d)        hold seminars, conferences, workshops, training courses, etc., and publish\nresearch papers, etc;\n(e)        advise and recommend to government agencies sectoral guidelines for\nadaptation and mitigation efforts in relation to climate change;\n(f)        generate public awareness of the phenomenon of climate change and its likely\nimpacts; and\n(g)        perform such other acts as may be necessary for achievement of the purposes\nof this Act.\n1\nSubs. by the Global Change Impact Studies Centre (Amdt.) Act No VI of 2023, s.2."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Board of Governors",
      "content": "(1) The general direction and administration of the Centre and its\naffairs shall vest in the Board of Governors which shall determine and execute policies of the Centre\nand may exercise all powers and do all acts, which may be required to be exercised or done by the\nCentre, relating to its functions, in accordance with this Act.\n(2) For furthering the functions of the Centre, the Federal Government may, as and when it\nconsiders necessary, issue directives to the Centre on matters of policy. If a question arises as to\nwhether any matter is a matter of policy or not, the decision of the Federal Government thereon shall\nbe final.\n(3) The Board shall consist of the Chairman who shall be the Federal Minister-in-charge of\nthe concerned Ministry dealing with the subject of climate change, ex-officio members and the\nfollowing members to be appointed by the 1[Prime Minister],—\nVice-\n(a)        Secretary, Ministry dealing with the subject of climate change\nChairman\n(b)        Secretary, Ministry of Finance                                                           Member\n1\n(c)         [Secretary of the Division to which business of science and technology                  Member]\nstands allocated\n1\n(d)         [Secretaries of the Division to which business of water resources and                   Member]\nenergy stands allocated\n(e)        Secretary, Ministry dealing with the subject of national food security                   Member\nand research\n1\n(f)      [Secretary of the Division to which business of industries and                          Member]\nproduction stands allocated\n(g)\nDirector General, Pakistan Meteorological Department                                     Member\n(h)\nChairman, Space and Upper Atmosphere Research Commission.                                Member\n1\n[(ha)\nChairman, National Disaster Management Authority                                         Member\n(hb)\nChairman, Higher Education Commission                                                    Member\n(hc)\nSecretary, Foreign Affairs Division                                                      Member]\n(i)     Secretary, Environment or of the relevant Department and one Technical                   Members\nExpert 1[or scientist] nominated by respective Provincial Governments,\nAzad Government of the Jammu and Kashmir and Gilgit-Baltistan\n(j)\nthree eminent scientists                                                                 Members\n(k)        two eminent representatives from private Sector 1[ and two form civil                    Members\nsociety]\n1\nSubs., Ins. & Added by the Global Change Impact Studies Centre (Amdt.) Act No VI of 2023, s.3.\n(l)     Executive Director of the Centre                                                               Member\n(4) In absence of the Chairman, the Vice-Chairman shall exercise powers of the Chairman.\n(5) The Executive Director shall act as the Secretary of the Board.\n(6) The 1[Prime Minister] may vary constitution of the Board as and when 1[he] may deem\nappropriate."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Functions and powers of the Board",
      "content": "The Board shall—\n(a)    have administrative and financial powers for operation and maintenance of the\nCentre and to perform all functions vested in the Centre; and\n(b) oversee administrative and financial operation and maintenance of the Centre\nand for that purposes perform the following functions, namely:—\n(i)        delegate administrative and financial powers to various functionaries\nof the Centre in the manner prescribed;\n(ii)       prescribe service rules, recruitment rules, selection criteria, terms and\nconditions in all cadres for regular appointment or short term contract\nengagements for junior, middle and senior level professionals,\nconsultants, experts and advisers in the fields relevant to the\nprogrammes and other employees of the Centre;\n(iii)      approve the budget estimates as per provision in the budget of the\nCentre and utilization of funds on annual basis and exercise the powers\nin accordance with the rules, procedures and instructions specified by\nthe Federal Government;\n(iv)       approve creation of posts in the Centre;\n(v)        prescribe 1[******] terms and conditions for training of employees of\nthe Centre; 1[*]\n(vi)       monitor and approve progress reports prior to their submission to the\n1\n[Prime Minister] 1[;]\n1\n[(vii) where necessary to establish committees and sub-committess;\n(viii)     as it may deem fit, to confer prizes, honors or awards for meritorious\nbehavior;\n(ix)       where necessary and under guidance of the administrative Division, to\ncooperate with international entities; and\n(x)        to undertake any other actions needed to achieve objectives of this\nAct.]\n1\nSubs., Omitted, and Added by the Global Change Impact Studies Centre (Amdt.) Act No VI of 2023, s.3 & 4."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Terms of office of members",
      "content": "(1) The members, other than ex-officio members, shall be\nappointed for a period of three years by the 1[Prime Minister] and shall be eligible for re-\nappointment for one more term of three years.\n(2) The members, other than ex-officio members, may at any time resign their offices by a\nletter addressed to the 1[Prime Minister], through the Chairman of the Board, provided that no\nresignation shall take effect until accepted by the 1[Prime Minister].\n(3) An ex-officio member of the Board shall cease to be a member when he ceases to hold\nthat office or post by virtue of which he was an ex-officio member.\n(4) The 1[Prime Minister] may at any time terminate the appointment of any nominated\nmember without assigning any reason."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Meetings of the Board",
      "content": "(1) The Board shall regulate procedure for its meetings.\n(2) The meeting of the Board shall be convened and chaired by the Chairman and, in his\nabsence, by the Vice-Chairman, on such date, time and place as may be specified by him, provided\nthat—\n(a)       meeting shall be held on quarterly basis; and\n(b)       at least two weeks prior notice shall be given to the members specifying date,\ntime and place of the meeting.\n(3) The annual report and the accounts of the Centre for each financial year shall be\nsubmitted at a meeting of the Board to be held within six months of the close of that year for\napproval, adoption and record.\n(4) The quorum of the meeting of the Board shall be fifty per cent of the total membership.\n(5) All decisions at a meeting of the Board shall be by a majority vote of the members\npresent and voting, and in case of a tie, Chairman shall exercise a casting vote.\n(6) Any emergent business may be transacted by the Board by circulation among its members\nand any proposal so circulated and approved by a majority of the members shall be deemed to have\nbeen approved by the Board in its regular meeting.\n(7) All orders, resolutions, determinations and decisions of the Board shall be properly\nrecorded in writing by the Secretary of the Board for the approval of Chairman and circulation to the\nmembers."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Executive Director",
      "content": "(1) There shall be an Executive Director of the Centre who shall be\nits chief executive officer. He shall be a person with extensive relevant education, technical and\nadministrative experience and shall be appointed on contract basis in such manner and on such terms\nand conditions as may be prescribed.\n1\nSubs. by the Global Change Impact Studies Centre (Amdt.) Act No VI of 2023, s.5.\n(2) The Executive Director shall—\n(a)         exercise administrative and financial powers as delegated by the Board for the\noperation and maintenance of the Centre. He shall also have the powers as\ngiven by the Board to supervise preparation and disbursement of budget of the\nCentre;\n(b)         submit annual accounts and budget proposals for approval of the Board;\n(c)         organize international and national conferences, training courses and seminars;\n(d)         prepare annual reports and such other reports as may be required for\nconsideration by the Board;\n(e)         ensure implementation of the decisions of the Board;1[*]\n(f)         exercise such other financial and administrative powers as may be delegated\nto him by the Board 1[; and]\n1\n[(g)    oversee and guide the research agenda.]"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. 2[Global Climate",
      "content": "Change] Impact Studies Centre Fund.—(1) There shall be a Fund to\nbe known as the 2[Global Climate-Change] Impact Studies Centre Fund. The Fund shall vest in the\nCentre and shall be used by the Centre to meet its expenses.\n(2) The Fund shall comprise,—\n(a)              such sums as the Federal Government may allocate to the Centre in the annual\nbudget;\n(b)              grants or loans from the Federal Government and the Provincial Governments,\nor other such institutions or states with approval of the Federal Government;\n(c)              income from investments, royalties and receipts from other sources and\ndonations, etc;\n(d)              donations, gifts, bequests, etc; and\n(e)              all other sums which may by any manner become payable to or vest in the\nCentre in respect of any matter.\n(3) The Centre shall exercise highest standards of prudence as far as expenditures are\nconcerned."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Budget",
      "content": "The Centre, with approval of the Board, shall, by such date in each year as\nmay be prescribed, submit to the Federal Government for approval, a budget in the prescribed form\nfor each financial year showing estimated expenditure and the sums which are likely to be required\nfrom the Federal Government during that financial year.\n1\nOmitted, Subs. and Added by the Global Change Impact Studies Centre (Amdt.) Act No VI of 2023, s.6.\n2\nSubs. by the Global Change Impact Studies Centre (Amdt.) Act No VI of 2023, s.2."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Pay scales",
      "content": "The employees of the Centre shall be given Special Pay Scales (SPS) and\nshall also be entitled for any time to time increases, allowances or revisions in salary as are allowed\nto the employees of other organizations drawing SPS."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Maintenance of accounts",
      "content": "The Centre shall ensure proper maintenance of accounts\nand shall after the end of each financial year prepare a statement of accounts which shall include a\nbalance sheet and an account of government funds receipt and expenditure."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Audit",
      "content": "The accounts of the Centre shall be audited each year by the Auditor-General of\nPakistan, in accordance with relevant rules of the Centre and other applicable laws."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Annual report",
      "content": "Within ninety days from the end of each financial year, the Centre\nshall cause a report to be prepared on its activities including research studies conducted by the\nCentre during that financial year. The report shall be presented to the Board in its next meeting for\napproval. After approval by the Board, the report shall be released to public and presented to the\nPresident of Pakistan."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Recruitment of officers and staff",
      "content": "(1) With approval of the Board, all existing\nemployees of the GCISC, hereinafter referred to as the Project, shall, notwithstanding anything\ncontained in any law or in any agreement, deed, document or other instrument, stand absorbed and\ntransferred with the existing SPS to the Centre, after obtaining prior consent front such employees of\nthe Project and shall be deemed to have been appointed or engaged by the Centre in accordance with\nthe terms and conditions which shall not be less favourable than those in the Project and no\nemployee whose services are so absorbed and transferred shall be entitled to any compensation\nbecause of such absorption or transfer.\n(2) The Centre, with approval of the Board, may prescribe the procedure, terms and\nconditions of service for appointment of its officers and staff. The regional or provincial quota for\ninitial appointment shall be observed in accordance with the instructions issued by the Federal\nGovernment. The appointments to the posts of advisers, consultants, visiting scientists or experts\nshall be made in the Centre as per delegation of powers given by the Board.\n(3) The disciplinary and misconduct cases of the employees of the Centre shall be governed\nin accordance with rules of the Federal Government.\n(4) The employees of the Centre shall be entitled to such pension and gratuity or provident\nfund scheme as in force for Federal Government employees, from such date as the Board may notify."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Appointment by deputation",
      "content": "The Centre may appoint on deputation officers or staff of\nother Divisions or Departments or bodies or corporations, on equivalent or higher posts."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Delegation of powers",
      "content": "The Board may, by general or special order in writing, direct\nthat such of its powers shall, in such circumstances and under such conditions as may be prescribed,\nbe exercisable also by the Executive Director or by any other member or officer of the Centre."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Cooperation with international organizations, etc",
      "content": "The Centre may, subject to\napproval of the Federal Government, cooperate with foreign or international organizations concerned\nwith climate change-related research and studies. It shall act as facilitator for promoting cooperation\nbetween the climate change national institutions or organizations and relevant foreign and\ninternational organizations."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Discoveries and inventions",
      "content": "All rights including international property rights related to\ndiscoveries and inventions made by any officer or employee of the Centre in the course of his\nemployment shall vest in the Centre."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Validity of proceedings",
      "content": "No act or proceeding of the Centre or the Board shall be\ninvalid by reason only of the existence of a vacancy in, or defect in constitution of, the Centre or the\nBoard, as the case may be."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Indemnity",
      "content": "No suit, prosecution or other legal proceedings shall lie against the Centre,\nthe Board, the Chairman or any member, officer, staff, adviser or consultant of the Centre in respect\nof anything done or intended to be done in good faith under this Act or the rules made thereunder."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Common seal",
      "content": "(1) The Centre shall have a common seal and such seal be kept by the\nExecutive Director or such other person as may be authorized by the Executive Director.\n(2) The seal shall be authenticated in the manner as may be prescribed and any document\npurported to be sealed with the seal so authenticated shall be receivable as evidence of the particulars\nas stated in the document."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Winding up",
      "content": "The Centre shall not be wound up except by an order of the Federal\nGovernment in such manner as the Federal Government may prescribe."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Powers to make rules",
      "content": "The Board may, with the approval of the Federal Government\nand by notification in the Official Gazette, make rules for carrying out the purposes of this Act.\n________________"
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Board of Governors established under section 5;",
      "source_provision": "sec2"
    },
    {
      "term": "Centre",
      "definition": "the 1[Global Climate-Change] Impact Studies Centre (GCISC) established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "employees",
      "definition": "persons employed by the Centre;",
      "source_provision": "sec2"
    },
    {
      "term": "Executive Director",
      "definition": "the Executive Director of the Centre appointed under section 9;",
      "source_provision": "sec2"
    },
    {
      "term": "Fund",
      "definition": "the 1[Global Climate-Change] Impact Studies Centre Fund established under section 10;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules; and 1 Subs. by the Global Change Impact Studies Centre (Amdt.) Act No VI of 2023, s.2.",
      "source_provision": "sec2"
    },
    {
      "term": "research studies",
      "definition": "theoretical or experimental research work, including modeling and simulation techniques undertaken to acquire knowledge of fundamental principles of the climate change phenomenon and its impacts. 1[Global Climate-Change] IMPACT STUDIES CENTRE",
      "source_provision": "sec2"
    }
  ]
}
