{
  "id": "pk-government-management-of-private-estates-act-1892",
  "type": "statute",
  "title": "Government Management of Private Estates Act, 1892",
  "title_en": "Government Management of Private Estates Act, 1892",
  "short_name": "GMOPE",
  "status": "in_force",
  "issued_date": "1892-10-24",
  "in_force_date": "1892-10-24",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJ0%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Government Management of Private Estates Act, 1892 (X of 1892) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Title and extent.–(1) This Act may be called the Government Management of Private",
      "content": "Estates Act, 1892.\n[2(2) It extends to the whole of Pakistan.] ; 3*\n3\n[*      *          *          *           *          *            *]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.–In this Act, unless there is something repugnant in the subject or context,",
      "content": "(l)         “immoveable property” includes land, buildings, hereditary allowances, rights\nto ways, lights, ferries, fisheries or any other benefit to arise out of land, and\nthings attached to the earth or permanently fastened to anything which is\nattached to the earth but not standing timber, growing crops or grass;\n(2)         “gross income” includes all receipts of every kind in produce or cash, except\nmoney borrowed, recoveries of principal and the proceeds of sale of\nimmoveable property or of moveable property properly classed as capital; and\n(3)         “private estates under Government management” include–\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1892, Pt. V, p. 14; for Report of the Select Committee, see ibid., 1892, Pt. V, p. 69 and for\nProceedings in Council, see ibid., 1892, Pt. VI, p. 73.\nThis Act has been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950); and applied in the\nFederated Areas of Baluchistan, see Gazette of India, 1937, Pt. I, p. 1499.\nThis Act has been amended to the extent of Islamabad Capital Territory, see Ord. No. 27 of 1981, s. 5 and 4th Sch.\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for the original\nsub-section (2), as amended by the Burma Laws Act, 1898 (13 of 1898), s. 18 and Sch. V, the Federal Laws (Revision and Declaration) Act, 1951 (26\nof 1951), s. 8, and A. O., 1949, Arts. 3 (2) and 4.\n3\nThe word “and” at the end of sub-section (2), and sub-section (3) rep. by the Repealing and Amending Act, 1914 (10 of 1914), s.3 and Sch. II.\n(a)        estates under the Court of Wards;\n(b)        encumbered estates under Government management;\n(c)        estates attached for default of payment of Government revenue;\n(d)        minors’ estates placed under the guardianship of a revenue-officer of\nthe Government by a Civil Court;\n(e)        estates managed by a Collector in pursuance of any order made under\nthe 1[Code of Civil Procedure, 1908 (Act V of 1908)] (XLV of 1882)\nand\n(f)        all other estates made over to or taken under the management of a\nrevenue- officer of the Government as such under any law for the time\nbeing in force or in virtue of any agreement."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Power to levy rate. It shall be lawful for the 2[Provincial Government]–",
      "content": "(1)        to levy on all private estates under Government management a rate not\nexceeding five percent on the gross income, calculated, as nearly as may be\npossible, to cover\n(a)        the cost of all Government establishments in so far as they may be\nemployed in the supervision or management of such estates other than\nestablishments specially entertained for the supervision or management\nof any particular estate or group of estates, and\n(b)        all contingent expenditure incurred in consequence of such supervision\nor management;\n(2)        from time to time to vary such rate; and\n(3)        to reduce or remit such rate in any special case or cases as may be equitable:\nProvided that, in deciding the amount of the rate to be levied under this Act on any particular\nestate or group of estates, the 2[Provincial Government] shall consider the expenditure incurred on\nspecial establishments for such estate or estates."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to levy special charges. In cases where an officer of the Government is employed",
      "content": "to give legal advice or to audit accounts on behalf of any estate, the 2[Provincial Government], if it\nconsiders the services rendered to be of a special nature, may, in its discretion, direct a special charge\nto be made against that estate on account of such services, irrespective of the rate leviable under the\nlast foregoing section.\n1\nSub by Ord. XXVII of 1981, s.5 & Sch. IV (only to the extent of Islamabad Capital Territory).\n2\nSubs. by A. O., 1937, for “L. G.”."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Saving as to special expenditure. Nothing in this Act shall apply to the cost of",
      "content": "establishments specially entertained or to expenditure of any description specially incurred in respect\nof any particular estate or estates."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Validation of levy of past rates. All rates for general supervision or management levied",
      "content": "by any 1[Provincial Government] before the commencement of this Act shall be deemed to have\nbeen levied under this Act."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Powers to make rules. The 1[Provincial Government] may make any rules2 and issue any",
      "content": "orders which may be necessary for carrying this Act into effect, and which are consistent therewith."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Exemption from jurisdiction of Courts. Where any Government establishment is",
      "content": "employed in such supervision as aforesaid, the 1[Provincial Government] shall be the sole judge of\nthe cost attributable to such employment, and its decision thereon shall not be questioned in any\nCourt of Law or otherwise."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. [Repeal.] Rep.by the Repealing and Amending Act, 1914 (X of 1914), s.3 and Schedule II",
      "content": "__________\nDate: 05-09-2024\n1\nSubs. by A. O., 1937, for “L. G.”.\n2\nFor rules made under this section, see different local Rules and Orders."
    }
  ],
  "definitions": [
    {
      "term": "immoveable property",
      "definition": "land, buildings, hereditary allowances, rights to ways, lights, ferries, fisheries or any other benefit to arise out of land, and things attached to the earth or permanently fastened to anything which is attached to the earth but not standing timber, growing crops or grass; (2) “gross income” includes all receipts of every kind in produce or cash, except money borrowed, recoveries of principal and the proceeds of sale of immoveable property or of moveable property properly classed as capital; and (3) “private estates under Government management” include– 1 For Statement of Objects and Reasons, see Gazette of India, 1892, Pt. V, p. 14; for Report of the Select Committee, see ibid., 1892, Pt. V, p. 69 and for Proceedings in Council, see ibid., 1892, Pt. VI, p. 73. This Act has been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950); and applied in the Federated Areas of Baluchistan, see Gazette of India, 1937, Pt. I, p. 1499. This Act has been amended to the extent of Islamabad Capital Territory, see Ord. No. 27 of 1981, s. 5 and 4th Sch. 2 Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for the original sub-section (2), as amended by the Burma Laws Act, 1898 (13 of 1898), s. 18 and Sch. V, the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 8, and A. O., 1949, Arts. 3 (2) and 4. 3 The word “and” at the end of sub-section (2), and sub-section (3) rep. by the Repealing and Amending Act, 1914 (10 of 1914), s.3 and Sch. II. (a) estates under the Court of Wards; (b) encumbered estates under Government management; (c) estates attached for default of payment of Government revenue; (d) minors’ estates placed under the guardianship of a revenue-officer of the Government by a Civil Court; (e) estates managed by a Collector in pursuance of any order made under the 1[Code of Civil Procedure, 1908 (Act V of 1908)] (XLV of 1882) and (f) all other estates made over to or taken under the management of a revenue- officer of the Government as such under any law for the time being in force or in virtue of any agreement.",
      "source_provision": "sec2"
    }
  ]
}
