{
  "id": "pk-gwadur-application-of-central-laws-ordinance-1960",
  "type": "statute",
  "title": "Gwadur (Application of Central Laws) Ordinance, 1960",
  "title_en": "Gwadur (Application of Central Laws) Ordinance, 1960",
  "short_name": "GOCLO",
  "status": "in_force",
  "issued_date": "1960-08-30",
  "in_force_date": "1960-08-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-a5abag%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Gwadur (Application of Central Laws) Ordinance, 1960 (XXXVII of 1960) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Savings",
      "content": "ORDINANCE No. XXXVII OF 1960.\n[31st August, 1960]\nAn Ordinance for applying to Gwadur all Central laws which are or may hereafter be in force in the\nMekran District in the Kalat Division of the Province of West Pakistan.\nWHEREAS Gwadur, being ceded to Pakistan on the eighth day of September, 1958, became\non that day one of the territories included in Pakistan ;\nAND WHEREAS Article 2 of the Gwadur (Government and Administration) Order, 1958 (P.\nO. 8 of 1958), provides that until otherwise determined by competent authority, Gwadur shall, for\npurposes of government and administration, and all matters connected therewith, constitute part of\nthe Mekran District in the Kalat Division of the Province of West Pakistan. ;\nAND WHEREAS it is expedient to apply to Gwadur all Central laws which are or may\nhereafter be in force in the aforesaid Mekran District ;\nNOW, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958,\nand in exercise of all powers enabling him in that behalf, the President is pleased to make and\npromulgate the following Ordinance:―"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Application of 2[Federal] Laws.―(1) All 2[Federal] Acts, including all Orders and other",
      "content": "enactments, and all notifications, rules, bye-laws or directions made or issued thereunder, which\nwere in force in the District of Mekran in the Kalat Division of the Province of West Pakistan\nimmediately before the eighth day of September, 1958, shall be and shall be deemed to have been in\nforce in Gwadur with effect from the said day, and shall continue in force, subject always to such\namendments as may have been or may be made therein by or under proper authority.\n1\n[*       *                     *                    *                    *                     *                    *]"
    }
  ],
  "definitions": []
}
