{
  "id": "pk-health-services-academy-ordinance-2002",
  "type": "statute",
  "title": "Health Services Academy Ordinance, 2002",
  "title_en": "Health Services Academy Ordinance, 2002",
  "short_name": "HSAO",
  "status": "in_force",
  "issued_date": "2002-10-03",
  "in_force_date": "2002-10-03",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Fta50%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Health Services Academy Ordinance, 2002 (LXII of 2002) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1)This Ordinance may be called the Health\nServices Academy Ordinance, 2002.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Ordinance, unless there is anything repugnant in the\nsubject or context.-\n(a)      \"Academy\" means the Health Services Academy;\n(b)      \"Board\" means the Board of Governors of the Academy;\n(c)     \"Committee\" means the Executive Committee of the\nAcademy;\n(d)     \"Council\" means the Academic Advisory Council of the\nAcademy;\n(e)     \"Executive Director\" means the Executive Director of the\nAcademy;\n(f)      \"rules\" and \"regulations\" mean the rules and regulations made\nunder this Ordinance; and\n(g)     \"Teacher\" includes Head of Department, Professors, Associate\nprofessors, Assistant Professors, Lecturers, Instructors and\nResearch Staff engaged by the Academy, or such other persons\nas may be recognised to be teachers by the Committee."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Academy",
      "content": "(1) There shall be established an Academy\nto be called the Health Services Academy Islamabad consisting of-\n(a)    the members of the Board;\n(b)    the Committee and other bodies as the Board may establish;\n(c)    the Executive Director and the Teachers of the academy;\n(d)     the teachers and students of the Academy and its constituent\nand affiliated units; and\n(e)     such other officers and members of the staff as the Board may,\nfrom time to time, specify.\n(2) The Academy shall be an autonomous body by the name of the Health Services\nAcademy having perpetual succession and a common seal, with powers, among others, to\nacquire, hold, control and dispose of moveable and immovable properties and shall by the\nsaid name sue and be sued.\n(3) The headquarters of the Academy shall be at Islamabad and it may set up its\nbranches at such places in Pakistan as the Board may determine."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Functions and powers of the Academy",
      "content": "To perform its academic and\nadministrative functions in order to achieve its objectives, the functions and powers of the\nAcademy shall be-\n(a)    s to provide for instruction and training in health sciences,\ntechnology and other allied disciplines in such manner as it\nconsiders appropriate       so as to produce competent,\nimaginative, skilled and committed health professionals,\ndoctors, scientists and experts;\n(b)     to undertake joint investigation and collaborative research in\nthe field of health sciences, biomedical technology and other\nallied disciplines;\n(c)     to provide assistance to health and allied professions,\ninstitutions and organisations in Pakistan and abroad through\nexpert advice, consultations, institutional consultancies and in\nany other manner as it may deem fit;\n(d)   to promote contact and establish linkages with national and\ninternational institutions and other academic, research and\ndevelopment organisations in Pakistan and abroad for effective\ndischarge of its functions and responsibilities;\n(e)      to pursue and make provisions for research, innovations,\ninventions, demonstrations and other services as it may deem\nfit;\n(f)     to print, publish and circulate periodicals, journals, magazines\nand books and disseminate scientific, technological and other\nrelated knowledge and information conducive to the attainment\nof any of the objectives of the Academy;\n(g)     to admit, teach and examine students;\n(h)     to confer or award degrees, memberships, fellowships,\ndiplomas, certificates, academic and research prizes and\ndistinctions on, and to, persons who fulfill the requirements; or\nhave passed its examinations under arrangement and in\ncollaboration with the, Quaid-i-Azam University;\n(i)     to affiliate other institutions, in accordance with rules and\nregulations and to provide for the teaching of specified\ncourses and training for persons not being the students of\nthe Academy and grant certificates, diplomas and degrees to\nsuch persons by the Quaid-i-Azam University;\n(j)     to accept the examinations passed and the period of study\nspent at other places of learning as equivalent, to such\nexaminations and periods of study in the Academy as it may\ndetermine;\n(k)     to create posts within the available financial resources for\nteaching, research, extension, administration, training and other\nrelated purposes;\n(l)     to inspect hospitals, schools, colleges and other\ninstitutions of learning affiliated or seeking affiliation with it\nand grant affiliation in accordance with prescribed procedure;\n(m)     to institute and award honoraria, scholarships, stipends,\nbursaries, medals and prizes under prescribed conditions;\n(n)    to establish, administer and maintain halls of residence and\napprove place as hostel and lodging for students;\n(o)    to supervise and control the discipline of the students of the\nAcademy, and promote extra- curricular and recreational\nactivities of such students, and to make arrangements for\npromoting their health and general welfare;\n(p)    to demand and receive fees and other charges as it may\ndetermine;\n(q)    to authorise the mobility of qualified staff among\nvarious      institutions,   research organisations and the\nGovernment or corporate bodies on the terms and conditions\nlaid down in the Rules or Regulations;\n(r)    to institute     Professorship,  Associate Professorship,\nAssistant Professorship, Research Associate-ship, and any\nother posts, and make appointments thereto;\n(s)     to prescribe courses of studies in health sciences, biomedical\ntechnology and other allied disciplines; and to decide\nteaching methods and strategies in order to ensure the\nmost effective educational and training programmes;\n(t)    to establish field demonstration areas, laboratories,\nmuseums and other facilities for training, education and\nresearch;\n(u)    to affiliate or associate itself with other institutions and to\nestablish faculties in Pakistan or abroad for the effective\ndischarge of its functions;\n(v)    to use its funds, financial and other resources to the fullest\nextent for the execution of its programmes;\n(w)    to enter into agreements, contracts and arrangements with\norganisations, institutions, bodies and individuals for the\npurpose of carrying out its functions and activities;\n(x)    to receive and manage property transferred and grants,\nbequests, trusts, gifts, donations, endowments and other\ncontributions made to it and invest any funds representing\nsuch property, grants, bequests, trusts, gifts, donations,\nendowments or contributions and to convert one kind of\nproperty into other, in such manner as it may deem fit; and\n(y)     to do all such other acts and things as may be required to\nfurther its objectives and performance of its functions."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Academy open to all classes and creeds, etc",
      "content": "The Academy shall be open to\nall persons of either sex of whatever religion, race, creed, colour or domicile who are\nacademically qualified for admission to the courses of study offered by the Academy, and no\nsuch person shall be denied the privileges of the Academy on grounds of sex, religion, creed,\nrace, class, colour or domicile."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Board of Governors",
      "content": "The overall control of the Academy shall vest in the\nBoard of Governors of the Academy which shall consist of the following members, namely:-\nMinister of Health, Government of Pakistan…………………… Chairman\nSecretary, Ministry of Health…………………………………                       Vice-Chairman\nDirector General, Ministry of Health…………………………... Member\nPresident, Pakistan Medical and Dental Council……………...           Member\nVice-Chancellor, Quaid-I-Azam University…………………… Member\nExecutive Director, Pakistan Medical Research Council……...       Member\nFinancial Adviser, Ministry of Health…………………………                  Member\nSecretary, Department of Health, Punjab……………………..                Member\nSecretary, Department of Health, Sindh………………………. Member\nSecretary, Department of Health, NWFP……………………… Member\nSecretary, Department of Health, Balochistan………………… Member\nThree distinguished persons known for their learning or\nexperience in the field of banking, finance, industry or any other\nrelated   field     but     including     one     eminent health\nscientist………………………………………………………... Member\nExecutive Director of the Academy……………………………                     Member\n(2) The Executive Director of the Academy shall act as Secretary of the Board."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Term of members",
      "content": "(1) The term of members, other than ex officio\nmembers, shall be three years.\n(2) A member other than an ex officio member may resign his office by writing under\nhis hand addressed to the Chairman of the Board.\n(3) When a person is appointed to be a member of the Board by virtue of his holding\nan office or appointment, he shall cease to be such member when he ceases to hold that office\nor appointment."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Power and Functions of the Board of Governors",
      "content": "(1) The Board shall\nexercise powers and perform the following functions, namely;-\n(a)    to approve the creation of new components of the Academy\nsuch as a department, faculty or any other teaching or research\nunit;\n(b)    to approve changes in the constitution of any Committee\nor any other body of the Academy;\n(c)     to perform all such other activities as may be required for the\nfurtherance of the objectives of the Academy;\n(d)    to delegate any of its powers to any Committee, the\nExecutive   Director     or    other appropriate levels of\nmanagement, subject to such conditions as it may deem fit.\n(e)    to approve long term strategy, policies and plans governing the\nactivities and operations of the Academy so as to ensure its\nautonomy in teaching, research and other academic work;\n(f)     to approve plans of work and the annual budget of the\nAcademy;\n(g)      to fix the remuneration, allowances and honoraria for all the\nstaff, both academic and administrative, commensurate with\ntheir qualifications and experience, in order to attract the best\ntalent from within and outside Pakistan for the Academy;\n(h)     to call for annual progress reports relating to the activities of\nthe Academy and execution of the approved work plans to\nreview the progress and to direct the Executive Director to\nfurnish information relating to any matter specified by the\nBoard;\n(i)     to create such administrative or academic posts within the\navailable resources on specified terms and conditions as it\nmay deem necessary and to approve appointment to the\nadministrative and academic posts, on the recommendation of\na duly constituted Selection Committee;\n(j)      to ensure financial viability of the. Academy and effectiveness\nof its operations, their continuity and preservation of the\nautonomy of the Academy;\n(k)      to approve all affiliations and other arrangements through\nwhich other educational and research organizations may\nbecome associated with the Academy and vice versa;\n(l)     to appoint from amongst its members such committees or sub-\ncommittees as it may deem necessary;\n(m)      to take all such initiatives as it may consider necessary or\ndesirable for the efficient and effective management of the\nAcademy; and\n(n)     to approve the rules and regulations of the Academy.\n(2) Until the rules referred to in clause (n) of sub-section(1) are framed, the officers\nand employees of the academy shall continue to be governed by the rules applicable to\nthem immediately before the commencement of this Ordinance.\n(3) In the discharge of its functions, the Board shall be guided on questions of policy\nby the instructions, if any given to it from time to time by the Federal Government, who shall\nbe the sole judge as to whether a question is a question of policy."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Meetings of the Board",
      "content": "(1) The Board shall meet at least twice a year at\nsuch place, date and time as may be notified to the members by the Secretary of the Board\nwith the approval of the Chairman.\n(2)    The quorum for the meeting of the Board shall not be less than six members, a\nfraction being counted as one.\n(3)    The decision of the Board shall be expressed in terms of the view of the\nmajority of the members present and voting and in the event of tie, the Chairman of the board\nshall have, and exercise, a casting vote.\n(4)     The meeting of the Board shall be presided over by the Chairman and, in his\nabsence, by the Vice-Chairman.\n(5)     Where the proceedings of the meeting called under sub-section (1) cannot\ncommence due to lack of quorum or where the meeting of the Board could not be called and\nagenda needed immediate consideration by the Board, the agenda may be considered by\ncirculation to the members of the Board by the Secretary, with the approval of the Chairman.\nThe decision taken by the majority members shall be construed as a decision taken in the\nmeeting of the Board convened under this section;\n(6)     No act or proceeding of the Board shall be invalid by reason only of the\nexistence of any vacancy in, of defect in constitution of, the Board."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Academic Advisory Council",
      "content": "The Academy shall have Academic Advisory\nCouncil nominated by the Committee and consisting of national and international doctors,\nscientists, academicians and other experts to-\n(a) delineate priorities foe research;\n(b)    guide and direct the executive committee on all academic\nmatters;\n(c)   recommend such measures which will foster and enhance\ninteraction and collaboration between the Academy and other\nexisting national and international organisations, institutions\nand research centres; and\n(d)     work out and propose affiliation measures with foreign\ninstitutions of repute."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Executive Committee",
      "content": "(1) Subject to the control of the Board, the general\nsupervision and control of the affairs of the Academy shall vest in the Executive Committee\nwhich shall consists of the following members, namely:-\n(a)     the Executive Director who shall be its Chairman;\n(b)     one senior Teacher; and\n(c)      a representative of Ministry of Health not below the rank of\nJoint Secretary.\n(2)      The Executive Director shall, when present, preside over the meetings of the\nCouncil and, in his absence, a member nominated by him shall preside."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Powers and duties of the Executive Committee",
      "content": "(1) Subject to the general\ncontrol of the Board, the Committee shall carry out its day-to-day administration.\n(2)     In particular and without prejudice is the generality of the foregoing\nprovision, the Committee shall have the power -\n(a) to hold, control and administer the property, funds and resources of\nthe Academy and borrow or raise money for the purposes of\nthe Academy upon such securities as may be required;\n(b)     to manage, acquire or dispose of any movable or immovable\nproperty of the Academy;\n(c)     to exercise executive and financial control over the\nadministration of the Academy;\n(d)     to prepare the annual budget estimates and annual statements of\naccounts of the Academy;\n(e)     to lay down and define functions of various constituent parts of\nthe Academy, including its departments and committees;\n(f)     to sanction in collaboration with the Quaid-i-Azam\nUniversity schemes for the programmes of teaching and\nresearch in health sciences, biomedical technology and other\nallied disciplines leading to the award of degrees by Quaid-i-\nAzam University;\n(g)      to develop and approve programmes of specialized teaching or\ntraining leading to the award of diplomas or certificates in areas\nof health sciences, allied disciplines and biomedical\ntechnology;\n(h)     to approve schemes of faculty development                for\nspecialisation in health science, biomedical technology and\nother allied disciplines;\n(i)     to develop and promote collaboration with other appropriate\nbodies for the development of courses in health sciences,\nbiomedical technology and other allied disciplines;\n(j)     to secure the services of experts on terms and conditions as it\nmay deem fit;\n(k)     to perform such other functions as may be necessary for the\nrealisation of its approved targets and objectives; and\n(l) to delegate, from lime to time, to the Officers, Teachers and other\nappropriate levels of management such powers and functions\nas it may consider necessary for the purposes of this Ordinance."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Officers of the Academy",
      "content": "The following shall be the officers of the\nAcademy, namely:-\n(a)     the Executive Director; and\n(b)      such other persons as may be prescribed by the rules or\nregulations to be the officers of the Academy."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Executive Director:__ (1)The Executive Director shall be the chief",
      "content": "executive\nofficer of the Academy and shall be appointed by the Federal Government on such\nterms and conditions as it may determine.\n(2)     The Executive Director shall exercise general control and supervision over the\naffairs of the Academy and shall ensure that the provisions of this Ordinance, the rules and\nregulations, policies and directions of the Board and the Committee are properly executed.\n(3)     The Executive Director shall perform such other functions as may be entrusted\nto him by the Board or the Committee and in particular shall-\n(a)     submit plans of work and budget estimates of the Academy for\napproval of the Board; and\n(b)     submit to the Board, in accordance with the rules and\nregulations, reports on the activities of the Academy.\n(4)     The Executive Director shall also have power-\n(a)      to supervise the activities connected with the execution of\nprogrammes for teaching, training, research, inventions,\ninnovations, demonstrations, institutional consultancies and\nother services;\n(b)     to authorise expenditure provided for in the budget            in\naccordance with the rules and regulations;\n(c)    to appoint, with the approval of the Committee, teachers and\nofficers of the Academy and such other persons as may be\nnecessary in accordance with the rules and regulations so as to\nensure the highest intellectual and moral qualities in the\npersons appointed;\n(d)    to re-appropriate funds within the approved budget with\nprevious approval of the Board;\n(e)     to engage experts, consultants and advisers as may be required\nfor efficient and effective discharge of the functions of the\nAcademy;\n(f)     to constitute from amongst the officers and staff of the\nAcademy such committees, sub- committees and working\ngroups as he may deem necessary;\n(g)     to perform such other functions and exercise such other powers\nas may be entrusted, or delegated, to him by the Board or the\nCommittee, from time to time; and\n(h)    to delegate any of his powers to appropriate levels of\nmanagement subject to such conditions as he may deem fit."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Transfer of employees, etc:__to the Academy",
      "content": "(1) Notwithstanding anything\ncontained in any law, contract or agreement or in the conditions of service, every\ncivil servant employed in the Health Services Academy existing immediately before the\ncommencement of this Ordinance, including persons on deputation to other organizations or\nabroad, shall, save as hereinafter provided, cease to be a civil servant and stand transferred to\nand become an employee of the Academy, on the same terms and conditions including\nremuneration, tenure of service, rights and privileges as to pension and gratuity and other\nmatters applicable to them immediately before commencement of this Ordinance until his\nemployment in the Academy is terminated in accordance with his conditions of service\nor his terms and conditions are altered by regulations which shall not be less favourable\nthan those by which he was governed immediately before his transfer to the Academy.\n(2)   Any person on deputation to the Academy immediately before the\ncommencement of this Ordinance, dependent on his choice and with the permission of\nlending organization, shall either continue in the employment of the Academy on deputation\nin accordance with the terms of his deputation or shall stand transferred to the Academy on\nthe same terms and conditions, including remuneration, tenure of service, rights and\nprivileges as to pension and gratuity and other matters, as were applicable to him\nimmediately before his transfer to the Academy.\n(3)     Any person referred to in sub-sections (1) and (2) may, within three months\nfrom the commencement of this Ordinance, who may, or may not, opt to be transferred to the\nservice of the Academy and the option so exercised shall be final.\n(4)   The Federal Government shall pay to the Academy pension, gratuity and\nprovident fund accumulations in respect of each employee transferred under sub-section (1)\nin such manner and to such extent as may the Federal Government determine.\n(5)     No person who stands transferred to the Academy shall, notwithstanding\nanything contained in any law for the time being in force, be entitled to any compensation\nbecause of his transfer."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Fund, audit and accounts, etc",
      "content": "(I) The Academy shall have a FUND which\nshall consist of –\n(a)    all grants and contributions made to the Academy;\n(b)    donations, contributions, subscriptions, aid and grants made by\nthe donors;\n(c)    aid, grants and other forms of assistance by any foreign\ngovernment, Federal Government, Provincial Government and\nlocal bodies, national and international institutions,\norganizations and agencies;\n(d)     fees, subscriptions, charges and any other payments for any\nservice rendered, such as training, institutional consultancies,\nsale proceeds, royalties on publications, commission and\nreceipts from any other source; and\n(e)    income from any investment and deposits.\n(2)   The accounts of the Academy shall be maintained and audited each year in\nsuch form and in such manner as may be specified by the Board in consultation with the\nAuditor-General of Pakistan."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Indemnity",
      "content": "(1) No suit, prosecution or other legal proceedings shall be against\nany person or authority for anything which is in good faith done or intended to be done under\nthis Ordinance.\n(2)    No decision taken, act or thing done, by the Ministry of Health or the Board\nor the Committee or the Council under this Ordinance shall be called in question before any\ncourt of law or any other authority."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Power to make rules",
      "content": "The Federal Government may, by notification in the\nofficial Gazette, make rules for carrying out the purposes of this Ordinance, including\nrules to regulate the financial and administrative matters related to the Academy."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Power to make regulations",
      "content": "The Executive Committee may, with the\napproval of the Board, by notification in the official Gazette, make regulations, not\ninconsistent with this Ordinance and the rules, providing for all matters for which\nprovision is necessary or expedient for giving effect to this ordinance and efficient\nconduct of the affairs of the Academy."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Removal of difficulties",
      "content": "(1) If any difficulty arises in giving effect to\nany of the provisions of this Ordinance the Ministry of Health may make such order, not\ninconsistent with the provisions of this Ordinance, as may appear to him to be necessary for\nremoving the difficulty.\n(2)     Where this Ordinance makes any provision for anything to be done, but no\nprovision, or no sufficient provision has been made as respecting the authority by whom, or\nthe time at which, or the manner in which it shall be done, then it shall be done by such\nauthority, or at such time or in such manner, as the Ministry of Health may direct."
    }
  ],
  "definitions": [
    {
      "term": "Academy",
      "definition": "the Health Services Academy;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of Governors of the Academy;",
      "source_provision": "sec2"
    },
    {
      "term": "Committee",
      "definition": "the Executive Committee of the Academy;",
      "source_provision": "sec2"
    },
    {
      "term": "Council",
      "definition": "the Academic Advisory Council of the Academy;",
      "source_provision": "sec2"
    },
    {
      "term": "Executive Director",
      "definition": "the Executive Director of the Academy;",
      "source_provision": "sec2"
    },
    {
      "term": "Teacher",
      "definition": "Head of Department, Professors, Associate professors, Assistant Professors, Lecturers, Instructors and Research Staff engaged by the Academy, or such other persons as may be recognised to be teachers by the Committee.",
      "source_provision": "sec2"
    }
  ]
}
