{
  "id": "pk-heavy-industries-taxila-board-act-hit-1997",
  "type": "statute",
  "title": "Heavy Industries Taxila Board Act (HIT), 1997",
  "title_en": "Heavy Industries Taxila Board Act (HIT), 1997",
  "short_name": "HITBA",
  "status": "in_force",
  "issued_date": "1997-11-30",
  "in_force_date": "1997-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5Zj-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Heavy Industries Taxila Board Act (HIT), 1997 (XII of 1997) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement.― (1) This Act may be called the Heavy Industries",
      "content": "1\n[Taxila] Board Act, 1997.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,―",
      "content": "(a)        \"Board\" means the Heavy Industries 1[Taxila] Board established under\nsection 3;\n(b)        \"Chairman\" means the Chairman of the Board;\n(c )       \"factories\" means Heavy Re-build Factories and Manufacturing Factories\nestablished and functioning under the control of Heavy Industries 1[Taxila]\nBoard;\n(d)        \"Heavy Industries\" means the Heavy Industries, Taxila, and includes Heavy\nRe-build Factories, Manufacturing Factories and other allied facilities owned\nby the Federal Government; and\n(e)        \"member\" means a member of the Board."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Board.―(1) As soon as may be, after commencement",
      "content": "of this Act, the Federal Government shall, by notification in the Official Gazette, establish for\ncarrying out the purposes of this Act, a Heavy Industries 1[Taxila] Board consisting of a\nChairman and 1[five] members to be appointed by it.\n(2) The Chairman shall be appointed by the Federal Government on recommendation of the\nChief of Army Staff.\n(3) Out of the 1[five] members to be appointed by the Federal Government, one shall be\nappointed as member finance in consultation with the Ministry of Finance, the second to be as\nthe member Ministerial Co-ordination, 1[third member shall be appointed from the corporate sector,\nto be called the Member (Private), on the recommendation of the Secretary, Defense Production\nDivision] and the remaining two to be the technical members as members production Control\nand Project Planning to be appointed from within the existing strength of the Board.\n1Ins. and subs. by Ordinance XLVII of 2000, by ss.2-5."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Terms of office of the members.―(1) The Chairman and members shall hold office",
      "content": "for a term of four years and shall be eligible for re-appointment and shall receive such salary\nand allowances as the Federal Government may, from time to time, determine1[:]\n1\n[Provided that the Member (Private) shall hold office in honorary capacity.]\n(2) Every member, except member Ministerial Co-ordination,1 [and Member (Private)]\nshall be a whole time officer of the Board and shall perform such functions as are or may be\nassigned to him under this Act.\n(3) Every member 1[except Member (private)] shall, before assuming his office,\nrelinquish or divest himself of any office or interest in any corporation, company or concern\nother than an industry owned by the Federal Government or sponsored by the Board or Co-\noperative Society, or a charitable organization:\nProvided that the Federal Government may permit a member to retain any shares in a\ncompany purchased by him if the company of which the shares have been acquired does not have\nany dealings with the Board; and in case of company of which a member holds shares starts\ndealings with the Board, the member shall immediately declare to the Board the extent of his share\nin the company."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Meetings.―(1) No business of the Board shall be transacted except at a meeting at",
      "content": "which a quorum of at least three members is present.\n(2) The Chairman and, in his absence, the senior most member shall preside at the meetings\nof the Board.\n(3) At the meetings of the Board each member shall have one vote and, in the event of\nequality of votes, the Chairman or the member presiding shall have a second or casting vote.\n(4) A resolution in writing signed by all the members for the time being in Pakistan\nshall be as valid and effective as if it has been passed at the meeting of the Board."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Functions of the Board.―(1)The principal functions of the Board shall be to",
      "content": "manage,1[organize or, as the case may be, within the existing financial resources, reorganize any\nfactory] and administer the affairs of the factories included in Heavy Industries and to run\nthem on sound administrative and modern management techniques so as to adequately meet,\nduring war and peace, the needs of the defence of the country and to utilize the 2[commercial\npotential] of the factories to meet the requirements of the civilian population and the brotherly or\nfriendly countries.\n1\nSubs and Ins. by ordinance XLVII of 2000, by ss.6-7.\n2\nSubs. By Act VI of 2019, by s,2.\n(2) The Board shall, in discharging its functions, be guided on questions of policy involving\nnational interest, including defence requirement during war and peace, by such directions as the\nFederal Government, which shall be the sole judge whether or not national interest is involved, may\ngive from time to time."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Investment of the Board with certain powers. Notwithstanding anything contained in",
      "content": "any law, regulations, rules, order, notification, agreement or other instrument for the time being\napplicable to any factory, or any officer or other employee appointed or engaged in, or in connection\nwith any factory, the Board may in relation to such factory, officer or employee exercise the following\npowers in addition to the powers which may be delegated by the Federal Government, from time to\ntime,―\n(a)     to determine the terms and conditions of service, recruitment, promotion,\ntransfer, posting, dismissal, discharge, demotion and other disciplinary action\nof all officers and other employees:\nProvided that the terms and conditions of service of any officer or other employee appointed\nor engaged before the commencement of this Act shall not be varied to his disadvantage and that he\nshall not be dismissed or removed from service or reduced in rank by any authority subordinate to that\nby which he was appointed:\nProvided further that the officer or employees appointed before the commencement of this Act\nshall be given an option, after the service rules for the officers and employees of the Board have been\nframed, to opt for the new service rules or to continue to be governed by their existing services rules;\nbut once the option has been exercised by an officer or employee within the time fixed by the Board,\nit shall be final, and an officer or employee who does not exercise the option within the prescribed\ntime shall be considered to have opted for the new rules:\nProvided also that the promotion, demotion or other disciplinary action against an officer or\nemployee on deputation or secondment shall be governed by the service rules applicable to him; and\n(b)     to appoint or engage such officers and other employees, advisors, consultants\non contract as it consider necessary for the efficient discharge of the functions\non such terms and conditions of service as it may determine;\n(c)     to carry out all technical and engineering projects or works or to enter into\ncontract or agreement and to arrange training within country or abroad\npertaining to their execution;\n(d)     to make all purchases or plant, machinery and stores either in the country or\nabroad and also to dispose of store and equipment;\n(e)     to fix pay of the officers and other employees wherever necessary either\ninitially or otherwise at any stage within the pay scales prescribed by the\nFederal Government;\n(f)     to utilize or incur expenditure in respect of lumpsum grant allocated for\nthe purpose in the Budget;\n(g)    to frame, subject to any direction issued in this behalf by the Federal\nGovernment, departmental financial and accounting rules and procedures,\nkeeping in view the modern techniques for cost control and optimum\nutilization of resources; and\n1\n[(h)   to utilize, create and enhance commercial capacity and capability for\nmanufacturing marketable products, promote sales thereof and provide\nservices within country and abroad, through;-\n(A)   establishment of limited company under the Companies Act,\n2017 (XIX of 2017) to undertake with approval of the Board,\ncommercial activities on corporate lines with private or public\nsectors both within country and abroad for the following,\nnamely:—\n(i)     undertake joint ventures with experienced national and\ninternational partners;\n(ii)    establish subsidiary companies;\n(iii)   without utilizing public money, raise funds through\nprivate investment or bank credit;\n(iv)    maintain receipt and expenditure account of the\ncommercial revenue in scheduled banks jointly\noperated in consultation with member finance;\n(v)     frame audit, accounts and costing manuals on modern\ntechniques;\n(vi)    marketing of commercial products through internal\nmarketing department or through hiring of agents; and\n(vii)   formulate own recruitment and procurement\nprocedures.\n(B)   the company and its subsidiaries are subject to audit by the\nChartered Accountants firms; and\n(C)   revenue earned by utilizing commercial activities to subsidize\ndefence budget which will reduce burden on national\neconomy, for reinvestment and to provide benefit to the\nBoard’s management and employees in prescribed manners.]"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Submission of estimates of receipts and expenditures to the Federal",
      "content": "Government.―(1) The Board shall in the month of December every year, submit in such manner\nand form as the Federal Government may direct, to the Federal Government, for making necessary\nprovision in its Budget, a statement of the discharge of its functions under this Act in respect of the\nnew financial year together with a statement showing separately the estimated receipts and\nexpenditure in foreign exchange for that year.\n(2) The Board shall not, without the previous sanction of the Federal Government, incur any\nexpenditure or undertake any financial liability involving expenditure, in excess of the amount\napproved for the projects.\n1\nSubs. by Act VI of 2019, by s,3."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Accounts, audit and costings.―(1) The Board shall maintain its accounts including those",
      "content": "of the factories in such manner and form as may be prescribed by the Federal Government in\nconsultation with the Auditor-General of Pakistan.\n(2) The accounts of the Board including those of the factories shall be audited by the Auditor-\nGeneral of Pakistan.\n(3) The Board shall, within six months after the end of every financial year, submit to the\nFederal Government a statement of accounts audited by the Auditor-General of Pakistan.\n(4) The Federal Government may at any time require Auditor-General of Pakistan to report\nto it upon the adequacy of measures taken by the Board for the efficient management of the factories.\n(5) The Board shall establish a costing mechanism in all the factories so as to exercise\neffective cost control and organize production on modern commercial lines."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Submission of annual report, return etc.―(1) The Board shall, as soon as possible",
      "content": "after the end of every financial year but not later than thirty-first day of December next following,\nsubmit to the Federal Government a report on the conduct of the affairs of the Board during that\nyear.\n(2) The Federal Government may require the Board to furnish it with―\n(a)        any return, statement, estimate, statistics or other information regarding\nany matter relating to or under control of the Board;\n(b)        a report on any subject with which the Board is concerned; or\n(c)        any document or copy of a document in charge or under the control of the\nBoard and the Board shall comply with such requisition."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Delegation of powers. The Board may, from time to time, authorize 1[the Chairman,]",
      "content": "any one or more of its members 1 [or any subordinate authority of Heavy Industries] to perform such\nfunctions or exercise such powers on its behalf as may be specified by the Board through a\nresolution passed at a meeting with proper quorum, and the 1[Chairman, Member or the\nsubordinate authority] so authorized shall conform to such regulations or restrictions as may be\nprescribed by the Board."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Mode of signifying communications from the Board. Any notice, determination,",
      "content": "directions, requisition, appointment, expression of opinion, approval or sanction to be given or\nsignified on the part of the Board for any of the purposes of, or in relation to, any powers or\nfunctions with which it has been invested under this Act, shall be sufficient and binding if it\nis in writing signed by the Chairman or by any other person authorized by the Board to act in its\nbehalf of the matters to which such authorization may relate, and the Board shall not in any case be\nbound in respect of any of the matters aforesaid unless by some writing signed in the manner\naforesaid."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Power to issue direction. The Federal Government may, from time to time, issue",
      "content": "directions to the Board to take such measures as it considers necessary for the efficient management\nof the factories and the Board shall comply with such directions.\n1Ins and subs. by Ordinance XLVII of 2000, by s.8."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Dissolution of the Board. The Federal Government may, by Notification in the Official",
      "content": "Gazette, declare that the Board shall be dissolved on such date, as may be specified therein, and the\nBoard shall accordingly stand dissolved."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Heavy Industries 1[Taxila] Board established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "factories",
      "definition": "Heavy Re-build Factories and Manufacturing Factories established and functioning under the control of Heavy Industries 1[Taxila] Board;",
      "source_provision": "sec2"
    },
    {
      "term": "Heavy Industries",
      "definition": "the Heavy Industries, Taxila, and includes Heavy Re-build Factories, Manufacturing Factories and other allied facilities owned by the Federal Government; and",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of the Board.",
      "source_provision": "sec2"
    }
  ]
}
