{
  "id": "pk-hindu-inheritance-removal-of-disabilities-act-1928",
  "type": "statute",
  "title": "Hindu Inheritance (Removal of Disabilities) Act, 1928",
  "title_en": "Hindu Inheritance (Removal of Disabilities) Act, 1928",
  "short_name": "HIODA",
  "status": "in_force",
  "issued_date": "1928-09-19",
  "in_force_date": "1928-09-19",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap%2BZ-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Hindu Inheritance (Removal of Disabilities) Act, 1928 (XII of 1928) published by The Pakistan Code (Family Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and application.⸻(1) This Act may be called the Hindu Inheritance",
      "content": "(Removal of Disabilities) Act, 1928.\n1\n[(2) It extends to the whole of Pakistan.]\n(3) It shall not apply to any person governed by the Daya-bhaga School of Hindu Law."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Persons not to be excluded form inheritance or rights in joint",
      "content": "family property.\nNotwithstanding any rule of Hindu Law or custom to the contrary, no person governed by the Hindu\nlaw, other than a person who is and has been from birth a lunatic or idiot, shall by excluded from\ninheritance or from any right or share in joint-family property by reason only of any disease,\ndeformity, or physical or mental defect."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Saving and exception. Nothing contained in this Act shall affect any right which has",
      "content": "accrued or any liability which has been incurred before the commencement thereof, or shall be\ndeemed to confer upon any person any right in respect of any religious office or service or of the\nmanagement of any religious or charitable trust which he would not have had if this Act had not been\npassed.\n_________\nDate: 15-08-2024\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s.3 and 2nd Sch. (with effect from the 14th October, 1955)."
    }
  ],
  "definitions": []
}
