{
  "id": "pk-hindu-marriage-disabilities-removal-act-1946",
  "type": "statute",
  "title": "Hindu Marriage Disabilities Removal Act, 1946",
  "title_en": "Hindu Marriage Disabilities Removal Act, 1946",
  "short_name": "HMDRA",
  "status": "in_force",
  "issued_date": "1946-11-21",
  "in_force_date": "1946-11-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJiV-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Hindu Marriage Disabilities Removal Act, 1946 (XXVIII of 1946) published by The Pakistan Code (Family Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent",
      "content": "(1) This Act may be called the Hindu Marriage Disabilities\nRemoval Act, 1946.\n2\n[(2) It extends to the whole of Pakistan.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Marriages between persons of same gotra or pravara or of different sub",
      "content": "divisions of\nthe same caste. Notwithstanding any text, rule or interpretation of the Hindu Law or any custom or\nusage, a marriage between Hindus, which is otherwise valid, shall not be invalid by reason only of\n(a)         belong to the same gotra or pravara, or\n(b)         belong to different sub-divisions of the same caste.\n_______________\nDate; 24-09-2024\n1\nThis Act has been applied to Baluchistan, see Notification No. 358-B P. G., dated the 10th December, 1946. Gazette of India, 1946. Pt. I, p. 1885.\nThe Act has been extended to—\n(a) the Leased Area of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950) ;\n(b) the Baluchistan States Union, see the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G. G. O. 4 of 1953) ;\n(c) the Khairpur State, see the Khairpur (Federal Laws) (Extension) Order, 1953 (G. G. O. 5 of 1953) ; and\n(d) the State of Bahawalpur, see the Bahawalpur (Extension) of Federal Laws) Order, 1953 (G. G. O. 6 of 1953). as amended.\nThe Act has been and shall be deemed to has been brought into force in Gwadur w. e. f. the 18th September. 1958, by the Gwadur (Application of\nCentral Laws) Ordinance, 1960 (Ordinance No. XXXVII of 1960), s. 2.\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (Ordinance No. XXI of 1960), s. 3 and 2nd Sch."
    }
  ],
  "definitions": []
}
