{
  "id": "pk-hydrogenated-vegetable-oil-industry-control-and-development-act-1973",
  "type": "statute",
  "title": "Hydrogenated Vegetable Oil Industry (Control and Development) Act, 1973",
  "title_en": "Hydrogenated Vegetable Oil Industry (Control and Development) Act, 1973",
  "short_name": "HVOIA",
  "status": "in_force",
  "issued_date": "1973-09-14",
  "in_force_date": "1973-09-14",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUZWJr-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Hydrogenated Vegetable Oil Industry (Control and Development) Act, 1973 (LXV of 1973) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Hydrogenated\nVegetable Oil Industry (Control and Development) Act, 1973.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once and shall be deemed to have taken effect on the second day of\nSeptember, 1973."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(a)         “bank rate” means the bank rate determined and made public under the provisions\nof the State Bank of Pakistan Act, 1956 (XXXIII of 1956);\n(c)         “Board” means a Board of Management set up under section 7;\n(d)         “corporation” means a corporation wholly owned by Government to which an\nestablishment is transferred under section 13;\n(d)         “creditor” means any person to whom a managed establishment owes any amount\nof money;\n(e)         “debtor” means a person who owes any amount of money to a managed\nestablishment;\n1\nFor Statement of Objects and Reasons, see Gaz. of P., 1973., Ext., Pt. III, p. 1514.\n(f)    “establishment” means any company, firm, concern, institution or enterprise the\nwhole or any Part of the undertaking of which pertains to the industry and includes\nany related office shop, factory, godown, yard, stocks and stores wherever that may\nbe;\n(g)    “industry” means the hydrogenated vegetable oil industry;\n(h)    “Managing Director” in relation to an establishment means the Managing Director\nappointed under section 6 in respect of such establishment;\n(i)    “managed establishment” means an establishment in respect of which a Managing\nDirector has been appointed;\n(j)    “previous management” in relation to an establishment means the person, board of\ndirectors or other body or authority in whom or in which the management of the\nestablishment vested immediately before the appointment of a Managing Director\nin respect thereof;\n(k)    “shareholder” means a shareholder in the share capital of an establishment, and\nincludes a stockholder;\n(l)    “person” includes an individual, a Hindu undivided family, a partnership firm and\nan association of person or a body of individuals, Government of a Province and a\nlocal authority;\n(m)    words and expressions used but not defined in this Act shall have the same meaning\nas in the Companies Act, 1913 (VII of 1913)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. [Declaration.]",
      "content": "Omitted by the Hydrogenated Vegetable Oil Industry (Control and\nDevelopment) (Amdt.) Ordinance, 1979 (IV of1979), s. 2."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Act to override other laws",
      "content": "The provisions of this Act shall have effect notwithstanding\nanything contained in the Companies Act, 1913, or the Companies (Managing Agency and Election of\nDirectors) Order, 1972 (P.O. No. 2 of 1972), or any other law for the time being in force or in any\nagreement, contract, memorandum or articles of association of a company."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power to take over management or acquire shares of business of an establishment",
      "content": "(1)\nThe Federal Government may, by an order,—\n(a)    take over the management of any establishment and, as from the date of such order,\nthe previous management shall stand divested of such management;\n(b)    in the case of an establishment which is a company or an establishment owned by\na company—\n(i)    acquire the whole or a portion of the shares from all or any of the\nshareholders of such company and, as from the date of such order, the shares\nso acquired shall vest in the Federal Government, or\n(ii)       acquire the whole or a portion of the proprietary interests of such company\nin such establishment and, as from the date of such order, the interests so\nacquired shall vest in the Federal Government; and\n(c)       in the case of an establishment owned by a person acquire the whole or a portion\nof the proprietary interests of such person, and as from the date of the order the\ninterests so acquired shall vest in the Federal Government:\nProvided that no order shall be made under this section for the acquisition of the shares held in an\nestablishment by an institution owned or controlled by Federal Government including the National\nInvestment Trust and the Investment Corporation of Pakistan or the shares held by a foreign investor:\nProvided further in the case of an establishment which is a company or an establishment owned\nby a company, the Federal Government may, by notification in the official Gazette, exempt from\nacquisition shareholdings of shareholders up to such maximum amount, not exceeding in the aggregate\nforty-nine per cent of the paid-up share capital of the company, as may be specified in the notification.\n[Explanation.—In this sub-section and section 31 “foreign investor means a person, other than a\n1\ncitizen of Pakistan, who has made investment in Pakistan and to whom—\n(a)        the Federal Government has given an assurance that he will have the right to\nrepatriate from Pakistan the amount of his investment or the income arising\ntherefrom or both such amount and such income; or\n(b)        the Federal Government has not given such assurance, but whom it has assured that,\nin the event of compulsory acquisition of the shares held in an establishment by the\nshareholders, he will not be treated less favourably than an investor to whom such\nassurance had been given.].\n(2) Where the Federal Government makes an order under sub-section (1) in respect of the shares\nof any company, no dealings or business relating to such shares shall be transacted on any stock exchange\nand no transfer of such shares shall be registered in the share register of the company for a period of ninety\ndays from the date of such order or such shorter period as may be notified by Government.\n2\n[5A. Transfer of shares and proprietary interests, etc.—(1) If the Federal Government\nconsiders it necessary in the public interest to transfer the shares or proprietary interests in respect of a\nmanaged establishment acquired by it under section 5, the Federal Government may, through a public\nadvertisement, invite bids for the transfer of the shares or proprietary interests.\n(2) On receipt of bids in pursuance of an invitation under sub-section (1), the Federal Government\nshall offer the transfer of the shares or proprietary interests to the previous management of such\nestablishment, on the highest bid so received and on such terms and conditions as it may deem fit:\n1\nAdded by the Hydrogenated Vegetable Oil Industry, (Control and Development) (Amdt.) Ordinance, 1979 (4 of 1979), s. 3.\n2\nIns. by the Hydrogenated Vegetable Oil Industry (Control and Development) (Second Amdt) Act, 1992 (11 of 1992), s. 2, which was previously ins. by Act\n20 of 1991, s. 3.\nProvided that it shall not be necessary to make such an offer to the previous management in case\nthe highest bid has been made by the management group of the employees of such establishment.\nExplanation.—In this sub-section and in .sub-section (4), “management group of the employees”\nmeans such management group of the employees as has, in the opinion of the Federal Government, been\nformally constituted as such.\n(3) If the said previous, management does not accept the offer made under sub-section (2) within\na specified time, the Federal Government may transfer the shares or proprietary interests to such persons,\nand on such terms and conditions, as it may deem fit.\n(4) Notwithstanding anything contained in sub-sections (1), (2) and (3), the Federal Government\nmay, in its discretion, if it considers it necessary in the public interest so to do, transfer the shares or\nproprietary interests in respect of any such establishment to the management group of the employees of\nsuch establishment at a price, and on terms and conditions, settled between the Federal Government and\nsuch management group.\n(5) In case of transfer of shares or proprietary interests in respect of a managed establishment\nunder sub-section (2), (3) or (4), the provisions of this Act shall cease to apply to such establishment.]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Appointment of Managing Directors",
      "content": "(1) Where the Federal Government has made an\norder under section 5 in respect of an establishment, it may appoint a Managing Director in respect of\nsuch establishment.\n(2) Upon the appointment of Managing Director in respect of an establishment, the administration\nand management of the affairs of the establishment shall vest in the Managing Director and any company\nor person or authority exercising or having the right to exercise, immediately before such appointment,\nany power or functions in relation to the establishment shall cease to exercise or to have the right to\nexercise such power or function.\n(3) The Managing Director shall—\n(a)     hold office during the pleasure of the Federal Government ;\n(b)     in the discharge of his functions, be subject to such orders and directions as the\nFederal Government or the Board may from time to time give in writing; and\n(c)     receive such remuneration and be subject to such other terms and conditions of\nappointment and service as the Federal Government may determine.\n(4) The Managing Director appointed in respect of an establishment shall exercise and perform\n(a)     if such establishment is owned or controlled by a company, all the powers and\nfunctions of the Board of Directors; and\n(b)     if such establishment is owned or controlled by a person, all the powers and\nfunctions of that person.\n1[6A. Constitution of Board of Directors, etc. —(1) Where the Federal Government has acquired\nunder section 5 the whole or a majority portion of the shares of a managed establishment which is a\ncompany and is of the opinion that, in the interest of the shareholders of the managed establishment, it is\nnecessary to do so, the Federal Government may, by order in writing, direct that a board of directors\nconsisting of a Managing Director and such number of other directors as may be specified in the order be\nconstituted in such managed establishment.\n(2) Where the Federal Government has made an order under sub-section (1) in respect of a\nmanaged establishment, the board of directors of such establishment shall be constituted within a period\nof sixty days from the date of the order.\n(3) Where the Federal Government has made an order under sub-section (1) in respect of a\nmanaged establishment,—\n(a)        the Federal Government may nominate such number of directors, including the\nManaging Director, on the board of directors of the managed establishment as bears\nto the total number of directors, as nearly as may be, the same proportion as the\naggregate face value of the shares owned by the Federal Government and by an\ninstitution owned or controlled by the Federal Government, including the\nCorporation referred to in sub-section (3) of section 13, hereafter in this section\nreferred to as the Corporation, bears to the total issued share capital of the managed,\nestablishment ; and\n(b)        the other directors shall from time to time be elected by the members of the\nmanaged establishment, other than the Federal Government an institution referred\nto in paragraph and the Corporation, in general meeting in accordance with the\nCompanies (Managing Agency and Election of Directors) Order, 1972 (P.O. No. 2\nof 1972).\n(4) The Managing Director nominated under sub-section (3) shall be the chief executive of the\nmanaged establishment.\n(5) The board of directors of a managed establishment constituted under this section shall enter\nupon office on such date as the Federal Government may, by order in writing, appoint in this behalf and,\nupon their entering upon office as aforesaid,—\n(a)        the Managing Director appointed under sub-section (1) of section 6 in respect of\nthe establishment shall cease to hold office;\n(b)        the management of the establishment shall cease to vest in the Corporation, and the\nmanagement and administration of affairs of the establishment shall, subject to this\nsection, stand transferred to the board of directors; and\n(c)        the Managing Director nominated under sub-section (3) shall have such powers and\nfunctions as the board of directors may, from time to time, confer upon or entrust\nto him.]\n1\nIns. by the Hydrogenated Vegetable Oil Industry (Control and Development) (Amdt.) Ordinance, 1979 (17 of 1979), s. 2."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Board of Management",
      "content": "(1) The Federal Government may, by notification in the official\nGazette, set up a Board of Management to control, manage and direct the affairs of establishments in\nrespect of which Managing Directors have been appointed and where it sets up more than one Board, shall\nspecify in the notification the establishment or class of establishments in respect of which each Board\nshall, exercise its powers and perform its functions under this Act.\n(2) A Board shall consist of a Chairman and such number of members, not exceeding nine, as the\nFederal Government may appoint.\n(3) A Board shall be a body corporate having perpetual succession and a common seal, with power\nto acquire and hold property, and shall by the name assigned to it by the notification issued under\nsub-section (1) sue and be sued.\n(4) The Chairman and members of a Board shall hold office during the pleasure of the Federal\nGovernment on such terms and conditions as it may determine."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Functions of Boards",
      "content": "(1) The function of the Board shall be to ensure that the establishments\nin respect of which it is to exercise and perform its powers and functions under this Act are managed\nefficiently and in accordance with sound business principles and, in respect of any such establishment, the\nBoard may, from time to time.—\n(a)    exercise such of the powers of the Managing Director and issue such directions to\nhim as it may consider necessary;\n(b)    require the Managing Director to furnish it with such information relating to the\naffairs of the establishment in respect of which he is the Managing Director as the\nBoard may require in connection with the performance of its functions; and\n(c)    remove from office its auditor and appoint another person to hold that office for\nsuch period and on such remuneration payable by the establishment as the Board\nmay determine.\n(2) The exercise by the Board under sub-section (1) of the powers of a Managing Director shall\nhave effect as if it were the exercise of those powers by the Managing Director himself.\n(3) It shall be the duty of a Managing Director to comply with all directions issued to him by the\nBoard under sub-section (1) and to furnish the Board with the information required by it."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Funds of the Board",
      "content": "(1) There shall be constituted for each Board a fund to which shall be\ncredited all sums received by the Board under sub- section (2) and out of which shall be defrayed all\nexpenditure incurred by the Board, including expenditure on the emoluments of the Chairman, members\nand officers, servants, experts and consultants of the Board.\n(2) The Managing Director in respect of every managed establishment shall make to the Board\nconcerned each year such payment to enable it to defray its expenses as the Board may, with the prior\napproval of the Federal Government in writing, demand of him:\nProvided that the aggregate amount of payment so demanded of the Managing Directors in any\nyear shall not exceed by more than ten per cent the amount of the estimated expenditure of the Board in\nthat year."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Officers, etc., of the Board",
      "content": "(1) A Board may from time to time appoint such officers,\nservants, experts and consultants as it may deem fit.\n(2) A Board may appoint one or more committees of the Board with such composition and\nfunctions as it may determine."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Adoption of balance sheet",
      "content": "In case of a managed establishment owned or controlled by a\ncompany, the general meeting of the company before which a balance sheet is laid shall not, if the Federal\nGovernment by order in writing so directs, have the authority to refuse to adopt the balance sheet, but\nnothing in this section shall be construed to prevent any shareholder from expressing his views on the\nfinancial affairs of the establishment and a record of the proceedings of such meetings shall be forwarded\nto the Federal Government not later than fifteen days of the meeting."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Regulations",
      "content": "(1) A Board may, with the prior approval in writing of the Federal Government,\nmake such regulations as appear to it to be necessary for carrying out the purpose of this Act.\n(2) In particular and without prejudice to the generality of the foregoing power, such regulations\nmay provide for the manner of payment and collection of the payments required to be made by the\nManaging Director under sub-section (2) of section 9."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Delegation of powers etc",
      "content": "(1) The Federal Government may, by notification in the official\nGazette, direct that all or any of its powers under this Act shall, in such circumstances and subject to such\nconditions, if any, as may be specified in the notification, be exercisable also by a Board.\n(2) A Board may, with the previous, approval in writing of the Federal Government, direct that all\nor any of its powers under this Act shall, in such circumstances and subject to such conditions, if any, as\nmay be specified by the Board, be exercisable also by a member of the Board or a committee of the Board.\n(3) Where the Federal Government has taken over the management of an establishment under\nsection 5, it may transfer the management of the establishment to a corporation wholly owned or controlled\nby Government or a corporation set up for the purpose, on such terms and conditions as the Federal\nGovernment may specify.\n(4) Where the Federal Government has acquired the shares or proprietary interests of an\nestablishment under section 5, it may transfer the shares or proprietary interests to a corporation wholly\nowned or controlled by Government or a corporation set up for the purpose, on such terms and, conditions\nas the Federal Government may specify.\n(5) The Federal Government may, from time to time, issue such directions to, and call for such\ninformation or report from, a Board as it may deem necessary."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Acquisition of shares",
      "content": "Where, under section 5, the Federal Government orders acquisition\nof a portion, of the shares of the shareholders of any company or of the proprietary interests of a company\nor other person in an establishment, it shall acquire the shares or interest 1* * * on payment of such\ncompensation as may be determined by the Federal Government on the basis of the principles set out in\nthe Schedule."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Reorganisation of establishment",
      "content": "(1) Where, in respect of any managed establishment\nowned by a company, the Federal Government holds or has acquired the whole or a majority portion of\nthe shares in the company carrying the controlling voting rights, or where the Federal Government has\nacquired the whole or a controlling portion of the proprietary interests in an establishment, the Board may\ndraw up a plan for the reorganisation of such an establishment with a view to increasing its efficiency and\nrationalising its operation, hereafter in this section referred to as the reorganisation plan.\n(2) The reorganisation plan may include provision for amalgamation of managed establishments\nand, in the case of establishment owned by companies, may provide for a scheme for the reconstruction\nof any such company or companies, or amalgamation of any such two or more companies and such a\nscheme may provide for all or any of the matters contained in section 153 or section 153B of the\nCompanies Act l913 (VII of 1913), or for alteration of share capital or loan structure and alteration of\nexisting, or adoption of fresh, articles of association of such companies.\n(3) The reorganisation plan shall be submitted to the Federal Government for approval and shall\nbe simultaneously published in the official Gazette accompanied by a certified statement showing the\nvalue of the holdings of the shares or proprietary interests of the Federal Government in the establishment\ncovered by the plan, on the date of the submission of the plan, and, from the date of such submission,\ndealings in shares of companies covered by the plan in any of the stock exchanges shall remain suspended\nuntil the Federal Government has approved the reorganisation plan.\n(4) The reorganisation plan shall be implemented and take effect in such manner and at such time\nand with such modification as may be approved by the Federal Government.\nExplanation.—For the purposes of this section and section 26 the Federal Government shall be\ndeemed to have a majority portion of the shares in a company carrying controlling voting rights or the\ncontrolling proprietary interest in an establishment if the aggregate face value of the shares or proprietary\ninterests in such establishment owned by the Federal Government and by an institution owned or\ncontrolled by the Federal Government exceeds fifty per cent of the total voting rights in the issued and\npaid up share capital of the company or fifty per cent of the proprietary interests of that establishment."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Continuation in service. In the case of a managed establishment, all persons employed in, by",
      "content": "or for the purposes of the business of the establishment, by whomsoever appointed or engaged, shall\ncontinue in their respective employments on the same remuneration and other conditions of service as\nwere applicable to them immediately before the appointment of the Managing Director in respect of that\nestablishment, unless the Managing Director directs otherwise in a particular case or their terms and\nconditions of service are altered in accordance with the law or any rules applicable to such establishment.\n1\nThe words “within a period of ninety days” omitted by the Hydrogenated Vegetable Oil Industry (Control and Development) (Amdt.) Act, 1975 (10 of 1975),\ns. 3."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Prohibition to obstruct. No person shall, except under the authority of the Federal",
      "content": "Government give any instruction to a Managing Director, nor shall any person in any manner obstruct\nhim in the discharge of his functions."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Debtor",
      "content": "(1) Federal Government may, by notice in writing, call upon a debtor to pay to the\nFederal Government, or to the managed establishment specified in such notice, the amount of money due\nfrom him to the establishment, within a period of thirty-days commencing from the date of receipt of such\nnotice by the debtor.\n(2) Where a debtor fails to pay the amount due within the time specified in the notice, the Managing\nDirector of the managed establishment to which such amount is due shall have the same powers of\neffecting recovery of such amount as the Industrial Development Bank of Pakistan has under sections 39,\n40 and 41 of the Industrial Development Bank of Pakistan Ordinance, 1961 (XXXI of 1961), in respect\nof sums due to the said Bank."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Creditor",
      "content": "(1) A creditor of a managed establishment may apply to the Federal Government\nfor payment to him of the amount due to him from the establishment.\n(2) The Federal Government may, on receipt of an application under sub-section (1) and after such\nenquiry as it may deem fit, direct the managed establishment—\n(a)     to repay the amount due to the creditor in such instalments and within such period\nas may be specified in the direction; or\n(b)     if such managed establishment be a company, to convert the amount due to the\ncreditor into share capital of the establishment.\n(3) If a managed establishment fails to comply with a direction issued to it under sub-section (2)\nthe Federal Government may order that the amount specified in the direction be recovered from it as an\narrear of land revenue and paid to the creditor."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Power to revoke contract, etc",
      "content": "If any contract or agreement entered into, or any obligation\nundertaken by any previous management of a managed establishment is declared by the Federal\nGovernment, after such inquiry as it may deem fit and giving an opportunity to the person or persons with\nwhom such contract or agreement was entered into or to whom such obligation was undertaken to show\ncause why such declaration shall not be made, to be against the interests of the establishment, such\ncontract, agreement or obligation shall stand revoked and the establishment shall not be liable for any loss\nor damage suffered by the previous management by reason of such revocation:\nProvided that this section shall not be construed as preventing any party to a contract, agreement\nor obligation so revoked from initiating action in a court of law against the previous management."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Right of shareholders",
      "content": "Any person having a share or a proprietary interest in a managed\nestablishment shall be entitled to complain to the Board or the Federal Government in respect of any action\ntaken by the Managing Director in relation to the affairs of the establishment."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Continuance in service of employees on transfer to a corporation",
      "content": "(1) Where the\nmanagement of a managed establishment is transferred to a corporation under section 13, every whole\ntime employee of the establishment who was employed by the establishment immediately before the date\nof such transfer shall, on and from the date of such transfer, become an employee of the corporation and\nshall hold his office therein on the same terms and conditions, including remuneration, tenure of office,\nrights and privileges as to pension and gratuity and other matters, as were applicable to him immediately\nbefore the date of transfer, until his employment in the corporation is terminated or his terms and\nconditions of service are altered by the corporation.\n(2) Where any employees of a managed establishment have, under the provisions of sub-section\n(1), become the employees of a corporation, the corporation may, for the purpose of rationalising the pay\nscales of such employees or for any other good and adequate reason, alter the terms and conditions of\nservice of the employees as to their remuneration, in such manner as it thinks fit and, if the alteration is\nnot acceptable to any employee, the corporation may terminate his employment by giving him\ncompensation equivalent to his remuneration for three months or, if his contract of service provides for a\nshorter notice for termination of employment, for the period so provided. .\nExplanation.—The compensation payable to an employee under this sub-section shall be in\naddition to, and not inderogation of, any of his rights as to pension, gratuity, provident fund money or\nother benefit to which he may be entitled under his contract of service.\n(3) If any question arises as to whether any person was a whole time employee of an establishment\nimmediately before its management was transferred to a corporation under section 13, the question shall\nbe referred to the Federal Government whose decision shall be final.\n(4) The transfer of the services of any employee of an establishment to a corporation shall not,\nexcept as provided in this section, entitle any such employee to any compensation and no such claim shall\nbe entertained by any court, tribunal or other authority."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. General effect of vesting of establishment",
      "content": "(1) Where the management of a managed\nestablishment has been transferred to a corporation under section 13, all contracts, agreements and other\ninstruments of whatever nature subsisting or having effect immediately before the date of transfer, to\nwhich such establishment was a party or which were in favour of such establishment shall, subject to the\nprovisions of section 20, be of as full force and effect against or in favour of the corporation, and may be\nenforced or acted upon as fully and effectively, as if, instead of the establishment, the corporation had\nbeen a party thereto or as if they had been entered into or issued in favour of the corporation.\n(2) If, on the date of transfer of the management of a managed establishment to a corporation, any\nsuit, appeal or other legal proceeding of whatever nature is pending by or against such establishment, it\nshall not abate, be discontinued or be in any way prejudicially affected by reason of such transfer or\nanything done under this Act, but the suit, appeal or other proceeding may be continued, prosecuted and\nenforced by or against the corporation."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Duty to deliver possession of property and documents relating thereto",
      "content": "(1) Where the\nmanagement of a managed establishment has been transferred to a corporation under section 13 then\n(a)    every person in whose possession, custody or control there is any property of such\nestablishment shall forthwith deliver the property to the corporation; and\n(b)     any person who, on the date of transfer of the establishment to the corporation, has\nin his possession, custody or control any books, documents or other papers relating\nto such establishment shall be liable to account for the said books, documents and\npapers to the corporation, and shall deliver them to such person as the corporation\nmay direct.\n(2) Without prejudice to the provisions of sub-section (1), it shall be lawful for the corporation to\ntake all necessary steps for acquiring possession of all properties which have been transferred to and vested\nin it under this Ordinance."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Provident, superannuation and other like funds",
      "content": "(1) Where an establishment the\nmanagement of which has been transferred to a corporation under section 13 has established a provident\nor superannuation fund or any other like fund for the benefit of its employees and has constituted a trust\nin respect thereof, hereafter in this section referred to as an existing trust the money's standing to the credit\nof any such fund on the appointed date, together with any other assets belonging to such fund, shall,\nsubject to the provisions of sub-section (2), stand transferred to and vests in the corporation on the date\nthe management of the establishment is transferred to it, free from any such trust.\n(2) Where all the employees of any such establishment do not become employees of a corporation\nunder section 22, the moneys and other assets belonging to any such fund as is referred to in sub-section\n(1) shall be apportioned between the persons responsible for the fund and the corporation in such manner\nas may be prescribed by rules and, in the case of any dispute regarding such apportionment, the decision\nof the Federal Government shall be final.\n(3) A corporation shall, as soon as may be after the management of an establishment is transferred\nto it under section 13, constitute in respect of the moneys and other assets which are transferred to and\nvested in it under this section, one or more trusts having objects as similar to the objects of the existing\ntrust as in the circumstances may be practicable.\n(4) Where all the moneys and other assets belonging to an existing trust are transferred to and\nvested in a corporation under this section, the persons responsible for such trust shall, as from the date of\nsuch transfer, be discharged from the trust, except as respects things done or omitted to be done before the\ndate of transfer of the management of the establishment."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Minimum return",
      "content": "(1) Where the Federal Government takes over the management of an\nestablishment but does not hold majority portion of shares in a company carrying voting rights, or\ncontrolling proprietary interests therein, it shall, on behalf of such establishment, guarantee to the\nshareholders or proprietors of such establishment a minimum annual rate of return equivalent to two per.\ncent, above the bank rate.\n(2) The minimum rate of return referred to in sub-section (1) shall be worked out, in the case of an\nestablishment owned by a company, on the paid up capital of such company, and, in the case of an\nestablishment owned by a person other than a company, on the Net Worth Value of investment as defined\nin the Schedule on the basis of the figure appearing in the latest annual balance sheet of such establishment."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Bar of Jurisdiction",
      "content": "(1) No court shall call in question or permit to be called in question any\nprovision of this Act or of any rule or order made or anything done or any action taken there under.\n(2) No court shall grant any injunction or make any order, nor shall any court entertain any\nproceedings, in relation to anything done or intended to be done under this Act."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Indemnity",
      "content": "No suit, prosecution or other legal proceeding shall lie against the Government,\na Board, a Managing Director or any other person for anything in good faith done under this Act or any\nrule or order made there under."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Penalties",
      "content": "Whoever contravenes any of the provisions of section 17 or section 24 shall be\npunishable with imprisonment for a term which may extend to two years, or with fine, or with both."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Composite enterprises and organisations",
      "content": "(1) Where a managed establishment owned by\na company is engaged in a business not directly related to the manufacture of hydrogenated vegetable oil,\nthe Managing Director shall prepare, as soon as possible, a plan for separation of the business relating to\nmanufacture of hydrogenated oil from other business. The plan shall include provision for separation of\nphysical assets, and apportionment of assets and liabilities, including the apportionment of paid up capital\non a pro rata basis between the respective business. The Managing Director in preparing the plan shall\nfollow the provisions of the Companies Act, 1913 (VII of 1913), to the extent it is not inconsistent with\nprovision of this Act.\n(2) The Managing Director shall submit the plan for approval to the Federal Government which\nshall publish the plan in the official Gazette to ascertain the views of the shareholders of the company\nwithin a specified period.\n(3) The Federal Government shall, after considering the views of the shareholders, decide whether\nliabilities of such business should be retained in the managed establishment or whether such business and\nassets and liabilities should be returned to the previous management; and the decision of the Federal\nGovernment shall be final.\n(4) Where the Federal Government decides to return to the previous management the business not\ndirectly related to the manufacture of hydrogenated vegetable oil and the previous management fails, for\nany reason whatsoever, to accept the said business within a specified period of time, the Federal\nGovernment may, in its discretion, either retain the business within the managed establishment or dispose\nof the business, along with the assets and liabilities apportioned as relating thereto, in such manner as the\nFederal Government may deem fit."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Saving",
      "content": "Nothing contained in this Act shall affect any agreement entered into between the\nFederal Government and a foreign investor or creditor or any agreement between a foreign investor or\ncreditor and any citizen of Pakistan which has been expressly approved by the Federal Government."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Power to make rules",
      "content": "(1) The Federal Government may make rules for carrying out the\npurposes of this Act.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules may\nprovide for, or may empower a Board to make orders providing for, all or any of the following matters,\nnamely :—\n(i)     the determination of the question whether any property pertains to the business of\nsuch establishment relating to the industry or whether any assets, rights, debts,\nliabilities or obligations, were acquired or incurred, or any contract, agreement or\nother instrument was made, in respect of or for the purposes of such business or\nwhether any documents relate to those purposes;\n(ii)    the allocation of the paid up capital, or assets representing paid up capital, as the\ncase may be, between such business and any other business;\n(iii)   the substitution of any agreement entered into partly for the purposes of such\nbusiness and partly for other purposes by a separate agreement relating solely to\nsuch business and for any apportionment of rights, obligations and indemnities\nconsequent thereon;\n(iv)    the severance of a lease comprising property of which part only is used for purposes\nof such business and for apportionment of right and liabilities consequent on such\nseverance;\n(v)     the apportionment and the making of financial adjustments with respect to any\ndebts, liabilities or obligations incurred by the establishment partly for the purposes\nof such business and partly for other purposes and for any necessary variation of\nmortgages and encumbrances relating to such debts, liabilities or obligations ; and\n(vi)    for the apportionment of the moneys and other assets belonging to any .provident\nor superannuation funds, or any other like fund to which the provisions of section\n25 do not apply, between persons employed in connection with such business and\nother persons."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to any provision of this Act,\nappear to it to be necessary for the purposes of removing the difficulty:\nProvided that no such power shall be exercised after the expiry of one year from the\ncommencement of this Act."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. [Repeal] Omitted by the Federal Laws (Revision and Declaration) Ordinance, .1981 (XXVII",
      "content": "of 1981), s. 3 and Sch, II.\n__________________\n(See section 14)\nPrinciples and the manner for payment of compensation in respect of the shares or proprietary\ninterests of an establishment acquired by the Federal Government."
    }
  ],
  "definitions": [
    {
      "term": "bank rate",
      "definition": "the bank rate determined and made public under the provisions of the State Bank of Pakistan Act, 1956 (XXXIII of 1956);",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "a Board of Management set up under section 7;",
      "source_provision": "sec2"
    },
    {
      "term": "corporation",
      "definition": "a corporation wholly owned by Government to which an establishment is transferred under section 13;",
      "source_provision": "sec2"
    },
    {
      "term": "creditor",
      "definition": "any person to whom a managed establishment owes any amount of money;",
      "source_provision": "sec2"
    },
    {
      "term": "debtor",
      "definition": "a person who owes any amount of money to a managed establishment; 1 For Statement of Objects and Reasons, see Gaz. of P., 1973., Ext., Pt. III, p. 1514.",
      "source_provision": "sec2"
    },
    {
      "term": "establishment",
      "definition": "any company, firm, concern, institution or enterprise the whole or any Part of the undertaking of which pertains to the industry and includes any related office shop, factory, godown, yard, stocks and stores wherever that may be;",
      "source_provision": "sec2"
    },
    {
      "term": "industry",
      "definition": "the hydrogenated vegetable oil industry;",
      "source_provision": "sec2"
    },
    {
      "term": "managed establishment",
      "definition": "an establishment in respect of which a Managing Director has been appointed;",
      "source_provision": "sec2"
    },
    {
      "term": "shareholder",
      "definition": "a shareholder in the share capital of an establishment, and includes a stockholder;",
      "source_provision": "sec2"
    },
    {
      "term": "person",
      "definition": "an individual, a Hindu undivided family, a partnership firm and an association of person or a body of individuals, Government of a Province and a local authority; (m) words and expressions used but not defined in this Act shall have the same meaning as in the Companies Act, 1913 (VII of 1913).",
      "source_provision": "sec2"
    }
  ]
}
