{
  "id": "pk-ict-rights-of-persons-with-disability-act-2020",
  "type": "statute",
  "title": "ICT Rights of Persons with Disability Act, 2020",
  "title_en": "ICT Rights of Persons with Disability Act, 2020",
  "short_name": "IROPW",
  "status": "in_force",
  "issued_date": "2020-09-21",
  "in_force_date": "2020-09-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5lqbw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of ICT Rights of Persons with Disability Act, 2020 (XXXV of 2020) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the ICT Rights of\nPersons with Disability Act, 2020.\n(2) It shall extend to the whole of the Islamabad Capital Territory (ICT).\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or contest,—\n(a) “access” means meaningful and effective access to various physical and intangible\nmeans made suitable to fulfill special needs of persons with disabilities;\n(b)   “barriers” means physical, social, psychological, communication, information,\nlegal or attitudinal hurdles in the way to access to infrastructure and services\nmeant for general public;\n(c)   “Constitution” means the Constitution of the Islamic Republic of Pakistan;\n(d)   “Council” means the Council on Rights of Persons with Disabilities\nconstituted under this Act;\n(e)   “Court” means the special disability court established under section 32;\n(f)   “disability” means a long term physical or mental condition that limits a\nperson’s movements, senses or activities and shall include physical, mental,\nintellectual and developmental disorders or sensory impairments which in\ninteraction with participate fully and effectively in day to day performance and\ninteraction with others on an equal basis;\n(g)   “discrimination” on the basis of disability means any distinction, exclusion or\nrestriction on the basis of disability which has the purpose or effect of impairing\nor nullifying the recognition, enjoyment or exercise, on an equal basis with others,\nof all human rights and fundamental freedoms in the political, economic, social,\ndenial of reasonable accommodation;\n(h)   “equality before law” includes principles of quality on equitable basis that\npersons with disability shall have in line with the Constitution and international\ncovenants in which Pakistan is a party;\n(i)   “freedom of movement” shall have the same meaning as expressed in Article 15\nof the Constitution;\n(j)   “Fund” means the fund established under section 28;\n(k)   “independent living” means environment to live with freedom, self-control,\nchoice and self-determination in everyday life;\n(l)   “misconduct” shall have the same meaning as defined in the Government\nServants (Efficiency and Discipline) Rules, 1973.\n(m)   “mobility” means the possible independent for persons with disabilities\nwith access to quality mobility aids, devices, assistive technologies and forms of\nassistance and intermediaries, including by making them available at affordable\ncost; and\n(n)   “reasonable accommodation” means necessary and appropriate modification\nwhere needed in a particular case, to ensure that the persons with disabilities enjoy\nor exercise on an equal basis with others of all human rights and fundamental\nfreedoms at home, workplace and in social life."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Equality and non",
      "content": "discrimination of persons with disability.—(1) The government shall\nensure that every person with disability shall have a right to be respected for his individual dignity and\nlead a decent life with equal opportunity to participate in educational, social, economic, cultural and\nall other activities in the society without any discrimination.\n(2) No person or institution, whether public or private, shall discriminate against persons with\ndisabilities or violate their rights or restrict benefits in any manner.\n(3) The government shall take all necessary legal and administrative steps including\nappropriate changes in the existing laws, to ensure that every person with disabilities enjoy a life\ninclusive of the right of equality guaranteed under the Constitution and that such person’s disability\nshall not be used by any person or institution to restrain or restrict him from enjoying his rights unless\nthere is a reasonable cause that not restricting such person may cause him harm or letting him perform\nsomething may be out of his physical or mental capacity.\n(4) In view of restricted access of the persons with disabilities to means of earning their\nlivelihood independently, the government shall take extra- ordinary steps to ensure their effective\ninclusiveness in the society through suitable education, skill development, training and placement\nagainst appropriate positions in the government departments and entities in the private sector\naccording to the allocated quota.\n(5) No person with disability shall be a subject of any research without his willingness or\nconsent without any pressure and such research shall be through using accessible modes, means and\nformats of communication."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Equality before law",
      "content": "(1) The government shall ensure that the persons with disabilities\nare treated equally like persons without such disabilities and that they are not discriminated in\nexercise of their rights.\n(2) It shall be ensured that such persons have legal capacity to enjoy their rights and if they\nneed support to exercise legal capacity such support is provided to them free of cost."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Right to privacy",
      "content": "(1) Every person with disabilities shall have right to privacy as available\nto all citizens regardless of his living in a private home, rehabilitation centre, hostel or any private or\npublic accommodation.\n(2) No person with disabilities regardless of place of residence or living arrangements shall be\nsubjected to arbitrary or unlawful interference with his privacy of person, family, home and\ncommunication or correspondence. Such persons shall have the right to the protection of the law\nagainst any illegal interference and attack against their person, family, property and reputation."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Women, children, elderly people and transgender with disabilities",
      "content": "(1) In view of the\nextra-ordinary vulnerability of women, children, senior citizens and transgender with disabilities, the\ngovernment shall in prescribed manner take special measures to ensure that such women, children,\nsenior citizens and transgenders with disabilities are given full protection under law in enjoying their\nrights.\n(2) The government as well as the private sector shall in the prescribed manners take necessary\nmeasures to ensure development, advancement and empowerment of women, children, senior citizens\nand transgender with disabilities."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Ease of access and mobility",
      "content": "(1) The government as well as the private sector shall take\nnecessary measures towards allowing ease of access to the persons with disabilities to public\nbuildings, hospitals, recreational facilities, public transport, streets and roads for which the old\nbuildings and vehicles shall be appropriately modified and new buildings and vehicles shall be built\nconforming to appropriate standards in conformity with guidelines developed by the Council:\nProvided that the government shall ensure accessible washrooms, toilets and bathrooms with\nall the facilities and necessary accessories.\n(2) The Council shall develop a guideline on removing barriers and obstacles to access in\nbuildings, roads, mode of transportation, housing, hospitals, schools, workplaces, communication and\ninformation related services, recreational spaces, parks and also public washrooms and get those\nimplemented by the concerned authorities and persons both in public and private sectors.\n(3) The Council shall develop a set of minimum standards and scope of access and related\nsignage that each department, authority, entity and major enterprise shall put in place to ensure\nnecessary access of persons with disabilities.\n(4) The government shall implement policies and programs to promote the personal mobility\nof persons with disabilities at affordable cost or free.\n(5) The government shall ensure special seats in all means of transport for persons with\ndisabilities and allot parking space exclusively for persons with disabilities at all public and private\nplaces.\n(6) The Council shall develop and enforce guidelines allowing persons with disabilities to have\nfull and appropriate access to all forms of mass communication including information technology to\nenjoy freedom of speech and freedom of information. A national relay system may be established to\nstandardize mechanism understandable consistently across the country."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Protection from abusive, violent and intolerant discriminatory behavior",
      "content": "(1) The\ngovernment shall take all possible steps to protect persons with disabilities from all forms of abuse,\nviolence and exploitation at the hands of any person, institution or authority.\n(2) Whenever an act of abuse, violence and intolerant discriminatory behavior is committed\nagainst any person with disability and the information of such act is communicated to the Council or\nany law enforcement agency, the concerned agency on receipt of such information shall immediately\ntake necessary action to investigate and curb such act and to take appropriate measures under law to\nlodge the victim of abuse, violence or intolerance, to a safe place for protected housing. No cost shall\nbe recovered from such victim for lodging in safe place in such situation.\n(3) Notwithstanding the provisions of any law for the time being in force, an act of physical\nviolence against a person with disability causing even a minor injury shall be deemed as grievous\ninjury and shall be treated as an act of violence under section 335 of the Pakistan Penal Code, 1860\n(Act XLV of 1860) and shall attract punishment accordingly. Other situation of aggravated abuse and\nviolence shall also be deemed to have more gravity than in case of a person without disabilities.\n(4) In case of need for legal aid such aid shall be made available to such affected person at\npublic expense or prevent its occurrence, as the case may be, or pass such order as deemed fit for the\nprotection of such person with disability."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Equity in education",
      "content": "(1) The government shall take all necessary measures to ensure\nthat persons with disabilities are afforded equal rights to access government as well as private\neducational institutions and shall be provided with appropriate facilities for their education without\nany discrimination.\n(2) The government shall provide free pre-primary to higher education to persons with\ndisabilities.\n(3) The government shall take necessary measures to establish special educational institutions\nfor persons with moderate to severe disabilities to cater to their special needs, in addition to making\nother institutions reasonably equipped and staffed to provide appropriate facilities for inclusive\neducation to such persons in those general educational institutions.\n(4) Persons with disabilities shall not be denied admission into any educational institution,\nwhether state owned or private, on ground of their disabilities.\n(5) It shall be illegal for an institution and its staff members to discriminate against or abuse\nor otherwise violate rights of a person with disability at his place of education for which both the\ninstitution and such violating person shall be punished.\n(6) The government shall ensure inclusive education focusing on personality, development,\ncreativity and strengthening of physical and mental capabilities of persons with disabilities.\n(7) Reasonable and appropriate accommodation shall be provided to persons with disabilities\nin educational institutions including hostels, where applicable.\n(8) The government shall establish adequate dedicated and general facilities for teacher\ntraining with a view to train adequate number of specially trained teachers equipped with skills to\nteach students with various disabilities.\n(9) The government shall ensure that all persons with disabilities are given full access to all\nmodes and means of education including but not limited to vocational training, online education\ndistance learning and adult education."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Equity in the employment",
      "content": "(1) No person, institution, organization or entity, whether\npublic or private, shall discriminate against a person on the ground of disability in the matters of\nemployment, promotion, career development and enjoying fruits of his employment.\n(2) The employer shall ensure the provision of reasonable accommodation including necessary\nassistive aid and equipment which a person with disabilities would reasonably require to perform his\nduties.\n(3) The government shall reserve an employment quota as prescribed by the Federal\nGovernment to be periodically reviewed, at various levels for persons with disabilities in government\ndepartments, institutions, entities and corporate entities owned and managed by the government and\nthe concerned department shall implement the allocated quota.\n(4) The government shall take necessary steps to encourage private enterprises to employ\npersons with disabilities through incentives for which the government shall prepare long term\ninclusion plans and allocate necessary resources.\n(5) The terms and conditions of employment shall not be less favorable for persons with\ndisabilities as compared with those offered to other persons appointed against same or similar\npositions.\n(6) An establishment which does not employ persons with disabilities as required by sub-\nsection (3) shall pay into the Fund each month the sum of money it would have paid as salary or wages\nto a person with disabilities had he been employed. In the event of non-payment or non-compliance,\nthe matter shall be brought before an arbitration council to be established for the purpose by the\nCouncil."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Equity in health and medical rehabilitation services",
      "content": "(1) The government shall ensure\nbarrier free access to necessary public health services and infrastructure to persons with disabilities\nwithout any discrimination and without any cost to such persons.\n(2) The Council shall devise plans to provide special health insurance to persons with\ndisabilities to ensure free medical coverage to such persons.\n(3) The government shall encourage private sector health services providers through\nappropriate incentives to provide quality services to persons with disabilities at affordable rates or\nfree.\n(4) Special health service for early identification and intervention of disabilities and medical\nservices especially designed to prevent disability shall be implemented.\n(5) The government shall initiate with the help of medical and scientific community, research\nto identify causes of various disabilities and make efforts to create awareness in public to adopt\npractices that help prevent disabilities from happening.\n(6) The government shall in respect of person with disabilities undertake initiatives to promote\nsupport and implement community based rehabilitation and research initiatives at the community\nlevel."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Right to live independently in community",
      "content": "(1) The persons with disabilities shall\nhave equal right to live independently in the community. Such persons shall be provided with all\nnecessary facilities by the government without discrimination to enable them to live independently.\n(2) The government shall take necessary preventive measures to ensure that persons with\ndisabilities are not excluded or segregated from the community on basis of their disability and that\ntheir access to communal facilities and services is restriction free.\n(3) The government may also take necessary measures to enable the person with disabilities to\nhave access to a range of in-house, residential and other community support services including\npersonal assistance service necessary to support living and inclusion in community."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Right of living",
      "content": "(1) Every person with disability shall have right to a decent place of\nliving of his choice and no person shall discriminate against a person with disability by way of\nrefusing to rent him or sell to a place of living because of him being a person with disability.\n(2) The government shall evolve a policy towards fair and affordable housing for persons with\ndisabilities in government owned, sponsored or assisted projects and also in the private housing\nschemes. The authorities approving establishment of new housing schemes and plans shall ensure that\nappropriate number of affordable housing units are included in each such scheme or plan.\n(3) The government may set up and maintain decent housing facilities for the persons with\ndisabilities who do not have a place to live and need a decent temporary shelter. The Council shall\nwith the help from the authorities of the Federal Capital, civil society organizations and society at\nlarge assist to arrange temporary shelter for such persons."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Right to home and family",
      "content": "(1) No person with disability especially a child or adult or\nsenior citizen shall be separated from his family on the grounds of disability unless a court of law\nrequires him to be so separated in his best interest.\n(2) Where the immediate family of person with disability is unable to cater a person with\ndisability, especially a child with disabilities, the Court shall make effort to place such person at a\nsetup suitable for his safe living.\n(3) All persons with disabilities shall have the right to marry a person of their own choice and\nraise their family without any discrimination.\n(4) No person with disability shall be subjected to any medical procedure leading to infertility\nand forced sterilization shall be a non- compoundable offence.\n(5) The government shall provide free services regarding reproductive health especially to\nwomen with disabilities."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Freedom of expression and information",
      "content": "(1) The government shall ensure that persons\nwith disabilities have full and equitable rights regarding freedom of speech, right to expression and\ninformation and effective measures shall be taken for their such rights to be enjoyed.\n(2) The Council shall take necessary measures to convey the voice of persons with disabilities\nand their organizations across the governments, civil society and international community.\n(3) The Council shall encourage the state and private run electronic and print media to promote\nawareness on the rights of persons with disabilities through public service messages and programming\ninclusive for all types of disabilities.\n(4) The government may provide advertisements to publications dedicated for persons with\ndisabilities.\n(5) The government shall ensure that all websites hosted by Pakistani website service providers\nare accessible for persons with disabilities."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Right of political participation",
      "content": "(1) Persons with disabilities shall have full right to\nparticipate in the political activity in the country including exercising right of vote and right to be\nelected to an elected body.\n(2) The Election Commission of Pakistan shall ensure that each polling station is accessible to\npersons with disabilities and necessary arrangements are made for them to cast their votes\nconfidentially and without any difficulty. Any act by any person to cause restriction on exercise of\nright of vote by a person with disability shall be deemed as forceful obstruction as defined in the\nElections Act, 2017 (XXXIII of 2017) and shall be prosecuted and punished accordingly.\n(3) The Council shall, with the help of the Election Commission of Pakistan, educate political\nparties on the issues and problems of the persons with disabilities.\n(4) The Election Commission of Pakistan shall be mandated to develop voter’s accessibility\nmechanism for persons with disabilities such as brail voting paper etc."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Access to justice",
      "content": "The government shall ensure that persons with disabilities are\nprovided with assistance, including sign language interpreters and attendants to access to the justice\nsystem."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Right to own property",
      "content": "Persons with disabilities shall not be denied the right to own,\nsell or inherit property."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Participation in sports, cultural and recreational activities",
      "content": "(1) The government shall\nensure that no person is discriminated against in participation of any sports, games, cultural and\nrecreational activities on ground of his disability. Assistive devices, equipment and latest technology\nshall be made available for their inclusion in sports, cultural, recreational and leisure activities. One\nseat for persons with disabilities in the sports board shall be ensured and the government shall ensure\nlinkages of the monitoring mechanism for para olympics and special olympics sports association.\n(2) Access to cultural materials, programs and activities shall be provided in accessible and\nappropriate formats to persons with disabilities.\n(3) Barrier-free and discrimination-free access to media programs, films, theaters, parks,\nstadiums, play grounds, beaches and other places of leisure, recreation, sports and cultural activities\nshall be provided to such persons with disabilities.\n(4) The government shall facilitate participation of persons with disabilities in scouting, art\nclasses, outdoor camps, hunting, tourism and adventure activities and shall also help to develop and\nutilize their artistic, creative and intellectual capabilities.\n(5) The government shall ensure that talent-enhancing abilities in both public and private\nschools including sports activities are developed.\n(6) The government shall ensure that courses and activities are designed to promote arts and\nculture to enhance talent of persons with disabilities.\n(7) The government shall take steps so that access to cultural materials, programs and activities\nin accessible and appropriate formats to persons with disabilities are ensured."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Protection of persons with disabilities in risk and disaster situation",
      "content": "(1) All persons\nwith disabilities shall be given top priority in providing suitable protection and safety in situations of\nrisk and natural disaster and shall immediately be removed from such areas and moved to a safe place\non priority.\n(2) In situations of armed conflict, the police, civil armed forces and the armed forces shall\ntake appropriate measures on priority to ensure safety, protection and removal of such persons.\n(3) All authorities engaged in reconstruction activity subsequent to any situation of armed\nconflict, humanitarian emergencies or natural disaster shall ensure that persons with disabilities are\naccorded priority in reconstructing their institutions, homes and other facilities and restoring services.\n(4) The Council shall keep a close coordination with the disaster management authorities for\nprotection and removal to safety and keep record of such persons caught in such situation and ensure\nearly rehabilitation.\n(5) Needs and concerns of persons with disabilities should be included in disaster risk\nreduction."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Strengthening and reconstitution of the National Council for the Rehabilitation of",
      "content": "Disabled Persons.—(1) The National Council for the Rehabilitation of Disabled Persons constituted\nunder the Disabled Persons (Employment and Rehabilitation) Ordinance, 1981 (XL of 1981) shall\nstand reconstituted as the Council on Rights of Persons with Disabilities and shall consist of-\n(a)    Minister–in-charge;                                                  Chairperson\n(b)    Secretary of the Division allocated with business of this Act;       Vice-Chairperson\ntwo members from the Senate, one each from\n(c)                                                                         Members\ngovernment and the opposition;\ntwo members from the National Assembly one each from\n(d)                                                                         Members\ngovernment and the opposition;\none representative from Ministry of Information, Broadcasting,\n(e)    National History and Literary Heritage not below the rank of         Member\nJoint Secretary;\none representative from Ministry of Finance, Revenue and\n(f)                                                                        Member\nEconomic Affairs not below the rank of Joint Secretary;\none representative from the Division allocated with business of\n(g)                                                                        Member\neducation not blow the level of Joint Secretary;\none representative from the Division allocated with the\n(h)    business of poverty alleviation and social safety not below the     Member\nrank of Joint Secretary;\nAn officer not below the rank of a Joint Secretary of the\n(i)                                                                        Member\nDivision to which business of this Act stands allocated;\n(j)    Chairman, Capital Development Authority (CDA);                      Member\nChief Executive or Head of National Institute of Rehabilitation\n(k)                                                                        Member\nMedicine (NIRM);\n(l)    three persons with disability.                                      Members\n(2) Member at clause (i) of sub-section (1) shall also act as Secretary of the Council.\n(3) The Council may co-opt any person as a member.\n(4) The government functionaries represented in the Council shall hold their memberships on\nex-officio basis. The tenure of the members shall be three years.\n(5) The Council shall meet at-least quarterly and the quorum of each meeting shall be one-\nfourth of the total number of the composition of the Council."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Functions of the Council",
      "content": "(1) The Council shall have the responsibility to achieve and\nimplement objectives of this Act and to assist the government in developing legal and institutional\nframe work.\n(2) The Council shall be the executive authority to implement this Act, to develop a legal and\nsocial environment and to help persons with disabilities to have the protection of law in enjoying their\nfundamental rights.\n(3) The Council shall, with the help of other authorities and persons, take all possible measures\nto protect persons with disabilities from discrimination, exploitation, torture, inhuman or degrading\ntreatment on the hands of any one including their families and caregivers.\n(4) The Council shall coordinate implementation of the principles of relevant convention at\nprovincial and lower administrative levels through providing technical assistance to various organs of\nthe provincial legislatures and governments in developing appropriate legal and institutional\nframeworks in their jurisdictions and making them achieve the objective of protection and enforcement\nof rights.\n(5) The Council shall evaluate the effectiveness of laws and policies and assess the\nimplementation of laws and policies at the national level and recommend to the government any\nchanges required in the policies, laws and practices.\n(6) The Council shall conduct or cause to conduct research on the status of persons with\ndisabilities and matters related to the promotion and protection of their rights.\n(7) The Council shall put into place an institutional mechanism to regularly monitor\nperformance of various departments and organizations in the government and issue a performance\nscore card to each such entity and organization at least once in every three years. Similarly, the Council\nshall devise and maintain score cards for private entities that seek such evaluation and assessment.\nSuch performance audits shall be conducted by third party professionals and the employees of the\nCouncil.\n(8) The Council shall assess its own performance in creating legal and social environment in\nthe country and issue an annual status report at the end of every calendar year to present its report to\nthe Parliament through Minister-in-charge.\n(9) The Council shall be responsible to monitor the activities of private and community based\norganizations to ensure that required standards of service are maintained. The Council may enforce an\ninstitutional mechanism for effective, efficacious and transparent functions of such organizations and\nmay impose restrictions on organizations not meeting the objective criteria laid down by it.\n(10) The Council shall have the powers to address individual and collective complaints of\nviolations of human rights of persons with disabilities."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Registration of persons with disabilities",
      "content": "(1) Any person with disability desirous of\nbeing employed or otherwise rehabilitated may have his name registered in the register maintained\nby the Council or its designated office in such form and in such manner as may be prescribed by the\nCouncil.\n(2) The Council shall, if it thinks necessary, cause each person with disability registered under\nsub-section (1) to be assessed as to the nature of his functional disability and also as to his aptitude\nand the nature of work he is fit to do by a medical officer authorized by it or by such assessing board\nas it may appoint having at least one medical officer and the medical officer or, as the case may be,\nthe assessing board shall submit its report to the Council in such form as may be prescribed by the\nCouncil.\n(3) If the person with disability is considered by the Council fit to work, he shall be informed\nindicating the nature of work for which he may be employed or the trade or vocation in which he may\nbe trained and an endorsement to that effect shall be made against his name in the register.\n(4) If the person with disability is not considered by the Council fit to work, he shall be\ninformed accordingly for an endorsement to that effect being made against his name in the register\nand the Council shall take such measures for his rehabilitation as it thinks fit.\n(5) If a person is declared by the Council not to be a disabled person, his name shall be struck\noff from the register."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Establishments to employ persons with disabilities",
      "content": "(1) Not less than one percent of\nthe total number of persons employed by an establishment at any time shall be persons whose names\nhave been registered with the Council or its designated office of the area in which such establishment\nis located and against whose names in the register maintained under section 23 an endorsement exists\nto the effect that they are fit to work.\n(2) The persons with disabilities employed against any post in pursuance of sub-section (1)\nshall be entitled to the terms and conditions which are not less favourable than those of the other\npersons employed by the establishment against similar posts.\n(3) When calculating the percentage of the posts in an establishment for the purposes of\nemployment of persons with disabilities, the fraction of 0.5 and above shall count as a whole number."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Establishment to pay to the Fund",
      "content": "An establishment which does not employ a person\nwith disability as required by section 24 shall pay into the Fund each month the sum of money it\nwould have paid as salary or wages to a disabled person had he been employed."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Dissolution of the Council",
      "content": "On the commencement of this Act, the council formed under\ndissolved and on such dissolution all assets, rights, powers, authorities and privileges and property,\nmovable and immovable, cash and bank balance, reserve funds, investments and all other interests\nand rights in, or arising out of such property and all debts, liabilities and obligations of whatever kind\nof the dissolved council subsisting immediately before its dissolution shall stand transferred to and\nvest in the Council."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Governmental authorities and other persons to assist the Council",
      "content": "(1) All the\nfunctionaries of the government shall extend full and effective cooperation to the Council in ensuring\n(2) Any person in the governmental position not effectively cooperating with the Council shall\nbe deemed to have committed misconduct and shall be proceeded against accordingly."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Funds for rehabilitation",
      "content": "(1) The government may establish non-lapsable endowment\nfund for sustainably financing projects and activities related to ensuring effective rights protection and\ninclusion in society of persons with disabilities.\n(2) The Fund established under sub-section (1) shall be called as ICT Disability Fund which\nshall be managed by the Council.\n(3) The following shall be the sources of the Fund, namely:—\n(a)   Annual allocation and grants of funds from Federal Government;\n(b)   grants from international organizations, governments and other such bodies;\n(c)   levies and other charges that government imposes for rehabilitation;\n(d)   fines and penalties under this Act;\n(e)   donations and bequests by private persons; and\n(f)   any other source.\n(4) The Fund established under the Disabled Persons (Employment and Rehabilitation)\nOrdinance, 1981 (XL of 1981) shall stand transferred alongwith all sums and moneys to the Fund\nestablished under sub-section (2)."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Creating public awareness",
      "content": "(1) The Council shall take immediate, appropriate and\nresult oriented measures to raise awareness amongst the society as whole with regards to recognition\nand respect for persons with disabilities and their rights.\n(2) The Council shall recommend to the Federal and Provincial Governments measures to\ninclude topics on disability in educational curriculum and to create awareness among young students\nabout persons with disabilities.\n(3) The government shall include topics on addressing problems of persons with disabilities in\ntraining programs of institutions responsible for imparting trainings to officers and officials of the\ngovernment, including judges and court officials."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Rehabilitation",
      "content": "(1) The government shall take all possible measures to ensure that\npersons with disabilities attain maximum independence and ability to participate in activities of life\nincluding getting education, doing business, getting employed and participating in sports and cultural\nactivities.\n(2) The government shall promote continuing skill development and training in existing\nadvance skills and technologies to persons with disabilities for effective participation and integration\nin the community.\n(3) The government shall undertake initiatives to promote, support and implement community\nbased rehabilitation and research initiatives of its own."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Insurance cover",
      "content": "(1) The Council may devise and put in place comprehensive group\nmedical and accident insurance for persons with disabilities and may also facilitate such persons in\ngetting affordable life and other forms of insurance.\n(2) The Council may pay the premium for persons with disabilities who cannot pay the\npremium from their own sources."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Special disability courts",
      "content": "(1) For speedy justice, the government may designate and may\nencourage provincial governments to designate, courts to hear cases under this Act or other laws in\nwhich one or more parties are persons with disabilities.\n(2) There shall be an effective institutionalized mechanism to monitor cases in courts under\nsub-section (1) by appropriate judicial forums as devised by the respective High Court."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Power to make rules",
      "content": "(1) The Council may, in consultation with the Federal Government\nand by notification in the official Gazette, make rules to carry out purposes of this Act.\n(2) The rules made under the Disabled Persons (Employment and Rehabilitation) Ordinance,\n1981(XL of 1981) so far as they are not inconsistent with the provisions of this Act shall continue to\nbe in force until altered, amended or repealed."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Power to make regulation",
      "content": "The Council may, by notification in the official Gazette,\nmake regulations for its own efficient and professional working and for effective achievement of\nobjectives of this Act."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to any of the provisions\nof this Act, the Federal Government may make such order, not inconsistent with the provisions of this\nAct, as may appear to be necessary for the purpose of removing the difficulty."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Repeal",
      "content": "The Disabled Persons (Employment and Rehabilitation) Ordinance, 1981 (XL\nof 1981) is hereby repealed to the extent of the Islamabad Capital Territory.\n________________"
    }
  ],
  "definitions": [
    {
      "term": "access",
      "definition": "meaningful and effective access to various physical and intangible means made suitable to fulfill special needs of persons with disabilities;",
      "source_provision": "sec2"
    },
    {
      "term": "barriers",
      "definition": "physical, social, psychological, communication, information, legal or attitudinal hurdles in the way to access to infrastructure and services meant for general public;",
      "source_provision": "sec2"
    },
    {
      "term": "Constitution",
      "definition": "the Constitution of the Islamic Republic of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "Council",
      "definition": "the Council on Rights of Persons with Disabilities constituted under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Court",
      "definition": "the special disability court established under section 32;",
      "source_provision": "sec2"
    },
    {
      "term": "disability",
      "definition": "a long term physical or mental condition that limits a person’s movements, senses or activities and shall include physical, mental, intellectual and developmental disorders or sensory impairments which in interaction with participate fully and effectively in day to day performance and interaction with others on an equal basis;",
      "source_provision": "sec2"
    },
    {
      "term": "equality before law",
      "definition": "principles of quality on equitable basis that persons with disability shall have in line with the Constitution and international covenants in which Pakistan is a party;",
      "source_provision": "sec2"
    },
    {
      "term": "Fund",
      "definition": "the fund established under section 28;",
      "source_provision": "sec2"
    },
    {
      "term": "independent living",
      "definition": "environment to live with freedom, self-control, choice and self-determination in everyday life;",
      "source_provision": "sec2"
    },
    {
      "term": "mobility",
      "definition": "the possible independent for persons with disabilities with access to quality mobility aids, devices, assistive technologies and forms of assistance and intermediaries, including by making them available at affordable cost; and",
      "source_provision": "sec2"
    },
    {
      "term": "reasonable accommodation",
      "definition": "necessary and appropriate modification where needed in a particular case, to ensure that the persons with disabilities enjoy or exercise on an equal basis with others of all human rights and fundamental freedoms at home, workplace and in social life.",
      "source_provision": "sec2"
    }
  ]
}
