{
  "id": "pk-illegal-dispossession-act-2005",
  "type": "statute",
  "title": "Illegal Dispossession Act, 2005",
  "title_en": "Illegal Dispossession Act, 2005",
  "short_name": "IDA",
  "status": "in_force",
  "issued_date": "1974-02-28",
  "in_force_date": "1974-02-28",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5do-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Illegal Dispossession Act, 2005 (XI of 2005) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Act may be called the Illegal\nDispossession Act, 2005.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or",
      "content": "context,___\n(a)        “Court” means the Court of Session;\n(b)        “Code” means the Code of Criminal Procedure, 1898 (Act V of 1898);\n(c)        “occupier” means the person who is in lawful possession of a property;\n(d)        “owner” means the person who actually owns the property at the\ntime of his dispossession, otherwise than through a process of law; and\n(e)        “Property” means immovable property."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Prevention of illegal possession of property, etc",
      "content": "_(1) No one shall enter into or\nupon any property to dispossess, grab, control or occupy it without having any lawful\nauthority to do so with the intention to dispossess, grab, control or occupy the property from\nowners or occupier of such property.\n(2) Whoever contravenes the provisions of the sub-section (1) shall, without prejudice\nto any punishment to which he may be liable under any other law for the time being in force,\nbe punishable with imprisonment which may extend to ten years and with fine and the victim\nof the offence shall also be compensated in accordance with the provision of section 544A of\nthe Code.\n1\n[(3) Whoever forcibly and wrongfully dispossesses any owner or occupier of any\nproperty and his act does not fall within sub-section (l), shall be punished with imprisonment\nwhich may extend to three years or with fine or with both, in addition to any other\npunishment to which he may be liable under any other law for the time being in force. The\nperson dispossessed shall also be compensated in accordance with provisions of section\n544A of the Code.]\n1\nAdded by the Illegal Dispossession (Amendment) Act, 2017 (XXVIII of 2017), s. 2."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Cognizance of offence",
      "content": "_(1) Notwithstanding anything contained in the Code or\nany law for the time being in force, the contravention of section 3 shall be triable by the\nCourt of Session on a acomplaint.\n(2) The offence under this Act shall be non-cognizable.\n(3) The Court at any stage of the proceedings may direct the police to arrest the\naccused."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Investigation and procedure",
      "content": "_(1) Upon a complaint the Court may direct the\nofficer-in-charge of a police station to investigate and complete the investigation and forward the\nsame within fifteen days to the Court:\nProvided the Court may extend the time within which such report is to be forwarded in\ncase where good reasons are shown for not doing so within the time specified in this sub-section 1[:]\n1\n[Provided further that whenever a local inquiry is necessary for the purpose of this Act, the\nCourt may direct a Magistrate or a revenue officer in the district to make inquiry and submit report\nwithin a period as may be specified by the Court. The report of the Magistrate or revenue officer, as\nthe case may be, shall be construed as evidence in the case.]\n(2) On taking cognizance of a case, the Court shall proceed with the trial from day to day and\nshall decide the case within sixty days and for any delay, sufficient reasons shall be recorded.\n(3) The Court shall not adjourn the trial for any purpose unless such adjournment is, in its\nopinion, necessary in the interest of justice and no adjournment shall in any case be granted for more\nthan seven days.\n1\n[(4) On conclusion of the trial, if the complaint is found to be false, frivolous or vexatious,\nthe Court may award compensatory cost to the person complained against which may extend to five\nhundred thousand rupees.]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to attach property",
      "content": "_(1) If the Court is satisfied that none of the persons are\nin possession immediately before the commission of the offence, the Court may attach the property\nuntil final decision of the case.\n(2) In case of attachment, the methods of its management, safeguard against natural\ndecay or deterioration shall be determined by the Court."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Eviction and mode of recovery as an interim relief",
      "content": "_(1) If during trial the Court is\nsatisfied that a person is found prima facie to be not in lawful possession, the Court shall, as an\ninterim relief direct him to put the owner or occupier, as the case may be, in possession.\n(2) Where the person against whom any such order is passed under sub-section (1) fails to\ncomply with the same, the Court shall, notwithstanding any other law for the time being in force, take\nsuch steps and pass such order as may be necessary to put the owner or occupier in possession.\n(3) The Court may authorize any official or officer to take possession for securing\ncompliance with its orders under sub-section (1). The person so authorized may use or cause to be used\nsuch force as may be necessary.\n1\nSubs. and added by the Illegal Dispossession (Amendment) Act, 2017 (XXVIII of 2017), s. 3.\n(4) If any person, authorized by the Court, under sub-section (3), requires police assistance in\npolice station who shall on such requisition render such assistance as may be required.\n(5) The failure of the officer-in-charge of police station to render assistance under sub-section\n(4)shall amount to misconduct for which the Court may direct departmental action against him."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Delivery of possession of property to owner, etc",
      "content": "_(1) On conclusion of trial, if the\nCourt finds that an owner or occupier of the property was illegally dispossessed or property was\ngrabbed in contravention of section 3, the Court may, at the time of passing order under\n1\n[sub-sections (2) and (3)] of that section, direct the accused or any person claiming through him for\nrestoration of the possession of the property to the owner or, as the case may be, the occupier, if not\nalready restored to him under section 7.\n(2) For the purpose of sub-section (1), the Court may, where it is required, direct the\nofficer-in-charge of the police station for such assistance as may be required for restoration of the\npossession of the property to the owner or, as the case may be, the occupier.\n2\n[8A. Appeal. Any order made under sub-section (2) and sub-section (3) of section 3 and\nsub-section (l) of section 8 shall, within thirty days of the order, be appeal-able before the High\nCourt.]"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Application of Code. Unless otherwise provided in this Act, the provisions of the",
      "content": "Code of Criminal Procedure, 1898 (V of 1898), shall apply to proceedings under this Act.\n1\nSubs. by the Illegal Dispossession (Amendment) Act, 2017 (XXVIII of 2017), s. 4.\n2\nIns. by the Illegal Dispossession (Amendment) Act, 2017 (XXVIII of 2017), s. 5."
    }
  ],
  "definitions": [
    {
      "term": "Court",
      "definition": "the Court of Session;",
      "source_provision": "sec2"
    },
    {
      "term": "Code",
      "definition": "the Code of Criminal Procedure, 1898 (Act V of 1898);",
      "source_provision": "sec2"
    },
    {
      "term": "occupier",
      "definition": "the person who is in lawful possession of a property;",
      "source_provision": "sec2"
    },
    {
      "term": "owner",
      "definition": "the person who actually owns the property at the time of his dispossession, otherwise than through a process of law; and",
      "source_provision": "sec2"
    },
    {
      "term": "Property",
      "definition": "immovable property.",
      "source_provision": "sec2"
    }
  ]
}
