{
  "id": "pk-indecent-advertisements-prohibition-act-1963",
  "type": "statute",
  "title": "Indecent Advertisements prohibition Act, 1963",
  "title_en": "Indecent Advertisements prohibition Act, 1963",
  "short_name": "IAPA",
  "status": "in_force",
  "issued_date": "1963-06-17",
  "in_force_date": "1963-06-17",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJqU-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Indecent Advertisements prohibition Act, 1963 (XII of 1963) published by The Pakistan Code (Criminal Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Indecent\nAdvertisements Prohibition Act, 1963.\n(1) It extends to the whole of Pakistan.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,__\n(a)     “advertisement” includes any notice, circular or other document, displayed on\nany house, building or wall, or published in any newspaper or periodical, and\nany announcement made orally or by any means of producing or transmitting\nlight or sound, but does not include trade circulars issued by manufacturers of\ndrugs to medical practitioners;\n(b)     “indecent” includes whatsoever may amount to any incentive to sensuality and\nexcitement of impure thoughts in the mind of an ordinary man of normal\ntemperament, and has the tendency to deprave and corrupt those whose minds\nare open to such immoral influence, and which is deemed to be detrimental to\npublic morals and calculated to produce pernicious effect, in depraving and\ndebauching the minds of persons;\n(c)     “taking any part in the publication of any advertisement” includes—\n(i)     the writing, typing, stamping, drawing, announcing, printing or\ntransmitting of the advertisement ;\n(ii)    the publication of any advertisement outside Pakistan by or at the\ninstance of a person residing in Pakistan ;\n(d)     “public place” means any place where an advertisement can be seen or heard\nby members of the public."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Prohibition against person advertising, displaying, etc., indecent advertisements",
      "content": "Subject to the provisions of this Act—\n(i)        no person shall take any part in the publication of any advertisement which is\nindecent ; and\n(ii)       no person having the ownership, possession or control of any property or\npublic place shall knowingly allow any advertisement which is indecent to be\ndisplayed on such property or place, or to be announced therefrom."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Penalty",
      "content": "Whoever cotrnavenes any of the provisions of this Act shall, on conviction, be\npunishable—\n(a)   in the case of a first conviction, with imprisonment which may extend to six\nmonths, or with fine, or with both; and\n(b)        in the case of any subsequent conviction, with imprisonment which may\nextend to one year, or with fine, or with both."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Confiscation of documents, etc., containing indecent advertisements",
      "content": "Any person\nauthorised by the 1[Provincial Government] in this behalf may, at any time, seize and detain any\ndocument, article or thing which such person has reason to believe contains any advertisement which\ncontravenes any of the provisions of this Act and the court trying such contravention may direct that\nsuch document (including all copies thereof), article or thing shall be forfeited to the Government."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Offences by companies",
      "content": "(1) If the person contravening any of the provisions of this Act\nis a company, every person who at the time the offence was committed, was in charge of, and was\nresponsible to, the company for the conduct of the business of the company as well as the company\nshall be deemed to be guilty of the contravention and shall be liable to be proceeded against and\npunished accordingly:\nProvided that nothing contained in this sub-section shall render any such person liable to any\npunishment provided in this Act if he proves that the offence was committed without his knowledge\nor that he exercised all due diligence to prevent the commission on such offence.\n(2) Notwithstanding anything contained in sub-section (1), where any offence under this Act\nhas been committed by a company and it is proved that the offence was committed with the consent\nor connivance of, or is attributable to any neglect on the part of, any director, manager, secretary or\nother officer of the company, such director, manager, secretary or other officer shall also be deemed\nto be guilty of that offence and shall be liable to be proceeded against and punished accordingly.\nExplanation.—For the purpose of this section—\n(a)        ‘company’ means any body corporate and includes a firm or other association\nof individuals, and\n(b)        ‘director’ in relation to a firm means a partner in the firm."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Complaint by a police officer",
      "content": "Without prejudice to the right of any other person to\nmake a complaint of an offence under this Act, a police officer not below the rank of sub-inspector\nwho receives information that such an offence has been committed, shall, if he is satisfied as to the\ntruth of the information, make a complaint of the offence in writing to the nearest 2[Judicial\nMagistrate] having jurisdiction.\n1\nSubs. by F.A.O., 1975(P.O. NO. 4 of 1975), Art. 2 and Sch., for “Central Government”.\n2\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch. II."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Jurisdiction to try offences",
      "content": "No Court inferior to that of a Magistrate of the first class\nshall try any offence punishable under this Act."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Officers to be deemed to be public servants",
      "content": "Every person authorised under section 5\nshall be deemed to be a public servant within the meaning of section 21 of the Pakistan Penal Code\n(Act XLV of 1860)."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Indemnity",
      "content": "No suit, prosecution or other legal proceeding shall lie against any person\nfor anything which is in good faith done or intended to be done under this Act."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Other laws not affected",
      "content": "The provisions of this Act shall be in addition to, and not in\nderogation of, the provisions of any other law for the time being in force."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to exempt from application of Act",
      "content": "lf, in the opinion of the 1[Provincial\nGovernment], public interest so requires, it may, by notification in the official Gazette, direct that the\nprovisions of section 3 shall not apply, or shall apply subject to such conditions as may be specified\nin the notification, to, or in relation to, the advertisement of any specified drug or class of drugs."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Power to make rules",
      "content": "The 1[Provincial Government] may, by notification in the\nofficial Gazette, make rules for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. 2[Omitted]",
      "content": "_________\nDate: - 18.04.2024\n1\nSubs. by F.A.O., 1975 (P.O. No. 4 of 1975), Art. 2 and Sch., for “Central Government”.\n2\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch. II."
    }
  ],
  "definitions": [
    {
      "term": "advertisement",
      "definition": "any notice, circular or other document, displayed on any house, building or wall, or published in any newspaper or periodical, and any announcement made orally or by any means of producing or transmitting light or sound, but does not include trade circulars issued by manufacturers of drugs to medical practitioners;",
      "source_provision": "sec2"
    },
    {
      "term": "indecent",
      "definition": "whatsoever may amount to any incentive to sensuality and excitement of impure thoughts in the mind of an ordinary man of normal temperament, and has the tendency to deprave and corrupt those whose minds are open to such immoral influence, and which is deemed to be detrimental to public morals and calculated to produce pernicious effect, in depraving and debauching the minds of persons;",
      "source_provision": "sec2"
    },
    {
      "term": "public place",
      "definition": "any place where an advertisement can be seen or heard by members of the public.",
      "source_provision": "sec2"
    }
  ]
}
