{
  "id": "pk-injured-persons-medical-aid-act-2004",
  "type": "statute",
  "title": "Injured Persons (Medical Aid) Act, 2004",
  "title_en": "Injured Persons (Medical Aid) Act, 2004",
  "short_name": "IPAA",
  "status": "in_force",
  "issued_date": "2004-11-30",
  "in_force_date": "2004-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FtZpk%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Injured Persons (Medical Aid) Act, 2004 (XII of 2004) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_ (1) This Act may be called the Injured Persons\n(Medical Aid) Act, 2004.\n(2)     It extends to the whole of Pakistan.\n(3)     It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_ In this Act, unless there is anything repugnant in the subject or context,___\n(a)    “doctor” means a medical practitioner registered under the Medical and Dental\nCouncil Ordinance 1962 (XXXII of 1962);\n(b)    “Government” means the Federal Government or a Provincial Government as\nthe case may be;\n(c)    “hospital” means a hospital notified under section 7; and\n(d)    “injured person” means a person injured due to traffic accident, assault or any\nother cause who is in needs an immediate treatment."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Injured persons to be treated on priority basis",
      "content": "_ Where an injured person is brought to\na hospital, he shall be provided medical aid without delay on priority basis over all other\nmedico-legal formalities."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Non",
      "content": "interference by the police.___ No police official or officer shall interrupt or interfere\nduring the period an injured person is under treatment in a hospital except with the written\npermission of the Incharge of the hospital:\nProvided that such permission shall not be given unless it is necessary in connection with an\ninvestigation which may be carried out in the hospital so long as the injured person is under\ntreatment."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Consent of relatives not required in certain cases",
      "content": "_ Where an injured person requires\nemergency treatment or operation, the doctor treating or operating the injured person need not wait\nfor the consent of the relatives:\nProvided that if the relatives are present it would be preferable that such treatment or\noperation may be carried out with the consent of such relatives."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Shifting of an injured person to another hospital",
      "content": "_(1) An injured person shall not be\nshifted from a hospital until he is stabilized or the requisite treatment is not available in such hospital\nand while shifting him to another hospital, the doctor concerned shall complete the relevant\ndocuments with regard to the clinical conditions of the patient and hand over such documents to the\nconcerned doctor of the receiving hospital.\n(2) The record referred to in sub-section (1) shall be maintained by the referring hospital as\nwell as the receiving hospital and the Incharge of the hospital shall be responsible for ensuring that\nsuch record is kept in a safe custody where it cannot be tampered with:\nProvided that where necessary an injured person shall not be shifted unless he is accompanied\nby a doctor of the referring hospital."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Hospitals to be notified.",
      "content": "_ The Government shall, by notification in the official Gazette,\nnotify the Government hospitals having in-patient beds and also having facilities to deal with the\nemergencies to provide medical aid and treatment to the injured persons:\nProvided that in areas where above referred facility is not available, a rural health center\nestablished by a Government or a local government in that area having facility to deal with the\nemergencies, may be notified as hospital for the purposes of this Act."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. The injured person not to be taken to a police station",
      "content": "_ (1) Under no circumstances an\ninjured person be taken to a police station before necessary medical aid and treatment is given.\n(2)    The police officer is bound to ensure that the injured person is treated in a hospital as\nprovided in this Act before any medico-legal procedure is undertaken. The police officer shall not in\nany way influence the doctor or to give any opinion about the type and details of injury of the injured\nperson."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. The person bringing the injured person to hospital not to be harassed",
      "content": "_ The person\nwho on humanitarian basis, in particular in traffic accident cases, brings an injured person to a\nhospital shall not be harassed and shall be shown due respect and acknowledged for helping the\ninjured. He should be allowed to leave the hospital after taking down his name, address, telephone\nnumber and he shall provide a copy of his National Identity Card within three days; if the same is not\nimmediately available with him or any other proof to the satisfaction of Incharge of the hospital:\nProvided that nothing herein contained shall absolve the person bringing an injured person to\nhospital from any liability under any law for the time being in force for causing injury to such\nperson."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Awareness campaign.―An awareness campaign shall be carried out regularly to educate",
      "content": "the public, medical professionals and the police about medico-legal procedures."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Penalty",
      "content": "_ Whoever contravenes or violates the provisions of this Act or the rules made\nthere under shall be punishable with imprisonment which may extend to two years, or with fine not\nless than ten thousand rupees, or with both, in addition to any other penalty to which he may be\nliable under any other law for the time being in force:\nProvided that where penalty of fine is imposed half of such fine shall be paid to injured\nperson or his heirs, as the case may be, as compensation:\nProvided further that the Court may direct the Medical and Dental Council under the Medical\nand Dental Council Ordinance, 1962 (XXXII of 1962) to cancel the registration of a doctor convicted\nby the Court."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Cognizance of cases",
      "content": "_ (1) No Court shall take cognizance of a case under this Act,\nexcept upon a complaint made by an officer authorized in writing in this behalf by the Government.\n(2) The Government shall notify authorized officers under sub section (1) within thirty days\nof the commencement of this Act."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Instructions.―The Government may issue instructions from time to time to carry out the",
      "content": "purposes of this Act and the defaulting doctor or the police official or officer shall be liable to\ndisciplinary action for contravention of such instructions, besides the penalty to which he may be\nliable under section 11."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Rulemaking power",
      "content": "_ The Federal or Provincial Government, as the case may be, may\nmake rules to carry out the purposes of this Act.\n____________"
    }
  ],
  "definitions": [
    {
      "term": "doctor",
      "definition": "a medical practitioner registered under the Medical and Dental Council Ordinance 1962 (XXXII of 1962);",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government or a Provincial Government as the case may be;",
      "source_provision": "sec2"
    },
    {
      "term": "hospital",
      "definition": "a hospital notified under section 7; and",
      "source_provision": "sec2"
    },
    {
      "term": "injured person",
      "definition": "a person injured due to traffic accident, assault or any other cause who is in needs an immediate treatment.",
      "source_provision": "sec2"
    }
  ]
}
