{
  "id": "pk-inspection-agencies-registration-and-regulation-ordinance-1981",
  "type": "statute",
  "title": "Inspection Agencies (Registration and Regulation) Ordinance, 1981",
  "title_en": "Inspection Agencies (Registration and Regulation) Ordinance, 1981",
  "short_name": "IAARO",
  "status": "in_force",
  "issued_date": "1981-11-24",
  "in_force_date": "1981-11-24",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bZ6Z-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Inspection Agencies (Registration and Regulation) Ordinance, 1981 (XXXVII of 1981) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Power to make rules",
      "content": "THE INSPECTION AGENCIES (REGISTRATION AND REGULATION)\nORDINANCE, 1981\nORDINANCE No. XXXVII OF 1981\n[25th November, 1981]\nAn Ordinance to control and regulate the business in relation to pre-shipment inspection of goods\nexported out of or imported into, Pakistan.\nWHEREAS it is expedient to control and regulate the business in relation to pre-shipment\ninspection of goods exported out of, or imported into, Pakistan and for matters connected therewith\nor ancillary thereto;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, read\nwith the Provisional Constitution Order, 1981 (C. M. L. A. Order No. 1 of 1981), the President is\npleased to make and promulgate the following Ordinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Ordinance may be called the , 1981.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force on such 1date as the Federal Government may, by notification in\nthe official Gazette, appoint."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or",
      "content": "context,—\n(a)         “Authority” means the Authority appointed under section 3 ;\n(b)         “buyer”, in relation to goods exported out of Pakistan, means a person,\ncompany or organisation outside Pakistan who or which has agreed to\npurchase and import any goods from Pakistan, and, in relation to goods\nimported into Pakistan, a person, company or organisation in Pakistan\nregistered under the Order ;\n(c)        “certificate of inspection” means a certificate issued after inspection in the\nprescribed manner ;\n(d)        “Council” means the Pakistan Pre-shipment Inspection Council constituted\nunder section 4 ;\n1\ni.e., on the 5th January, 1982, by S.R.O. 5(I)/82, dated the 5-1-1982, see Gaz., of P., 1982, Ext., Part II, p. 5.\n(e)   “inspection”, in relation to any goods, means the process of determining by\nscientific methods of sampling, analysis and testing whether a batch or lot of\ngoods conforms to—\n(a)    a standard specification applicable to that class of goods laid down by\nor under any law, or\n(b)     specifications stipulated in the contract of sale provided it does not\ncome in conflict with the specification laid down by or under any law,\nor\n(c)     a sample or samples of that class of goods agreed upon between the\nseller and the buyer and bearing their signature, initials or any other\ndistinguishing marks ;\n(f)    “Order” means the Registration (Importers and Exporters) Order, 1952, made\nunder section 3 of the Imports and Exports (Control) Act, 1950 (XXXIX of\n1950) ;\n(g)    “prescribed” means prescribed by rules ;\n(h)    “registration” means registration under this Ordinance and “registered” shall\nbe construed accordingly ;\n(i)    “rules” means rules made under this Ordinance ; and\n(j)    “seller”, in relation to goods exported out of Pakistan, means an exporter\nregistered under the Order, and, in relation to goods imported into Pakistan, a\nperson, company or organization supplying goods from outside Pakistan."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Appointment of Authority. The Federal Government may, by notification in the official",
      "content": "Gazette, appoint an Authority for the purpose of registering companies."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Constitution of the Council, etc",
      "content": "(1) The Federal Government may, by notification in\nthe official Gazette, constitute a Council to be known as the Pakistan Pre-shipment Inspection\nCouncil consisting of such number of members as the Federal Government may determine.\n(2) The Council shall render to the Authority such technical assistance in relation to the\nexecution of the provisions of this Ordinance as may be required of it."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Prohibition of inspection by an unregistered firm",
      "content": "No company, organisation or\ninstitution, including a foreign company, hereinafter referred to as company, which has not been\nregistered with the authority, shall carry on the business of inspection or issue a certificate of\ninspection."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Registration of companies, etc",
      "content": "(1) Every company carrying on the business of\ninspection at the commencement of this Ordinance shall, within three months of such\ncommencement, and every company desiring to commence such business after such commencement\n1\n[or within such further time as the Authority may allow] shall, before commencing business, apply\nto the Authority for registration on payment of such fee as may be prescribed.\n(2) No company shall be registered unless it conforms to the prescribed conditions of\nregistration."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Penalties",
      "content": "Whoever contravenes the provisions of section 5 shall be punishable with\nimprisonment for a term which may extend to three years, or with fine, or with both."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Provisions of the Ordinance and the rules to override other enactments",
      "content": "(1) The\nprovisions of this Ordinance and the rules shall have effect in relation to goods exported out of, or\nimported into, Pakistan notwithstanding any provisions relating to quality control or buyer’s\nacceptance inspection prior to the export of such goods contained in any other law for the time being\nin force or in any instrument having effect by virtue of any such law.\n(2) All contracts embodying specification of goods signed before the commencement of this\nOrdinance shall remain valid and shall be fulfilled as such.\n(3) If the rules are amended so as to make any changes in the standard specification of any\ngoods, the changes so made shall not affect the contracts made in accordance with the standard\nspecifications existing prior to the changes."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Delegation of powers",
      "content": "The Federal Government may, by notification in the official\nGazette, direct that any power exercisable by it under this Ordinance or the rules shall, in relation to\nsuch matters and subject to such conditions, if any, as may be specified in the notification, be\nexercisable also by the Council or such officer or organisation subordinate to it as may be specified\nin the notification."
    }
  ],
  "definitions": [
    {
      "term": "Authority",
      "definition": "the Authority appointed under section 3 ;",
      "source_provision": "sec2"
    },
    {
      "term": "certificate of inspection",
      "definition": "a certificate issued after inspection in the prescribed manner ;",
      "source_provision": "sec2"
    },
    {
      "term": "Council",
      "definition": "the Pakistan Pre-shipment Inspection Council constituted under section 4 ; 1 i.e., on the 5th January, 1982, by S.R.O. 5(I)/82, dated the 5-1-1982, see Gaz., of P., 1982, Ext., Part II, p. 5.",
      "source_provision": "sec2"
    },
    {
      "term": "Order",
      "definition": "the Registration (Importers and Exporters) Order, 1952, made under section 3 of the Imports and Exports (Control) Act, 1950 (XXXIX of 1950) ;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules ;",
      "source_provision": "sec2"
    },
    {
      "term": "registration",
      "definition": "registration under this Ordinance and “registered” shall be construed accordingly ;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Ordinance ; and",
      "source_provision": "sec2"
    }
  ]
}
