{
  "id": "pk-inter-governmental-commercial-transactions-act-2022",
  "type": "statute",
  "title": "Inter-Governmental Commercial Transactions Act, 2022",
  "title_en": "Inter-Governmental Commercial Transactions Act, 2022",
  "short_name": "ICTA",
  "status": "in_force",
  "issued_date": "2022-11-03",
  "in_force_date": "2022-11-03",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5lqaA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Inter-Governmental Commercial Transactions Act, 2022 (XXX of 2022) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act shall be called the Inter-\nGovernmental Commercial Transactions Act, 2022."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the subject or\ncontext, —\n(a)     “commercial agreement” means business agreements entered under the G2G\nagreement;\n(b)     “Cabinet Committee” means Cabinet Committee on Inter-Governmental Commercial\nTransactions;\n(c)     “commercial transaction” includes sale, purchase, investment, divestment,\nprocurement, licensing, lease, joint ventures, assignments, concessions, services\ncontracts, management contracts or such other mode of business transactions arising\nout of a G2G agreement or a commercial agreement;\n(d)     “Federal Government” means the Government of Pakistan as defined under Article 90\nof the Constitution of the Islamic Republic of Pakistan; and\n(e)     “G2G agreement” or “inter-governmental framework agreement” means an agreement\nor memorandum of understanding entered between the Federal Government and\ngovernment of a foreign state."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Inter",
      "content": "governmental framework agreement.__ (1) The Federal Government may enter\ninto a G2G agreement with the government of a foreign state for the purposes of this Act.\n(2)    The G2G agreement under sub-section (1) shall include broad parameters and\nmechanism for execution of intended commercial transaction.\n(3)    Unless provided otherwise by the Cabinet Committee, a commercial agreement under\nthe G2G agreement shall be negotiated and executed between the nominated entities of the Federal\nGovernment and government of the foreign state.\n(4)     In case of entity nominated by the government of the foreign state, that government\nshall have either shareholding or control of the entity."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Constitution of Cabinet Committee",
      "content": "(1) The Federal Government shall, by\nnotification in the official Gazette, constitute a Cabinet Committee on Inter-Governmental\nCommercial Transactions."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power to relax or exempt from regulatory compliance",
      "content": "The Federal Government\non recommendation of the Cabinet Committee, by notification in the official Gazette and subject to\nsuch conditions, limitations or restrictions if any as may be specified therein, may relax or exempt\nfrom a regulatory requirement or operation necessitated by any law for the time being in force for\nimplementing the inter-governmental commercial transaction."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Conflict of interest",
      "content": "If a person acting on behalf of the Federal Government or\nnominated entity has direct, indirect or perceived personal interest in any agreement under this Act,\nthat person shall—\n(a)     immediately disclose such interest in writing to the Cabinet Committee; and\n(b)     not take part in any consideration on that matter unless the Cabinet Committee directs\notherwise."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Bar of jurisdiction",
      "content": "(1) No court shall entertain an application, petition or suit against\nany process or act undertaken or done, intended or purported to be undertaken or done under this Act.\n(2)      No court shall grant an injunction or entertain any application for injunction against any\nprocess undertaken, intended or purported to be undertaken for a commercial transaction or agreement\nunder this Act."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Indemnity",
      "content": "(1) No suit, prosecutions or any other legal proceedings or action in\ndamages shall lie for anything done, procedural lapses or omission in exercise or performance of any\nfunctions, power or duty conferred or imposed by or under this Act or any administered legislation\nunless the act or omission is shown, beyond reasonable doubt to have been in bad faith.\n(2)     Notwithstanding anything contained in any other law, an investigating agency, anti-\ngraft agency, law enforcement agency or a court shall not inquire into or initiate investigation for any\nprocedural lapse or irregularity by any person in a commercial transaction or agreement under this Act\nunless there exists an evidence of personal monetary gain with corroborative evidence of link between\nsuch monetary gain to the undue benefit rendered to any party of the agreement.\n(3)     No person shall be sued in his personal capacity for action taken in his official capacity.\n(4)     Any procedural irregularity or lapse shall not affect, vitiate, set- aside, annul or rescind\na commercial transaction or a commercial agreement under this Act."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Overriding effect",
      "content": "The provisions of this Act shall have effect notwithstanding\nanything inconsistent therewith contained in the Companies Act, 2017 (XIX of 2017), Privatization\nCommission Ordinance, 2000 (LII of 2000), the Public Procurement Regulatory Authority Ordinance,\n2002 (XXII of 2002), Public-Private Partnership Authority Act, 2017 (VIII of 2017), Securities and\nExchange Commission of Pakistan Act, 1997 (Act No. XLII of 1997), Securities Act, 2015 (Act No.\nIII of 2015) or any other law for the time being in force or in any instrument having effect by virtue of\nany law other than this Act."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Rules",
      "content": "The Federal Government may, by notification in the official Gazette, make\nrules for carrying out purposes and giving effect to the provisions of this Act.\nRGN-Dated.22-10-2025"
    }
  ],
  "definitions": [
    {
      "term": "commercial agreement",
      "definition": "business agreements entered under the G2G agreement;",
      "source_provision": "sec2"
    },
    {
      "term": "Cabinet Committee",
      "definition": "Cabinet Committee on Inter-Governmental Commercial Transactions;",
      "source_provision": "sec2"
    },
    {
      "term": "commercial transaction",
      "definition": "sale, purchase, investment, divestment, procurement, licensing, lease, joint ventures, assignments, concessions, services contracts, management contracts or such other mode of business transactions arising out of a G2G agreement or a commercial agreement;",
      "source_provision": "sec2"
    },
    {
      "term": "Federal Government",
      "definition": "the Government of Pakistan as defined under Article 90 of the Constitution of the Islamic Republic of Pakistan; and",
      "source_provision": "sec2"
    }
  ]
}
