{
  "id": "pk-interest-act-1839",
  "type": "statute",
  "title": "Interest Act 1839",
  "title_en": "Interest Act 1839",
  "short_name": "Interest Act 1839",
  "status": "in_force",
  "issued_date": "1839-12-29",
  "in_force_date": "1839-12-29",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ag%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Interest Act 1839 (XXXII of 1839) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Power of Court to allow interest. It is, therefore, hereby enacted that, upon all debts",
      "content": "or sums certain payable at a certain time or otherwise, the Court before which such debts or sums may\nbe recovered may, if it shall think fit, allow interest to the creditor at a rate not exceeding the current\nrate of interest from the time when such debts or sums certain were payable, if such debts or sums be\npayable by virtue of some written instrument at a certain time ; or if payable otherwise, then from the\ntime when demand of payment shall have been made in writing, so as such demand shall give notice\nto the debtor that interest will be claimed from the date of such demand until the term of payment :\nprovided that interest shall be payable in all cases in which it is now payable by law.\n_______\n1\nShort title given by the Short Titles Act, 1897 (14 of 1897).\n2\nThis Act has been declared to be in force in all the Provinces and the Capital of the Federation, except the Scheduled Districts, by the Laws Local Extent\nAct, 1874 (15 of 1874), s. 3. It has been declared by notification under s. 3(a) of the Scheduled Districts, Act, 1874 (14 of 1874) to be in force in the\nfollowing Scheduled Districts namely:__\nSind see Gazette of India, 1880, Pt. I, p. 672.\nThe Districts of Hazara, Peshawar, Kohat, Bannu, Dera Ismail Khan and Dera Ghazi Khan. (Portions of the Districts of Hazara, Bannu, Dera Ismail Khan\nand Dera Ghazi Khan and the Districts of Peshawar and Kohat now form the N.W.F.P.), see Gazette of India, 1901, Pt.I,p. 857 and ibid., 1902, Pt. I, p.\n575; but its application has been barred in that part of the Hazara District known as Upper Tanawal by the Hazara (Upper Tanawal) Regulation, 1900 (2\nof 1900),s . 3, see Gazette of India, 1886, Pt. I, p. 48.\n3\nShort title, “The Civil Procedure Act, 1833” see the Short Titles Act, 1896 (59 & 60 Vict., c. 14)."
    }
  ],
  "definitions": []
}
