{
  "id": "pk-international-court-of-justice-review-and-re-consideration-act-2021",
  "type": "statute",
  "title": "International Court of Justice (Review and Re-consideration) Act, 2021",
  "title_en": "International Court of Justice (Review and Re-consideration) Act, 2021",
  "short_name": "ICOJA",
  "status": "in_force",
  "issued_date": "2021-11-30",
  "in_force_date": "2021-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5hp-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of International Court of Justice (Review and Re-consideration) Act, 2021 (XXIV of 2021) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement.(1) This Act shall be called the International Court of",
      "content": "Justice (Review and Re-consideration) Act, 2021.\n(2) It shall extend to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. High Court’s power to review and reconsider.(1) where,",
      "content": "(a)   the International Court of Justice in relation to a foreign national passes an order in\nrespect of rights under Article 36 of the Vienna Convention of Consular Relations\nof 24 April, 1963; or\n(b) a foreign national is aggrieved in respect of the rights available under Article 36 of\nthe Vienna Convention of Consular Relations of 24 April, 1963,\nsuch foreign national, either himself or through his authorized representative, or through a consular officer\nof a mission of his country, or in default whereof, the Secretary, Ministry of Law and Justice in an\nappropriate case, may file a petition before a High Court for review and re-consideration, in terms of\nsection 3, with regard to an order of conviction or sentence of a military court operating under the Pakistan\nArmy Act, 1952 (XXXIX of 1952):\nProvided that any petition already filed or pending shall be treated as a petition having\nbeen filed under this section.\nExplanation.”High Court” means a High Court established under Article 175 of the\nConstitution of the Islamic Republic of Pakistan, within the limits of whose territorial jurisdiction a foreign\nnational is confined.\n(2) The petition for review and re-consideration may be filed within sixty days of\n(a) the commencement of this Act against the order of the military court specified in sub-\nsection (1) existing prior to the commencement of this Act; or\n(b) the order of the military court specified in sub-section (1), if such order has been delivered\nafter the commencement of this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Disposal of petitions for review and re",
      "content": "consideration.(1) In deciding a petition filed\nunder section 2, the Court shall examine whether any prejudice has been caused to the foreign national in\nrespect of his right of defence, right to evidence and principles of fair trial, due to denial of consular\naccess according to the Vienna Convention on Consular Relations of 24 April, 1963."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Removal of difficulties.If any difficulty arises in giving effect to any provisions of this",
      "content": "Act, the President may make such orders as may appear to him to be necessary for the purpose of removing\nsuch difficulty."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Act to have overriding effect.The provisions of this Act shall have effect notwithstanding",
      "content": "anything to the contrary contained in any other law for the time being in force including the Pakistan Army\nAct, 1952 (XXXIX of 1952).\n____________\nRGN Date: 15-12-2025"
    }
  ],
  "definitions": []
}
