{
  "id": "pk-international-finance-corporation-act-1956",
  "type": "statute",
  "title": "International Finance Corporation Act, 1956",
  "title_en": "International Finance Corporation Act, 1956",
  "short_name": "IFCA",
  "status": "in_force",
  "issued_date": "1956-04-17",
  "in_force_date": "1956-04-17",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap%2BbZQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of International Finance Corporation Act, 1956 (XXVIII of 1956) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Act may be called the International\nFinance Corporation Act, 1956.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force on such date1 as the 2[Federal Government] may, by notification\nin the official Gazette, appoint."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_ In this Act, unless there is anything repugnant in the subject or context,___\n(a)        “agreement” means any Agreement which may be signed and accepted on\nbehalf of the Government of Pakistan in pursuance of the Articles of\nAgreement approved by the Executive Directors of the Bank on the eleventh\nday of April 1955 providing for the establishment and operation of an\ninternational body to be called the International Finance Corporation ;\n(b)        “Corporation” means the International Finance Corporation ;\n(c)        “member” means a member of the Corporation.\n1\ni.e., the 8th May, 1956, see Gaz. of P., 1956, Ext., P. 1033.\n2\nSubs. by The Federal Adaptation of Laws Order 1975 (President’s Order No. 4 of 1975, Art. 2 and Table."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Financial provisions",
      "content": "_(1) There shall be paid out of the 1[Federal Consolidated Fund]\nand until the 1[Federal Consolidated Fund] is constituted, out of the Revenues of the 2[Federal\nGovernment], all such sums as may be required for the purpose of making payments on behalf of the\nGovernment of Pakistan under paragraph (a) of section 3 of Article II of the Agreement.\n(2) Any sums received by the Government of Pakistan from the Corporation in pursuance of\nthe Agreement shall be paid into the 1[Federal Consolidated Fund] and until the 1[Federal Consoli-\ndated Fund] is constituted into the Revenues of the 2[Federal Government]."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. State Bank to be depository for the Corporation",
      "content": "_ The State Bank of Pakistan shall be\nthe depository of the Pakistan currency holdings or other assets of the Corporation."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Certain provisions of Agreements to have force of Law",
      "content": "_ Notwithstanding anything to\nthe contrary contained in any other law, the provisions of Article VI of the Agreement set out in the\nSchedule shall have the force of law in Pakistan :\nProvided that nothing in section 9 thereof shall be construed as___\n(a)        entitling the Corporation to import into Pakistan goods free of any duty of\ncustoms without any restriction on their subsequent sale therein, or\n(b)        conferring on the Corporation any exemption from duties or taxes which form\npart of the price of goods sold or which are in fact no more than charges for\nservices rendered.\n(See section 5)\nProvisions of Agreement which shall have force of Law\nArticle VI\nSTATUS, IMMUNITIES AND PRIVILEGES\nSECTION 1.___ Purpose Article of\nTo enable the Corporation to fulfil the functions with which it is entrusted, the status,\nimmunities and privileges set forth in this Article shall be accorded to the Corporation in the\nterritories of each member.\n1\nSubs. by The Federal Adaptation of Laws Order 1975 (President’s Order No. 4 of 1975, Art. 2 and Table.\n2\nSubs., ibid.\nSECTION 2. ___Status of the Corporation.\nThe Corporation shall possess full juridical personality and in particular, the capacity:\n(i)     to contract ;\n(ii)    to acquire and dispose of immovable and movable property ;\n(iii)   to institute legal proceedings.\nSECTION 3.___Position of the Corporation with regard to Judicial Process.\nActions may be brought against the Corporation only in a court of competent jurisdiction in\nthe territories of a member in which the Corporation has an office, has appointed an agent for the\npurpose of accepting service or notice of process, or has issued or guaranteed securities. No action\nshall, however, be brought by members or persons acting for or deriving claims from members. The\nproperty and assets of the Corporation shall, wheresoever located and by whomsoever held, be\nimmune from all forms of seizure, attachment or execution before the delivery of final judgment\nagainst the Corporation.\nSECTION 4.___ Immunity of Assets from Seizure.\nProperty and assets of the Corporation, wherever located and by whomsoever held, shall be\nimmune from search, requisition, confiscation, expropriation or any other form of seizure by execu-\ntive or legislative action.\nSECTION 5. ___Immunity of Archives.\nThe archives of the Corporation shall be inviolable.\nSECTION 6.___ Freedom for Assets from Restrictions\nTo the extent necessary to carry out the operations provided for in this Agreement and subject\nto the provisions of Article III, section 5, and the other provisions of this Agreement, all property and\nassets of the Corporation shall be free from restrictions, regulations, controls and moratoria of any\nnature.\nSECTION 7.___Privilege for Communications\nThe official communications of the Corporation shall be accorded by each member the same\ntreatment that it accords to the official communications of other members.\nSECTION 8. ___ Immunities and Privileges of Officers and Employees.\nAll Governors, Directors, Alternates, officers and employees of the Corporation:\n(i)     shall be immune from legal process with respect to acts performed by them in\ntheir official capacity ;\n(ii)    not being local nationals, shall be accorded the same immunities from\nimmigration restrictions, alien registration requirements and national service\nobligations and the same facilities as regards exchange restrictions as are\naccorded by members to the representatives, officials, and employees of\ncomparable rank of other members ;\n(iii)   shall be granted the same treatment in respect of travelling facilities as is\naccorded by members to representatives, officials and employees of comp-\narable rank of other members.\nSECTION 9.___ Immunities from Taxation\n(a)     The Corporation, its assets, property, income and its operations and\ntransactions authorized by this Agreement, shall be immune from all taxation\nand from all customs duties. The Corporation shall also be immune from\nliability for the collection or payment of any tax or duty.\n(b)     No tax shall be levied on or in respect of salaries and emoluments paid by the\nCorporation to Directors, Alternates, officials or employees of the Corporation\nwho are not local citizens, local subjects, or other local nationals.\n(c)     No taxation of any kind shall be levied on any obligation or security issued by\nthe Corporation (including any dividend or interest thereon) by whomsoever\nheld:\n(i)     which discriminates against such obligation or security solely because\nit is issued by the Corporation ; or\n(ii)    if the sole jurisdictional basis for such taxation is the place or currency\nin which it is issued, made payable or paid, or the location of any\noffice or place of business maintained by the Corporation.\n(d)     No taxation of any kind shall be levied on any obligation or security\nguaranteed by the Corporation (including any dividend or interest thereon) by\nwhomsoever held:\n(i)     which discriminates against such obligation or security solely because\nit is guaranteed by the Corporation ; or\n(ii)    if the sole jurisdictional basis for such taxation is the location of any\noffice or place of business maintained by the Corporation.\nSECTION 10.___ Application of Article\nEach member shall take such action as is necessary in its own territories for the purpose of\nmaking effective in terms of its own law the principles set forth in this Article and shall inform the\nCorporation of the detailed action which it has taken.\n_______\nDate: 18-12-2024"
    }
  ],
  "definitions": [
    {
      "term": "agreement",
      "definition": "any Agreement which may be signed and accepted on behalf of the Government of Pakistan in pursuance of the Articles of Agreement approved by the Executive Directors of the Bank on the eleventh day of April 1955 providing for the establishment and operation of an international body to be called the International Finance Corporation ;",
      "source_provision": "sec2"
    },
    {
      "term": "Corporation",
      "definition": "the International Finance Corporation ;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of the Corporation. 1 i.e., the 8th May, 1956, see Gaz. of P., 1956, Ext., P. 1033. 2 Subs. by The Federal Adaptation of Laws Order 1975 (President’s Order No. 4 of 1975, Art. 2 and Table.",
      "source_provision": "sec2"
    }
  ]
}
