{
  "id": "pk-international-islamic-university-ordinance-1985",
  "type": "statute",
  "title": "International Islamic University Ordinance, 1985",
  "title_en": "International Islamic University Ordinance, 1985",
  "short_name": "IIUO",
  "status": "in_force",
  "issued_date": "1985-03-30",
  "in_force_date": "1985-03-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-b5uY-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of International Islamic University Ordinance, 1985 (XXX of 1985) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Removal of difficulties",
      "content": "THE SCHEDULE.__ (The First Statutes)\nANNEX I.__ (Islamic Research Institute)\nANNEX II.__ (International Institute of Islamic Economics)\nANNEX III.__(Shariah Academy)\nANNEX IV.__ (Academy for Da'wah Training of Imams)\nORDINANCE No. XXX OF 1985\n[31st March, 1985]\nAn Ordinance to reconstitute and re-organize the Islamic University\nWHEREAS it is expedient to establish an international seat of Islamic learning in Pakistan so\nas to provide every opportunity for an all round and harmonious development of individuals and\nsociety and reconstruction of human thought in all its form on the foundations of Islam;\nAND WHEREAS the Islamic University, Islamabad, working to achieve these objectives, has\nnow reached a stage when it can be reconstituted to become an autonomous International Islamic\nUniversity in order to encourage and promote education, training and research in Islamic learning,\nsocial, natural, applied and communication sciences and other branches of learning to ensure the\nMuslim Ummah’s ideological, moral, intellectual, social, economic and technological development in\naccordance with the values, ideals, principles and norms of Islam ;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, and in\nexercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the\nfollowing Ordinance:"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Ordinance may be called the International\nIslamic University Ordinance, 1985.\n(2)     It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or",
      "content": "context,\n(a)    “Academic Council” means the Academic Council of the University ;\n(b)    “Academy” means an Academy of the University ;\n(c)    “Authority” means an authority of the University as specified in this Ordinance;\n(d)    “Board of Trustees” means the Board of Trustees referred to in this Ordinance;\n(e)    “Board of Governors” means the Board of Governors of the University ;\n(f)    “Chancellor” means the Chancellor of the University ;\n(g)    “Dean” means the head of a faculty or other teaching, research or training unit\nof the University;\n(h)     “Director” or “Director General” means the head of an Academy, Institute or\nCentre ;\n(i)     “Government” means the Federal Government;\n(j)     “Institute” means a constituent/self-governing Institute maintained and\nadministered by the University ;\n(k)     “prescribed” means prescribed by Statutes, Regulations or Rules ;\n(l)     “President” means the President of the University ;\n(m)     “Pro-Chancellor” means the Pro­Chancellor of the University ;\n(n)     “Rector” means the Rector of the University ;\n(o)     “Statutes” “Regulations” and “Rules” means the Statutes, Regulations and\nRules made or deemed to have been made under this Ordinance ;\n(p)     “Trust” means the International Islamic University Trust established in Pakistan\nor abroad to support the University;\n(q)     “Teachers” include whole time Professors, Associate Professors, Assistant\nProfessors and research staff engaged by the University for teaching at the\nUniversity and such other persons as may be recognised to be Teachers by the\nBoard of Governors ;\n(r)     “University” means the International Islamic University as constituted under\nthis Ordinance; and\n(s)     “Vice-President” means Vice-President of the University."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Establishment of the University",
      "content": "(1) On the commencement of this Ordinance, the\nIslamic University established under the Islamic University Ordinance, 1980 (LIII of 1980), shall be\nre- constituted and re-named as the International Islamic University with its principal seat at Islamabad.\n(2)     The University shall consist of :__\n(i)     the Chancellor, the Pro-Chancellor, the Rector, the President, the\nDirectors­General, the Vice­Presidents, the Deans, and the Directors ;\n(ii)    members of the Board of Trustees, the Board of Governors, the Academic\nCouncil and other Authorities ;\n(iii)   Teachers ; and\n(iv)    such other officers as may be prescribed.\n(3)     The University shall be a body corporated by the name of the International Islamic\nUniversity having perpetual succession and a common seal and shall, by the said name, sue and be\nsued.\n(4)     The University shall be competent to acquire and hold property, both movable and\nimmovable, and to lease, sell or otherwise transfer any movable and immovable property which may\nhave vested in it or acquired by it in and outside Pakistan.\n(5)     The University shall be the custodian of the Faisal Mosque, Islamabad, and the\nbuildings attached to the Mosque and shall be responsible for its supervision, control and maintenance."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Powers and functions of the University",
      "content": "(1) The University shall make\narrangements for the promotion and dissemination of knowledge and for instruction, training and\nresearch in such fields as the University may determine.\n(2)   The University shall produce skilled manpower for effective implementation of Islamic\nlaws and management of Islamic Institutions in Pakistan and the rest of the Muslim World.\n(3)     The University shall be a fully autonomous body with freedom to govern its academic\nfunctions in order to achieve its objectives.\n(4)     The University shall have the powers to:__\n(a)    admit, teach and examine students ;\n(b)    award degrees, diplomas, certificates and other academic distinctions ;\n(c)    determine and prescribe courses of study in such branches of learning as the\nUniversity may determine ;\n(d)    provide for instruction, training and research in such branches of learning and\nat such levels, as it may determine ;\n(f)    decide teaching methods and strategies in order to ensure the most effective\neducational and other programmes ;\n(g)    institute Professorships, Associate Professorships, Assistant Professorships,\nResearch Associateships and any other positions, and to appoint persons thereto\nunder prescribed conditions ;\n(h)    create posts for teaching, research, extension, administration and other related\npurposes and to appoint persons thereto under prescribed conditions ;\n(i)    institute and award fellowships, scholarships, exhibitions, bursaries, medals and\nprizes and prescribe conditions for their dispensation ;\n(j)    establish Academies, Institutes, Faculties, Departments, Research and Training\nCentres, Libraries, Laboratories, Workshops, Museums and such other\nestablishments as may be necessary from time to time, and other centres of\nlearning for the development of teaching and research and to make such\narrangements for their maintenance, management and administration as it may\ndetermine ;\n(k)    establish and control the residences of the students, scholars and trainees of the\nUniversity and to institute and maintain halls of residence ;\n(l)    confer in the manner prescribed, honorary degrees, Emeritus Professorships or\nother distinctions on persons approved for the purpose ;\n(m)    confer degrees on persons who have conducted independent research under\nprescribed condition ;\n(n)    determine the equivalence of the examinations passed, and the periods of study\nspent, by students of the University at other Universities and places of learning\nand to review such equivalence, if necessary ;\n(o)    supervise and control the discipline of students of the University, promote\nco-curricular and recreational activities of such students, and make\narrangements for promoting their health, Islamic personality, morality and\ngeneral welfare in accordance with Islamic values ;\n(p)    demand and receive such fees and other charges as it may determine from time\nto time ;\n(q)    make provisions for research, training and advisory services and with these\nobjectives to enter into arrangements with other institutions or with public\nbodies under prescribed conditions ;\n(r)    enter into, execute, vary or cancel agreements, contracts and other arrangements\nwith governments, organizations, institutions, bodies and individuals for the\npurpose of carrying out its functions and activities ; and\n(s)    receive and manage properties, grants, donations, endowments, bequests, trusts,\ngifts and other contributions in Pakistan and abroad and administer, transfer or\ninvest the funds so received and apply as much of its income to the maintenance\nand development of the University and its constituent establishments as it may\ndeem fit ;\n(5)     Without prejudice to the generality of the above provisions, all powers not allocated to\nany other body of the University shall vest in the University to conduct its affairs and it may do all\nsuch other acts and things, as may be requisite in order to further the objects of the University."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. University open to all classes, creeds, etc. The University shall be open to all persons",
      "content": "of either sex of whatever religion, race, creed, class or color who desire to receive higher education\nwith Islamic orientation and no such person shall be denied the privileges of the University on the\nground only of sex, religion, race, caste, creed, class, colour or domicile."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Teaching in the University",
      "content": "(1) All recognized teaching in various courses shall be\nconducted by the University in the prescribed manner.\n(2)    The objective of all teaching at the University shall be to lay emphasis on the seeking\nof knowledge rather than on examinations and degrees, and, therefore, in addition to formal education,\nthe University may organize as many non-degree courses, classes, seminars, colloquia and workshops\nas possible.\n(3)     The authority responsible for organising recognized teaching shall be such as may be\nprescribed.\n(4)   The courses and the curricula shall be such as may be prescribed."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Officers of the University. The following shall be the officers of the University,",
      "content": "namely :__\n(i)      the Chancellor ;\n(ii)     the Pro­Chancellor;\n(iii)    the Rector ;\n(iv)     the President;\n(v)      the Directors­General of Academies ;\n(vi)     the Vice­President(s) ;\n(vii)    the Deans ;\n(viii)   the Directors ; and\n(ix)     such other persons as may be prescribed by Regulations to be the officers."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Chancellor",
      "content": "(1) The President of the Islamic Republic of Pakistan shall be the\nChancellor of the University.\n(2)     The Chancellor shall, when present, preside at the convocation of the University and\nthe meeting of the Board of Trustees.\n(3)     If the Chancellor is satisfied that any regulation or rule, or proceedings of any Authority\nare not in accordance with the provisions of this Ordinance, the Statutes, the Regulations or the Rules,\nhe may refer them to the Board of Trustees for reconsideration.\n(4)       Every proposal to confer an honorary degree shall be subject to confirmation by the\nChancellor.\n(5)   The Chancellor may remove any person from the membership of any Authority, if such\nperson.\n(i)      has become of unsound mind ; or\n(ii)     has become subject to an incapacity which prevents him from functioning as a\nmember of such Authority ; or\n(iii)    has been convicted by a court of law of an offence involving moral turpitude ;\nor\n(iv)    has been found involved in activities detrimental to the interests of the\nUniversity."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Visitation",
      "content": "(1) The Chancellor or the Pro-Chancellor may cause an inspection or\ninquiry to be made in respect of any matter connected with the affairs of the University and shall, from\ntime to time, appoint such person or persons as he may deem fit for the purpose of carrying out\ninspection of:—\n(i)     the University, its buildings, laboratories; libraries, museums, work­shops and\nequipment ;\n(ii)    any institution or hostel maintained by the University ;\n(iii)   the teaching, research and other work conducted by the University; and\n(iv)    the conduct of examination held by the University.\n(2)     The Chancellor or the Pro-Chancellor shall give notice to the Board of Governors of\nhis intention to cause an inspection or inquiry to be made under sub-section (1) and the Board of\nGovernors shall be entitled to be represented thereat.\n(3)    The Chancellor or the Pro-Chancellor shall communicate to the Board of Governors his\nviews with regard to the results of an inspection or inquiry made under sub-section (1) and shall, after\nascertaining the views of the Board of Governors thereon, advise the Board of Governors, on the action\nto be taken by it.\n(4)     The Board of Governors shall, within such time as may be specified, communicate to\nhim such action, if any, as has been taken or may be proposed to be taken upon the results of an\ninspection or inquiry communicated to it under sub-section (3).\n(5)    If the Board of Governors does not, within the specified time, take action to the\nsatisfaction of the Chancellor or the Pro-Chancellor, he may, after considering any explanation\nfurnished or representation made by the Board of Governors, issue such directions as he thinks fit, and\nthe Rector shall comply with such directions."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Pro",
      "content": "Chancellor.—(1) The Chancellor shall appoint a scholar of international repute or\nan educationist of distinction as Pro-Chancellor for such period and on such terms and conditions as\nhe may determine.\n(2)    The Pro-Chancellor shall, in the absence of the Chancellor, preside at the convocation\nof the University and at any meeting where business of the University is being considered.\n(3)     The Pro-Chancellor shall perform such functions as the Chancellor may delegate to him\nfrom time to time."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Rector",
      "content": "(1) The Chancellor shall appoint a scholar of international repute or an\neducationist of distinction as Rector for such period and on such terms and conditions as he may\ndetermine.\n(2)     The Rector, in the absence of the Chancellor and the Pro-Chancellor, shall preside at\nthe convocation of the University and the meetings of the Board of Trustees and when present he shall\npreside over the meetings of the Authorities.\n(3)     The Rector shall exercise general control and supervision over the affairs of the\nUniversity and shall ensure that the provisions of this Ordinance, the Statutes, the Regulations, the\nRules, policies and directions of the Board of Trustees are properly executed.\n(4)     The Rector shall submit the plans of work, the budget, as approved by the Board of\nGovernors, and a report on the activities of the University to the Board of Trustees.\n(5)      The Rector shall perform such other functions as may be entrusted to him by the\nChancellor, the Pro-Chancellor or the Board of Trustees."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. President",
      "content": "(1) The President shall be appointed by the Board of Trustees, out of a\npanel to be recommended by the Rector, on such terms and conditions as the Board of Trustees may\ndetermine and shall hold office during the pleasure of the Board of Trustees for a term not exceeding\nfour years.\n(2)    At any time when the office of the President is vacant or the President is absent or is\nunable to perform the functions of his office due to illness or some other cause, the Rector shall, so far\nas may be, in consultation with the President, appoint one of the Vice-Presidents to perform the duties\nof the President.\n(3)     The President shall have the following powers and duties, namely:—\n(a)     The President shall be the academic and administrative officer of the University\nand shall have, subject to the provisions of this Ordinance, Statutes, Regulations\nand Rules, such powers and duties as may be determined by the Board of\nTrustees from time to time.\n(b)     He may, in an emergency, which in his opinion requires immediate action, take\nsuch action as he may consider necessary and shall, as soon thereafter as\npossible, report his action to the authority or other body which in the ordinary\ncourse would have dealt with the matter.\n(c)     He shall have the power to create and fill posts temporarily for a period not\nexceeding six months, and shall, with the approval of the Rector, secure the\nservices of experts on the basis of contract for a period not exceeding two years\nand shall report all such cases to the Board of Governors.\n(d)     He shall have the power to detail any employee on any duty commensurate with\nhis status, qualifications and experience or transfer any employee to an\nequivalent post and report his action for information to the Board of Governors.\n(e)     He shall authorize expenditure in accordance with the budget and other\nguidelines, laid down by the Board of Governors from time to time.\n(f)     He shall promote general efficiency and good order of the University and shall\nhave all powers necessary to exercise control and enforce discipline over all\nTeachers, employees, research workers, students, scholars and trainees of the\nUniversity.\n(g)     He may delegate any of his powers to Vice-Presidents or any Teacher, officer\nor a committee and exercise such other powers as may be delegated to him by\nthe Board of Trustees or the Board of Governors."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Vice",
      "content": "Presidents.— (1) There may be one or more Vice-Presidents of the University.\n(2)   The Vice-President shall be appointed by the Board of Governors on the\nrecommendation of the President on such terms and conditions as may be determined by the Board of\nGovernors and exercise such powers as may be delegated to him by the President in consultation with\nthe Rector.\n(3)     The Vice-President shall perform such duties and functions as assigned by the President\nfrom time to time."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Other Officers. Subject to the provisions of this Ordinance, the terms and conditions",
      "content": "of service and powers and duties of other officers of the University shall be such as may be prescribed."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Authorities. The following shall be the Authorities, namely",
      "content": "(i)      the Board of Trustees ;\n(ii)     the Board of Governors ;\n(iii)    the Academic Council ;\n(iv)     the Board of Studies ;\n(v)      the Selection Board ;\n(vi)     the Finance and Planning Committee ;\n(vii)    the University Discipline Committee ; and\n(viii)   such other authorities as may be prescribed by the Statutes."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Board of Trustees",
      "content": "(1) There shall be a Board of Trustees consisting of the following\nex-officio members, namely:\n(i)      Chancellor     ..        ..      ..      Chairman\n(ii)     Pro-Chancellor\n(iii)    Rector\n(iv)     President\n(v)      Sheikh of Al-Azhar, Cairo.\n(vi)     Secretary-General, Rabita al-Alam-al-Islami.\n(vii)    Chairman, International Islamic Charitable Foundation, Kuwait.\n(viii)   Chief Justice, Supreme Court of Pakistan.\n(ix)     Chief Justice, Federal Shariat Court, Pakistan.\n(x)      Chairman, University Grants Commission, Pakistan.\n(xi)     Director-General, ISESCO, Rabat.\n(xii)    Secretary, Federal Ministry of Education, Government of Pakistan.\n(xiii) Rector, Ummul Qura University, Makkah.\n(xiv)    Rector, International Islamic University, Malaysia.\n(xv)     Rector, Cairo University.\n(xvi)    Rector, Al-Azhar University.\n(xvii) Rector, Muhammad Ibn Saud University, Riyadh.\n(xviii) Such other ex-officio members as may be elected by the Board of Trustees.\n(2)   The following shall be the Founder Members of the Board of Trustees, namely:__\n(i)      General Muhammad Zia-ul-Haq (Pakistan).\n(ii)     Sh. Abdul Aziz ben Baz (Saudi Arabia).\n(iii)    Dr. Abdullah Omer Nasif (Saudi Arabia).\n(iv)     Dr. Muhammad Afzal (Pakistan).\n(v)      Sheikh Yusuf Jasim Al-Hajji (Kuwait).\n(vi)     Dr. Ahmed Mohammad Ali (Saudi Arabia).\n(vii)    Dr. Hussain Hamid Hassan (Egypt).\n(viii) Prof. Khurshid Ahmad (Pakistan).\n(ix)     Maulana Zafar Ahmad Ansari (Pakistan).\n(x)      Dr. Ishaq Farhan (Jordan).\n(xi)     Dr. Ahmad Amin Faud (Egypt).\n(xii)    Dr. Muhammad Abdur Rahman al Bakr (U.A.E.)\n(xiii) Mr. Ahmed Bazi Yasin (Kuwait).\n(xiv)    Dr. Tayyib Zainul Abidin (Sudan).\n(xv)     Dr. Omar Jah (Gambia).\n(xvi)   Prof. Dr. Sabahuddin Zaim (Turkey).\n(xvii) Sheikh Mohammad Al-Gazali A1 Sakka (Algeria).\n(xviii) Mr. Abdullah Ali Al-Mutawa (Kuwait).\n(xix)   Maulana Abu Hassan al Nadvi (India).\n(xx)    Dr. Muhammad Hamid Ullah (Paris).\n(xxi)   Mr. Ibrahim Afandi (Saudi Arabia).\n(xxii) Mr. Saleh Kamil (Saudi Arabia).\n(3)   The ordinary members of the Board of Trustees may elect outstanding scholars as\nordinary members.\n(4)     Whenever there is a vacancy in the list of Founder Members, the Board of Trustees\nshall elect an ordinary member in his place who shall hold office for three years from the date of his\nappointment.\n(5)     One of the Vice-Presidents shall act as Secretary of the Board of Trustees who shall be\nappointed by the Rector in consultation with the President.\n(6)     Subject to the provisions of this Ordinance, the Board of Trustees shall be the supreme\nauthority of the University in all matters and its decisions shall be final and binding.\n(7)     Without prejudice to the generality of the provisions of sub-section (6), the Board of\nTrustee shall exercise and perform the powers and functions hereinafter specified, namely:—\n(a)     to formulate or approve the principal policies and the plans governing the\nactivities of the University ;\n(b)     to review and approve the creation of any component of the University, such as\nfaculties, colleges, programmes, institutes, standing committees, councils and\nother administrative bodies necessary to assist or improve the working of the\nUniversity ;\n(c)     to consider annual reports and budget, submitted by the Rector, relating to the\nactivities of the University and the execution of the plans of work and to direct\nthe Rector to submit reports relating to any mater specified by the Board of\nGovernors ;\n(d)     to make arrangements for the financial stability of the University, for ensuring\neffectiveness of its future operations, the continuity and preservation of the\nautonomy of the University and academic freedom of the faculties in their\neducational and research activities ;\n(e)     to create a Trust or Trusts for meeting developmental and recurring\nrequirements of the University ;\n(f)     to appoint from amongst its members such committees or sub-committees as\nmay, in the opinion of the Board of Trustees, lead to its more efficient and\neffective operation ;\n(g)     to approve the recommendations of the Board of Governors on all affiliations\nand other similar arrangements through which institutions or individuals may\nbecome associated with the University ;\n(h)     to appoint professors emeritus, to confer honorary degrees and other academic\ndistinctions with the approval of the Chancellor ;\n(i)     to take such initiatives as it may consider necessary or desirable for the efficient\nand effective management and functioning of the University so as to make the\nUniversity an effective and intellectual instrument for educational advancement\nof the Ummah.\n(8)      No act or proceeding of the Board of Trustees shall be invalid by reason only of the\nexistence of a vacancy in, or defect in the constitution of, the Board of Trustees."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Meetings of the Board of Trustees",
      "content": "(1) The Board shall meet at least once during a\nyear for regular or scheduled meetings and may meet at any other time at which a special meeting\nthereof may be called by the Chancellor or requisitioned in writing by not less than five members of\nthe Board of Trustees.\n(2)    Not less than ten clear days, notice of a special meeting shall be given to the members\nof the Board of Trustees and the agenda of the meeting shall be restricted to the matters specified in\nthe agenda to the annexed to such notice.\n(3)    The quorum for a meeting of the Board of Trustees shall be one-third of its members, a\nfraction being counted as one.\n(4)     The decisions of the Board shall be based on the majority vote of the members present\nand voting.\n(5)   In the case of equality of votes, the Chairman shall have a second or casting vote."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Board of Governors",
      "content": "(1) The Board of Governors shall have the following members,\nnamely:—\n(i)     Rector                                                ..      ..      ..       Chairman\n(ii)    President                                             ..      ..      ..       Vice-Chairman.\n(iii)   Chief Justice of the Federal Shariat Court or a       ..      ..      ..       Member.\nJudge of the said Court nominated by the Chief\nJustice\n(iv)    Secretary, Ministry of Education, Government of       ..      ..      ..       Member.\nPakistan\n(v)     Chairman, University Grants Commission, or his        ..      ..      ..       Members.\nnominee not below the rank of a permanent\nMember of the Commission\n(vi)    One Vice-Chancellor of a Pakistani University to       ..     ..      ..      Members.\nbe nominated by the Chancellor\n(vii)   Three scholars of international repute in the          ..     ..      ..      Members.\ndomain of Islamics to be nominated by the\nPro-Chancellor in consultation with the Rector.\n(viii) Three nominees of the Board of Trustees                 ..     ..      ..      Members.\n(ix)    One Vice-President appointed by the Rector in          ..     ..      ..      Secretary.\nconsultation with the President\n(2)   The members other than ex-Officio members, shall hold office for two years."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Meetings of the Board of Governors",
      "content": "(1) The Board shall ordinarily meet once in\nthree months but a special meeting may be called by the Rector at any time.\n(2)    Not less than ten clear days notice of a special meeting shall be given to the members\nof the Board of Governors.\n(3)    The quorum for a meeting of the Board of Governors shall be one-half of its members,\na fraction being counted as one.\n(4)     The decisions of the Board of Governors shall be based on the majority vote of the\nmembers present and voting."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Powers of the Board of Governors",
      "content": "(1) The Board of Governors shall function under\nthe overall guidance of the Board of Trustees and shall have the powers to execute the policies laid\ndown by it.\n(2)     Without prejudice to the generality of the provisions of sub-section (1), the Board of\nGovernors shall exercise and perform the powers and functions hereinafter specified, namely:__\n(a)     to hold, control and administer the property, funds and resources of the\nUniversity;\n(b)     to act as custodian of the University assets, properties and funds, other than that\nof the Trust;\n(c)     to regulate and govern the finances, accounts, investments, funds, loans,\ndonations and appoint agents for financial purposes.\n(d)     to consider and approve, on the advice of the Finance and Planning Committee\nof the University, the annual budget estimates and the revised budget estimates\nand to reappropriate funds from one head of the budget to the other, and to lay\ndown guidelines or rules of business dealing with financial disbursement ;\n(e)     to approve, vary or cancel contracts ;\n(f)     to initiate or approve schemes for the realisation of the objectives of the\nUniversity;\n(g)      to determine the form, provide for custody and regulate the use of common seal\nof the University ;\n(h)      to institute Profession ships, Associate and Assistant Professorships, research\nfellowships, and other teaching, research and administrative posts or to suspend\nor abolish them or convert them into other posts ;\n(i)      to appoint Teachers, researchers and officers on the recommendations of the\nSelection Board;\n(j)      to suspend, punish and remove from service the University employees whom it\nis empowered to appoint, in the manner prescribed after due enquiry and\ndefence ;\n(k)      to propose Statutes for submission to the Board of Trustees ;\n(l)      to approve Regulations and Rules on the recommendations of the appropriate\nbodies ;\n(m)      to appoint such individuals, committees or sub-committees and delegate such\npowers and assign such functions as may, in the opinion of the Board of the\nGovernors, lead to its more efficient and effective operation ; and\n(n)      to determine, regulate and administer all other matters concerning the\nUniversity and to this end exercise all necessary powers not specifically\nmentioned in this Ordinance or the Statutes, the Regulations and the Rules."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Academic Council",
      "content": "(1) The Academic Council shall consist of,__\n(i)      the President, who shall be its Chairman ;\n(ii)     the Vice­Presidents ;\n(iii)    Directors­General ;\n(iv)     the Deans ;\n(v)      the Directors of Institutes ;\n(vi)     the University Professors and Professors Emeritus ;\n(vii)    two Teachers to be appointed by the Rector in consultation with the President ;\nand\n(viii)   two eminent scholars to be nominated by the Board of Governors.\n(2)   One of the Deans or a Director appointed by the President shall act as Secretary of the\nAcademic Council.\n(3)    The quorum for a meeting of the Academic Council shall be one-half of the total\nnumber, of members a fraction being counted as one."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Powers and duties of the Academic Council",
      "content": "(1) The Academic Council shall be\nStatutes, have the power to lay down proper standards of instruction, research and examinations and\nto regulate and promote the academic life of the University.\n(2)     The Academic Council shall advise the Board of Governors on academic matters and\nshall exercise such powers and perform such duties as may be assigned to it by the Board of Governors\nand those prescribed by the Statutes."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Constitution, functions and powers of other Authorities. Subject to the provisions",
      "content": "of this Ordinance, the constitution, functions and powers of the Authorities for which no specific\nprovision or insufficient provision has been made in this Ordinance shall be such as may be prescribed\nby the Statutes."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Appointment of Committees by the Authorities. The Board of Trustees, the Board",
      "content": "of Governors and the Academic Council and any other Authority may, from time to time, appoint such\nstanding, special or advisory committees as it may deem fit, and may also appoint to such committees\npersons who are not its members."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. The academic and administrative staff. The academic and administrative staff of the",
      "content": "University shall be selected with a view to achieve its stated objectives and the basic criteria for their\nselection shall be the highest standards of intellectual competence, integrity, efficiency and\ncommitment to Islam."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Academic freedom. The academic staff of the University shall enjoy freedom of",
      "content": "expression in their research and educational work in accordance with the objectives of the University.\nSTATUTES, REGULATIONS AND RULES"
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Statutes",
      "content": "(1) Subject to the provisions of this Ordinance, Statutes may be made to\nregulate or prescribe all or any of the following matters namely:—\n(a)     creation of institutes and faculties ;\n(b)     service, pension and fringe benefits for University employees and terms and\nconditions of their service ;\n(c)     conditions of appointment of Professors Emeritus and award of honorary\ndegrees ;\n(d)     efficiency and discipline of the University employees ; and\n(e)     all other matters required to be regulated under the Statutes.\n(2)    Draft of the Statutes shall be proposed by the Board of Governors for approval by the\nBoard of Trustees which may approve them or refer them back for reconsideration.\n(3)     No Statute shall be valid until it has been approved by the Board of Trustees."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Regulations",
      "content": "(1) Subject to the provisions of this Ordinance and the Statutes,\nRegulations may be made for all or any of the following matters, namely :—\n(a)     schemes of studies and research including the duration of courses, number of\nsubjects or papers for examination ;\n(b)     syllabi and courses of study and research programmes leading to degrees,\ndiplomas or certificates ;\n(c)     conduct and supervision of examinations, appointment of examiners and\nscrutiny and tabulation of results ;\n(d)     determination of fees and other charges for admission to various courses ;\n(e)     maintenance of discipline among students and schemes for their welfare ;\n(f)     institution of fellowships, scholarships, prizes and medals, honorarium and\nother financial assistance to students and research scholars ;\n(g)     conduct of convocations and form of academic costumes ; and\n(h)     all other academic matters which are to be or may be prescribed by Regulations.\n(2)   The draft regulations shall be approved by the Board of Governors in consultation with\nthe Academic Councils.\n(3)     No regulation shall be valid until it has been approved by the Board of Governors."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Rules. The Board of Governors may prescribe rules for implementation of Statutes or",
      "content": "Regulations where so required under the Statutes and the Regulations or make rules to regulate any\nmatter relating to the affairs of the University which under this Ordinance are not specifically required\nto be provided for by the Statutes or the Regulations."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. University Fund",
      "content": "(1) There shall be a University fund to which shall be credited\nincome from any source including transfers from the Trust, fees, donations, bequests, endowments,\ncontributions and grants.\n(2)     The Board of Governors may establish special funds for specific institutions or projects."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Payments. All payments from the University fund shall be made in accordance with",
      "content": "the approved budget or funds for services rendered to, or supplies received by, the University."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Accounts. The accounts of the University shall be maintained and audited once a year",
      "content": "under financial rules to be prescribed by the Board of Governors in consultation with the Finance and\nPlanning Committee."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Audit. All payments shall be made after pre",
      "content": "audit by a resident Audit Officer to be\nappointed by the Board of Governors."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Annual statement of accounts. The President shall submit each year a statement of",
      "content": "expenditure and receipts of the University, duly audited by an external auditor appointed by the Board\nof Governors with his comments for consideration by the Board of Governors."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Retirement from service. An officer, Teacher or other employee of the University",
      "content": "shall retire from service.__\n(i)     on such date, after he has completed twenty five years of service qualifying for\npension or other retirement benefits as the competent authority may direct ; or\n(ii)    where no direction is given under clause (1), on the completion of sixty years\nof his age.\nExplanation.__ In this section ‘competent authority’ means the appointing authority or a person\nduly authorised by the appointing authority in that behalf, not being a person lower in rank to the\nofficer, Teacher or other employee concerned."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Opportunity to show cause. Except as otherwise provided, no officer, teacher on other",
      "content": "employee of the University holding a permanent post shall be reduced in rank, or removed or\ncompulsorily retired from service, unless he has been given a reasonable opportunity of showing cause\nagainst the action proposed to be taken."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Appeal to, and review by, the Board of Governors",
      "content": "(1) Where an order is\npassed punishing any officer (other than President). Teacher or other employee of the University or\naltering or interpreting to his disadvantage the prescribed terms or conditions of his service, he shall,\nwhere the order is passed by the President of any other officer or Teacher of the University, have the\nright to appeal to the Board of Governors, against the order, and, where the order is made by the Board\nhave the right to apply to that Authority for review of that order.\n(2)   The appeal or application for review shall be subject to the President who shall lay it\nbefore the Board of Governors with his views."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Pension, insurance, gratuity, provident fund and benevolent fund. The University",
      "content": "shall constitute for the benefit of its officers, teachers and other employees in such manner and subject\nto such conditions as may be prescribed such pension, insurance, gratuity, provident fund and\nbenevolent fund schemes as it may deem fit."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Commencement of term of office of members of Authorities. When a member of a",
      "content": "newly constituted Authority is appointed or nominated his term of office as fixed under this Ordinance\nshall commence from such date as may be prescribed."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Filling of casual vacancies in Authorities. Any casual vacancy among the appointed",
      "content": "or nominated member of any Authority shall be filled, as soon as conveniently may be, by the person\nor the body who appointed or nominated the member whose place has become vacant and the person\nappointed or nominated to the vacancy shall be a member of such Authority for the residue of the term\nfor which the person whose place he fills would have been a member."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Filling of vacancies in Authorities in certain circumstances. Where a vacancy in the",
      "content": "membership of an Authority other than the Board of Trustees cannot be filled because of__\n(a)     the office the holder whereof, was to be a member of the Authority ex- Officio\nhaving ceased to exist ;\n(b)    the organization, institution or other body, other than the University, having\neither ceased to exist or to function ; or\n(c)    the occurrence of other circumstances in which it has become impracticable to\nfill the vacancy.\nThe vacancy shall be filled in such manner as the Rector may direct."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Disputes about membership of Authorities, etc",
      "content": "(1) Notwithstanding anything\ncontained in this Ordinance, a person nominated or appointed to any Authority shall cease to be a\nmember of such Authority as soon as he ceased to hold the position by virtue of which he was\nnominated or appointed.\n(2) If a question arises whether any person is entitled to be a member of any Authority, the\nmatter shall be referred to a committee consisting of the President, a member of the Board of Governors\nand a nominee of the Rector and the decision of this committee shall be final and binding."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Proceeding of Authorities not invalidated by vacancies. No act, proceedings,",
      "content": "resolution or decision of any Authority shall be invalid by reason only of any vacancy in or any defect\nin the constitution of, or in the appointment or nomination of any member of, the Authority."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. First Statutes. Notwithstanding anything contained in this Ordinance, the Statutes set",
      "content": "out in the Schedules shall be deemed to be the Statutes framed under section 28 and shall remain in\nforce until they are amended or replaced by new Statutes framed in accordance with this Ordinance."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Bar of jurisdiction. No Court shall have jurisdiction to entertain any proceeding, grant",
      "content": "any injunction or make any order in relation to anything done in good faith or purported to have been\ndone or intended to be done under this Ordinance."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Indemnity. No suit or legal proceedings shall lie against the Government, the",
      "content": "University or any Authority, officer or employee of Government or the University or any person, in\nrespect of anything which is done, or purported to have been done in good faith or is intended to, or\nhas been done under this Ordinance."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Transitional provisions. Notwithstanding anything contained in this Ordinance, the",
      "content": "Board of Governors shall start functioning immediately after the promulgation of this Ordinance."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Repeal and savings",
      "content": "(1) The Islamic University Ordinance, 1980 (LI11 of 1980) is\nhereby repealed.\n(2)     Notwithstanding the repeal of the said Ordinance,__\n(a)    everything done, action taken, obligations or liabilities incurred, rights and\nassets acquired, persons appointed or authorised, jurisdiction or powers\nconferred, endowments, bequests, funds or trusts created, donations of grants\nmade, scholarships, studentships, or exhibitions instituted, affiliations or\nprivileges granted and orders issued under any of the provisions of the said\nOrdinance or the Statutes, the Regulations and the Rules made or deemed to\nhave been made thereunder , shall, if not inconsistent with the provisions of this\nOrdinance or the Statutes, the Regulations or the Rules made under this\nOrdinance, be continued and, so far as may be, be deemed to have been\nauthorised, conferred, created, made, instituted, granted and issued under this\nOrdinance.\n(b)     any Statutes, Regulations or Rules made or deemed to have been made under\nOrdinance, be deemed to be Statutes, Regulations or Rules made under this\nOrdinance having regard to the various matters which by this Ordinance have\nto be regulated or prescribed by Statutes, Regulations or Rules respectively, and\nshall continue to be in force, until they are repealed, rescinded or modified in\naccordance with the provisions of this Ordinance."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Trust",
      "content": "(1) The Board of Trustees shall create a Trust with sufficient endowment in\nPakistan and abroad in collaboration with International Islamic organizations, with similar objective\nto provide for financial back up and stability of the University.\n(2)     The administration and management of the Trust shall vest in the Board of Trustees.\n(3)     The accounts of the Trust shall be jointly operated by the Rector and the President.\n(4)     The objectives of the Trust shall be__\n(i)     to provide financial support to the University ;\n(ii)    to create an endowment for meeting the recurring and developmental\nexpenditure of the University ;\n(iii)   to encourage and receive donations, grants, bequests, gifts and contributions for\nattaining the objectives of the University ; and\n(iv)    to adopt measures for promotion and development of the University and to do\nall such other things and acts as may be necessary."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Statutes for Institutes, Academies etc",
      "content": "(1) The Statutes of the Islamic Research\nInstitute, the International Institutes of Islamic Economics, the Shari'ah Academy and the Academy\nfor Dawah and Training of Imams shall be such as prescribed in Annexures to the First Statutes.\n(2)    They shall remain in force until amended or replaced in the prescribed manner."
    }
  ],
  "definitions": [
    {
      "term": "Academic Council",
      "definition": "the Academic Council of the University ;",
      "source_provision": "sec2"
    },
    {
      "term": "Academy",
      "definition": "an Academy of the University ;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "an authority of the University as specified in this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "Board of Trustees",
      "definition": "the Board of Trustees referred to in this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "Board of Governors",
      "definition": "the Board of Governors of the University ;",
      "source_provision": "sec2"
    },
    {
      "term": "Chancellor",
      "definition": "the Chancellor of the University ;",
      "source_provision": "sec2"
    },
    {
      "term": "Dean",
      "definition": "the head of a faculty or other teaching, research or training unit of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "Institute",
      "definition": "a constituent/self-governing Institute maintained and administered by the University ;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by Statutes, Regulations or Rules ;",
      "source_provision": "sec2"
    },
    {
      "term": "President",
      "definition": "the President of the University ;",
      "source_provision": "sec2"
    },
    {
      "term": "Pro-Chancellor",
      "definition": "the Pro­Chancellor of the University ;",
      "source_provision": "sec2"
    },
    {
      "term": "Rector",
      "definition": "the Rector of the University ;",
      "source_provision": "sec2"
    },
    {
      "term": "Trust",
      "definition": "the International Islamic University Trust established in Pakistan or abroad to support the University;",
      "source_provision": "sec2"
    },
    {
      "term": "University",
      "definition": "the International Islamic University as constituted under this Ordinance; and",
      "source_provision": "sec2"
    },
    {
      "term": "Vice-President",
      "definition": "Vice-President of the University.",
      "source_provision": "sec2"
    }
  ]
}
