{
  "id": "pk-islamabad-capital-territory-child-marriage-restraint-act-2025",
  "type": "statute",
  "title": "Islamabad Capital Territory Child Marriage Restraint Act, 2025",
  "title_en": "Islamabad Capital Territory Child Marriage Restraint Act, 2025",
  "short_name": "ICTCM",
  "status": "in_force",
  "issued_date": "2025-05-28",
  "in_force_date": "2025-05-28",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tlZg%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Islamabad Capital Territory Child Marriage Restraint Act, 2025 (XI of 2025) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extend and commencement",
      "content": "(1) This Act may be called the Islamabad Capital\nTerritory Child Marriage Restraint 1[Act], 2025.\n(2) It shall extend to the Islamabad Capital Territory.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context.__\n(a)        “child” means a person male or female who is under eighteen years of age;\n(b)        “child abuse” means as defined under the Islamabad Capital Territory Child\nProtection Act, 2018, and shall also include the marriage of a child or\nsolemnization of marriage of a child with any person over the age of eighteen\nyears or with another child;\n(c)        “child bride” means the female child who has not attained the age of eighteen\nyears;\n(d)        “child groom” means the male child who has not attained the age of eighteen\nyears;\n(e)        “child marriage” means an act of solemnizing marriage or Nikah where both or\neither of the contracting party to the marriage is a child;\n(f)        “Code” means the Code of Criminal Procedure, 1898 (No. V of 1898);\n(g)        “contracting party” to marriage means either of the party whose marriage is, or\nis about to be solemnized;\n(h)        “Court” means the Court of a District & Sessions Judge;\n1The original word was ‘Bill’ which later on corrected via corrigenda issued on date 22-08-2025\n(i)     “Guardian” means a person, other than a biological parent who has parental\nresponsibility for a child, which may include a guardian appointed under the\nGuardians and Wards Act, 1890 (VIII of 1890); and\n(j)     “Child Trafficking” means recruitment, transportation, transfer, harbouring or\nreceipt of a child for the purpose of child marriage."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Registration of child marriages",
      "content": "(1) No Nikah registrar shall register a marriage\nwhere one or both the contracting parties are below the age of eighteen years.\n(2)    The Nikah registrar or any person solemnizing Nikah must ensure that the contracting\nparties possess valid Computerized National Identity Cards (CNICs) duly issued by the National\nDatabase and Registration Authority (NADRA), clearly stating their respective date of births.\n(3)     Whoever contravenes with or fails to comply with sub-section (1) and (2) shall be\nliable to be punished with simple imprisonment for a term which shall not be more than one year and\nwith fine amounting to one hundred thousand rupees, or both, unless he proves that he had reason to\nbelieve that the marriage was not a child marriage."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Punishment for male adult above eighteen years of age marrying a Child.",
      "content": "Whoever, being a male above eighteen years of age, contracts a child marriage shall be punished with\nrigorous imprisonment which may extend to three years but shall not be less than two years and shall\nbe liable to fine."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Punishment of Child Abuse.__ (1) Any form of co",
      "content": "habitation, before attaining the age\nof eighteen years, with or without consent, resulting from a child marriage shall be considered child\nabuse under this Act.\n(2) Any person who induces, forces, persuades, entices or coerces any child bride or child\ngroom to engage in any such activity prohibited by sub-section (1) or commits an act of child abuse\nshall be punished with imprisonment for a term which shall not be less than five years and may extend\nup to seven years and with fine which shall not be less than one million rupees, or both."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Punishment of Child Trafficking",
      "content": "(1) Any person who induces, forces, persuades, entices\nor coerces any child and compels such child to leave the territorial boundary of Islamabad Capital\nTerritory for the purpose of defeating and evading the provisions of this Act, with the intent to marry\ndescription for a term not less than five years which may extend to seven years with fine.\n(2) Any person who recruits, harbours, transports, provides or obtains any child for the purpose\nof marriage shall be punished with imprisonment of either description for a term of three years with\nfine."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Punishment for parent or guardian concerned in a child marriage",
      "content": "(1) Where a parent\nor guardian or any other person in any capacity, lawful or unlawful, does any act to promote the child\nmarriage, child abuse or permits child marriage to be solemnized, or negligently fails to prevent it from\nbeing solemnized, shall be punished with rigorous imprisonment which may extend to three years but\nshall not be less than two years and shall also be liable to fine.\n(2) For the purposes of this section, it shall be presumed, until contrary is proved, that where a\nchild has been contracted into a marriage, a person having charge of such child failed to prevent the\nmarriage from being solemnized."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Jurisdiction under this Act",
      "content": "Notwithstanding anything contained in section 190 of\nthe Code, no Court other than the Court of District & Sessions judge shall take cognizance of or try\nany offence under this Act"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Power to issue injunction prohibiting marriage in contravention of this Act",
      "content": "(1)\nNotwithstanding anything to the contrary contained in any other law, the Court may, if satisfied from\ninformation laid before it through an application that a child marriage in contravention of this Act is\ngoing to be arranged or is about to be solemnized, issue an injunction prohibiting such marriage:\nProvided that where a parent of a child involved in a child marriage or third party has laid the\ninformation before the Court and requests to keep his/her identity hidden from the contracting parties\nor from the parents or guardians of the contracting parties or the other parent, then the Court shall adopt\nappropriate measures to protect the identity of the third party or parent who has made the application\nbefore the Court.\n(2)     No injunction under sub-section (1) shall be issued against any person unless the Court\nhas previously given notice to such person, and has afforded him an opportunity to show cause against\nthe issue of the injunction. The Court may dispense with notice if deemed necessary.\n(3)     The Court may, either on its own motion or on an application of any person, rescind or\nalter any order made under sub-section (1).\n(4)    Where an application under sub-section (3) above is received, the Court shall afford an\nopportunity to the applicant of appearing before it either in person or by pleader; and if the Court\nrejects the application wholly or in part, it shall record in writing its reasons for so doing.\n(5)     Whoever, knowing that an injunction has been issued against him under sub-section (1)\nof this section, disobeys such injunction, shall be punished with imprisonment of either description for\na term which may extend to one year or fine or with both."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Offence to be punishable and triable",
      "content": "Notwithstanding anything contained in the\nCode, an offence punishable under this Act shall be cognizable, non-bailable and non-compoundable."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Cognizance, trial and conclusion of the case",
      "content": "The Court shall on taking cognizance\nof a case proceed with the trial and conclude the case within ninety days."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to make Rules",
      "content": "The Federal Government may, by notification in the official\nGazette, make rules for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Repeal and Savings",
      "content": "(1) The Child Marriage Restraint Act, 1929 is hereby repealed\nto the extent of Islamabad Capital Territory.\n(2) Notwithstanding the repeal of the Child Marriages Restraint Act, 1929, all orders made,\ndecisions taken, judgment passed by any Court, shall be deemed to have been validly made, taken and\npassed under this Act.\nRGN.Dated.26.09.2025"
    }
  ],
  "definitions": [
    {
      "term": "child",
      "definition": "a person male or female who is under eighteen years of age;",
      "source_provision": "sec2"
    },
    {
      "term": "child abuse",
      "definition": "as defined under the Islamabad Capital Territory Child Protection Act, 2018, and shall also include the marriage of a child or solemnization of marriage of a child with any person over the age of eighteen years or with another child;",
      "source_provision": "sec2"
    },
    {
      "term": "child bride",
      "definition": "the female child who has not attained the age of eighteen years;",
      "source_provision": "sec2"
    },
    {
      "term": "child groom",
      "definition": "the male child who has not attained the age of eighteen years;",
      "source_provision": "sec2"
    },
    {
      "term": "child marriage",
      "definition": "an act of solemnizing marriage or Nikah where both or either of the contracting party to the marriage is a child;",
      "source_provision": "sec2"
    },
    {
      "term": "Code",
      "definition": "the Code of Criminal Procedure, 1898 (No. V of 1898);",
      "source_provision": "sec2"
    },
    {
      "term": "Court",
      "definition": "the Court of a District & Sessions Judge; 1The original word was ‘Bill’ which later on corrected via corrigenda issued on date 22-08-2025",
      "source_provision": "sec2"
    },
    {
      "term": "Guardian",
      "definition": "a person, other than a biological parent who has parental responsibility for a child, which may include a guardian appointed under the Guardians and Wards Act, 1890 (VIII of 1890); and",
      "source_provision": "sec2"
    },
    {
      "term": "Child Trafficking",
      "definition": "recruitment, transportation, transfer, harbouring or receipt of a child for the purpose of child marriage.",
      "source_provision": "sec2"
    }
  ]
}
