{
  "id": "pk-islamabad-capital-territory-local-government-amendment-ordinance-2026",
  "type": "statute",
  "title": "Islamabad Capital Territory Local Government (Amendment) Ordinance, 2026",
  "title_en": "Islamabad Capital Territory Local Government (Amendment) Ordinance, 2026",
  "short_name": "ICTLG",
  "status": "in_force",
  "issued_date": "2026-01-09",
  "in_force_date": "2026-01-09",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5toaw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Islamabad Capital Territory Local Government (Amendment) Ordinance, 2026 (II of 2026) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Ordinance may be\ncalled the Islamabad Capital Territory Local Government (Amendment)\nOrdinance, 2026.\n(2)   It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. General amendments, Act X of 2015",
      "content": "In the Islamabad Capital\nTerritory Local Government Act, 2015 (X of 2015), hereinafter referred to as the\nsaid Act. for words “Metropolitan Corporation”, wherever occurring the words\n“Town Corporation” or “Town Corporations” shall be substituted respectively."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Amendment of section 2, Act X of 2015",
      "content": "In the said Act, in\nsection 2,—\n(a)   after clause (t), the following new clause (ta) shall be inserted,\nnamely:-\n“(ta) “Head” means Mayor of a Town Corporation or Chairman\nof a Union Council;”;\n(b)   for clause (m), the following shall be substituted, namely:-\n“(m) “Deputy Mayor” means a Deputy Mayor of a Town\nCorporation elected under section 16;”;\n(c)   for clause (x), the following shall In substituted, namely:-\n“(x) “local government” means a Union Council or the Town\nCorporation established under this Act and shall include the\nadministrator appointed by the Government;”;\n(d)   for clause (aa), the following shall be substituted, namely:-\n“(aa) “Mayor” means the Mayor of the Town Corporation elected\nas such under section 16;”;\nPART I]         THE GAZETTE OF PAKISTAN, EXTRA., JAN. 12, 2026                   159\n(e)   clause (cc) shall be omitted; and\n(f)   after clause (ww) the following new clause shall be inserted,\nnamely:-\n“(www) “Town Corporation” means the Town Corporations\nnotified as such under section 4;”."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Substitution of section 4, Act X of 2015",
      "content": "In the said Act, for\nsection 4, the following shall be substituted, namely:-\n“4. Local areas.—(1) For the purposes of this Act, the\nGovernment shall, by notification, specify the Islamabad Capital\nTerritory into three Town Corporations, each Town Corporation\nshall comprise, as far as practicable, to the territorial limits of a\nNational Assembly constituency within Islamabad Capital\nTerritory.\n(2) Each Town Corporation shall comprise such number of\nUnion Councils as may be notified by the Government. The Union\nCouncil shall be delimited on the basis of population equality,\nhaving regard to the latest official census and administrative\nconvenience.\n(3) The Government shall, by notification, specify the limits\nof each Union Council comprised therein, and shall declare\nwhether any area shall be constituted as, merged into, or cease to\nbe a Union Council accordingly.\n(4) The Government may, by notification, after inviting\npublic objections and suggestions in the prescribed manner, alter\nthe limits of—\n(a)   a Town Corporation; or\n(b)   a Union Council,\n(5) Any two or more adjoining Union Councils within a\nTown Corporation may, after inviting public objections, by a\nresolution passed by a two-third majority of the total membership\nof each concerned Union Council, make a proposal to the\nGovernment for alteration of their respective boundaries, subject to\nthe conditions specified in sub-section (4).\n(6) The Government may alter the limits of a Town\nCorporation or Union Council under this section after the initiation\n160      THE GAZETTE OF PAKISTAN, EXTRA., JAN. 12, 2026                     [PART I\nof delimitation proceedings, but shall not alter such limits after the\nannouncement of the election schedule for a local government\nelection in the relevant area.\n(7) Notwithstanding anything contained in this Act, the\nMetropolitan Corporation functioning before the commencement\nof this Ordinance shall continue to exist and shall exercise and\nperform all powers, functions and duties under this Act until such\ntime as the Government, by notification in the official Gazette,\nconstitutes and notifies Town Corporations in accordance with\nsection 4(1).”."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Substitution of section 6, Act X of 2015",
      "content": "In the said Act, for\nsection 6, the following shall be substituted, namely:-\n“6. Local Government and Delimitation.—(1) There shall\nbe towns corporations and such number of Union Councils as may\nbe specified by the Government under section 4(2).\n(2) The Government may, on the recommendation of the\nMinistry of Interior, by notification in the official Gazette, increase\nor decrease the number of Union Councils within a Town\nCorporations, provided that—\n(a)   the total number of Union Councils within Islamabad\nCapital Territory remains consistent with the principles\nof population equality and administrative efficiency;\nand\n(b)   no such change shall be made after the announcement of\nthe election schedule for a local government election.\n(3) Election Commission, of Pakistan shall delimit and\nnotify the Union Councils in the prescribed manner, on the basis of\nunder the Election Act, 2017 (XXXIII OF 2017).”."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Amendment of section 7, Act X of 2015",
      "content": "In the said Act, in\nsection 7, sub-sections (2) and (3) shall be omitted."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Amendment of section 9, Act X of 2015",
      "content": "In the said Act, in\nsection 9 for sub-sections (1) and (2) the following shall be substituted, namely:-\n“(1) Subject to this Act, the local governments constituted\nwithin the Islamabad Capital Territory shall be—\nPART I]      THE GAZETTE OF PAKISTAN, EXTRA., JAN. 12, 2026                161\n(a)   three Town Corporations; and\n(b)   Union Councils comprised within such              Town\nCorporations, as notified by the Government.\n(2) The Government may, by notification, declare any area\nin Islamabad Capital Territory to be a Town Corporation.”."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Substitution of section 10, Act X of 2015",
      "content": "In the said Act, for\nsection 10, the following shall be substituted, namely:-\n“10. Local governments.—The Islamabad Capital Territory\nshall consist of three Town Corporations and such number of\nUnion Councils. as provided in sections 11 and 12, respectively.”."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Substitution of section 12, Act X of 2015",
      "content": "In the said Act, for\nsection 12, the following shall be substituted, namely:-\n“12. Composition of the Town Corporations.—A Town\nCorporation shall consist of:\n(i)   Mayor and two Deputy Mayors;\n(ii) Chairmen of all Union Councils in its local area as\ngeneral members; and\n(iii) four women;\n(iv) one peasant/ worker;\n(v)   one trader/ businessman;\n(vi) one youth member; and\n(vii) one non-Muslim."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Omission of section 14, Act X of 2015",
      "content": "In the said Act,\nsection 14, shall be omitted."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Substitution of section 15, Act X of 2015",
      "content": "in the said Act, for\nsection 15, the following shall be substituted, namely:-\n“15. Election, of the members of the Union Councils.—\n(1) The election of general members of a Union Council shall be\nheld through secret ballot on the basis of adult franchise, in such\nmanner as may he prescribed.\n162     THE GAZETTE OF PAKISTAN, EXTRA., JAN. 12, 2026                  [PART I\n(2) For the purpose of election of general members of a\nUnion Council, the entire Union Council shall be a multi-member\nward.\n(3) A voter member shall only cast one vote in- favor of the\ncandidate of general member of his choice.\n(4) The nine candidates securing highest number of votes in\ndescending order, shall stand elected as general members:\nProvided that in case of equality of votes between two or\nmore contesting candidates, the Returning Officer shall draw a lot\nin respect of such candidates and the candidate on whom the lot\nfalls shall be deemed to have received the highest number of votes\nentitling him to be declared elected.\n(5) The returned candidates elected under sub-section (4)\nmay join a political party within thirty days of the publication in\nthe official Gazette of the names of the returned candidates.\n(6) The members on reserved seats of Union Council shall\nbe elected indirectly, through show of hands, by the general\nmembers of the Union Council.\n(7) The Chairman and Vice-Chairman of Union Council\nshall be elected, as joint candidate, by the general members and\nmembers on reserved seats of a Union Council, through show of\nhands, from amongst themselves.\n(8) The returned candidates of Chairman, Vice-Chairman\nand members may join a political party within thirty days of\nnotification of returned candidate.”."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Substitution of section 16, Act X of 2015",
      "content": "In the said Act, for\nsection 16, the following shall be substituted, namely:-\n“16. Election of the members of the Town Corporation.—\n(1) A Chairman of a Union Council shall become a general\nmember of the respective Town Corporation.\n(2) The general members shall elect the members on\nreserved seats as specified in section 12, through show of hands, by\nmajority of the members present, in the prescribed manner.\nPART I]         THE GAZETTE OF PAKISTAN, EXTRA., JAN. 12, 2026                    163\n(3) The members of the Town Corporations as mentioned in\nsection 12 shall elect a Mayor and two Deputy Mayors, as joint\ncandidates, through show of hands, by majority votes of members\npresent through voting in the prescribed manner:\nProvided that only a member of the Town Corporation shall\nbe eligible to contest the election for Mayor and Deputy Mayor.”."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Amendment of section 29, Act X of 2015",
      "content": "In the said Act, in\nsection 29,—\n(a)   in sub-section (3), the words “which period shall not exceed six\nmonth” shall be omitted;\n(b)   after sub-section (4) the following new sub-section (5) shall be\nadded, namely:-\n“(5) Where a local government is not functional, the\nGovernment may appoint an Administrator to exercise the powers\nand perform the functions of the local government until an elected\nlocal government assumes office.”."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Amendment of section 63, Act X of 2015",
      "content": "In the said Act, in\nsection 63, after sub-section (3), the following new sub-section (3A) shall be\ninserted, namely:-\n“(3A) A Deputy Mayor or a Vice-Chairman, as the case may\nbe, shall generally exercise such powers and perform such\nfunctions as may be delegated to them by the Head."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Substitution of section 88, Act X of 2015",
      "content": "In the said Act, for\nsection 88, the following shall be substituted, namely:-\n“88. Taxes to be levied.—(1) Subject to this Act, a local\ngovernment or in its absence an administrator, may, by\nnotification, levy any tax, fee, rate, rent, toll, charge or surcharge\nspecified in Fourth Schedule.\n(2) Every tax proposal under sub-section (1) prior to its\napproval shall be vetted by the Government in order to ensure that\nthe proposal is reasonable and in accordance with law.\n(3) The Government shall vet the tax proposal within thirty\ndays from the date of receipt of the proposal failing which it shall\nbe deemed to have been vetted by the Government.\n164         THE GAZETTE OF PAKISTAN, EXTRA., JAN. 12, 2026                           [PART I\n(4) Where a tax proposal is initiated by an Administrator, it\nshall, after being vetted by the Government, be laid before the\nNational Assembly within fifteen days. The National Assembly\nmay, within sixty days, disapprove the tax proposal, and if the said\nproposal is not disapproved within the aforesaid period of sixty\ndays, it shall be deemed to have been approved.\n(5) A local government or in its absence an administrator,\nshall not levy a tax without previous publication of the tax proposal\nand inviting and hearing public objections.\n(6) A local government or in its absence an administrator,\nmay, subject to provision of sub-section (1), increase, reduce,\nsuspend, abolish or exempt any tax.”."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Substitution of section 93, Act X of 2015",
      "content": "In the said Act, for\nsection 93, for sub-section (1), the following shall be substituted, namely:-\n“(1) The Government may issue directions to the local\ngovernment or to the administrator, as the case may be. The\ndirections of the Government shall be binding on the local\ngovernment and the administrator.”.\nASIF ALI ZARDARI,\nPresident.\n————\nRAJA NAEEM AKBAR,\nSecretary.\nPRINTED BY THE MANAGER, PRINTING CORPORATION OF PAKISTAN PRESS, ISLAMABAD.\nPUBLISHED BY THE DEPUTY CONTROLLER, STATIONERY AND FORMS, UNIVERSITY ROAD, KARACHI."
    }
  ],
  "definitions": []
}
