{
  "id": "pk-islamabad-capital-territory-local-government-act-2015",
  "type": "statute",
  "title": "Islamabad Capital Territory Local Government Act, 2015",
  "title_en": "Islamabad Capital Territory Local Government Act, 2015",
  "short_name": "ICTLG",
  "status": "in_force",
  "issued_date": "2015-08-04",
  "in_force_date": "2015-08-04",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2JwZp4%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Islamabad Capital Territory Local Government Act, 2015 (X of 2015) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Islamabad Capital\nTerritory Local Government Act, 2015.\n(2) It extends to the Islamabad Capital Territory except any area excluded by the Government,\nby notification, for reasons to be recorded in writing.\n(3) It shall come into force on such date as the Government may, by notification, appoint and\ndifferent dates may be appointed for coming into force of different provisions of this Act."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the subject or context,\n(a)     “Administration” means the Islamabad Capital Territory Administration;\n(b)     “Authority” means the Capital Development Authority;\n(c)     “budget” means an official statement of the income and expenditure of a local\ngovernment for a financial year;\n(d)     “building” includes any shop, house, hut, outhouse, shed, stable or enclosure\nbuilt of any material and used for any purpose, and also includes a wall, well,\nverandah, platform, plinth, ramp, stair-case and steps;\n(e)     “building line” means a line beyond which the outer face or any part of an\nexternal wall of a building may not project beyond privately owned land in the\ndirection of any street, existing or proposed;\n(f)     “bye-laws” means bye-laws made under this Act or made under the Capital\nDevelopment Authority Ordinance, 1960 (XXIII of 1960) or the Municipal\nAdministration Ordinance, 1960;\n(g)     “cattle” includes cows, buffaloes, bulls, oxen, bullocks, heifers, calves, camels,\nsheep, goats and others;\n(h)   “Chairman” means the Chairman of a Union Council as mentioned in section\n11;\n(i)   “Chief Officer” means the Chief Officer appointed under section 63;\n(j)   “Code” means the Code of Criminal Procedure, 1898 (Act V of 1898);\n(k)   “conservancy” means the collection, treatment, removal and disposal of refuse;\n(l)   “dairy” includes any farm, cattle-shed, cow-house, milk store, milk shop or any\nother place from where milk or milk products are supplied;\n(m)   “Deputy Mayor” means a Deputy Mayor of the Metropolitan Corporation\nelected under section 12;\n(n)   “District” means the area specified in section 2 of the Capital of the Republic\n(Determination of Area) Ordinance, 1963 (Ordinance VI of 1963);\n(o)   “drain” includes a sewer, a house drain, a drain of any other description, a\ntunnel, a culvert, a ditch, a channel or any other device for carrying sullage or\nrain water;\n(p)   “dwelling house” means any building used substantially for human habitation;\n(q)   “Election Commission” means the Election Commission constituted under\nArticle 218 of the Constitution of the Islamic Republic of Pakistan;\n(r)   “factory” means a factory as defined in the Factories Act, 1934 (XXV of 1934);\n(s)   “food” includes every eatable used for food or drink by human beings but does\nnot include drugs or water;\n(t)   “Government” means Federal Government as the Rules of Business may\nspecify;\n(u)   “infectious disease” means cholera, plague, smallpox and tuberculosis, and\nincludes such other disease as the Government may, by notification, declare to\nbe infectious or disease for purposes of this Act;\n(v)   “land” includes the land which is being built up or is built up or is covered with\nwater or is under cultivation or is fallow;\n(w)   “Local Fund” means the fund of a local government established under section\n78;\n(x)   “local government” means a Union Council or the Metropolitan Corporation\nestablished under this Act;\n(y)   “market” means a place where persons assemble for the sale and purchase of\nmeat, fish, fruit, vegetables or any other article of food or for the sale and\npurchase of livestock or animals and includes any place which may be notified\nas a market;\n(z)   “Master Plan” means the Master Plan developed, maintained and enforced by\nCapital Development Authority;\n(aa)   “Mayor” means the Mayor of the Metropolitan Corporation elected as\nsuch under section 12;\n(bb)   “member” means a member of a local government;\n(cc)   “Metropolitan Corporation” means the Metropolitan Corporation\nnotified as such under section 9;\n(dd)   “misconduct” means transgression of the prescribed code of conduct or\ndereliction of duty or deliberate unlawful behavior or violation of law or\nrules or lawful directions or orders of the Government and includes,-\n(i)     gross negligence in the performance of duties with manifest\nwrongful intent or evil design;or\n(ii)    an act that results in wrongful gain to any person by wrongful\napplication of law; or\n(iii)   making or managing appointment, promotion or transfer of an\nofficer or official in violation of law or rules or for extraneous\nconsideration; or\n(iv)    bribery, corruption, jobbery, favoritism, nepotism or willful\ndiversion of the fund of the local government;\n(ee)   “municipal offence” means an act or omission punishable under this Act\nand includes an act or omission declared as municipal offence under any\nother law for the time being in force in Islamabad Capital Territory;\n(ff)   “notification” means notification issued by the Government under this\nAct and published in the Official Gazette;\n(gg)   “nuisance” includes any act, omission, place or thing which causes or is\nlikely to cause injury as may be specified, danger, annoyance or offence\nto the sense of sight, smell or hearing or which is or may be dangerous to\nlife or injurious to health or property;\n(hh)   “occupier” means any person, for the time being, in actual lawful\noccupation of the land or building and includes an owner in actual\noccupation of the land or building;\n(ii)   “owner” includes the person for the time being receiving the rent of land\nand buildings or either of them, including an agent or trustee for any\nperson or society or for any religious or charitable purpose or who would\nso receive the same if land or building was let to a tenant;\n(jj)   “peasant” means a landless farm worker or, a person, who during the\nperiod of five years preceding the year in which the election is held,\nowningless than five acres of land as sole owner for subsistence living;\n(kk)   “prescribed” means prescribed by the rules as defined under clause (tt);\n(ll)   “prohibited zone” means any area or areas within a local government\ndeclared as prohibited zone by a public notice for purposes of this Act;\n(mm) “public road” means and includes a road or street or way maintained by\nthe Government or by a local government or by any other local authority;\n(nn)   “public place” means any building, premises or place to which the public\nhave access;\n(oo)   “rate” means and includes the charges that may be fixed and levied by\nthe local governments for provision of any services, for which it incurs a\ncost, provided under this Act;\n(pp)   “refuse” includes rubbish, offal, night-soil, carcasses of animals, deposits\nof sewerage, waste and any other offensive matter;\n(qq)   “rent” means whatever is by law payable in money or kind by a tenant or\nlessee on account of lawful occupation or use of any building or land;\n(rr)   “revenue estate” means a revenue estate declared under the Land\nRevenue Act, 1967 (XVII of 1967) as adapted in the Islamabad Capital\nTerritory;\n(ss)   “road” includes a road or a street or way which is not a thoroughfare;\n(tt)   “rules” means rules made under the Capital Development Authority\nOrdinance, 1960 or may be made under this Act;\n(uu)   “Schedule” means a Schedule appended to this Act;\n(vv)   “streets line” means a line dividing the land comprised in, and forming\npart of, a road or street from the adjoining land;\n(ww) “tax” includes any cess, rate, fee, toll or other charge levied under this\nAct;\n(xx)   “technocrat” means a person who is the holder of a degree requiring\nconclusion of at least sixteen years of education recognized by the Higher\nEducation Commission and at least five years of experience in the\nrelevant field;\n(yy)   “Union Council” means an area notified as a Union Council under\nsection 7;\n(zz)      “vehicle” means a wheeled conveyance capable of being used on a road\nor street;\n(aaa)     “Vice Chairman” means the Vice Chairman of a Union Council\nas mentioned in section 11;\n(bbb) “village” means an integrated and contiguous human habitation\ncommonly identified by a name and includes a dhok, chak,\ngaown, basti or any other comparable habitation within a revenue\nestate;\n(ccc)     “voter” means a person, whose name for the time being appears\non the electoral rolls prepared or adapted for the purposes of the\nelection under this Act;\n(ddd) “worker” means a person directly engaged in work or is\ndependent on personal labour for subsistence living and includes\na worker as defined in the Industrial Relations Act 2012 (X of\n2012);\n(eee)     “youth” means a person who is enrolled as a voter in the\nrespective Union Council and is 1[*] less than twenty-five years\nof age on last day fixed for filing of nomination papers; and\n(fff)     “Zoning Regulation” means the Islamabad Capital Territory\nZoning Regulations 1992.\n(2) The expressions, not defined in sub-section (1), shall have the same meaning as defined in\nany other relevant law or generally used."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Local governments to work within the existing framework",
      "content": "(1) The local governments\nestablished under this Act shall faithfully observe all laws applicable in Islamabad Capital Territory.\n(2) In the performance of their functions, the local governments shall not impede or prejudice\nthe exercise of the executive authority of the Government or any office performing functions of the\nProvincial Government in the Islamabad Capital Territory.\n(3) The development, planning and overall maintenance of the Master plan within the specified\narea of Islamabad Capital Territory will continue to vest with Capital Development Authority and thus\nin violation of the Capital Development Authority Ordinance,1960 and the Zoning regulations duly\napproved by the Government. All powers to be exercised and rules to be enforced shall be subject to\nthe planning framework already set in the aforementioned laws, rules and regulations.\n_________________________________________________________________________________\n1\nOmitted by Act No. XXXV of 2016, s.2.\n(4) This legal framework shall without derogation to the existing laws and regulations of the\nIslamabad Capital Territory and Capital Development Authority and segments not covered by the\nprevalent law shall be covered by the respective local Government, as determined by the Government.\nWherever there is a clash between the existing law and provisions of this Act, the existing law shall\nprevail unless clearly specified or repealed."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Local areas",
      "content": "(1) For purposes of this Act, the Government shall, by notification, specify\nthe local area within Islamabad Capital Territory as Union Councils and for the Metropolitan\nCorporation, as the case may be.\n(2) The Government may, by notification, after inviting public objections and suggestions, alter\nthe limits of a local area and declare that any area shall cease to be a Union Council.\n(3) Any two or more adjoining Union Councils within Islamabad Capital Territory may, after\ninviting public objections through a resolution passed by two-third majority of the total membership\nof each of the Union Councils, make a proposal to the Government for a change in their respective\nboundaries subject to the condition that no revenue estate shall be divided and the size of population\nin the relevant Union Council shall, as far as possible, be close to the average population of similar\nUnion Councils in Islamabad Capital Territory.\n(4) The Government may, with the concurrence of the Election Commission, alter the limits of\na local area under this section after the initiation of proceedings of delimitation of constituencies by\nthe Election Commission but the Government shall not alter the limits of a local area after the\nannouncement of election schedule for election in local area."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Division and reconstitution of a local government",
      "content": "(1) The Government may, by\nnotification, divide a local government into two or more local governments or alter the limits of a local\ngovernment and may specify in the notification the consequences which shall ensue upon the\npublication of such notification.\n(2) When, as a result of such division or reconstitution, any new local government is\nconstituted, in accordance with the provisions of this Act in the manner specified in the notification,—\n(a)        the existing members of any local government so divided or reconstituted shall\nbecome the members of such local government as the Government may, by\nnotification, specify as if each such member had been elected to that local\ngovernment; and\n(b)        such local government shall, to the extent and in the manner specified in the\nnotification, be the successor of the local government so divided or\nreconstituted."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Local Government and Delimitation",
      "content": "1[(1) There shall be one hundred and twenty-five\nUnion Councils within the Islamabad Capital Territory under this Act. The Federal Government, on\nthe recommendations of Ministry of Interior, by notification in the official Gazette may increase or\ndecrease the number of union councils from time to time.]\n_________________________________________________________________________________\n1\nSubs. by Act No. VIII of 2023 by s.2.\n(2) After the demarcation of the Local Government under section 5 and determination of\nnumber of Union Councils, the Election Commission, shall delimit Union Councils.\n(3) The Election Commission shall delimit and notify 1[in the official Gazette] the Councils on\nthe basis of the principles laid down in section 7, as nearly as possible, under the Delimitation of\nConstituencies Act, 1974 (XXXIV of 1974) or any other Act of the Majlis-e-Shoora (Parliament)."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Delimitation of Union Councils",
      "content": "(1) A Union Council shall be an area consisting of one\nor more revenue estates or, in the case of an area where revision of settlement under the law has not\ntaken place, one or more census villages or, in the case of an urban area, a census block or blocks as\ndelimited for purposes of the last preceding census or a census block and a revenue estate, notified as\nsuch by the Election Commission.\n2\n[(2) The Election Commission shall delimit Union Council into nine wards for the election of\nmembers on general seats.]\n1\n[(3) For the purpose of delimitation of a ward of a Union Council, —\n(a)        a ward shall consist of a census block or adjoining census blocks;\n(b)        boundaries of the wards shall not cross limits of the Union Council;\n(c)        population of wards in a Union Council shall as far as possible be uniform; and\n(d)        a court, officer or authority shall not review or correct any delimitation of Union\nCouncil or ward after the notification of the election schedule.]"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Waiver of conditions.―The Election Commission may, in a specific case and for reasons",
      "content": "to be recorded in writing, waive the conditions of delimitation mentioned in section 6."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Constitution of Local Governments",
      "content": "(1) Subject to sub-section (2), the local\ngovernments constituted under this Act shall be:\n(a)        Metropolitan Corporation for Islamabad Capital Territory; and\n(b)        Union Councils for Islamabad Capital Territory as the Government may notify.\n(2) The Government may, by notification, declare any area in Islamabad Capital Territory to\nbe a Union Council.\n1\nIns. and added by Act No. XXXV of 2016, ss. 3-4.\n2\nSubs. by Act No. XVIII of 2024, s. 2.\n(3) The Government may, by notification, specify the name by which local government shall\nbe known and unless the name of a local government is so specified, it shall be known as the local\ngovernment of the place where its office is situate."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Local governments",
      "content": "(1) Local governments shall consist of Union Councils and\nMetropolitan Corporation as given in section 11 and section 12, respectively.\n(2) 1[*                 *          *         *            *       *       *]\n2\n[11. Union Council.—A Union Council shall consist of the following members elected under\nChapter-V:—\n(i)        Chairman and Vice-Chairman, as joint candidates;\n(ii)       nine general members;\n(iii)      one woman;\n(iv)       one peasant or worker or businessman or technocrat;\n(v)        one youth member; and\n(vi)       one non-Muslim.]"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Metropolitan Corporation",
      "content": "(1) The Metropolitan Corporation shall consist of the\nfollowing members elected under Chapter V,—\n1\n(i)            [Mayor and three Deputy Mayors], as joint candidates;\n(ii)       Chairmen of all Union Councils;\n(iii)      women;\n(iv)       peasants/workers;\n(v)        technocrats;\n(vi)       youth members; and\n(vii)      non-Muslims.\n________________________________________________________________________________\n1\nOmitted and subs. by Act No. XXXV of 2016, ss. 5-6.\n2\nSubs. by Act No. XVIII of 2024, s. 3.\n(2) The number of women should not be less than 33 per cent, peasants/workers not less than\n5 per cent, non-Muslims not less than 5 per cent, youth not less 5 per cent each and technocrat not less\nthan 2 per cent. The numbers shall be computed by the government accordingly through a notification\nissued from time to time.\n(3) The Mayor and the Deputy Mayor shall be elected as joint candidates, in the first session\nof the Metropolitan Corporation, from amongst the members mentioned at serial number (ii) 1[**] of\nsub-section (1), by majority of the members mentioned at serial number (ii) to (vii) of sub-section (1)\npresent and voting."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Saving.―Nothing contained in this Chapter shall be construed to prevent a woman,",
      "content": "peasant, worker, technocrat or a non-Muslim from being a candidate or elected to a general seat in any\nlocal government."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Franchise.―Save as otherwise provided, election of members of all local governments,",
      "content": "shall be held on party basis through secret ballot on the basis of adult franchise.\n1\n[15. Election, of the members of the Union Councils.—(1) All nine general members of\neach Union Council shall be directly elected by the voters registered in the concerned Union Council.\n(2) Save as otherwise provided, in the first meeting of the Union Council to be convened and\npresided over by the Secretary of the Union Council and to the exclusion of any other business, the\ngeneral members of the Union Council shall elect through secret ballot one women, one peasant or\nworker or businessman or technocrat, one youth member and one non-Muslim member mentioned at\nserial number (iii) to (vi) of section 11 of this Act:\nProvided that election of the members shall be conducted in the prescribed manner.\n(3) After the completion of the process of the election under sub-section (2), the Secretary of\nthe Union Council shall convene and preside meeting of the Union Council to elect a Chairman and\nVice-Chairman as joint candidate from members mentioned at serial number (ii) to (vi) of section 11\nof this Act:\nProvided that the electoral college for the election of the Chairman and Vice-Chairman as joint\ncandidate shall be members mentioned at serial number (ii) to (vi) of section 1l of this Act:\nProvided further that election of the Chairman and Vice-Chairman shall be conducted in the\nprescribed manner.]"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Election of the members of the Metropolitan Corporation.―Members of Metropolitan",
      "content": "Corporation, mentioned at serial number (iii) to (vii) of sub-section (1) of section 12, shall be elected\nby the 2[Chairmen] of the Union Councils present and voting."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Election Commission to conduct elections",
      "content": "_(1) The Election Commission shall conduct\nthe local government elections 2[and for this purpose shall, by notification in the official Gazette,\ndeclare the election schedule for election under this Act].\n(2) The Election Commission may, by order in the Official Gazette, make provisions for the\nconduct of local government elections if no provisions or no sufficient provisions have been made\nunder this Act or the rules.\n1\nOmitted and subs. by Act No. XVIII of 2024, ss. 4-5.\n2\nSubs. and ins. by Act No. XXXV of 2016, ss. 7-8.\n1\n[(3) Without prejudice to the provisions of this Act and for the purpose of election to the Local\nGovernments under this Act, the provisions of 2[the Elections Act, 2017 (XXXIII OF 2017)] shall\nmutatis mutandis apply.]"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Executive Authority to assist the Election Commission.―It shall be the duty of all",
      "content": "executive authorities in the Islamabad Capital Territory to assist the Election Commission in the\ndischarge of its functions."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Electoral rolls",
      "content": "(1) A person shall be entitled to be enrolled as a voter if he,—\n(a)        is a citizen of Pakistan;\n(b)        is not less than eighteen years of age; and\n(c)        fulfils such other conditions as the Election Commission may specify.\n(2) The electoral rolls for the local government elections shall be prepared by the Election\nCommission in such manner as it may deem appropriate and the electoral rolls shall not be invalid by\nreason of any erroneous description in the electoral rolls of any person listed or of an omission of the\nname of any person entitled to be enrolled or of inclusion of the name of any person not so entitled.\n(3) Every person whose name is entered in the electoral roll shall be entitled to cast a vote at\nthe direct elections of the local government."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Appointment of Returning Officer etc",
      "content": "1[(1) For the purpose of election under this\nAct and subject to sub-section (2), the Election Commission shall appoint District Returning Officers,\nReturning Officers and Assistant Returning Officers from amongst the officers of the Election\nCommission, the Government, a body or entity controlled by the Government.]\n(2) The Election Commission may appoint a person as Returning Officer or Assistant Returning\nOfficer for two or more constituencies.\n(3) An Assistant Returning Officer shall assist the Returning Officer in the performance of his\nfunctions under this Act and may, subject to such conditions as may be imposed by the Election\nCommission, exercise and perform, under the control of the Returning Officer, the powers and\nfunctions of the Returning Officer.\n(4) It shall be the duty of a Returning Officer to do all such acts as may be necessary for\neffectively conducting an election in accordance with the provisions of this Act and the rules.\n1\n[21. Polling stations.____ (1) The Returning Officer shall, before such time as the Election\nCommission may fix, send to the District Returning Officer a list of polling stations proposed in\na constituency for the purpose of election of a member for that constituency.\n(2) The Election Commission may make such alterations in the list of polling stations sent\nunder sub-section (1) as it may deem necessary and shall, at least fifteen days before the polling day,\npublish in the official Gazette the final list of polling stations specifying the electoral area, the electors\nwhereof will be entitled to vote at each polling station and shall at least seventy-two hours before the\npolling day, give wide publicity of the polling stations in such manner as it may deem fit.\n1\nAdded and subs. by Act No. XXXV of 2016, ss. 8-10.\n2\nSubs. by Act No. XVIII of 2024, S.6.\n(3) The Returning Officer shall establish in each constituency polling stations according to the\nfinal list published under sub-section (2).\n(4) A polling station shall be situated in a Government building for the constituency and, where\nno Government building is available for the purpose, an improvised polling station shall be set up on\npublic property:\nProvided that no polling station shall be located in any premises which belong to or are under\nthe direct or indirect control of any candidate.]"
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Presiding Officers and Polling Officers",
      "content": "(1) A Returning Officer shall appoint for each\npolling station a Presiding Officer and such number of Assistant Presiding Officers and Polling\nOfficers to assist the Presiding Officer as the Returning Officer may consider necessary.\n(2) A person who is, or has at any time been, in the employment of any candidate shall not be\nappointed as a Presiding Officer, Assistant Presiding Officer or Polling Officer.\n(3) The Returning Officer shall submit a list of Presiding Officers and Polling Officers to the\nElection Commission at least fifteen days before the polling day for approval and no change in the\npersonnel shall be made except with the approval of the Election Commission.\n(4) A Presiding Officer shall conduct the poll in accordance with the provisions of this Act and\nthe rules and shall be responsible for maintaining order at the polling station and shall report to the\nReturning Officer any fact or incident which may, in his opinion, affect the fairness of the poll.\n(5) The Returning Officer shall authorize one of the Assistant Presiding Officers to act in place\nof the Presiding Officer if the Presiding Officer is at any time during the poll, by reason of illness or\nother cause, not present at the polling station, or is unable to perform his functions.\n(6) The Returning Officer may, at any time during the poll, for reasons to be recorded in\nwriting, suspend any Presiding Officer, Assistant Presiding Officer or Polling Officer and make such\narrangements as he may consider necessary for the performance of the functions of the Officer so\nsuspended."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Supply of electoral rolls",
      "content": "(1) The Election Commission shall provide the electoral rolls\nof the constituency to the Returning Officer.\n(2) The Returning Officer shall provide to the Presiding Officer the electoral rolls, containing\nthe names of the voters entitled to vote at a polling station."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Other powers and functions of the Election Commission.―In addition to the powers",
      "content": "and functions of the Election Commission under this Act, the Election Commission shall, in relation\nto local government elections, exercise such other powers and perform such other functions as may be\nprescribed."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Qualifications for candidates",
      "content": "(1) A person shall qualify to be elected as a member or\nto hold an elected office of a local government, if he,—\n(a)        is a citizen of Pakistan;\n1\n(b)         [except] the youth, is not less than twenty five years of age on the last day fixed\nfor filing the nomination papers; or\n(c)        is enrolled as a voter in the electoral rolls of the Union Council.\n______________________________________________________________________________\n1\nSubs. by Act No. XXXV of 2016, s. 11.\n(2) The qualifications mentioned in paragraphs (d) to (g) of clause (1) and the disqualification\nreferred to in clause (2) of Article 62 of the Constitution of the Islamic Republic of Pakistan for\nmembership of Majlis-e-Shoora (Parliament) shall mutatis mutandis apply to a person to qualify to be\nelected as a member or to hold an elected office of a local government."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Disqualifications for candidates and elected members",
      "content": "(1) The disqualifications\nmentioned for membership of Majlis-e-Shoora (Parliament) in paragraphs (a) to (p) of clause (1) of\nArticle 63 of the Constitution of the Islamic Republic of Pakistan shall mutatis mutandis apply to a\nperson from being elected or chosen as, and from being, an elected member of a local government.\n(2) lf a person,—\n(a)     is found by the Election Commission to have contravened any provisions of\nsection 25 or sub-section (1) of section 26, he shall stand disqualified from being\na candidate for election to any office of a local government for a period of four\nyears; or\n(b)     has been elected as a member of a local government and is found by the Election\nCommission to have contravened any provision of section 25 or sub-section (1)\nof section 26,he shall cease forthwith to be an elected member or to hold the\noffice of such member and shall stand disqualified from being a candidate for\nelection to a local government for a period of four years."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Bar against dual membership",
      "content": "(1) A Mayor, a Deputy Mayor, a Chairman or a Vice\nChairman may contest election for any other political office after resigning from the office of the\nMayor, Deputy Mayor, Chairman or Vice Chairman.\n(2) A member of a local government, other than the Chairman of a Union Council, may contest\nelection for any other political office without resigning from the membership of the local government\nbut any such member shall not simultaneously hold more than one office.\n(3) If a member of a local government is elected to any other political office, on the notification\nof election of that political office, his seat as member of the local government shall become vacant.\n(4) If a Chairman of a Union Council is elected as the Mayor or a Deputy Mayor, he shall\ncease to be the Chairman of the Union Council and the seat of the Chairman of the Union Council shall\nstand vacated.\n(5) Nothing in this section shall apply to bar a member of a local government to contest the\nelection of Mayor, Deputy Mayor, Chairman or Vice Chairman of a local government."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Term of office",
      "content": "(1) Subject to the this Act, the term of office of a local government shall\nbe five years commencing on the date on which it holds its first meeting.\n(2) The first meeting of a local government shall be held not later than thirty days from the day\non which the names of its members are notified.\n(3) On the expiry of the term of office of a local government, the Government may appoint an\nadministrator to perform the functions of the local government until the elected local government\nassumes office which period shall not exceed six months.\n(4) Save as otherwise provided, a local government shall in its first meeting and to the exclusion\nof any other business, elect the Mayor and Deputy Mayor or Deputy Mayors, Chairman and Vice\nChairman in the prescribed manner."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Oath of office",
      "content": "(1) A member shall, before taking his seat in a local government, make\nand subscribe to an oath in such form as may be prescribed .\n(2) The Mayor, Deputy Mayor, Chairman and Vice Chairman shall assume office by making\nand subscribing to an oath in such form as may be prescribed.\n(3) A Mayor, Deputy Mayor, Chairman and Vice Chairman and a member shall, after taking\noath of office, declare his assets in the prescribed manner."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Vacancy",
      "content": "1[(1)] If the office of a Mayor, Deputy Mayor, Chairman or Vice Chairman, or\na member indirectly elected on a reserved seat, for any reason, falls vacant during the term of office\nof a local government, the new Mayor, Deputy Mayor, Chairman, Vice Chairman or member shall be\nelected in the prescribed manner within 1[forty-five days] from the date when such vacancy is notified\nand he shall, subject to this Act, hold office for the remaining term of the local government.\n1\n[(2) All by-election for the vacant seats of members of Union Councils and Reserved Seats of\nMetropolitan Corporation shall be held once a year on a date or dates fixed by the Election Commission\nof Pakistan.\n(3) The period of one year referred to in subsection (2), shall be computed from the date of\nassumption of office of the Councils.]"
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Removals",
      "content": "(1) Where proceedings of disqualification under section 26 have been\ninitiated against a member, the Election Commission or any authority authorised by it may issue a\nnotice to the member to show cause within specified period as to why proceedings against him may\nnot be taken for his removal for breach of any of the provisions of section 25.\n(2) Where the Election Commission or an authority authorised by it is not satisfied with the\nreply to the notice referred to in sub-section (1) or any reply to the said notice is not filed within the\nperiod fixed by it, it may order for an enquiry in the matter and for that purpose appoint an enquiry\nofficer.\n(3) On the basis of enquiry held under sub-section (2), the Election Commission or an authority\nauthorised by it may order the removal of the member."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Resignation",
      "content": "(1) A Mayor, Deputy Mayor, Chairman, Vice Chairman or a member may\nresign his office by tendering resignation in writing under his hand to the local government of which\nhe is the Mayor, Deputy Mayor, Chairman, Vice Chairman or a member.\n_________________________________________________________________________________\n1\nRenumber, Subs. and added by Act No. XXXV of 2016, s.12.\n(2) The resignation tendered under sub-section (1) shall be deemed to have been accepted and\neffective forthwith and the local government shall forward copies of the resignation to the Election\nCommission and the Government."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Vote of no",
      "content": "confidence.—(1) Subject to this section, a Mayor or Deputy Mayor, shall cease\nto hold office if a vote of no-confidence is passed against him in the prescribed manner by two-third\nmajority of the total number of members of the local government.\n(2) A motion of no-confidence shall not be moved before the expiry of one year of his\nassumption of office as the Mayor or Deputy Mayor.\n(3) Where a motion of no-confidence against the Mayor or Deputy Mayor, has been moved and\nfails for want of the requisite majority of votes in a meeting, no similar motion shall be moved against\nhim before the expiry of one year from the date when such motion was moved."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Bar against re",
      "content": "election or re-appointment.―When a Mayor, Deputy Mayor, Chairman\nor Vice Chairman, of a local government, is removed from office on the ground of misconduct, he\nshall not, during the unexpired period of the term of that local government be eligible for re-election\nor re- appointment to any office during the remaining term of the local government."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Notification of election, resignation and removal",
      "content": "(1) Every election or removal of a\nmember shall be notified by the Election Commission.\n(2) The Government shall notify,—\n(a)     vacation of office owing to resignation or death of a member; and\n(b)     election, appointment or vacation of office, owing to any cause, of the Mayor,\nDeputy Mayor,Chairman or Vice Chairman."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Election petition",
      "content": "(1) Subject to this Act, an election to an Office of a local government\nshall not be called in question except by an election petition.\n(2) A candidate may, in the prescribed manner, file an election petition before the Election\nTribunal challenging an election under this Act."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Election Tribunal",
      "content": "(1) The Election Commission shall, by notification, appoint an\nElection Tribunal for such local area as may be specified in the notification.\n(2) The Election Commission may transfer an election petition from one Election Tribunal to\nanother Election Tribunal.\n(3) Subject to the rules, the Election Commission may, by notification, issue instructions for\npresentation, hearing and trial of an election petition.\n(4) The Election Tribunal shall decide an election petition within one hundred and twenty days\nfrom the date of filing of the election petition."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Powers of Election Tribunal.―The Election Tribunal may exercise powers of a civil court",
      "content": "trying a suit under the Code of Civil Procedure, 1908 (V of 1908) and shall be deemed to be a Court\nwithin the meaning of sections 480 and 482 of the Code."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Decision of the Election Tribunal",
      "content": "(1) The Election Tribunal may, on the conclusion of\ntrial of an election petition, make an order,—\n(a)     dismissing the petition;\n(b)     declaring the election of the returned candidate to be void;\n(c)     declaring the election of the returned candidate to be void and the petitioner or\nany other contesting candidate to have been duly elected; or\n(d)     declaring the election as a whole to be void.\n(2) The decision of the Election Tribunal shall take effect from the date on which it is made\nand shall be communicated to the Election Commission."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Ground for declaring election of returned candidate void",
      "content": "(1) The Election Tribunal\nshall declare the election of the returned candidate to be void if it is satisfied that,—\n(a)    the nomination of the returned candidate was invalid; or\n(b)     the returned candidate was not, on the nomination day, qualified for or was\ndisqualified from,being elected as a member; or\n(c)     the election of the returned candidate has been procured or induced by any\ncorrupt or illegal practice; or\n(d)     corrupt or illegal practice has been committed by the returned candidate or his\nelection agent or by any other person with the connivance of the candidate or\nhis election agent.\n(2)     The election of a returned candidate shall not be declared void if the Election Tribunal\nis satisfied that any corrupt or illegal practice was committed without the consent or connivance of that\ncandidate or his election agent and that the candidate and the election agent took all reasonable\nprecaution to prevent its commission."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Ground for declaring a person other than a returned candidate elected",
      "content": "The Election\nTribunal shall declare the election of the returned candidate to be void and the petitioner or any other\ncontesting candidate to have been duly elected, if it is so claimed by the petitioner or any of the\nrespondents and the Election Tribunal is satisfied that the petitioner or such contesting candidate was\nentitled to be declared elected."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Ground for declaring elections as a whole void",
      "content": "The Election Tribunal shall declare\nthe election as a whole to be void if it is satisfied that the result of the election has been materially\naffected by reasons of,—\n(a)     the failure of any person to comply with the provisions of this Act or the rules;\nor\n(b)     the prevalence of extensive corrupt or illegal practice at the election."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Decision in case of equality of votes",
      "content": "Where after the conclusion of the trial, it appears\nthat there is an equality of votes between two or more contesting candidates and the addition of one\nvote for one such candidate would entitle him to be declared elected, the Election Tribunal shall draw\na lot in respect of such candidates and the candidate on whom the lot falls shall be deemed to have\nreceived the highest number of votes entitling him to be declared elected."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Appeal against the orders of Election Tribunal",
      "content": "(1) Any person aggrieved by a final\norder of an Election Tribunal may, within thirty days of the communication of such order, prefer an\nappeal to the Islamabad High Court.\n(2) The Islamabad High Court shall decide an appeal preferred under sub-section (1) within\nninety days."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Corrupt practice.―A person guilty of bribery, personating or undue influence shall be",
      "content": "punishable with imprisonment for a term which may extend to three years or with fine which may\nextend to one hundred thousand rupees or with both."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Bribery.―A person is guilty of bribery if he, directly or indirectly, by himself or by any",
      "content": "other person on his behalf,—\n(a)    receives, agrees or contracts for any gratification for voting or refrains from\nvoting or refrains from being a candidate at or withdrawing or retiring from, an\nelection;\n(b)    gives, offers or promises any gratification to any person for the purpose of —\n(i)     inducing a person to be or to refrain from being a candidate at an\nelection; or\n(ii)    inducing a voter to vote or refrain from voting at any election; or\n(iii)   inducing a candidate to withdraw or retire from an election; or\n(iv)    rewarding a person for having been or for having refrained from being a\ncandidate at an election; or\n(v)     rewarding a voter for having voted or refrained from voting at an\nelection; or\n(vi)    rewarding a candidate for having withdrawn or retried from an election.\nExplanation:—In this section, ‘gratification’ includes a gratification in money or estimable\nin money and employment for reward."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Personating.―A person is guilty of personating, if he votes or applies for a ballot paper",
      "content": "for voting as some other person whether that other person is living, dead or fictitious."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Undue influence",
      "content": "A person is guilty of undue influence, if he,—\n(a)    in order to compel any person to vote, refrain from voting, or to induce or\ncompel any person to withdraw his candidature at an election, directly or\nindirectly, by himself or by any other person on his behalf—\n(i)     makes or threatens to make use of any force, violence or restraint;\n(ii)    inflicts or threatens to inflict any injury, damage, harm or loss; or\n(iii)   uses any official influence or Governmental patronage; or\n(b)    on account of any person having voted or refrained from voting, or having\nwithdrawn his candidature, does any of the acts specified in clause (a); or\n(c)    by abduction, duress or any fraudulent device or contrivance—\n(i)     impedes or prevents the free exercise of the franchise by a voter; or\n(ii)    compels, induces or prevails upon any voter to refrain from voting or\ncompels any voter to vote.\nExplanation:—In this section, ‘harm’ includes social ostracism or excommunication or\nexpulsion from any caste or community."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Illegal practice",
      "content": "A person is guilty of illegal practice punishable with fine which may\nextend to two thousand rupees, if he —\n(a)    obtains or procures, or attempts to obtain or procure, the assistance of any\nofficer or official of the Federal Government, or a local government or authority\nto further or hinder the election of a candidate;\n(b)    votes or applies for a ballot paper for voting at an election knowing that he is not\nqualified for voting or is disqualified from voting;\n(c)    votes or applies for a ballot paper for voting more than once at any polling\nstation;\n(d)    removes a ballot paper or a ballot box from a polling station or destroys, damages\nor tampers with the ballot-box used at a polling station;\n(e)    knowingly induces or procures any person to do any of the aforesaid acts;\n(f)    fails to provide statement of election expenses as required under this Act;\n(g)    makes or publishes a false statement—\n(i)     concerning the personal character of a candidate or his relation\ncalculated to adversely affect the election of such candidate or, for\npurposes of promoting or procuring the election of another candidate,\nunless he proves that he had reasonable ground for believing, and did\nbelieve, the statement to be true;\n(ii)    relating to the symbol of a candidate whether or not such symbol has\nbeen allocated to such candidate; or\n(iii)   regarding the withdrawal of a candidate;\n(h)    knowingly, in order to support or oppose a candidate, lets, lends, employs, hires,\nborrows or uses any vehicle or vessel for purposes of conveying voters to or\nfrom the polling station, except when a person conveys himself or any member\nof the household to which he belongs,to or from the polling station; or\n(i)    causes or attempts to cause any person present and waiting to vote at the polling\nstation to depart without voting."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Prohibition of canvassing",
      "content": "A person is guilty of an offence punishable with fine which\nmay extend to two thousand rupees, if he, on the polling day in connection with the election,—\n(a)    convenes, calls or organises within a ward any meeting; or\n(b)    within a radius of two hundred meters of the polling station—\n(i)     canvasses for votes;\n(ii)    solicits vote of any voter;\n(iii)   persuades any voter not to vote at the election or for a particular\ncandidate; or\n(iv)    exhibits, except with the permission of the returning officer and at place\nreserved for the candidate or his polling agent beyond the radius of one\nhundred meters of the polling station, any notice, sign banner or flag\ndesigned to encourage the voters to vote, or discourage the voters from\nvoting, for any contesting candidate."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Disorderly conduct near polling station",
      "content": "A person is guilty of an offence punishable\nwith imprisonment for a term which may extend to three months, or with fine which may extend to\nthree thousand rupees or with both, if he—\n(a)    uses, in such manner as to be audible within the polling station any gramophone,\nmegaphone, loudspeaker or other apparatus for reproducing or amplifying\nsounds; or\n(b)    persistently shouts in such manner as to be audible within the polling station; or\n(c)    does any act which—\n(i)     disturbs or causes annoyance to any voter visiting a polling station for\nthe purpose of voting; or\n(ii)    interferes with the performance of the duty of a presiding officer polling\nofficer or any other person performing any duty at a polling station; or\n(d)    abets the doing of any of the aforesaid acts."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Tampering with papers",
      "content": "A person is guilty of an offence punishable with imprisonment\nfor a term which may extend to six months or with fine which may extend to twenty thousand rupees\nor with both, if he—\n(a)     fraudulently defaces or destroys any nomination paper or ballot paper;\n(b)     fraudulently takes out of the polling station any ballot paper or puts into any,\nballot box any ballot paper other than the ballot paper he is authorized under\nthe rules to put in;\n(c)     without due authority—\n(i)     supplies any ballot paper to any person;\n(ii)    destroys, takes, opens or otherwise interferes with any ballot box or\npacket or ballot papers in use for the purpose of election; or\n(iii)   breaks any seal affixed in accordance with the provisions of the rules; or\n(d)     causes any delay or interruption in the beginning, conduct or completion of the\nprocedure required to be immediately carried out on the close of the poll; or\n(e)     fraudulently or without due authority attempts to do any of the aforesaid acts."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Interference with the secrecy of voting",
      "content": "A person is guilty of an offence punishable\nwith imprisonment which may extend to six months or with fine which may extend to twenty thousand\nrupees or with both, if he,—\n(a)     interferes or attempts to interfere with a voter when he records his vote;\n(b)     in any manner obtains or attempts to obtain, in a polling station, information as\nto the candidate for whom a voter in that station is about to vote or has voted; or\n(c)     communicates at any time any information obtained in a polling station about\nthe candidate for whom a voter in that station is about to vote or has voted."
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Failure to maintain secrecy",
      "content": "Any candidate or polling agent attending a polling station,\nor any person attending the counting of votes, is guilty of an offence punishable with imprisonment\nwhich may extend to six months or with fine which may extend to twenty thousand rupees or with\nboth, if he—\n(a)     fails to maintain or aid in maintaining the secrecy of voting; or\n(b)     communicates any information obtained at the counting of votes as to the\ncandidate for whom any vote is given by any particular ballot paper."
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. Conduct of officials",
      "content": "A presiding officer, polling officer or any other officer or official\nperforming duty in connection with an election, or any member of a police force, is guilty of an offence\npunishable with imprisonment for a term which may extend to six months or with fine which may\nextend to twenty thousand rupees or with both, if he, during the conduct or management of an election\nor maintenance of order at the polling station:—\n(a)     persuades any person to give his vote;\n(b)     dissuades any person from giving his vote;\n(c)     influences in any manner the voting of any person;\n(d)     does any other act calculated to further or hinder the election of a candidate;\n(e)     fails to maintain or aid in maintaining the secrecy of voting;\n(f)     communicates, except for any purpose authorised by any law, to any person\nbefore the poll is closed any information as to the name or number on the\nelectoral roll of any voter who has or has not applied for a ballot paper, or has\nor has not voted at a polling station; or\n(g)     communicates any information obtained at the counting of votes as to the\ncandidate for whom any vote is given by any particular ballot paper."
    },
    {
      "provision_ref": "sec57",
      "section": "57",
      "title": "Section 57. Breaches of official duty in connection with election",
      "content": "A Returning Officer, Assistant\nReturning Officer, Presiding Officer, Assistant Presiding Officer, or any other person employed by\nany such officer in connection with his official duties imposed by or under this Act is guilty of an\noffence punishable with imprisonment for a term which may extend to two years or with fine which\nmay extend to fifty thousand rupees or with both, if he, willfully and without reasonable cause,\ncommits breach of any such official duty, by act or omission."
    },
    {
      "provision_ref": "sec58",
      "section": "58",
      "title": "Section 58. Assistance by Government servants",
      "content": "A person in the service of the Government, a local\ngovernment or a body owned or controlled by the Government or a local government is guilty of an\noffence punishable with imprisonment for a term which may extend to six months or with fine which\nmay extend to twenty thousand rupees, or with both if he, in any manner, gives any assistance\ncalculated to further or hinder the election of a candidate."
    },
    {
      "provision_ref": "sec59",
      "section": "59",
      "title": "Section 59. Summary trial",
      "content": "All offences under this Chapter except the offence under section 46 shall\nbe tried summarily under the provisions of the Code."
    },
    {
      "provision_ref": "sec60",
      "section": "60",
      "title": "Section 60. Cognizance",
      "content": "A Court shall not take cognizance of an offence under section 56 or section\n57except on a complaint in writing of the Election Commission or the Returning Officer."
    },
    {
      "provision_ref": "sec61",
      "section": "61",
      "title": "Section 61. Offence to be cognizable",
      "content": "An offence punishable under section 46 shall be acognizable\noffence."
    },
    {
      "provision_ref": "sec62",
      "section": "62",
      "title": "Section 62. Prosecution of offences under this Chapter",
      "content": "(1) Subject to section 59, a Court shall not\ntake cognizance of an offence under this Chapter except on a complaint in writing made by order or\nunder authority of the Election Commission.\n(2) An offence punishable under this Chapter shall be triable by a Magistrate of first class and\nif a Magistrate lacks jurisdiction to try such case it shall be tried by a court of competent jurisdiction."
    },
    {
      "provision_ref": "sec63",
      "section": "63",
      "title": "Section 63. Executive authority and conduct of business",
      "content": "(1) The executive authority of a local\ngovernment shall extend to doing of all acts necessary for the due discharge of its functions under this\nAct.\n(2) Save as otherwise provided, the executive authority of a local government shall vest in and\nbe exercised by its Mayor or Chairman.\n(3) All acts of a local government, whether executive or otherwise, shall be expressed to be\ntaken in the name of the local government and shall be authenticated in the manner prescribed.\n(4) For Metropolitan Corporation, the Government shall appoint a Chief Officer and such\nnumber of other officers as may be prescribed.\n(5) The Chief Officer of Metropolitan Corporation shall be its Principal Accounting Officer\nand, in case of a Union Council, the Chairman of the Union Council shall be the Principal Accounting\nOfficer.\n(6) The Chief Officer shall ensure coordination between the Metropolitan Corporation and the\nUnion Councils in Islamabad Capital Territory and the Government.\n(7) The Chief Officer shall be responsible for ensuring adherence by the Metropolitan\nCorporation to all laws, policies and oversight framework of the Government in the prescribed manner."
    },
    {
      "provision_ref": "sec64",
      "section": "64",
      "title": "Section 64. Additional functions",
      "content": "(1) The Government may, in the prescribed manner, devolve one\nor more of its functions to a local government for improved and efficient service delivery to the citizens.\n(2) In the performance of the functions mentioned in sub-section (1), a local government shall\nbe bound by the directions of the Government.\n(3) The Government shall, in the prescribed manner, provide technical support and fiscal\nresources required for carrying out the said functions by a local government."
    },
    {
      "provision_ref": "sec65",
      "section": "65",
      "title": "Section 65. Delegated functions",
      "content": "(1) The Metropolitan Corporation may, in the prescribed manner,\ndevolve one or more of its functions to the Union Councils for improved and efficient service delivery\nto the citizens.\n(2) In the performance of the function mentioned in sub-section (1), a Union Council shall be\nbound by the directions of the Metropolitan Corporation.\n(3) The Metropolitan Corporation shall, in the prescribed manner, provide technical support\nand fiscal resources required for carrying out the devolved functions by a Union Council."
    },
    {
      "provision_ref": "sec66",
      "section": "66",
      "title": "Section 66. Conduct of business",
      "content": "(1) The business of a local government shall be conducted in the\nprescribed manner.\n(2) Any proceedings or decision of a local government shall not be invalid merely because of\na vacancy or defect in the membership of the local government.\n(3) A local government may appoint committees consisting of such number of its members and\nother persons to perform such functions and in such manner as may be prescribed."
    },
    {
      "provision_ref": "sec67",
      "section": "67",
      "title": "Section 67. Meetings",
      "content": "(1) A local government shall, within three months of the assumption of office,\nframe bye-laws for the conduct of its meetings.\n(2) A meeting of a local government shall be presided over by the Mayor or Chairman and, in\nhis absence, by the Deputy Mayor or Vice Chairman and, in the absence of both, by a member\nchosen for that purpose by the members present.\n(3) A local government shall hold at least one meeting during a month.\n(4) A meeting of a local government shall be open to public except when a local government,\nby simple majority, decides to consider any matter in a session attended exclusively by its members\nand officials.\n(5) The Chief Officer or an officer authorised by him shall record minutes of the meeting of a\nlocal government and submit the same to the person who presided the meeting for approval.\n(6) The Chief Officer shall, after approval, issue the minutes of a meeting under his signatures.\n(7) A member who, directly or indirectly, by himself or by any partner, employer or employee\nhas any share or interest in respect of any matter or has acted professionally, in relation to any matter\non behalf of any person having therein any share or interest as aforesaid, shall not vote or take any\nother part in any proceedings of the local government or any of its committees."
    },
    {
      "provision_ref": "sec68",
      "section": "68",
      "title": "Section 68. Contracts",
      "content": "(1) All contracts made by or on behalf of a local government shall be,—\n(a)     in writing and expressed to be made in the name of the local government;\n(b)     executed in such manner as may be prescribed; and\n(c)     reported to the local government by the Mayor or the Chairman at the meeting\nnext following the execution of the contract.\n(2) A local government may assign any of its functions to a public or private organization on\nsuch terms and conditions or enter into public-private partnership for efficient performance of any of\nits functions as may be prescribed."
    },
    {
      "provision_ref": "sec69",
      "section": "69",
      "title": "Section 69. Reporting and evaluation",
      "content": "(1) A local government shall—\n(a)     maintain such record of its working as may be prescribed or required by the\nGovernment;\n(b)     prepare and publish such periodical reports and returns as may be prescribed or\nrequired by the Government; and\n(c)     adopt such other measures as may be necessary for the publication of\ninformation about the working of the local government.\n(2) The performance evaluation of officers and officials of the local governments shall be made\nin the prescribed manner."
    },
    {
      "provision_ref": "sec70",
      "section": "70",
      "title": "Section 70. Union Councils",
      "content": "(1) A Union Council shall be a body corporate having perpetual\nsuccession and a common seal, with power to acquire and hold property and enter into any contract\nand may sue and be sued in its name.\n(2) The Chairman of a Union Council shall be the executive head of the Union Council and the\nVice Chairman of the Union Council shall perform the functions of the Chairman when the Chairman\nis unable to perform his functions on account of absence or for any other reason.\n(3) A Chairman of a Union Council shall,—\n(a)    provide leadership for preparation of budget and the annual development plan;\n(b)    present the budget in the Union Council;\n(c)    ensure that the business of Union Council is carried out strictly in accordance\nwith this Act and other laws;\n(d)    issue executive orders to the Union Secretaries;\n(e)    represent the Union Council in the Metropolitan Corporation; and\n(f)    report to the concerned authorities in respect of-\n(i)     encroachment on State or local government property and violation of\nland use and building laws, rules and bye­laws;\n(ii)    dangerous and offensive articles and trades mentioned in First Schedule;\n(iii)   environmental and health hazards; and\n(iv)    adulteration of articles of food.\n(4) A Union Council Secretary, under the supervision of the Chairman, shall coordinate and\nfacilitate in community development, functioning of the committees and delivery of municipal\nservices.\n(5) The Government may, in the prescribed manner, issue a schedule of establishment for a\nUnion Council."
    },
    {
      "provision_ref": "sec71",
      "section": "71",
      "title": "Section 71. Functions of the Union Council",
      "content": "(1) A Union Council shall, subject to the provisions of\nSchedule."
    },
    {
      "provision_ref": "sec72",
      "section": "72",
      "title": "Section 72. Metropolitan Corporation.―The Metropolitan Corporation shall be a body corporate",
      "content": "having perpetual succession and a common seal, with power to acquire and hold property and enter\ninto any contract and may sue and be sued in its name."
    },
    {
      "provision_ref": "sec73",
      "section": "73",
      "title": "Section 73. Functions of Metropolitan Corporation",
      "content": "(1)The Metropolitan Corporation shall,\nsubject to the provisions of Capital Development Authority Ordinance, 1960 and Islamabad Capital\nTerritory Zoning Regulations 1992 perform functions mentioned in Third Schedule subject to issuance\nof Notification by the Federal Government.\n(2) The Metropolitan Corporation may entrust any of its functions to a person, an authority,\nagency or company through a contractual arrangement, on such terms and conditions as may be\nprescribed."
    },
    {
      "provision_ref": "sec74",
      "section": "74",
      "title": "Section 74. Executive Authority",
      "content": "(1) A Mayor shall be the executive head of the Metropolitan\nCorporation.\n(2) The Deputy Mayor, and in case there are more than one Deputy Mayor, the Deputy Mayor\nwho is senior in age, shall perform the functions of the Mayor if the Mayor is unable to perform his\nfunctions on account of absence or for any other reason.\n(3) The Chief Officer shall coordinate and facilitate the performance of functions assigned to\nthe Metropolitan Corporation under the supervision of the Mayor."
    },
    {
      "provision_ref": "sec75",
      "section": "75",
      "title": "Section 75. Mayor",
      "content": "(1) The Mayor shall—\n(a)     provide vision for leadership and direction for efficient functioning of the\nMetropolitan Corporation in consultation and coordination with other\nGovernment agencies and authorities;\n(b)     recommend to the Metropolitan Corporation, the strategies, programmes and\nservices to address prioritised needs;\n(c)     recommend or determine the best way to implement those strategies,\nprogrammes and services through partnerships, delegations, contracts and other\nmeans to the maximum benefit of the community;\n(d)     maintain administrative and financial discipline of the Metropolitan\nCorporation;\n(e)     present tax proposals to the Metropolitan Corporation;\n(f)    issue executive orders to the municipal offices for discharge of the functions of\nthe Metropolitan Corporation;\n(g)    represent the Metropolitan Corporation on public and ceremonial occasions;\n(h)    present proposal to the Metropolitan Corporation for approval of budget;\n(i)    conduct inspections of municipal offices functioning under the Metropolitan\nCorporation; and\n(j)    To devise mechanisms for accountability and oversight in municipal matters.\n(2) The Mayor shall, in the performance of duties—\n(a)    identify and develop criteria in terms of which progress in the implementation\nof the strategies, programmes and services can be evaluated, including key\nperformance indicators;\n(b)    evaluate progress against the key performance indicators;\n(c)    review the performance of the Metropolitan Corporation in order to improve,—\n(i)     economy, efficiency and effectiveness;\n(ii)    efficiency of revenue collection services; and\n(iii)   implementation of the bye­laws;\n(d)    oversee formulation and execution of the annual development plan, delivery of\nservices and functioning of the Metropolitan Corporation;\n(e)    present report on the performance of the Metropolitan Corporation to the house\nof the Metropolitan Corporation at least twice a year; and\n(f)    perform such other duties and exercise such powers as the Metropolitan\nCorporation may delegate."
    },
    {
      "provision_ref": "sec76",
      "section": "76",
      "title": "Section 76. Chief Officer",
      "content": "(1) The Chief Officer shall be responsible for—\n(a)    coordination;\n(b)    internal audit;\n(c)    human resource management;\n(d)    public relations;\n(e)    legal affairs; and\n(f)    emergency services.\n(2) The Chief Officer, in carrying out his functions, shall—\n(a)     supervise and coordinate all offices responsible for the provision of municipal\nservices;\n(b)     prepare a report on the planning and implementation of development plans of\nthe Metropolitan Corporation for presentation to the house of the Metropolitan\nCorporation in its Annual budget session;\n(c)     ensure that the business of the Metropolitan Corporation is carried out in\naccordance with the law;\n(d)     ensure implementation of environmental and social safeguards;\n(e)     effect procurements, as prescribed in accordance with law; and\n(f)     take action against violators of this Act, rules or bye-laws."
    },
    {
      "provision_ref": "sec77",
      "section": "77",
      "title": "Section 77. Municipal offices",
      "content": "The Government may, in the prescribed manner, issue a schedule of\nestablishment for the Metropolitan Corporation and such schedule may include planning, finance,\nmunicipal regulation and municipal infrastructure offices."
    },
    {
      "provision_ref": "sec78",
      "section": "78",
      "title": "Section 78. Local Fund and Public Account",
      "content": "(1) A local government shall establish a Local Fund\nand all the revenues received by the local government from the following sources shall be credited to\nthe Fund—\n(a)     the proceeds of taxes, tolls, fees, rates or charges levied by the local government;\n(b)     grants made to or monies received by the local government from the\nGovernment or othersources;\n(c)    rents and profits payable or accruing to the local government from immovable\nproperty vested in or controlled or managed by it;\n(d)     proceeds or any other profits from any investment;\n(e)     gifts, grants or contributions to the local government by individual or\ninstitutions;\n(f)     income accruing from markets or fairs regulated by the local government;\n(g)     fines and penalties imposed under this Act;\n(h)     proceeds from other sources of income which are placed at the disposal of the\nlocal government under directions of the Government;\n(i)    all monies transferred to the local government by the Government; and\n(j)    monies transferred by another local government under this Act.\n(2) The Government shall transfer the grants of a local government, in the shape of share in the\nproceeds of taxes of the local government collected by the Government, to the Local Fund of the local\ngovernment on monthly basis.\n(3) Every local government shall maintain a Public Account to place all revenues received by\nthe local government from the following sources—\n(a)     receipts accruing from trusts administered or managed by the local government;\n(b)    refundable deposits received by the local government; and\n(c)    deferred liabilities.\n(4) A local government may establish and maintain a separate account for any special purpose\nto which one or more sources of revenue mentioned in sub-section (1) or any part of these sources or\nany specified portion of the Local Fund may be assigned.\n(5) The separate account under sub-section (1) shall be maintained, administered and regulated\nas if it were a Local Fund."
    },
    {
      "provision_ref": "sec79",
      "section": "79",
      "title": "Section 79. Custody of Local Fund and Public Account",
      "content": "The monies credited to the Local Fund or\nthe Public Account of a local government shall be kept and operated in an account of the local\ngovernment in such manner as may be prescribed."
    },
    {
      "provision_ref": "sec80",
      "section": "80",
      "title": "Section 80. Charged expenditure",
      "content": "(1) The following expenditure shall be charged upon the Local\nFund—\n(a)    the money required for repayment of loans;\n(b)    the money required to satisfy any judgment, decree or award against the local\ngovernment;\n(c)    the money that the local government may be required by the Government to\ncontribute towards the conduct of local government elections and other deferred\nliabilities of the local government; and\n(d)    such other expenditure of local government as may be prescribed.\n(2) If any expenditure is a charge upon the Local Fund and is not paid, the Government may,\nby order, direct the person having the custody of the respective Local Fund to pay such amount from\nthe Local Fund."
    },
    {
      "provision_ref": "sec81",
      "section": "81",
      "title": "Section 81. Application of Local Fund",
      "content": "(1) Monies credited to a Local Fund shall be expended in\naccordance with the annual budget and revised budget estimates approved by the local government.\n(2) A local government shall not transfer monies to any other local government except by way\nof payment of debts, for carrying out deposit works or for such other purposes as may be prescribed.\n(3) The application of Local Fund shall be subject to the budgetary constraints and according\nto the minimum prescribed ratio of development and non-development expenditures.\n(4) Where a new local government is to take over during a financial year as a result of fresh\nelections, the outgoing local government shall not spend funds or make commitments for any\nexpenditure under any demand for grant or appropriation in excess of eight percent per month of the\nbudgeted funds for the remainder of its term in office in that financial year."
    },
    {
      "provision_ref": "sec82",
      "section": "82",
      "title": "Section 82. Budget",
      "content": "(1) The annual budget for a local government shall contain estimates of—\n(a)    grants from the Government;\n(b)    amounts available in the Local Fund;\n(c)    receipts for the next year; and\n(d)    expenditure to be incurred for the next year.\n(2) The Government shall, sufficiently before the beginning of each financial year, notify the\nprovisional share, which may be credited to the Local Fund of a local government.\n(3) The functionaries of a local government may re-appropriate budget in accordance with the\npowers of re-appropriation delegated to them by the local government and at the end of the financial\nyear, a revised budget shall be submitted to the local government for approval.\n(4) A demand for a grant shall not be made except on the recommendation of the Mayor or the\nChairman.\n(5) Conditional grants from the Government or other local government shall be shown\nseparately in the budget and shall be governed by the conditions on which such grants were made.\n(6) A local government shall prepare the budget in the prescribed manner and in accordance\nwith the chart of accounts notified by the Auditor-General of Pakistan."
    },
    {
      "provision_ref": "sec83",
      "section": "83",
      "title": "Section 83. Approval of budget",
      "content": "(1) Before the commencement of the next financial year, the\nMayor or Chairman shall present the budget for consideration and approval of the local government.\n(2) The local government may discuss the charged expenditure but shall not vote on such\nexpenditure.\n(3) The budget of a local government shall, subject to quorum, be approved by simple majority\nand the local government shall not take up any other business during the budget session.\n(4) The Government may review approved budget of a local government, and if found contrary\nto the budget rules, may require the local government to rectify it.\n(5) A budget shall not be approved if the sums required to meet estimated expenditure including\nprevious liabilities and commitments exceed the estimated receipts.\n(6) In case a budget is not approved by a local government before the commencement of the\nfinancial year to which it relates, the local government shall spend money under various objects, on\npro-rata basis, in accordance with the budgetary provisions of the preceding financial year for a period\nnot exceeding thirty days.\n(7) A local government shall not spend funds or make commitments for any expenditure, under\nany demand for grant or appropriation, in excess of eight percent of the amount budgeted in the\npreceding year within the period of thirty days mentioned in sub-section (6).\n(8) In case, a local government fails to pass the budget within the extended period as specified\nin sub-section (6), the Government shall prepare, approve and authenticate the budget of the local\ngovernment for full year.\n(9) After approval of the budget by a local government, the Mayor or the Chairman shall\nauthenticate under his signature a schedule specifying,—\n(a)     grants made or deemed to have been made by the local government; and\n(b)     sums required to meet the expenditure charged upon the Local Fund.\n(10) The schedule authenticated under sub-section (8) shall be laid before the local government\nbut shall not be open to discussion or vote.\n(11) The authenticated schedule shall be communicated to the local government functionaries,\naccounts officials and the Government.\n(12) At any time before the expiry of the financial year to which the budget relates, a revised\nbudget for the year may, if necessary, be prepared and such revised budget shall be approved in the\nmanner as that of annual budget."
    },
    {
      "provision_ref": "sec84",
      "section": "84",
      "title": "Section 84. Honoraria and allowances",
      "content": "A local government may, subject to the prescribed\nlimitations, make budgetary provisions for honoraria and allowances of the Mayor, Chairman, Deputy\nMayor, Vice Chairman or a member of the local government."
    },
    {
      "provision_ref": "sec85",
      "section": "85",
      "title": "Section 85. Accounts",
      "content": "(1) The accounts of all receipts and expenditure of a local government shall\nbe kept in such form and in accordance with such principles and methods as may be prescribed by the\nAuditor-General of Pakistan.\n(2) In addition to maintenance of accounts by Metropolitan Corporation, the government may\nnotify any other officer(s) to maintain such accounts also.\n(3) The Union Secretary shall maintain the accounts of the Union Council.\n(4) The officer(s) notified under sub-section (2) shall pre-audit all the payments from the Local\nFund of a local government other than the payments from the Local Fund of the Union Councils.\n(5) The Union Secretary shall pre-audit all the payments from the Local Fund of the Union\nCouncil.\n(6) A local government shall not withdraw or disburse money from the Local Fund unless it is\npre-audited in the prescribed manner.\n(7) The officer(s) notified under sub-section (2) shall, by fifteenth day of July, prepare an\nannual statement of receipts and expenditures of the accounts of local governments for the preceding\nfinancial year and shall transmit the statement to the Government and the concerned local government.\n(8) A copy of the annual statement of accounts shall be displayed at a conspicuous place in the\noffice of the local government, and on the internet or web, for public inspection and all objections or\nsuggestions concerning such accounts received from the public shall be considered by the local\ngovernment and appropriate decision shall be taken.\n(9) The Controller General Accounts shall, on the basis of such audit as he may consider\nappropriate or necessary, certify the accounts of a local government for each financial year."
    },
    {
      "provision_ref": "sec86",
      "section": "86",
      "title": "Section 86. Audit",
      "content": "(1) The Auditor-General shall audit the accounts of a local government in the form\nand manner as may be deemed appropriate.\n(2) The audit report of the Auditor-General shall be considered by the Public Accounts\nCommittee of the National Assembly.\n(3) If in the opinion of the Government, it is necessary in public interest to have a special audit\nof a local government; it may direct that such audit may be conducted either by the officer notified\nunder section 85(2) or any other audit agency.\n(4) After the receipt of special audit report of a local government, the Government may, after\nenquiry by the Local Government Commission constituted under section 95, take appropriate action\non the recommendations of the Commission."
    },
    {
      "provision_ref": "sec87",
      "section": "87",
      "title": "Section 87. Local government debt",
      "content": "(1) A local government shall not incur any debt without\nprevious approval of the Government.\n(2) A local government may invest surplus funds, if any, in such securities and financial\ninstitutions, as may be approved by the Government."
    },
    {
      "provision_ref": "sec88",
      "section": "88",
      "title": "Section 88. Taxes to be levied",
      "content": "(1) Subject to this Act, a local government may, by notification, levy\nany tax, fee, rate, rent, toll, charge or surcharge specified in Fourth Schedule.\n(2) The Government shall vet the tax proposal prior to the approval of the tax by the local\ngovernment in order to ensure that the proposal is reasonable and in accordance with law.\n(3) The Government shall vet the tax proposal within thirty days from the date of receipt of the\nproposal failing which it shall be deemed to have been vetted by the Government.\n(4) A local government shall not levy a tax without previous publication of the tax proposal\nand inviting and hearing public objections.\n(5) A local government may, subject to provision of sub-section (1), increase, reduce suspend,\nabolish or exempt any tax."
    },
    {
      "provision_ref": "sec89",
      "section": "89",
      "title": "Section 89. Property tax",
      "content": "(1) The property tax, under this Act, shall be collected by Metropolitan\nCorporation.\n(2) In matters for which no provision or no adequate provision relating to the property tax has\nbeen made under this Act, the provisions of the Urban Immovable Property Tax Act (West Pakistan\nAct V of 1958), as adapted in Islamabad Capital Territory, shall apply.\n(3) The Tax collected under this section shall be distributed amongst the Metropolitan\nCorporation and Union Councils in such a ratio as the Government may, by notification specify."
    },
    {
      "provision_ref": "sec90",
      "section": "90",
      "title": "Section 90. Collection of taxes",
      "content": "(1) A tax or fee levied under this Act shall be collected in the\nprescribed manner.\n(2) The Government may prescribe the mode of collection of a tax or a fee levied under this\nAct.\n(3) If a person fails to pay any tax or fee or any other money payable to a local government,\nthe local government and, if so requested by the local government, the Government shall recover the\ntax, fee or other money as arrears of land revenue.\n(4) The recovery of tax, fee or other money under sub-section (3) shall not absolve the person\nfrom prosecution of any offence under this Act or any other law."
    },
    {
      "provision_ref": "sec91",
      "section": "91",
      "title": "Section 91. Additional powers of the Government",
      "content": "_ (1) Notwithstanding anything contained in\nthis chapter, the Government may, by rules, determine the minimum rate of a tax or free to be levied\nand collected by a local government.\n(2) The Government may, for reasons to be recorded in writing and by notification, exempt the\nlevy of any tax or fee of a local government for specified period of not more than fifteen days on any\nspecial occasion or in order to alleviate the specific hardship suffered by people at large or a section\nof people."
    },
    {
      "provision_ref": "sec92",
      "section": "92",
      "title": "Section 92. Relations of Government and local governments",
      "content": "_ (1) A local government shall\ncollect such tax or taxes within its local area as the Government may direct and the local government\nshall,after the collection of such tax or taxes, deposit the receipts in the relevant Government account.\n(2) The Government may provide guidelines and render advice to a local government for\nachieving the objectives of Government policy and for promoting economic, social and environmental\nsecurity of the Capital Territory."
    },
    {
      "provision_ref": "sec93",
      "section": "93",
      "title": "Section 93. Powers of the Government",
      "content": "_(1) The Government may issue directions to a local\ngovernment and the local government shall be bound by such directions.\n(2) Where the situation demands immediate action and the local government fails to comply\nwith the directions given to it under sub-section (1), the Government may direct the officer authorized\nby it to take such action as the situation may necessitate."
    },
    {
      "provision_ref": "sec94",
      "section": "94",
      "title": "Section 94. Entrustment of functions to local government",
      "content": "_(1) When the Government requires a\nlocal government to perform any specific task beyond the budgetary provisions of the local\ngovernment, the Government shall provide necessary resources to the local government.\n(2) A local government may, with the consent of the Government, entrust any of its functions\nto the Government or to any other government.\n(3) The Government may, with the consent of a local government, decentralize any of its offices\nother than the offices already decentralized to the local government or entrust any of its functions to\nthe local government and in that case the Government shall provide technical and administrative\nsupport and fiscal resources for the performance of such functions."
    },
    {
      "provision_ref": "sec95",
      "section": "95",
      "title": "Section 95. Local Government Commission",
      "content": "(1) The Government shall appoint a Local\nGovernment Commission which shall consist of persons of integrity and good track record of public\nservice.\n(2) The Commission shall consist of the following:\n(a)    a Chairman, who shall be a retired civil servant or an eminent citizen of integrity\nand good track record, to be appointed by the Government;\n(b)    two members of the Senate, one each nominated by the leader of the House and\nleader of the Opposition in the Senate;\n(c)    two members of the National Assembly, one each nominated by the leader of\nthe House and leader of the Opposition in the National Assembly;\n(d)    two eminent, qualified and experienced technocrat members nominated by the\nGovernment, including at least one woman;\n(e)    Representative of Chief Commissioner Islamabad Capital Territory office not\nbelow the rank of BS­19;\n(f)    Director, Development and Finance, Islamabad Capital Territory;\n(3) The Director, Development and Finance, Islamabad Capital Territory shall be the Secretary\nof the Commission.\n(4) The Local Government Commission may co-opt any official of the Government for any\nspecific assignment.\n(5) Subject to sub-section (6), the tenure of the members of the Local Government Commission,\nother than the Chairman, Secretary and representatives of Chief Commissioner and Chairman Capital\nDevelopment Authority, shall be five years.\n(6) The Government may, after serving a notice and opportunity of hearing, remove a member\nof the Commission after recording reasons.\n(7) In the event of a casual vacancy in the membership of the Commission, the Government\nshall, for the residual period, appoint another person of the same category as member of the\nCommission in accordance with the provisions of subsection (1).\n(8) The Ministry of Interior or the Administration shall provide secretarial support to the\nCommission by establishing a separate Secretariat of the Commission.\n(9) No act or proceedings of the Commission shall be invalid by reason or existence of any\nvacancy or defect in the constitution of the Commission.\n(10) The Government shall provide a separate budget for the Commission in the annual budget.\n(11) The Government shall notify the schedule of establishment of the Commission.\n(12) The Secretary of the Commission shall be the Principal Accounting Officer and the\nCommission shall have its own drawing and disbursing officer.\n(13) The Government, its departments and agencies shall aid and assist the Commission in\nthe performance of its functions."
    },
    {
      "provision_ref": "sec96",
      "section": "96",
      "title": "Section 96. Functions of the Commission",
      "content": "(1) The Local Government Commission shall—\n(a)    conduct annual and special inspections of the local governments and submit its\nreports to the Government;\n(b)    if so directed by the Government, conduct,:\n(i)     an inquiry by itself or through any other agency about any matter\nconcerning a local government; or\n(ii)    audit by itself or direct any other agency to conduct a special audit of a\nlocal government;\n(c)    resolve the disputes between the Union Council and Metropolitan Corporation,\nand the disputes between the local Government and other governmental bodies\nand departments, and if the Commission fails to settle the dispute, the aggrieved\nparty may move the Government for resolution of the dispute;\n(d)    enquire into the matters referred to it by the Government or a Chief Officer and\ngive its decision on such matter;\n(e)    conduct social and performance audit of the local governments on the basis of\nspecific performance indicators through a third party and publish the report of\nsuch audit;\n(f)    submit to the Government an annual report on the over-all performance of the\nlocal governments;\n(g)    take cognizance of violations of laws and rules by a local government in the\nperformance of its functions; and\n(h)    organize consultative planning meetings of National legislators and the Mayors\non a periodic basis to provide their participation in development activities with\nregard to—\n(i)     consultative process of the annual development plan;\n(ii)    formulating procedure for utilization of the Legislators’ development\ngrant;\n(iii)   assessing implementation of decision of these meetings;\n(iv)    carrying out review of development schemes; and\n(v)     facilitation in the performance of departmental functions of the\ndecentralized offices,relating to policy analysis, oversight, checks and\nbalances, capacity building and coordination through the Commission.\n(2) The decision of the Commission shall be binding on the local governments failing which the\nCommission may report the matter with specific recommendations to the Government for an\nappropriate action.\n(3) The Government may, on the recommendation of the Commission, suspend a Mayor or a\nChairman for a maximum period of ninety days for fair conduct of inquiry under sub-section (1) or for\npreventing the Mayor or Chairman from continuing with any unlawful activity during the pendency of\nthe inquiry.\n(4) Where, on an inquiry under sub-section (1), the Mayor, Deputy Mayor, Chairman or Vice\nChairman is found guilty of misconduct by the Commission, the Commission shall recommend to the\nGovernment any appropriate action including removal of the Mayor Deputy Mayor, Chairman or Vice\nChairman.\n(5) The Commission may exercise the powers of a civil court under the Code of Civil\nProcedures, 1908 (V of 1908), in respect of the following matters—\n(a)     summoning and enforcing the attendance of any person and examining him on\noath;\n(b)     compelling the production of documents;\n(c)     receiving evidence on affidavits; and\n(d)     issuing commission for the examination of witnesses."
    },
    {
      "provision_ref": "sec97",
      "section": "97",
      "title": "Section 97. Responsibility of the Commission",
      "content": "The Local Government Commission shall be\nresponsible to the Government."
    },
    {
      "provision_ref": "sec98",
      "section": "98",
      "title": "Section 98. Local Government Board",
      "content": "(1) There shall be constituted a Board to be called the Local\nGovernment Board consisting of a Chairman and not less than three and not more than five members\nto be appointed by the Government on such terms and conditions as the Government may determine.\n(2) The Board shall be a body corporate having perpetual succession and a common seal with\npower to acquire, hold and transfer property and shall, by its name, sue or be sued.\n(3) The Chief Commissioner shall be ex-officio Chairman of the Board.\n(4) The Government shall appoint a Secretary of the Board to deal with day to day\nadministration of the Board and to perform such other functions as may be assigned to him by the\nBoard.\n(5) A local government shall contribute towards the expenditure of the Board an amount\ncalculated at such rate as may, from time to time, be fixed by the Government and the accounts of the\nBoard shall be maintained and audited in the prescribed manner.\n(6) The Board shall—\n(a)    make appointments, order transfers, take disciplinary action and deal with other\nservice matters in respect of the members of the prescribed local government\nservice cadre;\n(b)    set up and operate pension fund and such other funds as may be considered\nnecessary for the benefit and welfare of the employees of the Board and the\nprescribed local government service cadre;and\n(c)    perform such other functions as may be prescribed.\n(7) The business of Board shall be conducted in such manner as may be prescribed."
    },
    {
      "provision_ref": "sec99",
      "section": "99",
      "title": "Section 99. Dissolution of local governments",
      "content": "(1) Notwithstanding anything to the contrary\ncontained in section 29, where, before the expiry of the term of the local governments, the general\nelections for National Assembly are announced, the Government may, by notification, dissolve the\nlocal governments.\n(2) On the dissolution of the local governments under sub-section (1), all powers and functions\nof the local governments shall be exercised and performed by such persons or authorities as the Board\nmay appoint in this behalf as Administrators and the funds and properties belonging to the local\ngovernments shall vest in Government till such time the elected local governments assume office."
    },
    {
      "provision_ref": "sec100",
      "section": "100",
      "title": "Section 100. Ownership of immovable property",
      "content": "(1) Subject to any reservations made or any\nconditions imposed by the Government, the property specified below shall vest in the respective local\ngovernment if it is:\n(a)    vested in the local government through succession as provided in section 3;\n(b)    transferred to the local government by the Government or any other authority,\norganisation or an individual;\n(c)    constructed or acquired by the local government with its title; and\n(d)    a road, street or any other immovable property developed by the local\ngovernment for public purposes with express or implied consent of the owner.\n(2) Until otherwise directed by the Government, the properties of the Government in possession\nof the local governments established under the Capital Territory Local Government Ordinance, 1979\nshall pass on to their successors as provided in section 126.\n(3) The successor local governments shall, subject to policy of the Government or contractual\nobligations, make bye-laws for the use, development and management of the local government\nproperties.\n(4) The Government shall not, except with the prior consent of the local government, transfer\nan immovable property vested in the local government."
    },
    {
      "provision_ref": "sec101",
      "section": "101",
      "title": "Section 101. Transfer of property by the Government",
      "content": "Subject to such conditions as may be\nprescribed, the Government may, on its own accord or on a request by a local government, transfer the\nmanagement of nazul land, auqaf land or any other Government or public property to it for\nadministration as a trustee."
    },
    {
      "provision_ref": "sec102",
      "section": "102",
      "title": "Section 102. Stock taking by the local government",
      "content": "(1) Every local government shall once in every\nyear in July, take the physical stock of its movable and immovable properties and publish the report in\nthe prescribed manner.\n(2) The report referred to in sub-section (1) shall contain—\n(a)    particulars of the properties held during the preceding year;\n(b)    total value of the property, annual return there from and change in its value, if\nany;\n(c)    particulars of unserviceable articles;\n(d)    particulars of losses, if any; and\n(e)    proposal for utilization, development and improvement during the following\nyear."
    },
    {
      "provision_ref": "sec103",
      "section": "103",
      "title": "Section 103. Use of properties of local governments",
      "content": "(1) The properties of local governments shall\nbe used only for public purposes.\n(2) Subject to this section, a local government shall not sell or permanently alienate any of its\nimmovable property.\n(3) A local government may grant lease of its immovable property through competitive bidding\nby public auction in the prescribed manner.\n(4) The Government may constitute a Committee headed by the Chief Officer of the local\ngovernment to identify the encroached or redundant properties of a local government that may be sold\nin the prescribed manner with the approval of the Government and the funds generated from the sale\nof such properties shall be kept in a separate account and be used only for purposes of development.\n(5) The movable property of a local government which is required to be disposed of shall be\nsold through competitive bidding by public auction."
    },
    {
      "provision_ref": "sec104",
      "section": "104",
      "title": "Section 104. Acquisition of immovable property",
      "content": "(1) Whenever any local government considers it\nnecessary or expedient it may acquire any immovable property for a public purpose.\n(2) A local government may, in the prescribed manner, purchase an immovable property\nthrough an agreement when such property is required for a public purpose."
    },
    {
      "provision_ref": "sec105",
      "section": "105",
      "title": "Section 105. Offences, punishments and their cognizance",
      "content": "(1) The offences specified in Fifth and\nSixth Schedules shall be liable to punishment by way of imprisonment, fine, seizure, forfeiture,\nconfiscation and impounding and such other penalties as are provided in this Act.\n(2) If a person commits an offence specified in\n(a)     Part-I of Fifth Schedule, such person shall be punishable with imprisonment for\na term which may extend to seven years, or with fine which may extend to five\nhundred thousand rupees or with both and where an accused was directed by the\nInspector for immediate discontinuance of the offence, the Court may impose a\nfurther fine which may extend to fifty thousand rupees for every day for the\nperiod the accused has persisted in the offence from the date of its commission;\n(b)     Part-II of Fifth Schedule, such person shall be punishable with imprisonment\nwhich may extend to three years or fine which may extend to one hundred\nthousand rupees or with both and where an accused was directed by the\nInspector for immediate discontinuance of the offence, the Court may impose a\nfurther fine which may extend to ten thousand rupees for every day for the\nperiod the accused persisted in the offence from the date of its commission;\n(c)     Part-III of Fifth Schedule, such person shall be punishable with imprisonment\nwhich may extend to six months or fine which may extend to twenty five\nthousand rupees or with both and where an accused was directed by the\nInspector for immediate discontinuance of the offence, the Court may impose a\nfurther fine which may extend to five hundred rupees for every day for the\nperiod the accused persisted in the offence from the date of its commission; and\n(d)     Sixth Schedule, such person shall, in the first instance, be liable to fine by\nissuing a ticket specified in Seventh Schedule and where an accused repeats the\noffence within a period of three months for which the accused was subjected to\nfine, he shall be liable to the same punishment as provided in clause (c).\n(3) The offences specified in clauses (a) and (b) of sub-section (2) shall be cognizable and\ninformation in this regard shall be forwarded to the officer in-charge of a police station by the Inspector\nafter prior approval of the Chief Officer for registration of a case against the accused in accordance\nwith the provisions of section 154 of the Code.\n(4) A Court shall take cognizance of the offences specified in clause (c) of sub-section (2) on\na complaint made in writing by the Inspector after prior approval of the Chief Officer in accordance\nwith the provisions of section 200 of the Code.\n(5) The offences specified in Part-III of Fifth Schedule and Sixth Schedule shall be tried in a\nsummary manner in accordance with the provisions of section 260 to 265 of the Code but the limit of\npunishment mentioned in sub-section (2) of section 262 of the Code shall not be applicable.\n(6) The fines imposed by a Court for an offence specified in Sixth Schedule shall on collection\nbe deposited in the Public Account of the local government.\n(7) The Government may, by notification, entrust to a local government the enforcement of any\nother law."
    },
    {
      "provision_ref": "sec106",
      "section": "106",
      "title": "Section 106. Appointment and control of Inspectors",
      "content": "(1) The Mayor or the Chairman shall, with\nthe approval of the local government, authorize the officials of the local government as Inspectors for\nthe enforcement of the offences specified in the Schedules.\n(2) The prescribed officer shall be the controlling authority and administrative head of an\nInspector and the Inspector shall report to the officer for the enforcement of provisions of this Chapter."
    },
    {
      "provision_ref": "sec107",
      "section": "107",
      "title": "Section 107. Imposition of fine through ticketing",
      "content": "(1) Notwithstanding anything contained in this\nChapter, where any person, in the opinion of an Inspector, is contravening any provision of the law\nrelating to the offences specified in Sixth Schedule, the Inspector shall charge the accused by issuing\na ticket in the prescribed form for payment of fine specified in Seventh Schedule, if such offence has\nbeen committed for the first time by the accused within three months.\n(2) The ticket referred to in sub-section (1) shall be issued in quadruplicate by delivering three\ncopies to the accused after obtaining his signatures or thumb impression on the fourth copy to be\nretained by the Inspector for record.\n(3) The fine may be deposited in the bank account of the local government within ten days\nfrom the date of imposition of fine for credit in the Public Account of the local government.\n(4) The person to whom a ticket has been issued under this section may either contest the\nimposition of fine in the Court within ten days from the date of the issuance of the ticket or deposit the\nfine within that period and provide a copy of payment receipt to the office of the local government."
    },
    {
      "provision_ref": "sec108",
      "section": "108",
      "title": "Section 108. Court proceedings for default in deposit of fine",
      "content": "(1) The prescribed officer shall, on\ndaily basis, provide a scroll of all unpaid tickets to the Court.\n(2) The Court receiving the scroll shall issue summons to the accused forthwith stating the date\nof hearing for summary trial in accordance with the provisions of section 260 to 265 of the Code but\nthe limit of punishment mentioned in sub-section (2) of section 262 of the Code shall not be applicable.\n(3) Where on the first date of hearing, the accused appears before the Court and produces the\nproof of deposit of fine, or unconditionally admitting his failure, deposits the fine forthwith along with\nthe penalty which shall not be less than ten percent and not more than twenty five percent of the amount\nof fine determined by the Court in accordance with the procedure provided in sub-section (2) of section\n388 of the Code further proceedings against the accused may be dropped and no conviction shall be\nrecorded against him.\n(4) Upon the failure of the accused to appear before the Court in response to the summons\nissued by it, the Court shall forthwith issue warrants for arrest of the accused and upon issuance of\nsuch warrants the accused will be liable to punishment under clause (c) of sub-section (2) of section"
    },
    {
      "provision_ref": "sec110",
      "section": "110",
      "title": "Section 110. Municipal Wardens",
      "content": "(1) A local government, other than a Union Council, may, with\nthe prior approval of the Government, establish and maintain Municipal Wardens in the prescribed\nmanner.\n(2) The Government may, notwithstanding anything contained in any other law, specify the\nduties which such force may be required to perform."
    },
    {
      "provision_ref": "sec111",
      "section": "111",
      "title": "Section 111. General powers of Inspectors",
      "content": "(1) In case of any serious threat to the public health,\nsafety or welfare or danger to life and property, or where violation of any rule or bye-law is being\ncommitted, the Inspector may, in his area of jurisdiction, in addition to imposition of fine or initiating\nprosecution under this Act—\n(a)     suspend any work;\n(b)     seize the goods;\n(c)     seal the premises;\n(d)     demolish or remove the work; or\n(e)     issue directions for taking corrective measures within the specified time.\n(2) An Inspector shall not enter any dwelling unit without permission of the occupier or the\nCourt.\n(3) An Inspector authorized under section 106 may, in relation to the offences specified in Fifth\nSchedule—\n(a)     issue notices in writing on behalf of the local government;\n(b)     initiate legal proceedings in the Court; and\n(c)     assist in defending legal proceedings initiated against the local government."
    },
    {
      "provision_ref": "sec112",
      "section": "112",
      "title": "Section 112. Rights of citizen not affected",
      "content": "Nothing contained in this Chapter shall restrict or limit\nthe right of the citizens or residents of a local area to bring any suit or other legal proceedings against\nany local government, its officers or other functionaries violating his rights provided by any law."
    },
    {
      "provision_ref": "sec113",
      "section": "113",
      "title": "Section 113. Right to Information",
      "content": "(1) Subject to any reasonable restrictions imposed under rules, a\nperson may seek any information in possession of a local government.\n(2) Every designated functionary of a local government shall, within fifteen days of an\napplication, provide requisite information to the applicant on payment of such fee as may be\nprescribed.\n(3) A local government shall, on quarterly basis, publish on its website or at prominent place\ninformation about the staffing and the performance of the offices of the local government during the\npreceding three months.\n(4) A local government shall maintain records in the prescribed manner with the special\nemphasis on electronic record keeping."
    },
    {
      "provision_ref": "sec114",
      "section": "114",
      "title": "Section 114. Municipal entities",
      "content": "(1) A local government other than a Union Council, with the\napproval of the Government, may establish an authority, agency or company answerable to the local\ngovernment for the performance of municipal functions.\n(2) A local government, other than a Union Council may, with the approval of the Government\nand in coordination with any other local government, establish an authority, agency or a company for\nan area covering more than one local government.\n(3) An entity established under this section shall be subject to such control as may be prescribed."
    },
    {
      "provision_ref": "sec115",
      "section": "115",
      "title": "Section 115. Local government servants",
      "content": "(1) Notwithstanding anything contained in any other law,\nthe Government shall, in the prescribed manner, create a service cadre for a local government or a\ngroup of local governments.\n(2) The Government may prescribe the terms and conditions for recruitment, promotion,\ndismissal, disciplinary, conduct and any other related service matter for the service cadre mentioned\nin sub-section (1).\n(3) A local government other than a Union Council may, in the prescribed manner, absorb an\nemployee, already working in any other municipal body/local government prior to the commencement\nof this Act, with the consent of the employee against an equivalent pay scale."
    },
    {
      "provision_ref": "sec116",
      "section": "116",
      "title": "Section 116. Appeals.―A person aggrieved by any order passed by a local government or its",
      "content": "functionaries may prefer an appeal to such authority, in such a manner and within such time as may be\nprescribed and an order passed in appeal shall be final."
    },
    {
      "provision_ref": "sec117",
      "section": "117",
      "title": "Section 117. Power to make rules",
      "content": "(1) The Government may, subject to previous publication and by\nnotification, make rules for carrying out the purposes of this Act.\n(2) In particular and without prejudice to the generality of the foregoing powers, such rules\nmay provide for all or any of the matters specified in Part-I of Eighth Schedule.\n(3) The rules made under sub-section (1) shall meet the following considerations—\n(a)     consistency with democratic decentralisation;\n(b)     enhancement of welfare of the people;\n(c)     fairness and clarity; and\n(d)     natural justice and due process of law."
    },
    {
      "provision_ref": "sec118",
      "section": "118",
      "title": "Section 118. Bye",
      "content": "laws.—(1) A local government may, and if required by the Government shall, make\nbye-laws not inconsistent with this Act and the rules to give effect to the provisions of this Act.\n(2) The bye-laws made by a local government shall come into force from the date the bye-laws\nare published in the official Gazette or on the website specified by the Government.\n(3) In particular and without prejudice to the generality of the foregoing power, the bye-laws\nmay provide for all or any of the matters specified in Part-II of Eighth Schedule."
    },
    {
      "provision_ref": "sec119",
      "section": "119",
      "title": "Section 119. Delegation of powers",
      "content": "(1) The Government may, subject to such conditions as may be\nspecified, delegate any of its functions under this Act to an officer sub-ordinate to it except the power\nto make rules, to suspend or remove a Mayor or Chairman or to dissolve the local governments.\n(2) Subject to the rules, a local government may delegate any of its powers, including financial\npowers under this Act or rules or bye-laws to the Mayor, Chairman, Deputy Mayor or Vice Chairman\nor any of its members or officers as it may deem fit, except the powers to make bye-laws and to pass\nannual or revised budget."
    },
    {
      "provision_ref": "sec120",
      "section": "120",
      "title": "Section 120. Action taken in good faith",
      "content": "No suit, prosecution, or other legal proceedings shall lie\nagainst any public servant serving in a local government for anything done in good faith under this\nAct."
    },
    {
      "provision_ref": "sec121",
      "section": "121",
      "title": "Section 121. General powers of local governments",
      "content": "Notwithstanding any specific provision of this\nAct, a local government shall perform its functions conferred by or under this Act and exercise such\npowers and follow such procedures as are enumerated in Ninth Schedule."
    },
    {
      "provision_ref": "sec122",
      "section": "122",
      "title": "Section 122. Members and servants of local governments to be public servants",
      "content": "Every member\nand every servant of a local government, and every other person duly empowered to act on behalf of a\nlocal government, shall be deemed to be a public servant within the meaning of section 21 of the\nPakistan Penal Code, 1860 (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec123",
      "section": "123",
      "title": "Section 123. Bar against employment",
      "content": "The Mayor, Chairman, Deputy Mayor, Vice Chairman or a\nmember of a local government shall not be employed under such local government for a period of one\nyear from the date on which he ceases to be the Mayor, Chairman, Deputy Mayor, Vice Chairman or\nmember."
    },
    {
      "provision_ref": "sec124",
      "section": "124",
      "title": "Section 124. Conciliation (Musalihat) Council",
      "content": "(1) The Government shall constitute a Conciliation\n(Musalihat) Council for amicable settlement of disputes in the prescribed manner.\n(2) A Council shall consist of a panel of seven members, including at least one woman, to be\nnominated by the Government from amongst residents of the local government but the members of the\nlocal government shall not be appointed as members of the Council.\n(3) The members of Council shall be nominated for a term of five years or until earlier replaced\nby the Government.\n(4) Any casual vacancy in the panel of members of the Council shall be filled by the\nGovernment, as soon as may be, but not later than thirty days from the occurrence of the vacancy.\n(5) Any civil or criminal dispute may be referred to the Council where parties to the dispute\nhave agreed to make such reference.\n(6) The Council shall not assume jurisdiction in a non-compoundable offence.\n(7) The Council shall make efforts for amicable settlement of the dispute between the parties\nand it shall record its findings through agreement between the parties.\n(8) Every settlement of a dispute by Council in a case pending before a court shall be subject\nto the approval of such court.\n(9) The parties to the dispute may agree to add any other person as member of council for their\ndispute and such person shall be treated as member of the Council in that case.\n(10) The Council shall perform its functions as may be prescribed."
    },
    {
      "provision_ref": "sec125",
      "section": "125",
      "title": "Section 125. Arbitration Council",
      "content": "(1) The Government shall establish an Arbitration Council to\nsettle disputes between the Union Council and Metropolitan Corporation, and the disputes between\nthe local government and other governmental bodies.\n(2) The Arbitration Council shall consist of a Chairman and two members having legal\nbackground.\n(3) The Arbitration Council shall perform its functions as may be prescribed."
    },
    {
      "provision_ref": "sec126",
      "section": "126",
      "title": "Section 126. Constitution of Oversight Committees",
      "content": "(1) There shall be different oversight\ncommittees at Union Council and Metropolitan Corporation level elected from the respective councils\nin the manner as may be prescribed to oversee the performance of the offices and report the matters to\nthe Metropolitan Corporation and the Councils, as the case may be.\n(2) The Oversight Committees shall perform their functions as may be prescribed."
    },
    {
      "provision_ref": "sec127",
      "section": "127",
      "title": "Section 127. Interim authorities",
      "content": "(1) On coming into force of this Act, any office, authority or a\nlocal government established under the Capital Territory Local Government Ordinance, 1979 or the\nCapital Development Authority Ordinance, 1960 or the Municipal Administration Ordinance, 1960\nshall continue discharging functions and providing services without any interruption until a local\ngovernment is established under this Act for the local area.\n(2) All functionaries of a local government established under the Federal Capital Local\nGovernment Ordinance, 1979 or the Capital Development Authority Ordinance, 1960 or the Municipal\nAdministration Ordinance, 1960 shall continue to perform their respective duties and responsibilities\nwith the successor local government under this Act, until transferred to any other local government.\n(3) The Government may re-organize the authorities, agencies and bodies of the local\ngovernments established under the Capital Territory Local Government Ordinance, 1979 or the Capital\nDevelopment Authority Ordinance, 1960 or the Municipal Administration Ordinance, 1960 and\ndecentralize such authorities, agencies and bodies to the local governments established under this Act."
    },
    {
      "provision_ref": "sec128",
      "section": "128",
      "title": "Section 128. Interim maintenance of institutions",
      "content": "Where on the enforcement of this Act in any area,\nany service undertaken or institution maintained by the Government is required under any of the\nprovisions of this Act to be compulsorily undertaken or maintained by a local government, such service\nor institution shall, notwithstanding anything contained in this Act, continue to be undertaken or\nmaintained by the Government until the management thereof is transferred to the local government."
    },
    {
      "provision_ref": "sec129",
      "section": "129",
      "title": "Section 129. Financial transition",
      "content": "(1) All taxes, cesses, fees, rates, rents, tolls or charges which were\nbeing charged, levied and collected by any office of a local government or any authority shall continue\nto be charged, levied and collected under this Act by the successor local government or the authority\nand every person liable to pay such a tax, cess, fee, rate, rent, toll, charge or any arrear of the tax, cess,\nfee, rate, rent, toll or charge shall continue to make the payment until such tax, cess, fee, rate, rent,\ntoll or charge is revised, withdrawn or varied under this Act.\n(2) Where any local government established under the Federal Capital Local Government\nOrdinance, 1979 (XIII of 2001) was receiving any grant or any compensation in lieu of Octroi or Zila\ntax, the successor local government under this Act shall continue to receive such grant or\ncompensation.\n(3) Where a local government assumes the office under this Act for the first time:\n(a)     the Government shall transfer grants to the local government on the basis of a\nformula notified by the Government; and\n(b)     its budget for the financial year during which it assumes the office shall relate\nto the remaining period of that year and provisions regarding budget under this\nAct shall, as far as possible, apply to such a budget.\n(4) On allocation, re-allocation or transfer of the employees of the Government or any other\nbody of any local government or any other organization established under the Federal Capital Local\nGovernment Ordinance, 1979 or the Capital Development Authority Ordinance, 1960, the salaries,\nemoluments and pensions of such employees shall not be reduced on such allocation, re-allocation or\ntransfer.\n(5) The Government shall ensure payment of salaries and other emoluments of the employees\nreferred to in sub-section (4) till such time as the Government may deem appropriate."
    },
    {
      "provision_ref": "sec130",
      "section": "130",
      "title": "Section 130. Succession",
      "content": "(1) The Government or an officer designated by the Government shall,\nwithin one hundred and eighty days of the commencement of this Act, divide rights, assets and\nliabilities of the local governments or the Authority amongst the local governments and the\nGovernment or the Authority, and the decision of the Government or of the designated officer shall be\nfinal.\n(2) The Government shall bring all bye-laws, rules, regulations, notifications or any other legal\ninstrument, issued under any law in force on the date of commencement of this Act, in conformity with\nthis Act within a period of two years from the date of commencement of this Act.\n(3) Except as provided by this Act, all existing bye-laws, rules, regulations, notifications or any\nother legal instrument shall, subject to this Act, continue in force, so far as applicable and with the\nnecessary adaptations until altered, repealed or amended by the Government."
    },
    {
      "provision_ref": "sec131",
      "section": "131",
      "title": "Section 131. Removal of doubts",
      "content": "Where this Act makes any provision for anything to be done but\nhas not made any provision or any sufficient provision, as to the authority by whom, or the manner in\nwhich it shall be done, then it shall be done by such authority and in such manner as may be prescribed."
    },
    {
      "provision_ref": "sec132",
      "section": "132",
      "title": "Section 132. Repeal and saving",
      "content": "(1) The Capital Territory Local Government Ordinance, 1979\n(XXXIX of 1979), the Islamabad Capital Territory Local Government Ordinance, 2002 (CXV II of\n2002), the Islamabad Capital Territory Local Government Elections Ordinance, 2002 (LVII of 2002)\nand section 15-A of the Capital Development Authority Ordinance, 1960 (XXIII of 1960) are hereby\nrepealed.\n(2) Save as otherwise specifically provided in this Act, nothing in this Act shall affect or be\ndeemed to affect anything done, action taken, investigation or proceedings commenced, order, rule,\nregulation, bye- laws appointment, conveyance, mortgage, deed, document or agreement made tax or\nfee levied, resolution passed, direction given, proceedings taken or instrument executed or issued,\nunder or in pursuance of the Capital Territory Local Government Ordinance, 1979 and section 15-A\nof the Capital Development Authority Ordinance, 1960 and any such thing, action, investigation,\nproceedings, order, rule, regulation, bye-laws, appointment, conveyance, mortgage, deed, document,\nagreement, tax, fee, resolution, direction, proceedings or instrument shall, if in force at the\ncommencement of this Act, continue to be in force, and have effect as if it were respectively done,\ntaken, commenced, made, directed, passed, given, executed or issued under this Act."
    },
    {
      "provision_ref": "sec133",
      "section": "133",
      "title": "Section 133. Removal of difficulty",
      "content": "(1)The Government may, within two years of the\ncommencement of this Act, by order consistent with this Act, provide for the removal of any difficulty\nwhich may arise in giving effect to the provisions of this Act.\n(2) Any question or doubt as to the interpretation of any provision of this Act or of any order\nmade thereunder shall be resolved by a decision of the President and such decision shall be final."
    },
    {
      "provision_ref": "sec134",
      "section": "134",
      "title": "Section 134. Amendment of Schedules",
      "content": "(1) The Government may, by notification, amend any of the\nSchedules.\n(2) The Government, may by notification, assign any of the functions of the Union Council or\nthe Metropolitan Corporation, specified in the Second and Third Schedules respectively, to any\nstatutory body or public or private company.\n[see sections 70 & 73]"
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Working of power",
      "content": "looms, rice husking plants steam whistle, steam trumpet or electric or\nhand operated sirens beyond hours fixed for their operation by a Local government."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Supplying or marketing drinking water for human consumption in any form, from any",
      "content": "source which is contaminated or suspected to be dangerous to public health, or its use has been\nprohibited bya local government on the ground of being unsafe for human consumption, or\nwhose quality and suitability for human consumption has not been ascertained and certified by\na laboratory authorized by the Government."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Immovable encroachment in or on or under any property or any open space or land vested",
      "content": "in or managed, maintained or controlled by a local government."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Failure to maintain clean premises of the area in front of a Rs.2,000",
      "content": "shop, office or factory up to the public street or road serving\nthis facility."
    }
  ],
  "definitions": [
    {
      "term": "Administration",
      "definition": "the Islamabad Capital Territory Administration;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "the Capital Development Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "budget",
      "definition": "an official statement of the income and expenditure of a local government for a financial year;",
      "source_provision": "sec2"
    },
    {
      "term": "building",
      "definition": "any shop, house, hut, outhouse, shed, stable or enclosure built of any material and used for any purpose, and also includes a wall, well, verandah, platform, plinth, ramp, stair-case and steps;",
      "source_provision": "sec2"
    },
    {
      "term": "building line",
      "definition": "a line beyond which the outer face or any part of an external wall of a building may not project beyond privately owned land in the direction of any street, existing or proposed;",
      "source_provision": "sec2"
    },
    {
      "term": "bye-laws",
      "definition": "bye-laws made under this Act or made under the Capital Development Authority Ordinance, 1960 (XXIII of 1960) or the Municipal Administration Ordinance, 1960;",
      "source_provision": "sec2"
    },
    {
      "term": "cattle",
      "definition": "cows, buffaloes, bulls, oxen, bullocks, heifers, calves, camels, sheep, goats and others;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of a Union Council as mentioned in section 11;",
      "source_provision": "sec2"
    },
    {
      "term": "Chief Officer",
      "definition": "the Chief Officer appointed under section 63;",
      "source_provision": "sec2"
    },
    {
      "term": "Code",
      "definition": "the Code of Criminal Procedure, 1898 (Act V of 1898);",
      "source_provision": "sec2"
    },
    {
      "term": "conservancy",
      "definition": "the collection, treatment, removal and disposal of refuse;",
      "source_provision": "sec2"
    },
    {
      "term": "dairy",
      "definition": "any farm, cattle-shed, cow-house, milk store, milk shop or any other place from where milk or milk products are supplied;",
      "source_provision": "sec2"
    },
    {
      "term": "Deputy Mayor",
      "definition": "a Deputy Mayor of the Metropolitan Corporation elected under section 12;",
      "source_provision": "sec2"
    },
    {
      "term": "District",
      "definition": "the area specified in section 2 of the Capital of the Republic (Determination of Area) Ordinance, 1963 (Ordinance VI of 1963);",
      "source_provision": "sec2"
    },
    {
      "term": "drain",
      "definition": "a sewer, a house drain, a drain of any other description, a tunnel, a culvert, a ditch, a channel or any other device for carrying sullage or rain water;",
      "source_provision": "sec2"
    },
    {
      "term": "dwelling house",
      "definition": "any building used substantially for human habitation;",
      "source_provision": "sec2"
    },
    {
      "term": "Election Commission",
      "definition": "the Election Commission constituted under Article 218 of the Constitution of the Islamic Republic of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "factory",
      "definition": "a factory as defined in the Factories Act, 1934 (XXV of 1934);",
      "source_provision": "sec2"
    },
    {
      "term": "food",
      "definition": "every eatable used for food or drink by human beings but does not include drugs or water;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "Federal Government as the Rules of Business may specify;",
      "source_provision": "sec2"
    },
    {
      "term": "infectious disease",
      "definition": "cholera, plague, smallpox and tuberculosis, and includes such other disease as the Government may, by notification, declare to be infectious or disease for purposes of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "land",
      "definition": "the land which is being built up or is built up or is covered with water or is under cultivation or is fallow;",
      "source_provision": "sec2"
    },
    {
      "term": "Local Fund",
      "definition": "the fund of a local government established under section 78;",
      "source_provision": "sec2"
    },
    {
      "term": "local government",
      "definition": "a Union Council or the Metropolitan Corporation established under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "market",
      "definition": "a place where persons assemble for the sale and purchase of meat, fish, fruit, vegetables or any other article of food or for the sale and purchase of livestock or animals and includes any place which may be notified as a market;",
      "source_provision": "sec2"
    },
    {
      "term": "Master Plan",
      "definition": "the Master Plan developed, maintained and enforced by Capital Development Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "Mayor",
      "definition": "the Mayor of the Metropolitan Corporation elected as such under section 12;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of a local government;",
      "source_provision": "sec2"
    },
    {
      "term": "Metropolitan Corporation",
      "definition": "the Metropolitan Corporation notified as such under section 9;",
      "source_provision": "sec2"
    },
    {
      "term": "misconduct",
      "definition": "transgression of the prescribed code of conduct or dereliction of duty or deliberate unlawful behavior or violation of law or rules or lawful directions or orders of the Government and includes,- (i) gross negligence in the performance of duties with manifest wrongful intent or evil design;or (ii) an act that results in wrongful gain to any person by wrongful application of law; or (iii) making or managing appointment, promotion or transfer of an officer or official in violation of law or rules or for extraneous consideration; or (iv) bribery, corruption, jobbery, favoritism, nepotism or willful diversion of the fund of the local government;",
      "source_provision": "sec2"
    },
    {
      "term": "municipal offence",
      "definition": "an act or omission punishable under this Act and includes an act or omission declared as municipal offence under any other law for the time being in force in Islamabad Capital Territory;",
      "source_provision": "sec2"
    },
    {
      "term": "notification",
      "definition": "notification issued by the Government under this Act and published in the Official Gazette;",
      "source_provision": "sec2"
    },
    {
      "term": "nuisance",
      "definition": "any act, omission, place or thing which causes or is likely to cause injury as may be specified, danger, annoyance or offence to the sense of sight, smell or hearing or which is or may be dangerous to life or injurious to health or property;",
      "source_provision": "sec2"
    },
    {
      "term": "occupier",
      "definition": "any person, for the time being, in actual lawful occupation of the land or building and includes an owner in actual occupation of the land or building;",
      "source_provision": "sec2"
    },
    {
      "term": "owner",
      "definition": "the person for the time being receiving the rent of land and buildings or either of them, including an agent or trustee for any person or society or for any religious or charitable purpose or who would so receive the same if land or building was let to a tenant;",
      "source_provision": "sec2"
    },
    {
      "term": "peasant",
      "definition": "a landless farm worker or, a person, who during the period of five years preceding the year in which the election is held, owningless than five acres of land as sole owner for subsistence living;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by the rules as defined under clause (tt);",
      "source_provision": "sec2"
    },
    {
      "term": "prohibited zone",
      "definition": "any area or areas within a local government declared as prohibited zone by a public notice for purposes of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "public road",
      "definition": "and includes a road or street or way maintained by the Government or by a local government or by any other local authority;",
      "source_provision": "sec2"
    },
    {
      "term": "public place",
      "definition": "any building, premises or place to which the public have access;",
      "source_provision": "sec2"
    },
    {
      "term": "rate",
      "definition": "and includes the charges that may be fixed and levied by the local governments for provision of any services, for which it incurs a cost, provided under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "refuse",
      "definition": "rubbish, offal, night-soil, carcasses of animals, deposits of sewerage, waste and any other offensive matter;",
      "source_provision": "sec2"
    },
    {
      "term": "rent",
      "definition": "whatever is by law payable in money or kind by a tenant or lessee on account of lawful occupation or use of any building or land;",
      "source_provision": "sec2"
    },
    {
      "term": "revenue estate",
      "definition": "a revenue estate declared under the Land Revenue Act, 1967 (XVII of 1967) as adapted in the Islamabad Capital Territory;",
      "source_provision": "sec2"
    },
    {
      "term": "road",
      "definition": "a road or a street or way which is not a thoroughfare;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under the Capital Development Authority Ordinance, 1960 or may be made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Schedule",
      "definition": "a Schedule appended to this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "streets line",
      "definition": "a line dividing the land comprised in, and forming part of, a road or street from the adjoining land;",
      "source_provision": "sec2"
    },
    {
      "term": "tax",
      "definition": "any cess, rate, fee, toll or other charge levied under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "technocrat",
      "definition": "a person who is the holder of a degree requiring conclusion of at least sixteen years of education recognized by the Higher Education Commission and at least five years of experience in the relevant field;",
      "source_provision": "sec2"
    },
    {
      "term": "Union Council",
      "definition": "an area notified as a Union Council under section 7;",
      "source_provision": "sec2"
    },
    {
      "term": "vehicle",
      "definition": "a wheeled conveyance capable of being used on a road or street;",
      "source_provision": "sec2"
    },
    {
      "term": "Vice Chairman",
      "definition": "the Vice Chairman of a Union Council as mentioned in section 11;",
      "source_provision": "sec2"
    },
    {
      "term": "village",
      "definition": "an integrated and contiguous human habitation commonly identified by a name and includes a dhok, chak, gaown, basti or any other comparable habitation within a revenue estate;",
      "source_provision": "sec2"
    },
    {
      "term": "voter",
      "definition": "a person, whose name for the time being appears on the electoral rolls prepared or adapted for the purposes of the election under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "worker",
      "definition": "a person directly engaged in work or is dependent on personal labour for subsistence living and includes a worker as defined in the Industrial Relations Act 2012 (X of 2012);",
      "source_provision": "sec2"
    },
    {
      "term": "youth",
      "definition": "a person who is enrolled as a voter in the respective Union Council and is 1[*] less than twenty-five years of age on last day fixed for filing of nomination papers; and",
      "source_provision": "sec2"
    },
    {
      "term": "Zoning Regulation",
      "definition": "the Islamabad Capital Territory Zoning Regulations 1992. (2) The expressions, not defined in sub-section (1), shall have the same meaning as defined in any other relevant law or generally used.",
      "source_provision": "sec2"
    }
  ]
}
