{
  "id": "pk-islamabad-capital-territory-prohibition-of-corporal-punishment-act-2021",
  "type": "statute",
  "title": "Islamabad Capital Territory Prohibition of Corporal Punishment Act, 2021",
  "title_en": "Islamabad Capital Territory Prohibition of Corporal Punishment Act, 2021",
  "short_name": "ICTPO",
  "status": "in_force",
  "issued_date": "2021-11-30",
  "in_force_date": "2021-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pj-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Islamabad Capital Territory Prohibition of Corporal Punishment Act, 2021 (XLIX of 2021) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and Commencement",
      "content": "(1) This Act shall be called the Islamabad\nCapital Territory Prohibition of Corporal Punishment Act, 2021.\n(2) It extends to the Islamabad Capital Territory.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless the context otherwise requires,—\n(a)     “care institutions” means an educational institution, an orphanage or a place of\nsafety for one or more children for the purposes of providing alternative care or\nfoster care; it may include a children’s home, rehabilitation center or shelter\neither on permanent or temporary basis whether public or private; registered or\nunregistered;\n(b)     “child” means any person under the age of eighteen years;\n(c)     “corporal” or “physical” means any punishment in which physical force is used\nand intended to cause some degree of pain or discomfort, however light it may\nbe, which may involve hitting (“smacking”, “slapping”, “spanking”) a child,\nwith the hand or with an implement (a whip, stick, belt, shoe, wooden spoon,\netc.) including kicking, shaking or throwing a child, scratching, pinching, biting,\npulling hair or boxing ears. Forcing a child to stay in uncomfortable positions,\nburning, scalding or forced ingestion for example, washing a child’s mouth out\nwith soap or forcing him to swallow hot spices, including mental abuse or any\nother kind of punishment but not limited to:—\n(i)     “assault” as defined in section 351 of the Pakistan Penal Code (Act XLV of\n1860) hereinafter referred to in this section as “the said Code”;\n(ii)    “hurt” as defined in section 332 of the said Code;\n(iii)   “criminal force” as defined in section 350 of the said Code; and\n(iv)    other non-physical forms of punishment which are cruel and degrading, for\nexample, punishment which belittles, humiliates, denigrates, scapegoats,\nthreatens, scares or ridicules the child.\n(d)     “educational institution” means any institution where any kind of instruction is\nimparted in a formal or non-formal way whether it is on a full time or part time\nbasis; including boarding houses, both public or private; registered or un-\nregistered; and\n(e)     “work place” means the place of work or the premises where an organization or\nemployer operates and includes building, factory, shop, commercial\nestablishment, workshop, farm, residential hotel or restaurant, open area or a\nlarger geographical area where the activities of the organization or of employer\nare carried out and including any situation that is linked to official work or\nofficial activity outside the office.\n(2) “words and expression” used but not defined shall have the same meaning as assigned in\nthe respective laws."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Prohibition of Corporal Punishment",
      "content": "(1) The child has the right to be shown respect for\nhis personality and individuality and shall not be made subject to corporal punishment or any other\nhumiliating or degrading treatment.\n(2) Notwithstanding anything contained in section 89 of the Pakistan Penal Code, 1860 (Act\nXLV of 1860) and any other law and regulation for the time being in force, corporal punishment of\nchildren by any person is prohibited in all its forms, at work place, in schools and other educational\ninstitutions including formal, non-formal, and religious, both public and private, in child care\ninstitutions including foster care, rehabilitation centers and any other alternative care settings, both\npublic and private, and in the Juvenile Justice System.\n(3) Disciplinary measures concerning the child can only be taken in accordance with the child’s\ndignity, and under no circumstances corporal punishments, or punishments which relate to the child’s\nphysical and mental development or which may affect the child’s emotional status are allowed."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Penalties",
      "content": "(1) Whoever violates the provisions of section 3 of this Act shall be liable to\nand in other enactments.\n(2) The following minor and major penalties shall be in addition to other enactment, who\nviolate the provisions of section 3 of this Act in educational, care institutions, and in other alternative\ncare setting:—\n(a)   Minor penalties:\n(i)      censure;\n(ii)     withholding, for a specific period, promotion or increment, otherwise\nthan for unfitness for promotion or financial advancement in accordance\nwith the rules or orders pertaining to the service or post;\n(iii)    stoppage from promotion, for a specific period, at an efficiency bar in\nthe time-scale, otherwise than for unfitness to cross such bar; and\n(iv)      recovery from pay of the whole or any part of any pecuniary loss caused\nto government by negligence or breach of orders; and\n(b)   Major penalties:\n(i)     demotion to a lower post or time-scale, or to a lower stage in a time scale;\n(ii)    compulsory retirement;\n(iii)   removal from service; and\n(iv)    dismissal from service.\n(3) Removal from service does not, but dismissal from service does, disqualify for future\nemployment.\n(4) In this section removal or dismissal from service does not include the discharge of a\nperson—\n(a)     appointed on probation, during the period of probation, or in accordance with\nthe probation or training rules applicable to him; or\n(b)     appointed, otherwise than under a contract, to hold a temporary appointment,\non the expiration of the period of appointment; or\n(c)     engaged under a contract in accordance with the terms of the contract."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Cognizance of Offence",
      "content": "Cognizance of offence under this Act shall be taken by a court\nof a magistrate upon complaint by the child on whom punishment is inflicted or the parent of such\nchild or his next of kin."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Enforcement of the provisions of this Act to private institutions",
      "content": "(1) The Federal\nGovernment shall devise a comprehensive system for the enforcement and monitoring of this Act in\nprivate institutions whether registered or unregistered.\n(2) All private institutions shall formulate a complaint system to address corporal punishment.\n(3) At the time of registration the private institution will have to submit an undertaking in\nwriting that they will be responsible for the formulation of complaint system in line with the Act and\nRules made there under for entertaining complaints of corporal punishment; failing which will make\nthem liable to the cancelation of registration. The form of undertaking will be prescribed.\n(4) In case of a private institution the complaint of corporal punishment may also be filed for\ninvoking the provisions of the Act before an authority which may be prescribed."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. This Act to override all other laws",
      "content": "The provisions of this Act shall override all other\nlaws for the time being in force."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Rules",
      "content": "(1) The Federal Government may, by notification in the official Gazette, make rules\nwithin six months after commencement of this Act.\n(2) The Federal Government shall amend the code of conduct for teachers and the relevant\nrules etc. to include the prohibition of corporal punishment against children at workplace and in all\neducational institutions including formal, non-formal, and religious, both public and private, and in\nchild care institutions including foster care, rehabilitation centers, and any other alternative care\nsettings, both public and private and in juvenile justice system."
    }
  ],
  "definitions": [
    {
      "term": "care institutions",
      "definition": "an educational institution, an orphanage or a place of safety for one or more children for the purposes of providing alternative care or foster care; it may include a children’s home, rehabilitation center or shelter either on permanent or temporary basis whether public or private; registered or unregistered;",
      "source_provision": "sec2"
    },
    {
      "term": "child",
      "definition": "any person under the age of eighteen years;",
      "source_provision": "sec2"
    },
    {
      "term": "educational institution",
      "definition": "any institution where any kind of instruction is imparted in a formal or non-formal way whether it is on a full time or part time basis; including boarding houses, both public or private; registered or un- registered; and",
      "source_provision": "sec2"
    },
    {
      "term": "work place",
      "definition": "the place of work or the premises where an organization or employer operates and includes building, factory, shop, commercial establishment, workshop, farm, residential hotel or restaurant, open area or a larger geographical area where the activities of the organization or of employer are carried out and including any situation that is linked to official work or official activity outside the office. (2) “words and expression” used but not defined shall have the same meaning as assigned in the respective laws.",
      "source_provision": "sec2"
    }
  ]
}
