{
  "id": "pk-islamabad-capital-territory-shops-business-and-industrial-establishments-securit",
  "type": "statute",
  "title": "Islamabad Capital Territory Shops, Business and Industrial Establishments (Security) Ordinance, 2000",
  "title_en": "Islamabad Capital Territory Shops, Business and Industrial Establishments (Security) Ordinance, 2000",
  "short_name": "ICTSB",
  "status": "in_force",
  "issued_date": "2000-07-26",
  "in_force_date": "2000-07-26",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaaYw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Islamabad Capital Territory Shops, Business and Industrial Establishments (Security) Ordinance, 2000 (XXX of 2000) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power to make rules",
      "content": "THE ISLAMABAD CAPITAL TERRITORY SHOPS, BUSINESS AND\nINDUSTRIAL ESTABLISHMENTS (SECURITY)\nORDINANCE, 2000\nORDINANCE No. XXX of 2000\n[27th July, 2000]\nAn Ordinance to provide for the security of shops, business and industrial establishments in the\nIslamabad Capital Territory\nWHEREAS, it is expedient to provide for security of shops, business and industrial\nestablishments in the Islamabad Capital Territory and for matters ancillary thereto;\nAND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the\nProclamation of Emergency of the fourteenth day of October, 1999, and the Provisional Constitution\nOrder No. 1 of 1999;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of\nOctober, 1999, and Provisional Constitution Order No. 1 of 1999, as well as Order No. 9 of 1999, and\nin exercise of all powers enabling him in that behalf, the President of the Islamic Republic of Pakistan\nis pleased to make and promulgate the following Ordinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_ (1) This Ordinance may be called the Islamabad\nCapital Territory Shops, Business and Industrial Establishments (Security) Ordinance, 2000.\n(2) It extends to the whole of Islamabad Capital Territory.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions:___ In this Ordinance,",
      "content": "(a)     “establishment” includes—\n(i)    any bank, money changer or financial institution; and\n(ii)   any office, firm, company, institution, industrial unit, undertaking,\nshop or premises used for undertaking any business, trade,\nmanufacture, calling, service, employment or occupation; and\n(b)     “Government” means the Federal Government."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Security of Establishment",
      "content": "_ The Government may by order, published in the official\nGazette, provide for the regulation and enforcement of measures for the security of the property and\npersons connected with any establishment."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Penalties",
      "content": "_ If any person contravenes any order made under this Ordinance he shall be\npunished with imprisonment for a term which may extend to one month or with fine which may extend\nto fifteen thousand rupees, or with both."
    }
  ],
  "definitions": [
    {
      "term": "Government",
      "definition": "the Federal Government.",
      "source_provision": "sec2"
    }
  ]
}
