{
  "id": "pk-islamabad-capital-territory-trust-act-2020",
  "type": "statute",
  "title": "Islamabad Capital Territory Trust Act, 2020.",
  "title_en": "Islamabad Capital Territory Trust Act, 2020.",
  "short_name": "ICTTA",
  "status": "in_force",
  "issued_date": "2020-08-26",
  "in_force_date": "2020-08-26",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NpaZg%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Islamabad Capital Territory Trust Act, 2020. (XXV of 2020) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, commencement and application",
      "content": "(1) This Act shall be called\n(2)   It shall extend to the whole of the Islamabad Capital Territory.\n(3)   It shall come into force at once.\n(4) Nothing herein contained shall affect the rules of Muslim law as to waqf or the mutual\nrelations of the members of an undivided family as determined by any customary or personal law\nor to public or private religious or charitable endowments or to trusts to distribute prizes taken in\nwar among the captors."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or\ncontext;\n(a)   “author of the trust” means the natural person who reposes or declares the confidence\nand assigns the property to the trustee for the benefit of beneficiary;\n(b)   “beneficiary” means the natural person who benefits the confidence of the trust;\n(c)   “breach of trust” means breach of any duty imposed on trustee as such by any law\nfor the time being in force;\n(d)   “competent authorities” means the ‘regulators’, “the oversight bodies for SRBs as\nspecified in the Anti-Money Laundering Act, 2010 (VII of 2010)”, “the investigating\nor prosecuting agency” and “the Financial Monitoring Unit”;\n(e)    “department” means the directorate of labour and industries, Islamabad Capital\nTerritory;\n(f)    “director” means the director of directorate of labour and industries, Islamabad\nCapital Territory;\n(g)    “district intelligence coordination committee” means the intelligence committee\nheaded by the deputy commissioner or district magistrate, Islamabad Capital\nTerritory, Islamabad and comprising the representatives of police and intelligence\nagencies;\n(h)    “financial monitoring unit” means the financial monitoring unit specified under the\nAnti-Money Laundering Act, 2010 (VII of 2010);\n(i)   “home department” means the office of the Chief Commissioner, Islamabad Capital\nTerritory;\n(j)   “instrument of the trust” means the instrument by which the trust is declared;\n(k)    “interest” means the beneficiary’s right against the trust property;\n(l)   “investigating or prosecuting agency” means an investigating or prosecuting agency\nas specified in the Anti-Money Laundering Act, 2010 (VII of 2010);\n(m)    “law department” means directorate of law, Chief Commissioner’s office, Islamabad\nCapital Territory;\n(n)    “notice” means a person is said to have known of a fact either when he actually knows\nthat fact, or when, but for willful abstention from inquiry or gross negligence, he\nwould have known it, or when information of the fact is given to or obtained by his\nagent, under the circumstances mentioned in the Contract Act,1872 (IX of 1872),\nand all expressions used herein and defined in the Contract Act,1872 (IX of 1872),\nshall be deemed to have the meanings respectively attributed to them by that Act;\n(o)    “prescribed” means prescribed by rules made under this Act;\n(p)    “provincial government” means the government defined under Presidential Order\nNo. 1 of 1980;\n(q)    “purpose” means any lawful purpose unless it is—\n(i)     forbidden by law; or\n(ii)    is of such a nature that, if permitted, it would defeat the provisions of\nany law; or\n(iii)   is fraudulent; or\n(iv)    involves or implies injury to the person or property of another; or\n(v)     the court regards it as immoral or opposed to public policy;\n(r)   “registered” means registered with the director;\n(s)    “reporting entity” means an entity specified under the Anti-Money Laundering Act,\n2010;\n(t)   “revenue department” means office of the district collector, Islamabad Capital\nTerritory;\n(u)    “trust” means an obligation annexed to the ownership of property and rising out of\nthe confidence reposed in and accepted by the owner or declared and accepted by\nhim for the benefit of beneficiary;\n(v)    “trustee” means any person who accepts the confidence of the author of the trust to\nthe benefit of the beneficiary; and\n(w)    “trust property” means the subject matter of the trust; it may be movable or immovable\nproperty."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Validity of trust",
      "content": "(1) No trust in relation to any immovable property is valid unless\ndeclared by a non-testamentary instrument in writing signed by the author of the trust or the trustee\nand registered or by the will of the author of the trust or of the trustee and its ownership is\ntransferred to the trust.\n(2) No trust in relation to movable property is valid unless declared as aforesaid or unless\nthe ownership of the property is transferred to the trust."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Creation of trust",
      "content": "(1) Subject to the provisions of section 3, a trust is created when\nthe author of the trust indicates with reasonable certainty by any words or acts,—\n(a)    an intention on his part to create thereby a trust;\n(b)    the purpose of the trust;\n(c)    the beneficiary;\n(d)    the trust-property; and\n(e)   transfers the trust-property to the trustee unless the trust is declared by will or the\nauthor of the trust is himself to be the trustee.\n(2) Every trust for which the purpose of the trust is unlawful is void and where it is\ncreated for more than one purpose and one of the purposes is unlawful then whole of the trust is\nvoid."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Who may create trusts",
      "content": "A trust may subject in each case to the law for the time\nbeing in force as to the circumstances and extent in and to which the author of the trust may\ndispose of the trust property be created -\n(a)   by every natural person competent to contract under the Contract Act, 1872 (IX\nof 1872); or\n(b)   with the permission of a principal civil court of original jurisdiction by or on behalf\nof a minor."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Subject of trust",
      "content": "The subject matter of a trust must be property transferable to the\nbeneficiary and it must not be merely beneficial interest under a subsisting trust."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Who may be beneficiary",
      "content": "Every natural person capable of holding property may\nbe a beneficiary and no legal person shall be a beneficiary under this Act."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Disclaimer by beneficiary",
      "content": "A proposed beneficiary may renounce his interest\nunder the trust by disclaimer addressed to the trustee or by setting up with notice of the trust a\nclaim inconsistent therewith."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Who may be trustee",
      "content": "Every natural person capable of holding property and not a\nlegal person may be a trustee but, where the trust involves the exercise of discretion, he shall not\nexecute it unless he is competent to contract under the Contract Act, 1872 (IX of 1872)."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Acceptance to trust",
      "content": "(1) A trust is accepted by any words or acts of the trustee\nindicating with reasonable certainty such acceptance.\n(2) Each of the trustee accepting the trust in this section shall provide an affidavit that\nthe trustee has read and understood the duties and liabilities of the trustee as mentioned in Chapter-\nIV."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Disclaimer of trust",
      "content": "(1) Instead of accepting a trust, the intended trustee may,\nwithin a period of sixty days, disclaim it and such disclaimer shall prevent the trust-property from\nvesting in him.\n(2) In case of more than one trustees, if one of trustees, disclaims to be a trustee, it shall\nnot automatically confer the disclaiming trustee‘s rights on the other trustees. The author of the\ntrust shall either (a) explicitly allow the co-trustees to proceed in case of any of the member‘s\ndisclaimer, or (b) write a new trust-deed."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Trusts to be registered",
      "content": "No Trust shall be functional unless it is registered under\nthis Act with the Directorate of Labor and Industries, Islamabad Capital Territory, Islamabad."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Application for registration",
      "content": "(1) For every trust required to be registered under\nthis Act, the trustee shall provide to the director at or before the time of registration, the\ninformation regarding the purpose, author of the trust, details of the trustees, beneficiaries of the\ntrust, and any other natural person exercising ultimate effective control over the trust as prescribed\nto the satisfaction of the department.\nExplanation.—In case of more than one trustee, all the trustees will nominate one Trustee\nwho shall be responsible for the provision of information.\n(2) The details of the information required to be provided under sub-section (1) above\nshall be prescribed."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Verification of the application",
      "content": "The director shall verify the contents and\nparticulars of the application before the registration through the investigating or prosecuting\nagencies who shall submit the verified report to the Director within 14 days of receiving the\nrequest from him."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Registration of the properties",
      "content": "(1) All movable and immovable properties must\nbe registered in the name of the Trust under the Registration Act, 1908.\n(2) Without prejudice to the Registration Act, 1908, the registration of the properties must\ninclude the details of authors of the trust, beneficiaries, trustee, co-trustee, if any, and any other\nnatural person exercising ultimate effective control over the trust."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Certificate of registration",
      "content": "(1) The director, after fulfillment of legal\nrequirements, as mentioned in sections 13 to 15, shall register the trust under this Act and issue\na certificate of registration to the trustee.\n(2) The director, for the reasons to be recorded in writing, may refuse the registration of\nthe application, if —\n(a)   the purpose of the trust is unlawful or the trust proceeds are suspected to be proceeds\nof crime, as the investigating or prosecuting agencies inform the director under\nsection 14 and the director may refer back the application to the law enforcement\nagencies for legal action or any of the members of the trust including author, trustees\nor any other person exercising ultimate effective control over the trust are declared\nproscribed by the office of the Chief Commissioner, Islamabad Capital Territory, or\nassociated with the proscribed organizations under the Anti-Terrorism Act, 1997 or\nunder the United Nations Security Council Act, 1948, and in such cases as mentioned\nin clause (b), the director shall share the details of individuals with the Ministry of\nInterior and Ministry of Foreign Affairs through the home department; or\n(b)   the district intelligence coordination committee considers the trust a threat to national\nsecurity; or\n(c)   the author of the trust, trustee, beneficiary, or any person acting on their behalf fail\nto provide the complete personal details required under section 13 for the registration\nand functioning of the trust; or\n(d)   any other reason as may be prescribed."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Power to inspect record and compliance",
      "content": "(1) The director, or the district\nmagistrate, ICT or the provincial government may summon any information relating to the trust\nfrom the trustee for any purpose, and shall have the power to inspect such record at any time:\nProvided that the director while inspecting the record under this sub-section, shall\nstate the reasons in writing for such inspection.\n(2) The officer summoning the record under sub-section (1) may share it with the\ncompetent authorities upon written request through the office of Chief Commissioner, Islamabad\nCapital Territory any information about the trust, trust assets, trust proceeds, author of the trust,\ntrustee, beneficiary or any other person exercising ultimate effective control over the trust.\n(3)   The director may also share the information under this section relating to the trust\nassets and beneficiaries with the reporting entity upon request.\n(4)    The director may after conviction by the competent court of law impose financial\npenalty up to Rupees one million, if a trustee is found in violation to the purpose of the trust or\nfails to provide the information under sub-section (1).\n(5) In case of failure to pay the penalty under sub-section (4), the director may seek a\nlegal action through the court of original jurisdiction against the trustees held responsible for non-\ncompliance under this Act, and such legal action may result in imprisonment ranging from one\nmonth to six months. The imprisonment granted under this section shall be for the non-compliance\nof the provisions of this Act and shall be in addition to the financial penalty already imposed\nunder sub-section (4).\n(6)   The director may after conviction by the competent court of law impose financial\npenalty up to Rupees one million, if a trustee fails to provide the information required under\nsections 20 and 22, or fails to obtain and hold the information required under section 23. In\naddition, the trustee shall also be liable for imprisonment of minimum three months to a maximum\nof six months if he fails to make information available to the competent authorities as required\nunder section 20 or to the department or director for the purposes of sharing information under\nsection 20. This punishment shall be awarded by a court of the original jurisdiction.\n(7) The director may further take over the properties of the trust or freeze its assets or\nremove a trustee or a beneficiary from the trust and assign new trustees or beneficiary through\na legal order from a court of original jurisdiction in case the trust or trustee or beneficiary is\nconvicted of a criminal offence, including terror financing, money laundering or a threat to\nnational security.\n(8)  Nothing in sub-sections (2), (3), (4), (5) and (6) shall limit the person’s basic right of\nbeing given fair trial opportunity and appeal to the secretary of the Division concerned or the\nappellant court, as the case may be."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Power to obtain the registration record",
      "content": "The department shall obtain the\nregistration of trust record from the revenue department i.e. district collector, ICT, which was\nheld by it before the enactment of this Act within a period of sixty days from the date of enactment\nof this Act, and, the department shall make efforts to make the trust record in conformity with the\nprovisions of this Act."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Register of trusts",
      "content": "(1) The director shall maintain a register of the trusts in such\nmanner as may be prescribed.\n(2)   The register shall contain information, including but not limited to the name and\ndetails of every trust, its purpose, author, trustee, beneficiaries, any person exercising ultimate\neffective control over the trust and other information as required by the department.\n(3) The details must also include, if any of the person associated with the trust is living\nin Pakistan or outside Pakistan along with their residential addresses.\n(4)   The department shall explain the extent of the details of individuals as included in\nthe sub-sections (1), (2) and (3) to be made public in a manner and circumstances as may be\nprescribed."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Access to the information",
      "content": "(1) The director may at any time require any\ninformation relating to the trust from the trustee, and the trustee is bound to provide the\ninformation in a timely manner as may be prescribed.\n(2) For purposes of domestic and international cooperation, competent authorities may\nat any time require any information relating to the trust from the trustee, and the trustee shall\nprovide the information in a timely manner as may be prescribed. Both the request of the\ncompetent authorities and response of the trustee shall be routed through the provincial\ngovernment in a timely manner as may be prescribed.\n(3) The reporting entity may, in a timely manner as may be prescribed, also obtain the\ninformation from the trustee about the details of trust assets, residential addresses of trustees and\ndetails of beneficiaries, however such request and response shall be routed through the\ndepartment:\nProvided that reasons of obtaining any kind of information, record shall be communicated\nto the trust along-with notice of obtaining such information, record etc."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Legal arrangement for holding the property",
      "content": "A trust may hold immovable and\nmovable property under its name, or may sell or dispose of the property being held by it. Such\nsale and purchase shall be the responsibility of the trustee."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Trustee to execute trust",
      "content": "(1) The trustee is bound to fulfill the purpose of the trust,\nand to obey the directions of the author of the trust given at the time of its creation, except as\nmodified by the consent of all the beneficiaries being competent to contract.\n(2) Where the beneficiary is incompetent to contract, his consent may, for the purposes\nof this section, be given by a principal civil court of original jurisdiction.\n(3) Nothing in this section shall be deemed to require a trustee to obey any direction\nwhen to do so would be impracticable, illegal or manifestly injurious to the beneficiaries.\nExplanation—Unless a contrary intention be expressed, the purpose of a trust for the\npayment of debts shall be deemed to be,—\n(a)   to pay only the debts of the author of the trust existing and recoverable at the date of\nthe instrument of trust, or, when such instrument is a will, at the date of his death;\nand\n(b)   in the case of debts not bearing interest, to make such payment without interest.\n(4) A trustee, or all of the trustees, as the case may be, are bound to disclose the fact that\nthey are trustees when entering into a business relationship or carrying out an occasional\ntransaction with a reporting entity."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Trustee to collect and hold information",
      "content": "(1) A trustee or each of the trustees, as\nthe case may be, must collect and hold information about the author of the trust, co-trustee, if any,\nbeneficiaries of the trust, and any other natural person exercising ultimate effective control over\nas mentioned in section 22.\n(2) The trustee must provide the updated information under this Act to the director in\ntimely manner as may be prescribed. In case of more than one trustee, only one trustee shall be\nnominated by other co-trustees for the purpose of provision of information.\n(3) The trustees or the trustee shall collect and hold basic information about the other\nservice providers to the trust including, but not limited to, investment advisers or managers,\naccountants or tax advisors, and, provide this information to the director even after the registration\nof the trust, in the circumstances and manner as may be prescribed.\n(4)   The details of the information required to be collected and held under sub-sections\n(1), (2) and (3) shall be as may be prescribed.\n(5)  The trustees or the trustee shall further inform the provincial government or the\ndirector and law enforcement agencies if it comes to their knowledge of any illegal utilization of\nthe trust money by the beneficiaries, after and during the execution of the trust."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Trustee to inform himself to state of trust",
      "content": "property.—A trustee is bound to\nacquaint himself, as soon as possible, with the nature and circumstances of the trust property to\nobtain, where necessary, a transfer of the trust property to himself and subject to the provisions\nof the instrument of trust to get in trust-money invested or insufficient or hazardous security.\nIllustrations.— (a) The trust-property is a debt outstanding on personal security. The\nInstrument of trust gives the trustee no discretionary power to leave the debt so\noutstanding. The trustee’s duty is to recover the debt without unnecessary delay.\n(b) The trust-property is money in the hands of one of two co-trustees. No discretionary\npower is given by the instrument of trust. The other co-trustee must not allow the former\nto retain the money for a longer period than the circumstances of the case required."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Trustee to protect title to trust",
      "content": "property.—A trustee is bound to maintain and\ndefend all such suits, and subject to the provisions of the instrument of trust to take such other\nsteps, as regards being had to the nature and amount or value to the trust property, may be\nreasonably requisite for the preservation of the trust-property and the assertion or protection of\nthe title thereto.\nIllustrations.—The trust-property is immovable property, which has been given to the\nauthor of the trust by an unregistered instrument. Subject to the provisions of the law for the\nregistration of the documents, the trustee’s duty is to cause the instrument to be registered."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Trustee not to set up title adverse to beneficiary",
      "content": "The trustee must not for himself\nset up or aid any title to the trust-property adverse to the interest of the beneficiary."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Care required from trustee",
      "content": "A trustee is bound to deal with the trust-property as\ncarefully as a man of ordinary prudence would deal with such property if it were his own; and, in\ndestruction or deterioration of the trust-property."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Conversion of perishable property",
      "content": "Where the trust is created for the benefit of\nseveral persons in succession, and the trust-property is of a perishable nature or a future or\nreversionary interest, the trustee is bound unless an intention to the contrary may be inferred from\nthe instrument of trust, to convert the property into property of a permanent and immediate\nprofitable character."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Trustee to be impartial",
      "content": "(1) Where there are more beneficiaries than one, the\ntrustee is bound to be impartial, and must not execute the trust for the advantage of one at the\nexpense of another.\n(2) Where the trustee has a discretionary power, nothing in this section shall be deemed\nto authorize the court to control the exercise of same reasonably and in good faith."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Trustee to prevent waste",
      "content": "Where the trust is created for the benefit of several\npersons in succession and one of them is in possession of the trust-property, if he commits, or\nthreatens to commit any act, which is destructive, or permanently injurious thereto, the trustee is\nbound to take measures to prevent such act."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Accounts and information",
      "content": "A trustee or each of the trustee, as the case may be,\nis bound to—\n(a)   keep clear and accurate accounts of the trust-property and income;\n(b)   at all reasonable times, at the request of the beneficiary, to furnish him with full and\naccurate information as to the amount and state of the trust-property;\n(c)   update the information in a timely manner about the author of the trust, beneficiaries,\ntrustees, any other natural person exercising ultimate control over the trust, trust\nassets and incomes;\nExplanation.—The details of the information shall be as may be prescribed\nthis Act;\n(d)   get accounts audited by a third party at least once in a year;\n(e)   submit financial reports to the director in every financial year; and\n(f)   shall maintain the information collected under this section, and, section 23 for a\nperiod not less than the five years after their involvement with the trust ceases, or,\nthe trust is extinguished."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Investment of trust",
      "content": "money.—(1) Where the trust-property consists of money and\ncannot be applied immediately or at an early date to the purposes of the trust, the trustee is bound\nsubject to any direction contained in the instrument of trust to invest the money on the following\nsecurities, and on no other, namely:—\n(a)   in promissory notes, debentures, stock or other securities of a Provincial or Federal\nGovernment:\nProvided that securities, both the principal whereof and the interest whereon shall\nhave been fully and unconditionally guaranteed by any government, shall be\ndeemed, for the purposes of this clause, to be securities of such Government; and\n(b)   on any other security expressly authorized by the instrument of trust, or by any rule\nwhich the High Court may prescribe in this behalf."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Power to purchase redeemable stock at a premium",
      "content": "A trustee may invest in any\nof the securities mentioned or referred to in section 32, notwithstanding that the same may be\nredeemable and that the price exceeds the redemption value, and a trustee may retain until\nredemption any redeemable stock, fund or security which may have been purchased in accordance\nwith this section."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Sale by trustee directed to sell within specified time",
      "content": "Where a trustee, directed\nto sell within a specified time extends such time, the burden of proving, as between himself and\nthe beneficiary, that the latter is not prejudiced by the extension lies upon the trustee, unless the\nextension has been authorized by a principal civil court of original jurisdiction."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Liability for breach of trust",
      "content": "(1) Where the trustee commits a breach of trust, he\nis liable to make good the loss which the trust-property or the beneficiary has thereby sustained,\nunless the beneficiary, has by fraud induced the trustee to commit the breach, or the beneficiary,\nbeing competent to contract, has himself, without coercion or undue influence having been\nbrought to bear on him, concurred in the breach, or subsequently acquiesced therein, with full\nknowledge of facts of the case and of his rights as against the trustee.\n(2) A trustee committing a breach of trust is not liable to pay interest except in the\nfollowing cases, namely:—\n(a)   where he has actually received interest;\n(b)   where the breach consists in unreasonable delay in paying trust-money to the\nbeneficiary;\n(c)   where the trustee ought to have received interest, but has not done so;\n(d)   where he may be fairly presumed to have received interest. He is liable, in case (a),\nto account for the interest actually received, and, in cases (b), (c) and (d), to account\nfor simple interest at the rate of six per cent per annum, unless the court otherwise\ndirects;\n(e)   where the breach consists in failure to invest trust-money and to accumulate the\ninterest or dividends thereon, he is liable to account for compound interest with half-\nyearly rests at the same rate; and\n(f)   where the breach consists in the employment of trust-property or the proceeds thereof\nin trade or business, he is liable to account, at the option of the beneficiary, either for\ncompound interest (with half-yearly rests) at the same rate, or for the net profits made\nby such employment."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. No set",
      "content": "off allowed to trustee.—A trustee who is liable for a loss occasioned by a\nbreach of trust in respect of one portion of the trust property cannot set-off against his liability\nagain which has accrued to another portion of the trust-property through another and distinct\nbreach of trust."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Non",
      "content": "liability for predecessor’s default.—Where a trustee succeeds another, he is\nnot, as such, liable for the acts or defaults of his predecessor."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Non",
      "content": "liability for co-trustee’s default.—(1) Subject to the provisions of sections 25\nand 27, one trustee is not, as such, liable for a breach of trust committed by his co-trustee:\nProvided that, in the absence of an express declaration to the contrary in the instrument\nof trust, a trustee is so liable –\n(a)   Where he has delivered trust-property to his co-trustee without seeing to its proper\napplication;\n(b)    where he allows his co-trustee to receive trust-property and fails to make due inquiry\nas to the co-trustee’s dealings therewith, or allows him to retain it longer than the\ncircumstances of the case reasonably require;\n(c)   where he becomes aware of a breach of trust committed or intended by his co-trustee,\nand either actively conceals it or does not within a reasonable time take proper steps\nto protect the beneficiary’s interest.\n(2) A co-trustee who joins in signing a receipt for trust-property and proves that he has\nnot received the same is not answerable, by reason of such signature only, for loss or\nmisapplication of the property by his co-trustee."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Several liabilities of co",
      "content": "trustee.—(1) Where co-trustees jointly commit a breach of\ntrust, or where one of them by his neglect enables the other to commit a breach of trust, each is\nliable to the beneficiary for the whole of the loss occasioned by such breach.\n(2) As between the trustees themselves, if one be less guilty than another and has had to\nrefund the loss, the former may compel the latter, or his legal representative to the extent of the\nassets he has received, to made good such loss; and, if all be equally guilty, any one or more of\nthe trustees who has had to refund the loss may compel the others to contribute.\n(3)   Nothing in this section shall be deemed to authorize a trustee who has been guilty of\nfraud to institute a suit to compel contribution."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Non",
      "content": "liability of trustee paying without notice of transfer by beneficiary.—When\nany beneficiary’s interest becomes vested in another person, and the trustee, not having notice of\nthe vesting, pays or delivers trust-property to the person who would have been entitled thereto in\nthe absence of such vesting, the trustee is not liable for the property so paid or delivered."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Liability of trustees where beneficiary’s interest is forfeited to the",
      "content": "Government.—When the beneficiary’s interest is forfeited or awarded by legal adjudication to\nthe government or federal government, the trustee is bound to hold the trust-property to the extent\nof such interest for the benefit of such person in such manner as the government may direct in this\nbehalf."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Indemnity of trustees",
      "content": "Subject to the provisions of the instrument of trust and of\nsections 35 and 38, trustees shall be respectively chargeable only for such moneys, stocks, funds\nand securities as they respectively actually receive, and shall not be answerable the one for the\nother of them, nor for any banker, broker or other person in whose hands any trust-property may\nbe placed, nor for the insufficiency or deficiency of any stocks, funds or securities, nor otherwise\nfor involuntary losses."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Right to title",
      "content": "deed.—A trustee is entitled to have in his possession the instrument of\ntrust and all the documents of title if any relating solely to the trust-property."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Right to reimbursement of expenses",
      "content": "(1) Every trustee may reimburse himself,\nor pay or discharge out of the trust-property, all expenses property incurred in or about the\nexecution of the trust, or the realization, preservation or benefit of the trust-property, or the\nprotection or support of the beneficiary.\n(2) If the trust-property fails, the trustee is entitled to recover from the beneficiary\npersonally on whose behalf he acted, and at whose request, expressed or implied, he made the\npayment, the amount of such expenses.\n(3) Where a trustee has by mistake made an over-payment to the beneficiary, he may\nreimburse the trust-property out of the beneficiary’s interest. If such interest fails, the trustee is\nentitled to recover from the beneficiary personally the amount of such over-payment."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Right to indemnity from gainer by breach of trust",
      "content": "(1) A person other than\ntrustee who has gained an advantage from a breach of trust must indemnify the trustee to the\nextent of the amount actually received by such person under the breach; and where he is\nbeneficiary the trustee has a charge on his interest for such amount.\n(2) Nothing in this section shall be deemed to entitle a trustee to be indemnified who has,\nin committing the breach of trust, been guilty of fraud."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Right to apply to Court for opinion in management of trust",
      "content": "property.—(1) Any\ntrustee may, without instituting a suit, apply by petition to a principal civil court of original\njurisdiction for its opinion, advice or direction on any present questions respecting the\nmanagement or administration of the trust-property other than questions of detail, difficulty or\nimportance, not proper in the opinion of the court for summary disposal.\n(2) A copy of such petition shall be served upon, and the hearing thereof may be attended\nby, such of the persons interested in the application as the court thinks fit.\n(3)   The costs of every application under this section shall be in the discretion of the court\nto which it is made."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Right to settlement of accounts",
      "content": "When the duties of a trustee, as such, are\ncompleted, he is entitled to have the accounts of his administration of the trust-property examined\nand settled and, where nothing is due to the beneficiary under the trust, to an acknowledgement\nin writing to that effect."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. General authority of trustee",
      "content": "(1) In addition to the powers expressly conferred by\nthis Act and by the instrument of trust, and subject to the restrictions, if any, contained in such\ninstrument, and to the provisions of section 29, a trustee may do all acts which are reasonable and\nproper for the realization, protection or benefit of the trust-property, and for the protection or\nsupport of a beneficiary who is not competent to contract.\n(2) Except with the permission of a principal civil court of original jurisdiction, no trustee\nshall lease trust-property for a term exceeding twenty-one years from the date of execution of\nthe lease, nor without reserving the best yearly rent that can be reasonably obtained."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Power to sell in lots, an either by public auction or private contract",
      "content": "Where the\ntrustee is empowered to sell any trust-property, he may sell the same subject to prior charges or\nnot, and either together or in lots, by public auction or private contract, and either at one time or\nat several times, unless the instrument of trust otherwise directs."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Power to sell under special conditions Power to buy",
      "content": "in-and resell.—(1) The\ntrustee making any such sale may insert such reasonable stipulations either as to title or evidence\nof title, or otherwise, in any conditions of sale or contract for sale, as he thinks fit; and may also\nbuy in the property or any part thereof at any sale by auction, and rescind or vary any contract for\nsale, and resell the property so bought in, or as to which the contract is so rescinded, without being\nresponsible to the beneficiary for any loss occasioned thereby.\n(2) Where a trustee is directed to sell trust-property or to invest trust-money in the\npurchase of property, he may exercise a reasonable discretion as to the time of effecting the sale\nor purchase."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Power to convey",
      "content": "For the purpose of completing any such sale, the trustee shall\nhave power to convey or otherwise dispose of the property sold in such manner as may be\nnecessary."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Power to vary investments",
      "content": "A trustee may, at his discretion, call in any trust-\nproperty invested in any security and invest the same on any of the securities mentioned or\nreferred to in section 32, and from time to time vary any such investments for others of the same\nnature."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Power to apply property of minors, etc., for their maintenance etc",
      "content": "(1) Where\nany property is held by a trustee in trust for a minor, such trustee may, at his discretion, pay to\nthe guardians if any of such minor, or otherwise apply for or towards his maintenance or education\nor advancement in life, or the reasonable expenses of his religious worship, marriage or funeral,\nthe whole or any part of the income to which he may be entitled in respect of such property; and\nsuch trustee shall accumulate all the residue of such income by way of compound interest by\ninvesting the same and the resulting income thereof from time to time in any of the securities\nmentioned or referred to in section 32, for the benefit of the person who shall ultimately become\nentitled to the property from which such accumulations have arisen:\nProvided that such trustee may, at any time, if he thinks fit, apply the whole or any part of\nsuch accumulations as if the same were part of the income arising in the then current year.\n(2) Where the income of the trust-property is insufficient for the minor’s maintenance or\neducation or advancement of life, or the reasonable expenses of his religious worship, marriage\nor funeral, the trustee may, with the permission of a principal civil court of original jurisdiction,\nbut not otherwise, apply the whole or any part of such property for or towards such maintenance,\neducation, advancement or expenses.\n(3)   Nothing in this section shall be deemed to affect the provisions of any local law for\nthe time being in force relating to the persons and property of minors."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Power to give receipts",
      "content": "Any trustees or trustee may give a receipt in writing for\nany money, securities or other moveable property payable, transferable or deliverable to them or\nhim by reason, or in the exercise, of any trust of power; and, in the absence of fraud, such receipt\nshall discharge the person paying, transferring or delivering, the same there from, and from seeing\ntothe application thereof, or being accountable for any loss or misapplication thereof."
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Power to compound, etc",
      "content": "(1) Two or more trustees acting together may, if they\nthink appropriate,-\n(a)   accept any composition or any security for any debt or for any property;\n(b)   allow any time for payment of any debt;\n(c)   compromise, compound, abandon, submit to arbitration or otherwise settle and debt,\naccount, claim or thing whatever relating to the trust; and\n(d)   for any of those purposes, enter into, give, execute and do such agreements,\ninstruments of composition or arrangement, releases and other things as to them seem\nexpedient, without being responsible for any loss occasioned by any act or thing so\ndone by them in good faith.\n(2)   The powers conferred by this section on two or more trustees acting together may be\nexercised by a sole acting trustee when by the instrument of trust, if any, a sole trustee is\nauthorized to execute the trusts and powers thereof.\n(3) This section applies only if and as far as a contrary intention is not expressed in the\ninstrument of trust, if any, and shall have effect subject to the terms of that instrument and to the\nprovisions therein contained."
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. Power to several trustees of whom one disclaims or dies",
      "content": "When an authority to\ndeal with the trust-property is given to several trustees and one of them disclaims or dies, the\nauthority may be exercised by the continuing trustees, unless from the terms of the instrument of\ntrust it is apparent that the authority is to be exercised by a number in excess of the number of the\nremaining trustees."
    },
    {
      "provision_ref": "sec57",
      "section": "57",
      "title": "Section 57. Suspension of trustee’s powers by decree",
      "content": "Where a decree has been made in a\nsuit for the execution of a trust, the trustee must not exercise any of his powers except in\nconformity with such decree, or with the sanction of the court by which the decree has been made,\nor, where an appeal against the decree is pending, of the Appellate Court."
    },
    {
      "provision_ref": "sec58",
      "section": "58",
      "title": "Section 58. Trustees cannot renounce after acceptance",
      "content": "A trustee who has accepted the Trust\ncannot afterwards renounce it except.—\n(a)   with the permission of a principal civil court of original jurisdiction, or\n(b)   if the beneficiary is competent to contract, with his consent, or\n(c)   by virtue of a special power in the instrument of trust."
    },
    {
      "provision_ref": "sec59",
      "section": "59",
      "title": "Section 59. Trustee cannot delegate",
      "content": "A trustee cannot delegate his office or any of his duties\neither to a co-trustee or to a stranger, unless—\n(a)   the instrument of trust so provides, or\n(b)   the delegation is in the regular course of business, or\n(c)   the delegation is necessary, or\n(d)   the beneficiary, being competent to contract, consents to t h e d e l e g a t i o n .\nExplanation.—The appointment of an attorney or proxy to do an act merely ministerial\nand involving no independent discretion is not a delegation within the meaning of this section."
    },
    {
      "provision_ref": "sec60",
      "section": "60",
      "title": "Section 60. Co",
      "content": "trustees cannot act singly.— When there are more trustees than one, all must\njoin in the execution of the trust, except where the instrument of trust otherwise provides."
    },
    {
      "provision_ref": "sec61",
      "section": "61",
      "title": "Section 61. Control of discretionary power",
      "content": "Where a discretionary power conferred on a\ntrustee is not exercised reasonably and in good faith, such power may be controlled by a principal\ncivil court of original jurisdiction."
    },
    {
      "provision_ref": "sec62",
      "section": "62",
      "title": "Section 62. Trustee may not charge for services",
      "content": "In the absence of express directions to the\ncontrary contained in the instrument of trust or of a contract to the contrary entered into with the\nbeneficiary or the court at the time of accepting the trust, a trustee has no right to remuneration\nfor his trouble, skill and loss of time in executing the trust. Nothing in this section applies to any\nofficial trustee, administrator general, public curator, or person holding a certificate of\nadministration."
    },
    {
      "provision_ref": "sec63",
      "section": "63",
      "title": "Section 63. Trustee may not use trust",
      "content": "property for his own profit.— A trustee shall not use\nor deal with the trust property for his own profit or for any other purpose unconnected with the\ntrust."
    },
    {
      "provision_ref": "sec64",
      "section": "64",
      "title": "Section 64. Trustee for sale or his agent may not buy",
      "content": "No trustee whose duty it is to sell\ntrust property and no agent employed by such trustee for the purpose of the sale, may, directly or\nindirectly, buy the same or any interest therein, on his own account or as agent for a third person."
    },
    {
      "provision_ref": "sec65",
      "section": "65",
      "title": "Section 65. Trustee may not buy beneficiary’s interest without permission",
      "content": "(1) No trustee\nand no person who has recently ceased to be a trustee, may, without the permission of a principal\ncivil court of original jurisdiction, buy or become mortgagee or lessee of the trust property or any\nparty thereof and such permission shall not be given unless the proposed purchase, mortgage or\nlease is manifestly for the advantage of the beneficiary.\n(2) No trustee whose duty it is to buy or to obtain a mortgage of lease of particular\nproperty for the beneficiary may buy it or any part thereof or obtain a mortgage or lease of it or\nany part thereof, for himself."
    },
    {
      "provision_ref": "sec66",
      "section": "66",
      "title": "Section 66. Cotrustee may not lend to one of themselves",
      "content": "A trustee or co- trustee whose\nduty, it is to invest trust-money on mortgage or personal security must not invest it on a mortgage\nby or on the personal security of himself, or one of his co-trustees."
    },
    {
      "provision_ref": "sec67",
      "section": "67",
      "title": "Section 67. Rights to rents and profits",
      "content": "The beneficiary has subject to the provisions of the\ninstrument of trust, a right to the rents and profits of the trust- property."
    },
    {
      "provision_ref": "sec68",
      "section": "68",
      "title": "Section 68. Right to specific execution",
      "content": "The beneficiary is entitled to have the intention of the\nauthor of the trust specifically executed to the extent of the beneficiary‘s interest.\n(2) Right to transfer of possession.— Where is only one beneficiary and he is competent\nto contract or where there are several beneficiaries and they are competent to contract and all are\nof one mind, he or they may require the trustee to transfer the trust property to him or them, or to\nsuch person as he or they may direct.\n(3) When property has been transferred or bequeathed for the benefit of a married woman,\nso that she shall not have power to deprive herself of her beneficial interest nothing in sub-section\n(2) applies to such property during her marriage."
    },
    {
      "provision_ref": "sec69",
      "section": "69",
      "title": "Section 69. Right to inspect and take copies of instrument of trust accounts, etc",
      "content": "The\nbeneficiary has a right, as against the trustee and all persons claiming under him with notice of the\ntrust to inspect and take copies of the instrument of trust, the documents of title relating solely to\nthe trust property, the accounts of the trust property and the vouchers if any by which they are\nsupported and the cases submitted and opinions taken by the trustee for his guidance in the\ndischarge of his duty."
    },
    {
      "provision_ref": "sec70",
      "section": "70",
      "title": "Section 70. Right to transfer beneficial interest",
      "content": "The beneficiary, if competent to contract,\nmay transfer his interest but subject to the law for the time being in force as to the circumstances\nand extent in and to which he may dispose of such interest:\nProvided that when property is transferred or bequeathed for the benefit of a married\nwoman, so that she shall not have power to deprive herself of her beneficial interest, nothing in\nthis section shall authorize her to transfer such interest during her marriage."
    },
    {
      "provision_ref": "sec71",
      "section": "71",
      "title": "Section 71. Right to sue for execution of trust",
      "content": "Where no trustees are appointed or all the\ntrustees die, disclaim, or discharged or where for any other reason the execution of a trust by the\ntrustee is or becomes impracticable, the beneficiary may institute a suit for the execution of the\ntrust and the trust shall, so far as may be possible, be executed by the Court until the\nappointment of atrustee or new trustee."
    },
    {
      "provision_ref": "sec72",
      "section": "72",
      "title": "Section 72. Right to proper trustees",
      "content": "(1) The beneficiary has a right subject to the provisions\nof the instrument of trust, that the trust property shall be properly protected and held and\nadministered by proper persons and by a proper number of such persons.\n(2) A person domiciled abroad, alien enemy, a person having an interest inconsistent\nwith that of the beneficiary, a person in insolvent circumstances; and unless the personal law of\nthe beneficiary allows otherwise and a minor are not proper persons under this section."
    },
    {
      "provision_ref": "sec73",
      "section": "73",
      "title": "Section 73. Right to compel to any act of duty",
      "content": "The beneficiary has a right that his trustee\nshall be compelled to perform any particular act of his duty as such and restrain from committing\nany contemplated or probable breach of trust."
    },
    {
      "provision_ref": "sec74",
      "section": "74",
      "title": "Section 74. Wrongful purchase by trustee",
      "content": "(1) Where a trustee has wrongfully bought trust\nproperty, the beneficiary has a right to have the property declared subject to the trust or\nretransferred by the trustee, if it remains in his hands unsold, or, if it has been bought from him\nby any person with notice of the trust, by such person. But in such case the beneficiary must repay\nthe purchase money paid by the trustee, with interest, and such other expenses, if any as he has\nproperly incurred in the preservation of the property and the trustee or purchaser must,—\n(a) account for the net profits of the property;\n(b) be charged with an occupation-rent, if he has been in actual possession of the\nproperty; and\n(c) allow the beneficiary to deduct a proportionate part of the purchase- money if the\nproperty has been deteriorated by the acts or omissions of the trustee or purchaser.\n(2)   Nothing in this section —\n(a)   impairs the rights of lessees and others who, before the institution of a suit to have\nfaith with the trustee or purchaser; or\n(b)   entitles the beneficiary to have the property declared subject to the trust or\nretransferred where he being competent to contract has himself, without coercion or\nundue influence having been brought to bear on him, ratified the sale to the trustee\nwith full knowledge of the facts of the case and of his rights as against the trustee."
    },
    {
      "provision_ref": "sec75",
      "section": "75",
      "title": "Section 75. Trust property into the hands of third person",
      "content": "(1) Where trust property comes\ninto the hands of a third person inconsistently with the trust, the beneficiary may require him to\nadmit formally, or may institute a suit or a declaration, that the property is comprised in the trust.\n(2) Where the trustee has disposed of trust property and the money or other property which\nhe has received therefore can be traced in his hands or the hands of his legal representative or\nlegatee, the beneficiary has in respect thereof, rights as merely as may be the same as his rights in\nrespect of the original trust property."
    },
    {
      "provision_ref": "sec76",
      "section": "76",
      "title": "Section 76. Saving of rights of certain transferees",
      "content": "Nothing in section 75 entitles the\nbeneficiary to any right in respect of property in the hands of —\n(a)   a transferee in good faith for consideration without having notice of the trust,\neither when the purchase-money was paid, or when the conveyance was\nexecuted, or\n(b)   a transferee for consideration from such a transferee.\n(2) A judgment creditor of the trustee attaching and purchasing trust property is not a\ntransferee for consideration within the meaning of this section.\n(3)   Nothing is section 75 applies to money currency notes, negotiable instruments in the\nhands of a bona fide holder to whom they have passed in circulation, or shall be deemed to affect\ncharge is transferred."
    },
    {
      "provision_ref": "sec77",
      "section": "77",
      "title": "Section 77. Acquisition by trustee of trust",
      "content": "property wrongfully converted.—Where a trustee\nwrongfully sells or transfers trust property and afterwards himself becomes the owner of the\nproperty, the property again becomes subject to the trust, notwithstanding any want of notice on\nthe part of intervening transferees in good faith for consideration."
    },
    {
      "provision_ref": "sec78",
      "section": "78",
      "title": "Section 78. Right in case of blended property",
      "content": "Where the trustee wrongfully mingles the trust\nproperty with his own, the beneficiary is entitled to a change on the whole fund for the amount\ndue to him."
    },
    {
      "provision_ref": "sec79",
      "section": "79",
      "title": "Section 79. Wrongful employment by partner",
      "content": "trustee.—(1) If a partner, being a trustee,\nwrongfully employs trust property in the business or on the account of the partnership, on other\npartner is liable therefore in his personal capacity to the beneficiaries, unless he had notice of the\nbreach of trust.\n(2) The partners having such notice are jointly and severally liable for the breach of trust."
    },
    {
      "provision_ref": "sec80",
      "section": "80",
      "title": "Section 80. Liability of beneficiary joining in breach of trust",
      "content": "(1) Liability of beneficiary in\ncommitting breach of trust arises where one of several beneficiaries—\n(a)   joins in committing breach of trust, or\n(b)   knowingly obtains any advantage there from, without the consent of the other\nbeneficiaries, or\n(c)   becomes aware of a breach of trust committed or intended to be committed, and either\nactually conceals it, or does not within a reasonable time take proper steps to protect\nthe interests of the other beneficiaries, or\n(d)   has deceived the trustee and thereby induced him to commit a breach of trust, the\nother beneficiaries are entitled to have all his beneficial interest impounded as against\nhim and all who claim under him, otherwise than as transferees for consideration\nwithout notice of the breach, until the loss caused by the breach has been\ncompensated.\n(2) When property has been transferred or bequeathed for the benefit of a married woman,\nso that she shall not have power to deprive herself of her beneficial interest, nothing in this section\napplies to such property during her marriage."
    },
    {
      "provision_ref": "sec81",
      "section": "81",
      "title": "Section 81. Rights and liabilities of beneficiary’s transferee",
      "content": "Every person to whom a\nbeneficiary transfers his interest has the rights and is subject to the liabilities of the beneficiary in\nrespect of such interest at the date of the transfer."
    },
    {
      "provision_ref": "sec82",
      "section": "82",
      "title": "Section 82. Office how vacated",
      "content": "The office of a trustee is vacated by his death or by his\ndischarge from his office."
    },
    {
      "provision_ref": "sec83",
      "section": "83",
      "title": "Section 83. Discharge of trustee",
      "content": "the trustee may be discharged from his office only as\nfollows—\n(a)   by the extinction of the trust;\n(b)    by the completion of his duties under the trust;\n(c)    by such means as may be prescribed by the instrument of trust;\n(d)    by appointment under this Act of a new trustee in his place;\n(e)    by consent of himself and the beneficiary, or, where there are more beneficiaries than\none, all the beneficiaries being competent to contract;\n(f)   by the executive order of the Director if any of the trustee:\n(i)   is convicted by a court in criminal case;\n(ii)   fails to fulfill any of the duty or obligation required under this Act; or\n(iii)   has been penalized under sections 17 (c) and (e) above; and\n(g)    by the court to which a petition for his discharge is presented under this Act."
    },
    {
      "provision_ref": "sec84",
      "section": "84",
      "title": "Section 84. Petition to be discharged from trust",
      "content": "Notwithstanding the provisions of section\n22, every trustee may apply by petition to a principal civil court of original jurisdiction to be\ndischarged from his office and if the court finds that there is sufficient reason for such discharge,\nit may discharge him accordingly and direct his costs to be paid out of the trust property. But\nwhere there is no such reason, the court shall not discharge him, unless a proper person can be\nfound to take his place."
    },
    {
      "provision_ref": "sec85",
      "section": "85",
      "title": "Section 85. Appointment of new trustees on death, etc",
      "content": "(1) Whenever any person appointed\na trustee disclaims of any trustee, either original or substituted, dies or is for a continuous period\nof six months absent from Pakistan, or leaves Pakistan for the purpose of residing abroad or is\ndeclared an insolvent or desires to be discharged from the trust or refuses or becomes in the\nopinion of a principal civil court of original jurisdiction unfit or personally incapable to act in the\ntrust or accepts an inconsistent trust, a new trustee may be appointed in his place by -\n(a) the person nominated for that purpose by the instrument or trust (if any), or\n(b) if there be no such person or no such person able and willing to act, the author of the\ntrust if he be alive and competent to contract or the surviving or continuing trustee\nor trustee for the time being, or legal representative of the last surviving and\ncontinuing trustee, or with the consent of the court, the retiring trustee, if they all\nretire simultaneously, or with the like consent, the last retiring trustee.\n(2)    Every such appointment shall be in writing under the hand of the person making it.\n(3)    On an appointment of new trustee the number of trustees may be increased.\n(4) The official trustee may, with his consent and by the order of the court, be appointed\nunder this section, in any case in which only one trustee is to be appointed and such trustee is to\nbe sole trustee.\n(5) The provisions of this section relative to a trustee who is a dead include the case of a\nperson nominated trustee in a will but dying before the testator and those relative to a continuing\ntrustee included refusing or retiring trustee if willing to act in the execution of the power."
    },
    {
      "provision_ref": "sec86",
      "section": "86",
      "title": "Section 86. Appointment by Court",
      "content": "(1) Whenever any such vacancy or disqualification\noccurs and it is found impracticable to appoint a new trustee under section 85, the beneficiary\nmay, without instituting a suit, apply by petition to a principal civil court of original jurisdiction\nfor the appointment of a trustee or a new trustee, and the Court may appoint a trustee or a new\ntrustee accordingly.\n(2) Rule for selecting new trustees.—In appointing new trustees, the court shall have\nregard:\n(a)   to the wishes of the author of the trust as expressed in or to be inferred from the\ninstrument of trust;\n(b)   to the wishes of the person, if any, empowered to appoint newtrustees;\n(c)   to the question whether the appointment shall promote or impede the execution of\nthe trust; and\n(d)   where there are more beneficiaries than one to the interests of all such beneficiaries."
    },
    {
      "provision_ref": "sec87",
      "section": "87",
      "title": "Section 87. Vesting of trust property in new trustees",
      "content": "(1) Whenever any new trustee is\nappointed under sections 85 or 86, all the trust property for the time being vested in the\nsurviving or continuing trustees or trustee or in the legal representative of any trustee shall\nbecome vested in such new trustee, either solely or jointly with the surviving or continuing\ntrustees or trustee as the case may require.\n(2) Power of new trustees.—Every new trustee so appointed and every trustee\nappointed by a court, either before or after the passing of this Act, shall have the same powers,\nauthorities and discretions and shall in all respects act, as if he had been originally nominated a\ntrustee by the author of the trust."
    },
    {
      "provision_ref": "sec88",
      "section": "88",
      "title": "Section 88. Survival of trust",
      "content": "On the death or discharge of one of several co- trustees, the trust\nsurvives and the trust property passes to the others, unless the instrument of trust expressly\ndeclares, otherwise."
    },
    {
      "provision_ref": "sec89",
      "section": "89",
      "title": "Section 89. Trust how extinguished",
      "content": "A trust is extinguished—\n(a)   when its purpose is completely fulfilled; or\n(b)   when the director considers and has sufficient reasons to believe that the activities\nof the trust are included in section 16 (b) of this Act and records reasons in the order\nto extinct the trust; or\n(c)   when the fulfillment of its purpose becomes impossible by destruction of the trust\nproperty or otherwise; or\n(d)   when the trust being revocable is expressly revoked:\nProvided that reasonable defense opportunity has been given to the trust in case\nof sub-section (c), above and the trust has the right of appeal to the department."
    },
    {
      "provision_ref": "sec90",
      "section": "90",
      "title": "Section 90. Revocation of trust",
      "content": "(1) A trust created under this Act shall be revoked at the\npleasure of the testator.\n(2)   A trust otherwise created can be revoked only –\n(a)   where all the beneficiaries are competent to contract by their consents;\n(b)    where the trust has been declared by non testamentary instrument or by word of\nmouth, in exercise of a power of revocation expressly reserved to the author of the\ntrust; or\n(c)   where the trust is for the payment of the debts of the author of the trust and has not\nbeen communicated to the creditors at the pleasure of the author of the trust.\nIllustration:— A conveys property to B in trust to sell the same and pay out of the proceeds\nthe claims of A‘s creditors. A reserves no power of revocation. If no communication has been\nmade to the creditors, A may revoke the trust. But if the creditors are parties to the arrangement,\nthe trust cannot be revoked without their consent."
    },
    {
      "provision_ref": "sec91",
      "section": "91",
      "title": "Section 91. Revocation not to defeat what trustees have duly done",
      "content": "No trust can be revoked\nby the author of the trust so as to defeat or prejudice, what the trustees may have duly done in\nexecution of the trust."
    },
    {
      "provision_ref": "sec92",
      "section": "92",
      "title": "Section 92. Obligation in nature of trust is created",
      "content": "An obligation in the nature of a trust is\ncreated in the cases mentioned in section 93."
    },
    {
      "provision_ref": "sec93",
      "section": "93",
      "title": "Section 93. Transferor intended to dispose of beneficial interest",
      "content": "Where the owner of\nproperty transfers or bequeaths and it cannot be inferred consistently with the attendant\ncircumstances that he intended to dispose of the beneficial interest therein, the transferee or\nlegatee must hold such property for the benefit of the owner or his legal representative."
    },
    {
      "provision_ref": "sec94",
      "section": "94",
      "title": "Section 94. Transfer to one for consideration paid by another",
      "content": "Where property is\ntransferred to one person for a consideration paid by another person and it appears that such other\nperson did not intend to pay or provide such consideration for the benefit of the transferee, the\ntransferee must hold the property for the benefit of the person paying or providing the\nconsideration. This section shall not affect, the provisions of the Code of Civil Procedure, 1908."
    },
    {
      "provision_ref": "sec95",
      "section": "95",
      "title": "Section 95. Trust incapable of execution without exhausting trust property",
      "content": "Where a trust\nis incapable of being executed or where the trust is completely executed without exhausting the\ntrust property, the trustee, in the absence of a direction to the contrary, must hold the trust\nproperty, or so much thereof as is unexhausted, for the benefit of the author of the trust or his\nlegal representative."
    },
    {
      "provision_ref": "sec96",
      "section": "96",
      "title": "Section 96. Transfer for illegal purpose",
      "content": "Where the owner of property transfers it to another\nfor an illegal purpose and such purpose is not carried into execution or the transferor is not as\nguilty as the transferee or the effect of permitting the transferee to retain the property might be\nto defeat the provisions of any law, the transferee must hold the property for the benefit of the\ntransferor."
    },
    {
      "provision_ref": "sec97",
      "section": "97",
      "title": "Section 97. Bequest for illegal purpose",
      "content": "(1) Where a testator bequeaths certain property upon\ntrust and the purpose of the trust appears on the face of the will to be unlawful, or during the\ntestator‘s life time the legatee agrees with him to apply the property for an unlawful purpose, the\nlegatee must hold the property for the benefit of the testator‘s legal representative.\n(2) Where property is bequeathed and the revocation of the bequest is prevented by\ncoercion, the legatee must hold the property for the benefit of the testator’s legal representative."
    },
    {
      "provision_ref": "sec98",
      "section": "98",
      "title": "Section 98. Transfer pursuant to rescindable contract",
      "content": "Where property is transferred in\npursuance of a contract which is liable to rescission or induced by fraud or mistake, the transferee\nmust, on receiving notice to that effect, hold the property for the benefit of the transferor, subject\nto repayment by the latter of the consideration actually paid."
    },
    {
      "provision_ref": "sec99",
      "section": "99",
      "title": "Section 99. Debtor becoming creditor’s representative",
      "content": "Where a debtor becomes the\nexecutor or other legal representative of his creditor, he must hold the debt for the benefit of the\npersons interested therein."
    },
    {
      "provision_ref": "sec100",
      "section": "100",
      "title": "Section 100. Advantage gained by fiduciary",
      "content": "Where a trustee, executor, partner, agent,\ndirector of a company, legal advisor, or other person bound in a fiduciary character to protect the\ninterests of another person, by availing himself of his character, gains for himself any pecuniary\nadvantage or where any person so bound enters into any dealings under circumstances in which\nhis own interests are or may be, adverse to those of such other person and thereby gains for\nhimself a pecuniary advantage, he must hold for the benefit of such other person the advantage\nso gained."
    },
    {
      "provision_ref": "sec101",
      "section": "101",
      "title": "Section 101. Advantage gained by exercise of undue influence",
      "content": "Where, by the exercise of\nundue influence, any advantage is gained in derogation of the interests of another, the person\ngaining such advantage without consideration, or with notice that such influence has been\nexercised, must hold the advantage for the benefit of the person whose interests have been so\nprejudiced."
    },
    {
      "provision_ref": "sec102",
      "section": "102",
      "title": "Section 102. Advantage gained by qualified owner",
      "content": "Where a tenant for life, co-owner,\nmortgagee or other qualified owner of any property by availing himself of his position as such\ngains an advantage in derogation of the rights of the other persons interested in the property or\nwhere any such owner, as representing all persons interested in such property, gains any\nadvantage, he must hold for the benefit of all persons so interested, the advantage so gained, but\nsubject to repayment by such persons of their due share of the expenses properly incurred and to\nan indemnity by the same persons against liabilities properly contracted in gaining such\nadvantage."
    },
    {
      "provision_ref": "sec103",
      "section": "103",
      "title": "Section 103. Property acquired with notice of existing contract",
      "content": "Where a person acquires\nproperty with notice that another person has entered into an existing contract affecting that\nproperty of which specific performance could be enforced, the former must hold the property for"
    },
    {
      "provision_ref": "sec104",
      "section": "104",
      "title": "Section 104. Property to be held on trust",
      "content": "Where a person contracts to buy property to be held\non trust for certain beneficiaries and buys the property accordingly, he must hold the property for\ntheir benefit to the extent necessary to give effect to the contract."
    },
    {
      "provision_ref": "sec105",
      "section": "105",
      "title": "Section 105. Advantage secretly gained by one of several compounding creditors",
      "content": "Where\ncreditors compound the debts due to them and one of such creditors, by a secret arrangement with\nthe debtor, gains an undue advantage over his co-creditors, he must hold for the benefit of such\ncreditors the advantage so gained."
    },
    {
      "provision_ref": "sec106",
      "section": "106",
      "title": "Section 106. Constructive trusts in cases not expressly provided for",
      "content": "In any case not coming\nwithin the scope of any of the preceding sections, where there is no trust, but the person having\npossession of property has not the whole beneficial interest therein, he must hold the property for\nthe benefit of the person s having such interest, or the residue thereof, as the case may be to the\nextent necessary to satisfy their just demands."
    },
    {
      "provision_ref": "sec107",
      "section": "107",
      "title": "Section 107. Obligator’s duties, liabilities and disabilities",
      "content": "The person holding property in\naccordance with any of the preceding sections of this Chapter must, so far as may be, perform\nthe same duties, and is subject so far as may be to the same liabilities and disabilities, as if he\nwere a trustee of the property for the person for whose benefit he holds it:\nProvided that where he rightfully cultivates the property or employs it in trade or business,\nhe is entitled to reasonable remuneration for his trouble, skill and loss of time in such cultivation\nor employment:\nProvided further that where he holds the property by virtue of a contract with a person for\nwhose benefit he holds it or with any one through whom such person claims, he may, without the\npermission of the court, buy or become lessee or mortgagee of the property or any part thereof."
    },
    {
      "provision_ref": "sec108",
      "section": "108",
      "title": "Section 108. Saving of rights of bona fide purchasers",
      "content": "Nothing contained in this Chapter shall\nimpair the rights of transferees in good faith for consideration or create an obligation in evasion\nof any law for the time being in force.\nMiscellaneous"
    },
    {
      "provision_ref": "sec109",
      "section": "109",
      "title": "Section 109. Power to make rules",
      "content": "Subject to the approval of the Federal Government, the\nChief Commissioner of Islamabad Capital Territory shall make rules to carry out the purposes of\nthis Act within a period not later than the sixty days from the date of enactment of this Act."
    },
    {
      "provision_ref": "sec110",
      "section": "110",
      "title": "Section 110. Power to interpret",
      "content": "(1) The Chief Commissioner, Islamabad Capital Territory,\nIslamabad can exercise arbitrary powers to clarify any confusion arising out of the interpretation\nof the sections of this Act:\nProvided that the secretary must—\n(a)   refer to the illustrations or explanations mentioned in the Trust Act 1882; and\n(b)   consult the Law, Parliamentary Affairs and Human Rights department.\n(2) Nothing contained in this section may be interpreted contrary to the judgments of High\nCourts or Supreme Court of Pakistan, as the case may be."
    },
    {
      "provision_ref": "sec111",
      "section": "111",
      "title": "Section 111. Repeal",
      "content": "The Trust Act, 1882 (II of 1882) is hereby repealed to the extent of\nIslamabad Capital Territory, Islamabad."
    },
    {
      "provision_ref": "sec112",
      "section": "112",
      "title": "Section 112. Saving",
      "content": "(1) Notwithstanding the aforesaid repeal in section 111 above, anything\ndone, action taken, rules made or notifications issued under the aforesaid Act, so far as it is not\ninconsistent with the provisions of this Act, shall be deemed to have been made, done or taken\nunder this Act and shall have effect accordingly.\n(2) Any document referring to the repealed Act shall be construed as referring to\ncorresponding provisions of this Act:\nProvided that all the Trusts registered in Islamabad Capital Territory under the repealed\nAct shall be freshly registered under this Act within a period of six months.\n_________________\nRGN Dated: 22-10-2025"
    }
  ],
  "definitions": [
    {
      "term": "author of the trust",
      "definition": "the natural person who reposes or declares the confidence and assigns the property to the trustee for the benefit of beneficiary;",
      "source_provision": "sec2"
    },
    {
      "term": "beneficiary",
      "definition": "the natural person who benefits the confidence of the trust;",
      "source_provision": "sec2"
    },
    {
      "term": "breach of trust",
      "definition": "breach of any duty imposed on trustee as such by any law for the time being in force;",
      "source_provision": "sec2"
    },
    {
      "term": "competent authorities",
      "definition": "the ‘regulators’, “the oversight bodies for SRBs as specified in the Anti-Money Laundering Act, 2010 (VII of 2010)”, “the investigating or prosecuting agency” and “the Financial Monitoring Unit”;",
      "source_provision": "sec2"
    },
    {
      "term": "department",
      "definition": "the directorate of labour and industries, Islamabad Capital Territory;",
      "source_provision": "sec2"
    },
    {
      "term": "director",
      "definition": "the director of directorate of labour and industries, Islamabad Capital Territory;",
      "source_provision": "sec2"
    },
    {
      "term": "district intelligence coordination committee",
      "definition": "the intelligence committee headed by the deputy commissioner or district magistrate, Islamabad Capital Territory, Islamabad and comprising the representatives of police and intelligence agencies;",
      "source_provision": "sec2"
    },
    {
      "term": "financial monitoring unit",
      "definition": "the financial monitoring unit specified under the Anti-Money Laundering Act, 2010 (VII of 2010);",
      "source_provision": "sec2"
    },
    {
      "term": "home department",
      "definition": "the office of the Chief Commissioner, Islamabad Capital Territory;",
      "source_provision": "sec2"
    },
    {
      "term": "instrument of the trust",
      "definition": "the instrument by which the trust is declared;",
      "source_provision": "sec2"
    },
    {
      "term": "interest",
      "definition": "the beneficiary’s right against the trust property;",
      "source_provision": "sec2"
    },
    {
      "term": "investigating or prosecuting agency",
      "definition": "an investigating or prosecuting agency as specified in the Anti-Money Laundering Act, 2010 (VII of 2010);",
      "source_provision": "sec2"
    },
    {
      "term": "law department",
      "definition": "directorate of law, Chief Commissioner’s office, Islamabad Capital Territory;",
      "source_provision": "sec2"
    },
    {
      "term": "notice",
      "definition": "a person is said to have known of a fact either when he actually knows that fact, or when, but for willful abstention from inquiry or gross negligence, he would have known it, or when information of the fact is given to or obtained by his agent, under the circumstances mentioned in the Contract Act,1872 (IX of 1872), and all expressions used herein and defined in the Contract Act,1872 (IX of 1872), shall be deemed to have the meanings respectively attributed to them by that Act;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "provincial government",
      "definition": "the government defined under Presidential Order No. 1 of 1980;",
      "source_provision": "sec2"
    },
    {
      "term": "purpose",
      "definition": "any lawful purpose unless it is— (i) forbidden by law; or (ii) is of such a nature that, if permitted, it would defeat the provisions of any law; or (iii) is fraudulent; or (iv) involves or implies injury to the person or property of another; or (v) the court regards it as immoral or opposed to public policy;",
      "source_provision": "sec2"
    },
    {
      "term": "registered",
      "definition": "registered with the director;",
      "source_provision": "sec2"
    },
    {
      "term": "reporting entity",
      "definition": "an entity specified under the Anti-Money Laundering Act, 2010;",
      "source_provision": "sec2"
    },
    {
      "term": "revenue department",
      "definition": "office of the district collector, Islamabad Capital Territory;",
      "source_provision": "sec2"
    },
    {
      "term": "trust",
      "definition": "an obligation annexed to the ownership of property and rising out of the confidence reposed in and accepted by the owner or declared and accepted by him for the benefit of beneficiary;",
      "source_provision": "sec2"
    },
    {
      "term": "trustee",
      "definition": "any person who accepts the confidence of the author of the trust to the benefit of the beneficiary; and",
      "source_provision": "sec2"
    },
    {
      "term": "trust property",
      "definition": "the subject matter of the trust; it may be movable or immovable property.",
      "source_provision": "sec2"
    }
  ]
}
