{
  "id": "pk-islamabad-consumers-protection-act-1995",
  "type": "statute",
  "title": "Islamabad Consumers Protection Act, 1995",
  "title_en": "Islamabad Consumers Protection Act, 1995",
  "short_name": "ICPA",
  "status": "in_force",
  "issued_date": "1995-11-30",
  "in_force_date": "1995-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apqVYw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Islamabad Consumers Protection Act, 1995 (III of 1995) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the\nIslamabad Consumers Protection Act, 1995.\n(2) It extends to the Islamabad Capital Territory.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or",
      "content": "context,—\n(a)      “Authority” means the Court of Sessions, Islamabad;\n(b)      “complaint” means—\n(i)    a consumer;\n(ii)    a consumer’s association; and\n(iii)   the Federal Government, Chief Commissioner, Islamabad Capital Territory,\nCapital Development Authority, or any person or agency authorized by\nthe aforesaid on their behalf to file complaint before the Authority;\n(c)      “consumer” means any person who—\n(i)     buys goods for a consideration which has been paid or partly paid and\npartly promised to be paid or under any system of deferred payment or\nhire purchase and includes any user of such goods but does not include a\nperson who obtains such goods for re-sale or for any commercial purpose;\nor\n(ii)  hires any goods or services for a consideration which has been paid or\npromised or partly paid and partly promised or under any system of\ndeferred payment and includes any beneficiary of such services.\n(d)      “Council” means the Consumers’ Protection Council, Islamabad; established\nunder section 3;\n(e)      “Services” includes services of any description which is made available to\npotential users and includes the provision of facilities in connection with\nbanking, financing, insurance, transport, manufacturing, processing,\naccountancy, supply of electrical, mechanical or any other form of energy,\nboarding or lodging, entertainment, medicine, education, construction\nwork, amusement, catering, security, or purveying a news or other information,\nand similar other services, but does not include the rendering of any service free\nof charge or under the contract of personal service; and\n(f)   “unfair trade practice” means a trade practice which, for the purpose of\nsale, use or supply of any goods, or for provision of any service or for\ntheir promotion, adopts one or more of the following practices, causes loss or\ninjury though hoarding, black-marketing, adulteration, selling of expired drugs,\nfood items and commodities unfit for human consumption, or charging for the\ngoods and service in excess of the prices fixed by an authority authorized to\ndo so under any law for the time being in force or in furtherance of such sale,\nuse or supply makes any statement, whether orally or in writing, or by\nchalking on walls or through sign-boards or neon-sign or by distributing\npamphlets or by publication in any manner, including through electronic media,\nby—\n(i)     falsely representing that the goods or, as the case may be,\nservices are of a particular standard, quality, quantity, grade,\ncomposition, style or mode;\n(ii)    falsely representing any rebuilt, second-hand, renovated, reconditioned\nor old goods as new goods;\n(iii)   falsely representing that the goods or, as the case may be, services\nhave sponsorship or approval of the competent agency or authority\nor possesses specified characteristics, performance,     accessories,\nuses or benefits which such goods or services do not have;\n(iv)    falsely representing that the goods or services offered fulfil the\nprescribed standard fixed by local or international authorities;\n(v)      giving misleading representation of the need for, or the usefulness of\nany goods or services;\n(vi)      falsely giving to the public any warrantly or guarantee of the\nperformance, specification, required ingredients, efficacy or length of\nlife of a product or any goods that is not based on an adequate or\nproper tests thereof;\n(vii)   falsely offering for sale or on lease any premises, house, shop or\nbuilding with specified facilities or with the promise to deliver\npossession thereof within a specified period or without any escalation\nin price or by falsely representing that such premises, house, shop or\nbuilding is being sold, built or constructed in accordance with the\napproved plans, specification and approval of the concerned\nauthorities;\n(viii) misleading the public concerning the price at which a product or\nproducts or goods or services have been, or are ordinarily sold or\nprovided;\n(ix)     giving false or misleading facts regarding facilities available in\nthe private educational institutions or falsely representing that such\ninstitutions have proper approval of the concerned authorities;\n(x)      falsely representing for provision of services by professionals and\nexperts, including by doctors, engineers, advocates, mechanics,\nteachers, hakeems and spiritual healers;\n(xi)     giving false or misleading facts disparaging the goods, services or trade\nof another person, firms, company or business concern;\n(xii) advertising for the sale or supply at a bargain price of goods or services\nwhich are not intended to be offered for sale or supply at such price;\n(xiii) offering of gifts, prizes or other items with the intention of not\nproviding them as offered or creating the impression that something is\nbeing given or offered free of charge when it is fully or partly\ncovered by the amount charged in the transaction; and\n(xiv) falsely gives description of commodities and services offered through\nmail order."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. The Council",
      "content": "(1) As soon as may be, after the commencement of this Act, the\nFederal Government may, by notification in the official Gazette, establish the Consumers\nProtection Council, Islamabad.\n(2) The Council shall consist of the following :—\n(i)          The Chairman, to be appointed by the Federal Government Chairman\nfrom amongst prominent social workers permanently residing\nat Islamabad.\n(ii)         Members of Parliament representing Islamabad Capital       Member\nTerritory;\n(iii)        Chief Commissioner, Islamabad Capital Territory, Islamabad;        Member\n(iv)         Chairman, Capital Development Authority;                           Member\n(v)          three representatives of the Consumers Associations in             Member\nIslamabad;\n(vi)         a representative of the Ministry of Interior who shall not be      Member\nbelow the rank of Joint Secretary;\n(vii)        a representative of the shopkeepers, vendors or manufacturers      Member\nas recommended by the Chamber of Commerce and\nIndustries, Islamabad;\n(viii) a representative of the Finance Division who shall not be                Member\nbelow the rank of Joint Secretary;\n(ix)    a representative of the Ministry of Health who shall not be         Member\nbelow the rank of Joint Secretary;\n(x)     a representative of Ministry of Food, Agriculture and               Member\nLivestock who shall not be below the rank of Joint Secretary;\n(xi)    a representative of the Ministry of Industries and                  Member\nproduction who shall not be below the rank of Joint\nSecretary;\n(xii)   a lady social worker permanently residing at Islamabad to be        Member\nappointed by the Federal Government.\n(3) The existence of a vacancy in, or defect in the constitution of, the Council shall not\ninvalidate any act or proceedings of the Council."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Meetings of the Council",
      "content": "(1) The Council shall meet as and when necessary and at\nsuch time and place as the Chairman may fix:\nProvided that not more than a period of two months shall intervene between the two\nmeetings of the Council.\n(2) In absence of the Chairman, the Members present in the meeting shall elect one of the\nmembers to act as Chairman.\n(3) The quorum of the meeting of the Council shall be four members."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Objects and functions of the Council, etc.―(1) The objects and functions of the Council",
      "content": "shall be to determine, promote and protect rights of consumers, including—\n(a)    the right of protection against marketing of goods which are hazardous to life and\nproperty;\n(b)    the right of information about the quality, quantity, potency, purity, standard and\nprice of goods and services;\n(c)    the right of access to a variety of goods at competitive prices;\n(d)    the right for redressal against unfair trade practices of unscrupulous exploitation of\nconsumers;\n(e)    the right of Consumers’ education; and\n(f)    the right of easy availability of essential services.\n(2) The Council shall be responsible for formulation of the policies for promotion and\nprotection of the rights of consumers, fair and honest trade practices by the manufacturers, producers\nand suppliers of goods and services in relation to interest of consumers and their effective\nimplementation;\n(3) For promotion and protection of the interests of consumers, the Council shall coordinate\nbetween the Government, manufacturers, producers, suppliers and consumers."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Authority",
      "content": "(1) The Authority shall receive complaints of the consumers and those made\non behalf of the council for investigation and determination thereof.\n(2) The Police, Capital Development Authority and other agencies of the Federal Government\nand Islamabad Capital Territory Administration shall act in aid of the Authority for performance of\nits functions under this Act."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Prohibition of false advertisement etc",
      "content": "(1) Notwithstanding anything contained in any\nother law for the time being in force, no company, firm or person shall advertise in any manner\nnot authorised by law for the sale or hiring of goods or services or any property, movable or\nimmovable, or solicit deposits for repayment at higher rates of profits or interest and thereby causes\nloss to any consumer, whether financial or otherwise.\n(2) Notwithstanding any punishment provided for making misrepresentation, false or\nmisleading advertisement in any other law for the time being in force, the company, firm or a person\nmaking such advertisement shall be liable to pay such compensation as the Authority may direct for\ncausing loss to the person affected by such advertisement."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Procedure for disposal of the complaints",
      "content": "(1) A complainant may in respect of any\ngoods sold or delivered or any service provided or supplied or against any unfair trade practice file a\ncomplaint with the Authority.\n(2) The Council may, in the case of any unfair trade practice coming to its notice, directly\nmake complaint to the Authority through an officer authorised by it.\n(3) Where on examination of the complaint received under sub- section (1) or sub-\nsection (2), the Authority is of the opinion that any right of the consumer has been infringed, it\nshall cause the notice of the complaint to be served on the respondent who shall be required to give\nhis reply within a period of seven days.\n(4) After considering the complaint and the reply of the respondent and after providing the\nparties and opportunity of being heard, or if no reply is received and after such enquiry as the\nAuthority may deem appropriate it may pass such orders as the circumstance may require.\n1\n[8A. Power to try summarily.―(1)Without prejudice to the foregoing provisions and in\naddition to the powers exercisable by the Authority where any right of a consumer is infringed or\ncontravened by way of profiteering, hoarding, black- marketing, adulteration of food items, selling of\nexpired items of food and other item unfit for human consumption or charging for goods and services\nin excess of the prices fixed by the competent authority under any law for the time being in force, it\nshall be tried by a special Magistrate appointed under section 14A of the Code of Criminal\nProcedure, 1898, (Act VI of 1898) in a summary manner as provided in sections 262 to 265 of the\nsaid Code:\nProvided that sub-section (2) of section 265, shall not apply.\n(2) If a Special Magistrate has reason to believe that any infringement or contravention of any\nright of consumer as stated in sub-section (1) punishable under this Act has been committed by any\nperson, he may enter the place or premises where the infringement or contravention has been\ncommitted and try the same or the spot and punish the defaulter within imprisonment which may\nextend to six months or fine which may extend to fifty thousand rupees or with both.\n1\nInsert sec.8A by Act III of 2012, s.2\n(3) Any person aggrieved by the order of special Magistrate may, within fifteen days prefer\nan appeal to the Authority.]"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Penalties",
      "content": "(1) Where any right of consumer required to be protected under section 5 of\nthe Act is in any way infringed, the person responsible for such infringement shall be punished\nwith imprisonment which may extend to two years, or with fine which may extend to forty\nthousand rupees, or with both.\n(2) Whoever makes advertisement through print or electronic-media or by chalking on walls\nor in any other manner in contravention of section 7, he shall be punished with imprisonment which\nmay extend to two years, or with fine which may extend to thirty thousand rupees, or with both.\n(3) The Authority may, where it deems appropriate, order for payment of compensation to the\nconsumer to the extent the consumer has suffered any damage or loss through any unfair trade\npractice.\n(4) The Authority may, where it deems necessary for protection of the rights of other\nconsumers, order for confiscation of any goods or material or direct for their destruction."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Appeal. An appeal against the order of Authority shall lie to the High Court and the",
      "content": "provisions of the Code of Criminal Procedure, 1898 (V of 1898) in respect of appeals to the High\nCourt shall, mutatis mutandis, apply."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Immunity of the Council, etc. No suit, prosecution and other legal proceedings shall",
      "content": "lie against the Council, its members, the Authority and other officers and authorities acting under\nthe directions of the Council or, as the case may be, the Authority in expect of anything done under"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Rules. The Federal Government may, by notification in the official Gazette, make rules",
      "content": "for carrying out the purposes of this Act.\n_______________"
    }
  ],
  "definitions": [
    {
      "term": "Authority",
      "definition": "the Court of Sessions, Islamabad;",
      "source_provision": "sec2"
    },
    {
      "term": "consumer",
      "definition": "any person who— (i) buys goods for a consideration which has been paid or partly paid and partly promised to be paid or under any system of deferred payment or hire purchase and includes any user of such goods but does not include a person who obtains such goods for re-sale or for any commercial purpose; or (ii) hires any goods or services for a consideration which has been paid or promised or partly paid and partly promised or under any system of deferred payment and includes any beneficiary of such services.",
      "source_provision": "sec2"
    },
    {
      "term": "Council",
      "definition": "the Consumers’ Protection Council, Islamabad; established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Services",
      "definition": "services of any description which is made available to potential users and includes the provision of facilities in connection with banking, financing, insurance, transport, manufacturing, processing, accountancy, supply of electrical, mechanical or any other form of energy, boarding or lodging, entertainment, medicine, education, construction work, amusement, catering, security, or purveying a news or other information, and similar other services, but does not include the rendering of any service free of charge or under the contract of personal service; and",
      "source_provision": "sec2"
    },
    {
      "term": "unfair trade practice",
      "definition": "a trade practice which, for the purpose of sale, use or supply of any goods, or for provision of any service or for their promotion, adopts one or more of the following practices, causes loss or injury though hoarding, black-marketing, adulteration, selling of expired drugs, food items and commodities unfit for human consumption, or charging for the goods and service in excess of the prices fixed by an authority authorized to do so under any law for the time being in force or in furtherance of such sale, use or supply makes any statement, whether orally or in writing, or by chalking on walls or through sign-boards or neon-sign or by distributing pamphlets or by publication in any manner, including through electronic media, by— (i) falsely representing that the goods or, as the case may be, services are of a particular standard, quality, quantity, grade, composition, style or mode; (ii) falsely representing any rebuilt, second-hand, renovated, reconditioned or old goods as new goods; (iii) falsely representing that the goods or, as the case may be, services have sponsorship or approval of the competent agency or authority or possesses specified characteristics, performance, accessories, uses or benefits which such goods or services do not have; (iv) falsely representing that the goods or services offered fulfil the prescribed standard fixed by local or international authorities; (v) giving misleading representation of the need for, or the usefulness of any goods or services; (vi) falsely giving to the public any warrantly or guarantee of the performance, specification, required ingredients, efficacy or length of life of a product or any goods that is not based on an adequate or proper tests thereof; (vii) falsely offering for sale or on lease any premises, house, shop or building with specified facilities or with the promise to deliver possession thereof within a specified period or without any escalation in price or by falsely representing that such premises, house, shop or building is being sold, built or constructed in accordance with the approved plans, specification and approval of the concerned authorities; (viii) misleading the public concerning the price at which a product or products or goods or services have been, or are ordinarily sold or provided; (ix) giving false or misleading facts regarding facilities available in the private educational institutions or falsely representing that such institutions have proper approval of the concerned authorities; (x) falsely representing for provision of services by professionals and experts, including by doctors, engineers, advocates, mechanics, teachers, hakeems and spiritual healers; (xi) giving false or misleading facts disparaging the goods, services or trade of another person, firms, company or business concern; (xii) advertising for the sale or supply at a bargain price of goods or services which are not intended to be offered for sale or supply at such price; (xiii) offering of gifts, prizes or other items with the intention of not providing them as offered or creating the impression that something is being given or offered free of charge when it is fully or partly covered by the amount charged in the transaction; and (xiv) falsely gives description of commodities and services offered through mail order.",
      "source_provision": "sec2"
    }
  ]
}
