{
  "id": "pk-islamabad-healthcare-regulation-act-2018-act-no-xxiii-of-2018",
  "type": "statute",
  "title": "Islamabad Healthcare Regulation Act, 2018 (Act No_ XXIII of 2018)",
  "title_en": "Islamabad Healthcare Regulation Act, 2018 (Act No_ XXIII of 2018)",
  "short_name": "IHRAN",
  "status": "in_force",
  "issued_date": "2018-03-13",
  "in_force_date": "2018-03-13",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Nob5s%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Islamabad Healthcare Regulation Act, 2018 (Act No_ XXIII of 2018) (XXIII of 2018) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, commencement and application",
      "content": "(1) This Act may be called the\nIslamabad Healthcare Regulation Act, 2018.\n(2) It extends to the whole of the Islamabad Capital Territory.\n(3) It shall come into force at once.\n(4) It shall apply to all healthcare establishments in the Islamabad Capital Territory."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(i)     “accreditation” means systemic quality improvement process which ensures\nthat services provided meet the notified practices;\n(ii)    “assessor” means an expert or group of experts commissioned by the Authority\nor any other recognized institution or organization for assessment of quality of\na healthcare establishment;\n(ii)    “allied health professional” means a person who assists in providing services\nfor diagnostic, therapeutic, preventive, curative and rehabilitative field in health\ncare delivery system and has qualified a prescribed course of training in an\nrecognized institution having recognition from their respective council;\n(iv)    “allopathic” means a system of medical practice that aims to combat disease by\nuse of remedies, as drugs or surgery, producing effects different from or\nincompatible with those produced by the disease being treated;\n(v)     “alternative medicine system” means unani, tibb, ayurveda, homoeopathic,\nacupuncture or any other recognized system of treatment of diseases in Pakistan;\n(vi)    “Authority” means Islamabad Healthcare Regulatory Authority established\nunder section 3;\n(vii)   “Board” means the Board of the Authority constituted under section\n(viii) “Chairperson” means the chairperson of the Board;\n(ix)    “chief executive officer “means the chief executive officer of the Authority;\n(x)     “council” means the Pakistan Medical and Dental Council, the Pakistan Nursing\nCouncil, the National Council for Homeopathy, the National Council for Tibb,\nthe Phannacy Council or such other Councils established by Federal\nGovernment to regulate various cadre of. healthcare professional and notified\nin official Gazette under this clause;\n(xi)    “Council for Homeopathy” means the National Council for Homeopathy\nestablished under the Unani, Ayurvedic and Homoeopathic Practitioners Act,\n1965 (II of 1965);\n(xii)   “Council for Tibb” means the National Council for Tibb established under the\nUnani, Ayurvedic and Homoeopathic Practitioners Act, 1965 (I of 1965);\n(xiii) “equipment” includes all electrical, electronic, mechanical, laser, scanning, x-\nray, imaging, analyzing and testing machinery, equipment, device, tools,\napparatus, including various utensils and related material and chemical or other\nsubstances which are used to determine the performance, functionality,\ndisorder, ailment or any other effect on state of health of human;\n(xiv)   “Fund “means the Islamabad Healthcare Regulatory Authority Fund established\nunder section 37;\n(xv)    “healthcare establishment” means any premises used or intended to be used for\nthe provision of healthcare services, including but not limited to a hospital,\nteaching hospitals, surgical centers, maternity homes, nursing homes, clinics,\ndispensaries, dentistries, dental clinics, clinical laboratories, x-ray laboratories,\ndiagnostic centers, ambulatories, cosmetic centers, psychiatric hospitals, bum\nunits, psychiatric nursing home, community mental health center, hemodialysis\ncenter, dialysis center, patient rehabilitation center, slimming clinic or centre,\nhair transplant clinic, domiciliary care, home based services and such other\nhealthcare or health-related premises as the Federal Government may, by\nnotification in the official Gazette, specify;\n(xvi)   “healthcare professional” means a medical practitioner and dentist registered\nwith the Pakistan Medical and Dental Council, nurse, midwife, community\nmidwife, female family workers or lady health visitor registered with the\nPakistan Nursing Council, a tabib registered with the National Council for Tibb\nor homeopathic practitioner registered with the National Council for\nHomeopathy or pharmacist registered under the Pharmacy Council of Pakistan\nAct, 1967 (XI of 1967) or paramedic, allied health professional or\nphysiotherapist, psychologist or any other person qualified and permitted by law\nto provide any medical, surgical treatment or other healthcare service as well as\nany person qualified to perform any health related test on human body or test\nanybody fluid under a laboratory process and provide results of such test to\nconfirm or determine any health condition or physical or mental ailment;\n(xvii) “healthcare services” include any medical, surgical, dental, allied health,\nambulatry, patient accommodation, screening or diagnostic services, treatment\nof persons suffering from or believed to be suffering from any disease, injury,\npain or disability of mind or body, burn or hurt treatment, wound dressing,\nphysiotherapy, acupuncture, any service for curing or alleviating any abnormal\ncondition of human body or mind by application of any apparatus, equipment,\ninstrument or device or any other medical technique or method, hemodialysis\ntreatment, preventive or promotive health treatment, services at healthcare\nestablishments by healthcare professional;\n(xviii) “in-charge of a healthcare establishment” means the owner or person\nresponsible for management of day to day affairs of a healthcare establishment\nwhich are owned and operated by private persons, natural or corporate, or\nGovernment in any premises;\n(xix)   “inspection” means the inspection and examination of the healthcare\nestablishment by an inspection team;\n(xx)    “inspection team” means a team comprising more than two experts having\nrelevant qualifications and experience constituted by the Registration Board;\n(xxi)   “licence” means a licence issued by the Authority under this Act for the use of\nany premises as a healthcare establishment to deliver healthcare services and\n“licensed “ and ''licensing “ shall be construed accordingly;\n(xxii) “licensee” means a person to whom licence has been issued under this Act;\n(xxii) “Medical and Dental Council” means the Medical and Dental Council\nconstituted under the Medical and Dental Council Ordinance, 1962 (XXXII of\n1962);\n(xxiv) “medical negligence” means any negligence by an act or omission of a\nhealthcare professional in perfonning his duty. In medical negligence cases it\nhas to be established that—\n(a)    there was a duty which the healthcare professional owed to the patient;\n(b)    there was a breach of duty;\n(c)    the breach resulted in injury to the patient; and\n(d)    the injury resulted in causing damage or death;\n(xxv) “Nursing Council” means the Pakistan Nursing Council established under the\nPakistan Nursing Council Act, 1973 (XXVI of 1973);\n(xxvi) “notified practices” mean all such healthcare services provision, best measures,\npractices, protocols, standing operating procedures, medical and clinical\nhygiene standards or specifications, quarantine standards, patient handling and\ncare standards and principles of medical ethics developed by national or\ninternational organizations collected and published by the Authority from time\nto time to act as a guiding document for service provision in a healthcare\nestablishment;\n(xxvii) “patient data” means the details of a patient to whom any healthcare services\nare offered or provided in a healthcare establishment or by a healthcare\nprofessional, as the case may be, containing details of results of diagnosis of\ndisease or ailment, tests or examinations conducted, medicines prescribed or\nadministered, any surgical treatment or procedures performed as well as dates\nof admission and discharge of the patient etc.;\n(xxviii) “prescribed” means prescribed by rules or regulations made under this Act;\n(xxix) “quack” means any person who is rendering any healthcare services to a person\nwithout getting itself registered under respective Councils or otherwise not\nauthorized or permitted by any law to offer or render such kind of healthcare\nservices;\n(xxx) “registration” means registration under section 14;\n(xxxi) “regulations” means the regulations made under this Act;\n(xxxii) rules “means rules made under this Act;\n(xxxiii) “Registration Board means the Registration Board constituted under this Act\nfor registration of healthcare establishments; and\n(xxxiv) “standards” means standards notified by the Authority for licensing of\nhealthcare establishment."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of Islamabad Healthcare Regulatory Authority",
      "content": "(1) The Federal\nGovernment shall, within one month of the commencement of this Act and by notification in the\nofficial Gazette, establish the Islamabad Healthcare Regulatory Authority which shall be responsible\nfor implementation, administration and enforcement of this Act.\n(2) The Authority shall be a body corporate having perpetual succession and a common seal\nwith powers to enter into contract, hold properties, sue and be sued by its name.\n(3) The principal office of the Authority shall be at Islamabad."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers and functions of the Authority",
      "content": "(I) The Authority shall have following powers\nand functions, namely:\n(a)     maintain register of all healthcare establishment;\n(b)   set standards for registration and licensing of healthcare establishments for the\npurpose of this Act;\n(c)   registration of all healthcare establishments, health professional and equipment-\n: and their notification in the official Gazette;\n(d)   issuance of license for defining scope and extent of healthcare services to be\nprovided by a healthcare establishment;\n(e)   enforce minimum standards of safety for patient, healthcare professional and\nother staff in a healthcare establishment;\n(f)   regulate healthcare establishments in accordance with standards and notified\npractices;\n(g)   prepare and notify notified practices as a guiding document for service provision\nin a healthcare establishment;\n(h)   inquire and investigate into violation of any of the provisions of this Act, by any\nhealthcare establishment;\n(i)   ensure compliance and implementation of provisions of this Act, rules and\nregulations made there-under and notified standards, by arranging periodical\ninspections and surprise visits by inspection committee;\n(j)   provide guidelines to the Registration Board for grant, renewal, suspension or\ncancellation of registrations of healthcare establishments, its healthcare\nprofessional and equipment;\n(k)   advise the Federal Government to prescribe rates of fee for various registrations\nor licensing, renewals, restoration or suspension of registrations or licensing or\nrestoration of lapsed registration or licensing;\n(1)   issue standing orders to ensure provision of quality healthcare services by\nhealthcare establishments;\n(m)   organize and arrange various educative programs, semmars, conferences and\nmeetings;\n(n)   take steps for coordination with healthcare establishments, for implementation\nof various health improvement, disease prevention, curative, rehabilitative and\npalliative programs;\n(o)   acquire, own, possess, transfer or lease properties for purposes of this Act;\n(p)   to propose regulations for appointment or termination of employees of the\nAuthority, their tenns and conditions of service including the welfare of\nemployees;\n(q)    prepare and implement annual plans;\n(r)    approve annual accounts, budget and estimates of income and expenditure;\n(s)    approve Appointment of bankers and auditors;\n(t)    develop and put in place various policies and measures to ensure elimination of\nquackery;\n(u)    establish committees for assistance and advice to the Authority in relation to the\nperformance of its functions and determine the membership, remuneration of\nmembers and terms of reference of each committee;\n(v)    subject to other provisions of this Act, prepare and issue regulations, guidelines,\ninstructions and directives to ensure implementation of this Act and otified\npractices;\n(w)    take action against violation of any provision of this Act and regulations made\nthereunder on complaint by an aggrieved person;\n(x)    to collaborate with international and national institutions, organizations and\ncomanies to secure their assistance, cooperation and support for improvement\nof healthcare establishments for provision ofhealthcare services:\n(y)    exercise any powers and perform any functions as may be necessary for carrying\nout the purposes of this Act on the instruction of the Federal Government; and\n(z)    delegate any of its functions to any person on such terms and conditions as may\nbe specified.\n(2) The Authority may exercise the same powers as are vested in a civil court under the Code\nof Civil Procedure, 1908 (Act V of 1908), in respect of the following matters, namely;—\n(a)    summoning and enforcing the attendance of any person and examining him on\noath;\n(b)    compelling the production of documents;\n(c)    receiving evidence on affidavits; and\n(d)    issuing commissions for the examination of witnesses.\n(3) The Authority shall not investigate or inquire into any matter subjudice before a court of\ncompetent jurisdiction on the date of the receipt of a complaint.\n(4) The Authority may authorize members of the staff to administer oaths and to attest various\naffidavits, affirmations or declarations which shall be admitted in evidence in all proceedings under\nthis Act."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Board of the Authority",
      "content": "(1) The general superintendence, direction and management of\naffairs of the Authority and overall policy making in respect of its operations shall vest in the Board\nwhich may exercise all such powers and do all such acts, deeds and things that may be exercised or\ndone by the Authority under this Act.\n(2) The Federal Government shall notify the Board of the Authority which shall consist of nine\nmembers, seven of whom shall be nominated on the recommendation of the committee constituted\nunder this Act and the remaining two members shall be nominated by the Federal Government.\n(3) The Authority shall prescribe the remuneration payable to a member for attending a meeting\nof the Board.\n(4) A decision of the Board shall not be valid if decided in a meeting without quorum."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Constitution of selection committee",
      "content": "(1) The selection committee shall consist of the\nfollowing, namely:—\n(a)    two representatives of the Federal Government                       Member\n(b)    Chief commissioner, Islamabad                                       Member\n(c)    one chief executive of tertiary hospital                             Member\n(d)    one representative of the private sector healthcare                 Member\nEstablishments\n(e)    one representative of the public sector healthcare                  Member\nestablishments\n(f)    a representative of the general practitioners                       Member\n(g)    a representative of the Council for Tibb                            Member\n(h)    a representative of the Council for Horneopathy                     Member\n(i)    a representative of the Medical and Dental Council                  Member\n(j)    a representative of the Nursing Council                             Member\n(k)    a representative from reputed national civil society                Member\n(l)    a representative from patients or consumers                         Member\nassociation\n(2) The committee constituted under section (1) shall select its chairman from amongst its\nmembers.\n(3) The committee shall determine areas of expertise and skills required for membership of the\nBoard and develop detailed criteria for selection accordingly.\n(4) The Federal Government shall nominate the members of the first selection committee and\nthereafter the following process shall be adopted for selection of members other than ex-officio\nmembers, namely;—\n(a)     representative of the private healthcare establishment to be elected from\namongst registered healthcare establishment;\n(b)     healthcare establishment general practitioner to be elected from amongst\nregistered practitioners with Authority; and\n(c)     members under clauses (j) and (k) of sub-section (I) shall be elected in\naccordance with prescribed criteria."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Term of the Board and the committee members",
      "content": "(1) A member of the Board shall hold\noffice for a term of three years and shall be eligible for one second term.\n(2) A member, other than ex-officio member, of the selection committee shall hold office for a\nterm of three years and shall be eligible for nomination for one second term.\n(3) In case of a vacancy of a member of the selection committee by death, resignation or\ndisqualification under this Act, the Federal Government shall appoint a person as member in\naccordance with the provisions of this Act for the remainder of the term of the member who has died,\nresigned or disqualified, as the case may be. The vacancy shall not be filled if remaining period thereof\nis less than four months.\n(4) If a member remains on the Board or selection committee, as the case may be, for less than\neighteen months then the period shall not be counted towards term."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Disqualifications",
      "content": "No person shall be, or shall continue to be, the Chairperson or a member\nof the Board who—\n(a)     has tendered resignation and not withdrawn it within a period of thirty days;\n(b)     is, or at any time has been, declared as insolvent by a court of competent\njurisdiction;'\n(c)     is found to be of unsound mind by a court of competent jurisdiction; or\n(d)     is, or has at any time been, convicted of any offence which, in the opinion of\nthe Federal Government, is an offence involving moral turpitude;\n(e)     absents himself from three consecutive meetings of the Board, without leave of\nabsence."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Chairperson",
      "content": "(I) the Chairperson of the Board shall be selected from amongst its\nmembers for a term of three years."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Functions and powers of the Board",
      "content": "(1) The functions and powers of the Board shall\nbe—\n(a)     to provide leadership and oversight, fonnulate policy and set strategic direction;\n(b)     to monitor performance and achievements of the Authority through regular\nreview;\n(c)     approval of annual operation plans and approve annual accounts, budget and\nestimates of income and expenditure;\n(d)     appropriation of Fund according to need;\n(e)    to approve the regulations of the Authority subject to other provisions of this\nAct;\n(f)     to approve annual report of the Authority;\n(g)     to approve and appoint bankers and auditors;\n(h)     to handle and redress any complaint about the Authority;\n(i)     to appoint full time chief executive officer, determine his terms and conditions\nof service;\n(j)     authorize the chief executive to manage the affairs of the Authority and set\nperformance targets for him;\n(k)     in case of complaint and non-performance, to hold responsible the chief\nexecutive officer according to terms and conditions agreed; and\n(l)     to regulate appointment, grades, appraisal, dismissal and terms and condition,\nof service of employees of the Authority.\n(2) The Board shall establish committees for assistance and advice to the Board in relation to\nthe performance of its functions and determine the membership, remuneration of members and terms\nof reference of each committee.\n(3) The Chairperson shall convene meetings of the Board from time to time either himself or\non the request of any member in writing for reason to be specified therein.\n(4) The meeting of the Authority shall be presided over by the Chairperson, or in his absence,\nby a member to be elected by the members present at the meeting from amongst themselves.\n(5) Two-third of the total members shall constitute quorum for a meeting of the Board.\n(6) All decisions in the meeting shall be taken by majority of votes:\nProvided that in the case of equality of votes the Chairperson shall have a casting vote."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Delegation",
      "content": "The Board may, by general or special order, delegate to the Chairperson or\na member or an expert, consultant, adviser or other officer of the Board or any other entity any of its\nfunctions or a part thereof under this Act subject to such conditions or restrictions as it may determine."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Chief executive officer",
      "content": "(1) The Board shall appoint a person to be chief executive\nofficer of the Authority having a minimum of fifteen years of experience in hospital er public\nadministration, public health, medicine, accounting, finance, law, regulation or other related field.\n(2) The chief executive officer shall, subject to the supervision and control of the Board,\nadminister the affairs of the Authority and may exercise such powers as are delegated to him by the\nBoard.\n(3) In particular, the chief executive officer may-\n(a)     manage the administration, operations and functions of the Authority;\n(b)     act as the principal accounting officer responsible and accountable for the\nmanagement of the Authority's funds and assets;\n(c)     prepare and present to the Board with strategic and operational plans for its\nreview and appraisal;\n(d)     assist the Board in strategic thinking, planning and implementing its policies;\n(e)     protect the financial health of the Authority;\n(f)     act as spokesperson of the Authority; and\n(g)     provide leadership to the senior management and direction to all staff.\n(2) The chief executive officer shall also act as the secretary to the Board."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Disqualifications of chief executive officer. A person shall not be appointed or hold office",
      "content": "as chief executive officer who—\n(a)     is a member of the Federal or a Provincial legislature, local council or local\nbody constituted under any law or has contested last general election;\n(b)     is employed in any capacity in the service relating to the affairs of the Federation\nor a Province or holds any office for which salary or other remuneration is\npayable out of public funds;\n(c)     is a director, officer or employee of any healthcare establishment;\n(d)     is an owner of, or has a share in, any healthcare establishment;\n(e)     has been convicted of tax evasion or for an offence involving moral turpitude;\nor\n(f)     is in default of payments due from him, for more than one hundred and eighty\ndays, to any bank, financial institution, cooperative society, governmental\nagency, department or corporation."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Regulation of provision of healthcare services",
      "content": "(I) No healthcare establishment shall\nrender any healthcare service unless it is. registered with the Registration Board under this Act subject\nto the terms and conditions as the Registration Board may determine on case to case basis at the time\nof registration and no healthcare es.tat lishment shall render any healthcare services for which it is not\nlicensed.\n(2) No healthcare professional shall render healthcare services in a healthcare establishment\nunless he has a prior registration under respective Councils.\n(3) A healthcare professional shall get himself registered with the Authority for rendering\nservices in a healthcare establishment and no healthcare professional shall render services in a field in\nwhich he is not registered with the Authority.\n(4) No healthcare professional shall render healthcare services in a healthcare establishment\nfor which he is not registered with the Authority."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Establishment of a Registration Board",
      "content": "(1) There shall be established a Registration\nBoard which shall he responsible for registration, renewal, suspension and cancellation of registrations\nof healthcare establishments, health professional and equipment.\n(2) The Registration Board shall comprise of the following namely:—\n(a)     Director-General of Health                                     Member\n(b)     Chief Executive Officer of Islamabad Healthcare                Member\nRegulatory Authority\n(c)     chief executive of tertiary care hospital in Islamabad         Member\n(d)     principal of a medical college nominated by the Federal        Member\nGovernment\n(e)     a representative of private healthcare establishment           Member\nsector nominated by the Federal Government\n(f)     District Health Officer, Islamabad Member                      Member\n(3) District Health Officer Islamabad shall be the secretary of the Registration Board.\n(4) The chairperson of the Registration Board shall be selected from amongst its members for\na period of five years."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Powers and functions of the Registration Board",
      "content": "(1) The Registration Board shall\nexercise powers and perform functions as provided hereinafter, namely:—\n(a)     maintain and regularly update register offal healthcare establishments;\n(b)     grant, renew, suspend, cancel or revoke any registration of healthcare\nestablishment, subject to such terms and conditions as deemed appropriate and\nto vary or amend any terms and conditions thereof;\n(c)     monitor and regulate the healthcare services quality levels and standards as may\nbe prescribed through notified practices;\n(d)     enquire and investigate into allegations of violation of any of the provisions of\nthis Act, notified practices or terms and conditions of any registration by any\nhealthcare establishment;\n(e)     assess and collect fees and charges for registration, renewal, restoration of\nlapsed or expired registration as well as any inspections for registration of\nhealthcare establishments, under this Act;\n(f)     coordinate, liaison and supervise the exercise of various powers and discharge\nof various functions by the inspection committee;\n(g)     coordinate with the Authority and submit report of its performance on quarterly\nbasis; and\n(h)     constitute a review committee and assign any task for resolution of any dispute\nin relation to report of inspection committee.\n(2) In the performance of its functions, the Registration Board shall take into consideration the\npolicy, guidelines, instructions, directives and orders issued by the Authority from time to time."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Setting standards",
      "content": "(1) The Board shall constitute technical committees for laying down\ndifferent standards for the purpose. of measuring the quality of healthcare services for registration of\nthe healthcare establishments, healthcare professional and equipment.\n(2) The Board may constitute technical committees in other areas if it deemed necessary.\n(3) The Beard may constitute policy advisory committee comprising members of such\ninstitutions in health and other related sectors as it may deem appropriate."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Establishment of inspection committee",
      "content": "There shall be established an inspection\ncommittee by the Registration Board which shall be responsible for conduct of pre-registration, post-\nregistration, pre-renewal and other inspections of healthcare establishments, as and when deemed\nnecessary or when so directed by the Registration Board or the chief executive officer."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Members of the inspection committee",
      "content": "(1) The inspection committee shall consist of\nthe following, namely:—\n(a)     head of inspection committee who shall be nominated by the Registration Board\nform amongst its members;\n(b)     subject specialists of a medical college or hospital, nominated by the\nRegistration Board according to the scope of the services of the healthcare\nestablishment being inspected;\n(c)    professional auditor with training and experience in hospital quality auditing;\nand\n(d)     executive director of a public hospital.\n(2) The Registration Board shall develop a pool of experts from relevant field from which the\nmembers of an inspection team shall be chosen."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Inspection Team",
      "content": "(I) The Authority may, by order in writing. appoint an inspection team\nto perform the functions and exercise the powers of the Authority for inspections under this Act,\nsubject to such conditions and limitations as the Authority may specify in this behalf.\n(2) The inspection team may inspect a healthcare establishment, equipment and healthcare\nservices provided by the healthcare establishment for grant, renewal, suspension or cancellation of\nregistration or licensing.\n(3) The inspection team may inquire any case if there has been any instance or allegation of\nmal-administration, malpractice or failure in the provision of healthcare services against a healthcare\nestablishment.\n(4) The Authority may impose a fine which may extend to fifty thousand rupees upon a\nhealthcare professional who-\n(a)     refuses or fails, without reasonable cause, to furnish any information to the\ninspection team; or\n(b)     gives any false or misleading information to the inspection team.\n(5) Except in the case of a prosecution for an offence under this Act, a member of the inspection\nteam shall not be bound to give evidence in any proceedings in respect of, or to produce any document\ncontaining, any information which has been obtained from any healthcare establishment in the course\nof carrying out any investigation, inspection, inquiry or performing any duty or function under this\nAct.\n(6) A member of the inspection team shall not disclose any information at any forum which is\ncontained in the medical record or which relates to the condition. treatment or diagnosis of any person\nas may have come to his knowledge in the course of carrying out any investigation, inspection, enquiry\nor performing any duty or function under this Act unless allowed in writing by the Authority."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Registration",
      "content": "(1) An owner of existing healthcare establishment shall, within a period of\nninety days of the coming into force of this Act, apply therein in accordance with this Act for\nregistration of its health establishment, healthcare professional working therein and equipment being\nused therein.\n(2) A person seeking registration for its healthcare establishment, its healthcare professional\nand equipment shall make an application to the Registration Board in the prescribed form and\naccompanied by such particulars, documents and fee as the Authority may prescribe. ·\n(3) The Authority shall within a period of not exceeding fourteen days of the receipt of\napplication issue to the person a certificate of registration, if all requirement, under this Act are fulfil\nled, otherwise the applicant shalI be considered as having provisionally registered for a period of three\nmonths."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Licensing",
      "content": "(1) No healthcare establishment shall render any healthcare services unless\nduly licensed as such by the Authority.\n(2) if a healthcare establishment is not licensed under this Act, the Authority may impose a\nfine, which may extend to ten hundred thousand Rupees, upon the in-charge of the healthcare\nestablishment."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Application for license",
      "content": "Within thirty days of the issuance of the certificate of\nregistration or such other time as may be detennined by the Authority, the healthcare establishment\nshall make an application, for a license, to the Authority in the prescribed form which shall be\naccompanied by such particulars, documents and fees as the Authority may prescribe."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Licensing procedure",
      "content": "(1) The Authority shall, on receipt of an application under section\n23, complete with all requisite documents, issue a provisional license to the healthier establishment\nand shall, within a period of not exceeding thirty days from the date of acceptance of the application,\nissue the regular license to the healthcare establishment.\n(2) The Authority may, before issuing the license, inspect the healthcare establishment which\nis to be licensed or cause such healthcare establishment to be inspected by an inspection team.\n(3) A license issued by the Authority, under this section,—\n(a)     shall be in such form as may be prescribed;\n(b)     shall be. valid for a period of five years; and\n(c)     may be renewed upon expiry."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Kinds of licences",
      "content": "(1) Every license of a healthcare establishment shall specify the kind\nof healthcare establishment for which it is issued and the purposes of the healthcare establishment.\n(2) A licensed healthcare establishment shall not be used for any purpose other than the\npurposes in respect of which the licence is issued and purposes incidental to such purposes.\n(3) The Authority shall maintain a register of all licensed healthcare establishments and may\nenter in the register any necessary details or other particulars of the healthcare establishments."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Revocation and suspension of licence",
      "content": "(I) The Authority may after giving an\nopportunity of hearing revoke a licence if the licence has been obtained by fraud or mis-representation.\n(2) The Authority may suspend a license of a healthcare establishment if it is satisfied that-\n(a)     services provided by the healthcare establishment are not meeting minimum\nsafety standards and that the services rendered are harmful;\n(b)     cases of medical negligence, mal-administration, malpractices have been\nproved against the healthcare establishment; and\n(c)     fails to comply with instructions and directions of the Authority.\n(3) Where any contravention of this Act is committed by a body corporate and it is proved to\nhave been committed with the consent or connivance of, or to be attributable to, any director, manger,\nsecretary or other officer or employee of the body corporate or any person who purported to act in any\nsuch capacity he as well as the body corporate shall be liable to pay fine for such contravention.\n(4) Where it appears to the Authority that the circumstances of a case warrant action under any\nlaw, the Authority may refer such case to the concerned governmental authorities or law enforcement\nagencies for appropriate action under relevant laws."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Quality improvement",
      "content": "(1) The Authority shall facilitate and support healthcare\nestablishments for continuous quality improvement.\n(2) The Authority shall develop and establish linkages with national and international relevant\nbodies or organizations for this purpose."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Public sector registration",
      "content": "(1) The public sector healthcare establishments shall be deem\nto have been registered under this Act.\n(2) The Federal Government shall provide list of public sector healthcare establishments with\nthe scope and extent of services provided by each category of hospital or institution.\n(3) The Federal Government shall be responsible to certify that its healthcare establishments\nmeet minimum safety standards set by the Authority.\n(4) The pubic sector healthcare establishments shall apply for licensing of healthcare services\nbeing rendered by them."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Penalties",
      "content": "(1) Notwithstanding anything contained in any other law, the Authority may,\nfor contravention of a provision of this Act, rules and regulations, impose penalties which may extend\nto ten hundred thousand Rupees keeping in view gravity of the contravention.\n(2) The Authority shall afford adequate opportunity of hearing to a person before imposing\npenalty under sub-section (I).\n(3) If the complaint, submitted either by an aggrieved person or a healthcare professional, is\nproved false, the Authority may impose penalty which may extend to two hundred thousand Rupees\nupon the complainant.\n(4) The Authority may revise the quantum of penalties under this section with the approval of\nthe Federal Government."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Offences",
      "content": "(1) Whoever himself or by any other person on his behalf establishes any\nhealthcare establishment without registration or a licence shall be punishable with imprisonment for a\nterm which may extend to five years or with fine which may extend to one million Rupees or with\nboth:\nProvided that the Board shall cause to conduct an inquiry to calculate the degree of care,\ndamage, diligence or negligence, within a period of ninety days, by such group consisting of experts\nof al lopathic or alternative medicine system, as the case may be.\n(2) Whoever obstructs an inspection in the exercise of any power conferred upon him by or\nunder this Act or disobeys the lawful authority of any member of inspection team, he shall be\npunishable with imprisonment for a term which may extend to six months or with fine which may\nextend to fifty thousand Rupees or with both.\n(3) The quackery by person who does not qualify to be registered or licensed under this Act\nshall be non-bailable and cognizable offence punishable with seven years of imprisonment or fine\nwhich may extend to two million Rupees or with both."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Appeal",
      "content": "(1) An appeal may be made to the Authority against order of the Registration\nBoard and to the Secretary, Ministry of National Health Services, Regulations and Coordination\nagainst order of the Authority within thirty days from the date of communication of the order.\n(2) An appeal may be made by the person who is aggrieved by the—\n(a)     refusal of the Authority to issue or renew a licence;\n(b)     decision of the Authority to suspend or revoke a licence;\n(c)     order of closing down of a healthcare establishment or making improvements\nin the healthcare establishment;\n(d)     order relating to equipment, apparatus, appliances or other things at a healthcare\nestablishment; or\n(e)     imposition of fine by the Authority."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Cognizance by court",
      "content": "(1) Save as provided in this Act, no court other than the Court of\nSessions assume jurisdiction under this Act unless a complaint in writing is filled before the aforesaid\ncourt by the Authority?"
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Complaints",
      "content": "(1) The Authority shall investigate the complaints relating to healthcare\nestablishment, healthcare professional, healthcare services and medical negligence.\n(2) The Authority shall define:—\n(a)     kinds of complaints;\n(b)     categories or different kinds of medical negligence; and\n(c)     mal-administration, malpractice and failure in provision of healthcare services.\n(3)    The recognized and known complications of a medical or surgical treatment are not\nconsidered as medical negligence."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Procedure of investigation",
      "content": "(1) The Authority shall prescribe the procedure for the\nconduct of investigation to be carried out by the Authority under this Act.\n(2) An aggrieved person may, within sixty days from the date of knowledge of the cause of\naction, file a complaint against a healthcare professional or healthcare establishment by submitting an\napplication in writing supported by an affidavit of the aggrieved person.\n(3) The Authority shall not entertain an anonymous or pseudonymous complaint against a\nhealthcare professional or healthcare establishment."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Directions as to apparatus, appliance, equipment or products",
      "content": "Where, in the opinion\nof the inspection team, the use of any apparatus, appliance, equipment, instrument, product, goods or\nitem or carrying out of any practice or procedure in a healthier establishment is dangerous or\ndetrimental to any person therein or otherwise or suitable for the purpose for which it is used or carried\nout, he shall immediately report the matter in writing to the Authority along-with the necessary details.\nOn receipt of report the Authority may act in accordance with the provisions of this Act."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Action done in good faith. No suit or other legal proceedings shall lie against the authority,",
      "content": "board, technical advisory committee, chief executive officer, officers, inspection tears, advisers,\nconsultants or agents of the Authority for anything done in good faith in the execution or purported\nexecution of this Act, rules or regulations made thereunder.\nEMPLOYEES, FUND, BUDGET AND ACCOUNTS"
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. The Fund",
      "content": "(1) There shall be established a fund to be known as the Islamabad Healthcare\nRegulatory Authority Fund, hereinafter referred to as the Fund, which shall vest in the Authority and\nshall be utilized by the Authority to meet charges and expenses in connection with the affairs of the\nAuthority.\n(2) The Fund shall consist of—\n(a)     such suns as the Government may grant by way of seed money or otherwise;\n(b)     donations from domestic and international donor agencies and other\ninstitutions;\n(c)     grants of money and sums borrowed or raised by the Authority for the purpose\nof meeting any of its obligations or discharging any of its duties;\n(d)     fees, penalties, fines or other charges imposed under this Act;\n(e)     all other sums which may in any manner become payable to or vested in the\nAuthority in respect of any matter incidental to the exercise of its functions and\npowers."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Budget",
      "content": "(1) Within ninety days of its establishment, the Authority shall prepare and\nsubmit to the Board for its approval, a budget for the period up to and including the end of the then\ncurrent financial year and thereafter it shall, not later than thirty days before the expiry of each financial\nyear, submit to the Board for approval a budget for the next financial year in accordance with\nprescribed procedures and shall maintain complete and accurate books of accounts of its actual\nexpenses and receipts and the funds.\n(2) The budget prepared by the Authority shall be reviewed by a budget committee consisting\nof one representative each of the Authority, the Federal Government and the private sector nominated\nby the Federal Government. The private sector nominee shall not have any conflict of interest in the\nAuthority's oversight of regulated activities. The budget committee shall ensure that the Authority\ncomplies with all requirements of this Act. The budget committee shall take its decisions by simple\nmajority of its members.\n(3) No expenditure shall be made for which provision has not been made in any approved\nbudget except if made from any previously approved contingency funds, unless further approval is\nsought and obtained from the Board."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Bank accounts",
      "content": "The Authority may open and maintain it’s accounts in Rupees or in any\nforeign currency at such scheduled banks as it may from time to time determine."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Annual report, accounts and audit",
      "content": "(1) Within ninety days from the end of each\nfinancial year, the Authority shall, in consultation with the Board, cause a report to be prepared on the\nactivities of the Authority including investigations and enquiries made by the authority under this Act\nduring that financial year and release to the public and simultaneously present a copy of the report to\nthe Federal Government.\n(2) The Authority shall cause proper accounts to be kept and shall as soon as practicable after\nthe end of each financial year cause to be prepared for that financial year a statement of accounts of\nthe Authority which shall include a balance sheet and an account of income and expenditure.\n(3) The Authority shall cause the statement of accounts to be audited by auditors, appointed by\nthe Authority with the approval of the Federal Government, who shall be a firm of chartered\naccountants. Any casual vacancy in the office of auditor appointed under this section may be filled in\nby the Authority.\n(4) The auditors shall make a report to the Federal Government, upon the annual balance sheet\nand accounts and in any such report they shall state whether in their opinion the balance sheet is a full\nand fair balance sheet containing all necessary particulars and properly drawn up so as to exhibit a true\nand correct view of the affairs of the Authority and, in case they have called for any explanation or\ninformation from tie Authority, whether it has been given and whether it is satisfactory.\n(5) The Federal Government may if it deems fit also require the accounts of the Authority for\nany financial year to be audited by the Auditor General of Pakistan.\n(6) The Board shall, within one hundred and twenty days of the end of each financial year,\ntogether with the annual report of the Authority send a copy of the statement of accounts of the\nAuthority certified by the auditors and a copy of the auditors’ report to the Federal Government which\nshall cause them to be published in the official Gazette."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Investments",
      "content": "(1) Subject to sub-section (2), the Authority may, in so far as its moneys\nare not required to be expended under this Act, invest the surplus moneys in such manner as may be\nprescribed.\n(2) The Authority shall not invest its money in listed securities or any derivative thereof w ether\nlisted or not."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Employees of the Authority",
      "content": "To carry out the purposes of this Act, the Authority may,\nfrom time to time, engage such experts, consultants, consultancy finns, advisers and other officers and\nstaff members on such terms and conditions as it may prescribe."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Public servant",
      "content": "The Chairperson. members and all other employees of the Authority shall\nbe deemed to be public servants within the meaning of section 21 of the Pakistan Penal Code (Act\nXLV of 1860)."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Executive authorities to assist the Authority",
      "content": "All executive authorities and law\nenforcement agencies of the Federal Government shall act in aid of the Authority."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Rules",
      "content": "(I) The Federal Government may, by notification in the official Gazette, make\nrules for giving effect to the provisions of this Act.\n(2) The power to make rules conferred by this section shall be subject to the condition of\nprevious publication and, before making any rule, the draft thereof shall be published in the official\nGazette for eliciting public opinion thereon within a period of not less than fifteen days from the date\nof publication."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Regulations",
      "content": "(1) The Authority may, with pervious sanction of the Federal Government,\nmake regulations for the following purposes, namely;—\n(a)     the management of the property of the Authority, its maintenance and audit of\nits accounts;\n(b)     summoning and holding of meetings of the Authority and places where such\nmeetings are to be held, the conduct of business thereof and the number of\nmembers necessary to constitute a quorum;\n(c)     the powers and duties of the chief executive officer;\n(d)     the mode of appointment of the Registration Board and inspection committees,\nthe summoning and holding of meetings thereof for conduct of business of such\ncommittees;\n(e)     the appointment, powers, duties and procedure of inspection team;\n(f)     the procedure for maintenance, compilation and publication of the register, list\nof healthcare establishment and their minimum requirement and the fees to be\ncharged for registration and licensing;\n(g)     the procedure for any investigation under section 34;\n(h)     Prescribing a minimum standard of grant, renewal, suspension or cancellation\nof registration of healthcare establishment;\n(i)     prescribing a minimum standard of grant, renewal, suspension or cancellation\nof licence of healthcare establishment;\n(j)     prescribing a minimum standard of patient and health staff safety in healthcare\nestablishment;\n(k)     prescribing a minimum standard of quality assurance in healthcare\nestablishment;\n(I)     the forms, fees and registers for the purposes of this Act;\n(m)     the data of patients treated in a healthcare establishment;\n(n)     the records of the staff of a healthcare establishment;\n(o)     fix penalties according to offence; and\n(p)     the regulation and control of prices of the healthcare services.\n(2) The power to make regulations conferred by this section shall be subject to the condition\nof previous publication and, before making any regulations. the draft thereof shall be published in the\nofficial Gazette, and two newspapers of wide circulation and in the website of the Authority, for\neliciting public opinion thereon within a period of not less than fifteen days from the date of\npublication."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Failure to comply with the decision of the Authority",
      "content": "Any person who, in the opinion\nof the Authority, fails to comply with the final decision or recommendation of the Authority, the\nAuthority may impose a fine which may extend to ten hundred thousand Rupees on such person."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to any provision of this\nAct, the Federal Government may make such order not inconsistent with the provisions of this Act as\nmay appear to it to be necessary for the purpose of removing such difficulty."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Incentives",
      "content": "(1) Healthcare establishments already registered with International\nOrganization for Standardization (ISO) or Joint Commission International (JCI) or any other such\norganization shall be registered with the Board without inspection for a period till these establishments\nremain registered with such organizations.\n(2) Healthcare establishments registered with the Board, healthcare professional of such\nhealthcare establishments shall be protected under immunity clause of this Act."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Overriding effect",
      "content": "Notwithstanding anything to the contrary contained in any other law,\nunder the law making authority of the Federal Government, the provisions of this Act shall have an\noverriding effect and the provisions of any such law to the extent of inconsistency to this Act shall\ncease to have effect.\n__________________"
    }
  ],
  "definitions": [
    {
      "term": "accreditation",
      "definition": "systemic quality improvement process which ensures that services provided meet the notified practices;",
      "source_provision": "sec2"
    },
    {
      "term": "assessor",
      "definition": "an expert or group of experts commissioned by the Authority or any other recognized institution or organization for assessment of quality of a healthcare establishment;",
      "source_provision": "sec2"
    },
    {
      "term": "allied health professional",
      "definition": "a person who assists in providing services for diagnostic, therapeutic, preventive, curative and rehabilitative field in health care delivery system and has qualified a prescribed course of training in an recognized institution having recognition from their respective council;",
      "source_provision": "sec2"
    },
    {
      "term": "allopathic",
      "definition": "a system of medical practice that aims to combat disease by use of remedies, as drugs or surgery, producing effects different from or incompatible with those produced by the disease being treated;",
      "source_provision": "sec2"
    },
    {
      "term": "alternative medicine system",
      "definition": "unani, tibb, ayurveda, homoeopathic, acupuncture or any other recognized system of treatment of diseases in Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "Islamabad Healthcare Regulatory Authority established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of the Authority constituted under section (viii) “Chairperson” means the chairperson of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "chief executive officer “means the chief executive officer of the Authority; (x) “council",
      "definition": "the Pakistan Medical and Dental Council, the Pakistan Nursing Council, the National Council for Homeopathy, the National Council for Tibb, the Phannacy Council or such other Councils established by Federal Government to regulate various cadre of. healthcare professional and notified in official Gazette under this clause;",
      "source_provision": "sec2"
    },
    {
      "term": "Council for Homeopathy",
      "definition": "the National Council for Homeopathy established under the Unani, Ayurvedic and Homoeopathic Practitioners Act, 1965 (II of 1965);",
      "source_provision": "sec2"
    },
    {
      "term": "Council for Tibb",
      "definition": "the National Council for Tibb established under the Unani, Ayurvedic and Homoeopathic Practitioners Act, 1965 (I of 1965); (xiii) “equipment” includes all electrical, electronic, mechanical, laser, scanning, x- ray, imaging, analyzing and testing machinery, equipment, device, tools, apparatus, including various utensils and related material and chemical or other substances which are used to determine the performance, functionality, disorder, ailment or any other effect on state of health of human;",
      "source_provision": "sec2"
    },
    {
      "term": "Fund “means the Islamabad Healthcare Regulatory Authority Fund established under section 37; (xv) “healthcare establishment",
      "definition": "any premises used or intended to be used for the provision of healthcare services, including but not limited to a hospital, teaching hospitals, surgical centers, maternity homes, nursing homes, clinics, dispensaries, dentistries, dental clinics, clinical laboratories, x-ray laboratories, diagnostic centers, ambulatories, cosmetic centers, psychiatric hospitals, bum units, psychiatric nursing home, community mental health center, hemodialysis center, dialysis center, patient rehabilitation center, slimming clinic or centre, hair transplant clinic, domiciliary care, home based services and such other healthcare or health-related premises as the Federal Government may, by notification in the official Gazette, specify;",
      "source_provision": "sec2"
    },
    {
      "term": "healthcare professional",
      "definition": "a medical practitioner and dentist registered with the Pakistan Medical and Dental Council, nurse, midwife, community midwife, female family workers or lady health visitor registered with the Pakistan Nursing Council, a tabib registered with the National Council for Tibb or homeopathic practitioner registered with the National Council for Homeopathy or pharmacist registered under the Pharmacy Council of Pakistan Act, 1967 (XI of 1967) or paramedic, allied health professional or physiotherapist, psychologist or any other person qualified and permitted by law to provide any medical, surgical treatment or other healthcare service as well as any person qualified to perform any health related test on human body or test anybody fluid under a laboratory process and provide results of such test to confirm or determine any health condition or physical or mental ailment; (xvii) “healthcare services” include any medical, surgical, dental, allied health, ambulatry, patient accommodation, screening or diagnostic services, treatment of persons suffering from or believed to be suffering from any disease, injury, pain or disability of mind or body, burn or hurt treatment, wound dressing, physiotherapy, acupuncture, any service for curing or alleviating any abnormal condition of human body or mind by application of any apparatus, equipment, instrument or device or any other medical technique or method, hemodialysis treatment, preventive or promotive health treatment, services at healthcare establishments by healthcare professional; (xviii) “in-charge of a healthcare establishment” means the owner or person responsible for management of day to day affairs of a healthcare establishment which are owned and operated by private persons, natural or corporate, or Government in any premises;",
      "source_provision": "sec2"
    },
    {
      "term": "inspection",
      "definition": "the inspection and examination of the healthcare establishment by an inspection team;",
      "source_provision": "sec2"
    },
    {
      "term": "inspection team",
      "definition": "a team comprising more than two experts having relevant qualifications and experience constituted by the Registration Board;",
      "source_provision": "sec2"
    },
    {
      "term": "licence",
      "definition": "a licence issued by the Authority under this Act for the use of any premises as a healthcare establishment to deliver healthcare services and “licensed “ and ''licensing “ shall be construed accordingly; (xxii) “licensee” means a person to whom licence has been issued under this Act; (xxii) “Medical and Dental Council” means the Medical and Dental Council constituted under the Medical and Dental Council Ordinance, 1962 (XXXII of 1962); (xxiv) “medical negligence” means any negligence by an act or omission of a healthcare professional in perfonning his duty. In medical negligence cases it has to be established that— (a) there was a duty which the healthcare professional owed to the patient; (b) there was a breach of duty; (c) the breach resulted in injury to the patient; and (d) the injury resulted in causing damage or death;",
      "source_provision": "sec2"
    },
    {
      "term": "Nursing Council",
      "definition": "the Pakistan Nursing Council established under the Pakistan Nursing Council Act, 1973 (XXVI of 1973); (xxvi) “notified practices” mean all such healthcare services provision, best measures, practices, protocols, standing operating procedures, medical and clinical hygiene standards or specifications, quarantine standards, patient handling and care standards and principles of medical ethics developed by national or international organizations collected and published by the Authority from time to time to act as a guiding document for service provision in a healthcare establishment; (xxvii) “patient data” means the details of a patient to whom any healthcare services are offered or provided in a healthcare establishment or by a healthcare professional, as the case may be, containing details of results of diagnosis of disease or ailment, tests or examinations conducted, medicines prescribed or administered, any surgical treatment or procedures performed as well as dates of admission and discharge of the patient etc.; (xxviii) “prescribed” means prescribed by rules or regulations made under this Act; (xxix) “quack” means any person who is rendering any healthcare services to a person without getting itself registered under respective Councils or otherwise not authorized or permitted by any law to offer or render such kind of healthcare services;",
      "source_provision": "sec2"
    },
    {
      "term": "registration",
      "definition": "registration under section 14; (xxxi) “regulations” means the regulations made under this Act; (xxxii) rules “means rules made under this Act; (xxxiii) “Registration Board means the Registration Board constituted under this Act for registration of healthcare establishments; and (xxxiv) “standards” means standards notified by the Authority for licensing of healthcare establishment.",
      "source_provision": "sec2"
    }
  ]
}
