{
  "id": "pk-islamabad-nature-conservation-and-wildlife-management-act-2024",
  "type": "statute",
  "title": "Islamabad Nature Conservation and Wildlife Management Act, 2024",
  "title_en": "Islamabad Nature Conservation and Wildlife Management Act, 2024",
  "short_name": "INCAW",
  "status": "in_force",
  "issued_date": "2024-08-26",
  "in_force_date": "2024-08-26",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pqaA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Islamabad Nature Conservation and Wildlife Management Act, 2024 (XVI of 2024) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act shall be called the Islamabad Nature\nConservation and Wildlife Management Act, 2024.\n(2) It shall extend to the whole of Islamabad Capital Territory.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context:__\n(a)    “Animals” means mammals, birds, reptiles, amphibians, fish, insects, or arachnids,\ntheir young and also in the cases of amphibians, reptiles and birds, their eggs excluding\nlivestock and poultry;\n(b)    “Authorised officer” means any officer authorised by the Board to carry out functions\nunder this Act;\n(c)    “Board” means the Nature Conservation and Wildlife Management Board constituted\nunder section 3;\n(d)   “Beard Member” means a Member of the Board appointed under section 3;\n(e)   “Capture” means the taking alive of any wild animal;\n(f)   “Court” means Court established under section 34;\n(g)   “Exotic Species” means species, both flora and fauna, which does not occur in an area\nnaturally and it is introduced or intended to be introduced-from outside of its natural\noccurrence;\n(h)   “Fund” means the Conservation of Nature Fund constituted under section 11;\n(i)   “Habitat” means natural environment, including biotic and a biotic factors essential\nfor free survival of an animal, plants or any other living organisim;\n(j)   “Hunting” means any Act directed to the killing or capturing of a Wild animal, and\nincludes but is not limited to fishing, angling, netting, the taking of nests or eggs of\nsuch animals and their parts, products or derivatives thereof;\n(k)   “Humus” means the layer of dead organic matter below the fallen leaves, where the\nphenomenon of degradation by the soil bio-diversity takes place;\n(l)   “indigenous” means an animal species native to a specified area, a country or a region;\n(m)   “Invasive species” means invasive alien species introduced, in a habitat where they\noutgrow the native species and may reach a level where they could become a weed or\na pest;\n(n)   “ICT” means the Islamabad Capital Territory;\n(o)   “National Park” means an area declared as such under section 12;\n(p)   “Nature” means the phenomena of the physical world collectively, including plants,\nanimals, the landscape, and other features and products of the earth, as opposed to\nhumans or human creations;\n(q)   “Plant” means a living organism of the kind exemplified by trees, shrubs, herbs,\ngrasses, ferns and mosses, typically growing in a permanent site, absorbing water and\nin-organic substances through its roots, and synthesising nutrients in its leaves by\nphotosynthesis using the green pigment chlorophyll;\n(r)   “Protected Animals” means a wild animal included in Schedule-I whose hunting,\nkilling, trapping, capturing, possession or trade is not allowed;\n(s)   “Protected Area” means an area declared as under Part-V of this Act;\n(t)   “Trophy” means the dead body of a wild animal or any horn, antler, tooth, tusk, hoof,\nskin hair, feather, egg, shell or other durable bone claw part of any wild animal, whether\nor not included in a manufactured or processed article;\n(u)     “Wild Animal” means an animal which is usually found in a natural wild environment\nand is not predisposed to be domesticated or tamed. Such animals shall also include any\nanimal which has been declared a protected animal in Schedule-I or notified by Ministry\nof Climate Change and Environmental Coordination as protected or wild animal; and\n(v)     “Wildlife” means the natural flora and fauna and their habitat including organic soil\nwith humus and natural water bodies."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Constitution of the Board",
      "content": "(1) The Federal Government may constitute a Board for Nature\nConservation and Wildlife Management consisting of nine Board Member of which five shall be ex-\nofficio and four non ex-officio Members, including a chairperson, as it may appoint.\n(2)     Five ex-officio Board Members shall be:\n(a)     An officer not below the rank of BS-20 of the Administrative Division, as\nnominated by the Secretary of the said Division;\n(b)     Joint Secretary of the Ministry of Climate Change and Environmental\nCoordination;\n(c)     Member Environment of the Capital Development Authority;\n(d)     An officer not below the rank of BS-20 appointed by Mayor of Islamabad/Head\nof Municipal Corporation of ICT;\n(e)     Deputy Commissioner of ICT.\n(3) Four non ex-officio members shall be appointed by the Federal Government, each of whom\nshall be well known for his integrity having expertise and experience in the sphere of bio-diversity or\nwildlife management or any other ancillary field.\n(4) The Federal Government shall ensure the appointment of non ex-officio members of the\nBoard within one hundred and twenty days from the date a vacancy arises on the Board.\n(5) The Federal Government may alter the composition of the Board as provided in this section\non need basis.\n(6) The Chair of the Board shall be appointed by the Federal Government from amongst the\nBoard Members.\n(7) Non ex-officio Board Members shall hold office for a term of three years and may be eligible\nfor re-appointment for one further three year term subject to Federal Government’s approval, on such\nterms and conditions; including remuneration and allowances, as may be prescribed by rules made\nunder this Act:\nProvided further that no person shall be appointed or remain a non ex-officio Board Member:\n(a)     if he is convicted of a criminal offence involving fraud, dis-honesty, corruption or\nviolence;\n(b)     is or becomes bankrupt or suspends payment or compounds with his creditors; or\n(c)     is absent from three consecutive meetings without leave of the Board."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Procedure of the Board",
      "content": "(1) Subject to the provisions of this Act, the procedure and\nconduct of business of the Board shall be regulated by regulations made by the Board.\n(2) The Board shall meet as often as may be necessary for the performance of its functions not\nless than once in a quarter year.\n(3) The quorum for a meeting of the Board shall be four Board Members, including the Chair.\n(4) If the Chair is un-able to attend a meeting of the Board, the Board Members may elect one\nof the Members present to chair meeting of the Board.\n(5) The Board may invite any person not a member of the Board to attend its meetings or\ndeliberations including meetings or deliberations of its Committees in an exclusively advisory\ncapacity."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Committees of the Board",
      "content": "(1) The Board may constitute such number of its committees\nas it considers necessary or expedient to advise it in the performance of its functions under this Act.\n(2) A committee constituted under this section shall Act in accordance with the regulations\nmade by the Board.\n(3) The meetings of a committee shall be held at such times and places as the chair of the\ncommittee may determine.\n(4) The Board Members and any other person invited to attend any meeting of the Board or a\ncommittee shall be entitled to such compensation and re-imbursement of expenses as the Board may\nfrom time to time determine by regulations."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Powers and Functions of the Board",
      "content": "(1) Subject to other provisions of this Act, rules and\nregulations made hereunder, the Board may take such measures and exercise such powers as may be\nnecessary for carrying out the purposes of this Act.\n(2) Without prejudice to the generality of powers conferred by sub-section (1), the Board may\nperform the following functions:\n(a)     administer and implement the provisions of this Act, rules, regulations, policies,\nguidelines and directives issued thereunder;\n(b)     make policies, draw plans, including management plans and programmes for\nprotection, promotion, preservation, conservation and management of nature in\nProtected Areas;\n(c)     implement policies, plans, including management plans and programmes for protection,\npromotion, preservation, conservation and management of nature in Protected Areas;\n(d)     prepare, submit, promote, implement or execute projects for the protection,\nconservation, rehabilitation and improvement of wildlife in Protected Areas;\n(e)     implement all directions with respect to development and maintenance of areas\ndesignated by the Federal Government as protected areas;\n(f)     every three years prepare and publish a report on the state of nature m Protected Areas;\n(g)     propose to the Administrative Division suitable projects for submission to international\nand local institutions for funding;\n(1)     prepare policy papers and concept notes and provide technical input for formulating\nnational policy positions for international conferences or negotiations;\n(i)     work in collaboration with relevant Government Agencies, non-governmental\norganizations and other stakeholders, and after conducting relevant research and studies\nset targets and coordinate actions with respect to the objectives of this Act;\n(j)     request Auditor General of Pakistan to audit the accounts of the Board; and\n(k)     to make regulations, subject to approval of the Federal Government, for carrying out\nCONFLICT OF INTEREST, DIS-QUALIFICATION, REMOVAL, RESIGNATION AND"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Application of this Part",
      "content": "This part shall have application to Board Members other than\nex-officio Board Members."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Disclosure of Conflict of Interest by non ex",
      "content": "officio Board Member.__ (1) For the purpose\nof this section, a person shall be deemed to have conflict of interest in a matter if he has any interest,\npecuniary or otherwise, in such matter which could reasonably be regarded as giving rise to a conflict\nbetween his duty to honestly perform his functions under this Act and such interest, so that his ability\nto consider and decide any question impartially or to give any advice without bias, may reasonably be\nregarded as impaired.\n(2) A Board Member having conflict of interest in any matter to be discussed or decided by the\nBoard or a committee shall upon becoming. aware of the conflict of interest disclose his interest and\nthe nature thereof in writing to the Board or committee, as the case may be.\n(3) Upon disclosure of conflict of interest, the Board Member shall:\n(a)      not take part nor be present in any deliberation or decision of the Board or a committee\non any matter in which he has a conflict of interest; and\n(b)     be dis-regarded for the purpose of constitution of a quorum of the Board or a committee\nin any meeting on any matter in which he has a conflict of interest.\n(4) Non-disclosure of conflict of interest as required under this section may be a ground for\nremoval from the Board if it is established that such non-disclosure was willful and deliberate.\n(5) A person who has any conflict of interest in any matter shall not take part, or continue to\ntake part, in any matter with respect to which the conflict of interest has arisen."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Removal and Resignation",
      "content": "(1) The Chairperson or a Board Member may by writing under\nhis hand resign from office.\n(2) The Chairperson or a Board Member may be removed by the Federal Government, from\noffice if on inquiry he is found incapable of performing functions of his office by reason of mental\nincapacity or has been found guilty of misconduct or fails to disclose conflict of interest as provided\nfor under this Act.\n(3) The inquiry under sub-section (2) shall be conducted in accordance with the Efficiency and\nDiscipline Rules as applicable to Civil Servants by a committee constituted by the Minister-in-Charge\nto which the subject of the Board is assigned.\n(4) The accused shall be given a reasonable opportunity to be heard by the inquiry committee\nand shall only be found guilty if majority members of the inquiry committee come to that conclusion."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Conservation of Nature Fund",
      "content": "(1) The Administrative Division may, by notification in\nthe Official Gazette, constitute a fund to be called the Conservation of Nature and Management of\nWildlife Fund which shall vest in the Board and shall be utilised by the Board for conservation of\nnature, management of wildlife and expenses of the Board for performance of functions under this Act.\n(2)     The Fund shall comprise of:\n(a)     grants made by the Federal Government;\n(b)     loans obtained from the Federal Government;\n(c)     grants made by local bodies;\n(d)     donations and funds raised from national and international organisations;\n(e)     donations from philanthropists, conservationists and civil society;\n(f)     receipts from visitors including but not limited to fee for entry of a person or a\nvehicle into a national park or a wildlife sanctuary, and/or parking fees;\n(g)     fees for certificates and licenses issued by the Board under this Act, rules and\nregulations made thereunder; and\n(h)     any other sources notified by the Federal Government.\n(3)     In addition to the provisions of sub-section (1) above, the Fund shall be utilised for:\n(a)     conservation, restoration and rehabilitation of nature and protected areas, located in the\nICT and other various facilities and areas managed by the Board under this Act;\n(b)     conservation education and awareness about Nature;\n(c)     research in the field of wildlife;\n(d)     meeting of exigencies like forest fires, calamities, depredation losses etc;\n(e)     capacity building of the Board and communities in management of wildlife and bio-\ndiversity;\n(f)     payment of salaries and other remuneration to the officers, staff, experts and consultants\nof the Board;\n(g)     incentives or rewards for the staff of the Board and communities for outstanding\ncontribution to conservation of Nature;\n(h)     running any project or activity for the promotion of Bio-diversity including flora and\nfauna in the areas managed by the Board under this Act;\n(i)     any other activity as may be approved by the Federal Government."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Management of the Fund",
      "content": "The Board shall manage the Fund in accordance with rules\nprescribing the procedure and criteria for management of the Fund."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. National Park",
      "content": "(1) With a view to conserving, protecting and preserving nature, the\nFederal Government may by notification in the Official Gazette declare any area to be a national park\nand may demarcate it in such a manner as may be prescribed by rules.\n(2) The national parks mentioned in sub-section (1) above shall be accessible to the public for\nrecreation, education, and research subject to such restrictions and conditions as the Board may specify\nthrough regulations.\n(3) Provision for access to roads, construction of rest houses, hotels and other buildings in the\nnational park along-with amenities for the public may be so made, the forest therein shall be so\nmanaged, and forest produce so obtained, subject to approval of the Board upon satisfaction that such\nactivities will not adversely impact the conservation, protection and preservation of nature in the\nNational Park.\n(4) Except as otherwise provided by this Act, rules and regulations made hereunder, the\nfollowing acts shall be prohibited in a national park, namely:\n(a)     hunting, shooting, trapping, killing, or capturing of any wild animal within a radius of\ntwo kilometers of its boundaries;\n(b)     felling, tapping, damaging or destroying of, or taking, collecting or removing\ntherefrom, any plant, or causing any damage by negligence in felling any tree or cutting\nor dragging any timber, stripping off the bark or leaves from, or otherwise damaging\nthe same;\n(c)     introducing any exotic, alien or invasive species of wildlife;\n(d)     firing any firearm or doing any other Act which may disturb any wild animal or interfere\nwith its breeding place;\n(e)     clearing or breaking up of any land for cultivation, mining, residential, commercial or\nany other purpose;\n(f)     constructing any walls, structures, or buildings for residential, commercial, or any other\npurpose or residing in any such wall, structure or building;\n(g)     polluting water flowing in or through it;\n(h)     polluting or contaminating soil and ground-water in it;\n(i)     littering and dumping of waste;\n(j)     trespassing or pasturing cattle, or permitting cattle to trespass;\n(k)     writing, inscribing, carving, disfiguring, defacing, painting, chalking or advertising;\n(l)     use of vehicular transport, except on recognized roads and routes;\n(m)     blowing of pressure horns within half kilometre of the park boundary;\n(n)     play back music using mobile phones, audio players or any other audio-video\nequipment or making noise;\n(o)     bringing in pets;\n(p)     carrying any firearms;\n(q)     carrying any incendiary material that can be used to light a fire;\n(r)     kindling any fire or leaving any fire burning, in such manner as to endanger nature;\n(s)     feeding any wild animals;\n(t)     removal of dead leaves, humus and soil; and\n(u)     quarrying stone or collecting any forest produce."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Wildlife Sanctuary.__ (1) With a view to securing un",
      "content": "disturbed breeding of wildlife, the\nFederal Government may, by notification in the official Gazette, declare any area in ICT to be a wildlife\nsanctuary.\n(2) Subject to rules, the wildlife sanctuary shall be closed to the public, and no person shall\nenter the wildlife sanctuary except for-reducing fire hazards, epidemic or insect attacks or other natural\ncalamities.\n(3) No person shall reside, cultivate any land, damage, or destroy any vegetation, construct any\nstructures or building for any purpose, introduce species of any animal or plant, introduce any domestic\nanimal or allow it to stray, cause any fire, or pollute water, in a wildlife sanctuary, or hunt, kill or\ncapture any wild animal or fire any gun or other firearm within two kilometers of the boundaries\nthereof.\n(4) The Board shall ensure the installation of sufficient sign-boards or fences or any other\nvisible feature which clearly identifies the boundaries of the wildlife sanctuary and gives warning to\nthe general public about the consequences of entering a wildlife sanctuary without legal justification."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Buffer Zones Around Protected Areas",
      "content": "(1) An area falling within 100 meters outside\nthe boundary of a national park or a wildlife sanctuary will be considered a protected area buffer zone\nprovided it is a state land or acquired for this purpose.\n(2) The developments in the buffer zones including structures, roads and buildings or any other\ninfrastructure or facility will be designed and operated in such a manner that the disturbance to wildlife\nin the national park is minimised.\n(3) No development shall take place in a buffer zone unless a No Objection Certificate is taken\nfrom the Board prior to the start of development."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Alteration of Boundaries of Protected Areas",
      "content": "The Federal Government may, by\nnotification in the official Gazette, declare any alteration in the boundaries of a protected area."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Prohibitions",
      "content": "(1) Save as otherwise provided in this Act or the rules or regulations made\nhereunder, no person shall:\n(a)     injure, hunt, kill or capture wild animals;\n(b)     keep wild animals in captivity;\n(c)     use hawks for hawking or dogs for coursing wild animals.\n(2) The Board may for public safety or protection of nature, by notification in the official\nGazette, permit the killing and capturing of any wild animal by such person, at such place, and by such\nmeans as may be specified in the notification;\n(3) A person who, on the coming into force of this Act, is in possession of a wild animal with\nor without permission shall surrender the same to the Board within three months of commencement of\nthis Act, thereafter the Board shall forcefully seize the same."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Licenses",
      "content": "(1) No person shall undertake the following activities without obtaining a\nlicense from the Board in the form and manner specified by regulations, namely:__\n(a)     the establishment and operation of a public sector facility for breeding of wild animals,\nincluding exotic animals;\n(b)     the establishment of a public sector animal rescue and rehabilitation facility for rescue\nand rehabilitation of wild animals;\n(c)     use of certain species for research and development by licensed facilities;\n(d)     engage in any trade or business, or otherwise deal in, any trophy or meat or, in the\ncourse of such trade or business carried on by him on his own behalf or on behalf of\nany other person, shall sell, purchase, barter, cut, carve, polish, preserve, clean or mount\nany wild animal, trophy or meat, or manufacture any article thereof.\n(2) Provided no breeding facility or a rescue and rehabilitation facility for wild animals shall\nbe established in the private sector.\n(3) A license may be issued by the Board on such terms and conditions and payment of such\nfees as may be prescribed by regulations.\n(4) The Board shall specify guidelful for the manner in which a licensed activity is undertaken\nby the holder of a license issued under sub-section (1).\n(5) Every operator of an existing facility or permission referred to in sub-section (1), shall\nobtain a license under this Act within three months of coming into force of this Act, and till such time\nthat their application for license has been decided upon by the Board, the facility or permission will be\ndeemed to be validly existing."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Certificate of Lawful Possession",
      "content": "(1) No person shall be in possession of any trophy or\nmeat except under a certificate of lawful possession in respect thereof issued by the Board on such\nterms and conditions upon payment of such fees as may be prescribed by the regulations.\n(2) The form and nianner of obtaining a certificate of lawful possession shall be specified by\nregulations:\nProvided that a person who, on the coming into force of this Act, is in possession of, or at any\ntime thereafter, imports or acquires, any such trophy or meat shall, within three months of the coming\ninto effect of this Act, apply to the Board for a certificate of lawful possession.\n(3) The Board shall mark the trophy or meat in respect of which a certificate of lawful\npossession is issued and make entries in respect thereof in the prescribed register.\n(4) The holder of a certificate of lawful possession shall produce the certificate to the Board\nwhen asked by him to do so.\n(5) No person shall counterfoil, change, or in any way interfere with, any mark put on a trophy\nor meat under sub-section (3) or alter. or in any way change a certificate of lawful possession."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Restriction on Transfer of Trophy or Meat",
      "content": "(1) No person who is not in possession of\na certificate of lawful possession in respect of a trophy or meat shall transfer such trophy or meat to\nany other person by way of gift, sale or otherwise.\n(2) No person shall receive by gift, purchase or otherwise any trophy or meat unless he is at the\nsame time given the certificate of lawful possession clearly mentioning theron the nature of the transfer\nand the name of the person to whom the trophy or meat is transferred.\n(3) The person to whom a trophy or meat is transferred shall submit the certificate of lawful\npossession given to him by the transferor to the Board who shall endorse it in favour of the transferee\nand make necessary amendments in the prescribed register."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Restriction on import of wild animals, trophies etc",
      "content": "(1) No person shall import, or\nattempt to import, into ICT any live wild animal or exotic species or alien species thereof or any trophy\nor meat, or derivatives thereof except through a customs-port of entry, and any person, importing such\nanimal or exotic species or alien species, trophy or meat, or derivatives thereof, shall produce to the\nofficer of customs:\n(a)     proof to his satisfaction that it has been lawfully exported from the country or region of\nexport;\n(b)     in addition to all other requisite permissions under any other applicable laws, an import\npermit issued by the Board on such terms and conditions as deemed appropriate by thy\nBoard.\n(2) The officer of customs may detain any live wild animal or exotic species or alien species,\ntrophy or meat, which has been imported until such time as the proof of its lawful export from the\ncountry or region of export is given and the import permit is surrendered to him, and if the proof is not\ngiven or the import permit is not surrendered within a reasonable time, the wild animal or exotic species\nor the alien species, trophy or meat, or derivatives thereof shall be handed over to the Board to be dealt\nwith in accordance with law."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Restriction on export of wild animals, trophies, etc",
      "content": "No person shall export, or attempt\nto export, any wild animal, trophy, or meat except without first obtaining an export permit from the\nBoard on such terms and conditions as deemed appropriate by the Board."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Animals, trophies, etc., in transit",
      "content": "Nothing in this Part shall apply to live wild animals,\nor exotic species or alien species, thereof or any trophy or meat in transit through ICT if the animal,\nexotic species or alien species or trophy or meat:\n(a)     is accompanied by transit documents;\n(b)     enters through a customs port of entry; and\n(c)     is not un-loaded from the ship or vehicle on which it is being carried, or, in case of rail\nor air transport, does not leave the precinct of the railway station or the airport at which\nit is landed or transhipped or does not remain at such precincts, except in a customs\nwarehouse, for more than 48 hours."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Animals found Dead, etc. to be Property of the Federal Government",
      "content": "(1) Any wild\nanimal found dead or dying or which has been killed or caught otherwise than in accordance with the\nprovisions of this Act, rules or regulations and any trophy or meat thereof, shall be the property of the\nFederal Government and be held by the Board for the Federal Government.\n(2) When in any proceeding under this Act a question arises as to whether a wild animal, trophy\nor meat is the property of the Federal Government such wild animal, trophy, or meat shall be presumed\nto be the property of the Federal Government until the contrary is proven."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Protection of Flora and Fauna",
      "content": "The Board shall make regulations for protection of flora\nfauna on matters including but nit limited to control, entry and release of alien, invasive, exotic and\ndiseased species in ICT.\nOFFENCES, PENALTIES AND ENFORCEMENT"
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Penalties",
      "content": "(1) Any person who contravenes or attempts to contravene or abets in the\ncontravention of, section 12,13,14, shall be punishable with fine in accordance with Schedule-II.\n(2) Any person who, in violation of section 16, kills, hunts or captures, or abets in the killing,\nhunting or capturing of a wild animal otherwise than in accordance with the provisions of this Act,\nrules and regulations shall be. punishable with imprisonment fora term which may extend up to one\nyear, with fine in accordance with Schedule-II, or both.\n(3) Any person who, in violation of section 16, through wilful, negligent, or reckless behaviour\ninjures, or attempts to injure, or abets in the injury of a wild animal otherwise than in accordance with\nwhich may extend up to one year, or with fine iti accordance with Schedule-II, or both.\n(4) Any person who, in violation of section 16, keeps, attempts to keep or abets in keeping a\nwild animal in captivity otherwise than in accordance with the provisions of this Act, rules and\nregulations shall be punishable with imprisonment for a term which’ may extend up to one year, or\nwith fine in accordance with Schedule-II, or both.\n(5) Any person who, in violation of section 16, uses, attempts to use or abets in using hawks\nfor hawking or dogs for coursing wild animals shall be punishable with imprisonment for a term which\nmay extend up to six months, or with fine in accordance with Schedule-II, or both;\n(6) Any person who contravenes or attempts to contravene or abets in the contravention of,\nsection 17, 18, 19, 20, 21 shall be punishable with imprisonment for a term which may extend up to\none year, or with fine in accordance with Schedule-II, or both;\n(7) Where no specific penalty is provided under this Act for contravention of any of the\nprovisions of this Act, rules and regulations such contravention shall be punishable with a fine which\nmay extend up to one hundred thousand rupees."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Suspension and Revocation",
      "content": "(1) Notwithstanding anything contained in section 27, the\nBoard may, in public interest, or where there is a consistent contravention of this Act, the rules,\nregulations or conditions of a license or certificate of lawful possession issued under this Act, suspend\nor revoke such license or certificate of lawful possession:\nProvided that before taking action under this section, the Board shall issue a notice to show\ncause and may provide an opportunity to rectify the contravention on such conditions as the Board\nmay specify.\n(2) Where the Board revokes or suspends a license or certificate of lawful possession, it may\nundertake all or any of the following actions for continuance of the facilities, namely:__\n(a)     permit the holder of the license or certificate of lawful possession to continue operations\non such terms and conditions as the Board may impose; and\n(b)     in case of a license:\n(i)     contract with another person to immediately take over the operation of the\nfacilities being operated under license; or\n(ii)    appoint an administrator to take over the operation of such facilities.\n(3) The actions specified in clause (b) of sub-section (2) may continue until a successor takes\nover charge of the facilities on such terms and conditions as the Board may determine, including\npayment of compensation for the equipment and materials being used at such facility."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Power of Seizure",
      "content": "(1) The Board may seize any wild animal which is in the possession\nof a person who is not authorized to possess it under this Act or any rules or regulations made\nhereunder, together with any firearm, net, trap, snare, bow, arrow, vehicle, boat or anything whatsoever\nused or suspected to have been used in contravention of any provision of this Act or the rules and\nregulations made hereunder.\n(2) The property seized under sub-section (1) shall be dealt with in accordance with the orders\nof the Court:\nProvided that, if the property is subject to natural decay, it may at any time be sold with the\npermission of the Court and the proceeds shall be dealt with in accordance with the orders of the Court."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Killing or Capturing in Self Defence",
      "content": "Notwithstanding anything contained in this Act,\nit shall not be an offence for any person to kill or capture any wild animal by any means in the defence\nof his own life ,or property or the life and property of any other person. Such killing or capturing of\nany wild animal shall, as soon as may be, be reported to the Board. The trophy or meat of any wild\nanimal so killed shall be the property of the Board and shall be disposed of in such manner as the Board\nmay direct."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Power to Search without Warrant",
      "content": "Any authorized officer, if the has reason to believe\nthat any person has in his possession or control any wild animal or exotic species or trophy or meat in\nan un-authorized manner or has committed an offence under this Act or rules and regulations, may\nsearch any person place, vessel, vehicle, animal, package, receptacle or covering without warrant."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Power to Prevent Commission of Offences",
      "content": "Every officer of the Board and any\nauthorized officer in this behalf shall be competent to take all lawful means to prevent the commission\nof any offence under this Act, and may, in this regard seek assistance of any law enforcement agency\nwhose jurisdiction extends to ICT, including the police or the Federal Investigation Agency, and such\nlaw enforcement agency shall have a duty to provide the assistance requested under this section."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Prosecution for Offence under any other Law",
      "content": "Nothing contained in this Act shall be\ndeemed to prevent any person from being prosecuted under any other law for any act or omission\nwhich constitutes an offence under this Act or from being liable under any other law to any higher\npunishment or penalty than that provided by this Act."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Appointment of Magistrates etc",
      "content": "(1) Notwithstanding anything contained in the Code\nof Criminal Procedure, 1898 (Act V of 1898), Area Magistrate of the First Class within the meaning\nof the said Code shall try offences under this Act.\n(2) No Court other than a Magistrate authorized under sub-section (1) shall try any offence\nunder this Act.\n(3) A Magistrate of the first class competent to try offences under this Act, may, if he thinks\nfit, try in a summary way all or any of the offences."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Appeals from Orders of the Magistrate",
      "content": "Any person aggrieved by any final order or by\nany sentence of the Magistrate passed under this Act may, within thirty days of communication of such\norder or sentence, prefer an appeal to the Court of Session."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Wildlife Check post",
      "content": "(1) The Board, may notify the establishment of a wildlife check\npost and erection of a barrier at any place as deemed appropriate so as to determine whether or not an\noffence under this Act has been committed.\n(2) Every person crossing a wildlife check post, whether on foot or in a vehicle or by any other\nmeans of transport, shall be liable to stop by the check post and off er himself and his belongings for\nchecking by the check post staff to their satisfaction."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Indemnity and Bar of Jurisdiction",
      "content": "(1) No suit, prosecution or other legal proceeding\nshall lie against the Federal Government, the Board or any other person for anything done or intended\nto be done in good faith under this Act, the rules, or the regulations.\n(2) No court shall call in question, or permit to be called in question, anything done or any\naction taken under this Act."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Act to Override Other Laws",
      "content": "The provisions of this Act shall have effect\nnotwithstanding anything to the contrary contained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Power to Make Rules",
      "content": "The Federal Government may, by notification in the official\nGazette make rules for matters required to be prescribed under this Act or for any other matter required\nto give effect to the provisions of this Act."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Power to Make Regulations.__ The Board may make",
      "content": "regulations with approval of the\nFederal Government for the purposes of this Act."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Power to Issue Directives, Circulars, Guidelines, etc",
      "content": "The Board shall have the power\nto issue such directives, codes, guidelines, circulars or notifications as are necessary to carry out the\npurposes of this Act or the rules and regulations made hereunder, not inconsistent with the provjsions\nof this Act or the rules and regulations made hereunder."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Sums payable to the Board to be recoverable as land revenue",
      "content": "All sums payable to the\nBoard in accordance with the provisions of this Act and the rules, including penalties imposed by the\nBoard, shall be recoverable as arrears of land revenue."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Repeal & Savings",
      "content": "(1) The Islamabad Wildlife (Protection, Preservation, Conservation\nand Management) Ordinance (LXX of 1979), is hereby repealed.\n(2) Notwithstanding the repeal of the Islamabad Wildlife (Protection, Preservation,\nConservation and Management) Ordinance (LXX of 1979), or anything contrary contained herein, all\nrules, regulations, regulatory requirements, procedures, notifications issued, or made, decisions,\ndisciplinary action , taken by the Board, or any other Committee of the Islamabad Wildlife Board shall\nbe deemed to have been validly made under the provisions of this Act until altered, repealed or\nmodified by the new Board constituted under this Act shall continue in force until repealed or altered\nby rules or regulations made under this Act.\nUnder Section 2 u\nThe following wildlife species are declared as protected until otherwise as per provisions of this Act;\nshall not be hunted, killed, trapped, captured or traded.\n(i)     All game animals when immature.\n(ii)    All females of game animals when:\n(a)        pregnant;\n(b)        suckling or feeding young ones; and\n(c)        accompanied with immature offspring.\n(iii).   All species, including native & exotic, listed on Appendix-I of the Convention on International\nTrade in Endangered Species of Wild Fauna and Flora (CITES), except if specified otherwise.\n(iv).    All species, including native & exotic, listed on Appendix-I of the Convention on the\nConservation of Migratory Species of Wild Animals (CMS), except if specified otherwise.\n(v).    Ungulate mammals;\n1      Ibex                 All species           Sindhi Jungli Bakra/Ter,\nPashin, Pachin, Sarah\n2      Urial                All species           Urial/Hurian, Shah Kohi,\nKoch, Garand, Gad\n3      Markhor              All species           Markhor\n4      Blue Sheep or        Pseudois nayaur\nBharal\n5      Gray goral           Naemorhedus goral     Goral\n6      Indian Gazella or    Gazella gazelle       Hiran, Chinkara\nChinkara\n7      Goitred of Parsian   Gazella               Pharal Ghazal\nGazella              subgutterosa\n8      Hog Deer             Axis porcinus.        Para,\n9      Barking deer         Muntiacus Muntjak     Muntjak, Kakar, Maya\n10     Wild Ass             Equus hemionus        Gor khar, Jangli gadha\nkhur\n11     Blue Bull            Boselaphus            Nil Gai\ntragocamelus\n12     Black Buck           Antelope              Kala hiran,\ncervicapara\n13     Kashmir Stag         Cervus elaphus        Barasingha, Hangal, Honglu.\n(vi)    Carnivore mammals;\n1    All big cats\nincluding native\nand exotic\nspecies.\n2\n3    Grey Wolf            Canis lupus           Bharria, Baghar\n4    Lynx                 Felis Lynx            patsalan, Phiauku\n5    Caracal              Felis caracal         Sish-gosh, Ech, Harwullo\n6    Leopard Cat          Felis Bengalensis     Chite Billi, Ban Bilar\n7    Sand Cat             Felis margarita\n8    Desert Cat           Felis silvestris/     Sahrai billi, Rann billo\nFellis libyca\n9    Fishing Cat          Prionailurus          Machhli khore billi, Fehai billo\nvaverrinus\n10   Jungle Cat           Felis chaus           Jungli billi, Jhangrar billo\n13   Civet                All species           Phawwi Khastoori billo\n14   Marten               All species\n15   Striped Hyena        Hyaena hyaena         Lagar Bagar, Charakh\n16   Honey Badger/        Mellivora capensis    Bijoo, Gorpat\nRatel\n17   Scaly-anteater,      Manis crassicaudata   Salla\nIndian Pangolin\n18   Hedgehogs            All species           Jaho chuha, Jaho\n19   Fox                  All species           Lal Loamri, Lomer, Lokar\n20   Common Otter or      Lutra lutra           Ludher, Ud-bilaw, Pani Kutta,\nLudher                                     Sagi Ab\n21   Otters               All species           Ludher, Ludra Udni, Ludhrhoo\n25   Mongoose             All species           Neaola, Nore\n(vii)   Primate mammals\n1    Rhesus monkey        Macaca mulatta        bandar,\n2    Gray Langur          Semnopithecus         Bandar, langur\nentellus\n3    Brown bear           Ursus arctos          Safed Bhalu, bhoora reech,\n4    Black Bear           Ursus thibetanus      Kala Reech, Bhalu,\n(viii) All aquatic mammals such as Dolphins, Whales, and Dugong whether found in fresh waters or\nmarine waters.\n(ix)    Rodents mammals;\n1     Squirrel          All species\n(x)     Ducks;\n1      Marbled Teal                Marmaronetta angustirostris\n2      Ferruginous Duck            Aythya nyroca\n3      Spot-bill Duck              Anas poecilorhyncha\n4      Cotton Teal                 Nettapus coromandelicus\n5      Bear's pochard              Aythya baeri\n6      Comb Duck                   Sarkidiornis melanotos\n7      White-winged                Cairine scutulata\nWood Duck\n8      White headed Duck           Oxyura leucocephala\n(xi)    All individuals of water bird species such as Herons, Egrets, Flamingos, Pelicans, Ibis, Storks,\nGrebes, Plovers, Lapwings, Geese, Swans and Sandpipers;\n(xii)   All individuals of Raptor species such as Hawks, Buzzards, Eagles, Ovis, Harriers, Ospreys,\nVultures, Kites, Falcons and Kestrels;\n(xiii) All individuals of following other bird species;\n1     Woodpeckers\n2     Starlings\n3     Plum-headed parakeet (Psittacula cyanocephala)\n4     Slaty-headed parakeet (Psittacula himalayana)\n5     Rose-ringed parakeet (Psittacula krameri)\n6     Alexandrine Parakeet (Psittacula eupatria)\n(xiv)   The Pheasants, Chukar and Partridge of family PHASIANIDAE including the following:\n1    Common Peafowl               Pavo cristatus\n2    Black                        Francolinus francolinus\nFrancolin/Partridge\n3    Chukor Partridge             Electoris gracea\n4    Western Horned               Tragopan melanocephalus\nTragopan\n5    Kalij pheasant               Lophura leucomelanos\n6    Himalayan monal              Lophophorus impejanus\n7    Koklass pheasant             Pucrasia macrolopha\n8    Cheer pheasant               Catreus wallichii\n9    Red junglefowl               Gallus gallus\n(xv)    All Cranes, Bustards and Pigeons\n(xvi)   All members of Reptile group that includes:\n(a)   Crocodiles\n(b)   Gharial\n(c)   All Snake species\n(d)   All Lizards species\n(e)   All Skins/Lacertas, and Geckos species\n(f)   All Marine Turtle species\n(g)   All Freshwater Turtle species\n(h)   All Tortoise species\n(xvii). All Corals found in the coastal belt or marine waters of Pakistan.\nSchedule II\nUnder section 25\nSr.No.   Section              Penalty"
    }
  ],
  "definitions": [
    {
      "term": "Animals",
      "definition": "mammals, birds, reptiles, amphibians, fish, insects, or arachnids, their young and also in the cases of amphibians, reptiles and birds, their eggs excluding livestock and poultry;",
      "source_provision": "sec2"
    },
    {
      "term": "Authorised officer",
      "definition": "any officer authorised by the Board to carry out functions under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Nature Conservation and Wildlife Management Board constituted under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Beard Member",
      "definition": "a Member of the Board appointed under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Capture",
      "definition": "the taking alive of any wild animal;",
      "source_provision": "sec2"
    },
    {
      "term": "Court",
      "definition": "Court established under section 34;",
      "source_provision": "sec2"
    },
    {
      "term": "Exotic Species",
      "definition": "species, both flora and fauna, which does not occur in an area naturally and it is introduced or intended to be introduced-from outside of its natural occurrence;",
      "source_provision": "sec2"
    },
    {
      "term": "Fund",
      "definition": "the Conservation of Nature Fund constituted under section 11;",
      "source_provision": "sec2"
    },
    {
      "term": "Habitat",
      "definition": "natural environment, including biotic and a biotic factors essential for free survival of an animal, plants or any other living organisim;",
      "source_provision": "sec2"
    },
    {
      "term": "Hunting",
      "definition": "any Act directed to the killing or capturing of a Wild animal, and includes but is not limited to fishing, angling, netting, the taking of nests or eggs of such animals and their parts, products or derivatives thereof;",
      "source_provision": "sec2"
    },
    {
      "term": "Humus",
      "definition": "the layer of dead organic matter below the fallen leaves, where the phenomenon of degradation by the soil bio-diversity takes place;",
      "source_provision": "sec2"
    },
    {
      "term": "indigenous",
      "definition": "an animal species native to a specified area, a country or a region;",
      "source_provision": "sec2"
    },
    {
      "term": "Invasive species",
      "definition": "invasive alien species introduced, in a habitat where they outgrow the native species and may reach a level where they could become a weed or a pest;",
      "source_provision": "sec2"
    },
    {
      "term": "ICT",
      "definition": "the Islamabad Capital Territory;",
      "source_provision": "sec2"
    },
    {
      "term": "National Park",
      "definition": "an area declared as such under section 12;",
      "source_provision": "sec2"
    },
    {
      "term": "Nature",
      "definition": "the phenomena of the physical world collectively, including plants, animals, the landscape, and other features and products of the earth, as opposed to humans or human creations;",
      "source_provision": "sec2"
    },
    {
      "term": "Plant",
      "definition": "a living organism of the kind exemplified by trees, shrubs, herbs, grasses, ferns and mosses, typically growing in a permanent site, absorbing water and in-organic substances through its roots, and synthesising nutrients in its leaves by photosynthesis using the green pigment chlorophyll;",
      "source_provision": "sec2"
    },
    {
      "term": "Protected Animals",
      "definition": "a wild animal included in Schedule-I whose hunting, killing, trapping, capturing, possession or trade is not allowed;",
      "source_provision": "sec2"
    },
    {
      "term": "Protected Area",
      "definition": "an area declared as under Part-V of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Trophy",
      "definition": "the dead body of a wild animal or any horn, antler, tooth, tusk, hoof, skin hair, feather, egg, shell or other durable bone claw part of any wild animal, whether or not included in a manufactured or processed article;",
      "source_provision": "sec2"
    },
    {
      "term": "Wild Animal",
      "definition": "an animal which is usually found in a natural wild environment and is not predisposed to be domesticated or tamed. Such animals shall also include any animal which has been declared a protected animal in Schedule-I or notified by Ministry of Climate Change and Environmental Coordination as protected or wild animal; and",
      "source_provision": "sec2"
    },
    {
      "term": "Wildlife",
      "definition": "the natural flora and fauna and their habitat including organic soil with humus and natural water bodies.",
      "source_provision": "sec2"
    }
  ]
}
