{
  "id": "pk-islamabad-real-estate-regulation-and-development-act-2020",
  "type": "statute",
  "title": "Islamabad Real Estate (Regulation and Development) Act, 2020.",
  "title_en": "Islamabad Real Estate (Regulation and Development) Act, 2020.",
  "short_name": "IREAD",
  "status": "in_force",
  "issued_date": "2021-07-08",
  "in_force_date": "2021-07-08",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NpaZlq-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Islamabad Real Estate (Regulation and Development) Act, 2020. (I of 2020) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec62",
      "section": "62",
      "title": "Section 62. Factors to be taken into account by inquiry officer",
      "content": "While adjudging the\nquantum of compensation or interest, as the case may be, under section 61, the inquiry officer\nshall have due regard to the following factors, namely:—\n(a)   the amount of disproportionate gain or unfair advantage, whereverquantifiable,\nmade as a result of the default;\n(b)   the amount of loss caused as a result of the default;\n(c)   the repetitive nature of the default; and\n(d)   such other factors which the inquiry officer considers necessary to the case in\nfurtherance of justice."
    },
    {
      "provision_ref": "sec63",
      "section": "63",
      "title": "Section 63. Officers and other employees of Appellate Tribunal",
      "content": "(1) The Federal\nGovernment shall provide the Appellate Tribunal with such officers and employees as it may\ndeem fit.\n(2) The officers and employees of the Appellate Tribunal shall discharge their functions\nunder the general superintendence of its Chairperson of the Appellate Tribunal.\n(3)    The salary and allowances payable to, and the other terms and conditions of service\nof, the officers and employees of the Appellate Tribunal shall be such as may be prescribed."
    },
    {
      "provision_ref": "sec64",
      "section": "64",
      "title": "Section 64. Powers of Tribunal",
      "content": "(1) The Appellate Tribunal shall be bound by the procedure\nlaid down by the Code of Civil Procedure, 1908.\n(2) The Appellate Tribunal shall also be bound by the rules of evidence contained in the\nQanun-e-Shahadat, 1984.\n(3)   The Appellate Tribunal shall have, for the purpose of dischargingits functions under\nthis Act, the same powers as are vested in a civil court under the Code of Civil Procedure, 1908\nin respect of the following matters, namely:—\n(a)   summoning and enforcing the attendance of any person and examining him\non oath;\n(b)   requiring the discovery and production of documents;\n(c)   receiving evidence on affidavits;\n(d)   issuing commissions for the examinations of witnesses ordocuments;\n(e)   reviewing its decisions;\n(f)   dismissing an application for default or directing it ex parte; and\n(g)   any other matter which may be prescribed.\n(4) All proceedings before the Appellate Tribunal shall be deemed to be judicial\nproceedings within the meaning of sections 193 and 228 of the Pakistan Penal Code, 1860 (Act\nXLV of 1860) and the Appellate Tribunal shall be deemed to be a court for the purposes of\nsections 480 and 482 of the Code of Criminal Procedure, 1898 (Act V of 1898). No court other\nthan Appellate Tribunal shall have or exercise any jurisdiction with respect to any matter to which"
    },
    {
      "provision_ref": "sec65",
      "section": "65",
      "title": "Section 65. Administrative Powers of the Chairman of Appellate Tribunal",
      "content": "The\nChairperson shall have powers of general superintendence and direction in the conduct of the\naffairs of Appellate Tribunal and he shall, in addition to presiding over the meetings of the\nAppellate Tribunal exercise and\ndischarge such administrative powers and functions of the Appellate Tribunal as may be\nprescribed."
    },
    {
      "provision_ref": "sec66",
      "section": "66",
      "title": "Section 66. Vacancies etc. not to invalidate proceeding of Appellate Tribunal",
      "content": "No act or\nproceeding of the Appellate Tribunal shall be invalid merely by reason of—\n(a)   any vacancy in, or any defect in the constitution of, the Appellate Tribunal, or\n(b)   any defect in the appointment of a person acting as a Member of theAppellate\nTribunal; or\n(c)   any irregularity in the procedure of the Appellate Tribunal not affecting the merits\nof the case."
    },
    {
      "provision_ref": "sec67",
      "section": "67",
      "title": "Section 67. Right to legal representation",
      "content": "The applicant or appellant or complainant may\neither appear in person or authorize one or more chartered accountants or company secretaries or\ncost accountants or legal practitioners or any of its officers to present his or its case before the\nAppellate Tribunal or the Regulatory Authority or the inquiry officer, as the case may be. The\nAppellate Tribunal can summon the applicant or appellant or complainant or the person against\nwhom the complaint has been directed to appear in person before the Appellate Tribunal or the\nRegulatory Authority or the inquiry officer, as the case may be."
    },
    {
      "provision_ref": "sec68",
      "section": "68",
      "title": "Section 68. Orders passed by the Appellate Tribunal to be executable as a decree",
      "content": "(1)\nEvery order made by the Appellate Tribunal under this Act shall be executable by the Appellate\nTribunal as a decree of civil court, and for this purpose, the Appellate Tribunal shall have all the\npowers of a civil court.\n(2) Notwithstanding anything contained in sub-section (1), the Appellate Tribunal may\ntransmit any order made by it to a civil court havinglocal jurisdiction and such civil court shall\nexecute the order as if it were a decreemade by the court."
    },
    {
      "provision_ref": "sec69",
      "section": "69",
      "title": "Section 69. Penalty for failure to comply with orders of Appellate Tribunal by Developer",
      "content": "If any developer, who fails to comply with, or contravenes any of the orders, decisions or\ndirections of the Appellate Tribunal, he shall bepunishable with imprisonment for a term which\nmay extend up to three years or with fine for every day during which such default continues,\nwhich may cumulatively extend up to ten percent of the estimated cost of the real estate project,\nor with both."
    },
    {
      "provision_ref": "sec70",
      "section": "70",
      "title": "Section 70. Penalty for failure to comply with orders of Appellate Tribunal by Real Estate",
      "content": "Agent.—If any real estate agent, who fails to comply with, or contravenes any of the orders or\ndirections of the Authority, he shall be liable to a penalty for every day during which such default\ncontinues, which may cumulatively extend up to five per cent of the estimated cost of plot,\napartment orbuilding, as the case may be, of the real estate project, for which the sale or purchase\nhas been facilitated and as determined by the Authority."
    },
    {
      "provision_ref": "sec71",
      "section": "71",
      "title": "Section 71. Penalty for failure to comply with orders of Appellate Tribunal by Real Estate",
      "content": "Agent.—If any real estate agent, who fails to comply with, or contravenes any of the orders,\ndecisions or directions of the Appellate Tribunal, he shall be punishable with imprisonment for a\nterm which may extend up to one year or with fine for every day during which such default\ncontinues, which may cumulatively extend up to ten percent of the estimated cost of plot,\napartment or building, as the case may be, of the real estate project, for which the sale or purchase\nhas been facilitated, or with both."
    },
    {
      "provision_ref": "sec72",
      "section": "72",
      "title": "Section 72. Penalty for failure to comply with orders of Appellate Tribunal by allottee",
      "content": "If\nany allottee, who fails to comply with, or contravenes any of the orders or directions of the\nAppellate Tribunal, as the case may be, he shall be punishable with imprisonment for a term\nwhich may extend up to one year orwith fine for every day during which such default continues,\nwhich may cumulatively extend up to ten percent of the plot, apartment or building cost, as the\ncase may be, or with both."
    },
    {
      "provision_ref": "sec73",
      "section": "73",
      "title": "Section 73. Appeal to High Court",
      "content": "(1) Any person aggrieved by any decision or order of the\nAppellate Tribunal, may, file an appeal to the Islamabad High Court, within a period of sixty days\nfrom the date of communication of the decision or order of the Appellate Tribunal, to him, on any\none or more of the grounds specified in section 100 of the Code of Civil Procedure, 1908 (Act\nNo. Vof 1908):\nProvided that the Islamabad High Court may entertain the appeal afterthe expiry of the\nsaid period of sixty days, if it is satisfied that the appellant was prevented by sufficient cause from\npreferring the appeal in time.\n_______________\nFINANCE, ACCOUNTS, AUDITS AND REPORTS"
    },
    {
      "provision_ref": "sec74",
      "section": "74",
      "title": "Section 74. Grants and Loans by Federal Government",
      "content": "The Federal Government may, after\ndue appropriation made by the Parliament in this behalf, make to the Authority any grants and\nloans of such sums of money as seed money that Government may consider necessary and release\nit to the senior Administration Officer of the Authority to spend it on establishment of the office\nof the Authority with the assistance of the Ministry of Interior, Government of Pakistan. The\nAuthority, in time, shall generate its own sources of funding for its function as well."
    },
    {
      "provision_ref": "sec75",
      "section": "75",
      "title": "Section 75. Constitution of Fund",
      "content": "(1) The Federal Government shall constitute a fund to be\ncalled the „Real Estate Regulatory Fund‟ and there shall becredited thereto,—\n(a)   all Government grants received by the Authority;\n(b)   the fees received under this Act; and\n(c)   the interest accrued on the amounts referred to in clauses (a) to (b).\n(2)   The Fund shall be spent on—\n(a)   the salaries and allowances payable to the Chairperson and other Members, the\ninquiry officer and the administrative expenses including the salaries and\nallowances payable to the officers and other employees of the Authority and the\nAppellate Tribunal; and\n(b)   the other expenses of the Authority in connection with its establishment and the\ndischarge of its functions and for the purposes of this Act.\n(3) The Fund shall be administered by a committee of such Members of the Authority\nas may be determined by the Chairperson and before appointment of any Members of the\nAuthority or its Chairperson, by the Administration Officer of the Authority.\n(4) The committee appointed under sub-section (3) shall spend monies out of the Fund\nfor carrying out the objects for which the Fund has been constituted."
    },
    {
      "provision_ref": "sec76",
      "section": "76",
      "title": "Section 76. Crediting sums realized by way of penalties to the Fund",
      "content": "All sums realized by\nway of penalties imposed by the Appellate Tribunal or the Authority shall be credited to the\nFederal treasury."
    },
    {
      "provision_ref": "sec77",
      "section": "77",
      "title": "Section 77. Budget, accounts and audit",
      "content": "(1) The Authority shall prepare a budget, maintain\nproper accounts and other relevant records and prepare an annual statement of accounts in such\nform as may be prescribed by the Federal Government in consultation with the Auditor General\nof Pakistan.\n(2)   The accounts of the Authority shall be audited by the Auditor General of Pakistan at\nsuch intervals as may be specified by him and any\nexpenditure incurred in connection with such audit shall be payable by the Authority to the\nAuditor General of Pakistan.\n(3) The Auditor-General and any person appointed by him in connection with the audit\nof the accounts of the Authority under this Act shall have the same rights and privileges and\nauthority in connection with such audit as the Auditor General generally has in connection with\nthe audit of Government accounts and, in particular shall have the right to demand and production\nof books, accounts, connected vouchers and other documents and papers, and to inspect any of\nthe offices of the Authority.\n(4) The accounts of the Authority, as certified by the Auditor-General of Pakistan or any\nother person appointed by him in this behalf, together with the audit report thereon shall be\nforwarded annually to the Federal Government bythe Authority and the Federal Government\nshall cause the audit report to be laid, as soon as may be after it is received, before each House of\nParliament (the Federal Legislature)."
    },
    {
      "provision_ref": "sec78",
      "section": "78",
      "title": "Section 78. Annual report",
      "content": "(1) The Authority shall prepare once in every year, in such form\nand at such time as may be prescribed by the Federal Government,—\n(a)   a description of all the activities of the Authority for the previous year;\n(b)    the annual accounts for the previous year; and\n(c)   the programmes of work for the coming year.\n(2) A copy of the report received under sub-section (1) shall be laid, as soon as may be\nafter it is received, before the Parliament."
    },
    {
      "provision_ref": "sec79",
      "section": "79",
      "title": "Section 79. Bar of jurisdiction",
      "content": "No civil court shall have jurisdiction to entertain any suit or\nproceeding in respect of any matter which the Authority or the inquiry officer or the Appellate\nTribunal is empowered by or under this Act to determine and no injunction shall be granted by\nany court or other authority in respect of any action taken or to be taken in pursuance of any power\nconferred byor under this Act."
    },
    {
      "provision_ref": "sec80",
      "section": "80",
      "title": "Section 80. Delegation",
      "content": "The Authority may, by general or special order in writing, delegate to\nany other Authority or Department or any member of\nAuthority, officer of the Authority or any other person subject to such conditions, if any, as may\nbe specified in the order, such of its powers and functions under this Act, except the power to\nmake regulations under this Act, as it may deem necessary."
    },
    {
      "provision_ref": "sec81",
      "section": "81",
      "title": "Section 81. Power to supersede Authority",
      "content": "(1) If, at any time, the Federal Government is\nof the opinion,—\n(a)   that, on account of circumstances beyond the control of the Authority, it is\nunable to discharge the functions or perform the duties imposed on it by or under\nthe provisions of this Act; or\n(b)    that the Authority has persistently defaulted in complying with any direction\ngiven by the Federal Government under this Act or in the discharge of the\nfunctions or performance of the duties irriposed on it by or under the provisions\nof this Act and as a result of such default the financial position of the Authority\nor the administration of the Authority has suffered; or\n(c)   that circumstances exist which render it necessary in the public interest so to do,\nthe Federal Government may, by notification, supersede the Authority for such\nperiod, not exceeding six months, as may be specified in the notification and\n(d)   appoint a person and may direct him to exercise powers and discharge functions\nunder this Act:\nProvided that before issuing any such notification, the Federal Government\nshall give a reasonable opportunity to the Authority to make representations\nagainst the proposed supersession and shall consider the representations, if any,\nof the Authority.\n(2)   Upon the publication of a notification under sub-section (1)superseding the\nAuthority,\n(a)   the Chairperson and other Members shall, as from the date of supersession,\nvacate their offices as such;\n(b)   all the powers, functions and duties which may, by or under the provisions of\nthis Act, be exercised or discharged by or on behalf of the Authority shall, until\nthe Authority is reconstituted under sub- section (3), be exercised and\ndischarged by the person or persons referred to in sub-section (1); and\n(c)   all properties owned or controlled by the Authority shall, until the Authority is\nreconstituted under sub-section (3), vest in the Federal Government.\n(3) On or before the expiration of the period of supersession specified in the notification\nissued under sub-section (1), the Federal Government shall reconstitute the Authority by a fresh\nappointment of its Chairperson and other members and in such case any person who had vacated\nhis office under clause (a) of sub-section (2) shall not be deemed to be disqualified for re-\nappointment.\n(4) The Federal Government shall cause a copy of the notification issued under sub-\nsection (1) and a full report of any action taken under this section and the circumstances leading\nto such action to be laid before each House of Parliament."
    },
    {
      "provision_ref": "sec82",
      "section": "82",
      "title": "Section 82. Power to issue Directions to Authority and obtain reports and returns",
      "content": "(1)\nWithout prejudice to the foregoing provisions of this Act, the Authority shall, in exercise of its\npowers and in performance of its functions under this Act, be bound by such directions on\nquestions of policy, as the Federal Government may give in writing to it from time to time:\nProvided that the Authority shall, as far as practicable, be given an opportunity to express\nits views before any direction is given under this sub- section.\n(2)    If any dispute arises between the Ministry and the Authority as to whether a question\nis or is not a question of policy, the decision of the Federal Government thereon shall be final.\n(3)    The Authority shall furnish to the Ministry such returns or other information with\nrespect to its activities as the Ministry may, from time to time, require."
    },
    {
      "provision_ref": "sec83",
      "section": "83",
      "title": "Section 83. Powers to make rules",
      "content": "(1) The Federal Government, within a period of six months\nof the commencement of this Act, by notification, make rules for carrying out the provisions of\nthis Act in particular, and without prejudice to the generality of the foregoing power and publish\nthem in the official Gazette, such rules may provide for all or any of the following matters,\nnamely:—\n(a)    standard fees to be levied on the developer, the allottees or the real estate agent\nfor registration and renewal of registration with the Authority under this Act;\n(b)    the maintenance and preservation of books of account, records and documents\nof the Authority;\n(c)    the administrative powers of the Chairperson of the Authority and the salaries\nand allowances payable to, and the other terms and conditions of the\nChairperson and members of the Authority;\n(d)    the manner of inquiry by the Inquiry Officer , authority and appellate Authority;\n(e)    the additional functions which may be performed by the Authority;\n(f)    the manner of implementation of the order, direction or decisions of the inquiry\nofficer, the Authority or the Appellate Tribunal under this Act;\n(g)    the salaries and allowances payable to, and the other terms and conditions of\nservice of, the Chairperson and other Members of the Authority and Appellate\nTribunal;\n(h)    the procedure for inquiry of the charges of administrative or financial\nirregularities against the Chairperson or Member of the Tribunal;\n(i)   the powers of the Chairperson of the Appellate Tribunal;\n(j)   the form to be specified in which the Authority shall prepare a budget, maintain\nproper accounts and other relevant records and prepare an annual statement of\naccounts under sub-section (1) of section 77;\n(k)    the form in which and time at which the Authority shall prepare an annual report\nunder sub-section (1) of section 78;\n(l)   any other matter which is to be, or may be, prescribed; and\n(m)    any other powers of the Authority or the Appellate Tribunal.\n(2) The Authority, within a period of six months of the commencement of this Act, by\nnotification, make rules for carrying out the provisions of this Act in particular, and without\nprejudice to the generality of the foregoing power and publish them in the official Gazette by its\nown authority, such rules may provide for all or any of the following matters, namely:—\n(a)   Application form and manner of making application and fee and information\nand documents with the application by the Developer to Authority for his\nregistration;\n(b)   the discharge of other functions by the real estate agent under clause (e) of\nsection 10;\n(c)   the rate of interest payable under any provision of this Act;\n(d)   the administrative powers of the officers and other employees of the Authority\nand the salaries and allowances payable thereto, and the other terms and\nconditions of their service;\n(e)   the administrative powers of the officers and other employees of the Appellate\nTribunal and the salaries and allowances payable thereto, and the other terms\nand conditions of service of, the officers and employees of the Appellate\nTribunal;\n(f)   the details to be published on the website by the Authority and the developer;\n(g)   the manner of recovery of interest, penalty and compensation from the\ndeveloper; and\n(h)   any other matter which is to be, or may be, prescribed."
    },
    {
      "provision_ref": "sec84",
      "section": "84",
      "title": "Section 84. Powers to make regulations of the authority",
      "content": "(1) The Authorityshall, within a\nperiod of three months of its establishment, by notification, make regulations, consistent with\nthis Act and the rules made thereunder to carry out the purposes of this Act.\n(2) In particular, and without prejudice to the generality of the foregoing power, such\nregulations may provide for all or any of the following matters, namely:—\n(a)   the form and manner of making application and fee payable herewith under sub-\nsection (1) of section 4;\n(b)   the form of application and the fees for extension of registration under section\n6;\n(c)   such other information and documents required under clause (f) of sub-section\n(1) of section 11;\n(d)   display of sanctioned plans, layout plans along with specifications, approved by\nthe an authority empowered by law, for display under clause (a) of sub-section\n(3) of section 11;\n(e)    preparation and maintenance of other details under sub-section (6) of section\n11;\n(f)   time, places and the procedure in regard to transaction of business at the\nmeetings of the Authority under sub-section (1) of section 30;\n(g)    the form, manner and fees for filing a complaint under sub-section\n(2) of section 32; and\n(h)    any other matter which is required to be, or may be, specified by regulation or\nin respect of which provision is to be made by regulation."
    },
    {
      "provision_ref": "sec85",
      "section": "85",
      "title": "Section 85. Members etc. to be public servants",
      "content": "The Chairperson, Members and other\nofficers and employees of the Authority, and the Appellate Tribunal and the inquiry officer shall\nbe deemed to be public servants within the meaning of section 21 of the Pakistan Penal Code."
    },
    {
      "provision_ref": "sec86",
      "section": "86",
      "title": "Section 86. Act to have overriding effect",
      "content": "The provisions of this Act shall have an overriding\neffect, notwithstanding anything inconsistent therewith contained in any other law for the time\nbeing in force."
    },
    {
      "provision_ref": "sec87",
      "section": "87",
      "title": "Section 87. Protection of actions taken in good faith",
      "content": "No suit, prosecution or other legal\nproceedings shall lie against the Federal Government or the Authority or any officer of the Federal\nGovernment or any member, officer or other employees of the Authority for anything which is in\ngood faith done or intended to be done under this Act or the rules or regulations made thereunder\nas determined by the Appellate Tribunal under this Act."
    },
    {
      "provision_ref": "sec88",
      "section": "88",
      "title": "Section 88. Power to remove difficulties",
      "content": "(1) If any difficulty arises in giving effect to the\nprovisions of this Act, the Federal Government may, by order, published in the official Gazette,\nmake such provisions not inconsistent with the provisions of this Act as may appear to be\nnecessary for removing the difficulty:\nProvided that no order shall be made under this section after the expiryof two years\nfrom the date of the commencement of this Act.\n(2) Every order made under this section shall be laid, as soon as maybe, before each\nHouse of the Parliament."
    }
  ],
  "definitions": []
}
