{
  "id": "pk-islamabad-subordinate-judiciary-service-tribunal-act-2016",
  "type": "statute",
  "title": "Islamabad Subordinate Judiciary Service Tribunal Act, 2016",
  "title_en": "Islamabad Subordinate Judiciary Service Tribunal Act, 2016",
  "short_name": "ISJST",
  "status": "in_force",
  "issued_date": "2016-01-28",
  "in_force_date": "2016-01-28",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2JwZpY%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Islamabad Subordinate Judiciary Service Tribunal Act, 2016 (V of 2016) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Act may be called the Islamabad Subordinate\nJudiciary Service Tribunal Act, 2016.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless the context otherwise requires—\n(a)     “Chairman” means the Chairman of the Tribunal;\n(b)     “Government” means the Federal Government;\n(c)     “Member” means a Member of the Tribunal and includes the Chairman;\n(d)     “Member of subordinate judiciary” means and includes all Judicial Officers\nwho are or have been under the administrative control of the Islamabad High\nCourt; and\n(e)     “Tribunal” means the Tribunal established under this Act and includes a\nBench thereof."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Tribunal",
      "content": "(1) The President may, subject to subsection (3), by notification in the official\nGazette, establish a Service Tribunal for the members of the subordinate judiciary of the Islamabad\nCapital Territory.\n(2) The Tribunal shall have exclusive jurisdiction in respect of matters relating to the terms\nand conditions of service of the members of subordinate judiciary including disciplinary matters.\n(3) The Tribunal shall consist of three judges of the Islamabad High Court nominated by the\nChief Justice, the most senior of whom shall be the Chairman:\nProvided that a Judge against whose orders an appeal is preferred shall not be member of the\nTribunal."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Constitution of benches",
      "content": "(1) Notwithstanding anything contained in section 3, the\nChairman may constitute a Bench consisting of two members with or without the Chairman and\nwhen so constituted, the Bench shall be deemed to be a Tribunal.\n(2) If a Bench is unable to arrive at a unanimous decision, in an appeal, the matter shall be\nplaced before the full Tribunal and the decision of the Tribunal shall be expressed in terms of the\nopinion of the majority.\n(3) The Chairman may, at any stage of hearing of an appeal withdraw it from the Tribunal\nand entrust it to a Bench or may withdraw any appeal pending before a Bench and make it over to\nanother Bench or to the Tribunal."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Appeal to Tribunal",
      "content": "Any member of subordinate judiciary aggrieved by any final order,\nwhether original or appellate, made by a departmental authority in respect of any of the terms and\nconditions including disciplinary matters of his service may, within thirty days of the communication\nof such order to him or within six months of the establishment of the Tribunal, whichever is later,\nprefer an appeal to the Tribunal:\nProvided that—\n(a)     where an appeal, review or representation to a departmental authority is\nprovided under the Civil Servants Act, 1973 (LXXI of 1973), or any rules\nagainst any such orders, no appeal shall lie to the Tribunal unless the\naggrieved person has preferred an appeal or application for review or\nrepresentation to such departmental authority and a period of ninety days has\nelapsed from the date on which such appeal, application, or representation was\nso preferred; and\n(b)     no appeal shall lie to the Tribunal against an order or decision of a\ndepartmental authority determining the fitness or otherwise of a person to be\nappointed to, or hold a particular post or to be promoted to a higher post.\nExplanation.—In this section 'departmental authority means the authority, other than a\nTribunal which is competent to make an order in respect of any of the terms and conditions of\nservice of members of subordinate judiciary."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Powers of Tribunal",
      "content": "(1) The Tribunal may, on appeal, confirm, set aside vary or modify\nthe order appealed against.\n(2) The Tribunal shall, for the purpose of deciding any appeal, be deemed to be a civil court\nand shall have the same powers as are vested in such court under the Code of Civil Procedure, 1908\n(V of 1908), including the powers of—\n(a)     enforcing the attendance of any person and examining him on oath;\n(b)     compelling the production of documents; and\n(c)     issuing commission for the examination of witnesses and documents.\n(3) No court fee shall be payable for preferring an appeal to, or filling, exhibiting or recording\nany document in, or obtaining any document from a Tribunal."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Review",
      "content": "(1) The Tribunal shall have the power to review its final order on a review\npetition filed by an aggrieved party within thirty days of the order on the following grounds,\nnamely:—\n(i)     discovery of new and important matter or evidence which, after exercise of\ndue diligence, was not within knowledge of the petitioner or could not be\nproduced by him at the time when the order was passed.\n(ii)    on account of some mistake or error apparent on the face of record; or\n(iii)   for any other sufficient cause.\n(2) The Tribunal shall decide the review petition within thirty days.\n(3) The Tribunal may confirm, set aside, vary or modify the judgment or order under review."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Limitation",
      "content": "The provisions of sections 5 and 12 of the Limitation Act, 1908 (IX of\n1908), shall apply to appeals under this Act."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Transfer of appeals",
      "content": "All appeals pending before the Tribunal established under the\nService Tribunals Act, 1973 (LXXI of 1973), relating to members of subordinate judiciary shall\nstand transferred to the Tribunal established under this Act."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Power to make rules",
      "content": "The Government may, by notification in the official Gazette,\nmake rules for carrying out the purposes of this Act."
    }
  ],
  "definitions": [
    {
      "term": "Chairman",
      "definition": "the Chairman of the Tribunal;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "a Member of the Tribunal and includes the Chairman;",
      "source_provision": "sec2"
    },
    {
      "term": "Member of subordinate judiciary",
      "definition": "and includes all Judicial Officers who are or have been under the administrative control of the Islamabad High Court; and",
      "source_provision": "sec2"
    },
    {
      "term": "Tribunal",
      "definition": "the Tribunal established under this Act and includes a Bench thereof.",
      "source_provision": "sec2"
    }
  ]
}
