{
  "id": "pk-islamabad-transfusion-of-safe-blood-ordinance-2002",
  "type": "statute",
  "title": "Islamabad Transfusion of Safe Blood Ordinance, 2002",
  "title_en": "Islamabad Transfusion of Safe Blood Ordinance, 2002",
  "short_name": "ITOSB",
  "status": "in_force",
  "issued_date": "2002-10-14",
  "in_force_date": "2002-10-14",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FtbJg%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Islamabad Transfusion of Safe Blood Ordinance, 2002 (LXXIII of 2002) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Power to make rules",
      "content": "ISLAMABAD TRANSFUSION OF SAFE BLOOD ORDINANCE, 2002\nORDINANCE No. LXXIII OF 2002\n[15-10-2002]\nto regulate transfusion of safe blood an blood products in the Islamabad Capital Territory\nWHEREAS it is expedient to regulate transfusion of safe and healthy blood and blood\nproducts free from viruses and infective agents in the Islamabad Capital Territory and to provide for\nmatters connected therewith and incidental thereto;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the Fourteenth day\nof October, 1999, and the Provisional Constitution Order No. 1 of 1999, read with the Provisional\nConstitution (Amendment) Order No. 9 of 1999, and in exercise of all powers enabling him in that\nbehalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the\nfollowing Ordinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Islamabad\nTransfusion of Safe Blood Ordinance, 2002.\n(2) It extends to the whole of the Islamabad Capital Territory.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Ordinance unless there is anything repugnant in the subject or\ncontext,—\n(a)     “Authority” means the Islamabad Blood Transfusion Authority established\nunder section 5;\n(b)     “blood bank” includes private, Government or Armed Forces blood banks\nmaintained for the purpose of receiving, preserving, storing, analyzing and\nprocessing blood and blood products;\n(c)     “incharge” means the owner of a blood bank and in case of company or other\nbody corporate; its chief executive or a person declared as such at the\ntime of registration;\n(d)     “prescribed” means prescribed by the rules made under this Ordinance;\n(e)     “safe blood” means human blood which is healthy and free from human\nimmunodeficiency (HIV), Hepatitis B and C viruses or infective agent like\nmalarial parasites and Treponema pallidum (syphilis) or such other viruses or\ninfective agents as the Federal Government may, by notification in the official\nGazette, specify; and\n(f)     “Schedule” means the schedule to this Ordinance."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Transfusion of safe blood",
      "content": "Every physician, surgeon, medical practitioner or any other\nperson transfusing blood or blood Products to any patient shall, before such transfusion, ensure that\nthe blood or, as the case may be, blood products, is healthy and has been certified by the blood bank,\nas screened for any virus or infection specified in clause (e) of section 2."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Registration of blood banks",
      "content": "No blood bane shall receive or supply blood unless it is\nregistered with the Authority and a license is issued to it by the Authority in the manner and subject\nto payment of such fee as may be prescribed."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Establishment of Islamabad Blood Transfusion Authority",
      "content": "As soon as may be, after\nGazette, establish an Authority to be known as the Islamabad Blood Transfusion Authority and\nconsisting of such technical experts in hematology, transfusion medicine, representative of the\nArmed Forces and from private sector and other stakeholders, possessing such qualification and\nexperience as may be prescribed, by the Federal Government."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Functions of the Authority",
      "content": "(1)The functions of the Authority shall be to—\n(a)    implement the approved national policy;\n(b)    register and issue the licences to blood banks;\n(c)    allow renewal of licence issued to blood banks annually on payment of such\nfee after satisfying that instructions issued by it for safe blood transfusion\nwere being followed by the blood banks;\n(d)    prescribe registration and licence fees;\n(e)    ensure implementation of the national safety standards;\n(f)    fix service charges of the blood and blood products;\n(g)    ensure that bio-safety, measures specified in the Schedule are strictly adhered\nto by the blood banks;\n(h)    ensure that the blood banks are managed and run by qualified professionals\nhaving post-graduate qualifications in blood transfusion or haematology\nrecognized by the Pakistan Medical and Dental Council established under\nthe Medical and Dental Council Ordinance, 1962 (XXXII of 1962); and\n(i)    monitor the working of the blood banks and carry out periodical\ninspections, where necessary.\n(2) For furthering the functions of the Authority, the Federal Government, as and when it\nconsiders necessary, issue directives to the Authority on matters of Policy, and such directives shall\nbe binding on the Authority. If a question arises whether any matter is a matter of Policy or not, the\ndecision of the Federal Government shall be final."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Appointment of officers and staff",
      "content": "(1) To carry out the purposes of this Ordinance the\nAuthority may, from time to time, employ such officers and servants, or appoint such experts or\nconsultants, as it may consider necessary for the performance of its functions, on such terms and\nconditions as it may deem fit.\n(2) Within the finances available to it, the Authority shall prepare a permanent\nSchedule of establishment showing the officers and servants of various categories and submit to the\nFederal Government which may sanction and approve the same with or without amendment."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Funds of Authority",
      "content": "(1) A non-lapsable fund vesting in the Authority known as the\n“Islamabad Blood Transfusion Authority Fund”, to be utilized by the Authority to meet operational\ncharges in connection with its functions under this Ordinance including the payment of salaries and\nother remuneration and allowances to the persons engaged and employed for the performances of\nduties and service of the Authority.\n(2)    The Islamabad Blood Transfusion Authority Fund shall be kept in a scheduled bank\nand shall be operated according to rules and regulations of the Federal Government.\n(3) To the credit of the Islamabad Blood Transfusion Authority Fund shall be placed all funds\nreceived by the Authority and the Fund shall consist of,––\n(a)     grants made by the Federal Government including an initial grant of two\nmillion rupees;\n(b)     income from users fees, licence fees and income from supply of blood;\n(c)     funds provided by the Federal Government;\n(d)     foreign aids, grants and loans negotiated and raised by the Authority with the\nprior approval of the Federal Government;\n(e)     all other sums received by the Authority, such as fees, damages, costs,\nrefunds, forfeitures, sales proceeds, lease money, rentals and fines, renewal\nand fees;\n(f)     income from the sale of assets or vehicles; and\n(g)     royalty and income from sale proceeds of published            research work;\ncontributions and donations."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Accounts of Authority",
      "content": "(1) The Authority shall maintain complete and accurate books\nof accounts of its actual expenses and receipts in such manner as the Federal Government may, in\nconsultation of the Controller-General of Accounts, determine.\n(2)    The accounts of the authority shall be audited annually by the Auditor-General of\nPakistan."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Responsibilities of blood banks",
      "content": "Every blood bank shall––\n(a)     have a separate department, staff and equipment for the purpose of blood\ndonations and for selection, handling, care and safety of the donors;\n(b)     select donors of blood in accordance with the instructions issued by the\nAuthority;\n(c)     cause the donated blood and blood products to be screened, examined and\ntested in accordance with the instructions issued by the Federal Government\nfor detection of any communicable disease;\n(d)      possess equipment required for hemoglobin estimation, blood grouping,\ncross- matching, anti-bodies detection and screening of infectious agents,\nsuch as human immunodeficiency, hepatitis viruses, malaria and syphilis;\n(e)    equip itself with proper refrigeration of blood and blood products and\nmake arrangements for uninterrupted power supply for refrigeration;\n(f)    observe standard operating procedures approved by the Authority and\nspecified in the Schedule;\n(g)    not accept blood from professional blood donors; and\n(h)    submit periodical reports in respect of donations of the blood received by it\nwith break up of blood groups, detection of anti-bodies and screening of\ninfectious agents."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Penalty for contravention",
      "content": "(1) Any person contravening any provision of this\nOrdinance shall be punished with imprisonment for a term which may extend to one year, or with\nfine which may extend to hundred thousand rupees, or with both.\n(2) For purpose of this section, the in charge of a blood bank shall personally be held\nresponsible for any contravention taking place in the blood bank."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Cognizance of the contravention",
      "content": "(1) No Court shall take cognizance of any\ncontravention under this Ordinance except on a complaint in writing made by the Chairman of the\nAuthority or a person authorized by him in this behalf.\n(2)     Notwithstanding anything in the Code of Criminal Procedure, 1898 (Act V of\n1898),—\n(a)    no Court other than a Magistrate of the First Class shall try an offence under\nthis Ordinance; and\n(b)    it shall be lawful for any Magistrate of the First Class to pass any\nsentence authorized by this Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "Authority",
      "definition": "the Islamabad Blood Transfusion Authority established under section 5;",
      "source_provision": "sec2"
    },
    {
      "term": "blood bank",
      "definition": "private, Government or Armed Forces blood banks maintained for the purpose of receiving, preserving, storing, analyzing and processing blood and blood products;",
      "source_provision": "sec2"
    },
    {
      "term": "incharge",
      "definition": "the owner of a blood bank and in case of company or other body corporate; its chief executive or a person declared as such at the time of registration;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by the rules made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "safe blood",
      "definition": "human blood which is healthy and free from human immunodeficiency (HIV), Hepatitis B and C viruses or infective agent like malarial parasites and Treponema pallidum (syphilis) or such other viruses or infective agents as the Federal Government may, by notification in the official Gazette, specify; and",
      "source_provision": "sec2"
    },
    {
      "term": "Schedule",
      "definition": "the schedule to this Ordinance.",
      "source_provision": "sec2"
    }
  ]
}
