{
  "id": "pk-islamabad-university-of-health-sciences-and-emerging-technologies-islamabad-act-",
  "type": "statute",
  "title": "Islamabad University of Health Sciences and Emerging Technologies, Islamabad Act, 2024",
  "title_en": "Islamabad University of Health Sciences and Emerging Technologies, Islamabad Act, 2024",
  "short_name": "IUOHS",
  "status": "in_force",
  "issued_date": "2024-04-03",
  "in_force_date": "2024-04-03",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5ppbA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Islamabad University of Health Sciences and Emerging Technologies, Islamabad Act, 2024 (I of 2024) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement.―(1) This Act may be called the Islamabad University",
      "content": "of Health Sciences and Emerging Technologies, Islamabad Act, 2024.\n(2) It shall extend to the Islamabad Capital Territory.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.―In this Act, unless there is anything repugnant in the subject or context:―",
      "content": "(a)     “Academic Council” means the Academic Connell of the University;\n(b)     “Authority” means any of the Authorities of the University specified in\nsection 24;\n(c)      “Board” means the Board of Governors of the University;\n(d)      “Chancellor” means the Chancellor of the University;\n(e)     “Chairperson” means the head of a Teaching department of the University;\n(f)     “Commission” means the Higher Education Commission set up under the\nHigher Education Commission Ordinance, 2002 (LIII of 2002);\n(g)     “Company” means “ABLE LEARNING (PRIVATE) LIMITED”,\nregistered under the companies Act, 2017 (XIX of 2017);\n(h)     “Constituent Unit” means an institute or college, by whatever name\ndescribed, maintained, and administered by the University;\n(i)     “Dean” means the head of a Faculty of the University;\n(j)     “Department” means a teaching department of the University;\n(k)    “Director” means the administrative head of a constituent college or\ninstitute or school or campus of the University;\n(l)    “Faculty” means the faculty of the University;\n(m)    “Government” means the Federal Government;\n(n)    “IUHT” means the Islamabad University of Health Sciences and Emerging\nTechnologies, Islamabad,\n(o)    “Patron” means the Patron of the University;\n(p)    “Prescribed” means prescribed by Statutes, Regulations or Rules made under\nthis Act;\n(q)    “Principal” means Principal of a Constituent Unit of the University;\n(r)    “Pro Vice Chancellor” means Pro-Vice-Chancellor of the University;\n(s)   “Search Committee” means the Search Committee set up by the Board of\nGovernors under this Act;\n(t)   “Statues”, “Regulations” and “Rules”              means   prescribed Statutes,\nRegulations and Rules made under this Act;\n(u)    “Teacher” means Professor, Associate Professor, Assistant Professor,\nLecturer, Demonstrator and Instructor engaged whole-time by the University\nor by its constituent Campus, College, Institute and such other persons as may\nbe declared to be as teacher by Regulations;\n(v)    “University” means Islamabad University of Health Sciences and Emerging\nTechnologies (IUHT); and\n(w)    “Vice Chancellor” means the Vice-Chancellor of the University."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment and incorporation of the University.―(1) There shall be established a",
      "content": "University to be called the Islamabad University of Health Sciences and Emerging Technologies\n(IUHT), Islamabad consisting of the Paton, the Chancellor, the Vice-Chancellor, members of the\nBoard of Governors, the Deans, the Chairpersons of the teaching departments, the members of the\nAcademic Council and such other full-time officers and members of the staff of the University.\n(2) The University shall be a body corporate by the name of Islamabad University of Health\nSciences and Emerging Technologies (IUHT), Islamabad having perpetual succession and a common\nseal, and may sue and be sued by the said name.\n(3) The University shall be competent to acquire and hold property, both movable and\nimmovable, and to lease, sale or otherwise transfer any movable and immovable property which may\nhave become vested in or been acquired by it.\n(4) Notwithstanding anything contained in any other law for the time being in force, the\nUniversity shall have academic, financial, and administrative autonomy, including the power to\nemploy officers, teachers and other employees on such terms as may be prescribed under this Act.\nIn particular, and without prejudice to the authority granted to the Commission by the law, the\nGovernment or an authority or auditor appointed by the Government shall have no power to question\nthe policy underlying the allocation of resources approved by the Board of Governors in the annual\nbudget of the University.\n(5) The University shall be liable to provide facilities to the representatives of the Higher\nEducation Commission, Pakistan Engineering Council, Pakistan Medical and Dental Council, and\nother relevant organizations for visitation to enable them to verify that the University is maintaining\nappropriate academic standards.\n(6) The University shall be required to strictly comply with the constitutional provisions,\nideology of Pakistan, law and abide by the social, religious, ethical, and cultural ethos, values, and\nrespect cultural and religious sensitivities."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers and functions of the University.―The University shall have the following",
      "content": "powers and functions:―\n(a)     to provide for instruction in such branches of learning as it may deem fit and\nto make provisions for teaching, research and development of technologies\nand for the advancement and dissemination of knowledge in such other fields\nor branches of study as the Board of Governors may determine;\n(b)     to make provisions for research and other services for the advancement and\ndissemination of knowledge in such a manner as it may determine;\n(c)     to institute programs for the exchange of students and teachers between the\nUniversity and Higher Education Institutes inside as well as outside Pakistan;\n(d)      to prescribe courses of studies in health, sciences, emerging technologies and\nsuch other branches of learning as the university may determine;\n(e)    to select, admit, teach, and examine students;\n(f)   to hold examinations and confer on or award degrees, diplomas, certificates,\nand other academic distinctions to and on persons who have passed its\nexaminations under prescribed conditions;\n(g)   to confer honorary degrees and distinctions on approved persons in the manner\nprescribed;\n(h)   to enter into agreements, contracts and arrangements with universities,\norganizations, institutions, bodies, and individuals for the purpose of carrying\nout functions and activities in Pakistan or abroad;\n(i)   to establish faculties, teaching departments, campuses, colleges, institutes,\nmuseums, and other centers of learning for the development of teaching and\nresearch and to make such arrangements for their maintenance, management\nand administration as it may prescribe;\n(j)   to institute Professorship, Associate Professorship, Assistant Professorship,\nLectureship, and any other posts and to appoint person thereto;\n(k)   to provide and support the academic developments for the faculty of the\nUniversity;\n(1)   to decide teaching methods and strategies to ensure the most effective\neducational and training programs;\n(m)   to institute and award fellowships, scholarships, exhibitions, bursaries,\nmedals, and prizes under prescribed conditions;\n(n)   to create posts for teaching, research, administration, and other related\nfunctions and to appoint persons thereto;\n(o)   to receive and manage property transferred and grants, bequests, trusts, gifts,\ndonations, endowment, and other contributions made to it, and invest any\nfunds representing such property, grants, bequests, trusts, gifts, donations,\nendowments, or contributions. To convert one kind of property into another,\nin such a manner as it may deem tit;\n(p)    to develop and implement fund raising plans;\n(q)   to demand and receive fees and other charges as it lay determine;\n(r)   to appoint members of various bodies and committees, as the Board may\ndetermine, for academic, administrative, and co-curricular activities;\n(s)   to appoint such officers and members of the staff as necessary and prescribe\nterms and conditions and powers and duties of such officers and staff;\n(t)    to establish and support teaching hospitals;\n(u)    to supervise and control the discipline of the students of the University and to\npromote extra-curricular and recreational activities of students and to make\narrangements for promoting their health;\n(v)      to provide career counseling and job search services to its students and\nalumni;\n(w)     to maintain linkages with alumni; and\n(x)     to do all such other acts and things as may be requisite to further the objectives\nof the University as a place of promotion of education, learning and research."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Jurisdiction.―The principal seat of the University shall be at Islamabad and it may",
      "content": "set up any number of campuses, colleges, and institutes at such places in Pakistan and abroad as may\ndetermine by the Board of Governors subject to prior approval of the Higher Education Commission\n(HEC)."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. University open to all classes, creeds, etc.―The University shall be open to all persons",
      "content": "of either gender and of whatever religion, race, cast, creed, class, colour or domicile who are\nacademically qualified for admission to the courses of study offered by the University and no such\nperson shall be denied the privileges of the University on the ground of religion, race, caste, creed,\nclass, colour or domicile."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Teaching and examinations in the University.―(1) All recognized teaching,",
      "content": "professional and technical training in various courses shall be conducted by the University or its\nconstituent colleges or units in the prescribed manner and may include lectures, tutorials, discussions,\nseminars, demonstrations, trainings distance learning and other methods of instruction as well as\npractical work in the laboratories, hospitals, workshops and other governmental or private\norganizations subject to policies prescribed by the Commission.\n(2) The authority responsible for organizing recognized teaching shall be such, as may\nbe prescribed.\n(3) The University may associate external examiners for the conduct of examinations or\nother duties as may be prescribed.\n(4) The University may prescribe syllabi, courses of studies and instructions for the conduct\nof studies and shall abide by the directions given by the HEC, Pakistan Medical and Dental Council\nand other Accreditation Councils.\n(5) A degree shall not be awarded to a student unless he has passed an examination in Islamic\nStudies and Pakistan Studies at the bachelor’s degree level or in case of a Non-Muslim student in\nEthics and Pakistan Studies at his option."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Officers of the University.―The following shall be the officers of the University,",
      "content": "namely:―\n(a)     the Patron;\n(b)    the Chancellor;\n(c)    the Vice-Chancellor;\n(d)    the Pro-Vice-Chancellor;\n(e)    the Deans;\n(f)    the Chairperson of the Teaching Departments;\n(g)    the Directors of the Campuses, Colleges and Institutes;\n(h)    the Principal of constituent units;\n(i)    the Registrar;\n(j)    the Treasurer;\n(k)    the Controller of Examinations;\n(l)    the Director Quality Enhancement Cell;\n(m)    the Resident Auditor; and\n(n)    such other persons as may be prescribed by the Statutes, Rules or regulations\nto be the officers of the University."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. The Patron.―The President of the Islamic Republic of Pakistan shall be the Patron of",
      "content": "the University.\n(2) The Patron shall, when present, preside at the Convocation of the University. In the\nabsence of the Patron, the Chancellor shall preside over the Convocation of the university.\n..\n(3) Every proposal to confer an honorary degree shall be subject to confirmation by the\nPatron."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Visitation.―(1) The Patron may in accordance with the terms and procedures as may be",
      "content": "prescribed, cause an inspection or inquiry to be made on his own motion or at the request of the\nCommission in respect of any matter connected with the affairs of the University and shall, from\ntime to time, direct any person or persons to inquire into or carry out inspection of―\n(a)     the University, its building, laboratories, libraries, and other facilities;\n(b)      any institution, department or hospital maintained by the University;\n(c)      the adequacy of financial and human resources;\n(d)     the teaching, research, curriculum, examination, and other matters of the\nUniversity; and\n(e)      such other matters as the Patron may specify.\n(2) The Patron shall communicate to the Board of Governers his views with regard to the\nresult of visitation and shall, after ascertaining the views of the Board, advice the Board on the action\nto be taken by it.\n(3) The Board shall, within such time as may be specified by the Chancellor, communicate\nto him such action, if any, as has been taken or may be proposed to be taken upon the results of\nvisitation.\n(4) Where the Board does not, within the time specified, take action to the satisfaction of\nthe Patron, the Patron may issue such directions as he deems fit and the Board shall comply with\nsuch directions."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. The Chancellor.―(1) The Chancellor of the University, who shall preferably be a person",
      "content": "of eminence in letters, sciences, or social work, to be appointed by the Able Learning Company\n(Private) Limited on such terms and conditions as may be prescribed.\n(2) The Chancellor shall supervise the overall functioning of the University.\n(3) The Chancellor shall be the Chairperson of the Board of Governors.\n(4) If the Chancellor is satisfied that the proceedings of any Authority or orders of any officer\nare not in accordance with the provisions of this Act, the Statutes, the Regulations, or the Rules, he\nmay after calling upon such Authority or officer to show cause in writing, appoint a five member\nreview committee to examine and report to the Chancellor. The Review Committee shall be drawn\nfrom persons of eminence in academics and in the fields of law, accountancy and administration.\n(5) The Chancellor may subject to the provisions of this Act in his discretion, delegate all\nor any of the powers and functions of any Authority, officer, or employee of the University to any\nauthority, officer, or employee.\n(6) Should the Chancellor be incapacitated from acting as such due to absence or any other\ncause, the Vice-chancellor or a nominee of the Chancellor shall act for him."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Removal from the Board of Governors.―(1) The Chancellor may, upon the",
      "content": "recommendation of the review committee, remove any person from the membership of the Board of\nGovernors on the ground that such person―\n(a)    has become of unsound mind; or\n(b)    has become incapacitated to function as member of the Board of Governors;\nor\n(c)    has been convicted by a court of law for an offence involving moral turpitude;\nor\n(d)    has absented himself from three consecutive meetings without just cause; or\n(e)    has been guilty of misconduct, including use of position for personal\nadvantage of any kind, or gross inefficiency in the performance of functions.\n(2) The Chancellor shall place the recommendations of review committee before the Board\nof Governors and remove any person from the membership of the Board of Governors on a\nresolution calling for removal of such person supported by at least three-fourths of the members\nof the Board of Governors:\nProvided that before passing such resolution the Board of Governors shall provide the\nmember concerned a fair hearing:\nProvided further that the provisions of this section shall not be applicable to the Vice-\nChancellor in his capacity as member of the Board of Governors."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Vice",
      "content": "Chancellor.―(1) The Vice-Chancellor, who shall be an eminent educationist,\nscholar and distinguish administrator with sufficient experience in the relevant field shall be\nappointed by the Chancellor on such terms and conditions as may be prescribed.\n(2) The Vice-Chancellor shall be the Chief Executive Officer of the University responsible\nfor all administrative and academic functions of the University and for ensuring that the provisions\nof this Act, Statutes, Regulations and Rules are faithfully observed in order to promote the general\nefficiency and good order of the University. The Vice-Chancellor shall have all powers prescribed\nfor this purpose, including administrative control over the officers, teachers and other employees\nof the University.\n(3) The Vice-Chancellor shall, if present, be entitled to attend any meeting of any Authority\nor body of the University.\n(4) The Vice-Chancellor may, in an emergency that in his opinion requires immediate\naction ordinarily not in the competence of the Vice-Chancellor, take such action as he may consider\nnecessary and shall, thereafter as soon as possible, report his action to the Chancellor.\n(5) The Chancellor shall be responsible for implementation of the decisions of the Board\nand for the effective execution of programs of the University in accordance with the policies and\nguidelines formulated by the Board.\n(6) At any time when the office of the Vice-Chancellor is vacant, or the Vice-Chancellor is\nabsent or is unable to perform the functions of the office due to illness or some other cause, the\nChancellor shall make such arrangement for the performance of the duties of the Vice-Chancellor\nas he may deem fit.\n(7) The Vice-Chancellor shall also have the power to―\n(a)     promote the general efficiency and good order of the University.\n(b)    direct teachers, officers and other employees of the University to take up such\nassignments in connection with examination, administration and such other\nactivities in the University as he may consider necessary for the purposes of\nthe University;\n(c)     make appointments of such categories of employees of the University, in\nsuch manner as may be prescribed by the Statutes;\n(d)     suspend, punish and remove any employee from the service of the University,\nin accordance with prescribed procedure, except those appointed by or with\nthe approval of the Board of Governors;\n(e)    create and fill temporary posts;\n(f)    submit plans of work and budget estimates of the University for consideration\nand approval of the Board;\n(g)     sanction all expenditure provided for in the approved budget;\n(h)     sanction by re-appropriation amount not exceeding an amount specified by the\nBoard of Governors for an unforeseen item not provided in the budget and\nreport it to the Board in the next meeting;\n(i)     appoint paper setters and examiners for all examinations of the University\nafter receiving panels of the names from the relevant authorities; and\n(j)     exercise and perform such other powers and functions as may be prescribed.\n(8) The Vice-Chancellor shall preside at the Convocation of the University in the absence\nof the Chancellor.\n(9) The Vice-Chancellor shall present an annual report before the Board of Governors within\nthree months of the close of the academic year. The annual report shall present such information as\nregards the academic year under review as may be prescribed, including disclosure of all relevant\nfacts pertaining to―\n(i)     academics;\n(ii)    research;\n(iii)   administration; and\n(iv)    finances.\n(10) The Vice-Chancellor’s annual report shall be made available, prior to its presentation\nbefore the Board of Governors, to all officers and University Teachers and shall be published in such\nnumbers as are required to ensure its wide circulation."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Appointment and removal of the Vice Chancellor.―(1) The Vice",
      "content": "Chancellor shall\nbe appointed by the Chancellor on the basis of recommendations made by the Board of Governors\ninitially for a period of four years.\n(2) A Search Committee for the recommendation of persons suitable for appointment as Vice-\nChancellor shall be constituted by the Board of Governors on the date and in the manner prescribed\nby the Statutes and shall consist of two eminent members of society nominated by the Chancellor,\nof whom one shall be appointed the Convener, two members of the Board of Governors, two\ndistinguished University Teachers who are not members of the Board of Governors and one\nacademician of eminence not employed by the University. The Search Committee shall remain in\nexistence till the time of appointment of the next Vice-Chancellor made by the Chancellor.\n(3) The persons proposed by the Search Committee for appointment as Vice-Chancellor\nshall be considered by the Board of Governors and a panel of three, in order of priority, shall be\nrecommended by the Board of Governors to the Chancellor:\n(4) The tenure of Vice-Chancellor shall be renewed for another term of four years by the\nChancellor on receipt of a resolution of the Board of Governors.\n(5) The Board of Governors may, pursuant to a resolution in this behalf passed by three-\nfourths of its membership, recommend to the Chancellor the removal of the Vice-Chancellor on\nthe ground of inefficiency, moral turpitude or physical or mental incapacity or gross misconduct,\nincluding misuse of position for personal advantage of any kind:\nProvided that the Chancellor may make a reference to the Board of Governors stating the\ninstances of inefficiency, moral turpitude or physical or mental incapacity or gross misconduct on\nthe part of the Vice-Chancellor that have come to his notice. After consideration of the reference\nthe Board of Governors may, pursuant to a resolution in this behalf passed by two-thirds of its\nmembership, recommend to the Chancellor the removal of the Vice-Chancellor:\nProvided further that prior to a resolution for the removal of the Vice-Chancellor being voted\nupon the Vice Chancellor shall be given an opportunity of being heard.\n(6) A resolution recommending the removal of the Vice-Chancellor shall be submitted to\nthe Chancellor forthwith. The Chancellor may accept the recommendations and order removal of\nthe Vice-Chancellor or return the recommendations to the Board of Governors for reconsideration."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Pro",
      "content": "Vice-Chancellor of academic and research.―(1) The Board of Governors (BoG)\nshall nominate the Pro-Vice-Chancellor from amongst five senior Professors of the University, for a\nterm of three years.\n(2) The Pro-Vice-Chancellor shall be responsible to―\n(i)      coordinate all academic and research activities of the University and shall\nbe responsible to schedule and conduct academic and research audit of all\nfaculties, Institute or Centers of the University;\n(ii)      establish academic and research cooperation and collaboration with local or\nforeign universities of repute;\n(iii)    scrutinize and process all research proposals for approval including\narrangment for necessary funding;\n(iv)     commercialization of Research and development work;\n(v)      establish linkages with industry to facilitate research;\n(vi)     facilitate internship and placement of students;\n(vii)    establish Institute alumni data bank and its regular upgradation;\n(viii)   selection, admission and monitoring of students in foreign University of\nrepute; and\n(ix)     represent in all outside meetings whenever the Vice-Chancellor is unable to\ndo so.\n(3) The Board of Governors or the Vice-Chancellor may assign any other functions to the\nPro-Vice-Chancellor:\nProvided that Board of Governors may, on the advice of the Vice Chancellor, terminate the\nappointment of the Pro Vice Chancellor (Academies and Research) on grounds of inefficiency or\nmisconduct in accordance with prescribed procedure."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Pro",
      "content": "Vice-Chancellor of administration and finance.―(1) The Board of Governors\nshall nominate the Pro-Vice-Chancellor (Administration and Finance) on the recommendations of\nVice-Chancellor of the University.\n(2) The minimum qualifications and experience necessary for appointment to the post of the\nPro-Vice-Chancellor (Administration and Finance) shall be as prescribed.\n(3) The Pro-Vice-Chancellor Administration and Finance) shall supervise, undertake, and\ncoordinate all administrative and financial activities of principal seat of the Institute―\n(i)     The Pro-Vice-Chancellor of administration and Finance shall exercise the\nadministrative and financial powers as delegated by the Board of Governors;\n(ii)    The Pro-Vice-Chancellor of administration and finance shall be the convener\nof all the financial, administrative, and other relevant committees of the\nUniversity;\n(iii)   The Pro-Vice-Chancellor of administration and finance shall perform the duty\nof Member Finance Committee and sign the payment cheques as co-signatory\nwith Director Finance;\n(iv)    The Pro-Vice-Chancellor shall be responsible to process and pay medical\nbills of officers and other staff of the University;\n(v)     The Board of Governors (BoG), or the Vice-Chancellor may assign any other\nfunctions to the Pro-Vice-Chancellor of administration and Finance:\nProvided that the Board of Governors may, on the advice of the Vice-\nChancellor terminate the appointment of the Pro-Vice-Chancellor of\nAcademics and Research on grounds of inefficiency or misconduct in\naccordance with prescribed procedure."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Dean.―There shall be a Dean for each Faculty who shall be the Convener of the Board",
      "content": "of Faculty and he shall be responsible for the academic affairs of the faculty. He shall be appointed\nby the Board, from amongst the senior professors of the University on the recommendations of the\nVice-Chancellor and subject to the conditions that―\n(a)     the Dean shall hold office for three years and eligible for re-appointment\n(b)     the Dean shall present candidates for admission to degrees except honorary\ndegree in the courses falling within the purview of the faculty; and\n(c)     the Dean shall exercise such other powers and perform other duties as may be\nprescribed."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Registrar.―(1) There shall be a Registrar of the University to be appointed by the Board",
      "content": "of Governors on the recommendations of the Selection Board on the such terms and conditions as\nmay be prescribed.\n(2) The experience as well as the professional and academic qualifications necessary for\nappointment to the post of the Registrar shall be as may be prescribed.\n(3) The Registrar shall be a full-time officer of the University and shall―\n(i)     be the administrative head of the secretariat of the University and be\nresponsible for the provision of secretariat support to the Authorities of the\nUniversity;\n(ii)    be the custodian of the common seal and the academic records of the\nUniversity;\n(iii)   maintain a register of registered graduates in the prescribed manner;\n(iv)     supervise the process of election, appointment, or nomination of members to\nthe various authorities and other bodies in the prescribed manner; and\n(v)     perform such other duties as may be prescribed.\n~\n(4) The Board of Governors may, on the advice of the Vice-Chancellor, terminate the\nappointment of the Registrar on grounds of inefficiency or misconduct in accordance with prescribed\nprocedure."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Treasurer.―(1) There shall be a Treasurer of the University to be appointed by the",
      "content": "Board of Governors on the recommendations of the Selection Board on such terms and conditions\nas may be prescribed.\n(2) The experience and the professional and academic qualifications necessary for\nappointment to the post of the Treasurer shall be as may be prescribed.\n(3) The Treasurer shall be the chief financial officer of the Institute and shall―\n(i)     manage the assets, liabilities, receipts, expenditures, funds and investments\nof the University;\n(ii)    prepare the annual and revised budget estimates of the University and present\nthem to the Finance and Planning Committee and the Board of Governors;\n(iii)   ensure that the funds of the University are expended for the purposes for\nwhich they are provided;\n(iv)    have the accounts of the University audited annually to be available for\nsubmission to the Board of Governors within six months of the close of the\nfinancial year; and\n(v)     perform such other duties as may be prescribed.\n(4) The Board of Governors may, on the advice of the Vice-Chancellor, terminate the\nappointment of the Treasurer on grounds of inefficiency or misconduct in accordance with prescribed\nprocedure."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Controller of Examinations.―(1) There shall be a Controller of Examinations, to be",
      "content": "appointed by the Board of Governors on the recommendations of the Selection Board, on such\nterms and conditions as may be prescribed.\n(2) The experience and the professional and academic qualifications necessary for\nappointment to the post of the Treasurer shall be as may be prescribed.\n(3) The Controller of Examinations shall be a full-time officer of the University and shall be\nresponsible for all matters connected with the conduct of examinations and perform such other duties\nas may be prescribed.\n(4) The Board of Governors may, on the advice of the Vice-Chancellor, terminate the\nappointment of the Controller of Examinations on grounds of inefficiency or misconduct in\naccordance with prescribed procedure."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Director quality enhancement cell.―(1) There shall be a director quality enhancement",
      "content": "cell of the University to be appointed by the Board of Governors on the recommendations of\nSelection Board on such terms and conditions, as may be prescribed.\n(2) The minimum experience as well as the professional and academic qualifications\nnecessary for the appointment to the post of director quality enhancement cell shall be as may be\nprescribed.\n(3) The director quality enhancement cell shall be responsible to―\n(i)     review the quality standards and the quality of teaching and learning in each\nsubject area;\n(ii)    review the academic association with other institutions in terms of effective\nmanagement of standards and quality of programs;\n(iii)    defining clear and explicit standards as points of reference to the review to be\ncarried out. It should also help the employees to know as to what they could\nexpect from candidates;\n(iv)     developing qualifications framework by setting out the attributes and abilities\nthat can be expected from the holder of a qualification, i.e., undergraduate and\ngraduate programs;\n(v)      developing program specifications. These are standards set of information\nclarifying what knowledge, understanding, skills and other attributes a\nstudent shall have developed on successfully completing a specific program;\n(vi)     developing quality assurance processes and methods of evaluation to affirm\nthat the quality of provision and the standard of awards are being maintained\nand to foster curriculum, subject, and staff development together with\nresearch and other scholarly activities;\n(vii)    ensure that the University’s quality assurance procedures are designed to fit\nin with the arrangements in place nationally and internationally for\nmaintaining and improving the quality of Higher Education;\n(viii)   developing procedures and processes, monitoring and evaluation systems,\nand standards for the following―\n(a)     approval of new program;\n(b)     annual monitoring and evaluation including program monitoring,\nfaculty monitoring and student perceptions;\n(c)     Departmental review;\n(d)     Student feedback;\n(e)     Employer feedback;\n(f)     Quality assurance of undergraduate, graduate and doctoral programs;\n(g)     Institutional assessment and performance evaluation;\n(h)     Program specifications; and\n(i)     Qualification framework.\n(4) The director quality enhancement cell shall be the member of all statutory bodies and\ncommittees of the University.\n(5) The board of Governors may on the recommendations or advice of Vice-Chancellor,\nterminate the services of the director quality enhancement cell on grounds of inefficiency or\nmisconduct in accordance with the prescribed procedure."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Director office of research, innovation and commercialization.―(1) There shall be a",
      "content": "Director of the University to be appointed by the Board of Governors on the recommendations of\nSelection Board on such terms and conditions as may be prescribed.\n(2) The minimum experience as well as the professional and academic qualifications\nnecessary for the appointment to the post of Director shall be as may be prescribed.\n(3) The Director shall―\n(i)     manage and enhance the research activities of the University, develop research\n‘policies and priorities, work for fund raising for research, mobilize faculty\nbusiness community and industry for research commercialization and serve\nas an effective advocate for research with the university and to its broader\ncommunity of stakeholders and supporters;\n(ii)    supervise all aspects of the operation of the Office for Research including\nresearch administration budgeting, auditing, accounting, human resources,\nmanagement and maintenance of facilities and equipment, implementation of\nresearch contracts and human resources;\n(iii)   develop programs and activities that will increase funding for research from\nall public and private sources, establish and maintain excellent relationships\nwith donors and private sources, oversee proposals development and\nsubmission;\n(iv)     promote the development of public-private partnerships in support of Institute\nresearch, link the Institute’s research community with the needs and\npriorities of the corporate sector, develop opportunities for applied research\nand explore opportunities for technology transfer and commercialization of\nInstitute research including incubators and research parks;\n(v)     responsible to monetize royalty streams from licenses;\n(vi)     collaborate with the principal liaison for technical marking and licensing\non the commercialization of the University’s IP in coordination with other\nrelevant department and offices; and\n(vii)   Director shall work in close liaison with the office of research and\ndevelopment, planning and development, and University’s technology park.\n(4) The Board of Governors may on the recommendations or advice of Vice-Chancellor,\nterminate the services of Director (ORIC) on grounds of inefficiency or misconduct in accordance\nwith the prescribed procedure."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. The Resident Auditor.―(1) The Resident Auditor shall be a whole",
      "content": "time officer of the\nUniversity, appointed by the Board in a prescribed manner, and shall be responsible for pre-audit\nof all payments from the University fund.\n(2) The Board of Governors may on the recommendations or advice of Vice-Chancellor,\nterminate the services of Resident Auditor on grounds of inefficiency or misconduct in accordance\nwith the prescribed procedure."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Authorities.―The following shall be the Authorities of the University, namely:―",
      "content": "(i)   Authorities established by this Act—\n(a)    The Board of Governors; and\n(b)    The Academic Council.\n(ii)   Authorities to be established by the Statutes:—\n(a)     The Boards of Faculties;\n(b)     The Board of Advanced Studies and Research;\n(c)     The Board of Studies;\n(d)     The Selection Board;\n(e)     The Finance and Planning Committee;\n(f)     Search Committee for the appointment of Vice-Chancellor;\n(g)     Quality assurance Committee;\n(h)     Discipline Committee; and\n(i)     Such other authorities as may be prescribed."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Board of Governors.―(1) The general supervision and control of the affairs of the",
      "content": "University and its powers to lay down policies shall vest in the Board consisting of the following,\nnamely:―\n(a)     The Chancellor who shall be the Chairperson of the Board of Governors;\n(b)     The Vice-Chancellor;\n(c)     The Pro Vice-Chancellor;\n(d)     one member of the Government not below the rank of Joint Secretary from\nthe concerned Ministry;\n(e)     four persons from society at large, preferably two or at least one female being\npersons of distinction in the fields of administration, management, education,\nacademics, law, accountancy, medicine, fine arts, architecture, agriculture,\nscience, technology, industry, and engineering such that the appointment of\nthese persons reflects a balance across the various fields;\n(f)     one person from amongst the alumni of the University;\n(g)     two persons from the academic community of the country, other than an\nemployee of the University, at the level of professor or principal of a college;\n(h)     four University Teachers (One from each tier i.e., Professor, Associate\nProfessor, Assistant Professor and Lecturer;\n(i)    Nominee of the Higher Education Commission;\n(j)     Nominee of the Pakistan Medical and Dental Council;\n(k)     One Vice-Chancellor of Public Sector University to be nominated by the\nChancellor;\n(l)     One person nominated by the Able Learning Company;\n(m)     One Dean to be nominated by the Chancellor; and\n(n)     The Registrar, who shall act as the Secretary of the Board.\n(2) The numbers of the members of the Board of Governors may be increased through\nStatutes subject to condition that the total membership of the Board of Governors does not exceed\nto twenty-one and the increase is balanced, to the extent possible, across the different categories\nspecified in sub-section (1).\n(3) The Members of the Board, other than ex-officio members shall hold office for three\nyears from the date of appointment:\nProvided that members, may serve on the BoG for more than two consecutive terms.\n(4) The BoG shall meet at least twice in a calendar year.\n(5) Service on the BoG shall be on honorary basis:\nProvided that actual expenses may be reimbursed as prescribed.\n,. .\n(6) The office of nominated member shall become vacant if he resigns or fails to attend\nthree consecutive meetings of Governing body without sufficient cause of leave of absence or his\nnominations is changed by the Authority nominated him.\n(7) In the absence of the Chancellor, meeting of the BoG shall be presided over by the Vice-\nChancellor.\n(8) Unless otherwise prescribed by this Act, all decisions of the BoG shall be taken on the\nbasis of the opinion of a majority of the members present. In the event of the members being evenly\ndivided on any matter the person presiding over the meeting shall have a casting vote.\n(9) No act or proceedings of the board shall be invalid by reasons only of the existence of a\nvacancy in, or any defect in the constitution of the Board.\n(10) The quorum for a meeting of the BoG shall be two thirds of its membership, a fraction\nbeing counted as one."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Powers and functions of the Board of Governors.―(1) The Board shall subject to the",
      "content": "provisions of this Act, and the statutes, exercise general supervision over the affairs and management\nof the University.\n(2) Without prejudice to the generality of the foregoing powers, the Board shall have the\nfollowing powers and functions―\n(a)    to approve the proposed annual plan of work, the annual and revised budgets,\nthe annual statement of accounts and the annual report;\n(b)    to hold, control and lay down policy for the registration of the property, finds,\nassets, resources and investments of the University including the approval\nof the sale and purchase or acquisition of immovable property;\n(c)     to approve financial resource development plans of the University;\n(d)    to oversee the quality and relevance of the University’s academic\nprograms and to review the academic affairs of the University in general;\n(e)    to approve the appointment of the Deans, Chairperson of the teaching\ndepartments, Professors, Associate Professors, Assistant Professors and such\nother faculty members and officers, on the recommendations of the Selection\nBoard as may be prescribed;\n(f)    to appoint Professor Emeritus on such terms and conditions as may be\nprescribed;\n(g)    to appoint the members of academic council, on the recommendations of the\nVice-Chancellor;\n(h)    to institute schemes, directions and guidelines for the terms and conditions of\nappointment of all officers, teachers and other employees of the University;\n(i)    to approve strategic plans;\n(j)    to consider and pass the draft Regulations, proposed by the Academic Council:\nProvided that the Board of Governors may frame a Statute or Regulation on its\nown initiative and approve it after calling for the advice of the Academic Council as\nthe case my be;\n(k)      to make Statutes and revise them from time to time for the efficient and\neffective operation of the university;\n(l)    to annul by order in writing the proceedings of any Authority or officer if\nthe Board is satisfied that such proceedings are not in accordance with the\nprovisions of this Act, Statutes or Regulations after calling upon such\nAuthority or officer to show cause why such proceedings should not be\nannulled;\n(m)    to recommend to the Chancellor removal of any member of the Board of\nGovernors in accordance with the provisions of this Act;\n(n)     to suspend, punish and remove employee (s) from service of the\nUniversity whom it is empowered to appoint in the manner prescribed after\ndue enquiry process;\n(o)    to remove any person from the membership of any Authority, if such\nperson:―\n(i)     has become of unsound mind; or\n(ii)     has become incapacitated to function as member of such Authority;\nor\n(iii)   has been convicted by a court of law for an offence involving moral\nturpitude; or\n(iv)    has been found indulging in any activity against the interest of the\nUniversity;\n(p)    to determine the form, provide for the custody and regulate the use of the\ncommon seal of the University;\n(q)    to hold, control and administer the property and funds and resources of the\nUniversity and raise funds upon such security as may be required under\nRegulations;\n(r)    to formulate or approve the principles, policies and plans governing the\nactivities and operations of the University so as to facilitate teaching, research\nand other academic work;\n(s)    to create such faculties, departments and institutes and to constitute such\nstanding committees, committees, sub-committees, councils and other\nadministrative or academic advisory bodies as it deems necessary, and review\ntheir work;\n(t)    to create such academic and administrative posts as it may deem necessary\nand to suspend and abolish such posts;\n(u)    to approve, carryout, vary or cancel contracts on behalf of the University;\n(v)    to initiate and approve schemes for achievements of the objectives of the\nUniversity;\n(w)    to determine the form, and regulate the custody and use common seal of the\nUniversity; and\n(x)    to take such initiatives as it may consider necessary for the efficient and\neffective management and functioning of the University.\n(3) The Board may, subject to the provisions of this Act delegate all or any of the powers\nand functions of any Authority, officer or employee of the University at its main campus, to any\nAuthority, committee, officer or employee at its additional campus for the purpose of exercising such\npowers and performing such functions in relation to such additional campus, and for this purpose the\nBoard of Governors may create new posts or positions at the additional campus."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Academic Council.―There shall be an Academic Connell which shall be the Academic",
      "content": "body of the University. The Academic Council shall consist of the following:―\n(a)    the Vice-Chancellor who shall be its Chairperson;\n(b)    Pro Vice-Chancellor (Academic and Research);\n(c)    Pro Vice-Chancellor (Admin and Finance);\n(d)    the Deans of Faculties;\n(e)    the Chairpersons of Teaching Departments;\n(f )   Heads of the Campuses and Constituent colleges or institutes;\n(g)    five Professors including Emeritus Professors;\n(h)    one nominee of HEC not below the rank of Director General;\n(i)    one nominee of PM and DC\n(j)    two eminent scholars to be nominated by the Board;\n(k)    two persons of eminence to be nominated by the Chancellor;\n(l)    the Controller of Examinations;\n(m)    the Director QEC;\n(n)    the Director ORIC;\n(o)    the Controller of Examinations; and\n(p)    the Registrar who shall act as its Secretary.\n(2) The Members of the Academic Council shall hold office for three years.\n(3) The Academic Council shall meet at least once in each quarter.\n(4) The quorum for meetings of the Academic Council shall be one half of the total number\nof members, a fraction being counted as one."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Powers and Functions of the Academic Council.―(1) The Academic Council shall",
      "content": "be the principal Academic Body of the University and shall, subject to provision of this Act and\nStatutes, have the powers to lay down proper standards of instructions, research, publications, and\nexaminations, and to regulate, and promote academic life of the University.\n(2) Without prejudice to the generality of the foregoing powers and provisions of this Act\nand Statues, the Academic Council have the powers to―\n(a)     advice the Board on academic matters;\n(b)     lay down proper standards of instructions, research and examinations and\nto regulate and promote the academic activities of the University;\n(c)     regulate the conduct of teaching, research publications and examinations;\n(d)     approve the policies and procedures pertaining to student-related functions\nincluding admissions, expulsions, punishments, examinations and\ncertification;\n(e)     approve academic programs and the policies and procedures pertaining to\nthe quality of academic programs;\n(f)     approve the    policies and procedures assuring quality of teaching        and\nresearch;\n(g)      propose the Board, schemes for the constitution and organization of faculties,\nteaching departments, colleges or institutes and Board of studies;\n(h)     appoint paper setters and examiners for all examinations of the University\nafter receiving panels of names from the relevant authorities;\n(i)     institute University programs for the continued professional development of\nUniversity Teachers at all levels;\n(J)     recognize the examinations of other universities or examining bodies as\nequivalent to the corresponding examinations of the University;\n(k)     regulate the award of studentships, scholarships, exhibitions, medals and\nprizes;\n(l)     frame regulations for submission to Board;\n(m)     make regulations for the constitution of faculties and the teaching\ndepartments;\n(n)     prepare an annual report on the academic performance of the University;\n(o)    regulate the conduct and discipline of students and faculty;\n(p)    frame regulations on the recommendations of the Board of Faculties and the\nBoards of Studies, prescribing the courses of studies, and the syllabi for all\nUniversity examinations in accordance with the policy of HEC or PM and\nDC and other regulatory bodies;\n(q)    regulate the admissions of students to the courses of studies and examinations\nin the University;\n(r)    formulate proposals, for the planning and development of teaching and\nresearch in the University;\n(s)    recognize the examinations of other universities or examining bodies as\nequivalent to corresponding examinations of the University; and\n(t)    perform such functions as may be prescribed by Statutes or regulations."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Constitution, functions, and powers of other Authorities.―The constitution,",
      "content": "functions,, and powers of the Authorities for which no specific provision has been made in this Act\nshall be such as may be prescribed by the Statutes, Rules and Regulations made thereunder."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Appointment of committees by certain Authorities.―The Board of Governors, the",
      "content": "Academic Council and other Authorities may, from time to time, appoint such standing, special or\nadvisory committees, as they may deem fit, and may nominate such persons on these committees\nwho are not members of the Authorities.\nSTATUTES, REGULATIONS AND RULES"
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Statutes.―(1) Subject to the provisions of this Act, a statute may be made to regulate or",
      "content": "prescribe all or any of the following matters, namely:—\n(a)     terms and conditions of service of employees of the University including\ngrades or scales of pay, constitution of insurance policy, gratuity, and other\nfringe benefits;\n(b)    terms and conditions of appointments of teachers, researchers and officers;\n(c)    establishment of additional campuses, faculties, teaching departments,\ninstitutions, colleges and others academic units;\n(d)     the contents and the manner in which the annual report to be presented by the\nVice-Chancellor before the Board of Governors shall be prepared;\n(e)     powers and duties of officers and teachers;\n(f)     conditions under which the University may enter into arrangements with other\npublic or private organizations for the purposes of instruction, research and\nother scholarly activities;\n(g)     conditions for appointment of Professors Emeritus;\n(h)     award of honorary degrees;\n(i)     the University fees and other charges;\n(j)     efficiency and discipline of the employees of the University;\n(k)     acquisition and administration of properties and investments of the University;\n(l)     constitution, functions, and powers of the Authorities of the University; and\n(m)     all other matters which under this act are required to be or may be prescribed\nor regulated by Statutes.\n(2) The draft of the Statutes shall be proposed the Board and sent for approval to the\nChancellor.\n(3) The Chancellor shall have the powers to assent to the statutes submitted to him or refer\nthem back to the Board for review or reconsideration.\n(4) No statute shall be valid unless approved by the Chancellor."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Regulations.―(1) Subject to the provisions of this Act and the Statues, the Academic",
      "content": "Council may make Regulations, for all or any of the following matters, namely:—\n(a)     syllabi and courses of study and research programs leading to degrees,\ndiplomas or certificates;\n(b)     schemes of studies and research, including the duration of courses, number of\nsubjects or papers for examination;\n(c)     courses of studies for degrees, diplomas and certificates of the University;\n(d)     methodology for selection and admission of students and determination of\nfees and other charges for admission to various courses and examinations;\n(e)     admission and expulsion of students to and from the University;\n(f)     conduct and supervision of examinations;\n(g)     conditions under which a person may carry on independent research to entitle\nhim to a degree;\n(h)     the conditions under which students shall be admitted to the courses and the\nexaminations of the University and shall become eligible for the award of\ndegrees, diplomas, and certificates;\n(i)     institution of fellowships, scholarships, exhibitions, medals, prizes and\nfinancial assistance;\n(j)     conduct of convocation and form of costumes;\n(k)     maintenance of discipline among students;\n(l)     formation of Faculties, Departments and Board of Studies; and\n(m)     all other academic matters under this Act or the Statutes, are to be or may be\nprescribed by Regulations.\n(2) Regulations shall be proposed by the Academic Council and shall be submitted to the\nBoard, which may approve them or withhold approval or refer them back to the Academic Council\nfor reconsideration.\n(3) Regulation proposed by the Academic Council shall not be effective unless it receives the\napproval of the Board of Governors."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Amendments and repeal of Statutes and Regulations.―The procedure for adding to,",
      "content": "amending or repealing the Statutes and the Regulations shall be the same as prescribed respectively\nfor framing or making Statutes and Regulations."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Rules,",
      "content": "(1) The Authorities and the other bodies of the University may make Rules,\nconsistent with this Act, Statutes and the Regulations, to regulate all matter relating to the affairs of\nregulated by Statutes or Regulations, including rules to regulate the conduct of business and the time\nand place of meetings and related matters.\n(2) Rules shall become effective upon approval by the Board."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. The University Fund, its Accounts and Audit.―(1) The University shall have",
      "content": "a Fund to which shall be credited it’s all income from fees, charges, donations, trusts, bequests,\nendowments, contributions, grants and all other sources.\n(2) All funds generated by a teaching department, constituent college, or other units of the\nUniversity through fees consultancy, research or provision of other services shall be made available\nwithout prejudice to the accounts of the University.\n(3) The Accounts of the University shall be maintained in a bank approved by the governing\nbody.\n(4) The accounts of the University shall be maintained in such form and manner as may\nbe determined by the Board and shall audited each year within four months of the closing of the\nfinancial year by the Chartered Accountant appointed by the Board.\n(5) The accounts, together with the report of the Auditor thereon shall be submitted to the\nBoard for approval.\n(6) The Auditor’s report shall certify that the auditor has complied with the standards of\naudit and certification laid down by the Institute of Chartered Accountants of Pakistan.\n(7) No expenditure shall be made from the funds of the University, unless a bill for its\npayments has been issued in accordance with the relevant financial regulations and the Treasurer\nhas verified that the payment is provided for in the approved budget.\n(8) Provision for an internal audit of the finances of the University shall be made and\nprescribed in the Statutes."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. First Statutes.―Not withstanding anything to the contrary contained in this Act, the",
      "content": "Statutes set out in the Schedule shall be deemed to be the First Statues made under Section 3l and\nshall remain in force until they are amended or replaced by new Statutes made in accordance with\nthis Act."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Service of the University.―(1) All persons employed by the University in accordance",
      "content": "with the terms and conditions of service prescribed by statutes shall be persons in the service of the\nInstitute."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Benefits and insurance.―(1) The University shall constitute for the benefit of its",
      "content": "officers, teachers and other employees’ schemes, as may be prescribed, for the provision of post-\nemployment benefits as well as health and life insurance while in service."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Removal of difficulties.―(1) If any question arises as to interpretation of provision",
      "content": "of this act, it shall be placed before the Chancellor whose decision thereon shall be the final.\n(2) If any difficulty arises in giving effect to the provisions of this Act, the Chancellor shall\nmake such order, not inconsistent with the provisions of this Act, as may appear to him to be\nnecessary for removing this difficulty.\n(3) Where this Act makes any provision for anything to be done but no provision or no\nsufficient provision has been made as respects the authority of whom, or the time at which, or the\nmanner in which, it shall be done, then it shall be done by such authority, at such time, or in such\nmanner as the Chancellor may direct."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Bar of Jurisdiction.―No Court shall have jurisdiction to entertain any proceedings,",
      "content": "grant any injunctions or make any order relation to anything done in good faith or purported to have\nbeen done or intended under this Act.\n(SEE SECTION 24)"
    }
  ],
  "definitions": [
    {
      "term": "Academic Council",
      "definition": "the Academic Connell of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "any of the Authorities of the University specified in section 24;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of Governors of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Chancellor",
      "definition": "the Chancellor of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairperson",
      "definition": "the head of a Teaching department of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the Higher Education Commission set up under the Higher Education Commission Ordinance, 2002 (LIII of 2002);",
      "source_provision": "sec2"
    },
    {
      "term": "Company",
      "definition": "“ABLE LEARNING (PRIVATE) LIMITED”, registered under the companies Act, 2017 (XIX of 2017);",
      "source_provision": "sec2"
    },
    {
      "term": "Constituent Unit",
      "definition": "an institute or college, by whatever name described, maintained, and administered by the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Dean",
      "definition": "the head of a Faculty of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Department",
      "definition": "a teaching department of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Director",
      "definition": "the administrative head of a constituent college or institute or school or campus of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Faculty",
      "definition": "the faculty of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "IUHT",
      "definition": "the Islamabad University of Health Sciences and Emerging Technologies, Islamabad,",
      "source_provision": "sec2"
    },
    {
      "term": "Patron",
      "definition": "the Patron of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Prescribed",
      "definition": "prescribed by Statutes, Regulations or Rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Principal",
      "definition": "Principal of a Constituent Unit of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Pro Vice Chancellor",
      "definition": "Pro-Vice-Chancellor of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Search Committee",
      "definition": "the Search Committee set up by the Board of Governors under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Teacher",
      "definition": "Professor, Associate Professor, Assistant Professor, Lecturer, Demonstrator and Instructor engaged whole-time by the University or by its constituent Campus, College, Institute and such other persons as may be declared to be as teacher by Regulations;",
      "source_provision": "sec2"
    },
    {
      "term": "University",
      "definition": "Islamabad University of Health Sciences and Emerging Technologies (IUHT); and",
      "source_provision": "sec2"
    },
    {
      "term": "Vice Chancellor",
      "definition": "the Vice-Chancellor of the University.",
      "source_provision": "sec2"
    }
  ]
}
