{
  "id": "pk-islamabad-wildlife-protection-preservation-conservation-and-management-ordinance",
  "type": "statute",
  "title": "Islamabad Wildlife (Protection, Preservation, Conservation and Management) Ordinance, 1979 (Repealed by Act no. XVI of 2024 section 41 (w.e.f 27-08-2024))",
  "title_en": "Islamabad Wildlife (Protection, Preservation, Conservation and Management) Ordinance, 1979 (Repealed by Act no. XVI of 2024 section 41 (w.e.f 27-08-2024))",
  "short_name": "IWPCA",
  "status": "repealed",
  "issued_date": "1979-12-18",
  "in_force_date": "1979-12-18",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cpmX-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Islamabad Wildlife (Protection, Preservation, Conservation and Management) Ordinance, 1979 (Repealed by Act no. XVI of 2024 section 41 (w.e.f 27-08-2024)) (LXX of 1979) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Power to make rules",
      "content": "THE ISLAMABAD WILDLIFE (PROTECTION, PRESERVATION,\nCONSERVATION AND MANAGEMENT) ORDINANCE, 1979\nORDINANCE No. LXX of 1979\n[19th December, 1979]\nAn Ordinance to provide for the protection, preservation, conservation and management of wildlife\nand setting up of a National Park in the Islamabad Capital Territory.\nWHEREAS it is expedient to provide for the protection, preservation, conservation and\nmanagement of wildlife and setting up of a National Park in the Islamabad Capital Territory;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of the fifty day of July, 1977, read\nwith the Laws (Continuance in Force) Order, 1977 (CM.LA. Order No. 1 of 1977), and in exercise of\nall powers enabling him in that behalf, the President is pleased to make and promulgate the following\nOrdinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Ordinance may be called the Islamabad\nWildlife (Protection, Preservation, Conservation and Management) Ordinance, 1979.\n(2) It extends to the Islamabad Capital Territory.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Ordinance, unless there is anything repugnant in the subject or\ncontext:—\n(a)    “authorised officer” means any person whom the Federal Government or any\nofficer empowered by the Federal Government in this behalf may appoint to\ncarry out all or any of the purposes of this Ordinance or to do anything required\nby this Ordnance or the rules, to be done by an authorised officer;\n(b)    “Board” means the Wildlife Management Board constituted under section 4;\n(c)    “capture” means the taking alive of any wild animal;\n(d)    “certificate of lawful possession” means a certificate of lawful possession issued\nunder section 9 ;\n(e)    “dealer’s permit” means a dealer’s permit issued under section 14;\n(f)    “game animal” means a wild animal specified in the First Schedule;\n(g)    “game reserve” means an area declared as such under section 22;\n(h)    “hunting” means any act immediately directed to the killing or capturing of wild\nanimal, and includes the taking of nests or eggs of such animals;\n(i)    “hunting permit” means a hunting permit .issued under sub-section (2) of\nsection 22;\n(j)     “Licence” means a licence issued under section 7;\n(k)     “meat” means the fat, blood, flesh or any edible part of a wild animal, whether\nfresh or preserved;\n(1)     “national park” means an area declared as such under section 21;\n(m)     “prescribed” means prescribed by rules; .\n(n)     “Private game reserve” means an area declared as such under section 23;\n(o)     “protected animal” means an animal or bird specified in the Third Schedule;\n(p)     “rules” means rules made under this Ordinance;\n(q)     “trophy” means the dead body of a wild animal or any ; horn, antler, tooth, tusk,\nbone, claw, hoof, skin, hair, feather, egg, shell or other durable part of any wild\nanimal, whether or not included in a manufactured or processed article;\n(r)     “wild animal” means an animal or bird specified in the First Schedule or the\nThird Schedule;\n(s)     “wildlife” means all natural resources, including organic resources, animals,\nbirds, reptiles, vegetation, soil and water; and\n(t)     “wildlife sanctuary” means an area declared as such under section 20."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Appointment of officers and staff",
      "content": "The Federal Government may, for the purposes of\nthis Ordinance, appoint such officers and staff as it thinks fit and on such terms and conditions as may\nbe prescribed."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Constitution of the Board",
      "content": "(1) The Federal Government may constitute a Board of\nWildlife Management consisting of such members, including a Chairman, as it may appoint.\n(2) The Chairman and members of the Board shall hold office during the pleasure of the Federal\nGovernment and on such terms and conditions as it may determine.\n(3)The Board shall exercise such powers and perform such functions as may be prescribed."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Killing and capturing of wild animals prohibited",
      "content": "Save as otherwise provided in this\nOrdinance and the rules, no person shall hunt, kill or capture wild animals."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Restrictions of hunting",
      "content": "No person shall—\n(i)     hunt any wild animal by means of a set-gun, dropspear, deadfall, gun-trap,\nexplosive projectile, bomb, grenade, baited book or any other trap whatsoever;\n(ii)    hunt any game animal by means of an automatic weapon or a weapon of a\ncalibre used by the Pakistan Army or Police Force, a projectile containing any\ndrug or chemical substance having the property of anaesthetising, paralyzing,\nstuplifying or rendering an animal incapacitated, whether partly or totally ;\n(iii)   hunt any game animal, other than a bird or hare, with a shot-gun or a non-\nmagnum rifle of 22 caliber of less ;\n(iv)    use, or have in his possession, any poison or like injurious substance for the\npurpose of hunting a game animal ;\n(v)     use any motor vehicle motor-driven vessel, water-craft, of any type, aircraft or\nany other manually or mechanically propelled vehicle of any type to pursue,\ndrive or stampede game animal for any purpose whatsoever;\n(vi)    shoot any game animal from any aircraft motor vehicle, rail-trolley, cart, board\nor any kind of watercraft or any other conveyance or form within two hundred\nmetres of such conveyance ;\n(vii)   hunt any wild animal with the help of live decoys or call-birds ; or\n(viii) construct, use or have in his possession for the purpose of hunting any game\nanimal any pitfall, gamepit, trench or similar excavation, fence or enclosure, or\nuse bhagwa or any other contrivance :\nProvided that an authorised officer may, in his discretion, exempt any person from one or more\nof the provisions of this Section:\nProvided further that any wild animal may be driven away from an aerodrome or airstrip by\nusing a motor vehicle or an aircraft if it is necessary to ensure safety of the aircraft using that aerodrome\nor airstrip."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Prohibition to employ hawks and dogs without licence",
      "content": "No person shall use hawks for\nhawking or dogs for coursing game animals, except under a licence issued by an authorised officer in\nsuch manner, on such terms and conditions and on payment of such fees as may be prescribed."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Animals found dead, etc. to be property of the Government",
      "content": "Any wild animal found\ndead or dying or which has been killed or caught otherwise than in accordance with the provisions of\nthe Ordinance or the rules, and any trophy or meat thereof, shall be the property of die Federal\nGovernment."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Certificate of lawful possession",
      "content": "(1) No person shall be in possession of any wild animal,\ntrophy or meat specified in the Second Schedule except under a certificate of lawful possession in\nrespect thereof issued by an authorised officer in such manner, on such terms and conditions on\npayment of such fees as may be prescribed.\n(2) Provided that a person who, on the coming into force of this Ordinance, is in possession of,\nor at any time thereafter, imports or acquires any such animal, trophy or meat shall, within such time\nas may be prescribed, apply to the authorised officer for a certificate of lawful possession.\n(3) The authorised officer shall mark the wild animal, trophy or meat in respect of which a\ncertificate of lawful possession is issued and make entries in respect thereof in the prescribed register.\n(4) The holder of a certificate of lawful possession shall produce the certificate to the authorised\nofficer when asked by him to do so.\n(5) No person shall—\n(a)     be in possession of a wild animal trophy or meat specified in the Second\nSchedule without a certificate of lawful possession or without having applied\nfor such certificate as required by sub-section (2); or\n(b)     counterfeit, change, or in any way interfere with, any mark put on a wild animal,\ntrophy or meat under subsection (3) or alter or in any way change a certificate\nof lawful possession."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Restriction J on transfer’of wild animals, etc",
      "content": "(1) No person who is not possession of\na certificate of lawful possession in respect of a wild animal trophy or meat specified in the Second\nSchedule shall transfer such wild animal, trophy or meat to any other person by way of gift, sale or\notherwise.\n(2) No person shall receive by gift, purchase or otherwise any wild, animal, trophy or meat\nspecified in the Second Schedule unless he is at the same time given the certificate of lawful possession\nclearly mentioning thereon the nature of the transfer and the name of the person to whom the wild\nanimal, trophy or meat is transferred.\n(3) The person to whom a wild animal, trophy or meat is transferred shall submit the certificate\nof lawful possession given to him by the transferor to the authorised officer who shall endorse it in\nfavour of the transferee and make necessary amendment in the prescribed register."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Restriction on import of wild animals, trophies etc",
      "content": "(1) No person shall import, or\nattempt to import, into Pakistan any live wild animal “or any endemic or exotic species thereof, or any\ntrophy or meat, except through a customs-port of entry, and any person, importing such animal, or\nendemic or exotic species, trophy or meat shall, in respect thereof, produce to the officer of customs—\n(i)     proof to his satisfaction that it has been lawfully exported from the country of\nexport;\n(ii)    an import permit.\n(2) The officer of customs may detain any live wild animal,endemic or exotic species, trophy\nor meat, which has been imported until such time as the proof of its lawful export from the country of\nexport is given and the import permit is surrendered to him, and if the proof is not given or the import\npermit is not surrendered within a reasonable time, the wild animal, endemic or exotic species, trophy\nor meat shall be forfeited to the Federal Government and disposed of in the prescribed manner."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Restriction on export of wild animals, trophies, etc",
      "content": "No person shall export, or attempt\nto export, any wild animal, trophy or meat except through a customs-port of exit, and a person\nexporting such animal, trophy or meat shall produce to the officer of customs an export permit in\nrespect thereof."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Animals, trophies, etc., in transit",
      "content": "Nothing in sections 11 and 12 shall apply to any live\nwild animal, any endemic or exotic species, thereof or any trophy or meat in transit through Pakistan,\nif the animal, endemic or exotic species or trophy or meat—\n(i)     is accompanied by transit documents ;\n(ii)    enters through a customs-port of entry ; and\n(iii)   is not unloaded from the ship or motor vehicle on which it is being carried, or,\nin case of rail or air transport, does not leave the precinct of the railway station\nor the airport at which it is landed or transshipped or does not remain at such\nprecincts, except in a customs-warehouse, for more than forty-eight hours."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Restriction on dealing in wild animals, trophies, etc",
      "content": "(1) No person shall engage\nhimself in any trade or business, or otherwise deal in, any wild animal, trophy or meat, or, in the course\nof such trade or business carried on by him on his own behalf or on behalf of any other person, shall\nsell, purchase* barter, cut, carve, polish, preserve, cleanior mount any wild animal, trophy or meat, or\nmanufacture any article therefrom unless he has obtained a dealer’s permit issued by an authorised\nofficer in such manner, on such terms and conditions and on payment of such fees as may be\nprescribed.\n(2) The holder of a dealer’s permit shall maintain such record of transactions as the authorised\nofficer may require, and shall produce it for inspection at any reasonable time when called upon to do\nso.\n(3) Nothing in this section shall be construed to absolve the holder of a dealer’s permit from\ncomplying with the other provisions of this Ordinance."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Power to search without warrant",
      "content": "Any authorised officer, if he has reason to believe\nthat any person has in his possession or control any wild animal, endemic or exotic species or trophy\nor meat in an. unauthorised manner or has committed an offence under this Ordinance, may search any\nperson place-, vessel, vehicle, animal, package, receptacle or covering without warrant."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Power of seizure",
      "content": "(1) Any authorised officer may seize any wild animal which is in the\npossession of a person who is not authorised to possess it under this Ordinance or the rule, together\nwith any firearm, net, trap, snare, bow, arrow, vehicle, vessel or anything whatsoever used or suspected\nto have been used in the commission of an offence under this Ordinance.\n(2) The property seized under sub-section (1) shall be dealt with in accordance with the orders\nof the court or the authorised officer compounding the offence under section 33 as the case may be :\nProvided that, if the property is subject to natural decay, it may at any time be sold with the\npermission of the court and the proceeds shall be dealt with in accordance with the orders of the court."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Onus of proof respecting property",
      "content": "When in any proceeding under this Ordinance a\nquestion arises as to whether a wild animal, trophy or meat is the property of the Federal Government,\nsuch wild animal, trophy or meat shall be presumed to be the property of the Federal Government until\nthe contrary is proved."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Duty ofchaukidars, dafadars, village watchmen, etc",
      "content": "Every purchaser of forest\nproduce, lambardar, canal patwari, public works department daroga, chaukidar, village watchman,\nabdar, zilladar, revenue patwari, chairman or member of a local authority qanungo and tehsildar shall\nbe bound, in the absence of reasonable excuse, to give to the authorised officer information in respect\nof any snaring, trapping, netting, unauthorised killing or any other offence under this Ordinance\ncommitted within the limits of his jurisdiction as soon as the commission of such offence comes to his\nknowledge."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Killing or capturing in self",
      "content": "defense.—(1) Notwithstanding anything contained in this\nOrdinance, it shall not be an offence—\n(a)     for any person to kill or capture any wild animal by any means in the defence\nof his own life or the life of any other person ;\n(b)     for the owner of standing crops or his employee to kill or capture by any means\nwithin the bounds of those crops, any wild animal which is causing material\ndamage to those crops;\n(c)     for the owner of livestock or his employee to kill or capture, by any means\nwithin a reasonable distance from where the livestock is grazing or where it is\nenclosed for the night, any wild animal which is causing damage to the\nlivestock:\nProvided that clauses (b) and (c) shall not apply to any unlawful cultivation in a national park,\nwildlife sanctuary, or game reserve or any livestock illegally grazing or herded therein.\n(2) The killing or capturing of any wild animal under subsection (1) shall, as soon as may be,\nbe reported to the authorised officer or the nearest police-station.\n(3) The trophy or meat of any wild animal killed under subsection (1) shall be the property of\nthe Federal Government and shall be disposed of in such manner as the authorised officer may direct."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Wild life sanctuary",
      "content": "(1) With a view to securing undisturbed breeding of wildlife, the\nFederal Government may, by notification in the official Gazette, declare any area to be a wildlife\nsanctuary.\n(2) Subject to rules, the wildlife sanctuary shall be closed to public, and no exploitation of\nforest therein shall be allowed except for reducing fire hazards, epidemic or insect attacks or other\nnatural calamities.\n(3) No person shall enter or reside, cultivate any land, damage or destroy any vegetation\nintroduce any endemic or exotic species of any animal or plant, introduce any domestic animal or allow\nit to stray, cause any fire, or pollute water, in a wildlife sanctuary, or hunt, kill or capture any wild\nanimal or fire any gun or other fire-arm within one and half kilometre of the boundaries thereof:\nProvided that the authorised officer may, for specific purposes authorise the doing of any of"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. National Park",
      "content": "(1) With a view to protecting and preserving scenery, flora and fauna in\nnatural state, the Federal Government may, by notification in the official Gazette, declare any area to\nbe a national park.\n(2) The national park shall be accessible to public for recreation, education and research,\nsubject to such restrictions as the Federal Government may impose.\n(3) Provision for access roads to, and construction of rest houses, hotels and other buildings in\nthe national park along with amenities for public may be so made, the forest therein shall be so\nmanaged and forest produce so obtained as not impair the object for which it is declared a national\npark.\n(4) Except as otherwise provided by this Ordinance and the rules, the following acts shall be\nprohibited in a national park, namely:__\n(i)     hunting, shooting, trapping, killing, or capturing of any wild animal within a\nradius of two kilometers of its boundaries;\n(ii)    firing any fire-arm or doing of any other act which may disturb any wild animal\nor interfere with its breeding place;\n(iii)   felling, tapping, burning, damaging or destroying of, or taking, collecting or\nremoving therefrom, any plant or tree;\n(iv)   clearing or breaking up of any land for cultivation, minig or for any other\npurpose; and\n(v)    polluting water flowing in or though it:\nProvided that the authorised officer may, for specific purposes, authorize the doing of any of"
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Game reserve",
      "content": "_(1) With a view to providing facilities for hunting the Federal\nGovernment may, by a notification I the official Gazette, declare any area to be a game reserve, but no\nperson shall hunt, shoot or capture any wild animal in a game reserve, except in the case of game\nanimal specified in the First Schedule, under a hunting permit.\n(2) A hunting permit may be issued by an authorsed officer in such manner, on such terms and\ncondition and on payment of such fees as may be prescribed.\n(3) The holder of a hunting permit may hunt such number of game animal specified in the First\nSchedule and during such period as may be specified by the authorised officer."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Private game reserve",
      "content": "(1) Where the Federal Government is satisfied that private land\nhas been dedicated by its owner for the purposes similar to that of a game reserve, it may on the\napplication of the owner of that land, by notification declare such land to be a private game reserve.\n(2) Hunting of wild animals by any person other than the owner of the land shall not be allowed\nin a private game reserve except with the permission of the owner thereof.\n(3) The Federal Government may, by notification in the official Gazette, at any time declare\nthat any private game reserve shall cease to be a private game reserve."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Alteration of boundaries of wildlife sanctuary, nadonal park, game reserve and",
      "content": "private game reserve. —The Federal Government may by notification in the official Gazette, declare\nany alteration in the boundaries of a wildlife sanctuary, national park, game reserve or private game\nreserve."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Interference in duty",
      "content": "Any interference in the discharge of the duties of any person\nappointed for the purposes of this Ordinance or the rules shall be unlawful."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Penalties",
      "content": "(1) Whoever kills or abets in the killing of a protected animal. Otherwise than\nin accordance with the provisions of this Ordinance or the rules shall be punishable with imprisonment\nfor a term which may extend to one year, or with fine which may extend to two thousand rupees, or\nwith both.\n(2) Subject to sub-section (1), whoever contravenes, attempts to contravene, or abets in the\ncontravention of, any provision—\n(i)    section 6, 9, 10, 11, 12 or 14 shall be punishable with imprisonment for a term\nwhich may extend to one year, or with fine which may extend to one thousand\nrupees, or with both ;\n(ii)   section 7 or 8 shall be punishable with imprisonment for a term which may\nextend to six months, or with fine which may extend to five hundred rupees, or\nwith both ; and\n(iii)   this Ordinance or any rule for the contravention of which no specific penalty is\nprovided shall be punishable with fine which may extend to one thousand\nrupees.\n(3) The licence, hunting permit, dealer’s permit or certificate of lawful possession, as the case\nmay be, of a person who is convicted under sub-section (1) shall be liable to cancellation and such\nperson shall not be eligible to the grant of such licence, permit or certificate for such period as may be\ndetermined by the authorised officer."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Prosecution for offence under any other law",
      "content": "Nothing contained in this Ordinance\nshall be deemed to prevent any person from being prosecuted under any other law for any act or\nomission which constitutes an offence under this Ordinance or from being liable under any other law\nto any higher punishment or penalty than that provided by this Ordinance."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Procedure when offender not known or cannot be found",
      "content": "Where the authorised officer\nfinds, or it is brought to his notice, that an offence under this Ordinance has been committed, and the\noffender is not known, or cannot be found within a reasonable time he may confiscate any article used\nin the commission of the offence."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Power to arrest",
      "content": "(1) An authorised officer may, without warrant, arrest any person\nagainst whom reasonable suspicion exists of his having been concerned in any offence under this\nOrdinance.\n(2) The officer making arrest under sub-section (1) shall, without unnecessary delay and subject\nto the other provisions of this Ordinance, take or send the person arrested to the officer-in-charge of\nthe nearest police-station."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Power to release arrested persons on bond",
      "content": "An authorised officer of grade 17 or above\nmay release a person arrested under section 29 on his executing a bond to appear, if and when so\nrequired, before the officer-in-charge of the nearest police-station."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Power to prevent commission of offence",
      "content": "Every authorised officer and any other person\nauthorised by the Federal Government in this behalf shall be competent to take all lawful means to\nprevent the commission of any offence under this Ordinance."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Appointment of Magistrates etc",
      "content": "(1) Notwithstanding anything contained in the Code\nof Criminal Procedure, 1898, the Federal Government may appoint any person to be a Magistrate of\nauthorize any Magistrate of the first class to try such offences.\n(2) No Court other than a Magistrate appointed or authorised under sub-section (1) shall try\nany offence under this Ordinance.\n(3) A Magistrate of the first class competent to try offences under this Ordinance, may, if he\nthinks fit, try in a summary way all or any of die offences.\n(4) Any person convicted under section 28 may, within thirty days from the date of his\nconviction, appeal to the Court of Session, whose decision thereon shall be final."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Power to compound offence",
      "content": "(1) The Federal Government, may by notification in the\nofficial Gazette, empower an officer not inferior in rank to an officer in grade 17 of the National Pay\nScales:—\n(a)     to accept from any person against whom reasonable suspicion exists that he has\ncommitted any offence under this Ordinance, a sum of money by way of\ncompensation for such offence.\n(b)     when any property has been seized as liable to confiscation, to release the same\non payment of the value thereof, as estimated by such officer.\n(2) On the payment of compensation, such sum of money, or such value of property under sub-\nsection (1) or both, as the case may be, the suspected person, if in custody, shall be discharged and the\nproperty, if any, seized shall be released and no further proceedings shall be taken against such person\nor property.\n(3) The sum of money accepted as compensation under clause (a) of sub-section (I), shall in no\ncase, exceed the sum of five hundred rupees.\n(4)No officer shall have power to compound a second or subsequent offence under this\nOrdinance."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Investment of certain powers",
      "content": "The Federal Government may, by order in writing, invest\nany officer of grade 17 or above with all or any of the following powers, namely:—\n(a)     power of a civil court to compel the attendance of witnesses and the production\nof documents and material objects ;\n(b)     power to hold inquiry into offences under this Ordinance, and, in the course of\nsuch inquiry, to receive and record evidence ; and\n(c)     power to prosecute a case before a Magistrate."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Persons appointed under this Ordinance to be public servants",
      "content": "All persons appointed\nunder this Ordinance shall be deemed to be public servants within the meaning of section 21 of the\nPakistan Penal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Indemnity and bar of Jurisdiction",
      "content": "(1) No suit, prosecution or other legal proceeding\nshall lie against the Federal Government or any other person for anything done or intended to be done\nin good faith under this Ordinance or the rules.\n(2) No court shall call in question, or permit to be called in question, anything done or any\naction taken under this Ordinance."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Duty of Police Officers",
      "content": "All police officers shall, upon request made by any person\nperforming duties under this Ordinance or the rules, assist him in the discharge of such duties."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Delegation of powers",
      "content": "The Federal Government may, by notification in the official\nGazette, direct that all or any of its powers under this Ordinance shall be exercised by such officer and\nsubject to such conditions as may be specified."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Power to grant exemption",
      "content": "Notwithstanding anything contained in this Ordinance, the\nFederal Government may, for public or scientific purposes, by notification in the official Gazette, allow\nthe killing and capturing of any wild animal by such person, at such place, and by such means as may\nbe specified in the notification."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Power to amend Schedules",
      "content": "The Federal Government may, by notification in the\nofficial Gazette, make such amendment in the Schedules as it thinks fit."
    }
  ],
  "definitions": [
    {
      "term": "authorised officer",
      "definition": "any person whom the Federal Government or any officer empowered by the Federal Government in this behalf may appoint to carry out all or any of the purposes of this Ordinance or to do anything required by this Ordnance or the rules, to be done by an authorised officer;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Wildlife Management Board constituted under section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "capture",
      "definition": "the taking alive of any wild animal;",
      "source_provision": "sec2"
    },
    {
      "term": "certificate of lawful possession",
      "definition": "a certificate of lawful possession issued under section 9 ;",
      "source_provision": "sec2"
    },
    {
      "term": "dealer’s permit",
      "definition": "a dealer’s permit issued under section 14;",
      "source_provision": "sec2"
    },
    {
      "term": "game animal",
      "definition": "a wild animal specified in the First Schedule;",
      "source_provision": "sec2"
    },
    {
      "term": "game reserve",
      "definition": "an area declared as such under section 22;",
      "source_provision": "sec2"
    },
    {
      "term": "hunting",
      "definition": "any act immediately directed to the killing or capturing of wild animal, and includes the taking of nests or eggs of such animals;",
      "source_provision": "sec2"
    },
    {
      "term": "hunting permit",
      "definition": "a hunting permit .issued under sub-section (2) of section 22;",
      "source_provision": "sec2"
    },
    {
      "term": "Licence",
      "definition": "a licence issued under section 7;",
      "source_provision": "sec2"
    },
    {
      "term": "meat",
      "definition": "the fat, blood, flesh or any edible part of a wild animal, whether fresh or preserved; (1) “national park” means an area declared as such under section 21;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules; .",
      "source_provision": "sec2"
    },
    {
      "term": "Private game reserve",
      "definition": "an area declared as such under section 23;",
      "source_provision": "sec2"
    },
    {
      "term": "protected animal",
      "definition": "an animal or bird specified in the Third Schedule;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "trophy",
      "definition": "the dead body of a wild animal or any ; horn, antler, tooth, tusk, bone, claw, hoof, skin, hair, feather, egg, shell or other durable part of any wild animal, whether or not included in a manufactured or processed article;",
      "source_provision": "sec2"
    },
    {
      "term": "wild animal",
      "definition": "an animal or bird specified in the First Schedule or the Third Schedule;",
      "source_provision": "sec2"
    },
    {
      "term": "wildlife",
      "definition": "all natural resources, including organic resources, animals, birds, reptiles, vegetation, soil and water; and",
      "source_provision": "sec2"
    },
    {
      "term": "wildlife sanctuary",
      "definition": "an area declared as such under section 20.",
      "source_provision": "sec2"
    }
  ]
}
