{
  "id": "pk-jammu-and-kashmir-administration-of-property-ordinance-1961",
  "type": "statute",
  "title": "Jammu and Kashmir (Administration of property) Ordinance, 1961",
  "title_en": "Jammu and Kashmir (Administration of property) Ordinance, 1961",
  "short_name": "JAKOP",
  "status": "in_force",
  "issued_date": "1961-02-12",
  "in_force_date": "1961-02-12",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJyU-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Jammu and Kashmir (Administration of property) Ordinance, 1961 (III of 1961) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec3b",
      "section": "3B",
      "title": "Section 3B. Appeal",
      "content": "_(1) Any person aggrieved by an order of the Administrator under section 3A\nmay, within three months of the date of such order, prefer an appeal to such authority as the Federal\nGovernment may, by notification in the official Gazette, specify in this behalf.\n(2) The authority specified under sub-section (1) may make such further inquiry as it may\nconsider necessary and, after giving the appellant an opportunity of being heard if he so desires, pass\nsuch orders as it thinks fit confirming, altering or annulling the order appealed against.\n(3) The authority specified under sub-section (1) shall, for the purpose of deciding an appeal,\nbe deemed to be a civil court and shall have the same powers as are vested in such court under the Code\nof Civil Procedure, 1908 (Act V of 1908), including the powers of___\n(a)        summoning and enforcing the attendance of any persons and examining him on\noath ;\n1\nSubs. & Ins. by Act No. XVIII of 1977, ss.2 and 3.\n2\nSubs. by F.A.O., 1975 Art. 2 and Table.\n3\nIns. by Ordinance No. XLI of 1979, s. 2.\n(b)        compelling the discovery and production of any document ; and\n(c)        issuing commissions for the examination of witnesses and documents."
    },
    {
      "provision_ref": "sec3c",
      "section": "3C",
      "title": "Section 3C. Revision",
      "content": "_The Federal Government may, on the application of any person aggrieved by\nan order passed by the authority under section 3B, if the application is made within thirty days of the\ncommunication of such order to him, pass such order in relation thereto as it thinks fit :\nProvided that no order under this section shall be passed unless the person likely to be affected\nthereby has been given an opportunity of showing cause against it or of being heard personally or\nthrough counsel or a duly authorised agent.]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Deposit of sale proceeds etc.",
      "content": "_(1) The proceeds of any sale effected under section 3 shall\nbe deposited in a special account to be called “The Sale Proceeds Account of Immovable Property of\nJammu and Kashmir State”.\n1\n[(2) The amount deposited in the account mentioned in sub-section (1) and the income from\nthat amount, shall be utilized for such purposes including the rehabilitation of refugees from the State\nof Jammu and Kashmir, as may be prescribed by rules made under section 6 or as may be determined\nby the Federal Government.]."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Certification of sale",
      "content": "_(1) The sale to the purchaser shall be certified by the 2[Federal\nGovernment] in the manner prescribed by rules made under section 6.\n(2) A certificate granted under sub-section (1) shall be conclusive proof of full title acquired by the\npurchaser.\n3\n[5A. 1[Administrator] and certain other persons to be public servants.___The\n1\n[Administrator], and every other person duly appointed or authorised to perform any function under\nthis Ordinance, shall be deemed to be a public servant within the meaning of section 21 of the Pakistan\nPenal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec5b",
      "section": "5B",
      "title": "Section 5B. Bar of legal proceedings, etc",
      "content": "_(1) No suit, prosecution or other legal proceeding shall\nlie against Government, the 1[Administrator] or any other person for anything which is in good faith\ndone or intended to be done under this Ordinance.\n(2) Properties vested in the 2[Federal Government] under section 2 shall be exempt from all\nlegal processes, including seizure, distress, ejectment, attachment or sale by any officer of a Court or\nany other authority, and 1[no Court shall have jurisdiction, or entertain any proceedings, in respect of\nany such property or of any matter within the competence of the Federal Government, the\nAdministrator or other authority and no injunction or other order of whatever kind shall be passed or\nmade by any Court or other authority in respect of any such property or of any action taken or to be\ntaken in exercise of any power conferred by or under this Ordinance]."
    },
    {
      "provision_ref": "sec5c",
      "section": "5C",
      "title": "Section 5C. Recovery of arrears",
      "content": "_Any sum due, whether as rent or otherwise, in respect of any of\nthe aforesaid properties, if not paid within the time specified by the 1[Administrator] shall be\nrecoverable as arrears of land revenue.].\n1\nSubs. by Act No. XVIII of 1977, Ss. 4, 5, 6 and 7.\n2\nSubs. by F.A.O., 1975, Art. 2 and Table.\n3\nSections 5A, 5B and 5C ins. by Ordinance No. XLIII of 1961, s.5."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to make rules",
      "content": "_(1) The 1[Federal Government] may make rules, not inconsistent\nwith the provisions of this Ordinance, to carry into effect any of its purposes.\n2\n[(2) Without prejudice to the provisions of sub-section (1), such rules may provide___\n(a)        the manner in which any notice under this Ordinance may be served ;\n3\n[(aa) the functions, powers and procedure of the Management Committee constituted\nunder sub-section (1A) of section 3 ;]\n(b)        the manner in which the 3[Administrator] or any person authorized by him in\nthis behalf, may take possession of any property ;\n(c)        the manner in which any person in unauthorized occupation or wrongful\npossession of any property may be summarily evicted ;\n(d)        the manner in which any unauthorized construction or any property may be\ndemolished or dismantled ;\n(e)        the manner in which the amount in the account mentioned in sub-section (1) of\nsection 4 may be invested ;\n(f)        the purposes for which the income from the amount invested under clause (e)\nmay be utilized;\n(g)        the purposes for which any portion of the amounts deposited in the said account\nmay be utilized; and\n(h)        the purposes for which the rents received from the lease of any property may be\nutilized.]"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Final adjustment of the account.___The account mentioned in sub",
      "content": "section (1) of section 4\nshall be adjusted after the status of Jammu and Kashmir has been finally determined.\n_____________\nRGN Date: 16-05-2024\n1\nSubs. by F.A.O., 1975, Art. 2 and Table.\n2\nSubs. by Ordinance No. XLIII of 1961, s. 6.\n3\nIns. by Act No. XVIII of 1977, s. 8."
    }
  ],
  "definitions": []
}
