{
  "id": "pk-juvenile-justice-system-act-2018",
  "type": "statute",
  "title": "Juvenile Justice System Act, 2018",
  "title_en": "Juvenile Justice System Act, 2018",
  "short_name": "JJSA",
  "status": "in_force",
  "issued_date": "2018-05-23",
  "in_force_date": "2018-05-23",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap%2BVZA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Juvenile Justice System Act, 2018 (XXI of 2018) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Act may be called the Juvenile Justice",
      "content": "System Act, 2018.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.⸻In this Act, unless there is anything repugnant in the subject or context,⸻",
      "content": "(a)     “best interest of the child” means the basis for any decision taken regarding the child\nto ensure fulfillment of his basic rights and needs, identity, social well-being,\nphysical, emotional and psychological development;\n(b)     “child” means for the purposes of this Act a person who has not attained the age of\neighteen years;\n(c)     “Code” means the Code of Criminal procedure, 1898 (Act V of 1898);\n(d)     “diversion” means an alternative process of determining the responsibility and\ntreatment of a juvenile on the basis of his social, cultural, economic, psychological\nand educational background without resorting to formal judicial proceedings;\n(e)     “Government” means the Federal Government or the Provincial Government, as\nthe case may be;\n(f)     “guardian” in relation to a juvenile means a parent or a person who has been\nappointed as a guardian by the court or a person who has actual care of the child;\n(g)     “heinous offence” means an offence which is serious, gruesome, brutal, sensational\nin character or shocking to public morality and which is punishable under the\nPakistan Penal Code, 1860 (Act XIV of 1860) or any other law for the time being\nin force with death or imprisonment for life or imprisonment for more than seven\nyears with or without fine;\n(h)         “juvenile” means, a child who may be dealt with for an offence in a manner which\nis different from an adult;\n(i)         “Juvenile Court” means a court established under section 4;\n(j)         “Juvenile Justice Committee” means a committee established under section 10;\n(k)         “Juvenile Rehabilitation Centre” means a place where a juvenile may be kept and\ngiven education, vocational or technical training for his mental, moral and\npsychological development and includes certified institutions, juvenile training\ninstitutions, borstal institutions, vocational centres, darul-amaan and women crises\ncentres established by the Government or by voluntary organizational certified by\nthe Government;\n(l)         “Juvenile offender” means a child who is alleged to have committed or who has\nbeen found to have committed an offence;\n(m)         “major offence” means an offence for which punishment under the Pakistan Penal\nCode, 1860 (Act XIV of 1860) or any other law for the time being in force is more\nthan three years and up to seven years imprisonment with or without fine;\n(n)         “medical officer” means a medical officer notified as such by the 1[Division\nconcerned or relevant department of provincial Governments];\n(o)         “minor offence” means an offence for which maximum punishment under the\nPakistan Penal Code, 1860 (XLV of 1860)or any other law for the time being in\nforce is imprisonment up to three years with or without fine;\n(p)         “observation home” means a place where a juvenile is kept temporarily after being\napprehended by police as well as after obtaining remand from Juvenile Court or\notherwise for conducting inquiry or investigation for the purposes of this Act;\n(q)         “prescribed” means prescribed by rules made under this Act;\n(r)         “probation officer” means a person appointed under the Probation of Offenders\nOrdinance, 1960 (XLV of 1960);and\n(s)         “suitable person” means any person, trust, association or society duly recognized\nby law whose object is welfare and protection of children.\nExplanation⸻person in this clause means the guardian of a juvenile or any\nother person appointed by a Juvenile Court for the purposes of this Act.\n1\nSubs. by Act No. III of 2022, s. 2."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Legal assistance. (1) Every juvenile or a child who is victim of an offence shall have the right",
      "content": "of legal assistance at expense of the State.\n(2) A juvenile shall be informed about his rights available under the law by a legal practitioner\nwithin twenty four hours of taking him into custody.\n(3) A legal practitioner appointed by the 1[Division concerned or relevant department of provincial\nGovernments] or by the Juvenile court for providing legal assistance to a child victim of an offence or a\njuvenile shall have at least seven years standing at the Bar."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Juvenile Court. (1) The 1[Prime Minister] in consultation with the concerned High Court",
      "content": "shall [by notification in the official Gazette] establish or designate one or more Juvenile Courts, within\na period of three months of the commencement of this Act.\n(2) A Juvenile Court may be established for one or more sessions divisions and in that case the\nJuvenile Court may hold trial of a case at such place as the High Court may specify.\n(3) No person shall be appointed as a Judge of a Juvenile Court unless he is or has been a Sessions\nJudge or an Additional Sessions Judge or a Judicial Magistrate vested with powers under section 30 of the\nCode or a practicing advocate who has at least ten years standing at Bar and the latter shall be appointed\non such terms and conditions as the 1[Prime Minister] may determine in consultation with the concerned\nHigh Court.\n(4) The Juvenile Court shall have exclusive jurisdiction to try cases in which a juvenile is accused\nof commission of an offence.\n(5) Subject to sub-section (4), on commencement of this Act all cases pending before a trial court\nin which a juvenile is accused of an offence shall stand transferred to the Juvenile Court having\njurisdiction.\n(6) The Juvenile Court shall not, merely by reason of a change in its composition or transfer of a\ncase under sub-section (5) be bound to recall or re-hear any witness who has given evidence and may act\non the evidence already recorded.\n(7) If any court taking cognizance of an offence finds that an accused brought before it is a juvenile,\nit shall transfer his case to the Juvenile Court for further proceedings.\n(8) On taking cognizance of an offence, the Juvenile Court shall decide the case within six months.\n(9) Where the case is not decided within six months in terms of sub-section (8), the Juvenile Court\nshall seek extension from the High Court concerned explaining the reasons for not being able to decide\nthe case within prescribed time limit. If no such extension has been sought by the Juvenile Court, the\ncomplainant or the juvenile may make an application to the High Court in this respect.\n1\nSubs. by Act No. III of 2022, ss. 3-4.\n(10) The Juvenile court may hold its sitting at a place, other than the place in which the ordinary\ncourts hold sittings for trial of other cases."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Arrest of a juvenile. (1) The arrested juvenile shall be kept in an observation home and the",
      "content": "officer-in-charge of the police station shall, as soon as possible,\n(a)     inform guardian of the juvenile, if he can be found, of such arrest and inform him\nof the time, date and name of the Juvenile Court before which the juvenile shall be\nproduced; and\n(b)     inform the concerned probation officer to enable him to obtain such information\nabout the juvenile and other material circumstances which may be of assistance to\nthe Juvenile Court for making inquiry.\n(2) No juvenile shall be arrested under any of the laws dealing with preventive detention or under\nthe provisions of Chapter VIII of the Code.\n(3) The report under section 173 of the Code shall also describe the steps taken by the officer-in-\ncharge for referring the matter to the Juvenile Justice Committee for disposal of case through diversion,\nwhere it was so required under section 9."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Release of a juvenile on bail. (1) Notwithstanding anything contained in the Code, a juvenile",
      "content": "accused of bailable offence shall, if already not released under section 496 of the Code, be released by the\nJuvenile Court on bail with or without surety unless it appears that there are reasonable grounds for\nbelieving that the release of such juvenile may bring him in association with criminals or expose him to\nany other danger. In this situation the juvenile shall be placed under the custody of a suitable person or\nJuvenile Rehabilitation Centre under the supervision of probation officer. The juvenile shall not under any\ncircumstances be kept in a police station under police custody or jail in such cases.\n(2) The Juvenile Court shall, in a case where a juvenile is not released under subsection (1), direct\nthe police for tracing guardian of such juvenile and where guardian of such juvenile is traced out, the\nJuvenile Court may immediately handover custody of the juvenile to his guardian.\n(3) Where a juvenile is arrested or detained for commission of a minor or a major offence for the\npurposes of this Act, he shall be treated as if he was accused of commission of a bailable offence.\n(4) Where a juvenile of more than sixteen years of age is arrested or detained for a heinous offence,\nhe may not be released on bail if the Juvenile Court is of the opinion that there are reasonable grounds to\nbelieve that such juvenile is involved in commission of a heinous offence.\n(5) Where the Juvenile Court is of the opinion that the delay in the trial of a juvenile has not been\noccasioned by an act or omission of such juvenile or any other person acting on his behalf or in exercise\nof any right or privilege under any law for the time being in force, such juvenile shall be released on bail\nif he has been detained for a continuous period exceeding six months and whose trial has not been\ncompleted."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Investigation in juvenile cases. (1) A juvenile shall be interrogated by a police officer not",
      "content": "below the rank of Sub Inspector under supervision of Superintendent of Police or SDPO.\n(2) The investigation officer designated under sub-section (1) shall be assisted by a probation\n.\nofficer or by a social welfare officer notified by the Government to prepare social investigation report to\nbe annexed with the report prepared under section 173 of the Code."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Determination of age. (1) Where a person alleged to have committed an offence physically",
      "content": "appears or claims to be a juvenile for the purpose of this Act, the officer-in-charge of the police station or\nthe investigation officer shall make an inquiry to determine the age of such person on the basis of his birth\ncertificate, educational certificates or any other pertinent documents. In absence of such documents, age\nof such accused person may be determined on the basis of a medical examination report by a medical\nofficer.\n(2) When an accused person who physically appears to be a juvenile for the purpose of this Act is\nbrought before a Court under section 167 of the Code, the Court before granting further detention shall\nrecord its findings regarding age on the basis of available record including the report submitted by the\npolice or medical examination report by a medical officer."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Disposal of cases through diversion. (1) With the consent of a juvenile or his guardian, as",
      "content": "the case may be, the complaint against a juvenile relating to offences as specified in sub-section (6) shall\nbe referred to the Juvenile Justice Committee for disposal of the same through diversion.\n(2) The diversion can be exercised at any stage during the course of investigation by the police and\nduring trial by the prosecution and the Court in the prescribed manner.\n(3) Where a case is referred to the Juvenile Justice Committee by the police, the submission of\nreport of police officer required under section 173 of the Code shall be postponed till the final order of the\nCommittee.\n(4) The Juvenile Justice Committee shall dispose of a case, with consent of the person against\nwhom the offence was committed, by resorting to different modes of diversion including,⸻\n(a)     restitution of movable property;\n(b)     reparation of the damage caused;\n(c)     written or oral apology;\n(d)     participation in community service;\n(e)     payments of fine and costs of the proceedings;\n(f)     placement in Juvenile Rehabilitation Centre; and\n(g)     written and oral reprimand:\nProvided that where the complainant is a state functionary and the offence\nhas not been committed against a private person, the Juvenile Justice committee\nmay dispose of the case through diversion with consent of the concerned public\nprosecutor.\n(5) For the purposes of diversion, all offences either minor or major shall be compoundable.\n(6) Diversion shall be exercised in the prescribed manner in cases,\n(a)         where a juvenile is accused of commission of minor offences; and\n(b)         where a juvenile is accused of commission of major offences and the age of the\njuvenile is not more than sixteen years at the time of commission of offence."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Juvenile Justice Committee. (1) on commencement of this Act but not later than three",
      "content": "months, the 1[Law and Justice Division] in consultation with the concerned Sessions Judge shall establish\nthe Juvenile Justice Committee for each sessions division.\n(2) The Juvenile Justice Committee shall consist of four members with following composition,\nnamely:\n(a)         serving Judicial Magistrate with powers under section 30 of the Code, who shall\nalso head the Committee;\n(b)         district Public Prosecutor;\n(c)         member of local Bar having at least seven years standing at the Bar, appointed by\nthe concerned Sessions Judge for period of two years;\n(d)         serving probation officer or social welfare officer not below the rank of an officer\nin BPS-17.\n(3) The place of sitting of the Juvenile Justice Committee may preferably be in the same premises\nwhere the Juvenile Court holds sitting.\n(4) The Juvenile Justice Committee shall perform following functions, namely:⸻\n(a)         dispose of the cases through diversion upon referral from the police, prosecution or\nthe Juvenile Court, as the case may be, within a period of one month from the date\nof the referral;\n(b)         inspect the observation homes and Juvenile Rehabilitation Centres and may give\ndirections to the officer-in-charge of such places for the measures to be taken for\nwelfare and social re-integration of the juvenile kept under their supervision; and\n1\nSubs. by Act No. III of 2022, s. 5.\n(c)     such other functions as may be prescribed.\n(5) For the administration and functioning of the Juvenile Justice Committee, provision of staff\nshall be within the powers of the Sessions Judge of respective district."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Procedure of Juvenile Court. (1) Juvenile Court shall follow the procedure provided for in",
      "content": "(2) No person shall be present at any sitting of the Juvenile Court, except,\n(a)     staff and officers of the Juvenile Court;\n(b)     parties to the case before the Juvenile Court and such other persons who are directly\nconcerned with the proceedings including the police officers;\n(c)     guardian of the juvenile; and\n(d)     such other persons as the Juvenile Court directs to be present.\n(3) At any stage of proceedings, the Juvenile Court may in the best interest of a juvenile’s decency\nor morality, direct any person to withdraw from Court for such period as the Court may direct.\n(4) If at any stage of proceedings, the Juvenile Court is satisfied that the attendance of the juvenile\nis not essential for the purposes of the trial, the Juvenile Court may dispense with the attendance and\nproceed with the trial of the case in absence of the juvenile.\n(5) When a juvenile who has been brought before the Juvenile Court is found to be suffering from\nserious illness, whether physical or mental and requires treatment, the Court shall send such juvenile to a\nhospital or a medical institution where treatment shall be given to the juvenile at the expense of the State."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Trial of juvenile with adult person. (1) Notwithstanding anything contained in section 239",
      "content": "of the Code or any other law for the time being in force and subject to the provisions of sub-sections (2)\nand (3), no juvenile may be charged with and tried for an offence together with an adult.\n(2) A juvenile may be charged with and tried together with an adult by the Juvenile Court if the\nCourt is satisfied that it is in the interests of justice to hold a joint trial.\n(3) In case of joint trial, the Juvenile Court may dispense with the physical presence of the juvenile\nbefore it without any application in this regard and juvenile may be allowed to join the Court proceedings\nthrough audio-visual technology link."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Disclosure of identity of the juvenile. (1) whoever prints or publishes the name or any",
      "content": "matter which may make known identity of a juvenile shall be punished with imprisonment bf either\ndescription for a term which may extend to three years and shall also be liable to fine.\n(2) Nothing in sub-section (1) extends to any printing or publication of the name or any matter\nwhich may make known the identity of a juvenile if such printing or publication is,\n(a)    by or under the order in writing of the officer-in-charge of the police station or the\npolice officer making the investigation into such offence acting in good faith for\nthe purposes of such investigation; or\n(b)    by or with the authorization in writing of the juvenile or the next-of-kin of the\njuvenile:\nProvided that no such authorization shall be given by the next-of-kin to\nanybody other than the chairman or the secretary, by whatever name called, of any\nrecognized welfare institution or organization.\nExplanation. For the purposes of this sub-section, “recognised welfare\ninstitution or organization” means a social welfare institution or organisation\nrecognised in this behalf by the Government.\n(3) Whoever prints or publishes any matter in relation to any proceedings before a Juvenile Court\nwith respect to a juvenile referred to in sub-section (1) without the previous permission of Juvenile Court\nshall be punished with imprisonment of either description for a term which may extend to two years and\nshall also be liable to fine.\nExplanation. The printing or publication of the judgment of any High Court or the Supreme\nCourt does not amount to an offence within the meaning of this section."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Report of probation officer. (1) The probation officer shall assist and prepare a report on",
      "content": "direction of the Juvenile Court within such time as may be directed the Court at any stage regarding,⸻\n(a)    juvenile’s character, educational, social and moral background;\n(b)    juvenile’s admission of committing an offence, if any, made with free consent and\nvoluntarily;\n(c)    any evidence that juvenile actually committed the offence;\n(d)    all legal and appropriate assistance provided at all levels to juvenile for his\nunderstanding, concept and consequences, even to the child’s family and guardian;\n(e)    steps taken for mediation or compromise with the complainant or victim and\npossibility of settlement; and\n(f)    possibility of sending the juvenile to Juvenile Rehabilitation Centre or release on\nprobation.\n(2) Subject to sub-section (3) the report of the probation officer submitted to the Juvenile Court\nshall be treated as confidential.\n(3) The Juvenile Court may, if it so thinks fit, communicate substance of the report to the juvenile’s\nguardian and, where any one of them disputes the contents or views contained therein, the Juvenile Court\nmay give such juvenile or guardian, as the case may be, an opportunity of producing such evidence as may\nbe relevant to the matter stated in the report."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Powers of Juvenile Court to order for release.⸻On receipt of report under section 14 and",
      "content": "on conclusion of an inquiry, investigation or trial, the Juvenile Court may, keeping in view the best interest\nof the child,⸻\n(a)     pass an order for release of the juvenile offender after the victim or complainant, as\nthe case may be, pardons him:\nProvided that the Juvenile Court may refuse to release the juvenile offender\neven if the victim or complainant pardons if the Juvenile Court for reasons to be\nrecorded in writing considers that such release is either against the public policy or\nthe interests of the State;\n(b)     pass an order for the community service, fine, compensation to the victim or\ncomplainant restitution of property, counseling;\n(c)     direct the juvenile offender to be released on probation for good conduct and place\nsuch juvenile offender under care of a guardian or any suitable person or such\nJuvenile Rehabilitation Centre established or certified for the purposes of this Act\nfor any period not exceeding the period of confinement awarded to such juvenile;\n(d)     direct the probation officer to submit probation report in prescribed manner:\nProvided that if a juvenile offender fails to comply with the orders or\nviolates the conditions of orders of release on probation, the Juvenile Court may\npass any order as it may think fit, including cancellation of probation order; or\n(e)     make an order directing the juvenile offender to be sent to a Juvenile Rehabilitation\nCentre until he attains the age of eighteen years or till the completion of period of\nimprisonment, whichever comes earlier."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Orders that shall not be passed with respect to a juvenile. (1) No person who was a",
      "content": "juvenile offender at the time of commission of an offence shall be awarded punishment of death.\n(2) No juvenile offender shall be committed to prison, ordered to labour, put in fetters, handcuffed\nor given any corporal punishment at any time while in custody:\nProvided that if there is reasonable apprehension of the escape of the juvenile offender from\ncustody who is more than sixteen years of age and involved in heinous offence or he is previously\nconvicted of an offence punishable with imprisonment for life, for reasons to be recorded, he may be\nhandcuffed or put into a solitary confinement in a Juvenile Rehabilitation Centre or observation home for\na period not exceeding twenty-four hours."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Special provision for female juvenile. (1) No female juvenile shall in any circumstances be",
      "content": "apprehended or investigated by a male police officer or released on probation under supervision of a male\nofficer.\n(2) A female juvenile shall only be kept in a Juvenile Rehabilitation Centre established or certified\nexclusively for female inmates."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Appeal. (1) Any person convicted by a Juvenile Court may prefer an appeal in accordance",
      "content": "with the provisions of the Code.\n(2) In case of a juvenile offender, the appeal may be preferred by guardian acting on behalf of the\njuvenile.\n(3) The Government or any person aggrieved by an order of acquittal passed by the Juvenile court\nmay, within thirty days, prefer an appeal against such order in accordance with the provisions of section\n417 of the Code."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Removal of disqualification attached with conviction.⸻Subject to provisions of the",
      "content": "constitution, a juvenile offender convicted under the provisions of this Act shall not suffer a\ndisqualification, if any, attaching to a conviction of an offence under such law."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Establishment and certification of observation homes and Juvenile Rehabilitation",
      "content": "Centres. (1) The 1[Interior Division in consultation with the Division concerned] may establish and\nmaintain observation home and Juvenile Rehabilitation Centres for the reception of juveniles, including\nseparate centres for female juveniles:\n(2) The 1[Interior Division] may certify an observation home or a Juvenile Rehabilitation centre\nmanaged or controlled by a non-governmental organization for reception of juveniles.\n(3) The 1[Interior Division] may certify an already established association or society in any local\narea for social reintegration or rehabilitation of a juvenile offender who is released on parole or discharged\nfrom a Juvenile Rehabilitation Centre and may regulate activities and functions of such released or\ndischarged juvenile offender in the prescribed manner."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Power of the 1[Interior Division] to withdraw certificate.⸻The 1[Interior Division], if",
      "content": "dissatisfied with the condition, management or superintendence of a certified observation home or a\nJuvenile Rehabilitation centre, may at any time withdraw the certificate issued under section 20 in\nprescribed manner."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Inspection of observation homes and Juvenile Rehabilitation Centres.⸻In order to report",
      "content": "to the Juvenile court or Juvenile Justice committee on measures being taken for social reintegration, health,\neducation or other conditions of the inmates a medical officer’ a member of the Committee, with prior\napproval of head of the Committee or an officer authorized by the 1[Division concerned or relevant\ndepartment of provincial Governments], may inspect an observation home or a Juvenile Rehabilitation\nCentre.\n1\nSubs. by Act No. III of 2022, ss. 6-8."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Act to override other laws.⸻The provisions of this Act shall have overriding effect",
      "content": "notwithstanding anything contained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Power to make rules.⸻The Government may, by notification in the official Gazette, make",
      "content": "rules for carrying out the purposes of this Act."
    }
  ],
  "definitions": [
    {
      "term": "best interest of the child",
      "definition": "the basis for any decision taken regarding the child to ensure fulfillment of his basic rights and needs, identity, social well-being, physical, emotional and psychological development;",
      "source_provision": "sec2"
    },
    {
      "term": "child",
      "definition": "for the purposes of this Act a person who has not attained the age of eighteen years;",
      "source_provision": "sec2"
    },
    {
      "term": "Code",
      "definition": "the Code of Criminal procedure, 1898 (Act V of 1898);",
      "source_provision": "sec2"
    },
    {
      "term": "diversion",
      "definition": "an alternative process of determining the responsibility and treatment of a juvenile on the basis of his social, cultural, economic, psychological and educational background without resorting to formal judicial proceedings;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government or the Provincial Government, as the case may be;",
      "source_provision": "sec2"
    },
    {
      "term": "heinous offence",
      "definition": "an offence which is serious, gruesome, brutal, sensational in character or shocking to public morality and which is punishable under the Pakistan Penal Code, 1860 (Act XIV of 1860) or any other law for the time being in force with death or imprisonment for life or imprisonment for more than seven years with or without fine;",
      "source_provision": "sec2"
    },
    {
      "term": "Juvenile Court",
      "definition": "a court established under section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "Juvenile Justice Committee",
      "definition": "a committee established under section 10;",
      "source_provision": "sec2"
    },
    {
      "term": "Juvenile Rehabilitation Centre",
      "definition": "a place where a juvenile may be kept and given education, vocational or technical training for his mental, moral and psychological development and includes certified institutions, juvenile training institutions, borstal institutions, vocational centres, darul-amaan and women crises centres established by the Government or by voluntary organizational certified by the Government;",
      "source_provision": "sec2"
    },
    {
      "term": "Juvenile offender",
      "definition": "a child who is alleged to have committed or who has been found to have committed an offence;",
      "source_provision": "sec2"
    },
    {
      "term": "major offence",
      "definition": "an offence for which punishment under the Pakistan Penal Code, 1860 (Act XIV of 1860) or any other law for the time being in force is more than three years and up to seven years imprisonment with or without fine;",
      "source_provision": "sec2"
    },
    {
      "term": "medical officer",
      "definition": "a medical officer notified as such by the 1[Division concerned or relevant department of provincial Governments];",
      "source_provision": "sec2"
    },
    {
      "term": "minor offence",
      "definition": "an offence for which maximum punishment under the Pakistan Penal Code, 1860 (XLV of 1860)or any other law for the time being in force is imprisonment up to three years with or without fine;",
      "source_provision": "sec2"
    },
    {
      "term": "observation home",
      "definition": "a place where a juvenile is kept temporarily after being apprehended by police as well as after obtaining remand from Juvenile Court or otherwise for conducting inquiry or investigation for the purposes of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "probation officer",
      "definition": "a person appointed under the Probation of Offenders Ordinance, 1960 (XLV of 1960);and",
      "source_provision": "sec2"
    },
    {
      "term": "suitable person",
      "definition": "any person, trust, association or society duly recognized by law whose object is welfare and protection of children. Explanation⸻person in this clause means the guardian of a juvenile or any other person appointed by a Juvenile Court for the purposes of this Act. 1 Subs. by Act No. III of 2022, s. 2.",
      "source_provision": "sec2"
    }
  ]
}
