{
  "id": "pk-kalam-bibi-international-women-institute-bannu-act-2023",
  "type": "statute",
  "title": "Kalam Bibi International Women Institute Bannu Act, 2023",
  "title_en": "Kalam Bibi International Women Institute Bannu Act, 2023",
  "short_name": "KBIWI",
  "status": "in_force",
  "issued_date": "2023-06-07",
  "in_force_date": "2023-06-07",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pmag%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Kalam Bibi International Women Institute Bannu Act, 2023 (XXVII of 2023) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, application and commencement",
      "content": "(1) This Act shall be called as the Kalam\nBibi International Women Institute Bannu Act, 2023.\n(2)    It shall extend to the whole of Pakistan.\n(3)    It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(i)      “Academic Council” means the Academic Council of the Institute;\n(ii)     “affiliated college” means an educational institution affiliated to the Institute\nbut not maintained or administered by it;\n(iii)    “Authority” means any of the Authorities of the Institute specified in section 20;\n(iv)     “Chairman” means the Chairman or the head of an academic department and\nincludes Principal of a constituent college or Director of an institute;\n(v)      “Chairperson” means Chairperson of the Senate;\n(vi)     “Chancellor” means the Chancellor of the Institute;\n(vii)    “Commission” means the Higher Education Commission set up under the\nHigher Education Commission Ordinance, 2002 (LIII of2002);\n(viii)   “Controller of Examinations” means the Controller of Examinations of the\nInstitute;\n(ix)    “constituent institution” means a constituent institution, college, or school of\nthe Institute by whatever name call for but established, maintained, and\nadministered by the Institute;\n(x)     “Dean” means the head of any Faculty, or the Head of any academic body\ngranted the status of a Faculty under this Act or by the Statutes or Regulations;\n(xi)    “department” means a teaching department maintained and administered or\nrecognized by the Institute in the prescribed manner;\n(xii)   “Director” means the head of a constituent college or unit;\n(xiii) “Faculty” means an administrative and academic unit of the Institute consisting\nof one or more departments, as may be prescribed;\n(xiv)   “Government” means the Federal Government;\n(xv)    “Institute” means the Kalam Bibi International Women Institute Bannu;\n(xvi)   “Institute teacher” means a whole-time teacher appointed and paid by the\nInstitute, or recognized by the Institute as such;\n(xvii) “prescribed” means prescribed by Statutes, Regulations or Rules made under\nthis Act;\n(xviii) “Pro-Chancellor” means Pro-Chancellor of the Institute;\n(xix)   “registered Graduate” means a graduate of the Institute whose name stands\nentered in the registered maintained for this purpose;\n(xx)    “Registrar” means the Registrar of the Institute;\n(xxi) “Representation Committees”             means   the   Representation   Committees\nconstituted under section 28;\n(xxii) “Review Panel” means the Review Panel set up by the Chancellor in accordance\nwith the provisions of section IO;\n(xxiii) “Search Committee” means the Search Committee set up by the Senate under\nsection 13;\n(xxiv) “Secretariat” means Secretariat headed by the Vice-Chancellor of the Institute\nas administrative conglomeration comprising Registrar, Controller of\nExaminations, Treasurer and Deans to assist the Vice-Chancellor;\n(xxv) “Senate” means the Senate of the Institute;\n(xxvi) “Statutes” “Regulations” and “Rules” means respectively the Statutes, the\nRegulations and the Rules made under this Act and for the time being in force;\n(xxvii) “Syndicate” means the Syndicate of the Institute;\n(xxviii) “teachers” include Professors, Associate Professors, Assistant Professors and\nLecturers engaged whole-time by the Institute and such other persons as may\nbe declared by Regulations to be teachers;\n(xxix) “Treasurer” means the Treasurer of the Institute; and\n(xxx) “Vice-Chancellor” means the Vice-Chancellor of the Institute specified in\nsection 12."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Incorporation",
      "content": "(l) As soon as may be after coming into force of this Act, the Women\nCampus of the University of Bannu shall, by notification in the official Gazette, be reconstituted\nas the Kalam Bibi International Women Institute Bannu in accordance with the provisions of this\nAct.\n(2) The Institute shall be a body corporate by the name of the Kalam Bibi International Women\nInstitute Bannu and shall have a perpetual succession and a common seal and may, by the said name,\nsue and be sued.\n(3) The Institute shall be competent to acquire and hold property, both movable and immovable,\nand to lease, sell or otherwise transfer any movable and immovable property which may have\nbecome vested in or been acquired by it. It shall also be competent to receive grants.\n(4) Notwithstanding anything contained in any other law for the time being in force, the\nInstitute shall have academic, financial and administrative autonomy, including the power to employ\nofficers, teachers and other employees on such terms and conditions as may be prescribed, subject to\nparticular and without prejudice to the authority granted to the Commission by the law, the\nGovernment or an authority or auditor appointed by the Government shall have no power to question\nthe policy underlying the allocation of resources approved by the Senate in the annual budget of the\ninstitute.\n(5) The Institute shall be liable to provide facilities to the representatives of the Commission,\nor such similar relevant organizations for visitation to enable them to verify that the Institute is\nmaintaining appropriate academic standards."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. The Institute shall consist of",
      "content": "(a)     the Chancellor, Pro-Chancellor, members of the Senate and the Vice-\nChancellor;\n(b)     the members of the Authorities of the Institute established under section 20;\n(c)     all Institute teachers and persons recognized as students of the institute\nin accordance with terms prescribed from time to time; and\n(d)      all other full-time employees of the Institute."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Powers and purposes of the Institute",
      "content": "The Institute shall have the following powers and\npurposes, namely:—\n(i)      to provide for instructions in such branches of learning as it may deem fit and\nto make provisions for teaching, training, research and development of\ntechnologies and for the advancement and dissemination of knowledge in\nsuch other fields or branches of study as the Senate may determine;\n(ii)     to prescribe courses of studies to be conducted by it and the constituent\ncolleges;\n(iii)    to hold examinations and to award and confer degrees, diplomas, certificates\nand other academic distinctions to and on persons, who have been admitted to\nand have passed its examinations under prescribed conditions;\n(iv)     to prescribe the terms and conditions of employment of the officers,\nteachers and other employees of the Institute and to lay· down terms and\nconditions that may be different from those applicable to Government\nservants in general;\n(v)      to engage, where necessary, persons on contract of specified duration and to\nspecify the terms of each engagement;\n(vi)     to confer honorary degrees or other distinctions on approved persons in the\nprescribed manner;\n(vii)    to provide for such instruction for persons not being students of the Institute as\nit may prescribe and to grant certificates and diplomas to such persons;\n(viii)   to institute programs for the exchange of students and teachers between the\ncolleges and other universities, educational institutions and research\norganizations, inside as well as outside Pakistan;\n(ix)     to provide career counseling and job search services to students and alumni;\n(x)      to maintain linkages with alumni;\n(xi)     to develop and implement fund-raising plans;\n(xii)    to provide and support the academic development of the faculty;\n(xiii) to confer degrees on persons who have carried on independent research\nunder prescribed condition\n(xiv)    to accept the examinations passed and the period of study spent by students of\nthe institute at other universities and places of learning equivalent to such\nexaminations and periods of study in the Institute, as it may prescribe and\nto withdraw such acceptance;\n(xv)    to co-operate with other universities, public authorities or private organizations,\ninside as well as outside Pakistan, in such manner and for such purposes as it\nmay prescribe;\n(xvi)   to institute professorships, associate professorships, assistant professorships and\nlectureships and any other posts and to appoint persons thereto;\n(xvii) to create posts for research, teaching, extension, administration and other related\npurposes and to appoint persons thereto;\n(xviii) to affiliate and disaffiliate educational institutions under prescribed conditions;\n(xix)   to inspect colleges and other educational institutions affiliated or seeking\naffiliation with it;\n(xx)    to recognize selected members of the teaching staff of affiliated colleges or\neducational institutions admitted to the privileges of the Institute or such other\npersons as it may deem fit, as Institute teachers;\n(xxi)   to institute and award financial assistance to students in need, fellowships,\nscholarships, bursaries, medals and prizes under prescribed conditions;\ndepartments, schools, constituent colleges, faculties, institutes, museums and\nother centers of learning for the development of teaching and research and to\nmake such arrangements for their maintenance, management and administration\nas it may prescribe in different parts of the country;\n(xxiii) to provide for the residence of the students of the Institute and the constituent\ncolleges, to institute and maintain halls of residence and to approve or license\nhostels and lodging;\n(xxiv) to maintain order, discipline and security on the campuses of the Institute and\nthe constituent colleges;\n(xxv) to promote the extra-curricular and recreational activities of such students and\nto make arrangements for promoting their health and general welfare;\n(xxvi) to demand and receive such fees and other charges as it may determine;\n(xxvii) to make provision for research, advisory or consultancy services and with these\nobjects to enter into arrangements with other institutions, public or private\nbodies and commercial and industrial enterprises under prescribed conditions;\n(xxviii) to enter into, carry out, vary or cancel contracts;\n(xxix) to receive and manage property transferred and grants, contributions made\nto the Institute and to invest any fund representing such property, grants,\nbequests, trusts, gifts, donations, endowments or contributions in such manner\nas it may deem fit;\n(xxx) to provide for the printing and publication of research and other works;\n(xxxi) to make Rules, Regulations and Statutes for the Institute;\n(xxxii) to do all such other acts and things, whether incidental to the powers aforesaid\nor not, as may be requisite or expedient to further the objectives of the Institute\nas a place of education, learning and research."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. The principle seat of the Institute shall be at Bannu, Khyber Pakhtunkhwa and it may set up",
      "content": "any number of campuses, colleges and institutes at other places in Pakistan and abroad with prior\napproval of the Chancellor and Commission after completion of ten years of establishment of the\nInstitute."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Institute open to all classes, creeds, etc",
      "content": "(1) The Institute shall be open to all persons of\nfemale gender of whatever religion, race, caste, class, creed, colour or domicile who qualify for\nadmission to the courses of study offered by the Institute based on the criteria and policy determined\nby the Senate and no such person shall be denied the privileges of the Institute on the ground only of\nreligion, race, caste, class, colour or domicile.\n(2) An increase in any fee or charge that is in excess of ten per cent per annum on an annualized\nbasis from the last such increase may not be made except in special circumstances and only with\napproval of the Chancellor.\n(3) The Institute shall initiate financial aid programs for students in need, to the extent\nconsidered feasible by the Senate given the resources available, so as to enable admission and\naccess to the Institute and the various opportunities provided by it to be based on merit rather than\nability to pay\nProvided that the Institute may initiate self-finance schemes covering not more than ten percent\nof the total number of candidates in any on campus taught course or research-based program of study."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Teaching and examination at the Institute",
      "content": "(1) All academic programs of the Institute\nshall be conducted in the prescribed manner and the Senate shall ensure that the courses of study, the\ncurriculum and the practical work at the Institute are comparable in standard with other similar\ninstitutions.\n(2) All recognized teaching in various courses shall be conducted by the Institute in the\nprescribed manner and may include lectures, tutorials, discussions, seminars, demonstrations, distance\nlearning and other methods of instruction as well as practical work in the laboratories, hospitals,\nworkshops and other governmental or private organizations.\n(3) The authority responsible for organizing recognized academic programs shall be such as\nmay be prescribed.\n(4) The Institute shall associate internal and external examiners in the conduct of examinations."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Principal officers",
      "content": "The following shall be the principal officers of the Institute, namely:\n(a)     the Chancellor;\n(b)    the Pro-Chancellor;\n(c)    the Vice-Chancellor;\n(d)    the Deans;\n(e)    the Chairmen of the teaching departments:\n(e)    the Directors of the constituent colleges;\n(f)    the Registrar;\n(g)    the Treasurer;\n(h)    the Controller of Examinations; and\n(i)    such other persons, as may be prescribed by the Statutes or Regulations,\nto be the officers of the Institute."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Chancellor",
      "content": "(1) The President of the Islamic Republic of Pakistan shall be the Chancellor\nof the Institute.\n(2) The Chancellor shall, when present, preside over the meetings of the Senate and the\nconvocation of the Institute. In the absence of the Chancellor, the Pro-Chancellor shall preside over\nthe convocation of the Institute.\n(3) The members of the Senate as well as Vice-Chancellor shall be appointed by the Chancellor\nfrom amongst the persons recommended by the Representation Committee set up for this purpose\nunder sub-section (1) of section 28 along with those elected.\n(4) Every proposal to confer an honorary degree shall be subject to confirmation by the\nChancellor.\n(5) If the Chancellor is satisfied that a serious irregularity or mismanagement with respect to\nthe affairs of the Institute has occurred, he may,\n(a)    as regards proceedings of the Senate, direct that specified proceedings\nbe reconsidered and appropriate action taken within one month of the direction\nhaving been issued:\nProvided that if the Chancellor is satisfied that either no reconsideration has been carried\nout or that the reconsideration has failed to address the concern expressed, he may after calling upon\nthe Senate to show cause in writing, appoint a five-member review panel to examine and report to the\nChancellor on the functioning of the Senate. The report of the review panel shall be submitted\nwithin such time as may be prescribed by the Chancellor. The review panel shall be drawn from\npersons of eminence in academics in the fields of law, accountancy and administration or as deem fit\nby the Chancellor; and\n(b)     as regards proceedings of any Authority or with respect to matters within the\ncompetence of any Authority other than the Senate, direct the Senate to\nexercise powers under section 18."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Pro",
      "content": "Chancellor.— The Provincial minister-in-charge of the concerned department dealing\nwith the subject of higher education shall be the Pro-Chancellor of the Institute and shall in absence\nof the chancellor preside over the convocation of the Institute."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Vice",
      "content": "Chancellor .— (l) There shall be a Vice-Chancellor of the Institute who shall be a\nperson of national eminence and proven ability with significant contribution to higher education as an\nacademician, researcher or administrator and shall be appointed on such terms and conditions as may\nbe prescribed.\n(2) The Vice-Chancellor shall be the chief executive officer and principal accounting\nofficer of the Institute responsible for all administrative and academic functions of the Institute and for\nensuring that the provisions of this Act, Statutes, Regulations and Rules are faithfully observed to\npromote the general efficiency and good order of the Institute. The Vice-Chancellor shall have all\npowers prescribed for this purpose, including administrative control over the officers, teachers and\nother employees of the Institute.\n(3) The Vice-Chancellor shall, if present, be entitled to attend any meeting of any Authority or\nbody of the Institute.\n(4) The Vice-Chancellor may, in an emergency that in his opinion requires immediate\naction ordinarily not in the competence of the Vice-Chancellor, take such action and\nforward, within seventy-two hours, a report of the action taken to the members of the Emergency\nCommittee of the Senate, to be set up by Statute and the Emergency Committee may direct such further\naction as is considered appropriate.\n(5) The Vice-Chancellor shall also have the following powers, namely:—\n(a)    to direct teachers, officers and other employees and the Secretariat to take up\nsuch assignments in connection with examination, administration, and such\nother activities in the Institute as he may consider necessary for the purposes of\nthe Institute;\n(b)     to sanction by re-appropriation an amount not exceeding an amount\nprescribed by the Institute for an unforeseen item not provided for in the budget\nand report it to the Senate at the next meeting;\n(c)     to make appointments of such categories of employees of the Institute and in\nsuch manner as may be prescribed by the Statutes;\n(d)     to suspend, punish and remove, in accordance with the prescribed procedure,\nfrom service officers, teachers and other employees of the Institute;\n(e)     to delegate, subject to such conditions as may be prescribed, any of his powers\nunder this Act to an officer or officers of the Institute; and\n(f)     to exercise and perform such other powers and functions as may be prescribed.\n(6) The Vice-Chancellor shall present an annual report before the Senate within three months\nof the close of the academic year. The annual report shall present such information as regards the\nacademic year under review as may be prescribed, including disclosure of all relevant facts pertaining\nto—\n(a)     academics;\n(b)     research;\n(c)     administration; and\n(d)     finances.\n(7) The Vice-Chancellor shall make available an annual report, prior to its presentation before\nthe Senate, to all officers and Institute teachers and it shall be published in such numbers, and uploaded\non the Institute website, as required to ensure its wide circulation."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Appointment and removal of the Vice",
      "content": "Chancellor.—(1) The Vice-Chancellor shall be\nappointed by the Chancellor on the basis of recommendations made by the Senate as provided herein\nbelow.\n(2) A Search Committee for the recommendation of persons suitable for appointment as Vice-\nChancellor shall be constituted by the Senate on the date and in the manner prescribed by Statutes and\nshall consist of two eminent members of society nominated by the Chancellor of whom one shall\nbe appointed as convener, two members of the Senate, two distinguished Institute teachers who are\nnot members of the Senate and one academician of eminence not employed by the Institute. The two\ndistinguished Institute teachers shall be selected by the Senate through a process prescribed by Senate,\nwhich provides for the recommendation of suitable names by the Institute teachers in general. The\nsearch Committee shall remain in existence till such time that the appointment of the next Vice-\nChancellor has been made by the Chancellor.\n(3) The persons proposed by the Search Committee for appointment as Vice-Chancellor will\nbe considered by the Institute and of these a panel of three in order of priority shall be recommended\nby the Senate to the Chancellor:\nProvided that the Chancellor may decline to appoint any of the three persons recommended\nand seek recommendation of a fresh panel. In the event of a fresh recommendation being sought by\nthe Chancellor the Search Committee shall make a proposal to the Senate in the same manner as\nprovided for in sub-section (2).\n(4) The Vice-Chancellor shall be appointed for a renewable tenure of four years on the terms\nand conditions prescribed by the Statute. The tenure of an incumbent Vice-Chancellor of the Institute\nshall be renewed once by the Chancellor on receipt of a resolution of the Senate in support of such\nrenewal:\nProvided that the Chancellor may call upon the Senate to reconsider such resolution once:\nProvided further that present incumbent Vice-Chancellor shall not be allowed any extension\nin his tenure but subject to eligibility he may again compete for the post of the Vice-Chancellor in\naccordance with the procedure prescribed under this Act.\n(5) The Senate may, pursuant to a resolution in this behalf passed by three fourths of its\nmembership, recommend to the Chancellor the removal of the Vice-Chancellor on the grounds of\ninefficiency, moral turpitude or physical or mental incapacity or gross misconduct, including misuse\nof position for personal advantages of any kind:\nProvided that the Chancellor may make a reference to the Senate stating the instances of\ninefficiency, moral turpitude or physical or mental incapacity or gross misconduct on the part of the\nVice-Chancellor that has come to his notice. After consideration of the reference, the Senate may,\npursuant to a resolution in this behalf passed by two-third of its membership, recommend to the\nChancellor removal of the Vice-Chancellor:\nProvided further that prior to a resolution for the removal of the Vice-Chancellor being voted\nupon, the Vice-Chancellor shall be given an opportunity of being heard.\n(6) A resolution recommending the removal of the Vice-Chancellor shall be submitted to the\nChancellor forthwith. The Chancellor may accept the recommendation and order the removal of the\nVice-Chancellor or return the recommendation to the Senate.\n(7) At any time when the office of the Vice-Chancellor is vacant, or the Vice-Chancellor is\nabsent or is unable to perform the functions of his office due to illness or some other cause, the\nSenate shall make arrangements in accordance with the Statutes for the performance of the\nduties of the Vice-Chancellor."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Registrar",
      "content": "(1) There shall be a Registrar of the Institute having prescribed experience\nand qualifications, to be appointed by the Senate on the recommendation of the Selection Board, on\nsuch terms and conditions as may be prescribed.\n(2) The Registrar shall be a full-time officer of the Institute and shall\n(a)    be the custodian of the common seal and the academic records of the Institute;\n(b)    maintain a register of registered graduates in the prescribed manner;\n(c)    supervise the process of election, appointment, or nomination of members to\nthe various Authorities and other bodies in the prescribed manner; and\n(d)    perform such other duties as may be prescribed\n(3) The term of office of the Registrar shall be a renewable period of three years:\nProvided that the Senate may, on the advice of the Vice-Chancellor, terminate the appointment\nof the Registrar on grounds of inefficiency or misconduct in accordance with the prescribed procedure.\n(4) When the office of the Registrar is vacant or the Registrar is absent or unable to perform\nhis functions owing to any cause, the Senate shall make temporary arrangements for the performance\nof duties of the Registrar, but the period of such temporary arrangements shall not exceed six months,\nand the Registrar shall be appointed during that period."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Treasurer",
      "content": "(1) There shall be a Treasurer of the Institute, having prescribed experience\nand qualifications to be appointed by the Senate on the recommendation of the Selection Board, on\nsuch terms and conditions as may be prescribed.\n(2) The Treasurer shall be the chief financial officer of the Institute and shall-\n(a)    manage the assets, liabilities, receipts, expenditures, funds, and investments of\nthe Institute;\n(b)    prepare the annual and revised budget estimates of the Institute and present them\nto the Syndicate or a committee thereof for approval and incorporation in the\nbudget to be presented to the Senate;\n(c)    ensure that the funds of the Institute are expended on the purposes for which\nthey are provided;\n(d)    have the accounts of the Institute prepared and audited annually to be available\nfor submission to the Senate within six months of the close of the financial year;\nand\n(e)    perform such other duties as may be prescribed.\n(3) The term of office of the Treasurer shall be for a renewable period of three years:\nProvided that the Senate may, on the advice of the Vice-Chancellor, terminate the\nappointment of the Treasurer on grounds of inefficiency or misconduct in accordance with the\nprescribed procedure.\n(4) When the office of the Treasurer is vacant or the Treasurer is absent or unable to perform\nhis functions owing to any cause, the Senate shall make temporary arrangements for the performance\nof duties of the Treasurer, but the period of such temporary arrangements shall not exceed six months,\nand the Treasurer shall be appointed during that period."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Controller of Examinations",
      "content": "(l) There shall be a Controller of Examinations of the\nInstitute having the prescribed experience and qualifications, to be appointed by the Senate on\nthe recommendation of the Selection Board, on such terms and conditions as may be prescribed.\n(2) The Controller of Examinations shall be a full-time officer of the Institute and shall be—\n(a)    responsible for all matters connected with the conduct of examinations and to\nperform such other duties as may be prescribed;\n(b)    responsible for secrecy and confidentiality of examinations and results and to\nperform such other duties as may be prescribed; and\n(c)    perform such prescribed duties in the Secretariat.\n(3) The Controller of Examinations shall be appointed for a renewable term of three years:\nProvided that the Senate may, on the advice of the Vice-Chancellor, terminate the appointment\nof the Controller of Examinations on grounds of inefficiency or misconduct in accordance with the\nprescribed procedure.\n(4) When the office of the Controller of Examinations is vacant or the Controller of\nExaminations is absent or unable to perform his functions owing to any cause, the Senate shall make\ntemporary arrangements for the performance of duties of the Controller of Examinations, but the period\nof such temporary arrangements shall not exceed six months, and the Controller of Examination shall\nbe appointed during that period."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Director Planning and Development",
      "content": "(1) There shall be a Director Planning and\nDevelopment of the Institute to be appointed by the Senate on the recommendations of the Syndicate\nfor a period of three years once renewable on such terms and conditions as may be prescribed.\n(2) The minimum experience as well as the professional and academic qualifications necessary\nfor the appointment to the post of Director Planning and Development shall be prescribed.\n(3) The Director Planning and Development shall be responsible for all matters connected with\nplanning and development and perform such other duties as may be prescribed.\n(4) The Director Planning and Development shall\n(a)    prepare short and long-term plans and development programs to meet vision,\ngoals and priorities set by the Institute management or Senate\n(b)    conduct comprehensive review, assessment, and analysis of development\nplanning process (project identification, appraisal, selection, implementation\nand monitoring) and mechanism;\n(c)    develop a strategy for improving development of planning processes\nand mechanisms based on findings of the situation analysis;\n(d)    provide technical support in developing project proposals and PCs-I for the\nInstitute;\n(e)    be responsible for preparation of the PC-I, PC-II, PC-III, PC-IV and PC-V;\n(f)    be responsible for preparation of cash work and activity plan;\n(g)    be responsible for preparation of quarterly expenditure statements;\n(h)    be responsible for preparation of monthly and quarterly progress reports;\n(i)    coordinate with works, purchases, store units and accounts; and\n(j)    communicate or submit reports, plans and projects to different donors.\n(5) The Senate may on the recommendations or advice of Syndicate, terminate the services of\nDirector Planning and Development on grounds of inefficiency or misconduct in accordance with the\nprescribed procedure."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Director Quality Enhancement Cell (QEC)",
      "content": "(1) There shall be a Director Quality\nEnhancement Cell (QEC) of the Institute to be appointed by the Senate on the recommendations of the\nSyndicate for a renewable period of three years on such terms and conditions as may be prescribed.\n(2) The minimum experience as well as the professional and academic qualifications necessary\nfor the appointment to the post of Director Quality Enhancement Cell (QEC) shall be as may be\nprescribed.\n(3) The Director Quality Enhancement Cell (QEC) shall be responsible to—\n(a)     review the quality standards and the quality of teaching and learning in\neach subject area;\n(b)     review the academic association with other institutions in terms of effective\nmanagement of standards and quality of programs;\n(c)     define clear and explicit standards as points of reference for the review to be\ncarried out. It should also help the employees to know as to what they could\nexpect from candidates;\n(d)     develop qualifications framework by setting out the attributes and abilities that\ncan be expected from the holder of a qualification, i.e. undergraduate and\ngraduate programs;\n(e)     develop program specifications. These are standards set of information\nclarifying what knowledge, understanding, skills and other attributes a student\nwill have developed on completing a specific program;\n(f)     develop quality assurance processes and methods of evaluation to affirm that\nthe quality of provision and the standard of awards are being maintained and to\nfoster curriculum, subject and staff development together with research and\nother scholarly activities;\n(g)     ensure that the Institute's quality assurance procedures are designed to fit in\nwith the arrangements in place nationally and internationally for maintaining\nand improving the quality of higher education; and\n(h)     develop procedures and processes, monitoring and evaluation systems and\nstandards for the following:—\n(i)     approval of new program;\n(ii)    annual monitoring and evaluation including program monitoring,\nfaculty monitoring and student perceptions;\n(iii)   departmental review;\n(iv)    student feedback;\n(v)     employer feedback;\n(vi)    quality assurance of undergraduate, graduate and doctoral programs,\n(vii)   institutional assessment and performance evaluation;\n(viii) program specifications; and\n(ix)    qualification framework.\n(4) Director, Quality Enhancement Cell (QEC) shall be a member of all statutory bodies and\ncommittees of the Institute.\n(5) The Senate may on the recommendations or advice of the Syndicate, terminate the services\nof the Director Quality Enhancement Cell (QEC) on grounds of inefficiency or misconduct in\naccordance with the prescribed procedure."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Director of Office of Research, Innovation and Commercialization (ORIC)",
      "content": "(1)\nThere shall be a Director, ORIC of the Institute to be appointed by the Senate on the recommendations\nof the Syndicate for a renewable period of three years on such terms and conditions as may be\nprescribed.\n(2) The minimum experience as well as the professional and academic qualifications necessary\nfor the appointment to the post of Director, ORIC shall be such as may be prescribed.\n(3) The Director, ORIC shall—\n(a)     manage and enhance the research activities of the Institute, develop research\npolicies and priorities, work for fund-raising for research, mobilize faculty,\nbusiness community and industry for research commercialization and serve\nas an effective advocate for research with the Institute and to its broader\ncommunity of stakeholders and supporters;\n(b)     to supervise all aspects of the operation of the Office for Research including\nresearch administration (budgeting, auditing, accounting, human resources,\nmanagement and maintenance of facilities and equipment, implementation of\nresearch contracts and human resources);\n(c)     to develop programs and activities that will increase funding for research from\nall public and private sources, establish and maintain excellent relationships\nwith donors and private sources and oversee proposals development and\nsubmission;\n(d)     to promote the development of public-private partnerships in support of\nInstitute research, link the Institute's research community with the needs\nand priorities of the corporate sector, develop opportunities for applied\nresearch     and     explore opportunities for technology transfer and\ncommercialization of Institute research (including incubators and research\nparks);\n(e)     be responsible for monetizing royalty streams from licences; and\n(f)     collaborate with the principal liaison for technical marking and licensing on the\ncommercialization of the Institute's intellectual property in coordination with\nother relevant departments and offices\n(4) Director (ORIC) shall work in close liaison with the Office of Research and Development,\nPlanning and Development and Institute's technology park.\n(5) The Senate may on the recommendations or advice of Syndicate terminate the services of\nDirector (ORIC) on grounds of inefficiency· or misconduct in accordance with the prescribed\nprocedure."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Authorities",
      "content": "(1) The following shall be the Authorities of the Institute, namely:—\n(a)     Authorities established by this Act shall be—\n(i)      the Senate;\n(ii)     the Syndicate; and\n(iii)    the Academic Council; and\n(b) Authorities to be established by the Statutes shall be—\n(i)      Graduate and Research Management Council;\n(ii)     Recruitment, Development, Evaluation and Promotion Committees for\nteachers and other staff whether at the level of the department, the\nFaculty or the Institute;\n(iii)    Career Placement and internship Committee of each Faculty;\n(iv)     Search Committee for the appointment of the Vice-Chancellor;\n(v)      the Representation Committees for appointment to the Senate, Syndicate\nand the Academic Council;\n(vi)     Affiliation Committee;\n(vii)    Faculty Council; and\n(viii) Departmental Council.\n(2) The Senate, the Syndicate and the Academic Council may set up such other committees or\nsub-committees, by whatever name described, as are considered desirable through Statutes or\nRegulations as appropriate. Such committees or sub-committees shall be Authorities of the institute\nfor the purposes of this Act."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Senate",
      "content": "(1) The body responsible for the governance of the Institute shall be the Senate,\nand shall consist of the following, namely:—\n(a)     the Chancellor who shall be the Chairperson of the Senate;\n(b)     the Pro-Chancellor;\n(c)     the Vice-Chancellor;\n(d)     one Dean to be nominated by the Chancellor;\n(e)     one female member of the National Assembly of Pakistan to be nominated\nby the Speaker National Assembly;\n(f)     Secretary to the Government of Pakistan, dealing with the subject of education\nor his nominee not below the rank of an Additional Secretary;\n(g)     four persons from society at large being persons of distinction in the fields\nof administration, management, education, academics, law, accountancy,\nmedicine, fine arts, architecture, industry, agriculture, science, technology and\nengineering with a view to create diversity and balance across the various\nfields, to be nominated by the Chancellor:\nProvided that the special focus or affiliation of the Institute may be reflected in the number of\npersons of distinction in an area of expertise relevant to the Institute who are appointed to the Senate;\n(h)     one person from amongst the alumni of the Institute;\n(i)     two persons from the academic community of the country, other than an\nemployee of the Institute at the level of Professor or Principal of the College;\n(j)     four Institute teachers, including one Professor, one Associate Professor, one\nAssistant Professor and one Lecturer to be elected by teachers of their\nrespective cadres from amongst themselves;\n(k)     nominee of the Higher Education Commission, not below the rank of BPS-19;\n(I)     Vice-Chancellor of the public sector university to be nominated by the\nChancellor; and\n(m)     one industrialist to be nominated by the Government.\n(2) The number of the members of the Senate described against clauses (h) to (k) of sub-section\n(1) may be increased by the Senate through Statutes subject to the condition that the total membership\nof the Senate does not exceed twenty-one with a maximum of five Institute teachers and ten from\nsociety at large, and the increase is balanced, to the extent possible, across, the different categories\nspecified in sub-section (1).\n(3) All appointments to the Senate shall be made by the Chancellor. Appointments of persons\ndescribed in clauses (h) to (i) of sub-section (1) shall be made from amongst a panel of three names\nfor each vacancy recommended by the Representation Committee set up in terms of section 28 and in\naccordance with procedure as may be prescribed:\nProvided that effort shall be made, without compromising on quality or qualifications, to give\nfair representation to women on the Senate:\nProvided further that as regards the Institute teachers as described in clause (i) of sub-section\n(1), the Senate shall prescribe a procedure for appointment on the basis of election that provide for\nvoting by various categories of the Institute teachers:\nProvided also that the Senate may alternatively prescribe that appointment of Institute teachers\nto the Senate shall also be in the manner provided by this sub-section for the persons described in\nclauses (e) and (f) of sub-section (1).\n(4) Members of the Senate, other than ex-officio members, shall hold office for three years.\nOne third of the members, other than ex-officio members, of the first restructured Senate, to be\ndetermined by lot, shall retire from office on the expiration of one year from the date of appointment\nby the Chancellor. One half of the remaining members, other than ex-officio members, of the first\nrestructured Senate, to be determined by lot, shall retire from the office on the expiration of two years\nfrom the date of appointment and the remaining one half, other than ex-officio members, shall retire\nfrom office on expiration of the third year:\nProvided that no person, other than an ex-officio member, may serve on the Senate for more\nthan two consecutive terms:\nProvided further that the Institute teachers appointed to the Senate may not serve for two\nconsecutive terms.\n(5) The Senate shall meet at least twice in a calendar year.\n(6) Service in the Senate shall be on honorary basis:\nProvided that actual expenses may be reimbursed as prescribed.\n(7) The Registrar shall be secretary of the Senate.\n(8) All decisions of the Senate shall be taken on the basis of opinion of majority of the members\npresent. In the event of the members being evenly divided on any matter the person presiding over the\nmeeting shall have a casting vote.\n(9) The quorum for a meeting of the Senate shall be two-third of its membership, a fraction\nbeing counted as one."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Powers and functions of the Senate",
      "content": "(1) The Senate shall have the powers of general\nsupervision over the Institute and shall hold the Vice Chancellor and the Authorities accountable for\nall the functions of the Institute. The Senate shall also have all powers of the Institute not expressly\nvested in an Authority or officer by this Act and all other powers not expressly mentioned by this Act\nthat are necessary for the performance of its functions.\n(2) Without prejudice to the generality of the foregoing powers, the Senate shall have the\nfollowing powers, namely:—\n(a)     to approve the proposed annual plan of work, the annual and revised budgets,\nthe annual report and the annual statement of accounts;\n(b)     to hold, control and lay down policy for the administration of the property, funds\nand investments of the Institute, including the approval of the sale and\npurchase or acquisition of immovable property;\n(c)     to institute the degrees to be awarded by the Institute and to oversee the quality\nand relevance of the Institute's academic programs and to review the academic\naffairs of the Institute in general;\n(d)     to approve the appointment of the Principals, Deans, Professors, Associate\nProfessors, Assistant Professors and such other senior faculty and senior\nadministrators as may be prescribed;\n(e)     to institute schemes, directions and guidelines for the terms and conditions of\nappointment of all officers, teachers and other employees of the Institute;\n(f)     to approve strategic plans;\n(g)     to approve financial resource development plans of the Institute and to approve\nthe strength of the teaching staff as well as the clerical and non-clerical staff\nand may from time to time increase the posts or decrease or abolish any previous\napproved posts;\n(h)     to consider the drafts of Statutes and Regulations proposed by the Syndicate and\nthe Academic Council respectively and deal with them in a prescribed manner:\nProvided that the Senate may frame Statutes or Regulations on its own initiative and approve\nit after calling for the advice of the Syndicate or the Academic Council, as the case may be;\n(i)     to annul by order in writing the proceedings of any Authority or officer if the\nSenate is satisfied that such proceedings are not in accordance with the\nprovisions of this Act, Statutes or Regulations after calling upon such Authority\nor officer to show cause as to why such proceedings should not be annulled;\n(j)     to recommend to the Chancellor removal of any member of the Senate in\naccordance with the provisions of this Act;\n(k)     to make appointments of members of the Syndicate, other than ex-officio\nmembers, in accordance with the provisions of this Act;\n(I)     to make appointment of members of the Academic Council, other than ex-\nofficio members, in accordance with the provisions of this Act;\n(m)     to appoint emeritus Professors on such terms and conditions as may be\nprescribed;\n(n)     to remove any person from the membership of any Authority if such person\n(i)    has become of unsound mind; or\n(ii)   has become incapacitated to function as member of such Authority; or\n(iii)   has been by a court of law convicted for an offence involving moral\nturpitude; and\n(o)     to determine the form, provide for the custody and regulate the use of the\ncommon seal of the Institute.\n(3) The Senate may, subject to the provisions of this Act, delegate all or any of the powers and\nfunctions of any Authority, officer or employee of the Institute at its main campus, to any Authority,\ncommittee, officer or employee at its additional campus for the purpose of exercising such powers and\nperforming such functions in relation to such additional campus, and for this purpose the Senate may\ncreate new posts or positions at the additional campus."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Visitations",
      "content": "The Senate may, in accordance with the terms and procedures as may be\nprescribed, cause an inspection to be made in respect of any matter connected with the Institute."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Syndicate",
      "content": "(1) There shall be a Syndicate of the Institute consisting of the following,\nnamely:-\n(a)     the Vice-Chancellor who shall be its Chairperson;\n(b)     the Deans of the Faculties of the Institute;\n(c)     three Professors from different departments, who are not members of the\nSenate, to be elected by the Institute teachers in accordance with the procedure\nto be prescribed by the Senate;\n(d)     the Directors and Principals of the constituent colleges;\n(e)     the Registrar;\n(f)     the Treasurer;\n(g)     the Director QEC;\n(h)     the Director (P&D);\n(i)     the Director ORIC; and\n(j)     the Controller of Examinations.\n(2) The Registrar shall also be the Secretary of the Syndicate.\n(3) Members of the Syndicate, other than ex-officio members, shall hold office for three years.\n(4) As regards the three Professors under clause (c) of sub-section (1), the Senate may, as an\nalternative to elections, prescribe a procedure for proposal of a panel of names by the Representation\nCommittee set up in terms of section 28. Appointment of persons proposed by the Representation\nCommittee may be made by the Senate on the recommendation of the Vice-Chancellor.\n(5) The quorum for a meeting of the Syndicate shall be one-half of the total number of\nmembers, a fraction being counted as one.\n(6) The Syndicate shall meet at least once in each quarter of the year."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Power and duties of Syndicate",
      "content": "(1) The Syndicate shall be the executive body of the\nInstitute and shall, subject to the provisions of this Act and Statutes, exercise general supervision over\nthe affairs and management of the Institute.\n(2) Without prejudice to the generality of the foregoing powers, and subject to the provisions\nof this Act, Statutes and directions of the Senate, the Syndicate shall have the following powers,\nnamely:-\n(a)     to consider the annual report, the annual and revised budget estimates and to\nsubmit these to the Senate;\n(b)     to transfer and accept the transfer of movable property on behalf of the Institute;\n(c)     to enter into, vary, carry out and cancel contracts on behalf of the Institute;\n(d)     to cause proper books of accounts to be kept for all sums of money received\nand expended by the Institute and for the assets and liabilities of the Institute;\n(e)     to invest any money belonging to the Institute including any unapplied\nincome in any of the securities described in section 20 of the Trusts Act, 1882\n(Act II of 1882), or in the purchase of immovable property or in such other\nmanner, as it may prescribe, with the like power of varying such investments;\n(f)     to receive and manage any property transferred, and grants, bequests, trusts,\ngifts, donations, endowments and other contributions made to the Institute;\n(g)     to administer any funds placed at the disposal of the institute for specified\npurposes;\n(h)     to provide the buildings, libraries, premises, furniture, apparatus, equipment and\nother means required for carrying out the work of the Institute;\n(i)     to establish and maintain halls of residence and hostels or approve or license\nhostels or lodgings for the residence of students;\n(j)     to recommend to the Senate admission of educational            institutions to the\nprivileges of the Institute and withdraw such privileges;\n(k)     to recommend to the Senate affiliation or de-affiliation of colleges;\n(I)     to institute Professorships, Associate Professorships, Assistant Professorships,\nLectureships and other teaching posts or to suspend or to abolish such posts;\n(m)     to create, upgrade, downgrade, re-designate, suspend or abolish such\nadministrative or other posts as may be necessary;\n(n)     to prescribe the duties of officers, teachers and other employees of the Institute;\n(o)     to report to the Senate on matters with respect to which it has been asked to\nreport;\n(p)     to appoint members to various Authorities in accordance with the provisions of\nthis Act;\n(q)     to propose drafts of Statutes for submission to the Senate;\n(r)     to regulate the conduct and discipline of the students of the institute;\n(s)     to take actions necessary for the good administration of the Institute in\ngeneral and to this end exercise such powers as are necessary;\n(t)     to delegate any of its powers to any Authority or officer or a committee; and\n(u)     to perform such other functions as have been assigned to it by the provisions of\nthis Act or may be assigned to it by Statutes."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Academic Council",
      "content": "(1) There shall be an Academic Council of the Institute consisting\nof the following, namely:-\n(a)     the Vice-Chancellor who shall be its Chairperson;\n(b)     the Deans of Faculties and such Heads of Departments as may be prescribed;\n(c)     five members representing the departments, institutes and the constituent\ncolleges to be elected in the manner prescribed by the Senate;\n(d)     two principals of affiliated colleges;\n(e)     five Professors including emeritus Professors;\n(e)     the Registrar;\n(f)     the nominee of the Commission;\n(g)     the Controller of Examinations; and\n(h)     the Senior Librarian\n(2) The Senate shall appoint the members of the Academic Council, other than the ex-officio\nand the elected members, on the recommendation of the Vice-Chancellor of the Institute:\nProvided that as regards the five Professors and the members representing the departments,\ninstitutes and constituent colleges, the Senate may, as an alternative to elections, prescribe a procedure\nfor the proposal of a panel of names by the Representation Committee set up in terms of section 28.\nAppointment of persons proposed by the Representation Committee may be made by the Senate on\nthe recommendation of the Vice-Chancellor.\n(3) Members of the Academic Council shall hold office for three years.\n(4) The Academic Council shall meet at least once in each quarter of the year.\n(5) The quorum for meeting of the Academic Council shall be one half of the total number of\nmembers, a fraction being counted as one."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Powers and functions of the Academic Council",
      "content": "(1) The Academic Council shall be the\nprincipal academic body of the Institute and shall, subject to the provisions of this Act and Statutes,\nhave the power to lay down proper standards of instruction, research and examinations and to regulate\nand promote the academic life of the Institute and the constituent colleges of the Institute.\n(2) Without prejudice to the generality of the foregoing powers and subject to the provisions\nof this Act and Statutes, the Academic Council shall have the power to\n(a)    approve the policies and procedures pertaining to the quality of academic\nprograms;\n(b)    approve academic programs;\n(c)    approve the policies and procedures pertaining to student-related functions\nincluding admissions expulsions, punishments, examinations and certification;\n(d)    approve the policies and procedures assuring the quality of teaching and\nresearch;\n(e)    recommend the policies and procedures for affiliation with other educational\ninstitutions;\n(f)    propose to the Syndicate schemes for the constitution and organization of\nFaculties, teaching departments and boards of studies;\n(g)    appoint paper setters and examiners for all examinations of the Institute after\nreceiving panels of names from the relevant authorities;\n(h)    institute programs for the continued professional development of Institute\nteachers at all levels;\n(i)    recognize the examinations of other universities or examining bodies as\nequivalent to the corresponding examinations of the Institute;\n(j)    regulate the award of studentships, scholarships, exhibitions, medals and\nprizes;\n(k)    make Regulations for submission to the Senate;\n(l)    prepare an annual report on the academic performance of the Institute; and\n(m)    perform such functions as may be prescribed by Regulations."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Representation Committees",
      "content": "(1) There shall be a Representation Committee constituted\nby the Senate through Statute for the recommendation of persons for appointment to the Senate,\nSyndicate and Academic Council in accordance with the provisions of sections 21,24 and 26\nrespectively.\n(2) Members of the Representation Committee for appointment to the Senate shall consist of\nthe following, namely:—\n(a)    three members of the Senate who are not Institute teachers;\n(b)    two persons nominated by the Institute teachers from amongst themselves in the\nprescribed manner;\n(c)    one person from the academic community, not employed by the Institute, at the\nlevel of professor or college principal to be nominated by the Institute teachers\nin the manner prescribed; and\n(d)    one eminent citizen with experience in administration, social, philanthropy,\neducation, advocacy, media, literati, development work, law and accountancy\nto be nominated by the Senate.\n(3) The Representation Committee for appointments to the Syndicate and the Academic\nCouncil shall consist of the following, namely:—\n(a)    two members of the Senate who are not Institute teachers; and\n(b)    three persons nominated by the Institute teachers from amongst themselves in\nthe prescribed manner.\n(4) The tenure of the Representation Committees shall be three years:\nProvided that no member shall serve for more than two consecutive terms.\n(5) The procedure for conducting business of the Representation Committee shall be as may\nbe prescribed.\n(6) There may also be such other Representation Committees set up by any of the other\nAuthorities as are considered appropriate for recommending persons for appointment to the various\nAuthorities and other bodies of the Institute."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Appointment of committees by certain Authorities",
      "content": "(1) The Senate, the Syndicate, the\nAcademic Council and other Authorities may, from time to time, appoint such standing, special or\nadvisory committees, as they may deem fit, and may place on such committees persons who are not\nmembers of the Authorities appointing the committees.\n(2)     The constitution, functions and powers of the Authorities for which no specific\nprovision has been made in this Act shall be such as may be prescribed by Statutes or Regulations.\nSTATUTES, REGULATIONS AND RULES"
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Statutes",
      "content": "(1) Subject to the provisions of this Act, Statutes may be made to regulate or\nprescribe all or any of the following matters, namely:-\n(a)     the contents of and the manner in which the annual report, to be presented by\nthe Vice-Chancellor before the Senate, shall be prepared;\n(b)     the Institute fees and other charges;\n(c)     the constitution of any pension, insurance, gratuity, provident fund and\nbenevolent fund for Institute employees;\n(d)     the scales of pay and other terms and conditions of service of officers, teachers\nand other Institute employees;\n(e)     the maintenance of the register of registered graduates;\n(f)     admission of educational institutions to the privileges of the Institute and\nthe withdrawal of such privileges;\n(g)     affiliation and disaffiliation of educational institutions and related matters\n(h)     the establishment of faculties, departments, institutes, constituent colleges and\nother academic divisions;\n(i)     the powers and duties of officers and teachers;\n(j)     conditions under which the Institute may enter into arrangements with other\ninstitutions or with public bodies for purposes of research and advisory\nservices;\n(k)     conditions for appointment of emeritus Professors and award of honorary\ndegrees and academic chairs;\n(l)     efficiency and discipline of Institute employees;\n(m)     the constitution and procedure to be followed by Representation Committees in\ncarrying out functions in terms of this Act;\n(n)     the constitution and procedure to be followed by the Search Committee for\nappointment of the Vice-Chancellor;\n(o)     conditions and qualifications for appointment of all categories of teachers;\n(p)     constitution, functions and powers of the Authorities; and\n(q)     all other matters which by this Act are to be or may be prescribed or regulated\nby Statutes.\n(2) The draft of Statutes shall be proposed by the Syndicate to the Senate which may approve\nor pass with such modifications as the Senate may think fit or may refer back to the Syndicate for\nreconsideration of the proposed draft:\nProvided that Statutes concerning any of the matters mentioned in clauses (a) and {I) of\nsub-section (1) shall be initiated and approved by the Senate, after seeking the views of the Syndicate:\nProvided further that the Senate may initiate Statutes with respect to any matter in its powers\nwith respect to which Statutes may be made in terms of this Act and approve such Statutes after seeking\nthe views of the Syndicate."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Regulations",
      "content": "(1) Subject to the provisions of this Act and Statutes, the Academic\nCouncil may make Regulations for all or any of the following matters, namely:—\n(a)     the courses of study for degrees, diplomas and certificates of the Institute;\n(b)     the manner in which the teaching referred to in sub-section (1) of section 8 shall\nbe organized and conducted;\n(c)     the admission and expulsion of students to and from the Institute;\n(d)     the conditions under which students shall be admitted to the courses and\nthe examinations of the Institute and shall become eligible for the award of\ndegrees, diplomas and certificates; (e) the conduct of examinations;\n(f)     conditions under which a person may carry on independent research to entitle\nhim to a degree;\n(g)     the institution of fellowships, scholarships, exhibitions, medals and prizes;\n(h)     the use of the library;\n(i)     the formation of Faculties, Departments, Disciplinary Committees and Board\nof Studies; and\n(j)     all other matters which by this Act or the Statutes are to be or may be prescribed\nby Regulations.\n(2) Regulations shall be proposed by the Academic Council and shall be submitted to the Senate\nwhich may approve them or withhold approval or refer them back to the Academic Council for\nreconsideration. A Regulation proposed by the Academic Council shall not be effective unless it\nreceives the approval of the Senate.\n(3) Regulations regarding or incidental to matters contained in sub clauses, (g) and (i) of sub-\nsection (1) shall not be submitted to the Senate without the prior approval of the Syndicate."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Amendment and repeal of Statutes and Regulations",
      "content": "The procedure for adding to,\namending or repealing the statutes and the regulations shall be the same as that prescribed respectively\nfor framing or making statutes and regulations."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Rules",
      "content": "(1) Subject to the provision of sub-section (2), the Authorities and the other bodies\nof the Institute may make Rules, consistent with this Act, to regulate any matter relating to the affairs\nof the Institute including Rules to regulate the conduct of business and the time and place of meetings\nand related matters.\n(2) Rules shall become effective upon approval by the Syndicate."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Fund of the Institute",
      "content": "The Institute shall have a fund to which shall be credited its\nincome, fees, shares, donations, trusts, bequests, endowments, contributions, grants and all other\nsources."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Audit and accounts",
      "content": "The accounts and financial statements of the Institute shall be\nprepared in conformity with the International Financial Reporting Standards (IFRS) as applicable in\nPakistan.\n(2) The teaching departments, constituent colleges and institutes and all other bodies designated\nas such by the Syndicate in terms of statutes shall be independent cost centers of the Institute with\nauthority vested in the head of each cost center to sanction expenditures out of the budget allocated to\nit:\nProvided that re-appropriation from one head of expenditure to another may be made by the\nhead of the cost center in accordance with and to the extent prescribed by the statutes.\n(3) All funds generated by a teaching department, constituent college or other units of the\ninstitute through consultancy, research or other provisions of service shall be made available without\nprejudice to the budgetary allocation otherwise made, after deduction of overheads in the manner\nand to the extent prescribed by Statute, to the teaching department, constituent college or other units\nfor its development. A part of the funds so generated may be shared with the Institute teachers or\nresearchers in charge of the consultancy, research or service concerned in the manner and to the extent\nprescribed by the Statute.\n(4) No expenditure shall be made from the funds of the Institute, unless a bill for its payments\nhas been issued by the head of the cost center concerned in accordance with the relevant statutes and\nthe Treasurer has verified that the payment is provided for in the approved budget of the cost\ncenter, subject to the authority to re-appropriate available to the head of the cost center.\n(5) Provision shall be made for an internal audit of the finances of the Institute.\n(6) Without prejudice to the requirement of audit by an auditor appointed by the Government\nin accordance with the provisions of any other law in force, the annual audited statement of accounts\nof the Institute shall be prepared in conformity with the Generally Accepted Accounting\nPrinciples (GAAP) by a reputed firm of chartered accountants and signed by the Treasurer. The annual\naudited statement of accounts so prepared shall be submitted to the Auditor General of Pakistan for his\nobservations.\n(7) The observations of the Auditor General of Pakistan, if any, together with such annotations\nas the Treasurer may make, shall be considered by the Syndicate and shall be placed before the Senate\nwithin six months of closing of the financial year."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Opportunity to show cause",
      "content": "Except as otherwise provided by law, no officer, teacher\nor other employee of the Institute holding a permanent post shall be reduced in rank or removed or\ncompulsorily retired or dismissed from service for cause arising out of any act or omission on the part\nof the person concerned unless he has been given a reasonable opportunity of showing cause against\nthe action proposed to be taken."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Appeal to the Syndicate and the Senate",
      "content": "Where an order is passed punishing any officer\n(other than the Vice-Chancellor), teacher or other employee of the Institute or altering or interpreting\nto his disadvantage the prescribed terms or conditions of his service, he shall, where the order is passed\nby any officer or teacher of the Institute other than the Vice-Chancellor, have the right to appeal to the\nSyndicate against the order, and where the order is passed by the Vice-Chancellor, have the right to\nappeal to the Senate."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Service of the Institute",
      "content": "(1) All persons employed by the Institute in accordance\nwith the terms and conditions of service prescribed by statutes shall be persons in the service of\nPakistan for the purposes of any court or tribunal set up by law in terms of Article 212 of the\nConstitution of the Islamic Republic of Pakistan:\nProvided that any provision as regards the terms and conditions of employment of persons in\nthe service of Pakistan in general or in comparable employment notwithstanding the service of persons\nemployed by the Institute shall be entirely governed by the terms and conditions prescribed by the\nrelevant Statutes.\n(2) An officer, teacher or other employee of the Institute shall retire from service on the\nattainment of such age or tenure of service as may be prescribed.\n(3) No adverse change shall be made in the terms and conditions of employment of any college\nteacher in the employment of the Institute on the date of commencement of this Act."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Benefits and insurance",
      "content": "(l) The Institute shall constitute for the benefit of its officers,\nteachers and other employees schemes, as may be prescribed, for the provision of post-employment\nbenefits as well as health and life insurance while in service\n(2) Where any provident fund has been constituted under this Act, the provisions of the\nProvident Funds Act, 1925 (XIX of 1925), shall apply to such funds as if it were the Government\nProvident Fund."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Commencement of term of office of members of Authority",
      "content": "(1) When a member of a\nnewly constituted Authority is elected, appointed or nominated, his terms of office shall commence\nfrom such date as may be prescribed.\n(2) Where a member who has accepted any other assignment or for any other similar reason\nremains absent from the Institute for a period of not less than six months he shall be deemed to have\nresigned and vacated his seat."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Filling of casual vacancies in Authorities",
      "content": "Any casual vacancy among the members of\nany Authority shall be filled as prescribed, as soon as conveniently may be, in the same manner and\nby the same person or Authority that had appointed the member whose place has become vacant and\nthe person appointed to the vacancy shall be a member of such Authority for the residue of the terms\nfor which the person whose place he fills would have been a member."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Flaws in the constitution of Authorities",
      "content": "Where there is a flaw in the constitution of\nan Authority, as constituted by this Act, Statutes or Regulations on account of the abolition of a\nspecified office under Government or because an organization, institution or other body outside the\nInstitute has been dissolved or has ceased to function or because of some other similar reason, such\nflaw shall be removed in such manners as the Senate may direct."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Proceedings of Authorities not invalidated by the vacancies",
      "content": "No act, resolution or\ndecision of any Authority shall be invalid by reason of any vacancy of the Authority doing, passing or\nmaking it or by reason of any want of qualification or invalidity in the election, appointment or\nnomination of any de facto member of the Authority, whether present or absent."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. First Statutes and Regulations",
      "content": "Notwithstanding anything to the contrary contained\nin this Act, the Chancellor shall promulgate the first Statutes and Regulations which shall be deemed\nto be Statutes and Regulations made under sections 26 shall continue to remain in force until amended\nor till such time as new Statutes and Regulations are made in accordance with the provisions of this\nAct."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Savings",
      "content": "(1) Notwithstanding anything contained in any other law for the time being\nin force, all employees serving in Women Campus of University of Bannu, Bannu shall immediately\nbefore the commencement of this Act shall stand transferred to the Institute on exercising an\nirreversible option within one year of the aforesaid commencement, on the same terms and\nconditions which are not be less than favorable than those to which he was entitled immediately\nbefore such transfer.\n(2) Whereas, all such employees who do not exercise the option of getting absorbed in the\nInstitute within one year after the enforcement of this Act shall be rendered back to University of\nBannu, Bannu in their basic pay scale. If he possesses the qualifications and fulfills other conditions\napplicable to that post, provided that where no equivalent post is available, the said official may be\noffered a lower post in such manner and subject to such conditions as may be prescribed and where\nsuch civil servant is appointed to a lower post, the pay being drawn by him in the higher post\nimmediately preceding his appointment to a lower post shall remain protected.\n(3) The seniority of the employees who opt for absorbance in the Institute shall remain intact\nirrespective of their joining date at the Institute.\n(4) Upon enactment of Charter of the Kalam Bibi International Women Institute, all properties,\nrights and interests of whatever kind used, enjoyed, possessed, owned, or vested in the Women\nCampus of University of Bannu and all liability legally subsisting against the said college shall\nstand transferred to the Institute."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Removal of difficulties",
      "content": "(l) if any question arises as to the interpretation of any of the\nprovisions of this Act, it shall be placed before the Chancellor and Commission whose decision thereon\nshall be final.\n(2) If any difficulty arises in giving effect to any of the provisions of this Act, the Chancellor\nmay make such order after obtaining the views of the Senate, not inconsistent with the provisions of\nthis Act, as may appear to him to be necessary for removing the difficulty.\n(4) Where this Act makes any provision for anything to be done but no provision or no\nsufficient provision has been made as respects the authority by whom, or the time at which, or the\nmanner in which, it shall be done, then it shall be done by such authority, at such time, or in such\nmanner as the Chancellor may direct after obtaining the views of the Senate."
    }
  ],
  "definitions": [
    {
      "term": "Academic Council",
      "definition": "the Academic Council of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "affiliated college",
      "definition": "an educational institution affiliated to the Institute but not maintained or administered by it;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "any of the Authorities of the Institute specified in section 20;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman or the head of an academic department and includes Principal of a constituent college or Director of an institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairperson",
      "definition": "Chairperson of the Senate;",
      "source_provision": "sec2"
    },
    {
      "term": "Chancellor",
      "definition": "the Chancellor of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the Higher Education Commission set up under the Higher Education Commission Ordinance, 2002 (LIII of2002); (viii) “Controller of Examinations” means the Controller of Examinations of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "constituent institution",
      "definition": "a constituent institution, college, or school of the Institute by whatever name call for but established, maintained, and administered by the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Dean",
      "definition": "the head of any Faculty, or the Head of any academic body granted the status of a Faculty under this Act or by the Statutes or Regulations;",
      "source_provision": "sec2"
    },
    {
      "term": "department",
      "definition": "a teaching department maintained and administered or recognized by the Institute in the prescribed manner;",
      "source_provision": "sec2"
    },
    {
      "term": "Director",
      "definition": "the head of a constituent college or unit; (xiii) “Faculty” means an administrative and academic unit of the Institute consisting of one or more departments, as may be prescribed;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "Institute",
      "definition": "the Kalam Bibi International Women Institute Bannu;",
      "source_provision": "sec2"
    },
    {
      "term": "Institute teacher",
      "definition": "a whole-time teacher appointed and paid by the Institute, or recognized by the Institute as such; (xvii) “prescribed” means prescribed by Statutes, Regulations or Rules made under this Act; (xviii) “Pro-Chancellor” means Pro-Chancellor of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "registered Graduate",
      "definition": "a graduate of the Institute whose name stands entered in the registered maintained for this purpose;",
      "source_provision": "sec2"
    },
    {
      "term": "Registrar",
      "definition": "the Registrar of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Representation Committees",
      "definition": "the Representation Committees constituted under section 28; (xxii) “Review Panel” means the Review Panel set up by the Chancellor in accordance with the provisions of section IO; (xxiii) “Search Committee” means the Search Committee set up by the Senate under section 13; (xxiv) “Secretariat” means Secretariat headed by the Vice-Chancellor of the Institute as administrative conglomeration comprising Registrar, Controller of Examinations, Treasurer and Deans to assist the Vice-Chancellor;",
      "source_provision": "sec2"
    },
    {
      "term": "Senate",
      "definition": "the Senate of the Institute; (xxvi) “Statutes” “Regulations” and “Rules” means respectively the Statutes, the Regulations and the Rules made under this Act and for the time being in force; (xxvii) “Syndicate” means the Syndicate of the Institute; (xxviii) “teachers” include Professors, Associate Professors, Assistant Professors and Lecturers engaged whole-time by the Institute and such other persons as may be declared by Regulations to be teachers; (xxix) “Treasurer” means the Treasurer of the Institute; and",
      "source_provision": "sec2"
    },
    {
      "term": "Vice-Chancellor",
      "definition": "the Vice-Chancellor of the Institute specified in section 12.",
      "source_provision": "sec2"
    }
  ]
}
