{
  "id": "pk-karachi-essential-articles-price-control-and-antl-hoarding-act-1953",
  "type": "statute",
  "title": "Karachi Essential Articles (Price Control and Antl-Hoarding) Act, 1953",
  "title_en": "Karachi Essential Articles (Price Control and Antl-Hoarding) Act, 1953",
  "short_name": "KEACA",
  "status": "in_force",
  "issued_date": "1953-11-02",
  "in_force_date": "1953-11-02",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap%2BaZA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Karachi Essential Articles (Price Control and Antl-Hoarding) Act, 1953 (XXVII of 1953) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title extent and commencement",
      "content": "_(1) This Act may be called the Karachi Essential\nArticles (Price Control and Anti‑Hoarding) Act, 1953.\n(2) It extends to the 2[Karachi Division].\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "_\n3[(a) “Commissioner” means the Commissioner of the Karachi Division ;]\n(b) “essential article” means any article, other than an “essential commodity” within the\nmeaning of section 2 of the Essential Supplies (Temporary Powers) Act, 1946 (XXIV of\n1946), which the 4[Commissioner] may, from time\n1 For Statement of Objects and Reasons, see Gaz. of P., 1953, Pt. IX, p. 131.\n2 Subs. by A.O., 1964, Art. 2 and Sch., for “Federal Territory of Karachi” which had been subs. by the Repealing and Amending Ordinance, 1961 (1 of 1961), s. 3, and 2 nd Sch, for\n“Capital of the Federation”.\n3 Subs. ibid., for clause (a) which had been subs. by the Repealing and Amending Ordinance, 1961 (1 of 1961), s. 3 and 2 nd Sch., for the original clause (a) .\n4 Subs. ibid., for “Agent” which had been subs. by Ordinance 1 of 1961. s. 3 and 2 nd Sch., for “Chief Commissioner”.\nto time, declare by notification, to be an article to which the provisions of this Act shall\napply ;\n(c) “notification” means a notification published in the official Gazette ;\n(d) “prescribed” means prescribed by rules made under this Act ;\n(e) “retailer” means a trader who sells any essential article directly to a consumer ;\n(f) “trader” means any person engaged in the purchases, sale, or storage for sale of any\nessential article ;\n(g) “wholesaler” means a trader other than a retailer"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Power to fix prices and to require marking of prices",
      "content": "_(1) The 1[Commissioner] may, by\nnotification, fix the maximum prices above which no essential article shall be sold by any wholesaler,\nretailer, trader or any other person, and the prices so fixed may be different in different localities.\n(2) The 1[Commissioner] may, by notification, require any trader to mark essential articles with\nthe sale prices fixed under sub‑section (1), in such manner as may be prescribed.\n(3) The 1[Commissioner] may, by order in writing, require any trader to exhibit a list of essential\narticles with prices fixed under sub‑section (1) at convenient place of his shop premises as prescribed."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Prohibition against purchase, sale, etc., at prices exceeding the maximum price",
      "content": "_(1)\nNotwithstanding anything contained in any contract, no wholesaler, retailer, trader or other person\nshall sell or purchase, or deliver or accept delivery of, any essential article at a price exceeding the\nmaximum price fixed under sub‑section (1) of section 3.\n1 Subs. by A.O., 1964, Art. 2 and Sch., for “Agent” which had been subs. by Ordinance 1 of 1961, s. 3 and 2 nd Sch., for “Chief Commissioner”.\n(2) No trader shall sell or offer or exhibit for sale any essential articles in respect of which\nmarking of sale prices has been required under sub‑section (2) of section 3 unless such article has\nbeen so marked."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power to control possession of essential article",
      "content": "_ (1) The 1[Commissioner] may, by\nnotification, direct that no wholesaler, retailer, trader or other person shall keep in his possession or\nunder his control any essential article in excess of the quantity specified in such notification.\n(2) If, on the date of issue of a notification under subsection (1) in respect of any essential article,\nany wholesaler, retailer, trader or other person has in his possession any quantity of such essential\narticle in excess of the quantity specified in such notification, he shall forthwith report the fact to the\n1[Commissioner] or to such other officer as may be empowered in this behalf by the\n1[Commissioner], and shall take such action as to storage, distribution, or disposal of the excess\nquantity as the 1[Commissioner] or such other officer may direct."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to require licence for trading. The 1[Commissioner] may, by notification, direct that",
      "content": "no trader or class of traders shall deal in any essential article except under, and in accordance with\nthe conditions of, a licence issued in this behalf by the 1[Commissioner], on payment of such fees and\nin such manner and form as may be prescribed."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Direction to sell to specified persons. The 1[Commissioner] may, by general or special order",
      "content": "in writing, direct any wholesaler, retailer, or trader holding stocks of any essential article to sell the\nwhole or a specified part thereof at prices not exceeding the maximum fixed under subsection (1) of\nsection 3, to such persons or class of persons and in such circumstances or against such permits as\nmay be specified in the order."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Prohibition against withholding of sales. No wholesaler, retailer or trader shall, unless",
      "content": "previously authorised in writing to do so by the 1[Commissioner], withhold from sale or refuse to\n1 Subs. by A.O., 1964, Art. 2 and Sch., for “Agent” which had been subs. by the Repealing and Amending Ordinance, 1961 (1 of 1961), s. 3 and 2 nd Sch., for “Chief Commissioner”.\nsell to any person any essential article within the limits as to quantity imposed by or under this Act."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Power to require maintenance of account etc., and registration of godowns",
      "content": "_(1) Any\nofficer authorised in this behalf by the 1[Commissioner] may, by general or special order in writing,\ndirect any wholesaler, retailer or trader :___\n(a) to maintain accounts relating to any transaction in such manner and form as may be\nprescribed ;\n(b) to submit such accounts, returns, reports or statements relating to any transaction in such\nmanner and form as may be prescribed ;\n(c) to cause his storage godown to be registered in such manner and within such period as\nmay be prescribed.\n(2) No person whose godown has been registered under clause (c) of sub‑section (1) shall store\nany essential article in any place other than the godown so registered."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Power to enter, inspect, search, etc. Any officer authorised in this behalf by the 1[Com­",
      "content": "missioner] may___\n(a) enter and inspect any premises, vessels, vehicles, or aircraft, used or believed to be used\nfor the purchase, sale, transport, or storage for sale of any essential article ;\n(b) enter and search any premises, vessels, vehicles, or aircraft, and seize any essential article,\ntogether with the containers thereof, in respect of which he has reasons to believe that a\ncontravention of the provisions of this Act has been or is about to be committed ;\n1 Subs. by A.O., 1964, Art. 2 and Sch., for “Agent” which had been subs. by the Repealing and Amending Ordinance, 1961 (1 of 1961), s. 3 and 2 nd Sch., for “Chief Commissioner”.\n(c) direct the owner, occupier or other person in charge of such premises, vehicles, vessels or\naircraft or any trader to produce any books, accounts, vouchers or other documents\nrelating to the purchase, sale or storage for sale or transport of any essential article or to\nfurnish such information relating to such transaction as the officer so authorised may\nrequire ;\n(d) inspect or cause to be inspected any books, accounts, vouchers or other documents\nrelating to any such transaction as aforesaid ; and\n(e) take or cause to be taken extracts from or copies of any document relating to such\ntransaction."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Provisions of the Act not to apply in case of Government purchase, etc. The provisions of",
      "content": "this Act shall not apply to the purchase, storage or distribution of any essential article by or on behalf\nof the 1[Federal Government] or any Provincial Government."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to exempt. The 2[Commissioner] may, by notification, exempt any person or class of",
      "content": "persons from all or any of the provisions of this Act, subject to such conditions, if any, as may be\nspecified in the notification."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Penalty and procedure, etc. If any person contravenes any of the provisions of this Act or",
      "content": "any rule made thereunder, direction or order issued under any such provision he shall be deemed to\nhave committed the offence of hoarding or, as the case may be, of dealing in the black market, under\nsection 3 of the Hoarding and Black Market Act, 1948, (XXIX of 1948), and all the provisions of that\nAct, shall apply to such contravention as if such contravention were an offence under that Act.\n1 Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n2 Subs. by A.O., 1964, Art. 2 and Sch., for “Agent”, which had been subs. by the Repealing and Amending Ordinance, 1961 (1 of 1961), s. 3 and 2 nd Sch., for “Chief Commissioner”."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Delegation of power etc. The 1[Commissioner] may, by notification, direct that any power or",
      "content": "duty which is conferred or imposed by this Act on him shall, subject to such conditions, if any, as may\nbe specified in the notification, be exercised or discharged also by any officer or authority\nsubordinate to him."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Public servant. Any person empowered or authorised to do anything under this Act shall be",
      "content": "deemed to be a public servant within the meaning of section 21 of the Pakistan Penal Code (XLV of\n1860)."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Indemnity",
      "content": "_(1) No suit, prosecution or other legal proceeding shall lie against any person\nfor anything which is in good faith done or intended to be done in pursuance of any provision of this\nAct and the rules made thereunder.\n(2) No suit or other legal proceeding shall lie against the 1[Commissioner] for any damage caused\nor likely to be caused by anything which is in good faith done or intended to be done in pursuance of\nany provision of this Act or the rules made thereunder."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Repeal and saving",
      "content": "_(1) The Karachi Essential Articles (Price Control and Anti‑Hoarding)\nOrdinance, 1953 (Ord. III of 1953), is hereby repealed.\n(2) Any order, direction or rule made under the said Ordinance and in force immediately before\nand shall have effect accordingly.\n______________________\n1 Subs. by A.O., 1964, Art. 2 and Sch., for “Agent” which had been subs. by the Repealing and Amending Ordinance, 1961 (1 of 1961), s. 3 and 2 nd Sch., for “Chief Commissioner”."
    }
  ],
  "definitions": [
    {
      "term": "Commissioner",
      "definition": "the Commissioner of the Karachi Division ;]",
      "source_provision": "sec2"
    },
    {
      "term": "essential article",
      "definition": "any article, other than an “essential commodity” within the meaning of section 2 of the Essential Supplies (Temporary Powers) Act, 1946 (XXIV of 1946), which the 4[Commissioner] may, from time 1 For Statement of Objects and Reasons, see Gaz. of P., 1953, Pt. IX, p. 131. 2 Subs. by A.O., 1964, Art. 2 and Sch., for “Federal Territory of Karachi” which had been subs. by the Repealing and Amending Ordinance, 1961 (1 of 1961), s. 3, and 2 nd Sch, for “Capital of the Federation”. 3 Subs. ibid., for clause (a) which had been subs. by the Repealing and Amending Ordinance, 1961 (1 of 1961), s. 3 and 2 nd Sch., for the original clause (a) . 4 Subs. ibid., for “Agent” which had been subs. by Ordinance 1 of 1961. s. 3 and 2 nd Sch., for “Chief Commissioner”. to time, declare by notification, to be an article to which the provisions of this Act shall apply ;",
      "source_provision": "sec2"
    },
    {
      "term": "notification",
      "definition": "a notification published in the official Gazette ;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act ;",
      "source_provision": "sec2"
    },
    {
      "term": "retailer",
      "definition": "a trader who sells any essential article directly to a consumer ;",
      "source_provision": "sec2"
    },
    {
      "term": "trader",
      "definition": "any person engaged in the purchases, sale, or storage for sale of any essential article ;",
      "source_provision": "sec2"
    },
    {
      "term": "wholesaler",
      "definition": "a trader other than a retailer",
      "source_provision": "sec2"
    }
  ]
}
