{
  "id": "pk-karachi-port-security-force-ordinance-2002",
  "type": "statute",
  "title": "Karachi Port Security Force Ordinance, 2002",
  "title_en": "Karachi Port Security Force Ordinance, 2002",
  "short_name": "KPSFO",
  "status": "in_force",
  "issued_date": "2002-10-20",
  "in_force_date": "2002-10-20",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FtbJ0%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Karachi Port Security Force Ordinance, 2002 (LXXXIV of 2002) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Removal of difficulties",
      "content": "ORDINANCE No. LXXXIV OF 2002\n[22nd October, 2002]\nAn Ordinance, to provide for the constitution and regulation of the Karachi Port Security\nForce\nWHEREAS it is expedient to provide for the constitution and regulation of Port Security\nForce for protection of ports property; safety of goods stored in the ports area for import or export;\nprevention; inquiry and investigation of offences committed in connections with the affairs of the\nports and matters connected therewith or ancillary thereto;___\nAND WHEREAS the President is satisfied that the circumstances exist which render it\nnecessary to take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the Fourteenth day\nof October, 1999, and the Provisional Constitutional Order No. 1 of 1999, read with the Provisional\nConstitution (Amendment; Order No.9 of 1999, and in exercise of all powers enabling him in that\nbehalf, the President of Islamic Republic of Pakistan is pleased to make and promulgate the\nfollowing Ordinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, and commencement",
      "content": "_(1) This Ordinance may be called the Karachi\nPort Security Force Ordinance, 2002.\n(2) It extends to the Ports limits of Karachi Port as defined under the First Schedule of this\nOrdinance.\n(3) It shall come into force at once"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_In this Ordinance, unless there is anything repugnant in the subject or\ncontext,___\n(i)     “Board” means Board of Trustees of the Port of Karachi as defined in Karachi\nPort Trust Act, 1886 (II of 1886);\n(ii)    “Chairman” means the Chairman of the Karachi Port Trust and includes any\nActing Chairman of the Trust as defined in the Karachi Port Trust Act, 1886\n(II of 1886);\n(iii)   “Commandant” means any person appointed under section 4 as Commandant\nof the Port Security Force or any person for the time being performing duties\nof Commandant;\n(iv)    “custody” means the arrest and confinement of a person;\n(v)         “Deputy Commandant” means any person appointed under section 4 as\nDeputy Commandant of the Port Security Force or any person for the time\nbeing performing duties of Deputy Commandant;\n(vi)        “Force” means the Port Security Force constituted and established under\nsection 3;\n(vii)       “Magistrate” means a Magistrate appointed under this Ordinance;\n(viii)      “member” means a person, other that an officer, who is appointed to the Force\nand has signed an affirmation in the form set out in the Third Schedule;\n(ix)        “officer” means a person who is so appointed to the Port Security Force and\nhas signed an affirmation in the form set out in the Third Schedule;\n(x)         “Port Area” means the Port Area specified in the First Schedule;\n(xi)        “prescribed” means prescribed under the rules or regulations under this\nOrdinance;\n(xii)       “Regulation” means regulations made under this Ordinance;\n(xiii) “Rules” means rules made under this Ordinance; and\n(xiv)       “Schedule” means the schedule to this Ordinance;"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment, constitution and maintenance of the force, its powers and",
      "content": "functions.___(1) The Chairman with the approval of the Federal Government shall establish,\nconstitute and maintain a force to be called the Karachi Port Security Force to maintain security and\nsafety of the Karachi Port Area for performing of the following functions, namely:__\n(a)     maintain law and order in the Port Area and take cognizance of offences\ncommitted therein or connected thereto;\n(b)     controlling and regulating the admission of persons to, and the conduct of\npersons in the vicinity of Port Area ;\n(c)     render all possible assistance to the Port users;\n(d)     prevent loss to port property and any other property or goods for the time\nbeing within the limits of the port and prevention of offences or\ncontravention of any rule or regulation in respect thereof;\n(e)     ensure proper conduct of persons in the Port Area;\n(f)     to keep Port premises clear of idlers, beggars, hawkers etc. and to keep a\nlookout for suspicious persons, smugglers and other persons on the Port\npremises in contravention of rules, regulations or orders for the time being;\n(g)     to regulate and control movement, traffic and parking of engines, fork lifts,\ncargo handling equipment's, trucks and vehicles in and around the Port\nArea, prevent obstructions therein and thereabouts and enforce regulations\nwith regard to them;\n(h)     enforce and implement, the orders of Magistrate or any authorized officer\nor as defined under the Land Control (Karachi Division) Act, 1952 (XI of\n1952) in the Port Area and priorities wherein the\nKarachi Port Trust has any legal or equitable interest or lien;\n(i)     inquire into and investigate the offences under this Ordinance, its rules,\nregulations or any other laws as may be prescribed by the Federal\nGovernment in this behalf by notification in the official Gazette;\n(j)     bring in to the notice of the Chairman any contravention, breach or\nviolation of any law of which the Force may not itself take cognizance;\n(k)     prevent pollution, spillage; waste fire hazards, chemical hazards, water\nhazards, biological hazards, hazardous waste and hazardous substances and\nalso prevent the generation, collection transport treatment, disposal,\nstorage, handling, import, export of the same, may be prescribed; and\n(l)     such other functions connected with the purposes of this Ordinance as the\nFederal Government may by notification in the official Gazette require the\nForce to perform.\n(2) In the discharge of their functions, the officers and members of the Force shall be guided\nby, and act in accordance, with this Ordinance and the rules and regulations.\n(3) The administration of the Force shall vest in the commandant of the Force who shall\nadminister it in accordance with the provisions of this Ordinance, rules and such orders and\ninstructions as may be made or issued by the Chairman from time to time.\n(4) The Force shall exercise his powers and perform his functions under the general\nsupervision and directions of the Chairman.\nCONSTITUTION, SUPRINTENDANCE"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Appointment of Commandant etc",
      "content": "_(1) The Board may, appoint any member in the\nservice of Pakistan to be Commandant of the Force.\n(2) The Chairman may appoint any member in the service of Pakistan to be Deputy\nCommandant, assistant Commandant and any other officer of the Force."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Appointment of subordinate and ministerial staff",
      "content": "_(1) The Commandant or a person\nauthorized by the Chairman in this behalf may appoint, subordinate and ministerial staff and other\nmembers of the Force and determine the duties to be performed by such officer, staff and other\nmembers.\n(2) Appointments under subsection (1) shall be made by direct recruitment or promotion or\nfrom personnel on deputation from any of the Defence Services of Pakistan, the Civil Armed Forces,\nor any other department of Government in such manner as may be prescribed.\nExplanation: In this subsection, “Civil Armed Forces” means such forces as the Federal\nGovernment may, by notification in the Gazette, specify.\n(3) The Commandant may appoint, within the cadre the strength sanctioned by the Chairman,\nsuch number of Inspectors, Sub Inspectors, Assistant Inspectors, selection grade security Guards and\nSecurity Guards as he may consider necessary for the efficient performance of the functions of the\nForce.\n(4) The rank structure, number of the officers and other members of the Force shall be such\nas may be prescribed by the rules.\n(5) Subject to section 6, officers and members of the Force shall receive pay, pension,\nallowances and other remunerations and shall enjoy such leave and other privileges as may be\nprescribed from time to time.\n(6) Before the person is appointed under subsection (1), the statement contained in the\nrecruiting roll and affirmation set out respectively in the second and Third Schedules shall, in the\npresence of a commandant, or other officers appointed under section 4, at any convenient place be\nread out and, if necessary, explained to him who shall, in acknowledgement of the statement having\nbeen so read out to him put his signature to it.\n(7) When the affirmation set out in the Third Schedule is read out, it shall be repeated by the\nperson making affirmation before he signs it.\n(8) Officers and members of the Force shall wear such uniforms as may be prescribed under\nthe regulations."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Members of Defence service of Pakistan to be subject to their respective laws",
      "content": "_\nEvery officer and member of the Force who is appointed under subsection (2) of section 5 on\ndeputation from the Defence Services of the Pakistan shall, remain subject to their respective Acts,\nas officers and persons enrolled under the respective Act accordingly as they are respectively\nofficers, junior commissioned officers and other members of the Force."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Industrial Relations Ordinance, 1969 (XXIII of 1969) or any other labour law not to",
      "content": "apply to the Port Security Force.___ Nothing contained in the Industrial Relations Ordinance, 1969\n(XXIII of 1969) or any other labour law which is for the time being in force, shall apply to, or in\nrelation to, the Port Security Force or any person appointed under this Ordinance."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Powers and duties of the officers and members of the Force",
      "content": "_(1) An officer or\nmember shall,___\n(a)    take effective measures for ensuring security of the Port for safeguarding the\nunlawful interferences;\n(b)     safeguard persons, cargo and property of the Port within the limits of Port;\n(c)     prevent unauthorized persons and vehicles from access to the Port or other\nareas important to the security of the Port;\n(d)     take effective measures for preventing sabotage, placement of any explosive\nitems, dangerous articles and carriage of arms and ammunitions in to the\nrestricted areas of the Port and shall as soon as he detects any contraband on\nthe person or in cargo of any person checked by him notify it to the Customs\nstaff available at the Port for appropriate action under the Customs Act, 1969\n(IV of 1969);\n(e)     use such arms and ammunition and equipment as may be authorised by the\nCommandant of the Force or an officer authorised by him in this behalf for the\npurpose of this Ordinance;\n(f)     search and arrest without warrant any person who is suspected of endangering,\nor attempting to endanger, or having endangered, the safety of the Port or may\nbe necessary in the discharge of the aforesaid duties:\nProvided that no person shall be arrested by an officer below the rank of BS-\n16;\n(g)     perform such other functions as the 'Chairman may require to be performed in\nrelation to this Ordinance; and\n(h)     search, detain or arrest any person, vehicle or vessel toy prevent or detect any\noffence under this Ordinance or any other enactment in respect of the vessel,\nor by any person on board the vessel, the vehicle or any person in the vehicle\nProvided that no person shall be arrested by an officer below the rank of BS"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. (2) The Commandant of the Force may, with the previous approval of the Federal",
      "content": "Government, call for police and military assistance in connection with unlawful activity on the Port,\nand when he does so, all officers and members of the civil agencies operating at the Port shall\nfunction in accordance with the directions of the authorities rendering such assistance.\n(3) An officer, for the purposes of this Ordinance, shall exercise, within the Port areas as\nspecified in the First Schedule of the Ordinance all the powers of an officer in-charge of a police\nstation, under the Police Order, 2002 (Chief Executive's Order No.22 of 2002) and the Code of\nCriminal Procedure, 1898 (Act V of 1898)."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. False pretense of membership of unlawful purpose",
      "content": "_Any person who, not being a\nmember or officer of the Force, puts on the dress or take the name, designation or character of a\nmember or officer of the Force for the purpose of obtaining admission into any house, vessel or other\nplace, shall be guilty of an offence and, notwithstanding any other penalty to which he may be liable,\nshall be liable to a fine of rupees ten thousand and to imprisonment for six months."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Assaulting Officer or member in execution of duty, etc",
      "content": "_Any person who assaults or\nresists any officer or member in the execution of his duty, or aids or incites any person so to assault\nor resist any officer or member of the Force, or refuses to assist any officer or member of the Force\nin the execution of his duty when called upon to do so, or who, by the giving of false information\nwith intent to defeat or, delay the performance of the officer and the member in the discharge of his\nduty, wilfully misleads or attempts to mislead any officer or member of the Force shall be guilty of\nan offence and shall be liable to a fine of rupees twenty five thousand or with imprisonment for six\nmonths or both."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Offences relating to disobedience of orders, obstruction and refusal of information",
      "content": "Whoever incites, persuades, otherwise endeavors, prevents or willfully disobeys any direction\nlawfully given by the member or officer of the Force in uniform of any person or authority\nempowered under this Ordinance to give such direction or obstructs any person or authority in the\ndischarge of any functions which such person or authority is required or empowered under this\nOrdinance to discharge or being required by, or under, this Ordinance supplies any information,\nwithholds such information or gives information which he knows to be false, if no other penalty is\nprovided for the offence, shall be punishable with imprisonment term which may extend to six\nmonths or fine which shall not be less than rupees ten thousand and may extend to rupees twenty\nfive thousand or with both."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Offences relating to prohibited appliances. Whoever carries or is found in possession",
      "content": "of any items the carrying or possession of which is prohibited by rules made under this Ordinance,\nshall be punished with fine which shall not be less than rupees ten thousand and may extend to\nrupees twenty five thousand and such items shall be forfeited to the Chairman."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Punishment for abetment of certain offences. Whoever aids or abets the commission of",
      "content": "any offence under this Ordinance, its rules or regulations shall be punishable with the punishment\nprovided for the offence under Ordinance."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Appointment of Magistrates",
      "content": "(1) Notwithstanding anything contained in the Code of\nGovernment may for the purposes of this Ordinance, appoint a Magistrates of First Class within the\nmeaning of the Code of Criminal Procedure, 1898 (Act V of 1898).\n(2) Notwithstanding anything contained in the Code of Criminal Procedure, 1898 (Act V of\n1898) or any other law for the time bring in force, the Magistrates shall perform following functions,\nnamely:___\n(a)    a Magistrate, who shall be assigned to the mobile units of the Force to patrol\nthe Harbour area, with powers as shall be prescribed to monitor, arrest and\nadjudicate offences, inclusive of offences relating to safety, security and\npollution of the Harbour and other offences. Such Magistrate shall have\npowers to conduct summary proceedings and penalize and fine the offenders\nin accordance with the Code of Criminal Procedure, 1898 (Act V of 1898);\nand\n(b)     a Magistrate, located in the vicinity of the Port Area, adjudicating offence\ncommitted, under this Ordinance, its rules and regulations, the Pakistan Penal\nCode, 1860 (Act XLV of 1860) as per the Fourth Schedule and exercising\npower under the Code of Criminal Procedure, 1898 (Act V of 1898), and in\naccordance with the law:\nProvided that the Port Magistrate shall conclude the proceeding within thirty\ndays of the commencement of the proceedings.\n(3) Notwithstanding anything contained in the Code of Criminal Procedure, 1898 (Act V of\n1898) or any other law for the time being in force, the Judicial Magistrates shall in addition have all\n1952) to adjudicate matters relating to all moveable and immovable properties of the Karachi Port\nTrust in accordance with prevailing law:\nProvided that in the matter of unauthorised occupation of land or buildings or unauthorised\noccupancy, notice in writing shall be given by the Board to the trespassers, unauthorised occupants\nor lessees of demised leases with the Karachi Port, to vacate the properties of the Board within three\nweeks, to remove unauthorised structure if any, and deliver vacant possession to the Board. Failing\ncompliance, the Board may file a, complaint before a Magistrate appointed under this Ordinance,\nwho shall issue notice to the person to show cause, why action should not be taken against him.\nAfter giving him a hearing, the Magistrate may enforce the eviction of such person by such force as\nmay be necessary and order the removal or demolition of any or all unauthorised structures on such\nproperty:\nProvided further that if the Magistrate authorises any officers to take such action, who may\nrequire assistance of the Force to execute the orders, he may send a requisition for assistance of the\nForce to the Police officer-in-charge of a police station having territorial jurisdiction over the area in\nwhich the property is situated. The officer-in-charge, upon receipt of such requisition from the\nMagistrate, shall forthwith render the required assistance.\n(4) Notwithstanding anything contained in the Code of Criminal Procedure, 1898 (Act V\n1898) or any other law for the time being in force, the Force shall implement and enforce orders of\nthe Magistrate using any Force deemed necessary for compliance of the orders;"
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Jurisdiction and procedure",
      "content": "_ Notwithstanding anything contained in the Code of\nCriminal Procedure, 1898 (Act V of 1898) ___\n(a)     an offence under this Ordinance shall be cognizable.\n(b)     a Magistrate trying an offence under this Ordinance shall have power to try\nsuch offences in accordance with the procedure laid down in the Code of\nCriminal Procedure, 1898 (Act V of 1898); and\n(c)     a Magistrate appointed under section,14 shall have Jurisdiction to try offences\nas per the Fourth Schedule."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Power to make rules.",
      "content": "_(1) The Board may, make rules___\n(a)     regulating the functions and powers of the officers;\n(b)     regulating the classes and grades of, and the remuneration to be paid to, ___\n(i)     officers and members of the force and their conditions of service; and\n(ii)    generally for the purpose of carrying into effect the provisions of this\nOrdinance."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Power to make regulations",
      "content": "_The Commandant may, with the prior Approval in writing\nof the Chairman, make regulation consistent with this Ordinance and the rules for carrying out the\npurposes of this Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "Board of Trustees of the Port of Karachi as defined in Karachi Port Trust Act, 1886 (II of 1886);",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Karachi Port Trust and includes any Acting Chairman of the Trust as defined in the Karachi Port Trust Act, 1886 (II of 1886);",
      "source_provision": "sec2"
    },
    {
      "term": "Commandant",
      "definition": "any person appointed under section 4 as Commandant of the Port Security Force or any person for the time being performing duties of Commandant;",
      "source_provision": "sec2"
    },
    {
      "term": "custody",
      "definition": "the arrest and confinement of a person;",
      "source_provision": "sec2"
    },
    {
      "term": "Deputy Commandant",
      "definition": "any person appointed under section 4 as Deputy Commandant of the Port Security Force or any person for the time being performing duties of Deputy Commandant;",
      "source_provision": "sec2"
    },
    {
      "term": "Force",
      "definition": "the Port Security Force constituted and established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Magistrate",
      "definition": "a Magistrate appointed under this Ordinance; (viii) “member” means a person, other that an officer, who is appointed to the Force and has signed an affirmation in the form set out in the Third Schedule;",
      "source_provision": "sec2"
    },
    {
      "term": "officer",
      "definition": "a person who is so appointed to the Port Security Force and has signed an affirmation in the form set out in the Third Schedule;",
      "source_provision": "sec2"
    },
    {
      "term": "Port Area",
      "definition": "the Port Area specified in the First Schedule;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed under the rules or regulations under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "Regulation",
      "definition": "regulations made under this Ordinance; (xiii) “Rules” means rules made under this Ordinance; and",
      "source_provision": "sec2"
    },
    {
      "term": "Schedule",
      "definition": "the schedule to this Ordinance;",
      "source_provision": "sec2"
    }
  ]
}
