{
  "id": "pk-king-hamad-university-of-nursing-and-associated-medical-sciences-act-2025",
  "type": "statute",
  "title": "King Hamad University of Nursing and Associated Medical Sciences Act, 2025",
  "title_en": "King Hamad University of Nursing and Associated Medical Sciences Act, 2025",
  "short_name": "KHUON",
  "status": "in_force",
  "issued_date": "2025-12-14",
  "in_force_date": "2025-12-14",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tobA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of King Hamad University of Nursing and Associated Medical Sciences Act, 2025 (XXXIX of 2025) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, application and commencement",
      "content": "(1) This Act shall be called the King Hamad\nUniversity of Nursing and Associated Medical Sciences Act, 2025.\nIt shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) in this Act, unless there is anything repugnant in the subject or context:,\ni.      “Academic Council” means the Academic Council of the University;\nii.      “affiliated unit” means a college or an institute or any other unit affiliated to the\nUniversity, by Whatever name described by the University, but not managed, maintained,\nadministered by it;\niii.    “Authority” means any of the Authorities of the University specified or set up in terms of\nsection 18;\niv.     “Chancellor” means the Chancellor of the University;\nv.      “college” means a constituent college or an affiliated college;\nvi.     “Commission” means the Higher Education Commission set up under the Higher\nEducation Commission Ordinance, 2002 (LIII of 2002);\nvii.    “constituent unit” means a college or an institute or any other unit of the University, by\nwhatever name described by the University and managed, maintained and administered\nby it;\nviii.   “Dean” means the head of a Faculty, or the head of an academic body granted the status\nof a Faculty by this Act or by the Statutes or Regulations;\nix.     “Department” means a teaching department maintained and administered, or recognized\nby the University in the prescribed manner;\nx.      “Director” means the head of an institute;\nxi.     “Division concerned” means the Division to which the business of the University stands\nallocated;\nxii      “Faculty” means an administrative and academic unit of the University consisting of one\nor more departments, as prescribed;\nxiii.   “Government” means the Federal Government of the Islamic Republic of Pakistan;\nxiv.    “Institute” means a constituent institute or an affiliated institute;\nxv.     “prescribed” means prescribed by the Statutes, Regulations, or Rules made under this\nAct;\nxvi.    “Principal” means the head of a college;\nxvii.   “Registrar” “Controller of Examinations” and “Treasurer” mean respectively the\nRegistrar, Controller of Examinations and Treasurer of the University;\nxviii. “Representation Committees” means the Representation Committees constituted-under\nsection 25;\nxix.    “Registered Graduate” means a graduate of the Institute whose name has been entered in\nthe register maintained for the purpose;\nxx.     “Search Committee” means the Search Committee set up by the Senate under section 14;\nxxi,    “Senate” means the Senate of the University;\nxxii.   “Statutes”, “Regulations” and “Rules”, mean respectively Statutes, the Regulations, and\nthe Rules made under this Act;\nxxiii. “Syndicate” means the Syndicate of the University;\nxxiv. “Teachers” include Professors, Associate Professors, Assistant Professors, Lecturers and\nInstructors by the University or by a constituent affiliated or other associated unit and\nsuch other persons as may be declared or recongnized to be teachers in the prescribed\nmanner;\nxxv.    “University” means the King Hamad University of Nursing and Associated Medical\nSciences established under this Act;\nxxvi    “University Teacher” means a whole-time teacher appointed and paid by the University,\nor declared or recognized by the University as such; and\nxxvii. “Vice-Chancellor” means the Vice-Chancellor of the University."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment and incorporation of the university",
      "content": "(1) There shall be established a public\nsector University to be called the King Hamad University of Nursing and Associated Medical Sciences,\nIslamabad, in accordance with the provisions of this Act and shall consist of the following, namely:—\n(a)     the Chancellor, the Vice-Chancellor, and the members of the Senate;\n(b)     the members of the authorities of the University established under section 18;\n(c)     all the University teachers, professor emeritus, and persons recognized as students of the\nUniversity in accordance with terms prescribed time to time; and\n(d)     all other full-time officers and members of the staff of the University.\n(2) The University shall be a body corporate by the name of King Hamad University of Nursing\nand Associated Medical Sciences and shall have perpetual succession and a common seal and may sue\nand be sued by the said name.\n(3) The University shall be competent to borrow and lend money, to acquire and hold both\nmovable and immovable property, and to lease, sell off or otherwise transfer any movable and\nimmovable property which may have become vested in or been acquired by it, and to do all such activities\nas may be necessary for the purposes of its constitution.\n(4) Notwithstanding anything contained in any other law for the time being in force, the\nUniversity shall have academic, financial and administrative autonomy, including the power to employ\nofficers, teachers and other staff on such terms as may be prescribed, subject to the terms of this Act, or\nto the terms as may be provided in the laws of the competent professional accrediting and recognizing\ncouncils or other bodies, or the Commission. In particular, and without prejudice to the authority granted\nto the Commission by law, the Government or an authority or auditor appointed by the Government shall\nhave no power to question the policy underlying the allocation of resources approved by the Senate in\nthe annual budget of the University.\n(5) The University shall be liable to provide facilities to the representatives of the Commission,\nor such similar relevant organizations for visitation to enable them to verify that the University is\nmaintaining appropriate academic standards.\n(6) The University shall be required to strictly comply with the constitutional provisions,\nideology of Pakistan, law and abide by the social, religious, ethical and cultural ethos, values, and respect\ncultural and religious sensitivities.\n(7) The principal seat of the University shall be at Islamabad, and it may set up any number of\ncampuses at such other places in Pakistan and abroad with prior approval of the Senate and the\nCommission."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Purposes, functions and powers of the University",
      "content": "(1) The purposes of the University shall\nprimarily include the provision for teaching, research and advancement and dissemination of knowledge\nin the realm of nursing and other demanding subjects of the associated medical sciences in order to\nprepare trained human-capital proficient of adopting, adapting, emerging and evolving, conduct and\nthereby enabling the premier service standards and application of the technology in the particular areas\nand with the emphasis to address the needs of national economy including for the provision of policy\nformulation, instruction, training, research, demonstration, and development.\n(2) The University shall in general be an autonomous body with freedom to govern its academic,\nfinancial and administrative functions leading to its purposes and objectives but not contradictory to\nCommission’s guidelines and shall in particular have the following powers and functions, namely:\n(i)     provide for education and scholarship in the field of nursing and other demanding subjects\nof the associated medical sciences as it may deem fit;\n(ⅱ)     prescribe courses of studies to be conducted by it and its departments, colleges and\ninstitutes;\n(ⅲ)     prescribe such methods and strategies including for the virtual, online and open and\ndistance teaching and learning connected to the conduct and accomplishment of its\neducational, research and training programmes in order to ensure advancement and\nefficiency for its objectives in line with Commission's policies and guidelines;\n(iv)    hold examinations and to award and confer degrees, diplomas, certificates, and other\nacademic distinctions to and on the persons who have been admitted to and have passed\ntheir examinations under the prescribed conditions;\n(v)     confer degrees on the persons who have carried on independent research under prescribed\nconditions;\n(vi)    confer honorary degrees or other distinctions on approved persons in the prescribed\nmanner;\n(vii)   prescribe the terms and conditions of employment of the officers, teachers, and other\nemployees of the University;\n(viii)   engage, where necessary, persons on contracts of specified for a specific duration and to\nspecify the terms of each engagement;\n(ix)     provide such instructions for persons not being students of the University as it may\nprescribe and to grant certificates and diplomas to such persons;\n(x)      institute programmes for the exchange of students and teachers between the University\nand other universities, educational institutions, and research organizations, inside as well\nas outside Pakistan;\n(xi)     provide career counselling and job search services to students and alumni;\n(xii)    maintain linkages with the alumni;\n(xiii) develop and implement fund-raising plans;\n(xiv)    provide and support the academic and professional development of the faculty of the\nUniversity;\n(xv)     affiliate and disaffiliate colleges and institutes in the prescribed manner;\n(xvi)    admit colleges or institutes to its privileges and withdraw such privileges in the prescribed\nmanner;\n(xvii) inspect colleges and institutes affiliated to or associated with it, or seeking affiliation to\nor association with it;\n(xvii) provide a regulatory framework for its constituent, affiliated colleges and institutions\nencompassing policy formulation, admissions, registration, conduct of curricular\nactivities, examinations, and qualification awards;\n(xix)    frame and interpret its laws and policies and recognize and adapt the laws and policies of\nthe Commission, professional councils, recognizing bodies, Government organizations or\nother local and foreign institutions in the prescribed manner;\n(xx)     accept the examinations passed and the period of study spent by students of the University\nat other universities and places of learning equivalent to such examinations and periods\nof study in the University, as it may prescribe and to withdraw such acceptance;\n(xxi)    provide licensed and standardized educational and professional testing services in the\nprescribed manner;\n(xxii) co-operate and collaborate with other universities, public authorities, or private\norganizations, inside as well as outside Pakistan, in such manner and for such purposes\nas it may prescribe;\n(xxiii) institute professorships, associate professorships, assistant professorships and\nlectureships and any other posts and to appoint persons thereto in the prescribed manner;\n(xxiv) create upgrade, downgrade, re-designate or abolish posts for research, extension, training,\nadministration, and other related purposes and to appoint persons thereto;\n(xxv) recognize selected members of the teaching staff of affiliated colleges and institutes and\nassociated colleges and institutes admitted to the privileges of the University or such other\npersons as it may deem fit as University teachers;\n(xxvi) institute and award financial assistance to students in need, fellowships, scholarships,\nexhibitions, bursaries, medals and prizes under prescribed conditions;\n(xxvii) establish teaching departments, schools, colleges, faculties, institutes, libraries,\nlaboratories, museums, centres of excellence, and other centres of learning for the\ndevelopment of teaching and research and to make such arrangements for their\nmaintenance, management and administration as it may prescribe;\n(xxviii) provide for the residence of the students at the University and the colleges, to institute\nand maintain halls of residence and to approve or license hostels and lodging;\n(xxix) maintain order, discipline and security on its campuses and premises of its constituent\nunits;\n(xxx) provide framework and tools to plan, organize and then to monitor, sustain and spread\nstrategic changes for improvement in its actions and products leading to quality rating\nand best ranking;\n(xxxi) promote the co-curricular, extra-curricular and recreational activities of the students, and\nto make arrangements for promoting their health, wellbeing, and general welfare;\n(xxxii) demand and receive such fees and other charges as it may determine;\n(xxxiii) borrow and lend money for its purposes in the prescribed manner;\n(xxxiv) make provision for research, advisory or consultancy services and with these objects to\nenter into arrangements with other institutions, public or private bodies, commercial and\nindustrial enterprises under prescribed conditions;\n(xxxv) enter into, carry out, vary, or cancel contracts;\n(xxxvi) receive and manage property transferred and grants, contributions made to the University\nand to invest any fund representing such property, grants, bequests, trusts, gifts,\ndonations, endowments, or contributions in such manner as it may deem fit;\n(xxxvii) provide for the printing and publication of research and other works; and\n(xxxviii) do all such other acts and things, whether incidental to the powers aforesaid or not, as\nmay be requisite or expedient in order to further the objectives of the University as a place\nof education, learning and research."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. University open to all classes, creeds, etc",
      "content": "(1) The University shall be open to all persons\nof whatever religion, race, caste, creed, class, colour or domicile and no person shall be denied the\nprivileges of the University on the grounds of religion, race, caste, creed, class, colour or domicile.\n(2) An increase in any fee or charges that is in excess of ten percent per annum on an annualized\nbasis from the last such increase shall not be made except in special circumstances and only with the\napproval of the Chancellor.\n(3) The University shall institute financial aid programmes for the students in need, to the extent\nconsidered feasible by the Senate given the resources available, so as to enable admission and access to\nthe University and various opportunities provided by it to be based on merit rather than ability to pay:\nProvided that the University may institute self-finance schemes not covering more than ten\npercent of the total number, of candidates in any on-campus taught course, training activity or research-\nbased programme."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Teaching at the University",
      "content": "(1) All recognized teaching in various courses shall be\nconducted by the University or by its colleges and institutes in the prescribed manner and may include\nlectures, tutorials, discussions, seminars, demonstrations, open and distance learning, and other methods\nof instruction as well as practical work, clerkship and training in the laboratories, hospitals, clinical\nsettings, workshops and other governmental or private organizations and workplaces.\n(2) The objective of all the teaching shall be to lay emphasis on seeking of the knowledge and\naspiration for the development and the social and cultural values of Pakistan rather than only on the\nexaminations and qualifying for the awards, and thereby in addition to the formal education non-credit\ncourses, classes, seminars, colloquia, expeditions, or workshops etc. may be determined and organized\nby the University.\n(3) The courses and curricula shall be as may be prescribed and in all the bachelor’s level degree\nprogrammes offered in Pakistan, a discipline to be called the Islamic studies and Pakistan studies shall\nbe compulsory for the Muslim students, and non-Muslim students shall, in lieu of such discipline, have\nthe option to undertake ethics and Pakistan studies.\n(4) The authority responsible for organizing recognized teaching shall be such as may be\nprescribed."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Administrative Division",
      "content": "The Division concerned shall be the sponsoring and administrative\ndivision of the University to coordinate the processes and grants as may be desired by the University\nfrom time to time for its purposes."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Principal officers",
      "content": "The following shall be the principal officers of the University, namely:—\n(a)     the Chancellor,\n(b)     the Vice-Chancellor;\n(c)     The Deans;\n(d)     the Principals of the constituent colleges;\n(e)     the Directors of the constituent Institutes;\n(f)     the Chairpersons or Heads of the teaching departments;\n(g)     the Registrar;\n(h)     the Treasurer;\n(i)     the Controller of Examinations;\n(j)     the Director, Research Innovation and Commercialization;\n(k)     the Director, Quality Enhancement Cell;\n(l)     the Resident Auditor;\n(m)     the Librarian; and\n(n)     such other parsons as may be prescribed by Statutes or Regulations to be the principal\nofficers of the University."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Chancellor",
      "content": "(1) The President of the Islamic Republic of Pakistan shall be the Chancellor of\nthe University and the Chairperson of the Senate.\n(2) The Chancellor shall, when present, preside over the meetings of the Senate and the\nconvocation of the University.\n(3) The members of the Senate as well as the Vice-Chancellor shall be appointed by the\nChancellor from amongst the persons recommended by the Representation Committee set up for this\npurpose or the Search Committee established in accordance with this Act and the Statutes, as the case\nmay be, along with those elected.\n(4) Every proposal to confer an honorary degree shall be subject to confirmation by the\nChancellor.\n(5) If the Chancellor is satisfied that serious irregularity or mismanagement with respect to the\naffairs of the University has occurred, he may.\n(a)     as regards the proceedings of the Senate, direct that specified proceedings be\nreconsidered, and appropriate action taken within one month of the direction having been\nissued:\nProvided that if the Chancellor is satisfied that either no reconsideration has been\ncarried out or that the reconsideration has failed to address the concern expressed, he/she\nmay, after calling upon the Senate to show cause in writing, appoint a five-member\nReview Panel to examine and report to the Chancellor on the functioning of the Senate.\nThe report of the Review Panel shall be submitted within such time as may be determined\nby the Chancellor, The Review Panel shall be drawn from persons of eminence in\nacademic and in the fields of law, nursing, accountancy and administration or other such\nperson of eminence as deemed appropriate by the Chancellor; and\n(b)     as regards the proceedings of any Authority or with respect to the matters within the\ncompetence of any Authority other than the Senate, direct the Senate to exercise powers\nunder section 20."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Removal from the Senate",
      "content": "(1) The Chancellor may, upon the recommendation of the\nReview Panel, remove any person from the membership of the Senate on the grounds that such a person:\n(a)     has been declared by a competent court of law to have become of unsound mind; or\n(b)     has been declared by a competent medical board to have become incapacitated to function\nas member of the Senate; or\n(c)     has absented himself from two consecutive meetings of the Senate without a just cause;\nor\n(d)     has been guilty of misconduct, including use of position for personal advantage of any\nkind, or gross inefficiency in the performance of functions; or\n(e)     has been convicted by a competent court of law for an offence involving moral turpitude.\n(2) The Chancellor may remove any person from membership of the Senate also on a resolution\ncalling for the removal of such person supported by at least three-fourths of the membership of the\nSenate:\nProvided that before passing such a resolution, the Senate shall provide the members concerned\nwith a fair hearing:\nProvided further that the provisions of this section shall not be applicable to the Vice-Chancellor\nin his/her capacity as a member of the Senate."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Revisional powers of the Chancellor",
      "content": "The Chancellor may, of his own motion or on the\nrequest of Commission or otherwise, call for and examine the record of any proceedings in which an\norder has been passed by any Authority, for the purpose of satisfying himself as to the correctness,\nlegality or propriety of any finding or order and may pass such order as he may deem fit:\nProvided that no order under this section shall be passed unless the person to be effected thereby\nis afforded an opportunity of being heard."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Visitation",
      "content": "(1) The Chancellor may cause an inspection or inquiry to be made in respect of\nany matter connected with the affairs of the University and shall, from time to time, appoint such a person\nor persons as he may deem fit for the purpose of carrying out inspection of:—\n(a)     the University, its campuses, buildings, laboratories, libraries, museums, workshops or\nequipment;\n(b)     any college, institute, department, hospital or hostel, etc. maintained, managed,\nadministered, recognized or licensed by or affiliated to or associated with the University;\n(c)     the curriculum, teaching, research, services and other matters of the University; and\n(d)     the conduct of examinations held by the University.\n(2) The Chancellor shall give notice to the Senate of his intention to cause an inspection or inquiry\nto be made under sub-section (1) and the Syndicate shall be entitled to be represented thereat.\n(3) The Chancellor shall communicate to the Senate his views with regard to the results of such\nan inspection or inquiry made under sub-section (1), and shall, after ascertaining the views of the\nSyndicate thereon, advise the Senate on the action to be taken by it.\n(4) The Senate shall, within such time as may be specified, communicate to the Chancellor such\nan action, if any, as has been taken or may be proposed to be taken upon the results of the inspection or\ninquiry communicated to it under sub-section (3).\n(5) Where the Senate fails, within the specified time, to take action to the satisfaction of the\nChancellor, he may, after considering any explanation furnished or representation, if any, made by the\nSenate, issue such directions as he thinks fit and the Vice-Chancellor shall comply with such directions."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Vice",
      "content": "Chancellor.—(1) There shall be a Vice-Chancellor of the University who shall be a\nvisionary academic or a distinguished administrator with proven leadership qualities, administrative\ncapabilities as well as teaching and research credentials and having qualification in the relevant field,\nthereby preference accorded to the doctoral degree holder in the relevant field and shall be appointed on\nsuch terms and conditions as may be prescribed.\n(2) The Vice-Chancellor shall be the chief executive officer of the University responsible for all\nadministrative and academic functions of the University and for ensuring that the provisions of this Act,\nStatutes, Regulations and Rules are faithfully observed in order to promote general efficiency and good\norder of the University. The Vice-Chancellor shall have all powers necessary for this purpose, including\nadministrative control over the officers, teachers, and other employees of the University in the prescribed\nmanner.\n(3) The Vice-Chancellor shall, in the absence of the Chancellor, preside over the convocation of\nthe University and be entitled to attend any meeting of any other Authority or body of the University.\n(4) The Vice-Chancellor may, in an emergency that in his/her opinion requires immediate action\nordinarily not in the competence of the Vice-Chancellor, take such action and forward, within seventy-\ntwo hours, a report of the action taken to the members of the Emergency Committee of the Senate, to be\nset up by the Statutes. The Emergency Committee may direct such further action so it may consider\nappropriate.\n(5) The Vice-Chancellor shall also have the following powers and duties, namely:\n(a)     to direct teachers, officers and other employees of the University to take up such\nassignments. In connection with teaching, research, examination, administration and such\nother, activities in the University as he may consider appropriate;\n(b)     to sanction by re-appropriation an amount not exceeding an amount prescribed by the\nSenate for an unforeseen item not provided for in the budget and report it to the Senate at\nthe next meeting;\n(c)     to make appointments of such categories of employees of the University and in such\nmanner as may be prescribed by the Statutes;\n(d)     to create and fill temporary posts for a period not exceeding six months;\n(e)     to suspend, punish or remove from service, in accordance with the prescribed procedure,\nthe officers, teachers, or other employees of the University except those appointed by or\nwith the approval of the Senate;\n(f)     to delegate, subject to such conditions as may be prescribed, any of his/her powers under\nthis Act to an officer or officers of the University; and\n(g)     to exercise and perform such other powers and duties as may be prescribed.\n(6) The Vice Chancellor shall present an annual report before the Senate within six months of the\nclose of the financial year of the University in such forms as may be prescribed. The annual report shall\npresent such information as regards the financial year under review, including disclosure of all relevant\nfacts pertaining to the academic, research, administration and financial affairs of the University, The\nVice-Chancellors annual report shall be made available, prior to its presentation before the Senate, to all\nthe officers and teachers and shall be published in paper as well as in electronic farm in such number and\nmanner as a wider circulation is ensured to the maximum possible extent."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Appointment and removal of the Vice",
      "content": "Chancellor.—(1) The Vice-Chancellor shall be\nappointed by the Chancellor on the basis of recommendations made by the Senate.\n(2) A Search Committee for the recommendation of persons suitable for appointment as Vice-\nChancellor shall be constituted by the Senate on the date and in the manner prescribed by the Statutes\nand shall consist of two eminent members of the society nominated by the Chancellor of whom one shall\nbe appointed as the Convener, two members of the Senate, two distinguished University Teachers who\nare not members of the Senate, and one academic of eminence not employed by the University. The\nSenate shall prescribe, for the selection and appointment of the two distinguished University Teachers\non the Search Committee, a process that provides for the recommendation of suitable names by the\nUniversity Teachers in general. The Search Committee shall remain intact for its purposes till such a\ntime that the appointment of the Vice-Chancellor has been made by the Chancellor and notified.\n(3) The persons proposed by the Search Committee for appointment as the Vice-Chancellor shall\nbe considered by the Senate and of these a panel of three, in order of priority, shall be recommended by\nthe Senate to the Chancellor, Provided that the Chancellor may decline to appoint any of the three persons\nrecommended and seek recommendation for a fresh panel. In the event of a fresh recommendation being\nsought by the Chancellor, the Search Committee shall make a proposal to the Senate in the prescribed\nmanner.\n(4) The Vice Chancellor shall be appointed for a renewable tenure of four years on the terms and\nconditions prescribed by the Statute. The tenure of an incumbent Vice-Chancellor may be renewed by\nthe Chancellor on receipt of a resolution of the Senate in support of such renewal:\nProvided that the Chancellor may call upon the Senate to reconsider such a resolution once.\n(5) The Senate may, pursuant to a resolution in this behalf passed by three-fourths of its total\nmembership, recommend to the Chancellor the removal of the Vice-Chancellor on the grounds of\ninefficiency, moral turpitude or physical or mental incapacity or gross misconduct, including misuse of\nposition for personal advantage of any kind:\nProvided that the Chancellor may make a reference to the Senate stating the instances of\ninefficiency, moral turpitude or physical or mental incapacity or gross misconduct on the part of the\nVice-Chancellor that have come to his notice. After consideration of the reference, the Senate may,\npursuant to a resolution in this behalf passed by two-thirds of its total membership, recommend to the\nChancellor the removal of the Vice-Chancellor:\nProvided further that prior to a resolution for the removal of the Vice-Chancellor being voted\nupon, the Vice-Chancellor shall be given a fair opportunity of being heard.\n(6) A resolution recommending the removal of the Vice-Chancellor shall be submitted to the\nChancellor forthwith. The Chancellor may accept the recommendation and order the removal of the\nVice-Chancellor or return the recommendation to the Senate.\n(7) At any time when the office of the Vice-Chancellor is vacant, or the Vice-Chancellor is absent\nor is unable to perform the functions of his/her office due to illness or some other cause, the Senate shall\nmake such arrangements for performance of duties of the Vice-Chancellor as it may deem fit."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Registrar",
      "content": "(1) There shall be a Registrar of the University to be appointed by the Senate on\nthe recommendation of the Selection Board, on such terms and conditions as may be prescribed.\n(2) The experience as well as the professional and academic qualifications necessary for\nappointment to the post of Registrar hall be such as may be prescribed.\n(3) The Registrar shall be a full-time officer of the University and shall:—\n(a)     be the administrative head of the secretariat of the University and be responsible for\nprovision of secretarial support to the Authorities of the University;\n(b)     be the custodian of the common seal and the academic records of the University;\n(c)     maintain a register of registered graduates in the prescribed manner;\n(d)     supervise the process of election, appointment or nomination of members to the various\nauthorities and other bodies in the prescribed manner; and\n(e)     perform such other duties as may be prescribed.\n(4) The term of office of the Registrar shall be a renewable period of three years:\nProvided that the Senate may, on the advice of the Vice-Chancellor, terminate the appointment\nof the Registrar on grounds of inefficiency or misconduct in accordance with the prescribed procedure.\n(5) When the office of the Registrar is vacant or the Registrar is absent or unable to perform the\nfunctions of his office due to illness or some other cause, the Senate shall make temporary arrangements\nfor performance of duties of the Registrar for a period not exceeding six months during which the regular\nRegistrar shall be appointed."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Treasurer",
      "content": "(1) There shall be a Treasurer of the University to be appointed by the Senate\non the recommendation of the Selection Board, on such terms and conditions as may be prescribed.\n(2) The experience and the professional and academic qualifications necessary for appointments\nto the post of the Treasurer shall be such as may be prescribed.\n(3) The Treasurer shall be the chief financial officer of the University.\n(4) The Treasurer shall be the full-time officer of the University and shall,—\n(a)     manage the assets and financial liabilities, receipts, expenditure, funds, and investments\nof the University;\n(b)     prepare the annual and revised budget estimates of the University and present them to the\nSyndicate or a committee thereof for approval and incorporation in the budget to be\npresented to the Senate;\n(c)     ensure that the funds of the University are expended on the purposes for which they are\nallocated;\n(d)     have the accounts of the University audited annually so as to be available for submission\nto the Senate within six months of the close of the financial year, and\n(e)     perform such other duties as may be prescribed.\n(5) The term of office of the Treasurer shall be a renewable period of three years:\nProvided that the Senate may, on the advice of the Vice-Chancellor, terminate the appointment\nof the Treasurer on grounds of inefficiency or misconduct in accordance with the prescribed procedure.\n(6) When the office of the Treasurer is vacant or the Treasurer is absent or unable to perform his\nfunctions owing to any cause, the Senate shall make temporary arrangements for the performance of\nduties of the Treasurer, but the period of such temporary arrangements shall not exceed six months and\nthe regular Treasurer shall be appointed during that period."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Controller of Examinations",
      "content": "(1) There shall be a Controller of Examinations, to be\nappointed by the Senate on the recommendation of the Selection Board, on such terms and conditions as\nmay be prescribed.\n(2) The minimum qualifications necessary for appointment to the post of the Controller of\nExaminations shall be as such may be prescribed.\n(3) The Controller of Examinations shall be a full-time officer of the University and shall be\nresponsible for all matters connected with the conduct of examinations and shall perform such other\nduties as may be prescribed.\n(4) The Controller of Examinations shall be appointed for a renewable term of three years:\nProvided that the Senate may, on the advice of the Vice-Chancellor, terminate the appointment\nof the Controller of Examinations on grounds of inefficiency or misconduct in accordance with\nprescribed procedure.\n(5) When the office of the Controller of Examination is vacant or the Controller of Examination\nis absent or unable to perform his functions owing to any cause, the Senate shall make temporary\narrangements for performance of duties of the Controller of Examination, but the period of such\ntemporary arrangements shall not exceed six months and the regular Controller of Examinations shall be\nappointed during that period."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Authorities",
      "content": "(1) The following shall be the Authorities of the University, namely:\n(a)    Authorities established by this Act shall be,—\n(i)   Senate;\n(ii) Syndicate; and\n(iii) Academic Council;\n(b)     Authorities to be established by the Statutes shall be,—\n(i)       Search Committee for appointment of the Vice-Chancellor;\n(ii)      Emergency Committee of the Senate;\n(iii)     Board of Advanced Studies and Research;\n(iv)      Board of Faculty;\n(v)       Board of Studies;\n(vi)      Selection Board;\n(vii)     Affiliation Committee;\n(viii)    Finance and Planning Committee;\n(ix)      Discipline Committee; and\n(x)       Representation Committees for appointment of members to the Senate,\nSyndicate, Academic Council, and other Authorities of the University.\n(2) The Senate, the Syndicate, or the Academic Council may set up such other committees or\nsub-committees, by whatever name described, as are considered desirable through Statutes or\nRegulations or Rules as may be appropriate. Such boards, committees or sub-committees shall be\nAuthorities of the University for the purposes of this Act."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Senate",
      "content": "(1) The body responsible for the governance of the University shall be described as\nthe Senate, which shall consist of the following, namely:\n(a)    the Chancellor who shall be the Chairperson of the Senate;\n(b)    the Vice-Chancellor;\n(c)    one member of the Government not below the rank of Additional Secretary or equivalent\nfrom the division to which business of health stands allocated;\n(d)    one member of the Government not below the rank of Additional Secretary or equivalent\nfrom the Division concerned or any other department relevant to the special focus of the\nUniversity;\n(e)    four persons from society at large being persons of distinction in the fields of nursing,\nallied health sciences, medical education, science and technology, administration,\nmanagement, law, and accountancy, such that the appointment of these persons reflects a\nbalance across the various fields for the purposes of functions of the University:\nProvided that the special focus or affiliation of the University, to be declared in\nthe manner prescribed, may be reflected in the number of persons of distinction in an area\nof expertise relevant to the University;\n(f)    one person from amongst the alumni of the University;\n(g)    two persons from the academic community of the country, other than an employee of the\nUniversity, at the level of Professor or Principal of a college;\n(h)    four University Teachers, including one Professor, one Associate Professor, one Assistant\nProfessor and one Lecturer to be elected by teachers of their respective cadres from\namongst themselves;\n(i)    one person nominated by the Commission;\n(j)    one person nominated by the Embassy of the Kingdom of Bahrain in Pakistan;\n(k)    one person nominated by Pakistan Nursing Council; and\n(1)    one person nominated by Allied Health Professionals Council;\n(2) All appointments to the Senate shall be made by the Chancellor.\n(3) The number of the members of the Senate described against clauses (f) to (i) of sub-section\n(1) may be increased by the Senate through Statutes subject to the condition that the total membership\nof the Senate does not exceed twenty-one, with a maximum of five teachers, and the increase is balanced,\nto the extent possible, across different categories specified in sub-section (1).\n(4) All appointments to the Senate shall be made by the Chancellor. Appointments of persons\ndescribed in clauses (f) and (g) of sub-section (1) shall be made from amongst a panel of three names for\neach vacancy recommended by the Representation Committee set up in terms of section 25 and in\naccordance with procedure as may be prescribed:\nProvided that efforts shall be made, without compromising on quality or qualification, to give\nfair representation to women on the Senate:\nProvided further that as regards the University teachers described in clause (h) of sub-section (1),\nthe Senate shall prescribe a procedure for appointment on the basis of elections that provide for voting\nby the various categories of University teachers:\nProvided also that the Senate may alternatively prescribe that appointment of University teachers\nto the Senate shall also be in the manner provided by this sub-section for the persons described in clauses\n(f) and (g) of sub-section (1).\n(5) Members of the Senate, other than ex-officio members, shall hold office for three years. One-\nthird of the members, other than ex-officio members, of the first Senate, to be determined by lot, shall\nretire from office on the expiration of one year from the date of appointment, One-half of the remaining\nmembers, other than ex-officio members, of the first Senate, to be determined by lot, shall retire from\noffice on the expiration of two years from the date of appointment, and the remaining one-half, other\nthan ex-officio members, shall retire from office on the expiration of the third year:\nProvided that no person, other than an ex-officio member, may serve on the Senate for more than\ntwo consecutive terms:\nProvided further that the University teachers appointed to the Senate may not serve for two\nconsecutive terms:\nProvided also that effort shall be made, without compromising on quality or qualification, to give\nfair representation to women on the Senate.\n(6) The Senate shall meet at least twice in a calendar year.\n(7) Service on the Senate shall be on an honorary basis:\nProvided that actual expenses may be reimbursed as may be prescribed.\n(8) The Registrar shall be the secretary of the Senate.\n(9) In the absence of the Chancellor, meetings of the Senate shall be presided over by such\nmembers, not being an employee of the University or the Government, as the Chancellor may, from time\nto time, nominate. The nominated members shall preside over the meeting of the Senate.\n(10) Unless otherwise prescribed by this Act, all decisions of the Senate shall be taken on the\nbasis of the opinion of the majority of the members present. In the event of the members being evenly\ndivided on any matter, the person presiding over the meeting shall have a casting vote.\n(11) The quorum for a meeting of the Senate shall, be two-thirds of its total membership, a\nfraction being counted as one."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Powers and functions of the Senate",
      "content": "(1) The Senate shall have the power of general\nsupervision over the University and shall hold the Vice-Chancellor and the other Authorities accountable\nfor all the functions of the University. The Senate shall have all powers of the University not expressly\nvested in an Authority or any officer by this Act and all other powers, not expressly mentioned by this\nAct that are necessary for the performance of Its functions, namely:\n(2) Without prejudice to the generality of the foregoing powers, the Senate shall have the\nfollowing powers and functions:\n(a)     to approve the proposed annual plan of work, the annual and revised budgets, the annual\nreport, and the annual statement of accounts;\n(b)     to hold, control and lay down policy for the administration of the property, funds, and\ninvestments of the University, including the approval of the sale and purchase or\nacquisition of the immovable property;\n(c)     to oversee the quality and relevance of the University’s academic programmes and to\nreview the academic affairs of the University in general;\n(d)     to approve the appointment of the Deans, Principals, Directors, Chairpersons or Heads of\nthe Departments and other Principal Officers and Senior Administrators as may be\nprescribed;\n(e)     to approve strategic plans;\n(f)     to approve financial resource development plans of the University;\n(g)     to consider and approve the drafts of Statutes and Regulations proposed by the Syndicate\nand the Academic Council and deal with them in the manner as provided for in sections\n28 and 29, as the case may be:\nProvided that the Senate may frame Statutes or Regulations on its own initiative\nand approve them after calling for the advice of the Syndicate or the Academic Council,\nas the case may be;\n(h)     to annul by order in writing the proceedings of any Authority or officer if the Senate is\nsatisfied that such proceedings are not in accordance with the provisions of this Act,\nStatutes or Regulations or Rules after calling upon such Authority or officer to show cause\nwhy such proceedings should not be annulled;\n(i)     to recommend to the Chancellor, removal of any member of the Senate in accordance\nwith the provisions of this Act;\n(j)     to make appointments of members of the Syndicate, other than ex officio members, in\naccordance with the provisions of this Act;\n(k)    to make appointment of members of the Academic Council, other than ex officio\nmembers, in accordance with the provisions of this Act;\n(l)    to appoint emeritus Professors on such terms and conditions as may be prescribed;\n(m)    to determine the form, provide for the custody and regulate the use of the common seal\nof the University;\n(n)    to remove any person from the membership of any Authority if such person:-\n(i)     has been by a competent court of law declared to have become of unsound mind;\nor\n(ii)    has been by a competent medical board declared to have become incapacitated to\nfunction as member of such Authority; or\n(iii)   has been by a competent court of law convicted for an offence involving moral\nturpitude; and\n(o)    to perform such other functions and to exercise such other powers as may be prescribed\nby Statutes.\n(3) The Senate may, subject to the provisions of this Act delegate all or any of the powers and\nfunctions of any Authority, committee, officer or employee of the University at its main campus, to any\nAuthority, committee, officer or employee at its additional or sub-campus of the University for the\npurpose of exercising such powers and performing such functions in relation to such additional or sub-\ncampus, and for this purpose the Senate may create new posts or positions at the additional or sub-\ncampus."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Syndicate",
      "content": "(1) There shall be a Syndicate of the University consisting of the following,\nnamely:\n(a)    the Vice-Chancellor who shall be its Chairperson;\n(b)    the Deans of Faculties of the University;\n(c)    three Professors from different departments, who are not members of the Senate, to be\nelected by the University Teachers in accordance with procedure to be prescribed by the\nSenate;\n(d)    the Principals and Directors of the constituent units;\n(e)    one Principal or Director of the affiliated or associated units elected by them from\namongst themselves to be the member of the Syndicate and appointed by the Vice-\nChancellor;\n(f)    the Registrar;\n(g)    the Treasurer;\n(h)     the Controller of Examinations;\n(i)     the Director, Research Innovation and Commercialization; and\n(j)     the Director, Quality Enhancement Cell.\n(2) Members of the Syndicate, other than ex officio members, shall hold office for three years.\n(3) As regards the three Professors described in clause (c) of sub-section (1) the Senate may, as\nan alternative to elections, prescribe a procedure for proposal of a panel of names by the Representation\nCommittee set up in terms of section 25. Appointment of persons proposed by the Representation\nCommittee may be made by the Senate on the recommendation of the Vice-Chancellor.\n(4) The quorum for a meeting of the Syndicate shall be one-half of the total number of members,\na fraction being counted as one.\n(5) The Registrar shall also act as Secretary of the Syndicate.\n(6) The Director, Quality Enhancement Cell shall be the non-voting member.\n(7) The Syndicate shall meet at least once in each quarter of the year.\n22 Powers and functions of the Syndicate.—(1) The Syndicate shall be the executive body of\nsupervision over the affairs and management of the University.\n(2) Without prejudice to the generality of the foregoing powers and subject to the provisions of\nthis Act, the Statutes, the Regulations and the directions of Senate, the Syndicate shall have the following\nfunctions and powers, namely:\n(a)     to consider the annual report, the annual end revised budget estimates and to submit these\nto the Senate;\n(b)     to transfer and accept transfer of movable property on behalf of the University;\n(c)     to enter into, vary, carry out and cancel contracts on behalf of the University;\n(d)     to cause proper books of account to be kept for all sums of money received and expended\nby the University and for the assets and liabilities of the University;\n(e)     to invest any money belonging to the University including any unapplied income in any\nof the securities described in section 20 of the Trusts Act, 1882 (Act II of 1882), or in the\npurchase of immovable property or in such other manner, as it may prescribe, with the\nlike power of varying such investments;\n(f)    to receive and manage any property transferred and grants, bequests, trust, gifts,\ndonations, endowments, and other contributions made to the University;\n(g)    to administer any funds placed at the disposal of the University for specified purposes;\n(h)    to provide the buildings, libraries, premises, furniture, apparatus, equipment and other\nmeans required for carrying out the work of the University;\n(i)    to establish and maintain halls of residence and hostels or approve or license hostels or\nlodgings for the residence of students;\n(j)    to recommend to the Senate affiliation or disaffiliation of colleges and institutes;\n(k)    to recommend to the Senate the admission of institutes to the privileges of the University\nand withdrawal of such privileges;\n(l)    to arrange for the inspection of colleges, institutes, or departments;\n(m)    to institute professorships, associate professorships, assistant professorships, lectureships,\nand other teaching posts or to suspend or to abolish such posts;\n(n)    to appoint Professors, Associate Professors, Assistant Professors, Lecturers, and other\nteachers on the already approved posts;\n(o)    to create, suspend or abolish such administrative or other posts as may be necessary;\n(p)    to prescribe the duties of officers, teachers, and other employees of the University;\n(q)    to report to the Senate on matters with respect to which it has been asked to report;\n(r)    to appoint members to various Authorities in accordance with the provisions of this Act\nor by Statutes;\n(s)    to propose drafts of Statutes and Regulations for submission to the Senate;\n(t)    to regulate the conduct and discipline of the students of the University;\n(u)    to take actions necessary for the good administration of the University in general and to\nthis end exercise such powers as are necessary;\n(v)    to appoint one or more legal advisors or engage a legal advisory firm upon\nrecommendation of the Vice-Chancellor for a period of three years on a regular basis and\non such terms and conditions and may be determined by it;\n(w)    to delegate any of its powers to any Authority or officer or a committee in the prescribed\nmanner; and\n(x)    to perform such other functions and exercise such other powers as prescribed by this Act\nor by Statutes."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Academic Council",
      "content": "(1) There shall be an Academic Council of the University consisting\nof the following, namely:—\n(a)     the Vice-Chancellor who shall be its Chairperson;\n(b)    the Deans of faculties and such Heads of departments as may be prescribed;\n(c)    five members representing the departments, colleges, or institutes to be elected in the\nmanner prescribed by the Senate;\n(d)    two Principals or Directors of the affiliated or associated units elected by them from\namongst themselves to be the member of the Academic Council and appointed by the\nVice-Chancellor;\n(e)    five Professors including Emeritus Professors;\n(f)    the Registrar;\n(g)    the Controller of Examinations;\n(h)    the Director, Research, innovation and Commercialization;\n(i)    the Director, Quality Enhancement Cell;\n(j)    the Nominee of the Commission; and\n(k)    the Librarian.\n(2) The Senate shall appoint the members of the Academic Council, other than the ex-officio and\nthe elected members, upon the recommendation of the Vice-Chancellor:\nProvided that as regards the five professors and the members representing the departments,\ninstitutes and the constituent colleges or institutes; the Senate may, as an alternative to elections,\nprescribe a procedure for proposal of a panel of names by the Representation Committee set up in terms\nof section 25, Appointment of persons proposed by the Representation Committee may be made by the\nSenate upon the recommendation of the Vice-Chancellor.\n(3) Members of the Academic Council, other than ex-officio members, shall hold office for three\nyears.\n(4) The Registrar shall also act as Secretary of the Academic Council,\n(5) The Academic Council shall meet at least once in each quarter of the year.\n(6) The quorum for meetings of the Academic Council shall be one half of the total number of\nmembers, a fraction being counted as one."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Powers and functions of the Academic Council",
      "content": "(1) The Academic Council shall be the\nprincipal academic body of the University and shall, subject to the provisions of this Act, the Statutes\nand Regulations, have the power to lay down proper standards of instruction, research, and examinations,\nand to regulate and promote the academic life of the University and its various academic units.\n(2) Without prejudice to the generality of the foregoing powers, and subject to the provisions of\nthis Act and the statutes the Academic Council shall have the following powers and functions, namely:\n(a)     to approve the policies and procedures pertaining to the quality of academic\nprogrammes;\n(b)     to approve academic programmes;\n(c)     to consider the feasibility plan to launch academic programmes;\n(d)     to approve the policies and procedures pertaining to student related functions\nincluding, admissions, registration, attendance, supervision, advisement,\nplagiarism, expulsions, punishments, examinations, and qualification awards;\n(e)     to approve the policies and procedures assuring quality of teaching and research;\n(f)     to recommend the policies and procedures for affiliation of other institutes;\n(g)     to propose to the Syndicate schemes for the constitution and organisation of\nfaculties, colleges, institutes, teaching departments and boards of studies;\n(h)     to institute programmes for the continued professional development of University\nTeachers at all levels;\n(i)     to frame Regulations for submission to the Syndicate or Senate as the case may\nbe;\n(j)     to prepare an annual, report on the academic performance of the University; and\n(k)     to perform such other functions and exercise such other powers as may be\nprescribed by Statutes or Regulations."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Representation Committees",
      "content": "(1) There shall be a Representation Committee constituted\nby the Senate through statutes for recommendation of persons for appointment to the Senate in\naccordance with the provisions of section 19.\n(2) There shall also be a Representation Committee constituted by the Senate through Statutes\nfor the recommendation of persons for appointments to the Syndicate and the Academic Council in\naccordance with the provisions of sections 22 and 24.\n(3) Members of the Representation Committee for appointments to the Senate shall consist of the\nfollowing, namely:-\n(a)     three members of the Senate who are not University Teachers:\nProvided that one of these three members shall also act as Chairperson of the\nRepresentation Committee to be appointed by the Chancellor; and\n(b)     two persons nominated by the University Teachers from amongst themselves in\nthe mariner prescribed;\n(c)     one person from the academic community, not employed by the University, at the\nlevel of professor or college principal to be nominated by the University Teachers\nin the manner prescribed; and\n(d)    one eminent citizen with experience in administration, philanthropy, development\nwork, law, nursing, allied health/medical sciences, or accountancy to be\nnominated by the Senate.\n(4) The Representation Committee for appointments to the Syndicate and the Academic Council\nshall consist of the following:\n(a)    two members of the Senate who are not University Teachers. Provided that one of\nthese two members shall also act as Chairperson of the Representation Committee\nto be appointed by the Chancellor; and\n(b)    three persons nominated by the University Teachers from amongst themselves in\nthe manner prescribed.\n(5) The tenure of the Representation Committees shall be three years:\nProvided that no member shall serve for more than two consecutive terms.\n(6) The procedures of the Representation Committees shall be as may be prescribed.\n(6) There may also be such other Representation Committees set up by any of the other\nAuthorities cif the University as are considered appropriate for recommending persons for appointment\nto the various Authorities and other bodies of the University."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Appointment of committees by certain Authorities",
      "content": "(1) The Senate, Syndicate, Academic\nCouncil, and other Authorities may, from time to time, appoint such standing, special or advisory\ncommittees, as they may deem fit, and may appoint on such committee the persons who are not the\nmembers of the Authorities appointing these committees.\n(2) The constitution, functions, and powers of the Authorities for which no specific provision has\nbeen made in this Act shall be such as may be prescribed by Statutes or Regulations.\nSTATUTES, REGULATIONS AND RULES"
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Statutes",
      "content": "(1) Subject to the provisions of this Act, the Statutes may be made to regulate or\nprescribe all or any of the following matters, namely:-\n(a)    the contents of and the manner in which the annual report is to be presented by\nthe Vice-Chancellor before the Senate shall be prepared;\n(b)    the institution of schemes, directions and guidelines for the terms and conditions\nof appointment of alt officers, teachers, and other employees of the University;\n(c)    the powers and duties of officers, teachers, and other employees of the University;\n(d)    the scales of pay and other terms and conditions of service of officers, teachers,\nand other employees of the University;\n(e)     the constitution of pension, insurance, gratuity, provident fund, benevolent fund\nand other fringe benefits for officers, teachers, and other employees of the\nUniversity;\n(f)     the conditions for appointment of Emeritus Professors and award of honorary\ndegrees:\n(g)     the efficiency and discipline of University employees;\n(h)     the fee and other charges related to admissions, registration, tuition, examinations,\nresearch provisions, residence, certifications, training, etc.;\n(i)     the maintenance of the register of registered graduates;\n(j)     the establishment and abolition of faculties, departments, institutes, colleges and\nother academic and administrative divisions or units;\n(k)     the affiliation and disaffiliation of institutes and related matters;\n(l)     the admission of institutes to the privileges of the University and the withdrawal\nof such privileges;\n(m)     the acquisition and administration of properties, assets and investment of the\nUniversity and its various units;\n(n)     the conditions under which the University may enter into arrangements with other\ninstitutions or with public bodies for purposes of research and advisory services;\n(o)     the conduct of elections for membership of. the -Authorities of the University and\nrelated matters;\n(p)     the constitution and procedure to be followed by Representation Committees in\ncarrying out their functions in terms of this Act;\n(q)     the constitution and procedure to be followed by the Search Committee for\nappointment of the Vice-Chancellor,\n(r)     constitution, restructuring, functions, and powers of the Authorities of the\nUniversity:\nProvided that the Syndicate shall not propose a draft statute to the Senate, affecting the\nconstitution, functions, or powers of any Authority, until such Authority has been given an opportunity\nof expressing an opinion in writing upon the proposals; and\n(s)     all other matters which by this Act are to be or may be prescribed or regulated by\nStatutes.\n(2) The draft of Statutes shall be proposed by the Syndicate to the Senate which may approve it\nas such, or pass it with such modifications as it may think fit, or may refer it back to the Syndicate for\nreconsideration, or may reject it;\nProvided that the Senate may initiate Statutes with respect to any matter in its power or with\nrespect to which Statutes may be framed in terms of this Act and approve such Statutes after seeking the\nviews of the Syndicate."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Regulations",
      "content": "(1) Subject to the provisions of this Act and the Statues, the Academic Council\nmay make Regulations for all or any of the following matters, namely:\n(a)    the courses of study for degrees, diplomas, and certificates of the University;\n(b)    the manner in which the teaching referred to in sub-section (1) of section 7 shall\nbe organized and conducted;\n(c)    the admission and expulsion of students to and from the University;\n(d)    the conditions under which students shall be admitted to the courses and the\nexaminations of the University and shall become eligible for the award of degrees,\ndiplomas, and certificates;\n(e)    the policies and procedures pertaining to student related functions including\nadmissions, registration, attendance, research supervision, advisement,\nplagiarism, expulsions, punishments, examinations, and qualification awards;\n(f)    the conduct of examinations;\n(g)    the acceptance and recognition of the examinations of other Universities or\nexamining bodies as equivalent to the corresponding examinations of the\nUniversity;\n(h)    the recognition and adaptation of laws and policies of the Commission,\nProfessional Councils, recognizing bodies, Government organizations or other\nlocal and foreign institutions as May be concerned;\n(i)    the conditions under which a person may carry on independent research to entitle\nhim to a degree;\n(j)    the conduct and discipline of the students;\n(k)    the institution of financial assistance programmes including for the awards or\ngrants of fellowships, scholarships, studentships free or half-free or else, stipends,\nexhibitions, educational aid and loans, and medals and prizes:\n(l)    the academic costumes;\n(m)    the use of the Library; and\n(n)     all other matters which by this Act or by the Statutes are to be or may be\nprescribed by Regulations.\n(2) Regulations shall be proposed by the Academic Council and shalt be submitted to the Senate\nwhich may approve them or withhold approval or refer them back to the Academic Council for\nreconsideration,\n(3) Regulations proposed by the Academic Council shall not be effective unless they receive the\napproval of the Senate.\n(4) Regulations regarding or incidental to matters contained in clauses (g) and (h) of sub-section\n(1) shall not be submitted to the Senate without the prior approval of the Syndicate."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Rules",
      "content": "(1) The Authorities and the other bodies of the University may make Rules,\nconsistent with this Act, the Statutes or Regulations, to regulate any matter relating to the affairs of the\nUniversity which has not been provided for by this Act or that is not required to be regulated by Statutes\nor Regulations, including rules to regulate the conduct of business and ‘the time and place of meetings\nand related matters.\n(2) Rules shall become effective upon approval by the Syndicate."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Amendment and repeal of Statutes, Regulations and Rules",
      "content": "The procedure for adding\nto, amending or repealing the Statutes, the Regulations, and the Rules shall be the same as that prescribed\nrespectively for framing and approval thereof,"
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Approval of affiliation",
      "content": "No institution shall be granted affiliation to, associated with, or\nadmitted to the privileges of the University or withdraw such affiliation except with the approval of the\nSenate."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Application for affiliation",
      "content": "(1) An institution seeking affiliation to the University shall\nmake an application satisfying the University that:\n(a)     the institution, is under the management of a Government or of a regularly\nconstituted governing or sponsoring body established under the competent and\nrecognized legislation;\n(b)     the financial resources of the institution are such as to enable it to make due\nprovision for its continued maintenance and efficient working;\n(c)     the strength and qualifications of the teaching, training and other staff, and the\nterms and conditions of their service, are adequate to make the provision for the\ncourses of instruction, teaching, or training to be undertaken by the institution;\n(d)     the institution has framed proper rules regarding the efficiency and discipline of\nits employees and other staff;\n(e)     the building in which the institution is to be located is suitable, and that provision\nwill be made in conformity with the Statutes and the Regulations for:\n(i)   the residence of, students, not residing with their parents or\nguardians, in the hostels established and maintained by the institution or\nin hostels or lodgings approved or licensed by it; and\n(ii)      the supervision and physical and general welfare of the students;\n(f)      the provision has been made for a library and adequate library services;\n(g)     where affiliation is sought in any branch of experimental sciences associated with\nthe areas of study and research of the University, due arrangements have been\nmade for imparting instruction in that branch of science in a properly equipped\nlaboratory, museum, and other places of practical work;\n(h)     due provision will, so far as circumstances may permit, be made for the residence\nof its Principal/Director and members of the teaching staff in or near the institution\nor place provided for the residence of students; and\n(i)     the affiliation of the institution will not be injurious to the interests of education\nor discipline of any other institution in its neighborhood.\n(2) The Application shall further contain an undertaking that, after the institution is affiliated, any\nchange of, and’ changes in, the management and in the teaching staff, save in the case of Government\ninstitutions, shall forthwith be reported to the University, and that the management and the teaching staff\nshall possess such qualifications as are, and may be, prescribed."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Grant of affiliation",
      "content": "The Senate on the recommendation of Syndicate may, after\nconsidering the report of the Affiliation Committee, grant or refuse to grant affiliation to an institution:\nProvided that affiliation shall not be refused unless the institution has been given an opportunity\nto show cause why affiliation should not be refused on the grounds to be given in writing."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Extension of affiliation",
      "content": "Where an institution desires to add to the courses of instruction in\nrespect of which It is affiliated, the procedure prescribed for affiliation of institution shall, so far as may\nbe, be followed,"
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Inspection and report",
      "content": "(1) Every institution affiliated to the University shall furnish such\nreports, returns and other information as the University may require enabling it to judge the efficiency\nof the institution.\n(2) The University shall cause every such institution to be inspected from time to time, through\na committee of competent persons comprised of not than three (03) persons, authorized in this behalf.\n(3) The University may call upon any institution affiliated to it to take, within a specified period\nof time, such action as may appear to the University to be necessary in respect of any of the matters\nreferred to in sub-section (1) of section 32."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Disaffiliation",
      "content": "(1) If an institution affiliated to the University has filled to observe any of\nthe conditions of its affiliation, or its affairs are conducted In a manner which is prejudicial to the interests\nof education and community as a whole, the rights referred on the institution by affiliation may, on a\nreport made by the Affiliation Committee and with the approval of the Senate, be withdrawn in whole\nor in part or modified:\nProvided that the Senate may on a report of the Affiliation Committee, and after considering such\nrepresentation as the institution may wish to make, restore to it such rights either in whole or in part.\n(2) The procedure to be followed for the withdrawal of affiliation shall be as may be prescribed."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Appeal",
      "content": "An appeal shall lie to the Chancellor against the decision of the Senate refusing to\naffiliate an institution, or withdrawing in whole or in part, the rights conferred on such institution by\naffiliation, or against modification of such rights,"
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Taking over an institution",
      "content": "(1) The Chancellor may on request of any institution\nestablished under a Government or a regulatory authority or body including from the institutions\naffiliated to, associated with, or admitted to the privileges of, the University direct to the Senate that the\ncontrol and management of such institution may be taken over by the University."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. University Fund",
      "content": "The University shall have a Fund to which shall be credited its income\nfrom fees, charges, donations, trusts, bequests, endowments, contributions, grants and all, other sources."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Audits and accounts",
      "content": "(1) The accounts of the University shall be maintained in such form\nand in such manner as may be prescribed.\n(2) The teaching departments, colleges, institutes, and all other units designated as such by the\nSyndicate in terms of Statutes shall be independent cost centres of the University with authority vested\nin the head of each cost centre to sanction expenditure out of the budget allocated to it:\nProvided that re-appropriation from one head of expenditure to another may be made by the head\nof a cost centre in accordance with and to the extent as may be prescribed by the Statutes.\n(3) All funds generated by a teaching department, college, institute, or other unit of the University\nthrough consultancy, research or other provision of service shall be made available without prejudice to\nthe budgetary allocation otherwise made, after deduction of overheads in the manner and to the extent\nas may be prescribed by Statute, to the concerned teaching department, college, institute, or other unit\nfor its development. A part of the funds so generated may be shared with the University teachers or\nresearchers or other employees in ‘charge of the consultancy, research or service concerned in the manner\nand to the extent as may be prescribed by Statute.\n(4) No expenditure shall be made from the funds of the University, unless a bill for its payments\nhas been issued by the head of the cost centre concerned in accordance with the relevant Statutes and the\nTreasurer has verified that the payment is provided for in the approved budget of the cost centre, subject\nto the authority to re-appropriate available funds to the head of the cost centre,\n(5) Provision shall be made for an internal audit of the finances of the University by a full-time\nResident Auditor. The duties of Resident Auditor shall include pre-audit of all bills and demands for\npayment submitted to the University.\n(6) Without prejudice to the requirement of audit by an auditor appointed by the Government in\naccordance with the provisions of any other law in force, the annual audited statement of accounts of the\nUniversity shall be prepared in conformity with the Generally Accepted Accounting Principles by a\nreputed firm of chartered accountants and signed by the Treasurer, The annual audited statement of\naccounts so prepared shall be submitted to the Auditor General of Pakistan for his observations.\n(7) The observations of the Auditor General of Pakistan, if any, together with such annotations\nas the Treasurer may make, shall be considered by the Syndicate prior to submission before the Senate\nwithin six months of closing of the financial year."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Opportunity to show cause",
      "content": "Except as otherwise provided by law no officer, teacher or\nother employee of the University holding a regular post shall be reduced in rank, or removed or\ncompulsorily retired from service, for cause arising out of any act or omission on the part of the person\nconcerned, unless he/she has been given a reasonable opportunity of showing cause against the action\nproposed to be taken."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Appeal to Syndicate and Senate",
      "content": "Where an order is passed punishing any officer (other\nthan the Vice-Chancellor), teacher or other employee of the University or altering or interpreting to\nhis/her disadvantage the prescribed terms or conditions of his/her service, he/she shall, where the order\nis passed by any officer or teacher of the University other than the Vice-Chancellor, have the right to\nappeal to the Syndicate against the order, and where the order is passed by the Vice-Chancellor, have the\nright to appeal to the Senate."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Service of the University",
      "content": "(1) All persons employed by the University in accordance with\nthe terms and conditions of service prescribed by Statutes shall be persons in the service of University.\n(2) An officer, teacher or other employee of the University shall retire from service on the\nattainment of such age or tenure of service as may be prescribed."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Benefits and Incentives",
      "content": "The University shall constitute for the benefit of its officers,\nteachers and other employees the schemes, in such manner and subject to such conditions as may be\nprescribed; such as pension, gratuity, provident fund, benevolent fund, health and life insurance, and\nother fringe benefits."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Term of office of members of an Authority",
      "content": "(1) When a member of a newly constituted\nAuthority is elected, appointed or nominated, his/her term of office, as fixed under this Act, shall\ncommence from such date as may be prescribed.\n(2) Where a member who has accepted any other assignment or for any other similar reason\nremains absent from the University for a period of not less than six months, he/she shall be deemed to\nhave resigned and vacated his/her seat."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Cessation of membership of an ex",
      "content": "officio Member.—Notwithstanding anything contained\nin this Act, a person nominated or appointed to any Authority or body under this Act, shall cease to be a\nmember of such Authority or body as soon as he/she ceases to hold the position by virtue of which he/she\nwas nominated or appointed to the Authority or body."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Filling of casual vacancies in Authorities",
      "content": "Any casual vacancy among the members of any\nAuthority shall be filled, as soon as conveniently may be, in the same manner and by the same person or\nAuthority that had appointed the member whose place has become vacant and the person appointed to\nthe vacancy shall be a member of such Authority for the residue of the term for which the person whose\nplace he/she fills would have been a member."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Validity of proceedings of Authorities with regard to vacancies",
      "content": "No act, proceedings,\nresolution, or decision of any Authority shall be invalid by reason of the existence of any vacancy on the\nAuthority doing, passing, or making it or by reason of any want of qualification or invalidity in the\nelection, nomination, or appointment of any de facto member of the Authority, whether present or absent."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Voids in the constitution of Authorities",
      "content": "Where there is a void in the constitution of an\nAuthority, as constituted by this Act, the Statutes or the Regulations, on account of the abolition of a\nspecified office under the Government or because an organization, institution or other body outside the\nUniversity has been dissolved or has ceased to function, or because of some other similar reason, such\nflaw shall be removed in such manner as the Senate may direct."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Tripartite mobility",
      "content": "(1) Any officer, teacher, or employee of the University shall, as the\nChancellor may direct, serve in a Government department or in any other university or an educational or\nresearch institution in public interest:\nProvided that the terms and conditions offered to him/her shall not be less favorable than those\nadmissible to him/her in the University and full benefit of his/her previous service shall be allowed to\nhim/her:\nProvided further that, in the case of a teacher, such directions shall be issued after consulting the\nSyndicate.\n(2) The Chancellor may place the services of an employee of the Government of Pakistan or of\nany other University or an educational or research institution at the disposal of the University in public\nInterest:\nProvided that the terms and conditions offered to him/her shall not be less favorable than those\nenjoyed by him/her immediately before his/her services are placed at the disposal of the University and\nthat full benefit of his/her previous service shall be allowed to him/her.\nProvided further that, in the case of a teacher, the Chancellor may consult the Selection Board of\nthe University before placing his/her services at the disposal of the University."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. First Statutes",
      "content": "Notwithstanding anything to the contrary contained in this Act, the President\nof Pakistan shall promulgate the First Statutes as specified in the schedule which shall be deemed to be\nStatutes framed under sections 27 and 28 and shall continue to remain in force until amended or replaced\nor till such time as new Statutes are farmed in accordance with the provisions of this Act."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Savings",
      "content": "(1) All funds, properties, rights and interests of whatsoever kind issued, used,\nenjoyed, possessed, owned or vested in by the division concerned or the Government for the purposes of\nconstitution and structure of the University and all liabilities subsisting against the University\nimmediately before the commencement of this Act shall stand transferred to the University established\nunder this Act.\n(2) Everything done, action taken, obligations and liabilities incurred, rights and assets acquired,\npersons appointed or authorized, jurisdictions or powers conferred, endowments, bequests funds or trusts\ncreated, donations or grants made, orders issued and existing immediately before the commencement of\nthis Act, shall be deemed to have been respectively done, taken, incurred, acquired, appointed or\nauthorized, conferred, created, made or issued under this Act.\n(3) No adverse change shall be made on the date of enforcement of this Act with regard to the\nterms and conditions of employment determined before the commencement of this Act in respect of any\nofficer, University teacher or other staff in the employment of the University."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Transitory provisions",
      "content": "(1) A Chancellor’s Committee shall be constituted by the\nChancellor upon recommendations of the Vice-Chancellor to exercise the powers assigned to the\nSyndicate under this Act till such time the Syndicate is constituted in accordance with the provisions of\nthis Act."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. First appointments",
      "content": "(1) Notwithstanding anything contained in this Act and the Statutes,\nthe first Vice-Chancellor shall be appointed by the Chancellor in consultation with the Ministry for a\nperiod not exceeding four years on such terms and conditions as the Chancellor may determine.\n(2) Notwithstanding anything contained in this Act and the Statutes, the Vice-Chancellor may\nappoint the first Registrar, the first Treasurer, the first Controller of Examinations, the first Resident\nAuditor, the first Librarian or any other officer prescribed as such by this Act for a period not exceeding\none year on such terms and conditions as the Vice-Chancellor may determine and report such actions to\nthe Chancellor. However, the term of office of the incumbents so appointed may be extended or renewed\nby the Senate upon recommendations of the Vice-Chancellor under this Act or under the relevant Statutes\nas may be prescribed in the meanwhile under this Act."
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Removal of difficulties",
      "content": "(1) If any question arises as to the interpretation of any of the\nprovisions of this Act, it shall be placed before the Chancellor and Commission whose decision thereon\nshall be final.\n(2) If any difficulty arises in giving effect to any of the provisions of this Act, the Chancellor may\nmake such order, after obtaining the views of the Vice Chancellor as regards the period of effect of first\nconstitution of any Authority concerned and for subsequent constitutions the views of the Senate, not\ninconsistent with the provisions of this Act, as may appear to him to be necessary for removing the\ndifficulty.\n(3) Where this Act makes any provision for anything to be done but no provision or insufficient\nprovision has been given as regards the Authority by whom, or the time at which, or the manner in which,\nit shall be done, in such circumstances it shall be done by such Authority, at such time, or in such manner\nas the Chancellor may direct after obtaining the views of the Senate.\n(4) If a question arises whether any person is entitled to be a member of any Authority, the matter\nshall be referred to a committee comprising of the Vice-Chancellor, the Secretary of the sponsoring\nMinistry, and the nominee of the Commission and the decision of the committee shall be final and\nbinding."
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. Indemnity, bar of suit and jurisdiction",
      "content": "No court shall have jurisdiction to entertain any\nsuit, prosecution or legal proceedings, grant any injunction or make any order against the Government,\nthe Chancellor, the University or any Authority, the officer, teacher, and employee of the Government\nor of the University, or any person in respect of anything which is done, or purported to have been done,\nor intended to be clone in good faith under this Act.\nThe First Statutes of the University\n(See section 51)"
    }
  ],
  "definitions": []
}
