{
  "id": "pk-land-acquisition-mines-act-1885",
  "type": "statute",
  "title": "Land Acquisition (Mines) Act, 1885",
  "title_en": "Land Acquisition (Mines) Act, 1885",
  "short_name": "LAA",
  "status": "in_force",
  "issued_date": "1885-10-15",
  "in_force_date": "1885-10-15",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-b5Y%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Land Acquisition (Mines) Act, 1885 (XVIII of 1885) published by The Pakistan Code (Land/Property Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, commencement and local extent",
      "content": "_(1) This Act may be called the Land\nAcquisition (Mines) Act, 1885 ; and\n(2) It shall come into force at once.\n3\n[(3) The Provincial Government may, from time to time, by notification in the official Gazette,\nextend this Act to the whole or any specified part of the territory under its administration]."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Saving for mineral rights of the Government. Except as expressly provided by this Act,",
      "content": "nothing in this Act shall affect the right of 4[the Government] to any mines or minerals."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Declaration that mines are not needed",
      "content": "_ (1) When the 5[Provincial Government] makes\na declaration under section 6 of the 2[Land Acquisition Act, 1894(I of 1894)], that land is needed for\na public purpose or for a Company, it may, if it thinks fit, insert in the declaration a statement that the\nmines of coal, ironstone, slate or other minerals lying under the land or any particular portion of the\nland, except only such parts of the mines or minerals as it may be necessary to dig or carry away or\nuse in the construction of the work for the purpose of which the land is being acquired, are not needed.\n(2) When a statement as aforesaid has not been inserted in the declaration made in respect of\nany land under section 6 of the 2[Land Acquisition Act 1894(I of 1894)], and the Collector is of opinion\nthat the provisions of this Act ought to be applied to the land, he may abstain from tendering\ncompensation under section 11 of the said Land Acquisition Act in respect of the mines, and may–\n(a)        when he makes an award under section 6[11] of that Act, insert such a statement\nin his award;\n(b)        when he makes a reference to the Court under section 7[19] of that Act, insert\nsuch a statement in his reference; or\n1\nFor the Statement of Objects and Reasons, see Gazette of India, 1885, Pt. V, p. 145; for Report of the Select Committee, see ibid., Pt. IV, p.\n264; and for Proceedings in Council, see ibid., Supplement, pp. 336 and 1520, and ibid., Extra, Supplement, dated 14th March, 1885, p. 41.\n2\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2nd Sch., for “Land Acquisition Act, 1870”.\n3\nSub-section (3) which was originally amended by A.O., 1949, have been subs., ibid.\n4\nThe original word “Government” has successively been amended by A.O.,1937, and A. O.,1961, Art. 2 (with effect from the 23rd March, 1956), to read\nas above.\n5\nSubs. by A.O., 1937, for “L. G.”.\n6\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2nd Sch., for “14”.\n7\nSubs. ibid., for “15”.\n(c)       when he takes possession of the land under section 17 of that Act, publish such\na statement in such manner as the 1[Provincial Government] may, from time to\ntime, prescribe.\n(3) If any such statement is inserted in the declaration, award or reference, or published as\naforesaid, the mines of coal, ironstone, slate or other minerals under the land or portion of the land\nspecified in the statement, except as aforesaid, shall not vest in 2[The Government] when the land so\nvests under the said Act."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Notice to be given before working mines lying under land. If the person for the time being",
      "content": "immediately entitled to work or get any mines or minerals lying under any land so acquired is desirous\nof working or getting the same, he shall give the 3[Provincial Government] notice in writing of his\nintention so to do sixty days before the commencement of working."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power to prevent or restrict working",
      "content": "_ (1) At any time or times after the receipt of a\nnotice under the last foregoing section and whether before or after the expiration of the said period of\nsixty days, the 3[Provincial Government] may cause the mines or minerals to be inspected by a person\nappointed by it for the purpose; and\n(2) If it appears to the 3[Provincial Government] that the working or getting of the mines or\nminerals, or any part thereof, is likely to cause damage to the surface of the land or any works thereon,\nthe 3[Provincial Government] may publish 4* * * a declaration of its willingness, either-\n(a)        to pay compensation for the mines or minerals still unworked or ungotten, or\nthat part thereof, to all persons having an interest in the same; or\n(b)        to pay compensation to all such persons in consideration of those mines or\nminerals, or that part thereof, being worked or gotten in such manner and subject\nto such restrictions as the 3[Provincial Government] may in its declaration\nspecify.\n(3) If the declaration mentioned in case (a) is made, then those mines or minerals, or that part\nthereof, shall not thereafter be worked or gotten by any person.\n(4) If the declaration mentioned in case (b) is made, then those mines or minerals, or that part\nthereof, shall not thereafter be worked or gotten by any person save in the manner and subject to the\nrestrictions specified by the 3[Provincial Government].\n5\n[(5) Every declaration made under this section shall be published in such manner as\nthe 3[Provincial Government] may direct.]\n1\nSubs. by A .O.,1937, for the words “L. G.”, which had been subs. for “G. G. in C.” by the Devolution Act, 1920 (38 of 1920), s. 2 and Sch. I.\n2\nThe original word “Government” has successively been amended by A.O., 1937, and A.O., 1961, Art. 2 (with effect from the 23rd March, 1956), to read\nas above.\n3\nSubs. by A.O.,1937, for “L.G.”.\n4\nThe words “in such manner as the G.G. in C. may, from time to time, direct” rep. by Act 38 of 1920, s. 2 and Sch. I.\n5\nIns. by the Devolution Act, 1920 (38 of 1920), s. 2 and Sch. I."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Mode of determining persons interested and amount of compensation. When the",
      "content": "working or getting of any mines or minerals has been prevented or restricted under section 5, the\npersons interested in those mines or minerals and the amounts of compensation payable to them\nrespectively shall, subject to all necessary modifications, be ascertained in the manner provided by the\n1\n[Land Acquisition Act, 1894], (I of 1894) for ascertaining the persons interested in the land to be\nacquired under that Act, and the amounts of compensation payable to them, respectively."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. If Provincial Government does not offer to pay compensation, mines may be worked in",
      "content": "a proper manner.___ (1) If before the expiration of the said sixty days the 2[Provincial Government]\ndoes not publish a declaration as provided in section 5, the owner, lessee or occupier of the mines may,\nunless and until such a declaration is subsequently made, work the mines or any part thereof in a\nmanner proper and necessary for the beneficial working thereof, and according to the usual manner of\nworking such mines in the local area where the same are situate.\n(2) If any damage or obstruction is caused to the surface of the land or any works thereon by\nimproper working of the mines, the owner, lessee or occupier of the mines shall at once, at his own\nexpense, repair the damage or remove the obstruction, as the case may require.\n(3) If the repair or removal is not at once effected, or, if the 2[Provincial Government] so thinks\nfit, without waiting for the same to be effected by the owner, lessee or occupier, the\n2\n[Provincial Government] may execute the same and recover from the owner, lessee or occupier the\nexpense occasioned thereby."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Mining communications. If the working of any mines is prevented or restricted under",
      "content": "section 5, the respective owners, lessees and occupiers of the mines, if their mines extend so as to lie\non both sides of the mines the working of which is prevented or restricted, may cut and make such and\nso many airways, headways, gateways or water-levels through the mines, measures or strata, the\nworking whereof is prevented or restricted, as may be requisite to enable them to ventilate, drain and\nwork their said mines; but no such airway, headway, gateway or water-level shall be of greater\ndimensions or section than may be prescribed by the 3[Provincial Government] in this behalf, and,\nwhere no dimensions are so prescribed, not greater than eight feet wide and eight feet high, nor shall\nthe same be cut or made upon any part of the surface or works, or so as to injure the same, or to interfere\nwith the use thereof."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Provincial Government to pay compensation for injury done to mines. The 2[Provincial",
      "content": "Government] shall, from time to time, pay to the owner, lessee or occupier of any such mines extending\nso as to lie on both sides of the mines, the working of which is prevented or restricted, all such\nadditional expenses and losses as may be incurred by him by reason of the severance of the lands lying\nover those mines or of the continuous working of those mines being interrupted as aforesaid, or by\nreason of the same being worked in such manner and under such restrictions as not to prejudice or\ninjure the surface or works, and for any minerals not acquired by the 2[Provincial Government] which\ncannot be obtained by reason of the action taken under the foregoing sections ; and if any dispute or\nquestion arises between the 2[Provincial Government] and the owner, lessee or occupier as afore said,\ntouching the amount of those losses or expenses, the same, shall be settled as nearly as may be in the\nmanner provided for the settlement of questions touching the amount of com - pensation payable under\nthe 4[Land Acquisition Act, 1894] (I of 1894).\n1\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2nd Sch., for “Land Acquisition Act, 1870”.\n2\nSubs. by A.O., 1937, for “L. G.”.\n3\nSubs. by A.O., 1937, for the words “L. G.” which had been subs. for the word “G. G. in C.” by the Devolution Act, 1920 (38 of 1920), s. 2 and Sch. I.\n4\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2nd Sch., for “Land Acquisition Act, 1870”."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. And also for injury arising from any airway or other work. If any loss or damage is",
      "content": "sustained by the owner or occupier of the lands lying over any such mines, the working whereof has\nbeen so prevented or restricted as aforesaid (and not being the owner, lessee or occupier of those\nmines), by reason of the making of any such airway or other works as aforesaid, which or any like\nwork it would not have been necessary to make but for the working of the mines having been so\nprevented or restricted as aforesaid, the 1[Provincial Government] shall pay full compensation to that\nowner or occupier of the surface lands for the loss or damage so sustained by him."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Power to officer of Provincial Government to enter and inspect the working of mines",
      "content": "For better ascertaining whether any mines lying under land acquired in accordance with the provisions\nof this Act are being worked, or have been worked, or are likely to be worked so as to damage the land\nor the works thereon, an officer appointed for this purpose by the 1[Provincial Government] may, after\ngiving twenty-four hours’ notice in writing, enter into and return from any such mines or the works\nconnected therewith; and for that purpose the officer so appointed may make use of any apparatus or\nmachinery belonging to the owner, lessee or occupier of the mines, and use all necessary means for\ndiscovering the distance from any part of the land acquired to the parts of the mines which have been,\nare being or are about to be worked."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Penalty for refusal to allow inspection. If any owner, lessee or occupier of any such mines",
      "content": "or works refuses to allow any officer appointed by the l[Provincial Government] for that purpose to\nenter into and inspect any such mines or works in manner aforesaid, he shall be punished with fine\nwhich may extend to two hundred rupees."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. If mines worked contrary to provisions of this Act, Provincial Government may",
      "content": "require means to be adopted for safety of land acquired. If it appears that any such mines have\nbeen worked contrary to the provisions of this Act, the l[Provincial Government] may, if it thinks fit,\ngive notice to the owner, lessee or occupier thereof to construct such works and to adopt such means\nas may be necessary or proper for making safe the land acquired, and the works thereon, and\npreventing injury thereto; and if, after such notice, any such owner, lessee or occupier does not\nforthwith proceed to construct the works necessary for making safe the land acquired and the works\nthereon, the l[Provincial Government] may itself construct the works and recover the expense thereof\nfrom the owner, lessee or occupier."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Construction of Act when land acquired has been transferred to a local authority or",
      "content": "Company. When a statement under section 3 has been made regarding any land, and the land has been\nacquired by the Government, and has been transferred to, or has vested, by operation of law, in a local\nauthority or Company, then sections 4 to 13, both inclusive, shall be read as if for the words “the\nl\n[provincial Government]”, wherever they occur in those sections 2[except in section 5, sub-section\n(5), and section 8,] the words “the local authority or Company, as the case may be, which has acquired\nthe land,” were substituted."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Definition of local authority and Company. In this Act–",
      "content": "1\nSubs. by A. O., 1937, for “L.G.”.\n2\nIns. by the Devolution Act, 1920 (38 of 1920), s. 2 and Sch. I.\n(a)       “local authority” means any municipal committee, district board, body of port\ncommissioners or other authority legally entitled to, or entrusted by the Go-\nvernment with, the control or management of any municipal or local fund; and\n(b)        “Company” means a company registered under any of the enactments relating\nto Companies from time to time in force in” l[Pakistan], or formed in pursuance\nof an Act of Parliament or by Royal Charter or Letters Patent."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. This Act to be read with Land Acquisition Act, 1870. This Act shall, for the purposes of",
      "content": "all enactments for the; time being in force, be read with and taken as part of the 2[Land] Acquisition\nAct, 1894 (I of 1884)].\n__________\nDate: 05-09-2024\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960) s.3 and 2nd Sch. (with effect from the 14th October, 1955) for “the\nProvinces and the Capital of the Federation” which had been subs. By A.O., 1949, Arts. 3(2) and 4, for “British India”.\n2\nSubs. By the Federal Laws (Revision and Declaration) Ordinance, 1981, (27 of 1981), s.3 and 2nd Sch., for “Land Acquisition Act, 1870”."
    }
  ],
  "definitions": [
    {
      "term": "local authority",
      "definition": "any municipal committee, district board, body of port commissioners or other authority legally entitled to, or entrusted by the Go- vernment with, the control or management of any municipal or local fund; and",
      "source_provision": "sec16"
    },
    {
      "term": "Company",
      "definition": "a company registered under any of the enactments relating to Companies from time to time in force in” l[Pakistan], or formed in pursuance of an Act of Parliament or by Royal Charter or Letters Patent.",
      "source_provision": "sec16"
    }
  ]
}
