{
  "id": "pk-land-acquisition-act-1894",
  "type": "statute",
  "title": "Land Acquisition Act, 1894",
  "title_en": "Land Acquisition Act, 1894",
  "short_name": "LAA",
  "status": "in_force",
  "issued_date": "1894-02-01",
  "in_force_date": "1894-02-01",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bJ6Z-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Land Acquisition Act, 1894 (I of 1894) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Act may be called the Land\nAcquisition Act, 1894;\n1\n[(2) It extends to the whole of Pakistan] ; and\n(3) It shall come into force on the first day of March, 1894."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. [Repeal.] Rep. partly by the Repealing and Amending Act, 1914 (X of 1914), s. 3 and",
      "content": "Schedule II, and partly by the Repealing Act, 1938 (I of 1938), s. 2 and Schedule."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Definitions. In this Act, unless there is something repugnant in the subject or context,",
      "content": "_\n(a)        the expression “land” includes benefits to arise out of land, and things attached\nto the earth or permanently fastened to anything attached to the earth:\n(b)        the expression “person interested” includes all persons claiming an interest in\ncompensation to be made on account of the acquisition of land under this Act;\nand a person shall be deemed to be interested in land if he is interested in an\neasement affecting the land:\n(c)        the expression “Collector” means the Collector of a district, and includes a\nDeputy Commissioner and any officer specially appointed by the 2[Provincial\nGovernment] to perform the functions of a Collector under this Act:\n3\n[(d)   the expression “Court” means a principal Civil Court of original jurisdiction,\nand includes the Court of any Additional District Judge and any Civil Judge\nwhom the Provincial Government may appoint, by name or by virtue of his\noffice, to perform concurrently with any such principal Civil Court, all or any of\nthe functions of the Court under this Act, within any specified area; provided\nthat in the case of a Civil Judge such functions shall be exercised only upto the\nlimits of his pecuniary jurisdiction.]\n(e)        the expression “Company” means a Company registered under the 4Indian\nCompanies Act, 1882 (VI of 1882), or under the (English) Companies Acts,\n1862 to 1890, or incorporated by an Act of Parliament 5[of the United\nKingdom] or 6[by 7[a Pakistan law]], or by Royal Charter or Letters\nPatent 8[and includes a society registered under the Societies\nRegistration Act, 1860 (XXI of 1860), and a registered society within\nthe meaning of the Co-operative Societies Act, 1912 (II of 1912)]:\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for\nthe original sub-section (2), as amended by A.O., 1949, Arts . 3 (2) and 4.\n2\nSubs. by A. O., 1937, for “L. G.”.\n3\nSubs. by Ord. No. XLIX of 1969, s. 3.\n4\nSee now the Companies Act, 1913 (7 of 1913).\n5\nIns. by A.O., 1961, Art. 2 and Sch. (with effect from the 23rd March,1956).\n6\nThe original words “of the G.G. in C.” were first subs . by A.O., 1937, and then amended by A.O., 1949, Sch., to read as above.\n7\nSubs. by Ord. XXVII of 1981, s . 5 and sch. IV (only to the extent of Islamabad Capital Territory).\n8\nIns. by the Land Acquisition (Amdt.) Act, 1919 (17 of 1919), s. 2.\n(f)        the expression “public purpose” includes the provision of village-sites in\ndistricts in which the 1[Provincial Government] shall have declared by\nnotification in the official Gazette that it is customary for the\nGovernment to make such provision: and\n(g)        the following persons shall be deemed persons “entitled to act” as and to\nthe extent hereinafter provided (that is to say)___\ntrustees for other persons beneficially interested shall be deemed the\npersons entitled to act with reference to any such case, and that to the\nsame extent as the persons beneficially interested could have acted if\nfree from disability ; 2[and]\n2\n*            *              *               *              *              *              *\nthe guardians of minors and the committees or managers of lunatics or\nidiots shall be deemed respectively the persons so entitled to act, to the\nsame extent as the minors, lunatics or idiots themselves, if free from\ndisability, could have acted:\nProvided that.___\n(i)        no person shall be deemed “entitled to act” whose interest in the\nsubject-matter shall be shown to the satisfaction of the Collector or\nCourt to be adverse to the interest of the person interested for whom he\nwould otherwise be entitled to act ;\n(ii)       in every such case the person interested may appear by a next friend or,\nin default of his appearance by a next friend, the Collector or Court, as\nbehalf in the conduct thereof ;\n(iii)      the provisions of 2[Order XXXII of the First Schedule to the Code of\nCivil Procedure, 1908 (Act V of 1908)] shall, mutatis mutandis, apply\nin the case of persons interested appearing before a Collector or Court\nby a next friend, or by a guardian for the case, in proceedings under\nthis Act ; and\n(iv)       no person “entitled to act” shall be competent to receive the\ncompensation-money payable to the person for whom he is entitled to act\nunless he would have been competent to alienate the land and receive and\ngive a good discharge for the purchase-money on a voluntary sale.\nSubs. by A.O., 1937, for “L. G.”.\n1\n2\nAdded, omitted and Subs. by Ord. XXVII of 1981, s . 5 and sch. IV (only to the extent of Islamabad Capital Territory).\nPreliminary Investigation"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Publication of preliminary notification and powers of officers thereupon",
      "content": "_ 2[(1)\nWhenever it appears to the Collector of the district that land in any locality is needed or is likely to\nbe needed for any public purpose or for a Company, a notification to that effect shall be published in\nthe official Gazette, and the Collector shall cause public notice of the substance of such notification\nto be given at convenient places in the said locality.]\n(2) Thereupon it shall be lawful for any officer, either generally or specially authorised by\nsuch Government in this behalf, and for his servants and workmen,__\nto enter upon and survey and take levels of any land in such locality ;\nto dig or bore into the subsoil ;\nto do all other acts necessary to ascertain whether the land is adapted for such purpose ;\nto set out the boundaries of the land proposed to be taken and the intended line of the work (if\nany) proposed to be made thereon ;\nto mark such levels, boundaries and line by placing marks and cutting trenches; and,\nwhere otherwise the survey cannot be completed and the levels taken and the boundaries and\nline marked, to cut down and clear away any part of any standing crop, fence or jungle:\nProvided that no person shall enter into any building or upon any enclosed court or garden\nattached to a dwelling-house (unless with the consent of the occupier thereof) without previously\ngiving such occupier at least seven days’ notice in writing of his intention to do so 3[:]\n3\n[Provided further that entire process of land acquisition shall be completed within a period\nof one year failing which the notification made under sub-section (1) shall stand revoked.].\n2\n[(3) The officer so authorised shall at the time of such entry pay or tender payment for all\nnecessary damage to be done as aforesaid, and, in case of dispute as to the sufficiency of the amount so\npaid or tendered, he shall at once refer the dispute to the decision of the Collector or other chief revenue-\nofficer of the district, and such decision shall be final.]\nl\nAs to amendments with which this section should be read when land is required for the purposes of a Company, see s . 38 (2), infra.\nA protected monument may be acquired under this Act as if its preservation were a “public purpose” within the meaning of the Act, see s.\n10 of the Ancient Monuments Preservation Act, 1904 (7 of 1904).\n2\nSubs. by Ord. No. XLIX of 1969, s. 4.\n3\nSubs. and ins. by the Land Acquisition (Amdt.) Act XXIII of 2017, s. 2.\n1\n[5. Notification that particular land is needed for a public purpose or for a Company.\nWhere land is to be acquired for a public purpose, if the Commissioner, and where land is to be\nacquired for a Company, the Provincial Government, is satisfied, after considering the result of the\nsurvey, if any, made under sub-section (2) of section 4, or if no survey is necessary, at any time, that\nany particular land included in a locality notified under sub-section (1) of section 4 is needed for a\npublic purpose or a Company, as the case may be, a notification to that effect shall be published in the\nofficial Gazette, stating the district or other territorial division in which the land is situate, the purpose\nfor which it is needed, its approximate area and situation, and where a plan has been made of the land,\nthe place where such plan may be inspected, and the Collector shall cause public notice to be given of\nthe substance of the notification at convenient places on or near the land to be acquired.]\n2[Objections\n1\n[5A. Hearing of objections. (1) Any person interested in any land which has been\nnotified under section 5 as being needed for a public purpose or for a Company may, within thirty\ndays after the issue of the notification, object to the acquisition of the land or of any land in the\nlocality, as the case may be.\n(2) Every objection under sub-section (1) shall be made to the Collector in writing, and the\nCollector shall give the objector an opportunity of being heard either in person or by pleader and shall,\nafter hearing all such objections and after making such further inquiry, if any, as he thinks necessary,\nsubmit the case for the decision of the Commissioner together with the record of the proceedings held by\nhim and a report containing his recommendations on the objections. The decision of the Commissioner on\nthe objections shall be final.\n(3) Where land is needed for a Company, the Collector shall, after making such enquiries as\nhe deems necessary, also make his recommendations to the Commissioner with regard to the area\nthat in his opinion is reasonable for the purpose.]\n(4) For the purpose of this section, a person shall be deemed to be interested in land who\nwould be entitled to claim an interest in compensation if the land were acquired under this Act.]\nDeclaration of intended Acquisition"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Declaration that land is required for a public purpose.(1) Subject to the provisions",
      "content": "of Part VII of this Act, 3[when the 4[Provincial Government] is satisfied, after considering the report,\nif any, made under section 5A, sub-section (2),] that any particular land is needed for a public\npurpose, or for a Company, a 5declaration shall be made to that effect under the signature of a\nSecretary to such Government or of some officer duly authorised to certify its orders :\nProvided that no such declaration shall be made unless the compensation to be awarded for\nsuch property is to be paid by a Company, or wholly or partly out of public revenues or some fund\ncontrolled or managed by a local authority.\n(2) The declaration shall be published in the official Gazette, and shall state the district or\nother territorial division in which the land is situate, the purpose for which it is needed, its\napproximate area, and, where a plan shall have been made of the land, the place where such plan\nmay be inspected.\n1\nSubs. by Ord. No. XLIX of 1969, ss. 5 and 6.\n2\nSub-heading and section 5A ins. by the Land Acquisition (Amdt.) Act, 1923 (38 of 1923), s .3.\n3\nSubs. by the Land Acquisition (Amdt.) Act, 1923 (38 of 1923) , s .4, for “whenever it appears to the L. G.”.\n4\nSubs. by A.O., 1937, for “L. G.”.\n5\nFor specimen, see Gaz. of P., 1953, Pt. I. p. 233\n(3) The said declaration shall be conclusive evidence that the land is needed for a public\npurpose or for a Company, as the case may be; and, after making such declaration, the 1[Provincial\nGovernment] may acquire the land in manner hereinafter appearing.\n2[(4) When the area in respect of which the said declaration is made is less than the area\npreviously notified under sub-section (1) of section 4, such previous notification, so far as it relates to\nthe excess area, shall be deemed to have been superseded by the said declaration.]"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. After declaration Collector to take order for acquisition. Whenever any land shall",
      "content": "have been so declared to be needed for a public purpose or for a Company, the 2[Provincial\nGovernment], or some officer authorised by the 2[Provincial Government] in this behalf, shall direct\nthe Collector to take order for the acquisition of the land."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Land to be marked out, measured and planned. The Collector shall thereupon cause the",
      "content": "land (unless it has been already marked out under section 4) to be marked out. He shall also cause it\nto be measured, and if no plan has been made thereof, a plan to be made of the same."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Notice to persons interested",
      "content": "_(1) The Collector shall then cause public notice to be\ngiven at convenient places on or near the land to be taken stating that the Government intends to take\npossession of the land, and that claims to compensation for all interests in such land may be made to\nhim.\n(2) Such notice shall state the particulars of the land so needed, and shall require all persons\ninterested in the land to appear personally or by agent before the Collector at a time and place therein\nmentioned (such time not being earlier than fifteen days after the date of publication of the notice),\nand to state the nature of their respective interests in the land and the amount and particulars of their\nclaims to compensation for such interests, and their objections (if any) to the measurements made\nunder section 8. The Collector may in any case require such statement to be made in writing and\nsigned by the party or his agent.\n(3) The Collector shall also serve notice to the same effect on the occupier (if any) of such\nland and on all such persons known or believed to be interested therein, or to be entitled to act for\npersons so interested, as reside or have agents authorised to receive service on their behalf, within\nthe revenue-district in which the land is situate.\n(4) In case any person so interested resides elsewhere, and has no such, agent, the notice shall\nbe sent to him by post in a letter addressed to him at his last known residence, address or place of\nbusiness and registered under 3[the Post Office Act, 1898 (VI of 1898)].\n1\n[(5) The Collector shall also serve notice of the enquiry to be held under section 11 (such notice\nnot being less than fifteen days prior to the date fixed under sub-section (2) for determination of claims\nand Objections) on the Department of Government, local authority or Company, as the case may be, for\nwhich land is being acquired, and require it to depute a duly authorised representative to attend the\nenquiry on its behalf for the purpose of making objections (if any) to the measurement of the land, claims\nto any interest in the land or the amount of any compensation. Such authorised representative shall be a\nparty to the proceedings.]\n1\nSubs. by A.O., 1937, for “L.G.”.\n2\nAdded by Ord. No. XLIX of 1969, ss. 7 and 8.\n3\nSubs. by Ord. XXVII of 1981, s. 5 & Sch. IV (only to the extent of Islamabad Capital Territory)."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Power to require and enforce the making of statements as to names and interests",
      "content": "(1) The Collector may also require any such person to make or deliver to him, at a time and place\nmentioned (such time not being earlier than fifteen days after the date of the requisition), a statement\ncontaining, so far as may be practicable, the name of every other person possessing any interest in\nthe land or any part thereof as co-proprietor, sub-proprietor, mortgagee, tenant or otherwise, and of\nthe nature of such interest, and of the rents and profits (if any) received or receivable on account\nthereof for three years next preceding the date of the statement.\n(2) Every person required to make or deliver a statement under this section or section 9 shall\nbe deemed to be legally bound to do so within the meaning of sections 175 and 176 of the Pakistan\nPenal Code (XLV of 1860).\nEnquiry into Measurements, Value and Claims, and Award by the Collector."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Enquiry and award by Collector. On the day so fixed, or on any other day to which the",
      "content": "enquiry has been adjourned, the Collector shall proceed to enquire into the objections (if any) which\nany person interested 1[and a Department of Government, a local authority, or a Company, as the\ncase may be,] has stated pursuant to a notice given under section 9 to the measurements made under\nsection 8, and into the value of the land 2[at the date of the publication of the notification under\nsection 4, sub-section (1)], and into the respective interests of the persons claiming the compensation\nand shall make an award under his hand of\n(i)        the true area of the land;\n(ii)       the compensation which in his opinion should be allowed for the land; and\n(iii)      the apportionment of the said compensation among all the persons known or\nbelieved to be interested in the land, of whom, or of whose claims, he has\ninformation, whether or not they have respectively appeared before him."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Award of Collector when to be final",
      "content": "_(1) Such award shall be filed in the Collector’s\noffice and shall, except as hereinafter provided, be final and conclusive evidence, as between the\nCollector and the persons interested, whether they have respectively appeared before the Collector or\nnot, of the true area and value of the land, and the apportionment of the compensation among the\npersons interested.\n(2) The Collector shall give immediate notice of his award to such of the persons interested\nas are not present personally or by their representatives when the award is made.\n1\n[12-A. Correction of mistake. Any clerical or arithmetical mistake in the award arising\ntherein from any accidental slip or omission may, at any time, be corrected by the Collector either of\nhis own motion or on the application of any of the parties.]"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Adjourment of enquiry. The Collector may, for any cause he thinks fit, from time to",
      "content": "time adjourn the enquiry to a day to be fixed by him."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Matters to be considered and neglected. In determining the amount of compensation,",
      "content": "the Collector shall be guided by the provision contained in sections 23 and 24.\nTaking possession"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Power to take possession. When the Collector has made an award under section 11, he",
      "content": "1\nmay [, subject to the provision of section 30,] take possession of the land, which shall thereupon\n2\n[vest absolutely in the 3[Government]], free from all encumbrances.\n1\n[17. Special power in cases of urgency. (1) In cases of urgency, whenever the\nCommissioner so directs, the Collector, though no such award has been made, may, on the expiration\nof fifteen days from publication of the notice mentioned in sub-section (1) of section 9, take\npossession of any land needed for public purposes or for a Company. Such land shall thereupon vest\nabsolutely in the Government, free from all encumbrances:\nProvided that the Commissioner shall not issue any direction to the Collector under this\nsub-section unless the Department of Government, the local authority, or Company, as the case may\nbe, for which the land is being acquired, has first deposited the estimated cost of acquisition of such\nland as determined by the Collector of the district, keeping in view the provisions of sections 23 and"
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. (2) Whenever, owing to any sudden change in the channel of any navigable river or other",
      "content": "unforeseen emergency, it becomes necessary for any Railway Administration to acquire the immediate\npossession of any land for the maintenance of their traffic or for the purpose of making thereon a river-\nside or ghat station, or of providing convenient connection with or access to any such station, or\nwhenever owing to a similar emergency it becomes necessary for the Commissioner to acquire the\nimmediate possession of any land for the purposes of maintaining traffic over a public road, the\nCollector may, immediately after the publication of the notice mentioned in sub-section (1) and with\nthe previous sanction of the Commissioner, enter upon and take possession of such land, which\nshall thereupon vest absolutely in the Government free from all encumbrances:\nProvided that the Collector shall not take possession of any building or part of a building\nunder this sub-section without giving to the occupier thereof at least forty-eight hours' notice of his\nintention so to do, or such longer notice as may be reasonably sufficient to enable such occupier to\nremove his movable property from such building without unnecessary inconvenience.\n(3) In every case under either of the preceding sub-sections the Collector shall at the time of\ntaking possession offer to the persons interested compensation for the standing crops and trees (if\nany) on such land and for any other damage sustained by them caused by such sudden dispossession\nand not excepted in section 24; and, in case such offer is not accepted, the value of such crops and\ntrees and the amount of such other damage shall be allowed for in awarding compensation for the\nland under the provisions herein contained.\n(4) In cases where in the opinion of the Commissioner, the provisions of sub-section (1) or\nsub-section (2) are applicable, the Commissioner may direct that the provisions of sections 5\nand 5-A shall not apply, and, if he does so direct, a declaration may be made under section 6 in\nrespect of the land at any time after the publication of the notification under sub- section (1) of\nsection 4.]\n1\nInserted & subs. by Ord. No. XLIX of 1969, ss. 11 & 12.\n2\nSubs. by A.O., 1937, for “vest absolutely in the Govt.”.\n3\nSubs. by A.O., 1961, Art. 2, for “Crown” (with effect from the 23th March, 1956)."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Reference to Court",
      "content": "(1) Any person interested who has not accepted the award may, by\nwritten application to the Collector, require that the matter be referred by the Collector for the\ndetermination of the Court, whether his objection be to the measurement of the land, the amount of\nthe compensation, the persons to whom it is payable, or the apportionment of the compensation\namong the persons interested.\n(2) The application shall state the grounds on which objection to the award is taken:\nProvided that every such application shall be made,___\n(a) if the person making it was present or represented before the Collector at the time\nwhen he made his award, within six weeks from the date of the Collector’s award;\n(b) in other cases, within six weeks of the receipt of the notice from the Collector under\nsection 12, sub-section (2) or within six months from the date of the Collector’s\naward, whichever period shall first expire1.\n2\n[(3) Notwithstanding anything to the contrary contained in section 21, the Provincial\nGovernment may, if it has not accepted the award, refer the matter to the Court within a period of six\nmonths from the date of announcement of the award; provided that the Court shall not\nentertain the reference unless in its opinion there is a prima facie case for inquiry into and\ndetermination of the objection against the award.]"
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Collector’s statement to the Court",
      "content": "_(1) In making the reference, the Collector shall\nstate for the information of the Court, in writing under his hand,___\n(a) the situation and extent of the land, with particulars of any trees, buildings or standing\ncrops thereon;\n(b) the names of the persons whom he has reason to think interested in such land;\n(c) the amount awarded for damages and paid or tendered under sections 5 and 17, or\neither of them, and the amount of compensation awarded under section 11; and\n(d) if the objection be to the amount of the compensation, the grounds on which the\namount of compensation was determined.\n(2) To the said statement shall be attached a schedule giving the particulars of the notices\nserved upon, and of the statements in writing made or delivered by, the parties interested\nrespectively.\n1\nTwo new sections 18-A and 18-B have been ins. in the N.W.F.P., see the Land Acquisition (North-West Frontier Province Amendment)\nAct, 1947 (N.W.F.P. Act 19 of 1947).\n2\nAdded by Ord. No. XLIX of 1969, s. 13."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Service of notice. The Court shall thereupon cause a notice specifying the day on which",
      "content": "the Court will proceed to determine the objection, and directing their appearance before the Court on\nthat day, to be served on the following persons, namely:___\n(a) the applicant;\n(b) all persons interested in the objection, except such (if any) of them as have consented\nwithout protest to receive payment of the compensation awarded; and\n(c) if the objection is in regard to the area of the land or to the amount of the\ncompensation, the Collector 1[and the Department of Government, local authority or\nCompany, as the case for which land is being acquired]."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Restriction on scope of proceedings. The scope of the inquiry in every such proceeding",
      "content": "shall be restricted to a consideration of the interests of the persons affected by the objection."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Proceedings to be in open Court. Every such proceeding shall take place in open Court,",
      "content": "and all persons entitled to practise in any Civil Court in the province shall be entitled to appear, plead\nand act (as the case may be) in such proceeding.\n1\n[22-A. Cross objections. The Provincial Government, or a local authority or a Company for\nwhich land is being acquired, may lodge a cross objection to the objection made by any person\ninterested and the Court may reduce the amount awarded by the Collector if it considers it just\nand proper.]"
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Matters to be considered in determining compensation",
      "content": "_(1) In determining the\namount of compensation to be awarded for land acquired under this Act, the Court shall take into\nconsideration–\nfirst, the market-value of the land at the date of the publication of the 2[notification under\nsection 4, sub­section (1)];\n1\n[EXPLANATION— For the purpose of determining the market-value, the Court shall take into\naccount transfer of land similarly situated and in similar use. The potential-value of the\nland to be acquired if put to a different use shall only be taken into consideration if it is\nproved that land similarly situated and previously in similar use has, before the date of\nthe notification under sub-section (1) of section 4, been transferred with a view to being\nput to the use relied upon as affecting the potential value of the land to be acquired:\nProvided that—\n(i) if the market-value has been increased in consequence of the land being put to a use\nwhich is unlawful or contrary to public policy that use shall be disregarded and\nthe market-value shall be deemed to be the market-value of the land if it were\nput to ordinary use; and\n(ii) if the market-value of any building has been increased in consequence of the\nbuilding being so overcrowded as to be dangerous to the health of the inmates,\nsuch overcrowding shall be disregarded and the market-value shall be deemed\nto be the market-value of the building if occupied by such number of persons\nonly as can be accommodated in it without risk of danger to health from\novercrowding.]\n1\nInserted & added by Ord. No. XLIX of 1969, ss. 14, 15 & 16.\n2\nSubs. by the Land Acquisition (Amdt.) Act, 1923 (38 of 1923), s. 7, for “declaration relating thereto under s. 6”.\nsecondly, the damage sustained by the person interested, by reason of the taking of any\nstanding crops or trees which may be on the land at the time of the Collector’s taking\npossession thereof;\nthirdly, the damage (if any) sustained by the person interested, at the time of the Collector’s\ntaking possession of the land, by reason of severing such land from his other land;\nfourthly, the damage (if any) sustained by the person interested, at the time of the Collector’s\ntaking possession of the land, by reason of the acquisition injuriously affecting his\nother property, moveable or immoveable, in any other manner, or his earnings;\nfifthly, if, in consequence of the acquisition of the land by the Collector, the person interested\nis compelled to change his residence or place of business, the reasonable expenses (if\nany) incidental to such change; and\nsixthly, the damage (if any) bona fide resulting from diminution of the profits of the land\nbetween the time of the publication of the declaration under section 6 and the time of\nthe Collector’s taking possession of the land.\n1\n[(2) In addition to the market-value of the land as above provided, the Court shall award a\nsum of fifteen per centum on such market-value, in consideration of the compulsory nature of the\nacquisition, if the acquisition has been made for a public purpose and a sum of twenty-five per\ncentum on such market-value if the acquisition has been made for a Company.]"
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Rules as to amount of compensation",
      "content": "_(1) When the applicant has made a claim to\ncompensation, pursuant to any notice given under section 9, the amount awarded to him by the Court\nshall not exceed the amount so claimed 1[*  *      *       *      *      *      *].\n(2) When the applicant has refused to make such claim or has omitted without sufficient reason\n(to be allowed by the Judge) to make such claim, the amount awarded by the Court shall in no case\nexceed the amount awarded by the Collector.\n(3) When the applicant has omitted for a sufficient reason (to be allowed by the Judge) to make\nsuch claim, the amount awarded to him by the Court shall not be less than, and may exceed, the amount\nawarded by the Collector.\n2\n[26. Form of awards.___(1)] Every award under this part shall be in writing signed by the Judge,\nand shall specify the amount awarded under clause first of sub-section (1) of section 23, and also the\namounts (if any) respectively awarded under each of the other clauses of the same sub-section, together\nwith the grounds of awarding each of the said amounts.\n3\n[(2) Every such award shall be deemed to be a decree and the statement of the grounds of every\nsuch award a judgment within the meaning of section 2, clause (2), and section 2, clause (9),\nrespectively, of the Code of Civil Procedure, 1908 (V of 1908).]"
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Costs",
      "content": "_(1) Every such award shall also state the amount of costs incurred in the proceedings\nunder this part, and by what persons and in what proportions they are to be paid.\n(2) When the award of the Collector is not upheld, the costs shall ordinarily be paid by the\nCollector, unless the Court shall be of opinion that the claim of the applicant was so extravagant or that\nhe was so negligent in putting his case before the Collector that some deduction from his costs should be\nmade or that he should pay a part of the Collector’s costs."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Collector may be directed to pay interest on excess compensation. If the sum which in the",
      "content": "opinion of the Court, the Collector ought to have awarded as compensation is in excess of the sum which\nthe Collector did award as compensation, the award of the Court may direct that the Collector shall pay\n4\n[compound interest on such excess at the rate of eight per centum] per annum from the date on which he\ntook possession of the land to the date of payment of such excess into Court.\n4\n[Provided that in all cases where the Court has directed that Collector shall pay interest on\nsuch excess at the rate of six per centum from the date on which possession was taken and the\npayment of compensation or a part thereof has not been made up to the commencement of the Land\nAcquisition (West Pakistan Amendment) Act, 1969, the rate of compound interest on such excess on\nbalance shall be eight per centum.]\n_________"
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Particulars of apportionment to be specified. Where there are several persons interested, if",
      "content": "such persons agree in the apportionment of the compensation, the particulars of such apportionment shall\nbe specified in the award, and as between such persons the award shall be conclusive evidence of the\ncorrectness of the apportionment."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Dispute as to apportionment. When the amount of compensation has been settled under",
      "content": "section 11, if any dispute arises as to the apportionment of the same or any part thereof, or as to the\npersons to whom the same or any part thereof is payable, the Collector may refer such dispute to the\ndecision of the court.\n1\nOmmitted by Ord. No. XLIX of 1969, s. 17\n2\nS. 26 was re-numbered as sub-section (1) of that section by the Land Acquisition (Amdt) Act, 1921 (19 of 1921), s . 2.\n3\nSub-section (2) ins., ibid.\n4\nSubs and added by Act. NO. III of 1969, s.2."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Payment of compensation or deposit of same in Court",
      "content": "_ 1[(1) When the Collector\nhas made an award under section 11—\n(a)            if the persons interested entitled to compensation under the award and the\nProvincial Government accept the award and intimate their acceptance in writing\nto the Collector before the expiry of the period prescribed in sub-section (2) of\nsection 18 for making an application to the Collector for referring the award to\nthe Court, or in sub-section (3) of the said section for referring the award to the\nCourt by the Provincial Government, whichever is later, or if the period\nspecified in sub-section (2) of the said section for making an application to the\nCollector or in sub-section (3) for referring the award to the Court has expired\nand no such application or reference has been made, the Collector shall, before\ntaking possession of the land, tender payment of the full amount of\ncompensation awarded by him to the persons entitled thereto according to the\naward, and shall pay it to them unless prevented by some one or more of the\ncontingencies mentioned in sub-section (2);\n(b)            if the persons interested entitled to compensation under the award or the\nProvincial Government object to the award and an application has been made to\nthe Collector under sub-section (2) of section 18 for referring the award to the\nCourt, or the award has been referred to the Court by the Provincial Government\nunder sub-section (3) of that section, the Collector shall, before taking possession\nof the land, tender payment of the compensation awarded by him or the\nestimated cost of acquisition of such land as determined by the Collector of the\ndistrict under sub-section (1) of section 17, whichever is less, to the persons\nentitled thereto under the award and shall pay it to them unless prevented by\nsome one or more of the contingencies mentioned in sub- section (2):\nProvided that no payment under clause (b) shall be made until the\nperson entitled to compensation furnishes to the satisfaction of the Collector a\nsecurity for refund of the amount, if any, which may subsequently be found\nto be in excess of the compensation awarded to him by the Court.]\n(2) If they shall not consent to receive it, or if there be no person competent to alienate the\nland, or if there be any dispute as to the title to receive the compensation or as to the apportionment\nof it, the Collector shall deposit the amount of the compensation in the Court to which a reference\nunder section 18 would be submitted:\nProvided that any person admitted to be interested may receive such payment under protest as\nto the sufficiency of the amount:\nProvided also that no person who has received the amount otherwise than under protest shall\nbe entitled to make any application under section 18:\nProvided also that nothing herein contained shall affect the liability of any person, who may\nreceive the whole or any part of any compensation awarded under this Act, to pay the same to the\nperson lawfully entitled thereto.\n(3) Notwithstanding anything in this section the Collector may, with the sanction of the\n2\n[Provincial           Government ], instead of awarding a money compensation in respect of any land, make\n__________________________________________________________________________________________________________________________________________________________________________________________________\n1\nSubs. by Ord. No. XLIX of 1969, s. 18.\nSubs. by A.O., 1937, for “L. G.”.\n2\nAs to persons who are competent to contract, see s . 11 of the Contract Act, 1872 (9 of 1872).\nany arrangement with a person having a limited interest in such land, either by the grant of other\nlands in exchange, the remission of land-revenue on other lands held under the same title, or in such\nother way as may be equitable having regard to the interests of the parties concerned.\n(4) Nothing in the last foregoing sub-section shall be construed to interfere with or limit the\npower of the Collector to enter into any arrangement with any person interested in the land and\n1\ncompetent to contract in respect thereof."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Investment of money deposited in respect of lands belonging to persons incompetent",
      "content": "to alienate.__(1) If any money shall be deposited in Court under sub-section (2) of the last preceding\nsection and it appears that the land in respect whereof the same was awarded belonged to any person\nwho had no power to alienate the same, the Court shall___\n(a) order the money to be invested in the purchase of other lands to be held under the like\ntitle and conditions of ownership as the land in respect of which such money shall have\nbeen deposited was held, or\n(b) if such purchase cannot be effected forthwith, then in such Government or other\napproved securities as the court shall think fit;\nand shall direct the payment of the interest or other proceeds arising from such investment to the\nperson or persons who would for the time being have been entitled to the possession of the said land,\nand such moneys shall remain so deposited and invested until the same be applied___\n(i)                                 in the purchase of such other lands as aforesaid; or\n(ii)                                in payment to any person or persons becoming absolutely entitled thereto.\n(2) In all cases of moneys deposited to which this section applies the Court shall order the\ncosts of the following matters, including therein all reasonable charges and expenses incident thereto,\nto be paid by the Collector, namely:___\n(a)                                 the costs of such investments as aforesaid;\n(b)                                 the costs of the orders for the payment of the interest or other proceeds, of the\nsecurities upon which such moneys are for the time being invested, and for the\npayment out of Court of the principal of such moneys, and of all proceedings\nrelating thereto, except such as may be occasioned by litigation between\nadverse claimants."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Investment of money deposited in other cases. When any money shall have been",
      "content": "deposited in Court under this Act for any cause other than that mentioned in the last preceding\nsection, the Court may, on the application of any party interested or claiming an interest in such\nmoney, order the same to be invested in such Government or other approved securities as it may\nthink proper, and may direct the interest or other proceeds of any such investment to be accumulated\nand paid in such manner as it may consider will give the parties interested therein the same benefit\ntherefrom as they might have had from the land in respect whereof such money shall have been\ndeposited or as near thereto as may be."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Payment of interest. When the amount of such compensation is not paid or deposited",
      "content": "on or before taking possession of the land, the Collector shall pay the amount awarded with\n_______________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\n1\nAs to persons who are competent to contract, see s . 11 of the Contract Act, 1872 (9 of 1872).\n1\n[compound interest at the rate of eight per centum] per annum from the time of so taking possession\nuntil it shall have been so paid or deposited 1[;]\n1\n[Provided that any waiver of the above right by the land owner shall be void and he shall be\nentitled to the said interest notwithstanding any agreement to the contrary.]\n______________________"
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Temporary occupation of waste or arable land. Procedure when difference as to",
      "content": "compensation exists.___(1) Subject to the provisions of Part VII of this Act, whenever it appears to\nthe 2[Provincial Government] that the temporary occupation and use of any waste or arable land are\nneeded for any public purpose, or for a Company, the 2[provincial Government] may direct the\nCollector to procure the occupation and use of the same for such term as it shall think fit, not\nexceeding three years from the commencement of such occupation.\n3\n[(2) The Collector shall cause public notice of the substance of the direction to be given at\nconvenient places in the locality in which the land is situate, and thereupon it shall be lawful for any\nofficer, either generally or specially authorised by the Collector in this behalf, and for the servants\nand workmen of such officer, to enter upon and survey and take levels of any land in such\nlocality.]\n3\n[(3) On receipt of plans detailing the land acquired, the Collector shall give notice in\nwriting to the persons interested in such land of the purpose for which the same is needed and\nshall, for the occupation and use thereof for such term as aforesaid, and for the materials, if any, to\nbe taken therefrom, pay to them such compensation, either in a gross sum of money or by monthly or\nother periodical payments as shall be agreed upon in writing between him and such persons\nrespectively.]\n3\n[(4)] In case the Collector and the persons interested differ as to the sufficiency of the\ncompensation or apportionment thereof, the Collector shall refer such difference to the decision of\nthe Court."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Power to enter and take possession, and compensation on restoration",
      "content": "_(1) On\npayment of such compensation, or on executing such agreement or on making a reference under\nsection 35, the Collector may enter upon and take possession of the land, and use or permit the use\nthereof in accordance with the terms of the said notice.\n(2) On the expiration of the term, the Collector shall make or tender to the persons interested\ncompensation for the damage (if any) done to the land and not provided for by the agreement, and\nshall restore the land to the persons interested therein:\nProvided that, if the land has become permanently unfit to be used for the purpose for which\nit was used immediately before the commencement of such term, and if the persons interested shall\nso require, the 2[provincial Government] shall proceed under this Act to acquire the land as if it was\nneeded permanently for a public purpose or for a Company."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Difference as to condition of land. In case the Collector and persons interested differ as",
      "content": "to the condition of the land at the expiration of the term, or as to any matter connected with the said\nagreement, the Collector shall refer such difference to the decision of the Court.\n1\nSubs. and added by Act. NO. III of 1969. s.2.\n2\nSubs. by A.O., 1937, for “L. G.”.\n3\nSubs, re-numbered (3) into (4) and inserted new sub-sect (3). by Ord. No. XLIX of 1969, s. 19."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Company may be authorised to enter and survey",
      "content": "_ 1[(1) The Commissioner may\nauthorise any officer of any Company desiring to acquire land for its purpose to exercise the powers\nconferred by sub-section (2) of section 4.]\n(2) In every such case section 4 shall be construed as if for the words “for such purpose” the\nwords “for the purposes of the Company” were substituted; and 1[sub-section (3) of section 4] shall\nbe construed as if after the words “the officer” the words “of the Company” were inserted.\n2[38A.    Industrial concern to be deemed Company for certain purposes. An industrial\nconcern, ordinarily employing not less than one hundred workmen owned by an individual or by an\nassociation of individuals and not being a Company, desiring to acquire land for the erection of\ndwelling houses for workmen employed by the concern or for the provision of amenities directly\nconnected therewith shall, so for as concerns the acquisition of such land, be deemed to be a\nCompany for the purposes of this Part, and the references to Company in sections 5A, 6, 7, 17 and 50\nshall be interpreted as references also to such concern.]"
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Previous consent of Provincial Government and execution of agreement necessary",
      "content": "The provisions of sections 6 to 37 (both inclusive) shall not be put in force in order to acquire land\nfor any Company, unless with the previous consent of the 3[Provincial Government] nor unless the\nCompany shall have executed the agreement hereinafter mentioned."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Previous enquiry",
      "content": "_(1) Such consent shall not be given unless the 3[Provincial\nGovernment] be satisfied, 4[either on the report of the Collector under section 5A, sub-section (2),\nor] by an enquiry held as hereinafter provided,___\n5\n[(a)    that the purpose of the acquisition is to obtain land for the erection of dwelling\nhouses for workmen employed by the Company or for the provision of\namenities directly connected therewith, or\n6\n[(aa) that such accusation is needed for the construction of some building or work\nfor a company which is engaged or is taking steps for engaging itself in any\nindustry or work which is for a public purpose, or]\n(b)         that such acquisition is needed for the construction of some work, and that\nsuch work is likely to prove useful to the public 1[, or]]\n1\n(c)          [(c) that the area proposed to be acquired is reasonable for the purpose.]\n(2) Such enquiry shall be held by such officer and at such time and place as the 3[Provincial\nGovernment] shall appoint.\n(3) Such officer may summon and enforce the attendance of witnesses and compel the\nproduction of documents by the same means and, as far as possible, in the same manner as is\nprovided by the 7Code of Civil Procedure (XIV of 1882) in the case of a Civil Court."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Agreement with Provincial Government. 8* * * If the 3[Provincial Government] is",
      "content": "satisfied 9[after considering the report, if any, of the Collector under section 5A, sub-section (2), or on\n1\nSubs. and added by Ord. No. XLIX of 1969, ss. 20 and 21.\n2\nS. 38A ins. by the Land Acquisition (Amdt.) Act, 1933 (16 of 1933), s. 6.\n3\nSubs. by A.O., 1937, for “L. G.”.\n4\nIns. by the Land Acquisition (Amdt.) Act, 1923 (38 of 1923), s. 9.\n5\nSubs. by Act, 16 of 1933, s. 3, for the original clauses (a) and (b).\n6\nIns. by Ord. No. I of 1965, s. 3.\n7\nSee now the Code of Civil Procedure, 1908 (5 of 1908).\n8\nThe words “Such officer shall report to the L. G. the result of the enquiry, and” rep. by Act, 38 of 1923, s. 10.\n9\nIns. ibid.\nthe report of the officer making an inquiry under section 40] that 1[the object of the proposed\nacquisition is to obtain land for one of the purposes referred to clause (a) or clause (aa) or clause (b)\nof sub-section (1) of section 40] , it shall 2* * * require the Company to enter into an agreement\n3\n[with the Provincial Government], providing to the satisfaction of the 4[Provincial Government] for\nthe following matters, namely :___\n(1) the 5[payment to the Provincial Government] of the cost of the acquisition;\n(2) the transfer, on such payment, of the land to the Company;\n(3) the terms on which the land shall be held by the Company;\n6\n[(4) where the acquisition is for the purpose of erecting dwelling houses or the provision of\namenities connected therewith, the time within which, the conditions on which and the manner in\nwhich the dwelling houses or amenities shall be erected or provided; and\n1\n[(5) where the acquisition is for a purpose falling under clause (b) of sub-section (1) of section\n40, the time within which and the conditions on which the work shall be constructed and maintained.]]"
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Publication of agreement. Every such agreement shall, as soon as may be after its",
      "content": "execution, be published 7* * * in the 8[official Gazette] 1[and the acquisition shall be deemed to\nhave been made subject to the terms of such agreement.]\n9[43. Section 39 to 42 not to apply when Government bound to provide land. The\nprovisions of sections 39 to 42, both inclusive, shall not apply to the acquisition of land for any\ncompany, for the purposes of which, under any agreement with such company, the Federal\nGovernment or any Provincial Government is bound to provide land.]\n1\n[43-A. Restrictions on transfer, etc.— No Company for which any land is acquired under\nthis Part shall be entitled to transfer the said land or any part thereof by sale, mortgage, gift, lease or\notherwise, except with the previous sanction of the Provincial Government]."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. How agreement with Railway Company may be proved",
      "content": "In the case of the acquisition\nof land for the purposes of a Railway Company, the existence of such an agreement as is mentioned\nin section 43 may be proved by the production of a printed copy thereof purporting to be printed by\norder of Government.\n1\nSubs. and added by Ord. No. XLIX of 1969, ss. 22, 23 and 24.\n2\nThe words “subject to such rules as the G.G. in C. may from time to time prescribe in this behalf” rep. by the Devolution Act, 1920 (38 of\n1920), s. 2 and Sch. I.\n3\nSubs. by A.O., 1937, for “with the Secretary of State for India in Council”.\n4\nSubs. ibid., for “L.G.”\n5\nSubs. ibid., for “payment to Govt.”.\n6\nSubs. by Act 16 of1933, s. 4, for the original clauses (4) and (5).\n7\nThe words “in the Gazette of India and also” rep. by A.O., 1937.\n8\nSubs. ibid., for “local official Gazette”.\n9\nSubs. by Ord. XXVII of 1981, s. 5 and sch. IV (only to the extent of Islamabad Capital Territory)."
    },
    {
      "provision_ref": "sec145",
      "section": "145",
      "title": "Section 145. Service of notices",
      "content": "_(1) Service of any notice under this Act shall be made by delivering\nor tendering a copy thereof signed, in the case of a notice under section 4, by the officer therein\nmentioned, and, in the case of any other notice, by or by order of the Collector or the Judge.\n(2) Whenever it may be practicable, the service of the notice shall be made on the person\ntherein named.\n(3) When such person cannot be found, the service may be made on any adult male member\nof his family residing with him; and, if no such adult male member can be found, the notice may be\nserved by fixing the copy on the outer door of the house in which the person therein named\nordinarily dwells or carries on business, or by fixing a copy thereof in some conspicuous place in the\noffice of the officer aforesaid or of the Collector or in the court-house, and also in some conspicuous\npart of the land to be acquired :\nProvided that, if the Collector or Judge shall so direct, a notice may be sent by post, in a letter\naddressed to the person named therein at his last known residence, address or place of business and\nregistered under 2[the Post Office Act, 1898 (VI of 1898)], and service of it may be proved by the\nproduction of the addressee’s receipt."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Penalty for obstructing acquisition of land. Whoever wilfully obstructs any person in",
      "content": "doing any of the acts authorised by section 4 or section 8, or wilfully fills up, destroys, damages or\ndisplaces any trench or mark made under section 4, shall, on conviction before a Magistrate, be liable\nto imprisonment for any term not exceeding one month, or to fine not exceeding fifty rupees, or to\nboth."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Magistrate to enforce surrender. If the Collector is opposed or impeded in taking",
      "content": "possession under this Act of any land, he shall, if a Magistrate, enforce the surrender of the land to\nhimself, and, if not a Magistrate, he shall apply to 2[an executive magistrate] 3* * * and such\nMagistrate 4* * * shall enforce the surrender of the land to the Collector."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Completion of acquisition not compulsory, but compensation to be awarded when",
      "content": "not completed.__(1) Except in the case provided for in section 36, the Government shall be at liberty\nto withdraw from the acquisition of any land of which possession has not been taken.\n(2) Whenever the Government withdraws from any such acquisition, the Collector shall\ndetermine the amount of compensation due for the damage suffered by the owner in consequence of\nthe notice or of any proceedings thereunder, and shall pay such amount to the person interested,\ntogether with all costs reasonably incurred by him in the prosecution of the proceedings under this\nAct relating to the said land.\n(3) The provisions of Part III of this Act shall apply, so far as may be, to the determination of\nthe compensation payable under this section.\n1\nThis section has been amended in N.W.F.P. by the Land Acquisition (North-West Frontier Province Amdt.) Act, 1947 (N.W.F.P. Act 19 of\n1947).\n2\nSubs. by Ord. XXVII of 1981, s. 5 and Sch. IV (only to the extent of Islamabad Capital Territory).\n3\nThe words and brackets “or (within the towns of Calcuta, Madras and Bombay) to the Commissioner of Police” Omitted by A.O. 1949, Sch.\n4\nThe words and brackets “or Commissioner (as the case may be)” Omitted , ibid ;"
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Acquisition of part of house or building",
      "content": "(1) The provisions of this Act shall not be put\nin force for the purpose of acquiring a part only of any house, manufactory or other building, if the\nowner desire that the whole of such house, manufactory or building shall be so acquired:\nProvided that the owner may, at any time before the Collector has made his award under\nsection 11, by notice in writing, withdraw or modify his expressed desire that the whole of such\nhouse, manufactory or building shall be so acquired:\nProvided also that, if any question shall arise as to whether any land proposed to be taken\nunder this Act does or does not form part of a house, manufactory or building within the meaning of\nthis section, the Collector shall refer the determination of such question to the Court and shall not\ntake possession of such land until after the question has been determined.\nIn deciding on such a reference the Court shall have regard to the question whether the land\nproposed to be taken is reasonably required for the full and unimpaired use of the house,\nmanufactory or building.\n(2) If, in the case of any claim under section 23, sub‑section (1), thirdly, by a person\ninterested, on account of the severing of the land to be acquired from his other land, the 1[Provincial\nGovernment] is of opinion that the claim is unreasonable or excessive, it may, at any time before the\nCollector has made his award, order the acquisition of the whole of the land of which the land first\nsought to be acquired forms a part.\n(3) In the case last here in before provided for, no fresh declaration or other proceedings\nunder Sections 6 to 10, both inclusive, shall be necessary; but the Collector shall without delay\nfurnish a copy of the order of the 1[Provincial Government] to the person interested, and shall\nthereafter proceed to make his award under section 11."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Acquisition of land at cost of a local Authority or Company",
      "content": "_(1) Where the\nprovisions of this Act are put in force for the purpose of acquiring land at the cost of any fund\ncontrolled or managed by a local authority or of any Company, the charges of and incidental to such\nacquisition shall be defrayed from or by such fund or Company.\n2\n[(1-A) Any charges to be defrayed from the funds of a local authority or a Company\nunder sub-section (1), may be recovered, in addition to any other mode of recovery provided in\nany other law, as arrears of land revenue.]\n(2) In any proceeding held before a Collector or Court in such cases the local authority or\nCompany concerned may appear and adduce evidence for the purpose of determining the amount of\ncompensation:\nProvided that no such local authority or Company shall be entitled to demand a reference\nunder section 18."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Exemption from stamp duty and fees. No award or agreement made under this Act",
      "content": "shall be chargeable with stamp duty, and no person claiming under any such award or agreement\nshall be liable to pay any fee for a copy of the same.\n1\nSubs. by A. O.,1937, for “L. G.”\n2\nIns.by Ord. No. XLIX of 1969, s. 25."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Notice in case of suits for anything done in pursuance of Act. No suit or other",
      "content": "proceeding shall be commenced or prosecuted against any person for anything done in pursuance of\nthis Act, without giving to such person a month’s previous notice in writing of the intended\nproceeding, and of the cause thereof, nor after tender of sufficient amends."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Code of Civil Procedure to apply to proceedings before Court. Save in so far as they",
      "content": "may be inconsistent with anything contained in this Act, the provisions of the 1Code of Civil\nProcedure (XIV of 1882) shall apply to all proceedings before the Court under this Act.\n2[54. Appeals in proceedings before Court. Subject to the provisions of the Code of Civil\nProcedure, 1908 (V of 1908), applicable to appeals from original decrees, and notwithstanding\nanything to the contrary in any enactment for the time being in force, an appeal shall only lie in any\nproceedings under this Act to the High Court from the award, or from any part of the award, of the\nCourt and from any decree of the High Court passed on such appeal as aforesaid an appeal shall lie\nto 3[the Supreme Court] subject to the provisions 4[of article 185 of the Constitution]]."
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Power to make rules",
      "content": "_(1) The 5[Provincial Government] shall 6* * * have power to\nmake 7rules consistent with this Act for the guidance of officers in all matters connected\nwith its enforcement, and may from time to time alter and add to the rules so made.\n8\n*             *             *            *            *            *            *\n(2) The power to make, alter and add to rules under sub‑section (1) shall be subject to the\ncondition of the rules being made, altered or added to after previous publication.\n(3) All such rules, alterations and additions shall 9* * * be published in the official Gazette,\nand shall thereupon have the force of law.\n1\nSee now the Code of Civil Procedure, 1908 (5 of 1908).\n2\nSubs. by s. 3 of the Land Acquisition (Amendment) Act, 1921 (10 of 1921), for the original section.\n3\nSubs. by A.O., 1961, Art. 2 and Sch., for “His Majesty in Council” (with effect from the 23rd March, 1956).\n4\nsubs. by Ord. XXVII of 1981, s. 5 and Sch. IV (only to the extent of the Islamabad Capital Territory).\n5\nSubs. by A.O., 1937, for “L.G”.\n6\nThe words “subject to the control of the G.G. in C.” which had been ins. by the Decentralization Act, 1914 (4 of 1914), were rep. by the\nDevolution Act, 1920 (38 of 1920), s .2 and Sch. I.\n7\nFor rules made under this section, see different local Rules and Orders.\n8\n9\nThe words “when sanctioned by the G.G. in C.” were rep. by the Decentralization Act, 1914 (4 of 1914), s .2 and Sch., Pt.I.\n________________"
    }
  ],
  "definitions": []
}
