{
  "id": "pk-lansdowne-bridge-act-1892",
  "type": "statute",
  "title": "Lansdowne Bridge Act, 1892",
  "title_en": "Lansdowne Bridge Act, 1892",
  "short_name": "LBA",
  "status": "in_force",
  "issued_date": "1892-10-21",
  "in_force_date": "1892-10-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJw%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Lansdowne Bridge Act, 1892 (VIII of 1892) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Levy of tolls. Notwithstanding the repeal of the lastly hereinbefore mentioned Act 10[the",
      "content": "Provincial Government] may cause such rates of toll, not exceeding the rates mentioned in the\nschedule annexed to that Act, as 1l[it] may think fit to be levied in respect of the said Lansdowne\nBridge, and may place the collection of such tolls under the management of such persons as may\nappear to 12[it] proper, and all the provisions of the said last mentioned Act shall apply to such tolls\nand the collection and recovery thereof in the same manner as if such provisions were herein re -\nenacted verbatim.\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1892, Pt. V, p. 67 and for Proceedings in Council, see ibid., 1892, Pt. VI, pp. 70 and 75.\n2\nThe word “the” rep. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 3 and 2nd Sch.\n3\nSubs. by A. O., 1949, Sch., for “Presidency of Bombay”.\n4\n5\nIns. by A. O., 1949, Sch.\n6\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government” Which had been subs. by A.O., 1949, Sch., for “Government of India”.\n7\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch., for the original sub-section (2) as ended\nby A. O., 1949, Arts. 3(2) and 4.\n8\nThe word “and” rep. by the Repealing and Amending Act, 1914 (10 of 1914), s. 3 and Sch. II.\n9\nSub-section (3) was rep. ibid.\n10\nSubs. by A. O., 1937, for” the G.G. in C.”\n11\nSubs. by A.O., 1937, for “he”.\n12\nSubs. ibid., for “him”."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Validation of past levy of tolls. All tolls heretofore levied or collected upon the said",
      "content": "Lansdowne Bridge under the authority of the 1[Federal Government] or of the 2[Provincial\nGovernment of Bombay] shall be deemed to have been duly levied and collected under the\nauthority of the said Act as if the same had not been repealed."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Application of Act to public road and bridges. Where any public road or bridge has or",
      "content": "shall have been made and repaired at the expense of 3[the Federal Government or any Provincial\nGovernment] and no other adequate provision shall have been made for the levy and collection of\ntolls thereon, 4[the Provincial Government] may, by notification in the 5[official Gazette], apply\nthis Act to such road or bridge, and thereupon all the provisions of this Act shall apply to such road\nor bridge as if the same had been herein named in addition to the said Lansdowne Bridge.\n_____________\nDate: 05-09-2024\n1\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government” which was subs. by A.O., 1937, for “G. G. in C.” .\n2\nSubs. by A. O., 1937, for “Governor of Bombay in Council”.\n3\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government” which was subs. by A.O.,1937 ,for “the G. of I.”.\n4\nSubs. by A. O., 1937, for “the G. G. in. C.”.\n5\nSubs. ibid., for “Gazette of India”."
    }
  ],
  "definitions": []
}
