{
  "id": "pk-lawyers-welfare-and-protection-act-2023",
  "type": "statute",
  "title": "Lawyers Welfare and Protection Act, 2023",
  "title_en": "Lawyers Welfare and Protection Act, 2023",
  "short_name": "LWAPA",
  "status": "in_force",
  "issued_date": "2023-03-30",
  "in_force_date": "2023-03-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5llaQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Lawyers Welfare and Protection Act, 2023 (XII of 2023) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act shall be called the Lawyers Welfare\nand Protection Act, 2023.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this act, unless the context otherwise requires,__\n(a)     “act of violence” means any act committed by any person against an advocate\nwith the intent to prejudice, affect or derail the process of impartial, fair and\nfearless conduct of cases before any court, tribunal or authority by which such\nadvocate is engaged and shall include the following:⸻\n(i)     harassment, coercion, assault, criminal force or threat impacting the\nliving or working conditions of such advocate and preventing him from\ndischarging his duties;\n(ii)    harm, injury, hurt either grievous or simple, or danger to the life of such\nadvocate, either within the premises of the courts or otherwise;\n(iii)   coercion by whatsoever means, by any person or authority to reveal or\npart with privileged communication or material which an advocate is\nbound to hold in confidence under the law;\n(iv)    coercion by whatsoever means of an advocate not to represent or to\nwithdraw his Vakalatnama or appearance to act, plead or appear on\nbehalf of a client before any court, tribunal or authority;\n(v)     loss or damage to any property or documents or material which such\nadvocate is bound to hold under the law; or\n(vi)    usage of derogatory language during the course of the judicial and quasi-\njudicial proceedings.\n(b)    “advocate” shall have the same meaning as assigned thereto in the Legal\nPractitioners and Bar Councils Act, 1973 (XXXV of 1973);\n(c)    “Bar Council” shall have the same meaning as assigned thereto in the Legal\nPractitioners and Bar Councils Act, 1973 (XXXV of 1973);\n(d)    “Code” means the Code of Criminal Procedure, 1898 (Act No. V of 1898);\n(e)    “Court” means the court notified under section 5 or established under any other\nlaw;\n(f)    “Government” means the Federal Government or the Provincial Government,\nas the case may be; and\n(g)    “offence” denotes any act made punishable under this Act or under any other\nlaw for the time being in force; and\n(h)    “privileged communication” shall have the same meaning as given in the\nQanun-e-Shahadat, 1984 (P.O. No. 10 of 1984).\n(2) Any expression or words used in this Act but not specifically defined shall have the same\nmeaning as assigned thereto in the Legal Practitioners and Bar Councils Act, 1973 (XXXV of 1973)\nand the Pakistan Penal Code, (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Offences and Punishments",
      "content": "(1) Whoever commits or abets the commission of act of\nviolence, except any act of violence covered by sub-clause (ii) of clause (a) of sub-section (1) of section\n2, against an advocate shall be punishable with imprisonment for a term which may extend to three\nyears or fine which may extend to hundred thousand rupees or with both.\n(2) Whoever, having already been convicted of an offence under this Act is convicted for the\nsecond time for any subsequent offence under this Act, shall be punished with imprisonment for a term\nwhich shall not be less than one year but which may extend to five years or fine which may extend to\ntwo hundred thousand rupees or with both.\n(3) Notwithstanding anything contained in the Code or any other law for the time being in\nforce, every offence committed under this Act shall be non-bailable, compoundable with permission\nof the Court and deemed to be a cognizable offence within the meaning of clause (f) of section 4 of\nthe Code and the words “cognizable case” as defined in the clause shall be construed accordingly."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Investigation",
      "content": "Notwithstanding anything contained in any other law for the time being in\nforce,__\n(a)    any offence committed under this Act shall be investigated by the police officer\nnot below the rank of an Inspector; and\n(b)     the investigation of the case registered under this Act shall be completed within\na period of fourteen days from the day of registration of the case."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Establishment of Court",
      "content": "(1) The Federal Government may, in consultation with the Chief\nJustice of the High Court concerned, designate, throughout the country, as many courts of Additional\nSessions Judges or such other courts, as it may deem necessary to try the offences under this Act."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Jurisdiction",
      "content": "Notwithstanding anything contained in the Code or any other law for the\ntime being in force, offences committed under this Act shall be tried by the Court notified under this\nAct."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Trial",
      "content": "The Court upon taking cognizance of a case under this Act, shall decide the case\nexpeditiously, preferable within six months and any adjournment in the case shall be followed by\nreasons:\nProvided that where the trial is not concluded within the stipulated period of six months, the\nCourt shall record reasons for the same."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Joint Trials",
      "content": "(1) While trying an offence under this Act, the Court may also try, at the same\ntrial, any other offence with which an accused may be charged under the Code, if the offence is\nconnected with such other offence.\n(2) Where in the course of trial of an offence under this Act, it is found that the accused person\nhas also committed another offence under any other law for the time being in force, the Court may\nconvict an accused for such other offence and pass sentence authorized by such other law."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Privileged communication of advocate",
      "content": "Notwithstanding anything contained in any other\nlaw for the time being in force,__\n(a)     no person, public servant or any authority shall have the power to arrest, detain,\ninvestigate any advocate under any law for the time being in force to obtain any\ndocument, material or any information from such advocate pertaining to his\nprofessional duties; and\n(b)     the violation of the clause (a) shall be deemed as act of violence within the\nmeaning of section 2."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Legal advisory",
      "content": "Every incorporated company having more than twenty million paid up\ncapital, autonomous body, corporation or statutory authority shall have to engage at least one\npracticing advocate as legal advisor on retainer-ship basis, whereas no advocate shall serve more than\nthree such entities as legal advisor simultaneously."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Provision of health facilities",
      "content": "The Government shall notify in relation to all the\nGovernment, and Semi Government hospitals, the right to every advocate, his spouse and dependent\nchildren for medical treatment at par with the gazetted Government officer, subject to presentation of\ntheir official cards and verification by the respective Bar Councils:\nProvided that for the purpose of this section, the parents, minor children, spouse of the advocate\nshall also be entitled to the same facilities."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Financial Facilities",
      "content": "All financial institutions shall extend to the advocates the provision\nof financial facilities without discrimination in any manner whatsoever, and in case of any violation,\non the complaint of aggrieved advocate, the concerned authority shall initiate appropriate action."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Shuhada Package",
      "content": "An advocate who is the victim of any act of terrorism or other\naggression while performing his professional duty, whose assailants are unknown, his family shall be\nentitled to the Shuhada package as is admissible to gazetted officers in BPS-18 of the Government."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Power to make rules",
      "content": "The Federal Government may make rules for carrying out the\npurpose of this Act."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Overriding effect",
      "content": "The provisions of this Act shall have effect notwithstanding anything\nto the contrary contained in any law for the time being in force."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Application of the Code",
      "content": "The provisions of the Code, to the extent not inconsistent with\nanything contained in this Act, shall apply mutatis-mutandis."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Removal of difficulties",
      "content": "Where any difficulty arises in giving effect to any of the\nprovisions of this Act, the Federal Government may, by notification in the official Gazette, make such\norder, not inconsistent with the provisions of this Act, as may appear to be necessary for the purpose\nof removing the difficulty.\n____________\nRGN Date: 26-09-2025"
    }
  ],
  "definitions": [
    {
      "term": "act of violence",
      "definition": "any act committed by any person against an advocate with the intent to prejudice, affect or derail the process of impartial, fair and fearless conduct of cases before any court, tribunal or authority by which such advocate is engaged and shall include the following:⸻ (i) harassment, coercion, assault, criminal force or threat impacting the living or working conditions of such advocate and preventing him from discharging his duties; (ii) harm, injury, hurt either grievous or simple, or danger to the life of such advocate, either within the premises of the courts or otherwise; (iii) coercion by whatsoever means, by any person or authority to reveal or part with privileged communication or material which an advocate is bound to hold in confidence under the law; (iv) coercion by whatsoever means of an advocate not to represent or to withdraw his Vakalatnama or appearance to act, plead or appear on behalf of a client before any court, tribunal or authority; (v) loss or damage to any property or documents or material which such advocate is bound to hold under the law; or (vi) usage of derogatory language during the course of the judicial and quasi- judicial proceedings.",
      "source_provision": "sec2"
    },
    {
      "term": "Code",
      "definition": "the Code of Criminal Procedure, 1898 (Act No. V of 1898);",
      "source_provision": "sec2"
    },
    {
      "term": "Court",
      "definition": "the court notified under section 5 or established under any other law;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government or the Provincial Government, as the case may be; and",
      "source_provision": "sec2"
    }
  ]
}
