{
  "id": "pk-legal-aid-and-justice-authority-act-2020",
  "type": "statute",
  "title": "Legal Aid and Justice Authority Act, 2020",
  "title_en": "Legal Aid and Justice Authority Act, 2020",
  "short_name": "LAAJA",
  "status": "in_force",
  "issued_date": "2020-03-18",
  "in_force_date": "2020-03-18",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5lqbQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Legal Aid and Justice Authority Act, 2020 (XVI of 2020) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Legal Aid and\nJustice Authority Act, 2020.\n(2) It extends to the whole of Pakistan.\n(3) This Act or any part thereof shall come into force on such date or dates as the Government\nmay, by notification in the official Gazette, appoint."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the subject or\ncontext.—\n(a)   “applicant” means any person who—\n(i) makes an application for legal aid under this Act or on whose behalf such an\napplication is made; or\n(ii) is of unsound mind or lunatic or minor;\n(b)   “Authority” means the Legal Aid and Justice Authority established under\nsection 3;\n(c)   “Board” means the Board of Governors of the Authority constituted under\nsection 4;\n(d)   “Chairperson” means Chairperson of the Board and includes any person for the\ntime being performing the functions of the Chairperson;\n(e)   “Court” means court established under any law for the time being in force;\n(f)   “Director-General” means the Director-General of the Authority;\n(g)   “Free Representation Unit” means a special unit comprising advocates and\nvolunteers to provide legal or other social services on pro bono basis either on\ncase to case basis or in respect of a group or set or type of cases other than the\npanel;\n(h)   “Government” means the Federal Government;\n(i)   “legal aid” means the provision of assistance, to a person who is unable to afford\nlegal assistance, representation and access to justice;\n(j)   “member” means a member of the Board;\n(k)    “panel” means the list of advocates and volunteers prepared by the Authority\nunder section 11;\n(l)    “prescribed” means prescribed by rules or regulations made under this Act, as\nthe case may be;\n(m)    “rules” mean the rules made under this Act;\n(n)    “Secretary” means the Secretary of the Board; and\n(o)    “volunteer” means any person other than an advocate who may provide legal or\nother services on pro bono or fee basis to the applicant.\n(2) A word or expression used in this Act and not defined shall have the same meaning as is\nassigned to it in the Code of Criminal Procedure, 1898 (Act V of 1898) or the Legal Practitioners and\nBar Councils Act, 1973 (XXXV of 1973)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Authority",
      "content": "(1) The Government, by notification in the official\nGazette, shall establish a Legal Aid and Justice Authority to carry out the purposes of this Act.\n(2) The headquarters of the Authority shall be at Islamabad and it may, with the prior approval\nof the Government, set up as many offices all over the country as, when and where required."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Management",
      "content": "(1) The general direction and administration of the Authority and its\naffairs shall vest in the Board, which shall exercise all powers and do all acts and things which may\nbe exercised or done by the Authority.\n(2) The Board shall, in the discharge of its functions, be guided on questions of policy by such\ndirections as the Government may give from time to time.\n(3) If any question arises as to whether any matter is a matter of policy or not, the decision of\nthe Government in respect thereof shall be final."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Composition of the Board",
      "content": "(1) The Board of Governors shall consist of the following\nmembers, namely:—\n(a)    Federal Minister for 1[Law and Justice]        Chairperson\n(b)    Attorney-General for Pakistan                    Member\n(c)    one Member from the Senate of Pakistan to        Member\nbe nominated by the Chairman Senate\n(d)    one Member of the National Assembly to be        Member\nappointed by the Speaker National Assembly\n(e)    Advocate General of each Province and            Member\nIslamabad Capital Territory\n(f)    Secretary, Ministry of Human Rights              Member\n(g)    Secretary, Ministry of Finance                   Member\n(h)    Secretary, Ministry of Law and Justice           Member\n1\nSubs. by Act No. XXXIX of 2024, s.2.\n(i)    Vice-Chairman, Pakistan Bar Council           Member\n(j)    one prominent female social worker            Member\n(k)    Director General of the Authority           Member-cum Secretary\n(2) The Chairperson shall preside at every meeting of the Board and in case of his absence for\nany reason, the Government may designate any other Minister as a Chairperson.\n(3) The Authority may, with the prior approval of the Government, co-opt any other person as\na member.\n(4) No act or proceeding of the Board shall be invalid merely on the ground of the existence\nof any vacancy, or any defect in the constitution of, the Board.\n(5) If an ex-officio member is unable to attend a meeting of the Board, he may authorize a\nrepresentative not below BPS-20 to attend the meeting."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Meetings of the Board",
      "content": "(1) The Chairperson may convene meetings of the Board at such\ntime and place as he considers necessary for the efficient performance of the functions of the Board.\n(2) At any meeting of the Board the quorum shall be seven members.\n(3) All issues arising at any meeting of the Board shall be decided by the majority of votes of\nthe members present and voting.\n(4) Subject to the provisions of this Act, the Chairperson may give directions regarding the\nprocedure to be followed at or in connection with any meeting of the Board."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Director",
      "content": "General.—(1) There shall be a Director-General of the Authority who shall be\nappointed by the Government at such remuneration and on such terms and conditions as it thinks fit.\n(2) No person shall be appointed as a Director-General unless he is qualified to be appointed\nas a judge of a High Court.\n(3) The Director-General shall be responsible to the Authority for the day-to-day\nadministration of the business of the Authority and shall discharge such duties and perform such\nfunctions as are assigned to him by the Board.\n1\n[(4) Where the Director General is absent or unable to perform his functions due to any reason\nor the post of Director General is vacant pending appointment of a regular incumbent, the authority\nmay authorize any officer to perform temporarily the functions of Director General, for a period not\nexceeding ninety days.]\n(5) Until the Board is duly constituted, the Director-General shall, subject to such directions\nas the Government may give from time to time, exercise the powers and perform the functions of the\nBoard.\n(6) The officers of the Authority shall have such powers and shall perform such functions as\nmay be assigned to them by the Director-General."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Powers and functions of the authority",
      "content": "(1) The Authority shall—\n1\nSubs. by Act No. XXXIX of 2024, s.3.\n(a)   make policies, principles and guidelines for providing legal aid and financial or\nother assistance including the prescription of criteria for qualification to obtain\nlegal aid and financial and other assistance;\n(b)   design and establish an effective mechanism for provision, monitoring and\nevaluation of legal aid;\n(c)   promote or cause to be promoted programmes designed to enhance public\nawareness of the legal aid system in Pakistan;\n(d)   undertake and promote research in the field of legal aid with special reference to\nthe need of such aid to the persons;\n(e)   advise the Government or any other agency in regard to enforcement of the right\nto fair trial and due process of law;\n(f)   take appropriate measures for spreading legal literacy and legal awareness\namongst the people and, in particular, to educate poor and vulnerable sections of\nthe society about the rights, benefits and privileges guaranteed by social welfare\nlegislations and other enactments as well as administrative programmes and\nmeasures;\n(g)   establish panels of advocates and volunteers in respect of each office in the\nprescribed manner and, subject to sub-section (2) of section 11, to add to or\nremove from that panel any advocate and volunteer where the Authority is\nsatisfied that the advocate or volunteer has derelicted his duty or it is in the interest\nof justice to do so;\n(h)   devise and prescribe structure of fees for legal aid to advocates and volunteers on\npanels;\n(i)   encourage the settlement of disputes by way of negotiations, arbitration and\nconciliation;\n(j)   manage and administer the resources of the Authority;\n(k)   allocate funds, monitor the expenditure of funds at all offices and withhold funds\nfrom any office;\n(l)   establish and monitor the implementation of standards and procedures for the\noperation of all offices;\n(m)   undertake any enquiry or investigation which the Authority thinks necessary or\ndesirable in relation to the discharge of its functions;\n(n)   perform such other functions as may be assigned to it by the Government; and\n(o)   do such other things as may be expedient or necessary for the proper performance\nof its functions under this Act.\n(2) In discharge of its functions, the Authority shall, wherever appropriate, act in coordination\nand cooperation with other individuals, governmental and non-governmental agencies, departments,\nbodies, authorities, universities engaged in the work of promoting the cause of legal services to the\npoor and vulnerable sections of the society."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Provision of legal aid, financial or other assistance in criminal matters",
      "content": "(1) The\nAuthority shall make appropriate arrangements for the provision of legal aid, financial or other\nassistance to an applicant who is charged with a criminal offence and is unable to afford legal, financial\nor other assistance, representation and access to justice, in such manner and to such extent as may be\nprescribed.\n(2) The person seeking legal aid, financial or other assistance shall apply to the Authority, in\nthe prescribed manner.\n(3) The application for purposes of sub-section (2) shall be supported by an affidavit sworn by\nthe applicant and such other documents as may be prescribed. In case of minors or lunatics or persons\nof unsound mind, the requirement of an application and affidavit shall not be applicable.\n(4) The eligibility of the applicant shall be assessed in the manner and according to eligibility\ncriteria as may be prescribed.\n(5) In prescribing the criteria for and in extending the legal, financial or other assistance,\npreference shall be given to disadvantaged women and children, especially in relation to matters of\nsexual offences.\n(6) For the purposes of assessing the means of the applicant, the Authority may in appropriate\ncases make such enquiries as it considers necessary into the means of the applicant and may direct any\nofficer to enquire into and report thereon.\n(7) A report to the Authority under sub-section (6) shall be made available to the applicant\nwho shall be allowed, if he so desires, to make his observation on the report.\n(8) The Authority shall decide the application of the applicant within seven days of receipt\nthereof."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Revocation of legal aid",
      "content": "Where after the assessment for the purpose of grant of legal,\nfinancial or other assistance or release thereof, the Authority comes to the conclusion that the applicant\nwas not eligible to receive the same due to filing of applications, affidavits or documents in relation\nthereto which are found to contain false particulars, the Authority may revoke the legal, financial or\nother assistance and take steps for the recovery of any amount undeservedly released to the applicant."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Panel of advocates and volunteers",
      "content": "(1) The Authority shall approve panels of advocates\nand volunteers in the prescribed manner in each district or, if necessary, in any tehsil for provision of\nlegal, financial or other assistance either on pro bono or on fee basis.\nExplanation.—The panel of advocates and volunteers on pro-bono basis shall include setting\nup of a Free Representation Unit.\n(2) The Authority shall monitor, assess and evaluate the quality of legal and volunteer services\nprovided by each advocate, volunteer and the Free Representation Unit.\n(3) The panel of advocates, volunteers and the Free Representation Unit shall maintain a\nproper record of the cases entrusted to them and shall provide information to the Authority at such\ntime and in such manner as may be prescribed."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Code of conduct",
      "content": "(1) The Government, on the recommendations of the Authority, may\nprescribe a code of conduct for panel advocates, volunteers and the Free Representation Unit.\n(2) The Authority may suspend or, subject to hearing, remove the advocates and volunteers\nfrom the panel or from the Free Representation Unit if found guilty of breach of that code, or\ndereliction of his duty."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Payments",
      "content": "(1) The Authority shall promptly make payment of professional fee,\ntravelling allowances and other out-of-pocket expenses, after deduction of the applicable taxes, to the\nadvocate, volunteer and the Free Representation Unit to whom a matter has been assigned in the\nmanner that may be prescribed.\n(2) Where costs are awarded in favour of the applicant in any matter in which the services of\nan advocate or volunteer of the panel or the Free Representation Unit were used, such costs shall be\nthe property of and be paid to the Authority. The applicant shall be reimbursed out of such costs for\nthe out-of- pocket expenses incurred by him in respect of such matter."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Appointment of officers, staff etc., by the Authority",
      "content": "The Authority may create posts\nand appoint such Directors, officers, staff, experts or consultants on such terms and conditions as may\nbe prescribed."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Staff and officers etc., to be public servants",
      "content": "The Director General, Directors, officers,\nstaff, experts and consultants of the Authority shall, when acting or purporting to act in pursuance of\nany of the provisions of this Act, be deemed to be public servants within the meaning of section 21 of"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Delegation of powers to the Director",
      "content": "General, etc.—(1) The Authority may, by general\nor special order and subject to such conditions as it may thinks fit to impose, delegate to the Director-\nGeneral, Directors or a member, or an officer of the Authority, all or any of its powers or functions\nunder this Act.\n(2) The Government may, by notification in the official Gazette, delegate all or any of the\nAuthority’s powers under this Act and the rules and regulations made thereunder to any other agency\nor department of the Government or to a provincial government with the consent of such government."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Legal Aid and Justice Authority Fund",
      "content": "(1) There shall be established a fund to be\nknown as the Legal Aid and Justice Authority Fund which shall vest in the Authority and shall be\nutilized by the Authority for the purpose of this Act, and to meet charges in connection with its\nfunctions under this Act including the provision of legal, financial or other assistance, including\npayment to meet bail amounts, penalties or fines of the applicants, payment of fees to advocates or\nvolunteers, salaries and other remuneration to the Director General, Directors, members, officers, staff,\nexperts and consultants of the Authority.\n(2) The Fund shall be financed from the following sources, namely—\n(a)   grants from the Federal Government, Provincial and Local Governments;\n(b)   aid and assistance from local, provincial, national and international authorities or\nagencies;\n(c)   contributions from the statutory bodies, corporations, private organizations and\nindividuals;\n(d)   income and earning from the moveable and immovable properties acquired or\nleased by the Authority; and\n(e)   any income from the investment of the amount credited to the Fund.\n(3) All sums payable to the Authority may be recovered as arrears of land revenue.\n(4) The amount credited to the Fund shall not lapse at the end of a financial year and shall be\navailable for utilization at any time."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Budget",
      "content": "The Authority shall, in respect of each financial year, submit for approval of the\nGovernment, on such date as may be prescribed, a statement of the estimated receipts and expenditure,\nincluding requirements of foreign exchange for the next financial year."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Audit and accounts",
      "content": "(1) The accounts of the Authority shall be audited every year by\nthe Auditor General of Pakistan in such manner as may be prescribed.\n(2) Copies of the audit reports shall be sent to the Government along-with the comments of\nthe Authority.\n(3) The audit report shall be available for public inspection.\n(4) The Government may issue directions to the Authority for rectification of any item objected\nto by the Auditor General of Pakistan and the Authority shall comply with such directions."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Submission of yearly reports and returns",
      "content": "As soon as possible after the end of every\nfinancial year but before the last day of the month of December of that year, the Authority shall submit\nto the Government a report on the conduct of its affairs for that year."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Protection of actions taken in good faith under this Act",
      "content": "No suit, prosecution or other\nlegal proceedings shall lie against the Government or the Authority or any officer or servant thereof\nor any person acting under the authority of the Government or the Authority for anything which is in\ngood faith done or intended to be done in pursuance of this Act or any rule or regulation made\nthereunder."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Tax exemptions",
      "content": "The income of the Authority, donations and contribution received by\nany nature levied by Federal, provincial, local governments or authorities or any institution."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Power to make rules",
      "content": "The Government may, by notification in the official Gazette, make\nrules to carry out the purposes of this Act."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Act to override other laws",
      "content": "The provisions of this Act shall have effect notwithstanding\nanything inconsistent therewith contained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to or applying the\nprovisions of this Act, the Government may make such order, not inconsistent with this Act or the\nrules, as may be necessary for removal of such difficulty."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Repeal and savings",
      "content": "(1) The Women in Distress and Detention Fund Act, 1996 (XV of\n1996), hereinafter called as repealed Act, shall stand repealed.\n(2) Notwithstanding the repeal under sub-section (1), all funds and accounts constituted and\nmaintained under the repealed Act shall be deemed to be in continuation of the corresponding funds\nand accounts constituted or maintained under this Act.\n93226                                                                        RGN Date: 30-01-2025"
    }
  ],
  "definitions": [
    {
      "term": "applicant",
      "definition": "any person who— (i) makes an application for legal aid under this Act or on whose behalf such an application is made; or (ii) is of unsound mind or lunatic or minor;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "the Legal Aid and Justice Authority established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of Governors of the Authority constituted under section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairperson",
      "definition": "Chairperson of the Board and includes any person for the time being performing the functions of the Chairperson;",
      "source_provision": "sec2"
    },
    {
      "term": "Court",
      "definition": "court established under any law for the time being in force;",
      "source_provision": "sec2"
    },
    {
      "term": "Director-General",
      "definition": "the Director-General of the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "Free Representation Unit",
      "definition": "a special unit comprising advocates and volunteers to provide legal or other social services on pro bono basis either on case to case basis or in respect of a group or set or type of cases other than the panel;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "legal aid",
      "definition": "the provision of assistance, to a person who is unable to afford legal assistance, representation and access to justice;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "panel",
      "definition": "the list of advocates and volunteers prepared by the Authority under section 11;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules or regulations made under this Act, as the case may be;",
      "source_provision": "sec2"
    },
    {
      "term": "Secretary",
      "definition": "the Secretary of the Board; and",
      "source_provision": "sec2"
    },
    {
      "term": "volunteer",
      "definition": "any person other than an advocate who may provide legal or other services on pro bono or fee basis to the applicant. (2) A word or expression used in this Act and not defined shall have the same meaning as is assigned to it in the Code of Criminal Procedure, 1898 (Act V of 1898) or the Legal Practitioners and Bar Councils Act, 1973 (XXXV of 1973).",
      "source_provision": "sec2"
    }
  ]
}
