{
  "id": "pk-legal-practitioners-and-bar-councils-act-1973",
  "type": "statute",
  "title": "Legal Practitioners and Bar Councils Act, 1973",
  "title_en": "Legal Practitioners and Bar Councils Act, 1973",
  "short_name": "LPABC",
  "status": "in_force",
  "issued_date": "1973-02-21",
  "in_force_date": "1973-02-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5prbw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Legal Practitioners and Bar Councils Act, 1973 (XXXV of 1973) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Act may be called the Legal Practitioners and\nBar Councils Act, 1973.\n(2) It shall come into force at once.\n1\n[1A. Overriding effect.___The provisions of this Act shall have effect notwithstanding\nanything inconsistent therewith contained in any other law for the time being in force.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.___In this Act, unless there is anything repugnant in the subject or context,",
      "content": "2\n[(a)    “advocate” means an advocate entered in any roll under the provisions of this\nAct;]\n(b)         “Bar Council” means a Bar Council constituted under this Act;\n(c)         “common roll” means the common roll of advocates of the High Court or, as\nthe case may be, the common roll of other advocates prepared and maintained\nby the Pakistan Bar Council under this Act;\n1\n(cc)            [*     *           *           *      *       *   *]\n(d)         “High Court”, in relation to a Provincial Bar Council 3[and Islamabad Bar\nCouncil], means the High Court of the Province 3[or Islamabad Capital\nTerritory], as the case may be, for which that Council is constituted;\n1\nIns. and omitted by Act No. XII of 2005, ss. 2 and 3.\n2\nSubs. by Act No. VIII of 1987, s. 2.\n3\nIns. and subs. by Act No. V of 2014, ss. 2 and 3.\n1\n[(da) “Islamabad Bar Council” means Islamabad Bar Council for Islamabad Capital\nTerritory constituted under this Act;]\n2\n[(e)    “legal practitioner” means an advocate;]\n3\n[(ee) “member”, in relation to a Bar Council, does not include the Chairman thereof;]\n(f)         “Pakistan Bar Council” means the Bar Council constituted for Pakistan under\nsection 11;\n(g)         “prescribed” means prescribed by rules made under this Act;\n4\n[(h)    “Provincial Bar Council” means a Provincial Bar Council of a Province and\nincludes the Islamabad Bar Council;]\n(i)         “Provincial roll” 1[and Islamabad Bar Council roll] means a roll of advocates of\nthe High Court or, as the case may be, a roll of advocates prepared and\nmaintained by a Provincial Bar Council 1[and Islamabad Bar Council] under\nthis Act;\n(j)         “revenue office” includes all courts (other than civil courts) trying suits under\nany law for the time being in force relating to landholders and their tenants or\nagents;\n(k)         “roll” means the roll of advocates maintained by a Bar Council;\n2\n[(kk) “roll of group of districts” means a roll of advocates of a High Court and a roll\nof the Advocates practicing in the districts of the group, as mentioned in the\nSchedule, prepared and maintained by a Provincial Bar Council 1[and Islamabad\nBar Council] ;]\n(l)         “subordinate court” means a court subordinate to the High Court;\n(m)         “tout” means a person—\n(i)         who procures, in consideration of any remuneration moving from any\nlegal practitioner, the employment of the legal practitioner in any legal\nbusiness; or who proposes to any legal practitioner or to any person\ninterested in any legal business to procure, in consideration of any\nremuneration moving from either of them, the employment of the legal\npractitioner in such business; or\n(ii)        who, for the purposes of such procurement, frequents the precincts of\ncourts or of revenue offices, or railway stations, landing stages, lodging\nplaces or other places of public resort;\n1\nIns. by Act No. V of 2014, ss. 2 and 3.\n2\nSubs. and Ins. by Act No. XII of 2005, s. 3.\n3\nIns. by Ordinance No. XL of 1978, s. 2.\n4\nSubs. by Act No. XXXV of 2018, s. 2.\n(n)         “Tribunal”, in relation to a Bar Council, means a Tribunal constituted by it\nunder this Act 1[; and]\n1\n[(o)    voter means:___\n(i)       in relation to election to a Provincial Bar Council 2[and Islamabad Bar\nCouncil], an advocate whose name for the time being appears on the roll\nof group of districts and to whom an identity card has been issued by a\nProvincial Bar Council 2[and Islamabad Bar Council] and who is not in\narrears of dues of the Provincial Bar Council 2[and Islamabad Bar\nCouncil] for a period exceeding six months; and\n(ii)      in relation to election to the Pakistan Bar Council, a member of the\nconcerned Provincial Bar Council 2[and Islamabad Bar Council].]\n________"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Constitution and incorporation of Bar Councils",
      "content": "(1) There shall be constituted in\naccordance with the provisions of this Act,—\n(i)         a Bar Council for Pakistan to be known as the Pakistan Bar Council; 2[*]\n3\n[(ii)   a Bar Council for each Province to be known as the Bar Council of the Province\nconcerned 2[; and]]\n2\n[(iii) Islamabad Bar Council for Islamabad Capital Territory.]\n(2) Every Bar Council shall be a body corporate having perpetual succession and a common\nseal with power to acquire and hold property, both movable and immovable, and to contract, and shall\nby the name by which it is known sue and be sued."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Term of Bar Council. 4[The] term of every Bar Council shall be 4[five] years beginning on",
      "content": "the first day of January following the general elections to the Provincial Bar Councils ; and at the end\nof each term the members of the Bar Council shall cease to hold office:\n5\n[Provided that the next elections of the Provincial Bar Councils and Islamabad Bar Council\nshall be held between the 1st October, 2020 and the 31st December, 2020 and term of the next\nProvincial Bar Councils and Islamabad Bar Council shall commence from the 1st January, 2021.]\n6\n[*     *           *         *          *          *          *]\n1\nSubs. and added of Act No. XII of 2005, s. 3.\n2\nIns., omitted, subs. and added by Act No. V of 2014, ss. 2 and 4.\n3\nSubs. by Ordinance No. XL of 1978, s. 3.\n4\nSubs. by Ordinance No. XVII of 1982, s. 2.\n5\nSubs. Act No. XXXV of 2018, s. 3.\n6\nReplealed by the Revision and Declaration Ordinance 1981, s. 2 and Sch."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Composition of Provincial Bar Councils",
      "content": "(1) Each Provincial Bar Council 1[and\nIslamabad Bar Council] shall consist 2[of]\n2\n[(a)   the Advocate-General of the Province 1[or Islamabad Capital Territory, as the\ncase may be,], ex-officio; and]\n(b)        such number of 2[*] members as may be elected by the advocates on the\nProvincial roll 1[or Islamabad Bar Council roll, as the case may be,] from\namongst themselves.\n3\n[(2) The number of members to be elected to the Provincial Bar Councils shall be as follows:___\n(a)        Punjab Bar Council                          …          75\nSindh Bar Council                           …          33\nN.W.F.P. Bar Council                        …          28\nBalochistan Bar Council                     …   4\n[08]; 1[*]\n1\n[Islamabad Bar Council                  …       05; and]\n(b)        the district-wise allocation of seats referred to in clause (a) for respective\nProvincial Bar Councils shall be in accordance with the Schedule annexed\nhereto.]\n3\n[(2A) For the purpose of election of members of a Provincial Bar Council 1[and Islamabad\nBar Council] from a district or districts under sub-section (2) the advocates entered on the roll of\n1\n[district or] group of districts as mentioned in the Schedule annexed hereto, shall constitute the\nelectoral college.]\n(3) 3[* *             *            *        *           *        *]\n(4) At an election of the members of a Provincial Bar Council 1[and Islamabad Bar Council]\nan advocate shall have as many votes as the number of members to be elected 5[from the 3[district, or\nas the case may be, the group of districts] concerned].\n2\n[(5) A member may resign his office by writing under his hand addressed to the Chairman of\nthe Council.]\n(6) 5[*               *                       *                   *                *       *   *]\nExplanation.—If any question arises whether an advocate is or is not, for the purposes of this\nsection, practising generally in a district, it shall be referred to the Advocate-General for the Province\nconcerned 1[or Islamabad Capital Territory], whose decision thereon shall be final.\n6\n[5A. Qualifications for membership of a Provincial Bar Council and the Islamabad Bar\nCouncil.__ A person shall be qualified to be elected as a member of a Provincial Bar Council and the\nIslamabad Bar Council if he,__\n1\nIns. and Omitted by Act No. V of 2014, ss. 2 and 5.\n2\nSubs. and omitted by Ordinance No. XL of 1978, s. 4.\n3\nSubs. and omitted by Act No. XII of 2005, s. 5.\n4\nSubs. by Act No. XV of 2021, s. 2.\n5\nIns., added and omitted by Ordinance No. XVII of 1982, s. 3.\n6\nSubs. by Act No. XXIV of 2025, s.2.\n(a)        is on the roll of advocates of High Court maintained by the concerned Provincial\nBar Council and Islamabad Bar Council for not less than ten years;\n(b)        has, on the day of filing of the nomination paper, been an advocate for not less than\nfifteen years, and has individually conducted not less than thirty decided cases;\n(c)        has cleared all the dues payable by him to the Provincial Bar Council and Islamabad\nBar Council; and\n(d)        has been a voter member of a Bar Association falling in the district, or districts in\nthe case of Karachi, from where he is a candidate for a period of not less than five\nyears.]\n1\n[5B. Disqualifications for membership of a Provincial Bar Council and the Islamabad Bar\nCouncil.__ A person shall be disqualified to be elected as a member of a Provincial Bar Council and the\nIslamabad Bar Council if he,__\n(a)        was dismissed or removed from the service of Government or of a public statutory\ncorporation; or\n(b)        has been convicted for an offence involving moral turpitude, sentenced to\nimprisonment for a term of not less than two years, except the one released five\nyears ago; or\n(c)        has furnished false information for the purposes of enrollment with a Bar Council;\nor\n(d)        has been found guilty of professional misconduct; or\n(e)        has been declared a tout; or\n(f)        is an undischarged insolvent; or\n(g)        is guilty of violating the Code of Conduct for the Bar Councils elections framed\nunder section 55(a) of this Act.]"
    },
    {
      "provision_ref": "sec5c",
      "section": "5C",
      "title": "Section 5C. Cessation of membership of Provincial Bar Council 2[and Islamabad Bar Council]",
      "content": "A\nmember of a Provincial Bar Council 2[and Islamabad Bar Council] shall cease to be such member if he—\n(a)        is appointed to an office of profit in the service of Pakistan; or\n(b)        is suspended or removed from practice under the provisions of Chapter VII; or\n(c)        incurs any of the disqualifications specified in section 5B.]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Chairman and Vice",
      "content": "Chairman of Provincial Bar Council 2[and Islamabad Bar\nCouncil].—(1) There shall be a Chairman and a Vice-Chairman of each Provincial Bar Council 2[and\nIslamabad Bar Council].\n3\n[(2) The Advocate-General for a Province 2[or Islamabad Capital Territory] shall be the Chairman\nof the Provincial Bar Council for that Province 2[or Islamabad Capital Territory, as the case may be,].\n1\nSubs. by Act No.XXIV of 2025, s.3.\n2\nIns. and added by Act No. V of 2014, s. 7.\n3\nSubs. by Ordinance No. XL of 1978, s. 5.\n(2A) If a member of a Provincial Bar Council 1[and Islamabad Bar Council] is appointed as\nthe Attorney-General for Pakistan or as the Advocate-General for a Province 1[or Islamabad Capital\nTerritory], his seat in the Council shall become vacant.]\n(3) The Vice-Chairman of each Provincial Bar Council 1[and Islamabad Bar Council] shall be\nelected in the prescribed manner by the members of that Council from amongst themselves.\n(4) Subject to the provisions of sub-section (8), the election of the Vice-Chairman shall be held\nas soon as may be after the commencement of every year and in any case not later than the thirty-first\nday of January.\n(5) Subject to the provisions of sub-sections (6) and (7), the Vice-Chairman shall hold office\n2\n[until his successor enters upon his office].\n(6) A Vice-Chairman may resign his office by writing under his hand addressed to the\nChairman.\n(7) A Vice-Chairman shall cease to hold his office if he is appointed to an office of profit in\n(8) Where the office of a Vice-Chairman becomes vacant, an election to the vacant office shall\nbe held within thirty days of the office becoming vacant.\n(9) The Chairman and Vice-Chairman shall have such powers and functions as may be\nprescribed."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Time of holding elections to a Provincial Bar Council 1[and Islamabad Bar Council]",
      "content": "—Election to a Provincial Bar Council 1[and Islamabad Bar Council] shall be held 3[on the first\nSaturday] of November in the year in which the term of the Provincial Bar Council 1[and Islamabad\nBar Council] expires:\nProvided that—\n(a)         elections to the first Provincial Bar Councils to be constituted under this Act\nshall be held so as to conclude; and\n(b)         the first Provincial Bar Councils to be constituted under this Act shall be\nconstituted, on such day as the Federal Government may, by notification in the\nofficial Gazette, specify 1[:]\n1\n[Provided further that___\n(a)        elections to the first Islamabad Bar Council to be constituted under this\nAct shall be held so as to conclude; and\n(b)        the first Islamabad Bar Council to be constituted under this Act shall be\nconstituted, on such day as the Federal Government may, by notification\nin the official Gazette, specify.]\n4\n[Provided also that irrespective of expiry of term of the Provincial Bar Councils and Islamabad\nBar Council, the next election of the said Bar Councils shall be held before the 31st day of December,\n2020.]\n3\n[Provided also that in case the elections cannot be held on the first Saturday, for any reasons,\nit shall be held on the second Saturday of November of the same year.]\n1\nIns. subs. and added by Act No. V of 2014, ss. 2, 7 and 8.\n2\nSubs. by Ordinance No. XVII of 1982, s. 5.\n3\nSubs. and added by Act No. XXIV of 2025, s.4.\n4\nIns. by Act No. XXXV of 2018, s. 5."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Election to Provincial Bar Council 1[and Islamabad Bar Council] not to be questioned",
      "content": "on certain grounds.— No election of a member to a Provincial Bar Council 1[and Islamabad Bar\nCouncil] shall be called in question on the ground merely that due notice thereof has not been given to\nany person entitled to vote thereat, if notice of the date has, not less than thirty days before that date,\nbeen published in the official Gazette."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Functions of a Provincial Bar Council 1[and Islamabad Bar Council]",
      "content": "(1) Subject to\n1\n[and Islamabad Bar Council] shall be—\n(a)       to admit persons as advocates on its roll; to hold examinations for purposes of\nadmission; to prepare and maintain a roll of such advocates 2[of the Province\n1\n[or Islamabad Capital Territory] as well as of each 3[District] 1[and to remove\nadvocates from such roll]] ;\n(b)       to admit persons as advocates entitled to practice before the High Court and to\nprepare and maintain a roll of such advocates;\n(c)       to entertain and determine cases of misconduct against advocates on its rolls\nand to order punishment in such cases;\n(d)       to safeguard the rights, privileges and interests of advocates on its rolls,\nincluding initiation of measures for fair and inexpensive dispensation of justice\nby the subordinate courts and tribunals;\n(e)       to promote and suggest law reform;\n(f)       to manage and administer the property and funds of the Provincial Bar Council\n1\n[and Islamabad Bar Council] and to invest any of its funds;\n(g)       to conduct the election of its members;\n5\n[(h)      to prescribe conditions for the recognition and functioning of, and to recognise\nand derecognise, Bar Associations;]\n(i)       to perform all other functions conferred on it by or under this Act 5[and to\ncomply with the directions given to it by the Pakistan Bar Council from time to\ntime] ; and\n(j)       to do all other things necessary for discharging the aforesaid functions.\n(2) A Provincial Bar Council 1[and Islamabad Bar Council] may, in accordance with the rules\nframed by it, and within the limits of the funds at its disposal for that purpose, make free legal aid\navailable to indigent litigants."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Committees of Provincial Bar Council 1[and Islamabad Bar Council]",
      "content": "(1) A\nProvincial Bar Council 1[and Islamabad Bar Council] shall constitute the following standing\ncommittees, namely:—\n1\nIns. by Act No. V of 2014, ss. 2 and 9.\n2\nIns. by Ordinance No. XL of 1978, s. 6.\n3\nSubs. by Act No. XII of 2005, s. 7.\n4\nSubs. and ins. by Ordinance No. XVII of 1982, s. 6.\n(a)          an executive committee consisting of a Chairman and not more than five other\nmembers, to be elected by the Council from amongst its members; 1[*]\n2\n[(aa) a disciplinary committee consisting of not more than five members to be elected\nby the Council from amongst its members; and]\n(b)          one or more enrolment committees, each consisting of a Judge of the High Court\nfor the Province 2[or Islamabad Capital Territory, as the case may be,]\n1\n[*******] nominated by the Chief Justice of that High Court, who shall be its\nChairman, and two other members elected by the Council from amongst its\nmembers.\n(2) Each of the aforesaid committees shall have such powers and functions as may be\nprescribed.\n(3) A Provincial Bar Council 2[and Islamabad Bar Council] may constitute from amongst its\nmembers such other committees as it may deem necessary for the performance of its functions under\nthis Act, and may authorise any such committee to co-opt as its members any other persons, not\nexceeding such number as the Council may determine.\n(4) The Chairman of every committee shall be entitled to vote and, in case of equality of votes\namong the members of the committee, shall have a second vote.\n_________"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Composition of Pakistan Bar Council",
      "content": "_1[(1)The Pakistan Bar Council shall consist of\nthe Attorney General for Pakistan, ex-officio and 2[twenty-three] members, who shall be elected on\nthe basis of a single transferable vote by the members of the Provincial Bar Councils as hereinafter\nspecified—\nBaluchistan                       …        …       …   …          1\nThe North-West Frontier Province ....                  …      3\n[4]\nThe Punjab                                 …       …   …      11\nSind                   …         …         …       …   …       6]\n2\n[Islamabad Capital Territory                              01]\n1\nOmitted and subs. by Ordinance No. XVII of 1982, ss. 7 and 8.\n2\nIns., subs. and added by Act No. V of 2014, ss. 2, 10 and 11.\n3\nSubs. by Act No. XII of 2005, s. 8.\n1\n[(1A) The members of Pakistan Bar Council shall be elected by single transferable vote from\neach province 2[and Islamabad Capital Territory] by the members of their respective Provincial Bar\nCouncil 2[and Islamabad Bar Council].]\n(2) A member of a Provincial Bar Council 2[and Islamabad Bar Council] who is elected to be\na member of the Pakistan Bar Council shall 3[* * *] cease to be a member of the Provincial Bar\nCouncil 2[and Islamabad Bar Council].\n4\n[(3) No election of a member to the Pakistan Bar Council shall be called in question on the\nground merely that due notice thereof has not been given to any person entitled to vote thereat, if the\nnotice of the date has, not less than thirty days before that date, been published in the official Gazette.]\n3\n[(4) A member may resign his office by writing under his hand addressed to the Chairman of\nthe Council.\n(5) 5[* *            *          *          *          *      *]\n[11A. Qualifications for membership of Pakistan Bar Council. — A person shall be\n5\nqualified to be elected as a member of the Pakistan Bar Council if he—\n(a)         is on the roll of advocates of the Supreme Court maintained by the Pakistan\nBar Council 6[for not less than five years] ;\n(b)         has, on the day of the filing of the nomination paper, been an advocate for not\nless than 6[twenty] years; and\n(c)         has cleared all the dues payable by him to the Pakistan Bar Council."
    },
    {
      "provision_ref": "sec11b",
      "section": "11B",
      "title": "Section 11B. Disqualifications for membership of Pakistan Bar Council",
      "content": "A person shall be\ndisqualified to be elected as a member of the Pakistan Bar Council if he—\n(a)         was dismissed or removed from the service of Government or of a public\nstatutory corporation; or\n(b)         has been convicted for an offence involving moral turpitude; or\n(c)         has been found guilty of professional misconduct; or\n(d)         has been declared a tout; or\n(e)         is an undischarged insolvent.\n1\nIns. by Act No. XII of 2005, s. 8.\n2\nIns. by Act No. V No. 2014, ss. 2 and 11.\n3\nOmitted and added by Ordinance No. XL of 1978, s.7.\n4\nAdded by Act No. XXXVI of 1973, s. 3.\n5\nOmitted and ins. by Ordinance No. XVII of 1982, ss. 8 and 9.\n6\nIns. and subs. by Act No. XXXV of 2018, s. 6."
    },
    {
      "provision_ref": "sec11c",
      "section": "11C",
      "title": "Section 11C. Cessation of membership of Pakistan Bar Council",
      "content": "A member of the Pakistan Bar\nCouncil shall cease to be such member if he—\n(a)        is appointed to an office of profit in the service of Pakistan; or\n(b)        is suspended or removed from practice under the provisions of Chapter VII; or\n(c)        incurs any of the disqualifications specified in section 11B.]"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Chairman and Vice",
      "content": "chairman of the Pakistan Bar Council.—(1) The\nAttorney-General for Pakistan shall be the Chairman ex-officio of the Pakistan Bar Council.\n1\n[(1A) If a member of the Pakistan Bar Council is appointed as the Attorney-General for\nPakistan or as the Advocate-General for a Province 2[or Islamabad Capital Terrritory], his seat in the\nCouncil shall become vacant.]\n(2) There shall be a Vice-Chairman of the Pakistan Bar Council who shall be elected in the\nprescribed manner by the members of that Council from amongst themselves.\n(3) Subject to the provisions of sub-section (7), the election of the Vice-Chairman shall be held\nas soon as may be after the commencement of every year and in any case not later than the thrity-first\nday of January.\n(4) Subject to the provisions of sub-sections (5) and (6), the Vice-Chairman shall hold office\n3\n[until his successor enters upon his office].\n(5) A Vice-Chairman may resign his office by writing under his hand addressed to the\nChairman.\n(6) A Vice-Chairman shall vacate his office if he is appointed to an office of profit in the service\nof Pakistan or is suspended or removed from practice under the provisions of Chapter VII.\n(7) Where the office of a Vice-Chairman becomes vacant, an election to the vacant office shall\nbe held in the manner prescribed under sub-section (2), within thirty days of the office becoming\nvacant.\n(8) The Chairman and the Vice-Chairman shall have such powers and functions as may be\nprescribed."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Functions of the Pakistan Bar Council",
      "content": "3[(1)] Subject to the provisions of this Act and\nthe rules made thereunder, the functions of the Pakistan Bar Council shall be—\n(a)        to prepare and maintain a common roll of advocates;\n4\n[(b)   to admit persons as advocates entitled to practise before the Supreme Court and\nto prepare and maintain a roll of such advocates and to remove advocates from\nsuch roll;\n1\nIns. by Ordinance No. XL of 1978, s. 8.\n2\nIns. by Act No. V of 2014, s. 12\n3\nSubs. and re-numbered by Ordinance No. XVII of 1982, s. 10.\n4\nAdded by Act No. VIII of 1987, s. 4.\n(c)        to entertain and determine cases of misconduct against advocates of the\nSupreme Court and to award punishment in such cases;]\n(d)        to lay down standards of professional conduct and etiquette for advocates;\n(e)        to lay down the procedure to be followed by its committees ;\n(f)        to safeguard the rights, privileges and interests of advocates, including initiation\nof measures for fair and inexpensive dispensation of justice by the subordinate\ncourts and tribunals;\n(g)        to promote and suggest law reform;\n(h)        to deal with and dispose of, and to tender advice in relation to, any matter arising\nunder this Act which may be referred to it by a Provincial Bar Council 1[and\nIslamabad Bar Council] ;\n(i)        to exercise general control and supervision over the Provincial Bar Councils\n2\n[and to issue directions to them from time to time] 3[*] 3[which shall be binding\nupon them;]\n(j)        to promote legal education and prescribe standards of such education in\nconsultation with the universities in Pakistan and the Provincial Bar Councils ;\n(k)        to recognize universities whose degree in law shall be a qualification for\nenrolment as an advocate;\n(l)        to manage and administer the property and funds of the Pakistan Bar Council,\nand to invest any of its funds;\n2\n[(la) to provide free legal aid;\n(lb)       to hold conferences, seminars, moots, lectures, jurists' conferences and other\nmeetings for promoting legal knowledge and learning in the legal profession;\n(lc)       to prescribe conditions for the recognition and functioning of, and to recognise\nand derecognise, the Supreme Court Bar Association or any Bar Association at\nthe national level;\n(ld)       to give directions in accordance with the provisions of this Act to the Provincial\nBar Councils 1[and Islamabad Bar Council] in respect of the recognition,\nderecognition and functioning of Bar Association.]\n3\n[(le) to provide free specialized services for awareness, promotion and enforcement\nof human rights;]\n(m)        to perform all other functions conferred on it by or under this Act;\n(n)        to do all other things necessary for discharging the aforesaid functions.\n1\nIns. by Act No. V of 2014, s. 2.\n2\nAdded and Ins. by Ordinance No. XVII of 1982, s. 11.\n3\nOmitted and ins. by Act No. XXXV of 2018, s. 7.\n1\n[(2) Any person aggrieved by an order or decision of a Provincial Bar Council 2[and\nIslamabad Bar Council] 3[,the Supreme Court Bar Association or a Bar Association at the national\nlevel] may, within thirty days of such order or decision, prefer an appeal to the Pakistan Bar Council,\nwhose decision in such appeal shall be final.]\n3\n[(3) The provisions of sections 5 and 12 of the Limitation Act, 1908 (IX of 1908), shall apply\nto appeals under sub-section (2).]"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. The first Pakistan Bar Council",
      "content": "As soon as may be, after the constitution of the\nProvincial Bar Councils under this Act, the first Pakistan Bar Council shall be constituted in\naccordance with the provisions of section 11."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Committees of the Pakistan Bar Council",
      "content": "(1) The Pakistan Bar Council shall constitute\nthe following committees, namely:—\n1\n[(a)    a disciplinary committee consisting of a Judge of the Supreme Court nominated\nby the Chief Justice of Pakistan, who shall be its Chairman, and four other\nmembers elected by the Council from amongst its members:\nProvided that the Attorney-General for Pakistan shall not be a member\nof the disciplinary committee;]\n(b)         an executive committee consisting of seven members elected by the Council\nfrom amongst its members; and\n(c)         an enrolment committee consisting of a Judge of the Supreme Court nominated\nby the Chief Justice of Pakistan, who shall be its Chairman, and two other\nmembers elected by the Council from amongst its members.\n(2) The Pakistan Bar Council may constitute from amongst its members such other committees,\nincluding a legal education committee 4[and human rights committee], as it may deem necessary for\nmembers any other persons, not exceeding such number as the Council may determine.\n(3) The Chairman of every committee shall be entitled to vote and, in case of equality of votes\namong the members of the committee, shall have a second vote.\n_________"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Filling of casual vacancies",
      "content": "If the seat of a member of a Bar Council becomes vacant\nduring the term of office of the Council—\n3 5\n[ [(a) In case of the Pakistan Bar Council, the vacancy shall be filled by the person\nwho received in the last elections from the same province the highest number\nof single transferable votes next after the member, the vacancy in whose seat is\nto be filled or if there be no such person then the vacancy shall be filled by a\nperson elected in accordance with the provisions of section 11;]\n1\nAdded by Ordinance No. VIII of 1982, s. 11.\n2\nIns. by Act No. V of 2014, s.2.\n3\nIns. and subs. by Act No. VIII of 1987, ss. 4 and 5.\n4\nIns. by Act No. XXXV of 2018, s. 8.\n5\nSubs. by Act No. XII of 2005, s. 10.\n(b)        in the case of a Provincial Bar Council 1[and Islamabad Bar Council], the\nvacancy shall be filled by the person who received, in the same election and\nfrom the same district or, as the case may be, group of districts, the highest\nnumber of votes next after the member the vacancy in whose seat is to be filled,\nor if there be no such person, by a person eligible for election to that Council\nfrom the same district or, as the case may be, group of districts who is co-opted\nby the Provincial Bar Council 1[and Islamabad Bar Council].]"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Funds of Bar Councils",
      "content": "(1) All sums received by a Provincial Bar Council 1[and\nIslamabad Bar Council] as enrolment fees or as grants, donations or subscriptions shall form part of\nthe fund of that Council and that fund, subject to the provisions of sub-section (2), shall be managed,\nadministered and utilized in such manner as may be prescribed.\n2\n[(2) Every person applying for enrolment as an advocate or an advocate of the High Court\nshall pay one-third of the prescribed fee to the Pakistan Bar Council and the balance to the Provincial\nBar Council concerned 1[or Islamabad Bar Council, as the case may be,], in such manner as may\nprescribed by the Pakistan Bar Council.]\n(3) All sums received by the Pakistan Bar Council under sub-section (2) or as enrolment fees,\ngrants, donations, or subscriptions shall form part of the fund of that Council and that fund shall be\nmanaged, administered and utilized in such manner as may be prescribed."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Accounts and audit",
      "content": "(1) Every Bar Council shall cause to be maintained such books of\naccounts and other books in such form and in such manner as may be prescribed.\n(2) The accounts of a Bar Council shall be audited by an auditor who is a chartered accountant\nwithin the meaning of the Chartered Accountants Ordinance, 1961 (X of 1961), at such times and in\nsuch manner as may be prescribed.\n(3) As soon as the accounts of a Provincial Bar Council 1[and Islamabad Bar Council] have\nbeen audited, that Bar Council shall send a copy of such accounts, together with a copy of the report\nof the auditor thereon, to the Pakistan Bar Council."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Vacancies in Bar Councils, etc., not to invalidate action taken",
      "content": "No act done by a Bar\nCouncil or any Tribunal or committee thereof shall be called in question on the ground merely of the\nexistence of any vacancy in, or any defect in the constitution of, such Council, Tribunal or committee."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Indemnity",
      "content": "No suit or other legal proceedings shall lie against any Bar Council or any\ncommittee, Tribunal, member, officer or servant of the Bar Council for any act in good faith done or\nintended to be done in pursuance of the provisions of this Act or the rules made thereunder.\n_______\n1\nIns. by Act No. V of 2014, ss. 2 and 15.\n2\nSubs. by Ordinance No. XVII of 1982, s.13.\nADVOCATES, THEIR ENROLMENT, RIGHT TO PRACTISE, SENIORITY, PRE-\nAUDIENCE, ETC."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Classes of advocates",
      "content": "There shall be the following four classes of advocates, namely:—\n(a)        senior Advocates of the Supreme Court;\n(b)        advocates of the Supreme Court 1[including advocates-on-record];\n(c)        advocates of the High Court; and\n(d)        other advocates."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Rights of advocates to practise",
      "content": "(1) Save as otherwise provided in this Act, no person\nshall be entitled to practise the profession of law unless he is an advocate.\n2 1\n[ [(2) Subject to the provisions of this Act and the Rules made thereunder, ___\n(a)        an advocate of the Supreme Court shall be entitled as of right to practice\nthroughout Pakistan and to appear, act and plead before any Court or Tribunal\nor any Judicial authority in Pakistan;\n(b)        an advocate of a High Court shall be entitled as of right to practice throughout\nPakistan and to appear, act and plead before any Court, Tribunal or any Judicial\nauthority in Pakistan except the Supreme Court; and\n(c)        any other advocate shall be entitled as of right to practice throughout the\nProvince 3[and Islamabad Capital Territory] where he is enrolled to appear, act\nand plead before any court, Tribunal or any Judicial authority in such Province\n3\n[and Islamabad Capital Territory] other than the High Court.]\n(2A) Where rules have been made by any High Court regulating the conditions subject to which\nadvocates of other High Courts may be permitted to practise in the High Court, such advocates shall\nnot be entitled to practise therein otherwise than subject to such conditions.]\n(3) No advocate shall appear or act for any person in any court or tribunal unless he has been\nappointed for the purpose by such person by a document in writing signed by such person or his\nrecognized agent or some other person duly authorised by him to make such appointment, and such\ndocument has been filed in such court or tribunal:\nProvided that nothing in this sub-section shall apply to—\n(a)        a Public Prosecutor or any advocate appointed by the State; or\n(b)        an advocate when appearing on behalf of another advocate, if the advocate so\nappearing has filed a memo of appearance:\nProvided further that an advocate may be allowed to appear for an accused in custody on his\nundertaking to file the document required under this sub-section.\n1\nAdded and Subs. by Act XII of 2005, ss.11 and 12.\n2\nSubs. by Act No. XVI of 1985, s. 4.\n3\nIns. by Act V of 2014, s. 16.\n1\n[23. Roll of advocates of the Supreme Court.—The Pakistan Bar Council shall prepare and\nmaintain a roll of advocates of the Supreme Court in which shall be entered the names of all persons\nwho are senior advocates or advocates including advocates-on-record, entitled to practice in the\nSupreme Court.]"
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Admission and enrolment of advocates of the High Court",
      "content": "1[*] Each Provincial Bar\nCouncil 2[and Islamabad Bar Council] shall prepare and maintain 3[for the Province 2[and Islamabad\nCapital Territory] and each 1[District] in the Province 2[and Islamabad Capital Territory] two separate\nrolls] of advocates of the High Court in which shall be entered the names of—\n(a)        all persons who were, as advocates, entitled to practise in the High Court\nimmediately before the commencement of this Act; and\n(b)        all persons who are admitted as advocates of the High Court under the\nprovisions of this Act.\n4\n(2)           [*       *             *           *            *            *            *]"
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Admission and enrolment of other advocates",
      "content": "3[(1)] Each Provincial Bar Council\n2\n[and Islamabad Bar Council] shall, besides the 3[rolls] of advocates to be prepared and maintained\nby it under section 24, prepare and maintain 3[for the province 2[and Islamabad Capital Territory] and\neach 2[district in the Province and Islamabad Capital Territory] two separate rolls] of advocates in\nwhich shall be entered the names of—\n(a)        all persons who were, as advocates, entitled to practise in any court subordinate\nto the High Court immediately before the commencement of this Act; and\n(b)        all persons who are admitted as advocates under the provisions of this Act.\n4\n(2)            [*     *          *          *          *          *            *]"
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Persons qualified for admission as advocates",
      "content": "1[*] Subject to the provisions of this\nAct and the rules made thereunder, a person shall be qualified to be admitted as an advocate if he fulfils\nthe following conditions, namely:—\n(a)        he is a citizen of Pakistan or a person deriving his nationality from the State of\nJammu and Kashmir:\nProvided that, subject to the other provisions of this Act, a national of\nany other country 5[who has resided in Pakistan for a period of not less than one\nyear immediately preceding the day on which he applies for admission] may be\nadmitted as an advocate if citizens of Pakistan duly qualified are permitted to\npractise law in that other country;\n(b)        he has completed the age of twenty­one years;\n1\nSubs. and omitted by Act No. XII of 2005, ss. 13, 14 and 15.\n2\nIns.and subs. by Act No. V of 2014, ss. 2, 17 and 18.\n3\nSubs. and re-numbered by Ordinance No. XL of 1978. s. 10.\n4\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch., II.\n5\nIns. by Act No. XVI of 1976, s. 2.\n(c)        he is a Barrister or is or was enrolled as an advocate of a High Court in any area\nwhich before the fourteenth day of August, 1947, was comprised within India\nas defined by the Government of India Act, 1935 (26 Geo 5, c 2) or has\nobtained—\n(i)        before the 7th day of February, 1966, a degree in law from any\nuniversity in Pakistan; or\n(ii)       before the fourteenth day of August, 1947, a degree in law from any\nuniversity in any area which was comprised before that date whithin\nIndia as defined by the Government of India Act, 1935 (26 Geo 5, c 2),\nor\n1\n[(iii) a bachelor degree in law from a university or institute recognized by the\nHigher Education Commission and the Pakistan Bar Council;]\n1\n[(cc) he has passed an assessment test conducted by an organization appointed by the\nFederal Government;]\n(d)        he has undergone such course of training and passed such examination after the\ntraining as may be prescribed by the Pakistan Bar Council:\nProvided that this clause shall not apply to any class of persons who, by\nreason of their legal training or experience, are declared by the Pakistan Bar\nCouncil to be exempt from the provisions of this clause; and\n(e)        he has paid such enrolment fee and fulfils such other conditions as may be\nprescribed by the Pakistan Bar Council.\n2\n(2)            [*     *          *      *      *       *    *]\n2\n(3)             [*    *          *      *      *       *    *]"
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Persons qualified for admission as advocates of a High Court",
      "content": "Subject to the\nprovisions of this Act and the rules made thereunder, a person shall be qualified to be admitted as an\nadvocate of a High Court if he fulfils the following conditions, namely:—\n(a)        he has practised as an advocate, vakil or pleader before subordinate courts in\nPakistan for a period of not less than two years; or\n(b)        he has practised outside Pakistan as an advocate before any High Court\nspecified in this behalf by the Pakistan Bar Council; or\n(c)        he has, for reason of his legal training or experience, been exempted by the\nProvincial Bar Council 3[and Islamabad Bar Council], with the previous\napproval of the High Court, from the requirements of clause (a) and clause (b);\nand\n(d)        he has paid such enrolment fee and fulfils such other conditions as may be\nprescribed by the Pakistan Bar Council.\n1\nSubs. and ins. by Act No. XXXV of 2018, s. 9.\n2\nOmitted by Act No. XII of 2005, s. 15.\n3\nIns. by Act No. V of 2014, s. 2.\n1\n[28. Persons qualified for admission as advocates of the Supreme Court.__Subject to the\nprovisions of this Act and the rules made thereunder, a person shall be qualified to be admitted as a\nsenior advocate and an advocate of the Supreme Court including an advocate-on-record if he fulfils\nsuch conditions as may be laid down in this behalf from time to time by the Rules of Pakistan Bar\nCouncil and has paid such enrolment fee or other dues as may be prescribed by that Council.]\n1\n[28A. Person disqualified to be enrolled as advocate.___A persons shall be disqualified\nfrom being admitted as an advocate of any court if__\n(a)        he was dismissed or removed from service of Government or of a public\nstatutory corporation on a charge involving misconduct or moral turpitude; or\n(b)        he has been convicted for an offence involving moral turpitude by a court; or\n(c)        he has been declared a tout and such declaration has not been withdrawn.]"
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Eligibility of women for admission",
      "content": "No woman shall be disqualified for admission as\nan advocate for reason only of her sex."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Authority to whom applications for enrolment may be made",
      "content": "An application for\nadmission as an advocate, other than an advocate of the Supreme Court, shall be made in the prescribed\nform to the Provincial Bar Council 2[and Islamabad Bar Council] within whose jurisdiction the\napplicant proposes to practise generally 3[; and an application for admission as an advocate of the\nSupreme Court shall be made in the prescribed form to the Pakistan Bar Council]. 4[*******]."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Disposal of applications for admission as an advocate",
      "content": "(1) All applications for\nadmission as an advocate received by a Bar Council shall be referred to its enrolment committee.\n(2) The enrolment committee may either grant the application or return it to the Bar Council\nrecording its reasons for not granting the application.\n(3) Where any application is returned to a Bar Council under sub-section (2), the Bar Council\nmay, after considering the reasons recorded by the enrolment committee, either grant or reject the\napplication."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Appeal against order of rejection",
      "content": "Where any application for admission as an advocate\nis rejected by a Provincial Bar Council 2[and Islamabad Bar Council], the applicant may, within such\nperiod and in such manner as may be prescribed, appeal to the enrolment committee of the Pakistan\nBar Council; and the decision of that committee on such appeal shall be final."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. No applicant rejected by one Provincial Bar Council 2[or Islamabad Bar Council, as",
      "content": "the case may be] to be enrolled by another such Council. — Where a Provincial Bar Council 2[or\nIslamabad Bar Council, as the case may be] has rejected the application of any person for admission\nas an advocate—\n(a)    it shall circulate to all the other Provincial Bar Councils 2[or Islamabad Bar\nCouncil, as the case may be] the name of such person together with the reasons\nfor the rejection of his application;\n(b)        no other Provincial Bar Council 2[or Islamabad Bar Council, as the case may\nbe] shall entertain an application for admission of such person as an advocate\nexcept with the previous consent in writing of the Provincial Bar Council 2[or\nIslamabad Bar Council, as the case may be] which rejected the application.\n1\nSubs. and added by Act No. XII of 2005, ss. 16 and 17.\n2\nIns. by Act No. V of 2014, ss. 2 and 19.\n3\nAdded by Act No. VIII of 1987, s. 10.\n4\nOmitted by Ordinance No. XVI of 1985, s. 8."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Payment of fees",
      "content": "(1) The Pakistan Bar Council may prescribe the following fees,\nnamely:—\n(a)        fee for enrolment as an advocate or an advocate of the High Court, which shall\nbe fixed after consultation with the High Court, to be paid to the Provincial Bar\nCouncil 1[and Islamabad Bar Council] 2[and the Pakistan Bar Council in\naccordance with sub­section (2) of section 17];\n3\n[(b)   fee for enrolment as an advocate of the Supreme Court, which shall be fixed\nafter consultation with the Supreme Court, to be paid to the Pakistan Bar\nCouncil; and]\n(c)        annual fee payable by advocates to the Bar Council on whose roll their names\nare entered:\nProvided that no person whose name is entered on the roll under clause\n(a) of section 25, clause of section 24 3[or clause (a) of section 23] as an\nadvocate, an advocate of the High Court 3[or an advocate of the Supreme Court]\nshall be required to pay the fee for enrolment as such advocate.\n(2) The fee referred to in clause (a) 3[or clause (b)] 4[***] of sub-section (1) may be paid in\nsuch instalments, if any, as may be prescribed.\n(3) The annual fee referred to in clause (c) of sub-section (1) shall be paid by such date as may\nbe prescribed.\n(4) If an advocate fails to pay an instalment of fee or the annual fee payable by him by the\nprescribed date he shall be liable to pay such further fee for late payment as may be prescribed:\nProvided that, if he fails to pay such instalment or fee within a period of six months following\nthe date on which it becomes due, he shall by notice be asked to show cause why his name be not\nstruck off the roll of advocates and if the explanation is unsatisfactory his name shall be struck off the\nroll of advocates and shall not be restored except upon payment of the instalment or fee due and such\npenalty not exceeding the amount of such instalment or fee as may be prescribed, unless the enrolment\ncommittee, having regard to the circumstances of the case, exempts any person from the payment of\nsuch penalty.\n1\nIns. by Act No. V of 2014, s. 2.\n2\nAdded by Ordinance No. XVII of 1982, s. 14.\n3\nIns. by Act No. VIII of 1987, s. 11.\n4\nOmitted by Ordinance No. XVI of 1985, s. 9"
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Order in which names shall be entered in the roll",
      "content": "(1) Entries in the roll shall\nbe made in the order of seniority and such seniority shall be determined as follows namely:—\n(a)        all such persons as are referred to in 1[clause (a) of section 23,] 2[****]clause\n(a) of section 24 or clause (a) of section 25 shall be entered first in the order in\nwhich they were respectively entitled to seniority inter se immediately before\nthe commencement of this Act; and\n(b)        the seniority of any other person admitted, after that date, to be an advocate or\nan advocate of the High Court 1[or an advocate of the Supreme Court] 2[*****]\nshall be determined by the date of his admission :\nProvided that, for the purposes of clause (b), the seniority of a person who, before his\nadmission as an advocate, was entitled as of right to practise in any other High Court shall be\ndetermined by the date on which he became so entitled.\n(2) Where the date of seniority of two or more persons is the same, the one senior in age shall\nrank as senior to the other."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Certificate of enrolment",
      "content": "A Bar Council shall issue a certificate of enrolment in the\nprescribed form to every person enrolled under section 3[31]."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Copy of roll to be kept with 1[Supreme Court and] High Court",
      "content": "1[(1) The Pakistan\nBar Council shall send to the Supreme Court an authenticated copy of the roll as prepared under section\n23 and shall thereafter communicate to the Supreme Court all alterations in, and additions to, the roll\nas soon as the same have been made.]\n(2) The Provincial Bar Council 4[and Islamabad Bar Council] shall send to the High Court a\ncopy of the rolls as prepared under section 24 and section 25 and shall thereafter communicate to the\nHigh Court all alterations in, and additions to, any such roll as soon as the same have been made."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Copies of rolls to be sent to Pakistan Bar Council",
      "content": "Each Provincial Bar Council 4[and\nIslamabad Bar Council] shall send to the Pakistan Bar Council an authenticated copy of the roll of\nadvocates of the High Court and the roll of the other advocates prepared by it for the first time under\nthis Act and shall thereafter communicate to the Pakistan Bar Council all alterations in, and additions\nto, any such roll as soon as the same have been made."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Common roll of advocates",
      "content": "(1) The Pakistan Bar Council shall prepare and maintain a\ncommon roll of advocates of the High Court and a common roll of the other advocates which shall\ncomprise the entries made in all the Provincial rolls 4[and Islamabad Bar Council roll] of the advocates\nof the High Court or, as the case may be, of the other advocates.\n(2) Entries in the common roll shall be in the order of seniority which shall be determined in\naccordance with the principles laid down in section 35.\n1\nIns. by Act No. VIII of 1987. ss. 12 and 13.\n2\nOmitted by Ordinance No. XVI of 1985, ss. 10 and 11.\n3\nSubs. by Act No. XII of 2005, s. 18.\n4\nIns. by Act No. V of 2014, ss. 2 and 20.\n1\n[39A. Cessation to practice as an advocate.___Any advocate who incurs any of the\ndisqualifications enumerated in Section 28A shall cease to be an advocate and his name shall be\nremoved from the concerned roll of the advocates."
    },
    {
      "provision_ref": "sec39b",
      "section": "39B",
      "title": "Section 39B. Powers of disciplinary Committee",
      "content": "_If any person referred to in Section 39A, practices\nin contravention of this Act or the Rules made thereunder then___\n(a)        in case of a senior advocate of the Supreme Court or advocate of the Supreme\nCourt including an advocate-on-record, the disciplinary Committee of the\nPakistan Bar Council; and\n(b)        in case of any other advocate, the disciplinary Committee of a Provincial Bar\nCouncil 2[and Islamabad Bar Council],\nmay of its own motion or otherwise take cognizance thereof and proceed against him\nunder this Chapter for such disciplinary action as is provided by law, in addition to\ncriminal prosecution of such person under section 58 of this Act."
    },
    {
      "provision_ref": "sec39c",
      "section": "39C",
      "title": "Section 39C. Provisions of Sections 39A and 39B to apply",
      "content": "_The provisions of Section 39A and 39B\nshall apply mutatis mutandis to an advocate who contravenes any provision of this Act or the Rules\nmade thereunder.]"
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Right of pre",
      "content": "audience.—(1) The Attorney-General for Pakistan shall have the right of pre-\naudience over all other advocates.\n(2) Subject to sub-section (1), the Advocate-General of a Province 2[or Islamabad Capital\nTerritory] shall have the right of pre-audience over all other advocates; and the right of pre­audience\namong the Advocates-General shall be determined by the date of appointment to their respective\noffices.\n1\n(2A)           [*     *          *          *           *          *    *]\n(3) The right of pre-audience among other advocates shall be determined by their seniority\ninter se.\n1\n(4)            [*     *          *          *           *          *    *]\n3\n[CHAPTER VII"
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Punishment of advocates for misconduct",
      "content": "_ 1[(1) An advocate may, in the manner\nhereinafter provided, be reprimanded, suspended or removed from practice or be made to pay such\namount of compensation, fine or penalty as may be ordered, if he is found guilty of professional or\nother misconduct.]\n(2) A complaint that an advocate has been guilty of misconduct may be made by any court or\nperson___\n(a)    in the case of an advocate of the Supreme Court, to the Pakistan Bar Council;\nand\n(b) in any other case, to the Provincial Bar Council 2[Islamabad Bar council as the\ncase may be].\n(3) Every complaint against an advocate made under sub-section (2), except where the\ncomplaint has been made by a court, shall be accompanied by 1[such fee as may be prescribed by the\nPakistan Bar Council from time to time].\n1\nAdded, omitted and subs. by Act No. XII of 2005, ss. 19, 20 and 21.\n2\nIns. by Act No. V of 2014, ss. 2, 21 and 22.\n3\nSubs. by Act No. VIII of 1987, s. 14.\n(4) Upon receipt of a complaint under sub-section (2) against any advocate, the disciplinary\ncommittee of the Bar Council may, unless it summarily rejects the complaint, after making such\ninquiry and giving the parties such opportunity of being heard as it may consider necessary, either\nreject the complaint or refer the same to a Tribunal for decision :\nProvided that the disciplinary committee shall not summarily reject a complaint made by the\nSupreme Court or a High Court 1[:]\n1\n[Provided further that if the disciplinary committee while referring the matter to the Tribunal\nis of the opinion that the advocate has committed an act of grave indiscipline or grave professional\nmisconduct and his immediate suspension from practice is expedient or necessary in the interest of\nadministration of justice, it may suspend him for the maximum period of three months and in such a\ncase the Tribunal shall decide the complaint within a period of three months after receipt of reference\nfrom the disciplinary committee.]\n2\n[(4A) If a Bar Council has reasons to believe that an advocate has been guilty of professional\nor other misconduct, it may of its own motion prefer the case to its disciplinary committee.]\n(5) Any person whose complaint is rejected by the disciplinary committee under sub- section\n(4) may within thirty days of the day on which the order of the committee is communicated to him,\nprefer an appeal to the Tribunal, whose decision in such appeal shall be final."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Tribunals of Bar Councils",
      "content": "_(1) The Pakistan Bar Council may constitute one or more\nTribunals each consisting of two of its members elected by it for the purpose and a Judge of the\nSupreme Court nominated by the Chief Justice of Pakistan, who shall be the Chairman.\n(2) A Provincial Bar Council 3[and Islamabad Bar Council as the case may be] may constitute\none or more Tribunals each consisting of two of its members elected by it for the purpose and a Judge\nof the High Court nominated by the Chief Justice of that Court, who shall be the Chairman."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Procedure in inquiries",
      "content": "(1) In inquiries relating to conduct of advocates, the Tribunal\nshall, except as hereinafter provided, follow such procedure as may be prescribed.\n(2) The tribunal shall fix a date for the hearing of the case and shall cause notice of the day so\nfixed to be given to the complainant, to the advocate concerned and to the Advocate-General of the\nProvince 3[or Islamabad Capital Territory, as the case may be] and shall afford to the complainant the\nadvocate concerned and the Advocate-General an opportunity of leading evidence, if any, and of being\nheard before orders are passed in the case.\n(3) The Chairman of the Tribunal may empower one of the members of the Tribunal to consider\nand decide preliminary issues and to record evidence.\n(4) The Tribunal may, where it considers it necessary so to do, require the person making a\ncomplaint, except where the complaint has been made by a court, to deposit with the Tribunal, as\nsecurity for costs, such sum as it may specify.\n1\nAdded by Act No. VI of 2015, s. 2.\n2\nIns. by Act No. XII of 2005, s. 21.\n3\nIns. by Act No. V of 2014, ss. 23 and 24.\n(5) On completion of the inquiry, the Tribunal may either dismiss the complaint or, where the\ncomplaint referred to the Tribunal was made at the motion of a Bar Council, direct that the proceedings\nbe filed; or it may make an order imposing any of the penalties referred to in sub­section of section 41.\n(6) Where the Tribunal makes an order for the suspension of an advocate from practice, it shall\nspecify the period of suspension, and for that period the advocate shall be debarred from practising in\nany court or before any authority or person in Pakistan.\n(7) The Tribunal may, of its own motion or on application made to it in this behalf, review any\norder passed under sub-section (5) and maintain, vary or rescind the same, as it thinks fit.\n(8) When any advocate is 2[punished under section 41, the same] shall be entered against his\nname in the Provincial roll or, as the case may be, the roll of advocates of the Supreme Court\nmaintained by the Pakistan Bar Council, and the common roll, and when an advocate is removed from\npractice his name shall forthwith be struck off the roll; and the certificate of any advocate so suspended\nor removed shall be recalled."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Order as to costs",
      "content": "(1) A disciplinary committee and a Tribunal may make such order as\nto costs of proceedings before it as it may deem fit; and where the committee or, as the case may be,\nthe Tribunal is of the opinion that a complaint made against an advocate is false and vexatious, it may,\nwithout prejudice to any other remedy available to the advocate, impose upon the complainant 2[such\ncompensatory costs as may be deemed reasonable] :\nProvided that no order under the sub-section shall be made against a court or the presiding\nofficer of a Court 2[or a Bar Council].\n(2) The Tribunal may, on an application made to it in this behalf within the prescribed period,\nrevise any order passed by a disciplinary committee under sub-section (1) or, of its own motion or on\napplication so made, review any order passed by the Tribunal under that sub-section and may, in either\ncase, maintain, vary or rescind the same, as it thinks fit.\n(3) Subject to sub-section (2), every order of the disciplinary committee or the Tribunal under\nsub-section (1) shall be executable___\n(a)      if the committee is appointed, or the Tribunal is constituted, by the Pakistan Bar\nCouncil, as if it were an order of the Supreme Court; and\n(b)      if the committee is appointed, or the Tribunal is constituted, by a Provincial Bar\nCouncil 1[or Islamabad Bar Council], as if it were an order of the High Court."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Powers of the Tribunal and disciplinary committee in inquiries",
      "content": "_(1) For the purposes\nof any such inquiry as aforesaid, a disciplinary committee and a Tribunal shall have the same powers\nas are vested in a court under the Code of Civil Procedure, 1908 (Act V of 1908), in respect of the\nfollowing matters, namely :___\n(a)       enforcing the attendance of any person ;\n(b)       compelling the production of documents; and\n(c)       issuing commissions for the examination of witnesses:\nProvided that the disciplinary committee, or the Tribunal shall not have power\nto require the attendance of the presiding officer of any civil or criminal court save\nwith the previous sanction of the High Court or, in the case of the presiding officer of\na Revenue Court, of the Provincial Government.\n1\nIns. by Act V of 2014, s. 2 and 25\n2\nSubs. and added by Act No. XII of 2005, ss. 22 and 23.\n(2) Every such inquiry shall be deemed to be a judicial proceeding within the meaning of\nSections 193 and 228 of the Pakistan Penal Code (Act XLV of 1860), and a disciplinary committee\nand a Tribunal shall be deemed to be a civil court for the purpose of sections 480 and 482 of the Code\nof Criminal Procedure, 1898 (Act V of 1898).\n(3) For the purpose of enforcing the attendance of any person or of compelling the production\nof documents or issuing commissions___\n(a)        the local limits of the jurisdiction of a disciplinary committee and a Tribunal\nshall be those of the jurisdiction of the Bar Council by which the committee has\nbeen appointed or, as the case may be, the Tribunal has been constituted; and\n(b)        a disciplinary committee and a Tribunal may send to any civil court having\njurisdiction in the place where the committee or, as the case may be, the\nTribunal is sitting, any summons or other process for the attendance of a witness\nor the production of a document required by the Committee or Tribunal, or any\ncommission which it desires to issue, and the civil court shall serve such process\nor issue such commission, as the case may be, and may enforce any such process\nas if it were a process for attendance or production before itself.\n(4) Proceedings before a disciplinary committee or a Tribunal in any such inquiry shall be\ndeemed to be civil proceedings for the purposes of Article 15 of the Qanun-e- Shahadat, 1984 (P.O.\nNo. 10 of 1984) and the provisions of that Article shall apply accordingly."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Disciplinary powers of the Pakistan Bar Council",
      "content": "_(1) Notwithstanding anything\ncontained in this Chapter, the disciplinary committee of the Pakistan Bar Council may, of its own\nmotion, withdraw for inquiry before itself any proceedings for disciplinary action against any advocate\npending before a Provincial Bar Council 1[or Islamabad Bar Council] or a disciplinary committee\nthereof and dispose of the same.\n(2) In disposing of any case under this section the disciplinary committee of the Pakistan Bar\ncouncil shall observe, so far as may be, the procedure laid down in section 43, the reference to the\n“Advocate­General” in that section being construed as reference to the “Attorney­General for\nPakistan”.\n(3) In disposing of any case under this section, the disciplinary committee of the Pakistan Bar\nCouncil may make any order which the Tribunal can make under section 43, and the Tribunal shall\ngive effect to any such order 2[:]\n2\n[Provided that every order passed hereinabove shall be subject to the approval of the Pakistan\nBar Council.]\n3\n46A.           [*     *          *           *      *      *       *]\n1\nIns. by Act No. V of 2014, ss. 26.\n2\nSubs. and added by Act No. XII of 2005, s. 24.\n3\nOmitted by Act No. XXXV of 2018, s. 10."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Appeal to the Pakistan Bar Council",
      "content": "_(1) Any person aggrieved by an order of a\n1\n[Provincial] Tribunal under section 43 may, within sixty days from the date on which the order is\ncommunicated to him, prefer an appeal to the Pakistan Bar Council.\n(2) Every such appeal shall be heard by the disciplinary committee of the Pakistan Bar council\nwhich may pass such order thereon as it may deem fit."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Appeal to the Supreme Court",
      "content": "_Any person aggrieved by an order made by the\ndisciplinary committee of the Pakistan Bar Council under sub-section (3) of section 46 1[or\nsub-section (2) of section 47 or a final order of a Tribunal of the Pakistan Bar Council] may, within\nsixty days from the date on which the order is communicated to him, prefer an appeal to the Supreme\nCourt which may pass such order thereon as it may deem fit."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Application of sections 5 and 12 of the Limitation Act, 1908",
      "content": "_The provisions of\nsections 5 and 12 of the Limitation Act, 1908 (IX of 1908) shall, so far as may be, apply to appeals\nmade under section 47 or section 48."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Stay of order",
      "content": "_An appeal made under section 47 or section 48 shall not operate as a stay\nof the order appealed against but the disciplinary committee of the Pakistan Bar Council or the\nSupreme Court, as the case may be, may, for sufficient cause, direct the stay of such order on such\nterms and conditions as it may deem fit."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Powers of the disciplinary committee",
      "content": "_The disciplinary committee of the Pakistan Bar\nCouncil shall have the same powers as are vested in a Tribunal by section 45 and that section shall\napply to the disciplinary committee, the reference to the “Tribunal” in that section being construed as\na reference to the “disciplinary committee of the Pakistan Bar Council”.\n2\n[52. Execution of an order of a Bar Council, a Committee or Tribunal. ___Subject to this\nAct and the rules made under it, every order of a Bar Council, a Committee or a Tribunal shall be\nexecutable :\n(a)    in case of Pakistan Bar Council, its Committee or Tribunal as if it is an order of\nthe Supreme Court; and\n(b)    in case of a Provincial Bar Council, its Committee or Tribunal as if it is an order\nof a High Court.]"
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Review of the order by disciplinary committee",
      "content": "_The disciplinary committee of the\nPakistan Bar Council may of its own motion or otherwise review any order passed by it under this\nChapter."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Power of Supreme Court and High Court to suspend advocates from practice",
      "content": "_(1)\nThe Supreme Court or a High Court may, while making a complaint under sub-section (2) of section\n41 against an advocate, make an order for the suspension of the advocate from practice 3[for a period\nof three months] if, after hearing such Advocate, the Court is of the opinion that he has committed an\nact of grave indiscipline in the view of the Court or grave professional misconduct in relation to any\nproceeding before it, and his immediate suspension is expedient or necessary in the interest of\nadministration of justice.\n1\nIns. by Act No. XII of 2005, s. 25 and 26.\n2\nIns. by Act No. XXXV of 2018, s. 11.\n3\nIns. by Act No. VI of 2015 s. 3.\n1\n[(1A) The Bar Council concerned on receipt of a complaint from the Court under sub-section\n(1) shall ensure that it is decided within a period of three months by its disciplinary committee and the\nTribunal, in case the complaint has been referred to the Tribunal.]\n(2) On a complaint made to it against an advocate by a court subordinate to it, the High Court\n___\nmay:\n(a)        make an order under sub-section (1) in respect of such advocate if, after hearing\nhim, it is of the opinion that he has committed grave professional or other\nmisconduct in relation to any proceeding before such subordinate Court and his\nimmediate suspension, pending the proceedings before the Bar Council, is\nexpedient or necessary in the public interest and forward the complaint to the\nProvincial Bar Council 2[or Islamabad Bar Council] for action in accordance\nwith section 41; or\n(b)        without making any order under sub-section (1), forward the complaint to the\nProvincial Bar Council 2[and Islamabad Bar Council] for action in accordance\nwith section 41; or\n(c)        direct that no further action need be taken in respect of the complaint.\n3\n[*        *           *          *     *      *       *]"
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Power of Pakistan Bar Council to make rules",
      "content": "The Pakistan Bar Council may, by\nnotification in the official Gazette, make rules to provide for—\n(a)        the manner in which the election of members of a 4[*] Bar Council shall be held\nand the manner in which results of election shall be published;\n(b)        the manner in which the election of the Vice-Chairman of a Bar Council shall\nbe held;\n(c)        the manner in which and the authority by which doubts and disputes as to the\nvalidity of an election to 4[a Bar Council] or to the office of the Vice-Chairman\nof a Bar Council shall be finally decided;\n(d)        the powers and duties of the Chairman and Vice­Chairman of a Bar Council;\n(e)        the summoning and holding of meetings of the Pakistan Bar Council, the times\nand places where such meetings are to be held, the conduct of business thereat\nand the number of members necessary to constitute a quorum ;\n(f)        the constitution and functions of any committee of the Pakistan Bar Council and\nthe term of office of the members of any such committee ;\n1\nIns. by Act No. VI of 2015 s. 3.\n2\nIns.by Act No. V of 2014, ss. 2 and 29.\n3\nOmitted by Act No. VIII of 1987, s. 15.\n4\nOmitted by Act No. XXXVI of 1973, s. 4.\n(g)        the summoning and holding of meetings of such committees, the conduct of\nbusiness thereat and the number of members necessary to constitute a quorum;\n(h)        the qualifications and terms and conditions of service of staff to be employed\nby the Pakistan Bar Council;\n(i)        matters pertaining to management, administration, utilization and investment of\nthe fund of the Pakistan Bar Council;\n(j)        the constitution of separate funds for special purposes by the Pakistan Bar\nCouncil;\n(k)        the maintenance of books of accounts and other books by the Pakistan Bar\nCouncil;\n(l)        the appointment of auditor and the audit of the accounts of the Pakistan Bar\nCouncil;\n1\n[(la) uniform conditions for being eligible to apply to a Bar Council for admission as\nan advocate;\n(lb)       the course of practical training in law and the examination to be passed after\nsuch training for admission as an advocate;]\n2\n[(m) the form and manner in which applications for admission as an advocate of the\nSupreme Court are to be made and the manner in which such applications are\nto be disposed of;]\n1\n[(n)   the fees payable for enrolment as an advocate, advocate of High Court, advocate\nof Supreme Court, senior advocate of Supreme Court, annual renewal fee or in\nrespect of any other matter under the Act and the installments, if any, in which\nsuch fee may be paid;]\n(o)        the forms in which a certificate of enrolment shall be given to a person enrolled\nas an advocate or an advocate of the High Court 2[or an advocate of the Supreme\nCourt] 3[****] ;\n(p)        the standards of professional conduct and etiquette to be observed by advocates;\n(q)        the standards of legal education to be observed by universities in Pakistan and\nthe inspection of universities for that purpose;\n(r)        the circumstances in which and the conditions subject to which nationals of any\nforeign country may be admitted as advocates and foreign qualifications may\nbe recognised for purposes of their admission;\n2\n[(s)   the procedure to be followed by Tribunals constituted by the Pakistan Bar\nCouncil in inquiries relating to the conduct of an advocate;]\n1\nIns. and subs. by Act No. XXXV of 2018, s. 12\n2\nIns. and added by Act No. VIII of 1987, s. 16.\n3\nOmitted by Ordinance No. XVI of 1985, s. 14.\n(t)       the general principles for guidance of the Provincial Bar Councils 1[;].\n2\n[(u)   the forming, recognition, derecognition and functioning of a Supreme Court Bar\nAssociation or any Bar Association at the national level.]\n3\n[(v)   the manner in which and the conditions subject to which elections of Bar\nAssociations at different tiers shall be held:]\nProvided that no rules made with reference to clause (r) shall have effect unless\nthey have been approved by the Federal Government 4[:]\n4\n[Provided further that, for holding the first elections to the Bar Councils to be\nconstituted under this Act, rules with reference to clauses (a), (b) and (c) shall be made\nby the Federal Government and notified in the official Gazette.]"
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. Power of Provincial Bar Council 5[and Islamabad Bar Council] to make rules",
      "content": "6[A]\nProvincial Bar Council 5[and Islamabad Bar Council] may, by notification in the official Gazette,\nmake rules to provide for—\n(a)        the summoning and holding of meetings of the Bar Council, the times and places\nwhere such meetings are to be held, the conduct of business thereat and the\nnumber of members necessary to constitute a quorum;\n(b)        the constitution and functions of any committee of the Bar Council and the term\nof office of the members of any such committee;\n(c)        the summoning and holding of meetings of the committees of the Bar Council,\nthe conduct of business thereat and the number of members necessary to\nconstitute a quorum;\n(d)        qualifications and terms and conditions of service of staff to be employed by\nthe Bar Council;\n(e)        the matters pertaining to management, administration, utilization and\ninvestment of the fund of the Bar Council;\n(f)        the constitution of separate funds for special purposes by the Bar Council;\n(g)        the maintenance of books of accounts and other books by the Bar Council;\n(h)        the appointment of auditors and the audit of the accounts of the Bar Council;\n(i)        the course of practical training in law and the examination to be passed after\nsuch training for admission as an advocate;\n1\nSubs, by Ordinance No. XL of 1978, s. 12.\n2\nSubs. by Ordinance No. XVII of 1982, s. 22.\n3\nIns. by Act No. XXXV of 2018, s.12.\n4\nSubs. by Act No. XXXVI of 1973, s. 4.\n5\nIns. by Act No. V of 2014, s. 2.\n6\nSubs, by Act No. VIII of 1987, s. 17.\n(j)        the form and manner in which applications for admission as an advocate or an\nadvocate of the High Court are to be made and the manner in which such\napplications are to be disposed of;\n(k)        the conditions subject to which a person may be admitted as an advocate or an\nadvocate of the High Court;\n(l)        the procedure to be followed by a Tribunal constituted by the Bar Council in\ninquiries relating to the conduct of an advocate ;\n(m)        the forming and regulation of firms of lawyers either throughout the Province\nor any specified part thereof;\n1\n[(ma) the forming and regulation of firms of lawyers in Islamabad Capital Territory;]\n(n)        the recognition 2[, derecognition] and functioning of Bar Associations.\n________\n3\n[57. Grants to Bar Councils and Bar Associations. —The Minister in charge of the Federal\nGovernment or a Provincial Government may make grant in aid to a Bar Council or a Bar Association\nin the manner and on conditions as may be determined by the Federal Government or the Provincial\nGovernment.]"
    },
    {
      "provision_ref": "sec58",
      "section": "58",
      "title": "Section 58. Penalty for illegal practice",
      "content": "4[(1) Any person who is not an advocate and practices the\nprofession of law or any person who is not entitled under this Act to practice in the Supreme Court, a\nHigh Court or any other Court or Tribunal subordinate thereto practices before the said Court or\nTribunal shall be punished with imprisonment for a term which may extend to three years, or with fine\nupto fifty thousand rupees, or with both.]\n(2) Any advocate who practises the profession of law, or acts or appears as agent for any other\nperson, while he is suspended from practice shall be punished with imprisonment for a term which\nmay extend to one year, or with fine, or with both."
    },
    {
      "provision_ref": "sec59",
      "section": "59",
      "title": "Section 59. Power to frame and publish lists of touts",
      "content": "(1) Every High Court, District Judge,\nSessions Judge, District Magistrate and every Revenue-officer, not being below the rank of a Collector\nof a district (each as regards their or his own Court and the courts, if any, subordinate thereto), may\nframe and publish lists of persons proved, to their or his satisfaction, or to the satisfaction of any\nsubordinate court as provided in sub-section (3), by evidence of general repute or otherwise, to\nhabitually act as touts, and may, from time to time, alter and amend such lists.\nExplanation.—The passing of a resolution, declaring any person to be or not to be a tout, by a\nmajority of the members present at a meeting, specially convened for the purpose, of an association of\npersons entitled to practise the profession of law in any court or revenue-office, shall be prima facie\nevidence of the general repute of such person and of the fact that he is, or is not, a tout.\n1\nIns. by Act No. V of 2014, s. 30.\n2\nIns. by Ordinance No. XVII of 1982, s. 23.\n3\nSubs. by Act No. XXXV of 2018, s.13.\n4\nSubs. by Act No. XII of 2005, s. 28.\n(2) No person’s name shall be included in any such list until he shall have had an opportunity\nof showing cause against such inclusion.\n(3) Any authority empowered under sub-section (1) to frame and publish a list of touts may\nsend to any court subordinate to such authority the names of any persons alleged or suspected to be\ntouts, and order that court to hold an inquiry in regard to such persons; and the subordinate court shall\nthereupon hold an inquiry into the conduct of such persons and, after giving each such person an\nopportunity of showing cause as provided in subsection (2), shall report to the authority which has\nordered the inquiry the name of each such person who has been proved to the satisfaction of the\nsubordinate court to be a tout; and that authority may include the name of any such person in the list\nof touts framed and published by that authority:\nProvided that such authority shall hear any such person who, before his name is so included,\nappears before it and desires to be heard.\n(4) A copy of every such list shall be kept hung up in every court to which the same relates.\n(5) The court or Judge may, by general or special order, exclude from the precincts of the court\nany person whose name is included in any such list.\n(6) Any person who acts as a tout whilst his name is included in any such list shall be punishable\nwith imprisonment which may extend to three years, or with fine, or with both.\nExplanation.—Any person ordered to be excluded from the precincts of a court under the\nprovisions of sub-section (5), if found on such precincts while such order is in force, shall be deemed,\nunless the contrary be proved, to be at such precincts for the purposes of acting as a tout.\n1\n(7)            [*     *          *          *          *           *   *]\n(8) An offence under sub-section (6) shall be non-bailable:\n2\n[*     *          *          *          *           *   *]\n3\n59A.           [*     *          *          *          *           *   *]\n2\n[59B. Removal from Bar Association.—(1) An advocate who has once been admitted as a\nmember of a Bar Association shall not be removed from such membership except on the ground that\nhe has either incurred any of the disqualifications for the membership of a Bar Council under this Act\nor been in default in paying the fees of the Bar Association for a period of not less than twelve months:\n1\nOmitted by Ordinance No. XL of 1978, s. 13.\n2\nOmitted and ins. by Ordinance No. XVII of 1982, ss. 24 and 25.\n3\nOmitted by Act No. VIII of 1987, s. 18.\nProvided that the membership of an advocate who is removed on the ground of his having\nbeen in such default shall stand restored if he pays up the fees due within sixty days of such removal.\n(2) 1[*                 *                     *             *            *                *          *]"
    },
    {
      "provision_ref": "sec60",
      "section": "60",
      "title": "Section 60. Power of the High Court relating to remuneration of advocates. The High Court shall",
      "content": "from time to time fix and regulate the fees payable by any party in respect of the fees of his adversary’s\nadvocate in all proceedings in such High Court and in the courts subordinate to such High Court."
    },
    {
      "provision_ref": "sec61",
      "section": "61",
      "title": "Section 61. Group insurance",
      "content": "(1) The Pakistan Bar Council may from time to time arrange for the\ninsurance of the life of such advocates of the Supreme Court who are borne on its roll as have not\nattained the age of sixty-five years, and a Provincial Bar Council 2[and Islamabad Bar Council] may\nlike-wise arrange for the insurance of the life of such advocates borne on its rolls as have not attained\nthe age of sixty-two years, and for such period as it deems fit.\n(2) Where any such arrangement as has been referred to in sub-section (1) has been made by a\nBar Council—\n(a)        it shall establish a separate Group Insurance Fund which shall vest in and be\nadministered by the Bar Council;\n(b)        every advocate whose life has been insured under such arrangement shall pay\nto the Bar Council, annually, monthly or at such other intervals as may be\nprescribed, such sum of money as the premium for the insurance of his life, as\nmay be determined by the Bar Council;\n(c)        all sums received as premia under clause (b) and any interest or profit accruing\nthereon shall be credited into the Group Insurance Fund of the Bar Council;\n(d)        all expenses incurred by the Bar Council on the arrangements with an Insurance\nCompany or other insurer and on the administration of the Group Insurance\nFund shall be defrayed from such Fund; and\n(e)        any sums remaining in such Fund after defraying the expense referred to in\nclause (d) may be utilized for such purposes connected with the welfare of\nadvocates as may be prescribed.\n(3) The provisions of sub-section (4) of section 34 shall apply to the insurance premia required\nto be paid under clause (d) of sub-section (2), as if such premia were an annual fee or instalment of a\nfee payable under that section.\n1\nOmitted by Act No. VIII of 1987, s. 19.\n2\nIns. by Act No. V of 2014, s. 2."
    },
    {
      "provision_ref": "sec62",
      "section": "62",
      "title": "Section 62. Benevolent Fund",
      "content": "(1) A Bar Council may establish a fund to be called the Advocates\nBenevolent Fund.\n(2) Where a Bar Council establishes a Benevolent Fund—\n(a)        if it be the Pakistan Bar Council, every advocate of the Supreme Court 1[borne\non its roll], 2[****] and if it be a Provincial Bar Council 3[or Islamabad bar\nCouncil”, as the case may be,], every advocate borne on its rolls, shall pay to\nthe Benevolent Fund, annually, monthly or at such other intervals as may be\nprescribed, such amount as his contribution to the Fund as may be determined\nby the Bar Council;\n(b)        the moneys credited into the Fund shall be kept in such bank as may be\nprescribed;\n(c)        the Fund shall be utilized, in such manner as may be prescribed by the Bar\nCouncil, for—\n(i)        the relief of advocates and their families;\n(ii)       giving financial relief to the families of deceased advocates;\n(iii)      making grants to advocates on special occasions; and\n(iv)       defraying expenditure in respect of the management of the Fund.\n(3) The provisions of sub-section (4) of section 34 shall apply to contributions required to be\nmade to the Benevolent Fund under clause (a) of sub-section (2) as if such contributions were an\nannual fee or instalment of fee payable under that section.\n4\n[(4) An advocate shall not exercise the rights and privileges under this Act without making\npayment of the dues to the Pakistan Bar Council or a Provincial Bar Council 2[and Islamabad Bar\nCouncil] as may be prescribed by the Rules or Bye-laws of such Bar Council.\n(5) Every advocate shall be liable to pay contributions to the Benevolent Fund under this\nsection and the Rules made thereunder to the Provincial Bar Council concerned notwithstanding his\nenrolment as an advocate or advocate-on-record of the Supreme Court of Pakistan.]"
    },
    {
      "provision_ref": "sec63",
      "section": "63",
      "title": "Section 63. Validation",
      "content": "(1) Notwithstanding the constitution of new Provinces and the establishment\nof new High Courts by or under the Province of West Pakistan (Dissolution) Order, 1970 (P.O. No. 1\nof 1970), or any law, judgement, order or decree of a Court—\n(a)        any powers exercised or functions and duties performed or undertaken by the\nPakistan Bar Council or the West Pakistan Bar Council constituted under the\nLegal Practitioners and Bar Councils Act, 1965 (III of 1965) or by any\ncommittee thereof, or Tribunal appointed by it, in accordance with the\nprovisions of the said Act, shall always be deemed to have been validly\nexercised, performed or undertaken; and\n1\nIns. by Act No. VIII of 1987, s. 20.\n2\nOmitted by Ordinance No. XVI of 1985, s. 15.\n3\nIns. by Act No. V of 2014, ss. 2 and 31.\n4\nAdded by Act No. XII of 2005, s. 29.\n(b)       no action, proceeding, decision, order or finding of such Bar Council,\ncommittee or Tribunal shall be called in question before any Court or other\nauthority, only on the ground of the dissolution of the Province of West\nPakistan, the constitution of new Provinces in its place or the establishment of\nnew High Courts in the place of the High Court of West Pakistan.\n64. 1[*                  *          *         *           *         *          *]\n65. 1[*                  *          *         *           *         *          *]\n66. 1[*                  *          *         *           *         *          *]"
    },
    {
      "provision_ref": "sec67",
      "section": "67",
      "title": "Section 67. Continuance in service of the employees of the West Pakistan Bar Council",
      "content": "Every\nperson in the employment of the West Pakistan Bar Council immediately before its dissolution, at\nwhatever place he may for the time being be serving, shall be deemed, as from the constitution of\nProvincial Bar Councils under this Act, to be in the employment of the Bar Council for the Province\nor Provinces in which the said place is situated, and shall be entitled to the same terms and conditions\nof service as respects remuneration and leave as he was entitled to before the constitution of the last\nnamed council."
    },
    {
      "provision_ref": "sec68",
      "section": "68",
      "title": "Section 68. Savings",
      "content": "(1) Nothing in this Act shall apply to mukhtars and revenue agents and every\nmukhtar and revenue agent practising as such immediately before the commencement of this Act shall\ncontinue to enjoy the same rights as respects practice in any Court or revenue office or before any\nauthority or person as he enjoyed, and be subject to the disciplinary jurisdiction of the same authority\nto which he was subject, immediately before such commencement, and the provisions of the Legal\nPractitioners Act, 1879 (XVIII of 1879), or other law shall have effect in relation to such persons as if\nthey had not been repealed by the said Act.\n(2) 2[*                  *          *         *           *         *          *]\n1\n69.           [*         *          *         *           *         *          *]\n2\n[SCHEDULE\n[See Section 5(2) (b)]\nGroup of Districts-I\nName of District                                                                                            Seats\n(1)            Bahawal Nagar                              …                                          01\n(2)            Bahawalpur                                 …                                          03\n(3)            Rahim Yar Khan                             …                                          02\n1\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch., II.\n2\nOmitted and added by Act No. XII of 2005, s. 30.\nGroup of Districts-II\nName of District                                                          Seats\n(1)   Dera Ghazi Khan                                 …                    01\n(2)   Layah                                           …                    01\n(3)   Muzaffargarh                                    …                    02\n(4)   Rajanpur                                        …                    01\n1\n[Group of Districts-III\nName of District:                                                         Seats\n(1) Khanewal                                          …                    02\n(2) Lodhran                                           …                    01\n(3) Multan                                            …                    04\n(4) Vehari                                            …                    02\n1\n[Group of Districts-IV\nName of District:                                                         Seats\n(1) Chiniot                                           …                    01\n(2) Faisalabad                                        …                    04\n(3) Jhang                                             …                    01\n(4) Toba Tek Singh                                                         01]\nGroup of Districts-V\nName of District                                                          Seats\n(1) Attack                                            …                    01\n(2) Chakwal                                           …                    01\n(3) 2[*     *       *                   *         *         *         *     *]\n(4) Jhelum                                            …                    01\n(5) Rawalpindi                                        …                    04\nGroup of Districts-VI\nName of District                                                          Seats\n(1) Bhakkar                                           …                    01\n(2) Khushab                                           …                    01\n(3) Mianwali                                          …                    01\n(4) Sargodha                                          …                    02\n1\nSubs. by Act No. XXXV of 2018, s.14.\n2\nOmitted by Act No. V of 2014, s 32.\nGroup of Districts-VII\nName of District                                                      Seats\n(1) Gujranwala                                          …              03\n(2) Gujrat                                              …              02\n(3) Hafizabad                                           …              01\n(4) Mandi Bahauddin                                     …              01\n(5) Narowal                                             …              01\n(6) Sialkot                                             …              02\n1\n[Group of Districts-VIII\nName of District:                                                     Seats\n(1) Kasur                                               …              02\n(2) Lahore                                              …              16\n(3) Nankana Sahib                                       …              01\n(4) Sheikhupura                                         …              01]\n1\n[Group of Districts-IX\nName of District:\nSeats\n(1) Okara                                               ….             02\n(2) Pakpattan                                           ….\n….              01\n(3) Sahiwal                                             ….\n02]\nGroup of Districts-I\nName of District                                                      Seats\n(1) Karachi (South)                                     ….             06\n(2) Karachi (Central)                                   ….             04\n(3) Karachi (East)                                      ….             04\n(4) Karachi (West)                                      ….             01\n(5) Malir                                               ….             01\nGroup of Districts-II\nName of District                                                      Seats\n(1) Badin + Thatta                                      ….             01\n(2) Dadu                                                ….             01\n(3) Hyderabad                                           ….             03\nGroup of Districts-III\nName of District                                                      Seats\n(1) Sukkur                                              ….              02\n(2) Ghotki                                              ….              01\n(3) Khairpur                                            ….              01\n(4) Naushero Feroz                                      ….              01\n(5) Nawab Shah                                          ….              01\n1\nSubs. and ins. by Act No. XXXV of 2018, s. 14.\nGroup of Districts-IV\nName of District                                                    Seats\n(1) Jaccobabad                                        ….             01\n(2) Larkana                                           ….             02\n(3) Shikarpur                                         ….             01\nGroup of Districts-V\nName of District                                                   Seats\n(1) Mirpur Khas                                      ….             01\n(2) Sanghar                                          ….             01\n1\n[Khyber Pakhtunkhwa Bar Council\nGroup of Districts-I\nName of District                                                          Seats\n(1) Peshawar + Khyber                                                ….    07\n(2) Charsada + Mohmand                                               ….    01\n(3) Nowshera                                                         ….    01\nGroup of Districts-II\nName of District                                                          Seats\n(1) Mardan                                                           ….    02\n(2) Swabi                                                            ….    01\nGroup of Districts-III\nName of District                                                          Seats\n(1) Kohat + Hangu + Orakzai + Kurram                                 ….    01\n(2) Karak                                                            ….    01\nGroup of Districts-IV\nName of District                                                          Seats\n(1) D.I. Khan + Tank + South Waziristan                              ….    02\n(2) Bannu + North Waziristan                                         ….    01\n(3) Lakki Marwat                                                     ….    01\nGroup of Districts-V\nName of District                                                          Seats\n(1) Haripur                                                          ….    01\n(2) Abbottabad                                                       .…    02\n(3) Mansehra + Batagram+ Toorghar+ Upper                             ….    02\nKohistan+ Lower Kohistan+ Kolai Palas\n1\nSubs. by Act No. XXIV of 2025, s.5.\nGroup of Districts-VI\nName of District                                                              Seats\n(1) Mingora (Swat)                                                       ….    01\n(2) Shangla (Alipuri)                                                    ….    01\n(3) Daggar (Buner) +Malakand at Batkhela                                 ….    01\n(4) Timargara (Dir)+ Dir Bala+ Bajour                                    ….    01\n(5) Chitral Upper+ Chitral Lower                                         ….    01]\n1\n[BALOCHISTAN BAR COUNCIL\nName of Districts                                                             Seats\nQuetta + Chaghi + Noshki +                                                     04\nPashin +Killa Abdullah\nName of District                                                              Seat\nZhob+Loralai+Killa Saifullah +Ziarat\n01\n+Musakhel and Barkhran\nName of Districts                                                             Seat\nKech+Panjgor+Gawadar and Lasbela                                               01\nName of Districts                                                             Seat\nKalat+Khuzdar+Mastung+Kharan                       and\nAwaran                                                                         01\nName of Districts                                                             Seat\nSibi+Bolan+Nasirabad+Jafarabad+\n01]\nJhal Magsi+Kohlu and Dera Bugti\n2\n[Islamabad Bar Council\nName of the District                                                         Seats\nIslamabad                                                                     05]\n__________\n1\nSubs. by Act No. XV of 2021, s. 3.\n2\nAdded by Act No. V of 2014, s. 32.\nRGN:02-09-2025"
    }
  ],
  "definitions": [
    {
      "term": "advocate",
      "definition": "an advocate entered in any roll under the provisions of this Act;]",
      "source_provision": "sec2"
    },
    {
      "term": "Bar Council",
      "definition": "a Bar Council constituted under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "common roll",
      "definition": "the common roll of advocates of the High Court or, as the case may be, the common roll of other advocates prepared and maintained by the Pakistan Bar Council under this Act; 1 (cc) [* * * * * * *]",
      "source_provision": "sec2"
    },
    {
      "term": "Islamabad Bar Council",
      "definition": "Islamabad Bar Council for Islamabad Capital Territory constituted under this Act;] 2 [(e) “legal practitioner” means an advocate;] 3 [(ee) “member”, in relation to a Bar Council, does not include the Chairman thereof;]",
      "source_provision": "sec2"
    },
    {
      "term": "Pakistan Bar Council",
      "definition": "the Bar Council constituted for Pakistan under section 11;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act; 4 [(h) “Provincial Bar Council” means a Provincial Bar Council of a Province and includes the Islamabad Bar Council;]",
      "source_provision": "sec2"
    },
    {
      "term": "revenue office",
      "definition": "all courts (other than civil courts) trying suits under any law for the time being in force relating to landholders and their tenants or agents;",
      "source_provision": "sec2"
    },
    {
      "term": "roll",
      "definition": "the roll of advocates maintained by a Bar Council; 2 [(kk) “roll of group of districts” means a roll of advocates of a High Court and a roll of the Advocates practicing in the districts of the group, as mentioned in the Schedule, prepared and maintained by a Provincial Bar Council 1[and Islamabad Bar Council] ;]",
      "source_provision": "sec2"
    },
    {
      "term": "subordinate court",
      "definition": "a court subordinate to the High Court;",
      "source_provision": "sec2"
    },
    {
      "term": "tout",
      "definition": "a person— (i) who procures, in consideration of any remuneration moving from any legal practitioner, the employment of the legal practitioner in any legal business; or who proposes to any legal practitioner or to any person interested in any legal business to procure, in consideration of any remuneration moving from either of them, the employment of the legal practitioner in such business; or (ii) who, for the purposes of such procurement, frequents the precincts of courts or of revenue offices, or railway stations, landing stages, lodging places or other places of public resort; 1 Ins. by Act No. V of 2014, ss. 2 and 3. 2 Subs. and Ins. by Act No. XII of 2005, s. 3. 3 Ins. by Ordinance No. XL of 1978, s. 2. 4 Subs. by Act No. XXXV of 2018, s. 2.",
      "source_provision": "sec2"
    }
  ]
}
