{
  "id": "pk-letters-of-administration-and-succession-certificates-act-2020",
  "type": "statute",
  "title": "Letters of Administration and Succession Certificates Act, 2020",
  "title_en": "Letters of Administration and Succession Certificates Act, 2020",
  "short_name": "LOAAS",
  "status": "in_force",
  "issued_date": "2021-02-13",
  "in_force_date": "2021-02-13",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NpZ5w%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Letters of Administration and Succession Certificates Act, 2020 (VI of 2020) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "This Act may be called the Letters of\nAdministration and Succession Certificates Act, 2020.\n(2)     It shall extend to the whole of Islamabad Capital Territory.\n(3)     This Act or any part thereof shall come into force on such dates as the Government\nmay, by notification in the official Gazette, appoint."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,−\n(a) “Authority” means the National Database and Registration Authority established\nunder section 3 of the Ordinance;\n(b) “factual controversy” includes an objection by legal heirs or by any claimant of\nlegal heirship, any dispute which may arise in establishing the identity of legal\nheirs which is not resolvable by the Authority or any situation, matter or event\nrequiring adjudication or recording of evidence or where at least one of the legal\nheirs is a minor;\n(c) “Government” means the Federal Government;\n(d) “legal heir” means a person who has entitlement to a share in the property of the\ndeceased;\n(e) “Ordinance” means National Database and Registration Authority Ordinance,\n2000 (VIII of 2000);\n(f) “prescribed” means prescribed by rules; and\n(g) “rules” means the rules made under this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Issuance of Letters of Administration or Succession Certificates",
      "content": "Notwithstanding\nanything contained in any other law for the time being in force, the Authority may issue Letters of\nAdministration or Succession Certificates, as the case may be, to the legal heirs of a deceased in respect\nof immovable or movable property, in accordance with the Family Registration Certificate maintained\nby the Authority."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Establishment of Succession Facilitation Unit",
      "content": "(1) The Authority shall establish a\nSuccession Facilitation Unit for the purpose of receipt, processing and assessment of applications for\ngrant of Letters of Administration and Succession Certificates.\n(2) For the purpose of sub-section (1), the Authority may notify and of its existing offices as\nSuccession Facilitation Unit, at such place or places as it may deem appropriate.\n(3) The Authority may, from time to time, appoint officers, staff, experts, consultants, advisers\nand other employees, on such terms and conditions as it may deem fit, for the purpose of carrying\nfunctions under this Act."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Functions of the Succession Facilitation Unit",
      "content": "The Succession Facilitation Unit shall\nperform the following functions, namely: −\n(a) receive applications for grant of Letters of Administration and Succession Certificates,\nas the case may be, from legal heirs of the deceased;\n(b) process and assess the applications by way of a summary enquiry as prescribed, and\nin case of any factual controversy amongst the legal heirs decline to assess the\napplications for filing afresh before the appropriate forum in accordance with the\nprovisions of the Succession Act, 1925 (XXXIX of 1925) or any other applicable law;\n(c) maintain an online portal providing for updated record of the Letters of Administration\nand Succession Certificates issued under this Act; and\n(d) discharge or perform such functions as are incidental, ancillary or necessary for\ncarrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Application for Letters of Administration or Succession Certificates",
      "content": "(1) An\napplication for grant of Letter of Administration or Succession Certificate, as the case may be, shall\nbe made to the Authority by the legal heirs:\nProvided that legal heirs may also authorize in the prescribed form, one amongst themselves,\nto act on behalf of all other legal heirs, for the purpose of filing an application under this Act.\n(2) An application may be filed in the notified office of the Authority within whose jurisdiction\nthe deceased ordinarily resided at the time of his death, or within whose jurisdiction any property or\nasset of the deceased is located.\n(3) The following documents shall be appended along-with the application, −\n(a) death certificate of the deceased;\n(b) list of the legal heirs and copies of their national identity card\n(c)   details of immovable and movable property in respect of which the Letter of\nAdministration or Succession Certificate is applied for.\n(4) Upon receipt of the application, a notice to the general public shall be published on a web\nportal to be maintained by the Authority and in one English language and one Urdu language daily\nnewspaper of wide circulation.\n(5) Where no objection or claim is received within fourteen days of the publication of notice,\nthe Authority shall, in any of its notified office, obtain the bio-metric verification of the applicant and\nall the legal heirs:\nProvided that where bio-metrics of a legal heir is not verified, the Authority may require the\nlegal heir to appear in person before the Authority on a date fixed by the Authority:\nProvided further that the Authority may resort to any other modern device with a view to\nsatisfying itself as to the identity of any legal heir.\nExplanation:-The bio-metric verification can be undertaken at any notified office within\nPakistan or abroad.\n(2) Upon satisfactory compliance of the codal formalities mentioned in this section, the\napplicant shall appear before the Authority on a date fixed by it, whereafter the Authority shall issue\nthe Letter of Administration or Succession Certificate, as the case may be, in favour of all legal heirs\nof deceased with details of their respective shares as provided in the personal law of such legal heirs.\n(3) The Letters of Administration or Succession Certificates issued under this Act shall have"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Forms of Letters of Administration and Succession Certificates",
      "content": "Letters of\nAdministration and Succession Certificates shall be issued, as nearly as circumstances admit, in the\nforms prescribed by the Authority."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Objection to the Letters of Administration and Succession Certificates",
      "content": "Any person\nobjecting to Letters of Administration or Succession Certificates, as the case may be, after the issuance\nof the Letters of Administration or Succession Certificates by the Authority, may seek remedies\navailable under any other applicable law."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Fee and costs",
      "content": "(1) The Authority may charge the prescribed fees or other sums for its\nservices under this Act including sums incurred on publication of public notice.\n(2) The charges or sums received under sub-section (1) shall be credited to the NADRA\nFund established under section 24 of the Ordinance."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Bar of jurisdiction",
      "content": "No court shall exercise jurisdiction till such time the Authority\ndeclines to process application for issuance of the Letters of Administration or Succession Certificates\nby the Legal heirs."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Penalty, offences and trial",
      "content": "The provisions in relation to offences, penalties and trial\nmentioned in Chapter IX of the Ordinance shall apply mutatis mutandis under this Act."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Act to override other laws",
      "content": "The provisions of this Act shall have effect notwithstanding\nanything contained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Power to make rules",
      "content": "The Government, may, by notification in the official Gazette,\nmake rules to carry out the purposes of this Act."
    }
  ],
  "definitions": [
    {
      "term": "Authority",
      "definition": "the National Database and Registration Authority established under section 3 of the Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "factual controversy",
      "definition": "an objection by legal heirs or by any claimant of legal heirship, any dispute which may arise in establishing the identity of legal heirs which is not resolvable by the Authority or any situation, matter or event requiring adjudication or recording of evidence or where at least one of the legal heirs is a minor;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "legal heir",
      "definition": "a person who has entitlement to a share in the property of the deceased;",
      "source_provision": "sec2"
    },
    {
      "term": "Ordinance",
      "definition": "National Database and Registration Authority Ordinance, 2000 (VIII of 2000);",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules; and",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "the rules made under this Act.",
      "source_provision": "sec2"
    }
  ]
}
