{
  "id": "pk-limitation-emergency-and-war-conditions-act-1965",
  "type": "statute",
  "title": "Limitation (Emergency and War Conditions) Act, 1965",
  "title_en": "Limitation (Emergency and War Conditions) Act, 1965",
  "short_name": "LAWCA",
  "status": "in_force",
  "issued_date": "1965-12-01",
  "in_force_date": "1965-12-01",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJqY-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Limitation (Emergency and War Conditions) Act, 1965 (XVIII of 1965) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.⸻(1) This Act may be called the Limitation",
      "content": "(Emergency and War Conditions) Act, 1965.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once and shall be deemed to have taken effect on the sixth day\nof September, 1965."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,⸻\n(a)        “affected area” means any area which the 1[Federal Government] may by\nnotification in the official Gazette, declare to be an area affected by circum-\nstances attributable to war or armed hostilities, and any such notification may\nbe issued so as to have retrospective effect;\n(b)        “enemy subject” means any individual who possesses the nationality of a State\nwhich is at war with, or engaged in armed hostilities against, Pakistan, or who,\nhaving possessed such nationality at any time, has lost it without acquiring\nanother nationality, or any body of persons constituted or incorporated in or\nunder the laws of such State;\n(c)        “enemy territory” means any area under the sovereignty of, or administered\nby, or for the time being in the occupation of, a State which is at war with, or\nengaged in armed hostilities against, Pakistan, not being an area in the\noccupation of Pakistan, and includes any area which the 1[Federal\nGovernment] may, by notification in the official Gazette, declare, either\ngenerally or in respect of any particular period, to be enemy territory for the\npurposes of this Act ; and\n1\nSubs. by F.A.O. 1975, Art, 2 and Table for “Central Government”.\n(d)    “period of limitation” means,⸻\n(a)    in relation to a suit, appeal or application, the period of limitation\nprescribed therefor by the Limitation Act, 1908 (IX of 1908), or by or\nunder any other law for the time being in force ; and\n(b)    in relation to any act or thing required to be done by any person by or\nunder any law for the time being in force, the period within which such\nact or thing is required to be done."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Extension of limitation in affected areas.⸻Where a period of limitation within which",
      "content": "any suit, appeal or application could have been instituted, preferred or made, or any act or thing\ncould have been done, by a person displaced from any area, or before a court or other authority\nsituated in any area, expires while such area is an affected area, such suit, appeal or application may\nbe instituted, preferred or made, or such act or thing may be done, by such person, notwithstanding\nanything contained in the Limitation Act, 1908 (IX of 1908), or in any other law for the time being in\nforce, within six months of such area ceasing to be an affected area.\nExplanation.⸻Any person who was residing, carrying on business or working for gain, in\nany area, immediately before such area became an affected area, and has, while such area continues\nto be an affected area, left it and is, for that reason, unable to reside, carry on business or work for\ngain therein, shall, for the purposes of this section be deemed to be a person displaced from an\naffected area."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Extension of limitation for suits etc., in certain circumstances.⸻Where any person who",
      "content": "could have instituted a suit, preferred an appeal or made an application, or could have done any act\nor thing required to be done by or under any law for the time being in force, has been detained in\nenemy territory in circumstances attributable to war or armed hostilities and the period of limitation\nexpires while such person is so detained, such suit, appeal or application may be instituted, preferred\nor made, or such act or thing may be done, by such person, notwithstanding anything contained in\nmonths, of such person ceasing to be so detained:\nProvided that, where a person has been so detained for two or more periods, those periods\nshall be treated, for the purpose of this section, as one continuous period beginning with the\nbeginning of the first period and ending with the end of the last period:\nProvided further that this section shall not apply to suits instituted to enforce rights of pre-\nemption or to suits, appeals or applications of any description which may be instituted by enemy\nsubjects.\n____________________\nRGN Date:-18.04.2024"
    }
  ],
  "definitions": [
    {
      "term": "affected area",
      "definition": "any area which the 1[Federal Government] may by notification in the official Gazette, declare to be an area affected by circum- stances attributable to war or armed hostilities, and any such notification may be issued so as to have retrospective effect;",
      "source_provision": "sec2"
    },
    {
      "term": "enemy subject",
      "definition": "any individual who possesses the nationality of a State which is at war with, or engaged in armed hostilities against, Pakistan, or who, having possessed such nationality at any time, has lost it without acquiring another nationality, or any body of persons constituted or incorporated in or under the laws of such State;",
      "source_provision": "sec2"
    },
    {
      "term": "enemy territory",
      "definition": "any area under the sovereignty of, or administered by, or for the time being in the occupation of, a State which is at war with, or engaged in armed hostilities against, Pakistan, not being an area in the occupation of Pakistan, and includes any area which the 1[Federal Government] may, by notification in the official Gazette, declare, either generally or in respect of any particular period, to be enemy territory for the purposes of this Act ; and 1 Subs. by F.A.O. 1975, Art, 2 and Table for “Central Government”.",
      "source_provision": "sec2"
    }
  ]
}
