{
  "id": "pk-listed-companies-substantial-acquisition-of-voting-shares-and-takes-overs-ordina",
  "type": "statute",
  "title": "Listed Companies (Substantial Acquisition of Voting Shares and Takes-Overs) Ordinance, 2002",
  "title_en": "Listed Companies (Substantial Acquisition of Voting Shares and Takes-Overs) Ordinance, 2002",
  "short_name": "LCAOV",
  "status": "in_force",
  "issued_date": "2002-10-28",
  "in_force_date": "2002-10-28",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FtbZ8%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Listed Companies (Substantial Acquisition of Voting Shares and Takes-Overs) Ordinance, 2002 (CIII of 2002) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Removal of difficulties",
      "content": "THE LISTED COMPANIES (SUBSTANTIAL ACQUISITION OF VOTING\nSHARES AND TAKEOVERS) ORDINANCE, 2002\nORDINANCE NO. CIII OF 2002\nAN\n[29th Oct, 2002]\nto provide for substantial acquisition of voting shares and takeovers of listed companies\nWHEREAS it is expedient to provide for a fair and equal treatment to all the investors as well\nas a transparent and efficient system for substantial acquisition of voting shares and takeovers of\nlisted companies and for matters ancillary thereto or connected therewith;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNow, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of\nOctober, 1999, and Provisional Constitution Order No. 1 of 1999, read with the Provisional\nConstitution (Amendment) Order No.9 of 1999, and in exercise of all powers enabling him in that\nbehalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the\nfollowing Ordinance:⸻"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.⸻(1) This Ordinance may be called the Listed",
      "content": "Companies (Substantial Acquisition of Voting Shares and Takeovers) Ordinance, 2002.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.⸻ (1) In this Ordinance, unless there is anything repugnant in the subject or",
      "content": "context,⸻\n(a)    “acquirer” means any person who, directly or indirectly, acquires or has\nproceeded to acquire voting shares in the target company, or acquires or has\nproceeded to acquire control of the target company, either by himself or\nthrough any person acting in concert;\n(b)    “Commission” means the Securities, and Exchange Commission of Pakistan\nestablished under the Securities and Exchange Commission of Pakistan Act,\n1997 (XLII of 1997);\n(c)    “control” includes the right to appoint majority of directors or to control\nmanagement or policy decisions, exercisable by a person individually or\nthrough any person acting in concert, directly or indirectly, whether by virtue\nof his shareholding, management right, shareholders agreement, voting\nagreement or otherwise;\n(d)        “financial institution” means an institution, other than a Banking Company as\ndefined in the Banking Companies Ordinance, 1962 (LVII of 1962), notified\nas such by the Commission either specifically or generally and shall include\nsuch other institutions or companies notified by the Federal Government as\nfinancial institutions;\n(g)        “listed company” means a company or a body corporate whose voting shares\nare listed on a stock exchange;\n(h)        “manager to the offer” means a manager appointed under section 7;\n(i)        “offer period” means the period from the date of public announcement of\npublic offer to the date of closure of public offer or earlier withdrawal thereof;\n(j)        “person acting in concert” means a person who operates with the acquirer to\nacquire voting shares or control of the target company;\n(k)        “prescribed” means prescribed by rules 1[or regulation] made under his\nOrdinance;\n1\n[(l)   [*           *          *          *       *      *   *]\n(m)        “public announcement” means public announcement of offer or intention to be\nmade under section 5, section 6 or section 8, as the case may be, and includes\nany announcement of any competitive bid for acquisition of voting shares of a\ntarget company;\n(n)        “public offer” means the public offer for acquisition of voting shares of a\ntarget company and includes any competitive bid or bids made for this\npurpose;\n(o)        “relative” means spouse, lineal ascendants and descendents;\n(p)        “voting shares” means the shares in the share capital of a listed company\nhaving voting rights; and\n(q)        “target company” means a listed company whose voting shares or control are\ndirectly or indirectly acquired or intended to be acquired.\n(2) All other expressions used but not defined herein shall have the same meanings as are\nassigned to them in the Securities and Exchange Ordinance, 1969 (XVII of 1969), or the Companies\nOrdinance, 1984 (XLVII of 1984)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Ordinance not to apply to certain transactions. 1[(1)] 1[Except as provided otherwise in",
      "content": "sub- section (2), nothing] contained in this Ordinance shall apply to⸻\n1\nIns., omitted, renumbered and subs. by Act I of 08, s. 19 (w.e.f. 1-7-8).\n(a)        allotment of voting shares in pursuance of a pre-public issue or public issue;\n(b)        allotment of voting shares pursuant to a right issue 1[except voting shares\nallotted and issued under sub-section (7) of section 86 of the Companies\nOrdinance, 1984 (XLVII of 1984)]\n(c)        allotment of voting shares to the underwriters pursuant to any underwriting\nagreement;\n(d)        acquisition of voting shares in the ordinary course of business by banks and\nfinancial institutions as enforcement of security;\n(e)        acquisition of voting shares by succession or inheritance;\n1\n[(f)   *           *           *       *       *      *   *]\n(g)        a scheme of arrangement or reconstruction including amalgamation or merger\nor de-merger under any law for the time being in force;\n(h)        acquisition of voting shares in companies whose voting shares are not listed on\nany stock exchange;\n(i)        exercise of option by a bank or a financial institution in pursuance of a\nconversion option;\n(j)        sale of shares in consequence of privatization of a unit or its management\nrights within the meaning of the Privatization Commission Ordinance, 2000\n(LII of 2000);\n(k)        sale of shares in consequence of any on-going negotiations on the\ncommencement of this Ordinance provided that the negotiations are finalized\nand agreement reached within thirty days of such commencement; 1[*]\n(l)        existing shares held by a person on the date of commencement of this\nOrdinance 1[;]\n1\n[(m) transfer of voting shares to a person’s relatives without monetary\nconsideration;\n(n)        acquisition of voting shares in the ordinary course of business by CFS\nfinanciers acting as financiers;\n(o)        a scheme of rehabilitation of a company approved by the Commission;\n(p)        transfer by sponsors of a holding company to such holding company within\ntwo years of incorporation of holding company, voting shares of such listed\ncompany or companies held by the sponsors on the date of incorporation of\nthe holding company, which will after the transfer of such shares become\nsubsidiary or subssidiaries of the said holding company; and\n1\nadded, omitted and Subs. by Act I of 08, s. 19 (w.e.f. 1-7-8).\n(q)         acquisition of voting shares by a strategic investor in case of disinvestment by\nby existing shareholders of a stock exchange pursuant to the demutualizaition\nprocess.]\n1\n[(2) After the acquirer acquires voting shares pursuant to clauses (a), (b), (c), (d), (e), (g), (i),\n(j), (m), and (o) sub-section (1) the acquirer shall make a disclosure of the acquisition in the\nprescribed manner.]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Acquisition of more than ten per cent voting shares of a company.⸻(1) Any acquirer",
      "content": "who acquires voting shares, which (taken together with voting shares, if any, held by the acquirer)\nwould entitle the acquirer to more than ten per cent voting shares in a listed company, shall disclose\nthe aggregate of his shareholding in that company to the said company and to the stock exchange on\nwhich the voting shares of the said company are listed as provided in sub-section (2).\n(2) The disclosure mentioned in sub-+section (1), shall be made within two working days\nof,⸻\n(a)         the receipt of intimation of allotment of voting shares; or\n(b)         the acquisition of voting shares, as the case may be.\nExplanation.⸻For the purposes of this section expression “acquisition” shall include\npurchases confirmed by the member of a stock exchange in accordance with sub-rule (4) of rule 4 of\nthe Securities and Exchange Rules, 1971.\n(3) Any acquirer may acquire additional voting shares in any period of twelve months after\nacquisition of voting shares pursuant to sub-section (1) without making disclosure as required by\nsub-section (1) in case the total acquisition does not exceed an aggregate of twenty-five per cent."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Additional acquisition of voting shares.⸻(1) No person shall, directly or indirectly,",
      "content": "acquire⸻\n(a)         voting shares, which (taken together with voting-hares, if any, held by such\nperson) would entitle such person to more than twenty-five per cent voting\nshares in listed company; or\n(b)         control of a listed company,\nunless such person makes a public announcement of offer to acquire voting shares or control of such\ncompany in accordance with this Ordinance.\n1\nadded by Act I of 08, s. 19 (w.e.f. 1-7-8).\n(2) Before making announcement under sub-section (1), such person shall make disclosure in\nthe manner specified in section 4."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Consolidation of holdings.⸻ (1) No acquirer, who has acquired more than twenty",
      "content": "five\nper cent but less than fifty-one per cent of the voting shares or control of a listed company, shall\nacquire additional voting shares or control unless such acquirer makes a public announcement of\noffer to acquire voting shares or control in accordance with this Ordinance:\nProvided that such acquirer shall not be required to make a fresh public announcement of\noffer within a period of twelve months from the date of the previous announcement.\n(2) No acquirer shall acquire voting shares in excess of the quantity specified in the invitation\nof offer made by such acquirer and all additional or incremental acquisition beyond the preceding\noffer shall be valid only through further offer.\n(3) Noting in this section shall apply to a person who has already acquired fifty-one per cent\nor more of the voting share or control in consequence of making a public announcement of the offer."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Appointment of manager to the offer.⸻ (1) Before making any public announcement",
      "content": "the acquirer shall appoint a bank, or financial institution, or a member of a stock exchange who is not\nan associate, or group, of the acquirer or the target company, as a manager to the offer.\n(2) The manager to the offer shall be deemed to be the agent of the acquirer."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Timing of the public announcement.⸻ (1) Before acquisition of voting shares beyond",
      "content": "the threshold specified in section 5 or section 6, the acquirer shall, after giving notice to the\nCommission as required by sub-section (3) of section 9, make a public announcement of such an\nintention forthwith.\n(2) In case of an acquirer acquiring Global Depository Receipts or American Depository\nReceipts which, when taken together with the voting shares, of any, already held by the acquirer,\nwould entitle the acquirer to voting shares, exceeding the percentage specified in section 5 or section\n6, the public announcement referred to in sub-section (1) shall be made not later than two working\ndays before he acquires voting shares on such securities upon conversion or exercise of option as the\ncase may be."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Public announcement.⸻ (1) The public announcement shall be published at least in one",
      "content": "issue each of a daily newspaper in English language and a daily newspaper in Urdu language having\ncirculation in the Province or Provinces in which the stock exchange, on which the target company is\nlisted, is situated.\n(2) The public announcement shall contain such information as may be prescribed.\n(3) A copy of the public announcement shall be submitted to the Commission through the\nmanager to the offer at least two working days before its issuance.\n(4) Simultaneous with the submission of the public announcement to the Commission, the\npublic announcement shall also be sent to all the stock exchanges on which the voting shares of the\ntarget company are listed for being notified on the notice board and on the automated information\nsystem thereof, and to the target company at its registered office for being placed before the board of\ndirectors of such company.\n(5) A public offer under this Ordinance shall be deemed to have been made on the date on\nwhich the public announcement is made in any of the newspapers as required by sub-section (1)."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Contents of public offer, mode of payment and minimum offer price.⸻The contents",
      "content": "of the public offer, its submission to the Commission, the date to be specified for the public\nannouncement, mode of payment and minimum offer price, shall be in such form and manner as may\nbe prescribed."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Public announcement and offer letter etc. not to contain misleading material.⸻The",
      "content": "public announcement, any other advertisement, circular, brochure, publicity material or offer letter\nissued in respect of, or in relation to, the acquisition of voting shares shall not contain any,\nmisleading information."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Number of voting shares to be acquired.⸻ (1) A public offer shall be made by the",
      "content": "acquirer for such percentage as the 1[Commission may prescribe].\n(2) Where the number of voting shares offered for sale by the shareholders are more than the\nvoting shares offered to be acquired by the acquirer, the acquirer shall, in consultation with the\nmanager to the offer, accept the public offer or offers received from the shareholders on a\nproportional basis:\nProvided that acquisition of voting shares from a shareholder shall not be less than the\nminimum marketable lot or the entire holding if it is less than the marketable lot."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. General obligations of the acquirer.⸻ (1) Within two working days of the public",
      "content": "announcement, the acquirer shall send a copy of the proposed offer letter to the target company at its\nregistered office address and all the stock exchanges, where the voting shares of the company are\nlisted, and the Commission.\n(2) The acquirer shall ensure that the offer letter is sent to all the shareholders of the target\ncompany whose names appear on the register of members of the company as on the date specified in\nthe public announcement:\nProvided that where the public announcement is made pursuant to an agreement to acquire\nvoting shares or control of the target company, the offer letter shall be sent to the shareholders other\nthan the parties to the agreement.\n(3) A copy of offer letter shall be sent to⸻\n(a)         the custodians of Global Depository Receipts or American Depository\nReceipts to enable such persons to participate in the open offer, if they are\nentitled to do so; and\n(b)         the convertible security holders, where the period of conversion falls within\nthe offer period.\n1\nSubs. and Ins. by Act I of 08, s. 19 (w.e.f. 1-7-8).\n(4) The date of acceptance of a public offer shall be not later than the sixtieth day from the\ndate of public announcement.\n(5) In case the acquirer is a company 1[whether incorporated in Pakistan or outside Pakistan],\nthe public announcement, brochure, circular, offer letter or any other advertisement or publicity\nmaterial issued to shareholders in connection with a public offer shall state that the directors accept\nthe responsibility for the information contained in such documents:\nProvided that if any of the directors desires to exempt himself from responsibility for the\ninformation in such documents, such director shall issue a statement to that effect together with\nreasons thereof 1[in the public announcement of offer].\n(6) Where a public offer is made conditional upon minimum level of acceptance, the acquirer\nmay accept the acceptances even if such acceptances, put together, do not reach the minimum level\nso offered:\nProvided that the acquirer may reject all such acceptances if the same do not reach a level\nindicated in the public offer.\n(7) Persons, other than the acquirer, representing or having interest in the target company or\nan insider or a beneficial owner of more than ten per cent of the voting shares during the last twelve\nmonths, shall stand excluded and shall not participate in any matters concerning or relating to a\npublic offer including any preparatory steps leading to the offer.\n(8) On or before the date of issue of public announcement, the acquirer shall create a security\nas provided in this Ordinance.\n(9) The acquirer shall ensure that firm financial arrangements for fulfilment of the obligations\nunder the public offer and suitable disclosures in this regard have been made in the public\nannouncement.\n(10) The acquirer shall, within a period of thirty days from the date of the closure of public\noffer, complete all procedures relating to the public offer including payment of consideration to the\nshareholders who have accepted the public offer and for the purpose open a special count as provided\nin sub-section (1) of section 20:\nProvided that where the acquirer is unable to make the payment to the shareholders who have\naccepted the public offer before the said period of thirty-days due to non-receipt of requisite statutory\napprovals, the Commission may, if satisfied that non-receipt of requisite statutory approvals was not\ndue to any wilful default, neglect or failure of the acquirer to diligently pursue ‘the applications for\nsuch approvals, grant extension of time for a period not exceeding thirty days in aggregate.\n(11) In the event of withdrawal of public offer, a person shall not make any offer for\nacquisition of voting shares of the target company for a period of twelve months from the date of\npublic announcement of withdrawal of public offer.\n1\nIns. by Act I of 08, s. 19 (w.e.f. of 1-7-8).\n(12) In the event of non-fulfilment of obligations under Chapter III or Chapter IV of this\nOrdinance, a person shall not make any offer for acquisition of voting shares of any listed company\nfor a period of twelve months from the date of closure of public offer.\n(13) Where the acquirer has not either in the public announcement or in the offer letter, stated\nhis intention to dispose of the undertaking or a sizeable part thereof, of the target company except in\nthe ordinary course of business of the target company, the acquirer, where he has acquired control of\nthe target company, shall be debarred from disposing of the undertaking or a sizeable part thereof, of\nthe target company for a period of two years from the date of acquisition of the control."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. General Obligations of the Board of Directors of the target company.⸻ (1) The",
      "content": "board of directors of the target company, during the offer period, shall not⸻\n(a)     sell, transfer, or otherwise dispose of or enter into an agreement for sale,\ntransfer, or for disposal of the undertaking or a sizeable part thereof, not being\nsale or disposal of assets in the ordinary course of business of the company or\nits subsidiaries;\n(b)     encumber any asset of the company or its subsidiary;\n(c)     issue any right or bonus voting shares during the offer period; or\n(d)     enter into any material contract.\n(2) The target company shall furnish to the acquirer, within seven days of the request of the\nacquirer or within seven days from the specified date mentioned in the public announcement,\nwhichever is later, a list of convertible Security holders as are eligible for participation under clause\n(b) of sub-section (3) of section 13 containing name address, shareholding and folio number, and of\nthose persons whose applications for registration of transfer of the securities are pending with the\ncompany.\n(3) Once the public announcement has been made, the Board of Directors of the target\ncompany shall not appoint an additional director or fill in any casual vacancy on the Board of\nDirectors, by any person representing or having interest in the acquirer till the date of certification by\nthe manager to the offer as provided under sub-section (6).\n(4) The Board of Directors of the target company may, if it so desires, send its unbiased\ncomments and recommendations on the public offer to the shareholders:\nProvided that for any misstatement, or for concealment of material information, the directors\nshall be liable to penalty as provided in this Ordinance.\n(5) The board of directors of the target company shall facilitate the acquirer in verification of\nsecurities tendered for acceptance.\n(6) Upon fulfilment of all obligations by the acquirer under this Ordinance as certified by the\nmanager to the offer, the board of directors of the target company shall transfer the securities\nacquired by the acquirer, whether under an agreement or from open market purchases, in the name of\nthe acquirer.\n(7) The target company shall allow such changes in the board of directors as would give the\nacquirer proportionate representation on the board or control of the company notwithstanding\nanything contained in the Companies Ordinance, 1984 (XLVII of 1984).\n(8) Where an acquirer, in compliance with the provisions of this Ordinance, has acquired at\nleast thirty per cent of the voting shares of the target company, he shall be entitled to a proportionate\nrepresentation on the board of directors of the target company as hereinafter provided.\n(9) The acquirer shall serve a notice on the target company together with evidence of his\nvoting power so acquired and a copy of such notice shall also be submitted of the Commission.\n(10) On receipt of notice as specified in sub-section (9), the board of directors of the target\ncompany shall cause a meeting of the board to be held within ten days from the receipt of the notice\nunder sub-section (9).\n(11) The Board of Directors of the target company may fill any casual vacancy so created by\nthe resignation of one or more directors with mutual consent to accommodate the acquirer on the\nboard in accordance with his entitlement.\n(12) In case the acquirer does not get a proportionate representation on the board of directors\nof the target company or the number of casual vacancies so created to complete the board on the\nbasis of proportional representation are not sufficient, the acquirer may serve a notice on the target\ncompany for holding of fresh elections and shall submit a copy of such notice to the Commission\nforthwith.\n(13) The board of directors of the target company shall cause the election of directors to be\nheld within thirty days from the receipt of the notice under sub-section (12).\n(14) The election of directors of the target company shall be held in accordance with the\nprovisions of sub-sections (2) to (5) of section 178 of the Companies Ordinance, 1984 (XLVII of\n1984).\n(15) The board of directors so elected shall hold office during the remainder of the term of\nthe outgoing directors of the target company.\n(16) Any irregularity in the election of directors so held may be brought to the notice of the\nCommission either by the management of the target company or by the acquirer within seven days of\nthe date of such election.\n(17) The Commission may declare the election, so held, null and void if it is satisfied that\ncertain irregularities did exist in the holding of the election and may order the holding of fresh\nelection under the supervision of an independent person to be appointed by the Commission for such\npurpose.\n(18) In case fresh elections are held as specified in sub-section (17), the Commission may\nimpose such penalty can the outgoing directors in their individual capacity as it may deem fit and\nsuch penalty shall in no case be debited to the company’s account."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. General obligations of the manager to the offer.⸻ 1[(1)] Before the public",
      "content": "announcement is made, the manager to the offer shall⸻\n(a)        ensure that the acquirer is able to implement the public offer;\n(b)        ensure that the provision relating to security referred to in section 19 has been\nmade;\n(c)        ensure that firm arrangements for funds and money for payment through\nverifiable means to fulfil the obligations under the public offer have been\nmade;\n(d)        ensure that the public announcement is made in accordance with section 9;\n(e)        furnish to the Commission a due diligence certificate which shall accompany a\ncopy of the proposed offer letter;\n1\n[(f)   *           *           *            *      *       *   *]\n(g)        ensure that the contents of the public announcement and offer letter are true,\nfair and adequate and based on reliable sources, quoting the source wherever\nnecessary;\n1\n[(h)   *           *           *            *      *       *   *]\n1\n[(i)   *           *           *            *      *       *   *]\n1\n[(j)   *           *           *            *      *       *   *]\n1\n[(2) The manager to the offer shall,⸻\n(a)        on the day of the public announcement of offer ensure that the proposed public\nannouncement of offer is filed with the Commission, target company and also\nsent to the stock exchange on which the voting shares of the target company\nare listed in accordance with this Ordinance;\n(b)        upon fulfilment of the necessary obligations by the acquirer under this\nOrdinance and the rules and regulations, cause the release of the balance\namount of the security to the acquirer; and\n(c)        after ensuring compliance with the provisions of the Ordinance and any other\nlaws or rules and regulations as may be applicable, send a report to the\nCommission within forty five days from the date of closure of public offer or\nearlier with drawal thereof.]\n1\nrenumbered, omitted & added by Act I of 08, s. 19 (w.e.f. 1-7-8)."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Procedure for making competitive bid.⸻(1) Any person, other than the acquirer who",
      "content": "has made the first public announcement, who is desirous of making a competitive bid, shall, within\ntwenty-one days of the public announcement of the first offer, make a public announcement of his\noffer for acquisition of the same voting shares of the target company.\n(2) No public announcement of a competitive bid shall be made after twenty-one days from\nthe date of public announcement of the first offer.\nExplanation.⸻For the purpose of this section a bid shall be deemed to be competitive only if\nit offers a higher purchase price.\n(3) A competitive bid shall not be for less than the number of voting shares for which the\nearlier public offer has been made.\n(4) Upon the public announcement of a competitive bid the acquirer, who has made a public\nannouncement of the earlier offer, shall have the option to make another announcement-\n(a)     revising the public offer; or\n(b)     withdrawing the public offer with the prior approval of the Commission.\nProvided that if no such announcement is made within ten days of the public\nannouncement of the competitive bid, the earlier offer on the original terms shall continue to\nbe valid and binding on the acquirer who has made the earlier public offer, except that the\ndate of closing of such public offer shall stand extended to the date of closure of public offer\nunder the last subsisting competitive bid.\n(5) The provisions of this Ordinance shall, mutatis mutandis, apply to the competitive bid\nmade under sub-section (1).\n(6) An acquirer who has made a public announcement, and has not withdrawn his public offer\nin terms of sub-section (4), shall have the option to make an upward revision of his offer in respect of\nthe price and the number of voting shares to be acquired at any time within seven working days prior\nto the date of closure of the last subsisting public offer without changing any other terms and\nconditions of the said public offer.\n(7) Any upward revision made in terms of sub-section (6), shall be made only on the\nfollowing conditions, namely:⸻\n(a)     the making of a public announcement in respect of such changes or\namendments in all the newspapers in which the earlier public announcement\nwas made,\n(b)     the informing of the Commission, the stock exchange on which the voting\nshares of the target company are listed, and the target company at its registered\noffice, simultaneous with the issue of public announcement referred in clause\n(a); and\n(c)     the increase in the value of the security as provided under sub-section (3) of\nsection 19.\n(8) Where there is a competitive bid, the date of closure of the earlier bid, as also the date of\nclosure of all the subsequent competitive bids, shall be the date of closure of public offer under the\nlast subsisting competitive bid and the public offers under all the subsisting competitive bids shall\nclose on the same date."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Upward revision of Offer.⸻ Irrespective of whether or not there is a competitive bid the",
      "content": "acquirer, who has made the public announcement, may make upward revision in his offer in respect\nto the price and the number of voting shares to be acquired at any time up to seven working days\nprior to the date of the closure of public offer:\nProvided that any such upward revision of the public offer shall be made only on the\nfollowing conditions, namely:⸻\n(a)     the making of a public announcement in respect of such changes or\namendments in all the newspapers in which the earlier public announcement\nwas made;\n(b)     the informing of the Commission, the stock exchange on which the voting\nshares of the target company are listed, and the target company at its registered\noffice simultaneous with the issue of public announcement referred in clause\n(a); and\n(c)     the increase in the value of the security as provide under sub-section (3) of\nsection 19."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Withdrawal of public offer.⸻ (1) A public offer, once made, may be withdrawn⸻",
      "content": "(a)     if the withdrawal is consequent upon any competitive bid;\n(b)     if the sole acquirer, being a natural person, has died; or\n(c)     in such circumstances as may be prescribed.\n(2) In the event of withdrawal of the public offer under any of the circumstances specified\nunder sub-section (1), the acquirer, or the manager to the offer, stall⸻\n(a)     make a public announcement in all the newspapers in which the public\nannouncement was made indicating reasons for withdrawal of the public offer;\nand\n(b)    inform the Commission, the stock exchange on which the voting shares of the\ntarget company are listed, and the target company at its registered office,\nsimultaneous with the issue of such public announcement."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Security to be furnished by the acquirer.⸻ (1) The acquirer shall furnish a security for",
      "content": "performance of his obligations on such terms and conditions as may be prescribed.\n(2) The total consideration payable under the public offer shall be calculated assuming full\nacceptance irrespective of whether the consideration for the public offer is payable in cash or\notherwise.\n(3) In case there is any upward revision of offer, consequent upon a competitive bid or\notherwise, the value of the security shall be increased as may be prescribed under sub-section (1).\n(4) The security furnished shall be released in such manner as may be prescribed."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Procedure for payment and delivery of voting shares.⸻ (1) For the amount of",
      "content": "consideration payable in cash, the acquirer shall, within a period of twenty-one days from the date of\nclosure of the public offer open a special account with a scheduled bank and deposit therein such\nsum as would, together with ninety per cent of the security furnished under section 19, make up the\nentire um due and payable to the shareholders as consideration for acceptances received and accepted\nin terms of the public offer.\n(2) The unclaimed balance in the account referred to in sub-section (1) shall, at the end of six\nmonths from the date of deposit thereof, be refunded to the acquirer in such manner as may be\nprescribed.\n(3) In respect of consideration payable by way of exchange of securities, the acquirer shall\nensure that the securities are actually issued and dispatched to the shareholders."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Enquiry.⸻ The Commission may appoint one or more persons as enquiry officer or",
      "content": "officers to undertake an enquiry for any of the following purposes, namely:⸻\n(a)     to enquire into the complaints received from the investors holding not less\nthan one-tenth of the total voting powers in a target company, on any matter\nhaving a bearing on the allegations of substantial acquisition of voting shares\nand takeovers;\n(b)     to enquire suo motu upon its own knowledge or information, in the interest of\nsecurities market or the investors, for any breach of the provisions of this\nOrdinance;\n(c)     to ascertain whether the provisions of this Ordinance are being complied with:"
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Notice before enquiry.⸻ (1) Before ordering an enquiry under section 21, the",
      "content": "Commission shall give not less than seven days’ notice to the acquirer, the seller, the target\ncompany, the manager to the offer as the case may be.\n(2) During the course of an investigation, the acquirer, the seller, the target company, the\nmanager to the offer, against whom the investigation is being carried out shall be bound to discharge\nhis obligation as provided in this Ordinance and the rules made thereunder."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Obligations on enquiry by the Commission.⸻ (1) It shall be the duty of the acquirer",
      "content": "the seller, the target company or the manager to the offer, whose affairs are being enquired into and\nof every director officer and employee thereof, to produce to the enquiry officer such books,\naccounts, securities records and other documents in its custody or control and furnish to the enquiry\nofficer such statement and information as he may, within such reasonable period as he may specify,\nrequire.\n(2) The acquirer, the seller, the target company, the manager to the offer and the persons\nbeing enquired into shall allow the enquiry officer to have reasonable access to the premises\noccupied by such a person or by any other person on behalf of such a person and also extend\nreasonable facility for examining any books, records, documents and computer data in the possession\nof such a person and also provide copies of documents or other materials which, in the opinion of the\nenquiry officer, are relevant for the purposes of the enquiry.\n(3) The enquiry officer, in the course of enquiry, may examine or record the statements of\nany director, officer or employee of the acquirer, the seller, the target company and the manager to\nthe offer.\n(4) It shall be the duty of every director, officer or employee of the acquirer, the seller, the\ntarget company and the manager to the offer to give the enquiry officer all assistance in connection\nwith the enquiry which he may require."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Submission of report and communication of findings.⸻ (1) The enquiry officer shall,",
      "content": "as soon as possible, on completion of the enquiry, submit report to the Commission.\n(2) The Commission shall, after consideration of the enquiry report, communicate the\nfindings of the enquiry officer to the acquirer, the seller, the target company, the manager to the offer\nas the case may be.\n(3) On receipt of the reply from the acquirer, the seller, the target company or, as the case\nmay be, the manager to the offer, the Commission may direct them to take such measures as it may\ndeem fit in the interest of the securities market and for due compliance with the provisions of this\nOrdinance and rules made thereunder."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Directions by the Commission.⸻ The Commission may, in the interests of the securities",
      "content": "market, give such directions as it deems fit including⸻\n(a)     directing the person concerned not to further deal in securities;\n(b)     prohibiting the person concerned from disposing of any of the securities\nacquired in violation of provisions of this Ordinance;\n(c)     directing the person concerned to sell the voting shares acquired in violation of\nthe provisions of this Ordinance; and\n(d)     taking such action against the person concerned as may be necessary."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Penalties for non",
      "content": "compliance.⸻ (1) In the event of withdrawal of public offer, except as\nprovided in section 18, or contravention of any provision of this Ordinance, the acquirer and any\nperson acting in concert shall stand debarred as acquirers for the next three years.\n(2) In case the board of directors or management of the target company contravenes any\nprovision of this Ordinance, the directors, the chief executive and the company and secretary, on a\nfinding by the Commission, shall stand disqualified to hold any such office in a listed company for\nthe next two years.\n(3) If any person⸻\n(a)         refuses or fails to furnish any document, paper or information which he is\nrequired to furnish by, or under, this Ordinance;\n(b)         refuses or fails to comply with any order or direction of the Commission made\nor issued under this Ordinance; or\n(c)         contravenes or otherwise fails to comply with the provisions of this Ordinance,\nthe Commission may, if satisfied, after giving the person an opportunity of being heard, that the\nrefusal, failure or contravention was willful, impose penalty which may extend to 1[fifty] million\nrupees as may be specified in the order and, in the case of a continuing default, a further sum\ncalculated at the rate of 1[two hundred] thousand rupees for every day after the issue of such order\nduring which the refusal, failure or contravention continues.\n(4) Any sum directed to be paid under sub-section (3) 1[may] be recoverable as an arrear of\nland revenue."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Delegation of powers.–– The Commission may, subject to such conditions and",
      "content": "limitations as it may deem fit to impose, delegate all or any of its powers and functions under this\nOrdinance to a Commissioner appointed under section 5 of the Securities and Exchange Commission\nof Pakistan Act, 1997 (XLII of 1997)."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Relaxation of provisions of the rules.–– Where the Commission is satisfied that it is not",
      "content": "practicable or expedient to comply with any requirement of the rules made hereunder in a particular\ncase, the Commission may, in consultation with the Federal Government and for reasons to be\nrecorded, relax such requirement subject to such conditions as it may deem fit."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Power of the Commission to make rules.–– The Commission may, in consultation with",
      "content": "the Federal Government and by notification in the official Gazette, make rules for carrying out the\npurposes of this Ordinance.\n[29A. Power of the Commission to make regulations. ⸻(1) The Commission may, by\n1\nnotification in the official Gazette, make such regulations, not inconsistent with provisions of this\nOrdinance and the rules, made as may be necessary to carry out the purposes of the Ordinance and\nincidental and connected matters:\nProvided that the power to make regulations conferred by this section shall be subject to the\ncondition of previous publication and before making any regulations the draft thereof may be\npublished in the manner considered most appropriate by the Commission for eliciting public opinion\nthereon within a period of not less than fifteen days from the date of publication.\n1\nSubs. and Ins. by Act I of 08, s. 19 (w.e.f. 1-7-8).\n(2) Without prejudice to the generality of sub-section (1), the Commission may make\nregulations for or with respect to⸻\n(a)     the form, manner, timing and submission of offers letters;\n(b)     public announcements;\n(c)     public offers;\n(d)     independent advice to shareholders;\n(e)     the obligations of directors;\n(f)     obligations and restrictions of the acquirer and manager to the offer;\n(g)     the standard of care and responsibility;\n(h)     the timing and content of documents;\n(i)     the offer timetable;\n(j)     asset valuations and offer pricing and mode of payment;\n(k)     restrictions on dealings before and during the offer;\n(I)     disclosure of dealings;\n(m)     security to ensure completion of a takeover offer;\n(n)     acceptable securities:\n(o)     mandatory offers, offer size and acquisition;\n(p)     conditional offers;\n(q)     competitive bids;\n(r)     conduct of enquiry; and\n(s)     any other matter that this Ordinance requires for regulations to be made or for\nany matter the Commission considers necessary to ensure the proper conduct\nof takeovers.\n(3) Any regulation made under this section may provide that a contravention thereof shall be\npunishable with a fine which may extend to thirty million rupees and, where the contravention is a\ncontinuing one, with a further fine which may extend to one hundred thousand rupees for every day\nafter the first during which such contravention continues."
    },
    {
      "provision_ref": "sec29b",
      "section": "29B",
      "title": "Section 29B. The power of the Commission to issue directives, circulars.–– (1) guidelines, etc",
      "content": "The Commission may issue such directives, 1 codes, guidelines, circulars or notifications as are\nnecessary to carry out the purposes of this Ordinance, the rules and regulations made thereunder.]"
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Ordinance to override other laws etc.⸻ The provisions of this Ordinance shall have",
      "content": "effect notwithstanding anything contained in the Companies Ordinance, 1984 (XLVII of 1984), or\nany other law for the time being in force or in any charter, statute or memorandum or articles of\nassociation or in any applicable document or resolution."
    }
  ],
  "definitions": [
    {
      "term": "acquirer",
      "definition": "any person who, directly or indirectly, acquires or has proceeded to acquire voting shares in the target company, or acquires or has proceeded to acquire control of the target company, either by himself or through any person acting in concert;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the Securities, and Exchange Commission of Pakistan established under the Securities and Exchange Commission of Pakistan Act, 1997 (XLII of 1997);",
      "source_provision": "sec2"
    },
    {
      "term": "control",
      "definition": "the right to appoint majority of directors or to control management or policy decisions, exercisable by a person individually or through any person acting in concert, directly or indirectly, whether by virtue of his shareholding, management right, shareholders agreement, voting agreement or otherwise;",
      "source_provision": "sec2"
    },
    {
      "term": "financial institution",
      "definition": "an institution, other than a Banking Company as defined in the Banking Companies Ordinance, 1962 (LVII of 1962), notified as such by the Commission either specifically or generally and shall include such other institutions or companies notified by the Federal Government as financial institutions;",
      "source_provision": "sec2"
    },
    {
      "term": "listed company",
      "definition": "a company or a body corporate whose voting shares are listed on a stock exchange;",
      "source_provision": "sec2"
    },
    {
      "term": "manager to the offer",
      "definition": "a manager appointed under section 7;",
      "source_provision": "sec2"
    },
    {
      "term": "offer period",
      "definition": "the period from the date of public announcement of public offer to the date of closure of public offer or earlier withdrawal thereof;",
      "source_provision": "sec2"
    },
    {
      "term": "person acting in concert",
      "definition": "a person who operates with the acquirer to acquire voting shares or control of the target company;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules 1[or regulation] made under his Ordinance; 1 [(l) [* * * * * * *]",
      "source_provision": "sec2"
    },
    {
      "term": "public announcement",
      "definition": "public announcement of offer or intention to be made under section 5, section 6 or section 8, as the case may be, and includes any announcement of any competitive bid for acquisition of voting shares of a target company;",
      "source_provision": "sec2"
    },
    {
      "term": "public offer",
      "definition": "the public offer for acquisition of voting shares of a target company and includes any competitive bid or bids made for this purpose;",
      "source_provision": "sec2"
    },
    {
      "term": "relative",
      "definition": "spouse, lineal ascendants and descendents;",
      "source_provision": "sec2"
    },
    {
      "term": "voting shares",
      "definition": "the shares in the share capital of a listed company having voting rights; and",
      "source_provision": "sec2"
    },
    {
      "term": "target company",
      "definition": "a listed company whose voting shares or control are directly or indirectly acquired or intended to be acquired. (2) All other expressions used but not defined herein shall have the same meanings as are assigned to them in the Securities and Exchange Ordinance, 1969 (XVII of 1969), or the Companies Ordinance, 1984 (XLVII of 1984).",
      "source_provision": "sec2"
    }
  ]
}
