{
  "id": "pk-local-authorities-loans-act-1914",
  "type": "statute",
  "title": "Local Authorities Loans Act, 1914",
  "title_en": "Local Authorities Loans Act, 1914",
  "short_name": "LALA",
  "status": "in_force",
  "issued_date": "1914-02-27",
  "in_force_date": "1914-02-27",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apia-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Local Authorities Loans Act, 1914 (IX of 1914) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent",
      "content": "_ (1) This Act may be called the Local Authorities Loans Act,\n1914.\n2\n[(2) It extends to the whole of Pakistan.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, “local authority” means any person legally entitled to the control",
      "content": "or management of any local or municipal fund, or legally entitled to impose any cess, rate, duty or\ntax within any local area ;\n“funds”, used with reference to any local authority, includes any local or municipal fund to\nthe control or management of which such authority is legally entitled, and any cess, rate, duty or tax\nwhich such authority is legally entitled to impose, and any property vested in such authority ;\n“prescribed” means prescribed by rules made under this Act ; and\n“work” includes a survey, whether incidental to any other work or not ;\n[“the Government” or “the appropriate Government” means, in relation to cantonment\n3\nauthorities and in relation to port authorities in major ports, the 4[Federal Government], and in\nrelation to other local authorities, the Provincial Government.]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Borrowing powers of local authorities",
      "content": "_ (1) A local authority may, subject to the\nprescribed conditions, borrow on the security of its funds or any portion thereof for any of the\nfollowing purposes, namely:-\n(i)        the carrying out of any works which it is legally authorized to carry out,\n(ii)       the giving of relief and the establishment and maintenance of relief works in\ntimes of famine or scarcity,\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1914, Pt. V, p. 5 ; for Report of Select Committee, see ibid., 1914, Pt. V, p. 17 ; and for\nProceedings in Council, see ibid., 1914, Pt. VI, pp. 64, 159, 189 and 496.\nThis Act has been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950) ; and applied in the\nFederated Areas of Baluchistan, see Gazette of India, 1937, Pt. 1., p. 1499.\nThe Act has been extended and shall be deemed to have been so extended on the 14-10-1955 to the whole of Pakistan by the Central Laws (Statute\nReform) Ordinance, 1960 (21 of 1960), s. 3 and Sch.\nprovisions are not inconsistent with the provisions of the Ordinance, see s. 14 of Ordinance 13 of 1949.\n2\nSubs. by Ordinance 21 of 1960, s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for the original sub-section (2) as amended by A. O., 1949,\nSch.\n3\nIns. by A. O., 1937.\n4\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n(iii)      the prevention of the outbreak or spread of any dangerous epidemic disease,\n(iv)       any measures which may be connected with or ancillary to any purposes\nspecified in clauses (ii) and (iii),\n(v)        the repayment of money previously borrowed in accordance with law:\nProvided that nothing in clause (v) shall be deemed to empower a local authority to fix a\nperiod for the repayment of any money borrowed thereunder which, when the period fixed for the\nrepayment of the money previously borrowed is taken into account, will exceed maximum period\nfixed for the repayment of a loan by or under any enactment for the time being in force :\n1\n[Provided further that, in the case of loans other than loans made by the 2[appropriate\nGovernment], no amount exceeding twenty-five lakhs of rupees shall be borrowed unless the terms,\nincluding the date of floatation, of such loan have been approved by the 3[appropriate Government].]\n(2) Nothing in this section shall be deemed to authorize any local authority—\n(a)        to borrow or spend money for any purpose for which, under the law for the\ntime being in force, it is not authorized to apply its funds, or\n(b)        to borrow money by means of the issue of bills or promissory notes payable\nwithin any period not exceeding twelve months."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to Government to make rules",
      "content": "__ (1) The 2[appropriate Government] may make\n5\nrules consistent with this Act as to—\n(i)        the nature of the funds on the security of which money may be borrowed ;\n(ii)       the works for which money may be borrowed ;\n(iii)      the manner of making applications for permission to borrow money ;\n(iv)       the inquiries to be made in relation to such loans, and the manner of\nconducting such inquiries ;\n(v)        the cases and the forms in which particulars of applications and proceedings,\nand orders thereon, shall be published ;\n(vi)       the cases in which the 2[appropriate Government] may make loans 6* * * ;\n7\n[(vii) the cases in which local authorities may take loans from persons other than the\n[appropriate Government] ; ]\n1\nThis proviso was ins. by the Devolution Act, 1920 (38 of 1920), s.2 and Sch. I.\n2\nSubs. by A. O., 1937, for “L. G.”.\n3\nSubs. ibid., for “G. G. in C.”.\n-\nSubs. ibid., for the words “L. G.” which were subs. by Act 38 of 1920, s. 2 and Sch. I, for “G. G. in C.”.\n5\nFor rules applying to all local authorities in Chief Commissioners' Provinces and to Cantonment authorities and port authorities of major ports in\nGovernors’ Provinces, see the Local Authorities Loans (Central) Rules, 1937 (published in the Gazette of India, 1937, Pt. I, p. 1902); and for rules\napplying to other local authorities in Governors' Provinces, see the Local Authorities Loans Rules 1915 (Gen. R & O.).\n6\nCertain words Rep. by Devolution Act, 1920 (38 of 1920), s. 2, and Sch. I.\n7\nSubs. ibid., for the original clause.\n(viii)       the manner of recording and enforcing the conditions on which money is to be\nborrowed ;\n(ix)         the manner and time of making or raising loans ;\n(x)          the inspection of any works carried out by means of loans ;\n(xi)         the installments, if any, by which loans shall be repaid, the interest to be\ncharged on loans, and the manner and time of repaying loans and of paying the\ninterest thereon ;\n(xii)        the sum to be charged against the funds which are to form the security for the\nloan, as costs in effecting the loan ;\n(xiii) the attachment of such funds, and the manner of disposing of or collecting\nthem ;\n(xiv)        the accounts to be kept in respect of loans ;\n(xv)         the utilization of unexpended balances of loans either in the reduction in any\nway of the debt of the local authority, or in carrying out any works which that\nauthority is legally authorized to carry out ; and the sanction necessary to such\nutilization ;\nand as to all other matters incidental to carrying this Act into effect.\n1\n[*     *        *       *        *        *]\n(3) All rules made under this Act shall be published 2* * * in the 3[official Gazette], and on\nsuch publication, shall have effect as if enacted in this Act."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Remedy by attachment if loan not repaid. If any money borrowed in accordance with",
      "content": "to the conditions of the loan, the 4[appropriate Government], if itself the lender, may, and, if the\n4\n[appropriate Government] is not the lender, shall, on the application of the lender, attach the funds\non the security of which the loan was made. After such attachment, no person, except an officer\nappointed in his behalf by the 4[appropriate Government], shall in any way deal with the attached\nfunds; but such officer may do all acts in respect thereof which the borrowers might have done if\nsuch attachment had not taken place, and may apply the proceeds in satisfaction of the loan and of all\ninterests and costs due in respect thereof and of all expenses caused by the attachment and\nsubsequent proceedings:\n1\nSub-section (2) was rep. by the Devolution Act, 1920 (38 of 1920), s. 2 and Sch. I.\n2\nCertain words were rep., ibid.\n3\nSubs. by A. O., 1937, for “local official Gazette”.\n4\nSubs. by A. O., 1937, for “L. G.”.\nAttachment not to defeat prior charges legally made. Provided that no such attachment\nshall defeat or prejudice any debt for which the funds attached were previously pledged in\naccordance with law ; but all such prior charges shall be paid out of the proceeds of the funds before\nany part of the proceeds is applied to the satisfaction of the liability in respect of which such\nattachment is made."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Issue of short term bills",
      "content": "_(1) Subject to the provisions of section 1[17 of the State Bank\nof Pakistan Act, 1956 (XXXIII of 1956)], the local authorities mentioned in Schedule I and any other\nlocal authority to which the 2[appropriate Government] may, by notification in the 3[official Gazette],\nextend the provisions of this section, may, with the previous sanction of the 2[appropriate\nGovernment], borrow money by means of the issue of bills or promissory notes payable within any\nperiod, not exceeding twelve months, for any purpose for which such local authority may lawfully\nborrow money under any law for the time being in force:\nProvided that the amount of the bills or promissory notes which may be so issued, shall not\nexceed, when the amount of the other moneys for the time being borrowed by such local authority is\ntaken into account, the total amount which such local authority is empowered by law to borrow.\n(2) The 2[appropriate Government] may, by general or special order, regulate the conditions\non which money may be borrowed or repaid under this section."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Loans not to be effected. except under this Act. Except as provided by or under this Act,",
      "content": "no local authority shall, for any purpose, borrow money upon, or otherwise charge its funds ; and any\ncontract otherwise made for that purpose after the passing of this Act shall be void:\nProvided that nothing herein contained shall be deemed___\n(a)        to preclude any local authority from exercising the borrowing powers\nconferred on it by any special enactment now or hereafter in force ; or\n(b)        to affect the power conferred on any local authority by any such enactment to\ncharge its funds, by guaranteeing the payment of interest on money to be\napplied to any purpose to which the funds of the local authority can legally be\napplied."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. 4[Application of Act to loan existing previous to the fifth September, 1871.] Omitted by the",
      "content": "Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Second\nSchedule."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. [Repeals.] Rep. by the Repealing Act, 1927 (XII of 1927), s. 2 and Schedule",
      "content": "1\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and Sch., II. for “26 of the Indian Paper Currency Act,\n1910”, which has previously been amended by various enactments from time to time.\n2\nSubs. by A. O., 1937, for “G. G. in C. “.\n3\nSubs. ibid., for “Gazette of India”.\n4\nThis section was amended by A. O., 1937.\n(See section 6)\n1\n*    *       *       *        *       *       *       *       *\n2\n*    *       *       *        *       *       *       *       *\n3\n*    *       *       *        *       *       *       *       *\n4\n*    *       *       *        *       *       *       *       *\n5\n[The Karachi Municipal Corporation.]\nThe Trustees of the Port of Karachi.\n6\n*    *       *       *        *       *       *       *       *\nSCHEDULE II.___ [ENACTMENTS REPEALED.] Rep. by the Repealing Act, 1927 (XII of 1927),\ns. 2 and Schedule.\n___________\nDate: 11-09-2024\n1\nThe entries relating to the local authorities of Corporation and Port of Calcutta, omitted by A. O., 1949, Sch.\n2\nThe words “The [Trustees of] the Port of Chittagong”, omitted by F.A.O., 1975, Art. 2 and Sch., which was previously amended by Ord. 1 of 1961, s.\n3 and Sch., for “Commissioners for”.\n3\nThe entries relating to the local authorities of Corporations and Ports of Bombay and Madras, omitted by A. O., 1949, Sch.\n4\nThe entries relating to the Municipal Committee of Rangoon and the Commissioners for the Port of Rangoon, rep. by A. O., 1937.\n5\nSubs. by the Repealing and Amending Ordinance, 1965 (10 of 1965), s. 3 and 2nd Sch., for “the Municipal Committee of Karachi” as amended by\nOrdinance 1 of 1961, s. 3 and 2nd Sch.\n6\nThe entries relating to the Trustees for the Improvement of the cities of Bombay and Calcutta, omitted by A. O., 1949, Sch."
    }
  ],
  "definitions": []
}
