{
  "id": "pk-local-authorities-pensions-and-gratuities-act-1919",
  "type": "statute",
  "title": "Local Authorities Pensions and Gratuities Act, 1919",
  "title_en": "Local Authorities Pensions and Gratuities Act, 1919",
  "short_name": "LAPAG",
  "status": "in_force",
  "issued_date": "1919-02-25",
  "in_force_date": "1919-02-25",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apmX-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Local Authorities Pensions and Gratuities Act, 1919 (I of 1919) published by The Pakistan Code (Service Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent",
      "content": "_(1) This Act may be called the.\n2\n[(2) It extends to the whole of Pakistan.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definition. In this Act “officer” means any person who has undertaken 3[service of the State]",
      "content": "and who immediately prior to undertaking such service, was paid and employed solely by a local\nauthority and, but for undertaking such service, would in the ordinary course have continued in such\nemployment; 4[and the “ appropriate Government “ means, in relation to cantonment authorities and\nport authorities in major ports, the 5[Federal Government], and in relation to other authorities, the\nProvincial Government]."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Power to grant extraordinary pensions and gratuities: Notwithstanding anything",
      "content": "contained in any enactment or in any rule made thereunder regulating the powers of local authorities,\nand without prejudice to any powers conferred by or under any such enactment, a local authority may\ngrant a pension or gratuity to any officer thereof who may, since the 4th day of August, 1914, have\nbeen wounded or otherwise incapacitated in 6[service of the State], and to the widow or child of any\nsuch officer who may have died in consequence of injuries received or illness contracted since the 4th\nday of August, 1914, in the course of such service."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Provision as to pensions and gratuities",
      "content": "_(1) Such pension or gratuity may be granted in\naddition to any pension or gratuity payable to the officer or his wife or child, as the case may be, under\nany general or special orders of 7* * * 8[the 5[Federal Government] or any Provincial Government],\nbut shall not, save with the sanction of the 9[appropriate Government], exceed the amount of the\npension or gratuity to which the officer or his wife or child would have been entitled under any such\norders if his employment by the local authority had been service for the same time and on the same\npay 10[ of the State].\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1919, Pt. V, p. 18 ; and for Proceedings in Council, see ibid., 1919, Pt. VI, pp. 144, 145 and\n197.\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for the original\nsub-section (2) as amended by A. O., 1949, Arts. 3 (2) and 4.\n3\nThe original words the service of Government” were first subs. by A. O., 1937 and then amended by A. O., 1961, Art. 2 and Sch. (with effect from the\n23rd March, 1956), to read as above.\n4\nIns. by A. O., 1937\n5\nSubs. by F.A.O., 1975, Art. 2 and Table for “Central Government”\n6\nThe original words “the service of Government” were first subs. by A. O., 1937 and then amended by A. O., 1961, Art. 2 and Sch. (with effect from the\n23rd March, 1956), to read as above.\n7\nThe original words “His Majesty in Council or of” omitted by A. O., 1961, Art. 2 and Sch. (with effect from the 23rd March, 1956).\n8\nSubs. by A. O., 1937, for “the G G. in C. “.\n9\nSubs. ibid., for “L. G.” which had been subs. by the Devolution Act, 1920 (33 of 1920), s. 2 and Sch. I, for “G G. in C “\n10\nSubs. by A. O , 1961, Art. 2 and Sch. (with effect from the 23rd March, 1956), for “under the Crown” which had been Subs by A. O., 1937, for “under\nGovernment”.\n(2) Any pension granted under this Act may be made to take effect from such date subsequent\nto the 4th day of August, 1914, and subject to such conditions as the local authority may think fit."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Procedure. Subject to the provisions of this Act, the decision of a local authority to grant a",
      "content": "pension or gratuity thereunder shall be made in such manner and shall be subject to such sanction as\nmay be prescribed by any enactment or rule regulating the grant by such local authority of pensions\nand gratuities:\nProvided that in every case the sanction of the 1[appropriate Government] shall be necessary.\n___________\nDate: 11-09-2024\n1\nSubs. by A. O., 1937, for “L. G.”.\n2\nFor Statement of Objects and Reasons, see Gazette of India, 1919 Pt. V, p. 22 ; and for Proceedings in Council, see ibid., 1919, Pt. VI, pp. 170 and 872.\nThis Act has been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.-W.F.P., subject to certain\nmodifications ; and extended to the Excluded Area of Upper Tanawal (N: W.F.P.) other than Phulera with effect from such date and subject to such\nmodifications as may be notified, see N: W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950.\nIt has also been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950) ; and applied in the Federated\nAreas of Baluchistan, see Gazette of India, 1937, Pt. 1, p. 1499."
    }
  ],
  "definitions": []
}
