{
  "id": "pk-malaria-eradication-board-repeal-act-1975",
  "type": "statute",
  "title": "Malaria Eradication Board (Repeal) Act, 1975",
  "title_en": "Malaria Eradication Board (Repeal) Act, 1975",
  "short_name": "MEBA",
  "status": "repealed",
  "issued_date": "1975-07-23",
  "in_force_date": "1975-07-23",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2Zv-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Malaria Eradication Board (Repeal) Act, 1975 (LXIV of 1975) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "_ (1) This Act may be called the Malaria\nEradication Board (Repeal) Act, 1975.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Repeal, etc",
      "content": "_ (1) The Malaria Eradication Board Ordinance, 1961 (XVIII of 1961),\nhereinafter referred to as the Ordinance, is hereby repealed.\n(2) Upon the repeal of the Ordinance,—\n(a)        notwithstanding anything contained in any contract or agreement or in the\nconditions of service, the officers and other employees of the Malaria\nEradication Board, hereinafter referred to as the Board, shall stand transferred\nto the Federal Government on such terms and conditions as may be laid down\nby the Federal Government ;\n(b)        all rights, properties, assets, debts, liabilities and obligations of the Board shall\nbe the rights, properties, assets, debts, liabilities and obligations of the Federal\nGovernment;\n(c)        any contract made by the Board before such repeal shall be deemed to have\nbeen made by the Federal Government ; and\n(d)        all suits and other legal proceedings instituted by or against the Board before\nsuch repeal shall be deemed to be suits and proceedings instituted by or\nagainst the Federal Government and may be proceeded or otherwise dealt with\naccordingly.\n(3) The Federal Government may, for the purpose of removing any difficulty in relation to\nthe transfer and other matters referred to in sub-section (2), make such order as it considers expedient\nand any such order shall be deemed to be, and given effect to, as part of the provisions of this Act.\n__________\nUploaded on 11.12.2023\n1\nFor Statement of Objects and Reasons, see Gaz. of P., 1975, Ext., Pt. III, p.540."
    }
  ],
  "definitions": []
}
