{
  "id": "pk-marketing-of-petroleum-products-federal-control-repeal-ordinance-2002",
  "type": "statute",
  "title": "Marketing Of Petroleum Products (Federal Control) (Repeal) Ordinance, 2002",
  "title_en": "Marketing Of Petroleum Products (Federal Control) (Repeal) Ordinance, 2002",
  "short_name": "MOPPC",
  "status": "repealed",
  "issued_date": "2002-11-30",
  "in_force_date": "2002-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FtbZc%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Marketing Of Petroleum Products (Federal Control) (Repeal) Ordinance, 2002 (LXXXIX of 2002) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Savings",
      "content": "MARKETING OF PETROLEUM PRODUCTS (FEDERAL CONTROL)\n(REPEAL) ORDINANCE, 2002\nORDINANCE LXXXIX OF 2002\n[26th October, 2002]\nAn Ordinance to repeal the Marketing of Petroleum Products\n(Federal Control) Act, 1974\nWHEREAS it is expedient to repeal the Marketing of Petroleum Products (Federal Control)\nAct, 1974 (XVII of 1974), and to provide for matters connected therewith or incidental thereto:\nAND WHEREAS development of the oil marketing sector under Federal Government\ncontrol is no longer viewed as necessary in the public interest and circumstances render it more\nfavourable for development to be undertaken by the private sector;\nAND WHEREAS Pakistan State Oil Company Limited is the only oil marketing company in\nrespect of which an Order has been issued under the aforesaid Act and to which that Act currently\napplies;\nAND WHEREAS the Federal Government is in the process of deregulating the downstream\noil sector and in encouraging private investment in this sector as well as privatising certain of its own\ninterests in the downstream oil sector including by way of divestment of its shares in Pakistan State\nOil Company Limited.\nAND WHEREAS the President is satisfied that circumstances exist which render it\nnecessary to take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the Fourteenth day of\nOctober, 1999, and the Provisional Constitution Order No. 1 of 1999, read with the Provisional\nConstitution (Amendment) Order No.9 of 1999, and in exercise of all powers enabling him in that\nbehalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the\nfollowing Ordinance:"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Ordinance may be called the Marketing\nof Petroleum Products (Federal Control) (Repeal) Ordinance, 2002.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once except sections 3 to 7 which shall come into force upon the\noccurrence of the effective date."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Ordinance, unless there is anything repugnant in the subject or\ncontext,—\n(a)     “Act” means the Marketing of Petroleum Products (Federal Control) Act, 1974\n(XVII of 1974);\n(b)     “Board” means the Board of Management or the Board of Directors, as the case\nmay be:\n(c)     “Board of Directors” means the Board of PSO reconstituted as a board of\ndirectors pursuant to section 4 of this Ordinance;\n(d)     “Board of Management” means a Board of Management set up under section 7\nof the Act;\n(e)     “chief executive” has the same meaning as in the Companies Ordinance;\n(f)     “Companies Ordinance” means the Companies Ordinance, 1984 (XLVII of\n1984);\n(g)     “Director” has the same meaning as in the Companies Ordinance;\n(h)     “effective date” means the date as may be appointed by the Federal Government\nin the Official Gazette for the purposes of sub-section (2) of section 3;\n(i)     “marketing company” has the same meaning as in the Act;\n(j)     “Order” means the order issued pursuant to section 5 of the Act for the take over\nof the management of PSO contained in statutory notification S. R. O. No. 100\n(I)/77 dated 31st January 1977;\n(k)     “PSO” means the Pakistan State Oil Company Limited;\n(l)     “Managing Director” means the person appointed to act as managing director\nof PSO by the Federal Government pursuant to the Act;\n(m)     ‘Monopolies Ordinance’ means the Monopolies and Restrictive Trade Practices\n(Control and Prevention) Ordinance, 1970 (VI of 1970); and\n(n)     “Privatisation” has the same meaning as in the Privatisation Commission\nOrdinance, 2000 (LII of 2000)"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Repeal and rescission",
      "content": "_(1) The Act shall stand repealed on the occurrence of the effective\ndate and the Order shall stand rescinded concurrently therewith.\n(2) For the purposes of this Ordinance, the effective date shall be the date of transfer of all the\nshares in PSO as are owned by the Federal Government to one or more private sector investors\npursuant to a “privatisation” effected under and pursuant to the Privatisation Commission Ordinance,\n2000 (XLII of 2000) and any rules made\nExplanation.___For the purposes of this section the expression “transfer” means the registration\nof the transfer of the shares as contemplated above in the register of members of the PSO."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Consequences of repeal on PSO",
      "content": "_ Immediately upon the repeal of the Act on the effective\ndate and notwithstanding anything contained in any other law for the time being in force___\n(a)     the Board of Management of PSO shall be immediately and automatically\nreconstituted as a Board of Directors with the same number of directors\n(including the chief executive) who shall all be deemed to have been elected as\ndirectors of PSO under and pursuant to the terms of section 178 of the\nCompanies Ordinance and PSO's own Articles of Association and to have\nfulfilled all requisite procedural and notification requirements:\nProvided that the term of office of such reconstituted Board shall be only until an election of\ndirectors is held as provided in section 6:\nProvided further that there shall be no need for the directors on the reconstituted Board of\nDirectors to file consents under section 184 of the Companies Ordinance to act as directors of PSO\nuntil fifteen days after the Board has been reconstituted or their appointment takes effect:\nProvided also that in case of any conflict between the Articles of Association of PSO and this\nOrdinance, the provisions of this Ordinance shall prevail.\n(b)     PSO shall cease to be a “managed company” under the Act and all powers of\nmanage PSO or to appoint any Managing Director or other chief executive\nofficer for PSO. The Managing Director and other members of any Board of\nManagement (including the Chairman of the Board of Management) shall\nnevertheless continue in office as directors of the Board of Directors (and as\nChairman and chief executive of the Board of Directors) until and unless their\nrespective terms of office expire or they (or any of them) earlier resign or\nbecome disqualified from being a director under the Companies Ordinance\nor otherwise cease to hold office;\n(c)      neither the business of PSO as carried on at the effective date nor any situation\nexisting or prevailing in regard to PSO at the effective date shall be\ntreated as constituting unreasonable monopoly power under the Monopolies\nOrdinance and no relationship, acquisition or merger or action taken\nimmediately and directly consequent to the transfer (as defined in section\nof shares in PSO and PSO ceasing to be subject to the Order or the control of\nabout, maintaining or continuing unreasonable monopoly power as described\nin section 5 of the Monopolies Ordinance or as authorising the Monopoly\nControl Authority constituted under the Monopolies Ordinance as having power\nto take any action against PSO or any investor acquiring shares in PSO on the\nbasis that the business of PSO as carried on at the effective date or situation\nexisting or prevailing at the effective date or any relationship, acquisition or\nmerger having the effect of creating, bringing about or maintaining any\nunreasonable monopoly power."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Application of Companies Ordinance",
      "content": "_(1) As and from the effective date PSO and the\nmanagement of PSO shall be governed under the Companies Ordinance and its own memorandum and\narticles of association without reference to the Act or the Order\n(2) Upon reconstitution of the Board of Management as a Board of Directors, the provisions\nof the Companies Ordinance shall apply to the directors of the reconstituted Board except\nthat notwithstanding the provisions of section 180 of the Companies Ordinance the term of office of\nthe directors of the Board of Directors shall be until an election of directors is held as provided in\nsection 6. As and from the first election of directors of PSO pursuant to section 6, the term of the\ndirectors shall be as stipulated in the Companies Ordinance read with PSO's own Memorandum and\nArticles of Association.\n(3) Nothing in this Ordinance shall limit the ability of the chief executive or any director on the\nBoard of Directors from resigning at any time after the effective date. For avoidance of doubt, any\nvacancy in the office of chief executive and any casual vacancy occurring among the directors may be\nfilled by the remaining directors and the person so appointed shall hold office for the remainder of the\nterm of the person in whose place he has been appointed."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Holding of elections",
      "content": "_An election of directors shall be held by PSO within such period not\nexceeding twelve months as may be practicable after the effective date:\nProvided that in exceptional circumstances the. Federal Government may extend the time\nwithin which elections are to be held by such period not exceeding twelve months as the\nfederal Government thinks appropriate in the circumstances."
    }
  ],
  "definitions": [
    {
      "term": "Act",
      "definition": "the Marketing of Petroleum Products (Federal Control) Act, 1974 (XVII of 1974);",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of Management or the Board of Directors, as the case may be:",
      "source_provision": "sec2"
    },
    {
      "term": "Board of Directors",
      "definition": "the Board of PSO reconstituted as a board of directors pursuant to section 4 of this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "Board of Management",
      "definition": "a Board of Management set up under section 7 of the Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Companies Ordinance",
      "definition": "the Companies Ordinance, 1984 (XLVII of 1984);",
      "source_provision": "sec2"
    },
    {
      "term": "effective date",
      "definition": "the date as may be appointed by the Federal Government in the Official Gazette for the purposes of sub-section (2) of section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Order",
      "definition": "the order issued pursuant to section 5 of the Act for the take over of the management of PSO contained in statutory notification S. R. O. No. 100 (I)/77 dated 31st January 1977;",
      "source_provision": "sec2"
    },
    {
      "term": "PSO",
      "definition": "the Pakistan State Oil Company Limited;",
      "source_provision": "sec2"
    },
    {
      "term": "Managing Director",
      "definition": "the person appointed to act as managing director of PSO by the Federal Government pursuant to the Act; (m) ‘Monopolies Ordinance’ means the Monopolies and Restrictive Trade Practices (Control and Prevention) Ordinance, 1970 (VI of 1970); and",
      "source_provision": "sec2"
    }
  ]
}
