{
  "id": "pk-marriage-functions-prohibition-of-ostentatious-displays-and-wasteful-expenses-or",
  "type": "statute",
  "title": "Marriage Functions (Prohibition of Ostentatious Displays and Wasteful Expenses) Ordinance, 2000",
  "title_en": "Marriage Functions (Prohibition of Ostentatious Displays and Wasteful Expenses) Ordinance, 2000",
  "short_name": "MFOOD",
  "status": "in_force",
  "issued_date": "2000-01-12",
  "in_force_date": "2000-01-12",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaXZQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Marriage Functions (Prohibition of Ostentatious Displays and Wasteful Expenses) Ordinance, 2000 (II of 2000) published by The Pakistan Code (Family Laws).",
  "provisions": [
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Cognizance of offences",
      "content": "THE MARRIAGE FUNCTIONS (PROHIBITION OF OSTENTATIOUS\nDISPLAYS AND WASTEFUL EXPENSES) ORDINANCE 2000\nOrdinance No. II of 2000\n[13th January 2000]\nAN ORDINANCE whereas it is expedient to provide for the prohibition of ostentatious\ndisplays and wasteful expenses on marriages and ceremonies related thereto;\nAND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the\nProclamation of Emergency of the fourteenth day of October, 1999 and the President is satisfied that\ncircumstances exist which render it necessary to take immediate action;\nNOW, THEREFORE, in exercise of the powers conferred by the Provisional Constitution\nOrder No. 1 of 1999 as amended including the Provisional Constitution (Amendment) Order No. 9 of\n1999, the President, on the advice of the Chief Executive, is pleased to make and promulgate the\nfollowing Ordinance:"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Ordinance may be called the Marriage\nFunctions (Prohibition of Ostentatious Displays and Wasteful Expenses) Ordinance, 2000.\n(2)   It extends to the whole of Pakistan.\n(3)   It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Interpretation",
      "content": "For the purposes of this Ordinance the expression “marriage” shall\ninclude all ceremonies, preceding and succeeding the formal wedding whether religious or civil\nrituals such as nikah, rukhsati, walima, mehndi, rasme-hina, and other functions and celebrations\nconnected with marriage and related festivities.\n3 Prohibition of ostentatious celebrations.—(1) Subject to sub-section (2) no person\ncelebrating his marriage or the marriage of any other person shall\n(a)   decorate or cause to be decorated any house or building including any space\nappertaining thereto, street, road or other place whether owned by him or\notherwise with lights or illumination;\n(b)   explode or allow any one to explode cracker or other explosive device including\nfiring by firearm; or\n(c) display or allow any one to display fire-works.\n(2) Nothing contained in sub-section (1) shall prohibit the use of such lights as are ordinarily\nnecessary to light the house or any other place being the site of marriage."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Restriction on wasteful expenses",
      "content": "_(1) No person celebrating his or the marriage of any\nother person shall serve or allow any one to serve meals or other edibles to persons participating in\nthe marriage in a club, hotel, restaurant, wedding hall, community centre or any other place except\n1\n[one dish, which means one salan, rice with roti and one sweet dish with] hot and cold soft drinks.\n(2) Nothing contained in sub-section (1) shall apply to the eating of meals within the house\nby the members of family celebrating the marriage or the house guests."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Application of the Ordinance to hotels, restaurants, etc. No person owning or running a",
      "content": "hotel, restaurant, wedding hall, community centre, or club being the site of a marriage ceremony or\nany caterer shall serve or allow any one to serve any meals or edibles to the persons participating in\nthe marriage ceremony other than hot and cold soft drinks."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Offences. Whoever contravenes the provisions of section 3, section 4 or section 5 shall be",
      "content": "guilty of an offence punishable with simple imprisonment for a term which may extend to one\nmonth or with fine which shall be not less than one hundred thousand rupees and not more than five\nhundred thousand rupees or with both."
    }
  ],
  "definitions": []
}
