{
  "id": "pk-married-women-s-property-act-1874",
  "type": "statute",
  "title": "Married Women's Property Act, 1874",
  "title_en": "Married Women's Property Act, 1874",
  "short_name": "MWPA",
  "status": "in_force",
  "issued_date": "1874-02-23",
  "in_force_date": "1874-02-23",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bJg%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Married Women's Property Act, 1874 (III of 1874) published by The Pakistan Code (Family Laws).",
  "provisions": [
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Extent and application. 3[It extends to the whole of Pakistan.]",
      "content": "But nothing herein contained applies to any married woman who at the time of her marriage\nprofessed the Hindu, 4[Muslim], Buddhist, Sikh or Jaina religion, or whose husband, at the time of\nsuch marriage, professed any of those religions.\nAnd the 5[Provincial Government] may from time to time, by order, either retrospectively\nfrom the passing of this Act or prospectively, exempt from the operation of all or any of the\nprovisions of this Act the members of any race, sect or tribe, or part of race, sect or tribe, to whom\n6\n[it] may consider it impossible or inexpedient to apply such provisions.\n1\nFor the Statement of Objects and Reasons, see Gazette of India, 1873 Pt. V, p. 457; for Proceedings in Council, see ibid., Extra Supplements, dated\n2nd August and 6th September, 1873, respectively pp. 9 and 12, and ibid., 1874, Supplement, p. 239.\n2\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2nd Sch., for “the Indian Succession Act,\n1865”.\n3\nThis para, has successively been amended by A. O., 1937, A.O.,1949, Arts. 3(2) and 4, the Federal Laws (Revision and Declaration) Act, 1951 (26 of\n1951), s. 4 and III Sch., and the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October,\n1955), to read as above.\n4\nSubs. by F. A. O., 1975, Art, 2 and Table, for “Muhammadan”.\n5\nSubs. by A. O., 1937 for “L. G.” which had been subs. by the Devolution Act, 1920 (38 of 1920), s. 2 and Sch. I, for “G.G. in C.”.\n6\nSubs. by A.O., 1937, for “he”.\nThe 1[Provincial Government] may also revoke any such order, but not so that the revocation\nshall have any retrospective effect.\nAll orders and revocations under this section shall be published in the 2[official Gazette].\n3\n*      *          *          *          *          *          *"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. [Commencement.] Rep. by the Repealing Act, 1876 (XII of 1876)",
      "content": "II. ___MARRIED WOMEN’S WAGES AND EARNINGS"
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Married women’s earnings to be their separate property. The wages and earnings of",
      "content": "any married woman acquired or gained by her after the passing of this Act, in any employment,\noccupation or trade carried on by her and not by her husband, and also any money or other property\nso acquired by her through the exercise of any literary, artistic or scientific skill, and all savings from\nand investments of such wages, earnings and property, shall be deemed to be her separate property,\nand her receipts alone shall be good discharges for such wages, earnings and property.\nIII.___INSURANCE BY WIVES AND HUSBANDS"
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Married woman may effect policy of insurance. Any married woman may effect a",
      "content": "policy of insurance on her own behalf and independently of her husband; and the same and all\nbenefit thereof, if expressed on the face of it to be so effected shall ensure as her separate property,\nand the contract evidenced by such policy shall be as valid as if made with an unmarried woman."
    },
    {
      "provision_ref": "sec66",
      "section": "66",
      "title": "Section 66. Insurance by husband for benefit of wife. 7[(1) A policy of insurance effected by any",
      "content": "married man on his own life, and expressed on the face of it to be for the benefit of his wife, or of his\nwife and children, or any of them, shall ensure and be deemed to be a trust for the benefit of his wife,\nor of his wife and children, or any of them, according to the interest so expressed, and shall not, so\nlong as any object of the trust remains, be subject to the control of the husband, or to his creditors, or\nform part of his estate.\nWhen the sum secured by the policy becomes payable, it shall, unless special trustees are\nduly appointed to receive and hold the same, be paid to the Official Trustee of the 8[Province] in\nwhich the office at which the insurance was effected is situate, and shall be received and held by him\nupon the trusts expressed in the policy, or such of them as are then existing.\nAnd in reference to such sum he shall stand in the same position in all respects as if he had\nbeen duly appointed trustee thereof by a High Court, under 9[The Official Trustees Act, 1913 (II of\n1913)].\n1\nSubs. by A. O., 1937 for “L. G.” which had been subs. by the Devolution Act, 1920 (38 of 1920), s. 2 and Sch. I, for “G.G. in C.”.\n2\nSubs. ibid, for “local official Gazette” which had been subs. by Act 38 of 1920, s. 2 and Sch. I, for the words “Gazette of India”.\n3\n4\nCf. the Married Women’s Property Act, 1870 (33 and 34 Vict., c. 93) s.1, now repealed by the Married Women’s Property Act, 1882 (45 and 46, Vict.,\nc. 75).\n5\nCf. the Married Women’s Property Act, 1870 (33 and 34 Vict., c. 93), s. 10, para 1.\n6\nCf. ibid., para 2.\n7\nRe-numbered by the Married Women’s Property (Amdt.) Act, 1923 (13of 1923), s. 2.\n8\nSubs. by A. O., 1937. for “Presidency”.\n9\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981). s. 3 and IInd Sch., for “Act No. XVII of 1864 to constitute an\nOffice of Official Trustee, section 10”.\nNothing herein contained shall operate to destroy or impede the right of any creditor to be\npaid out of the proceeds of any policy of assurance which may have been effected with intent to\ndefraud creditors.\n1\n[(2) Notwithstanding anything contained in section 2, the provisions of sub-section (1) shall\napply in the case of any policy of insurance such as is referred to therein which is effected by any\nHindu, 2[Muslim], Sikh or Jain, 3[in any Province] after the first day of April, 1923:\nProvided that nothing herein contained shall affect any right or liability which has accrued or\nbeen incurred under any decree of a competent Court passed before the first day of April, 1923.]\nIV.___LEGAL PROCEEDINGS BY AND AGAINST MARRIED WOMEN"
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Married woman may take legal proceedings. A married woman may maintain a suit in",
      "content": "her own name for the recovery of property of any description which by force of the said 5[Succession\nAct, 1925 (XXXIX of 1925)] or of this Act, is her separate property; and she shall have, in her own\nname, the same remedies, both civil and criminal, against all persons, for the protection and security\nof such property, as if she were unmarried, and she shall be liable to such suits, processes and orders\nin respect of such property as she would be liable to if she were unmarried."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Wife’s liability for postnuptial debts. If a married woman (whether married before or",
      "content": "after the first day of January, 1866) possesses separate property, and if any person enters into a\ncontract with her with reference to such property, or on the faith that her obligation arising out of\nsuch contract will be satisfied out of her separate property, such person shall be entitled to sue her,\nand, to the extent of her separate property, to recover against her whatever he might have recovered\nin such suit had she been unmarried at the date of the contract and continued unmarried at the\nexecution of the decree:\n6\n[Provided that nothing herein contained shall__\n(a)        entitle such person to recover anything by attachment and sale or otherwise\nout of any property which has been transferred to a woman or for her benefit\non condition that she shall have no power during her marriage to transfer or\ncharge the same or her beneficial interest therein, or\n(b)        affect the liability of a husband for debts contracted by his wife’s agency\nexpressed or implied.]\nV.___HUSBAND’S LIABILITY FOR WIFE’S DEBTS"
    },
    {
      "provision_ref": "sec79",
      "section": "79",
      "title": "Section 79. Husband not liable for wife’s antenuptial debts. A husband married after the thirty",
      "content": "first\nday of December, 1865, shall not by reason only of such marriage be liable to the debts of his wife\ncontracted before marriage, but the wife shall be liable to be sued for, and shall, to the extent of her\nseparate property, be liable to satisfy such debts as if she had continued unmarried:\n1\nSub-section (2) ins. by Act, 13 of 1923, s.2.\n2\nSubs. by F. A. O., 1975. Art. 2 and Table, for “Muhammadan”,\n3\nSubs. by A. O., 1949. Sch., for “in Madras after the thirty-first day of December, 1913, or in any other part of British India”.\n4\nCf. the Married Women’s Property Act, 1870 (33 and 34 Vict., c. 93), s. 11, rep. by the Married Women’s Property Act, 1882 (45 and 46 Vict., c. 75).\n5\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and IInd Sch., for “Indian Succession Act, 1865”.\n6\nSubs. by the Transfer of Property (Amdt.) Supplementary Act, 1929 (21 of 1929), s. 2, for the original proviso as amended by the Debtors Act, 1888 (6\nof 1888), s. 9.\n7\nCf. the Married Women’s Property Act, 1870 (33 and 34 Vict., c. 93), s.12.\nProviso. Provided that nothing contained in this section shall 1* * * invalidate any contract\ninto which a husband may, before the passing of this Act, have entered in consideration of his wife’s\nantenuptial debts.\nVI. ___2HUSBAND’S LIABILTY FOR WIFE’S BREACH OF TRUST OR DEVASTATION"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Extent of husband's liability for wife's breach of trust or devastation. Where a",
      "content": "woman is a trustee, executrix or administratrix’ either before or after marriage, her husband shall not,\nunless he acts or intermeddles in the trust or administration, be liable for any breach of trust\ncommitted by her, or for any misapplication, loss or damage to the estate of the deceased caused or\nmade by her, or for any loss to such estate arising from her neglect to get in any part of the property\nof the deceased.]\n_______________\nDate: 16-09-2024\n1\nThe words “affect any suit instituted before the passing of this Act, nor” rep. by the Amending Act, 1891 (12 of 1891).\n2\nThis heading and s. 10 ins. by the Indian Succession (Amendment) Act, 1927 (18 of 1927), s. 3."
    }
  ],
  "definitions": []
}
