{
  "id": "pk-measures-of-length-act-1889",
  "type": "statute",
  "title": "Measures of Length Act, 1889",
  "title_en": "Measures of Length Act, 1889",
  "short_name": "MOLA",
  "status": "in_force",
  "issued_date": "1889-02-14",
  "in_force_date": "1889-02-14",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-b50%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Measures of Length Act, 1889 (II of 1889) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Title, extent and commencement",
      "content": "(1) This Act may be called the Measures of\nLength Act, 1889.\n3\n[(2) It extends to the whole of Pakistan]; and\n4                 5\n(3) It shall come into force on such day as the [Federal Government] may appoint in this\nbehalf."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Standard yard. The imperial standard yard for the United Kingdom shall be the legal",
      "content": "standard measure of length in 2[Pakistan] and be called the standard yard."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Measure for determining length of standard yard. A copy, approved by the",
      "content": "6\n[Provincial Government], of the imperial standard for determining the length of the imperial\nstandard yard for the United Kingdom shall be kept in such place within the limits of the7[Province]\nas the 6[Provincial Government] may prescribe, and shall be the standard for determining the length\nof the standard yard:\n8\n[*     *           *          *           *          *          *]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Standard foot and inch. One",
      "content": "third part of the standard yard shall be called a\nstandard foot, and one-thirty-sixth part of such a yard shall be called a standard inch.\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1888, Pt. V, p. 41; for Report of the Select Committee, see ibid., 1 889, Pt. IV,\np. 6: and for Proceedings in Council, see ibid., 1888, Pt. Vl, pp. 66 and 82, and ibid., 1889, Pt. VI, p. 20.\nThis Act has been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the- N.W.F.P., subject to\ncertain modifications and also extended to the excluded Area of Upper Tanawal (N.W.F.P.) other than Phulera with effect from such date\nand subject to such modifications as may be notified, see N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950.\nIt shall be deemed to have been repealed in the N.W.F.P. when part V of the N.W.F.P. Act 23 of 1947 comes into force in that Province, see\ns. 42 of the N.W.F.P. Weights and Measures Act, 1947 (23 of 1947), and shall also be deemed to have been repealed in any area in the\nPunjab when Part VI of Punjab Act 12 of 1941 comes into force in that Area.\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955) for\n“the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, Arts. 3(2) and 4, for “British India”.\n3\nSub-section (2) as amended by A. O., 1949, Arts. 3(2) 4, has been subs. by Ord. 21 of 1960, s. 3 and 2nd Sch. (with effect from the 14th\nOctober, 1955).\n4\nThe Act was brought into force on the 15th June, 1889, see Gazette of India, 1889, Pt. I, p. 305.\n5\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”, which had been subs, A.O., 1937. for “G. G. in C”,\n6\nSubs. by A. O., 1937, for “G.G. in C.”.\n7\nSubs. ibid., for “Town of Calcutta”.\n8\nProviso which was ins. by A. O., 1937, omitted by Ord. 21 of 1960, s. 3 and 2nd Sch. (with effect from the 14th October, 1955)."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Presumption in favour of accuracy of certified measures. Any measure having stamped",
      "content": "thereon or affixed thereto a certificate purporting to be made 1[before the first day of April, 1937,\nunder the authority of any Government in 2[Pakistan] or on or after that date under the authority of\nthe Provincial Government] and stating that the measure is of the length of the standard yard or that a\nmeasure marked thereon as a foot or inch is of the length of the standard foot or standard inch, as the\ncase may be, shall, when produced before any Court by any public servant having charge of the\nmeasure in pursuance of any direction published in an official Gazette 3[by order of the Provincial\nGovernment], or by any person acting under the general or special authority of such a public servant,\nbe deemed to be correct until its inaccuracy is proved."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Inspection of certified measures by the public. A public servant having in pursuance of",
      "content": "such a direction charge of such a measure as is mentioned in the last foregoing section shall allow\nany person to inspect it free of charge at all reasonable times and to compare therewith or with any\nmeasure marked thereon any measure which such person may have in his possession."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Certified measures to be kept by authorities required by existing enactments to keep",
      "content": "measures of length. There shall be kept 4[* * *] by the District Magistrate under section 20 of\nRegulation XII of 1827 of the Bombay Code, such certified measures of the standard yard, standard\nfoot and standard inch as are mentioned in section 5.\n_________\nDate: 05-09-2024\n1\nSubs. by A. O., 1937, for “under the authority of the G. G. in C. or of a L. G.”.\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October. 1955),\nfor “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, Arts. 3 (2) and 4, for “British India”.\n3\nSubs. by A. O., 1937, for “by order of the G. G. in C. or the L. G.”.\n4\nThe words and figures “by the Commissioner of Police in the Town of Calcutta under section 55, of the Calcutta Police Act, 1866, * * *\nby the Commissioner of Police in the City of Madras under section 32 of the Madras City Police Act, 1888, by the Municipal\nCommissioner in the City of Bombay under section 418 of the City of Bombay Municipal Act, 1888, and” omitted by A. O., 1949, Sch.\nThe asterisks in this footnote indicate the omission of the words and figures “by the Commissioners in Calcutta under section 370 of the\nCalcutta Municipal Consolidation Act, 1888 which were rep. by Act 24 of 1934, s. 2 and Sch."
    }
  ],
  "definitions": []
}
