{
  "id": "pk-medical-tribunal-act-2020",
  "type": "statute",
  "title": "Medical Tribunal Act, 2020.",
  "title_en": "Medical Tribunal Act, 2020.",
  "short_name": "MTA",
  "status": "in_force",
  "issued_date": "2020-09-23",
  "in_force_date": "2020-09-23",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NpaZs%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Medical Tribunal Act, 2020. (XXXIV of 2020) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Act shall be called the Medical Tribunal Act,"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(a)   “Bench” means bench as constituted by the Chairman of the Medical Tribunal;\n(b)   “Chairman” means Chairman of the Medical Tribunal;\n(c)   “members” means members of the Medical Tribunal;\n(d)   “prescribed” means prescribed rules or regulations made under this Act, as the\ncase may be;\n(e)   “Registrar” means the registrar of the Medical Tribunal and includes any other\nperson authorized by the Tribunal to perform the functions of the Registrar under\nthis Act;\n(f)   “regulations” means regulations made under this Act;\n(g)   “rules” means rules made under this Act; and\n(h)   “Tribunal” means Medical Tribunal established under this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Cognizance of offences",
      "content": "(1) No court shall take cognizance in any matter to which\njurisdiction of the Tribunal extends.\n(2) Any person or entity aggrieved by an act which is an offence under any law for the time\nbeing in force triable by the Tribunal or by an order or act which is appealable before the Tribunal\nmay institute a complaint or claim or appeal as the case may be before the Tribunal.\n(3) The Tribunal may also initiate appropriate proceeding on dependable information against\nany individual or institution after issuing notice against an act or omission which falls within the\njurisdiction of the Tribunal."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Medical Tribunal",
      "content": "(1) The Prime Minister of Pakistan shall, by notification in the official\nGazette, establish the Tribunal which shall exercise jurisdiction under this Act.\n(2) The Tribunal shall consist of a Chairman who has been a judge of a High Court to be\nappointed by the Prime Minister of Pakistan upon nomination by the Chief Justice of Pakistan.\n(3) In addition to the Chairman, the Tribunal shall consist of at least four members and the\nFederal Government may increase the number of members as required.\n(4) The members of the Tribunal shall be appointed by the Prime Minister of Pakistan in\nconsultation with the Chairman of the Tribunal, of which half shall be jurists who have been judges\nof High Court and half shall be technical members with suitable professional qualifications and\nexperience, in the medical fields.\n(5) The powers and functions of the Tribunal may be exercised or performed by Benches as\nconstituted by the Chairman of the Tribunal.\n(6) The principal seat of the Tribunal shall be at Islamabad. The Benches of the Tribunal may\nfunction at any of the provincial headquarters as per schedule directed by the Chairman.\n(7) If the members of the Bench differ in opinion as to the decision to be given on any point,\nthe case shall be referred to the Chairman and the decision of the Tribunal shall be expressed in terms\nof the opinion of the Chairman.\n(8) The Tribunal shall not, merely because of a change in its composition, or the absence of\nany member from any sitting, be bound to recall and rehear any witness who has given evidence, and\nmay act on the evidence already recorded by, or produced, before it.\n(9) The Tribunal may hold its sittings at such places within its territorial jurisdiction as the\nChairman may decide.\n(10) No act or proceeding of the Tribunal shall be invalid by reason only of the existence of a\nvacancy in, or defect in the constitution, of the Tribunal.\n(11) The terms and conditions of service of the Chairman and members of the Tribunal shall\nbe such as may be prescribed by rules."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Tenure of office",
      "content": "The Chairman and members of the Tribunal shall hold office for a period\nof three years which may be extended by the Federal Government for another term subject to consent\nof the Chief Justice of Pakistan to the extended term of the Chairman and the consent of the Chairman\nto the extended term of a member."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Jurisdiction and powers of Medical Tribunal",
      "content": "(1) All offences provided for under the\nPakistan Nursing Council Act, 1973 (XXVI of 1973), Pakistan Health Research Council Act, 2016\n(XII of 2016), the Unani, Ayurvedic and Homeopathic Practitioners Act, 1965 (II of 1965), the\nPharmacy Act, 1967 (XI of 1967), the Pakistan Medical and Dental Ordinance, 1962 (XXXII of 1962),\nby the Federal Government, shall be triable by the Tribunal.\n(2) All appeals against decisions, orders and acts of the relevant apex authorities or councils\nformed pursuant to the Pakistan Medical and Dental Ordinance, 1962 (XXXII of 1962), Pakistan\nMedical Commission Ordinance, 2019 (II of 2019), the Pakistan Nursing Council Act, 1973 (XXVI\nof 1973), Pakistan Health Research Council Act, 2016 (XII of 2016) and the Unani, Ayurvedic and\nHomeopathic Practitioners Act, 1965 (II of 1965), the Pharmacy Act, 1967 (XI of 1967) or any other\nlaw as may be notified under sub- section (1) shall be heard and decided by the Tribunal.\n(3) All claims or complaints arising out of acts or obligations pursuant to the Pakistan Medical\nand Dental Ordinance, 1962 (XXXII of 1962), Pakistan Medical Commission Ordinance, 2019 (II of\n2019), the Pakistan Nursing Council Act, 1973 (XXVI of 1973), Pakistan Health Research Council\nAct, 2016 (XII of 2016) or the Unani, Ayurvedic and Homeopathic Practitioners Act, 1965 (II of\n1965), the Pharmacy Act, 1967 (XI of 1967) or any other law as may be notified under sub-section\n(1), where the original jurisdiction is not vested in the relevant apex authorities or councils formed\nthereunder shall be heard and decided by the Tribunal.\n(4) All cases in which the offender is sentenced to a fine, whether with or without\nimprisonment, it shall be competent for the Tribunal to direct that in default of payment of the fine the\noffender shall be punishable with imprisonment for a certain term, which imprisonment shall be in\nexcess of any other imprisonment to which he may have been sentenced or to which he may be liable\nunder a commutation of sentences.\n(5) The term for which the Tribunal directs the offender to be imprisoned in default of payment\nof a fine shall not exceed one-fourth of the term of imprisonment which is the maximum penalty\nprescribed for the offence in the relevant statute or rules or regulations framed thereunder.\n(6) In exercise of its criminal jurisdiction, the Tribunal shall have the same powers as are\nvested in Court of Sessions under the Code of Criminal Procedure, 1898 (Act V of 1898).\n(7) In exercise of the civil jurisdiction, the Tribunal shall have the same powers and shall\nfollow the same procedure as civil court under the Code of Civil Procedure, 1908 (Act V of 1908).\n(8) In all matters with respect to which no procedure has been provided for in this Act, the\nTribunal shall follow the procedure laid down in the Code of Civil Procedure, 1908 (Act V of 1908).\nThe Tribunal shall make such rules for its functioning as deemed appropriate by the Chairman in\nconsultation with the members.\n(9) The Tribunal may issue bailable warrant for the arrest of any person against whom\nreasonable suspicion exists, of his having been involved in any contravention punishable under this\nAct:\nProvided that such warrant shall be applied for, issued and executed in accordance with the\nprovisions of the Code of Criminal Procedure, 1898 (Act V of 1898):\nProvided further that if the person arrested executes a bond with sufficient surety in accordance\nwith the endorsement on the warrant he shall be released from custody, failing which he shall be taken\nor sent without delay to the officer in-charge of the nearest police station.\n(10) All proceedings before the Tribunal shall be deemed to be judicial proceedings within the\nmeaning of sections 193 and 228 of the Pakistan Penal Code, 1898 (Act XLV of 1898) and the Tribunal\nshall be deemed to be a court for the purpose of sections 480 and 482 of the Code of Criminal\nProcedure, 1898 (Act V of 1898).\n(11) The Tribunal shall hear and decide all appeals, complaints or claims instituted before it\nwithin one hundred twenty days without exception and shall refuse all requests for adjournments if\nsought by any party if such adjournment would lead to the Tribunal not being able to decide a case\nwithin the stipulated period.\n(12) The Tribunal shall impose penalties as may be prescribed under the relevant statute or\nrules or regulations made thereunder and in the absence thereof determine reasonable penalties for\nreasons to be recorded subject to a fine not exceeding fifty million Rupees and imprisonment not\nexceeding seven years."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Offences by bodies corporate",
      "content": "(1) Where any contravention has been committed by a\nbody corporate and it is proved that such offence has been committed with the consent or connivance\nor, is attributed to any negligence on the part of, any director, partner, manager, secretary, trustee or\nother officer of the body corporate, they shall be deemed to be guilty of such contravention along with\nthe body corporate and shall be punished accordingly:\nProvided that in the case of company as defined under the Companies Act, 2017 (XIX of 2017),\nonly the chief executive officer shall be liable under this section.\nExplanation.— For the purpose of this section, “body corporate or institution” includes a firm,\nassociation of persons, a society registered under the societies Registration Act, 1860 (XXI of 1860)\nor under the Co-operative Societies Act, 1925 (VII of 1925) and a trust created under the Trust Act,\n1882 (II of 1882).\n(2) Where any contravention has been committed by any Government agency, local authority\nor local council and it appears from the relevant documents that such contravention has been\ncommitted with the consent or connivance of or is attributed to any negligence on the part of the head\nor any other officer of the Government agency, local authority or local council, such head or other\nofficer shall also be deemed guilty of such contravention along- with the Government agency, local\nauthority or local council and shall be liable to be proceeded against and punished accordingly."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Appeals to the Medical Tribunal",
      "content": "(1) Any person aggrieved by any order or direction\nof the authorities pursuant to the Pakistan Medical and Dental Council Ordinance, 1962 (XXXII of\n1962), Pakistan Medical Commission Ordinance, 2019 (II of 2019), the Pakistan Nursing Council Act,\n1973 (XXVI of 1973), Pakistan Health Research Council Act, 2016 (XII of 2016) or the Unani,\nAyurvedic and Homeopathic Practitioners Act, 1965 (II of 1965) or the Pharmacy Act, 1967 (XI of\n1967) and subject to the provisions of the Pakistan Medical and Dental Council Ordinance, 1962\n(XXXII of 1962), Pakistan Medical Commission Ordinance, 2019 (II of 2019), the Pakistan Nursing\nCouncil Act, 1973 (XXVI of 1973), Pakistan Health Research Council Act, 2016 (XII of 2016) or the\nUnani, Ayurvedic and Homeopathic Practitioners Act, 1965 (II of 1965), the Pharmacy Act, 1967 (XI\nof 1967) or any other law as may be notified under sub-section (1) of section 6, may prefer an appeal\nbefore the Tribunal within thirty days of the date of communication of the impugned order or direction.\n(2) An appeal to the Tribunal shall be in such form, contain such particulars and be\naccompanied by such fees as may be prescribed."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Appeals from orders of the Medical Tribunal",
      "content": "Any person aggrieved by any final order\nin suit, in appeal or against any sentence passed by the Tribunal may, within thirty days of\ncommunication of such order or sentence, prefer an appeal to the Supreme Court of Pakistan."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Abatement of suit and other proceedings",
      "content": "All suits, appeals, complaints or applications\nregarding any matter within the jurisdiction of the Tribunal pending in any court immediately before\nthe commencement of this Act shall abate forthwith:\nProvided that any party to such proceedings may, within ninety days of the establishment of\nthe appropriate Tribunal, approach to the Tribunal in respect of any such matter which is in issue in\nsuch suit, complaint, appeal or application etc."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Limitation",
      "content": "The provisions of sections 5 and 12 of the Limitation Act, 1908 (IX of 1908),\nshall apply to appeals etc. under this Act."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. The officers of Federal, Provincial and local Governments to assist Tribunal",
      "content": "The\nofficers of the Federal Government, Provincial Governments and local governments including the\nIslamabad Capital Territory police and the Provincial police shall assist the Tribunal and its officers\nin the discharge of their functions under the provisions of this Act and the rules and regulations made\nthere under."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Rules",
      "content": "The Federal Government may, by notification in the official Gazette, make rules\nfor carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Regulations",
      "content": "The Tribunal may, by notification in the official Gazette, make regulations\nto carry out purposes of this Act."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Overriding effect",
      "content": "The provisions of this Act shall have effect notwithstanding anything\nto the contrary contained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Savings",
      "content": "All appointments, orders, notifications made, passed or issued or duly done by\nthe competent authority in relation to the Tribunal, or by the Tribunal under the repealed Medical\nTribunal Ordinance, 2019 (XIV of 2019) are saved and deemed continued."
    }
  ],
  "definitions": [
    {
      "term": "Bench",
      "definition": "bench as constituted by the Chairman of the Medical Tribunal;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "Chairman of the Medical Tribunal;",
      "source_provision": "sec2"
    },
    {
      "term": "members",
      "definition": "members of the Medical Tribunal;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed rules or regulations made under this Act, as the case may be;",
      "source_provision": "sec2"
    },
    {
      "term": "Registrar",
      "definition": "the registrar of the Medical Tribunal and includes any other person authorized by the Tribunal to perform the functions of the Registrar under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "Tribunal",
      "definition": "Medical Tribunal established under this Act.",
      "source_provision": "sec2"
    }
  ]
}
