{
  "id": "pk-members-of-majlis-e-shoora-parliament-immunities-and-privileges-act-2023",
  "type": "statute",
  "title": "Members of Majlis-e-Shoora (Parliament) Immunities and Privileges Act, 2023",
  "title_en": "Members of Majlis-e-Shoora (Parliament) Immunities and Privileges Act, 2023",
  "short_name": "MOMIA",
  "status": "in_force",
  "issued_date": "2023-05-02",
  "in_force_date": "2023-05-02",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pkZg%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Members of Majlis-e-Shoora (Parliament) Immunities and Privileges Act, 2023 (XX of 2023) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act shall be called the Members of\nMajlis-e-Shoora (Parliament) Immunities and Privileges Act, 2023.\n(2)     It extends to the whole of Pakistan.\n(3)     It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(a)     “Assembly” means the National Assembly of Pakistan;\n(b)     “Chairman” means the Chairman of the Senate;\n(c)     “member” means a member of the Senate of Pakistan or the National\nAssembly;\n(d)     “Senate” means the Senate of Pakistan;\n(e)     “session” means the period commencing on the day of the first sitting of the\nSenate or the Assembly after having been summoned until the Senate or\nAssembly is prorogued; and\n(f)     “Speaker” means the Speaker of the National Assembly."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Arrest under preventive detention laws",
      "content": "No member shall be detained under any law\npertaining to preventive detention once the session is summoned by the President or the Chairman or\nSpeaker, as the case may be."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Registration of cases",
      "content": "When a first information report (FIR) is registered or reference is\nfiled, against a member, the Chairman or Speaker, as the case may be, shall be informed and copy of\nthe FIR or reference, as the case may be, shall be provided within twenty-four hours of such registration\nor filing."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Intimation of arrest, detention, etc., of a member",
      "content": "(l) When a member is required to be\narrested or arrested on a criminal charge or for a criminal offence or is sentenced to be imprisonment\nby a court or is detained under an executive order, the committing judge, magistrate or, as the case\nmay be, executive authority, shall immediately intimate such fact to the Chairman or Speaker, as the\ncase may be, indicating the reasons for the arrest, detention or imprisonment of the member.\n(2) When a member is summoned by or required to appear before any commission, tribunal,\nauthority, organization, agency or other, for any investigation or inquiry, as the case may be, the\nChairman or Speaker, as the case may be, shall be informed in respect of the same, by intimating the\nbrief facts and reasons thereof."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Intimation on release of a member",
      "content": "When a member after his arrest or detention is\nreleased on bail or otherwise or is acquitted of a criminal charge, such fact shall be intimated to the\nChairman or Speaker, as the case may be, by the authority concerned."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Production of member in custody",
      "content": "(1) The Chairman, Speaker or, as the case may be,\nchairman of a committee of the Senate or Assembly shall summon a member in custody on the charge\nof any offence or under any law related to preventive detention to attend a sitting or sittings of the\nSenate, Assembly or meeting of a committee of which he is a member.\n(2) On a production order under sub-section (1) signed by the secretary or by any other officer\nauthorized by the Chairman, Speaker, as the case may be, in this behalf, addressed to the Federal\nGovernment or, as the case may be, the Provincial Government where the member is held in custody,\nor to the authority having or holding custody of the member, the Federal Government or the Provincial\nGovernment or such other authority, shall cause the member in custody to be produced before the\nsergeant-at-arms of the Senate or, as the case may be, who shall after the conclusion of the Assembly\nsitting on the meeting, deliver the member into the custody of the Federal Government or the Provincial\nGovernment or other authority, as the case may be."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Exemption from arrest",
      "content": "No member shall be detained or arrested one week before the\ncommencement of a session in which he is required to__\n(a)     a vote for election of the Prime Minister or the Chief Minister; or\n(b)     for a vote of confidence or a vote of no confidence; or\n(c)     for a money bill (Annual Budget)."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Arrest within the precincts of Majlis",
      "content": "e-Shoora (Parliament).— No member shall be\narrested within the precincts of Majlise-Shoora (Parliament) without the permission of the Chairman\nor Speaker, as the case may be."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Service of legal process",
      "content": "A legal process issued by any court, tribunal or other authority\nshall not be served on a member within the precincts of Majlis-e-Shoora (Parliament)."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Act not to prejudice, restrict or limit any other immunities and privileges",
      "content": "The\nprovisions of this Act shall be in addition to, and not in derogation of, any powers, immunities and\nprivileges of the members which may from time to time be defined by law or which are enjoyed by the\nmembers, or any law relating to immunities and privileges, and nothing contained herein shall\nprejudice, restrict or limit, all or any of the immunities and privileges enjoyed by the members or\navailable to the members under any law or otherwise.\n________________                 RGN-Dated. 28-08-2025"
    }
  ],
  "definitions": [
    {
      "term": "Assembly",
      "definition": "the National Assembly of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Senate;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of the Senate of Pakistan or the National Assembly;",
      "source_provision": "sec2"
    },
    {
      "term": "Senate",
      "definition": "the Senate of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "session",
      "definition": "the period commencing on the day of the first sitting of the Senate or the Assembly after having been summoned until the Senate or Assembly is prorogued; and",
      "source_provision": "sec2"
    },
    {
      "term": "Speaker",
      "definition": "the Speaker of the National Assembly.",
      "source_provision": "sec2"
    }
  ]
}
