{
  "id": "pk-members-of-parliament-and-provincial-assemblies-exemption-of-advisers-from-disqu",
  "type": "statute",
  "title": "Members of Parliament and Provincial Assemblies (Exemption of Advisers from Disqualification) Act, 1976",
  "title_en": "Members of Parliament and Provincial Assemblies (Exemption of Advisers from Disqualification) Act, 1976",
  "short_name": "MOPAP",
  "status": "in_force",
  "issued_date": "1976-04-17",
  "in_force_date": "1976-04-17",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUZWRu-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Members of Parliament and Provincial Assemblies (Exemption of Advisers from Disqualification) Act, 1976 (XIX of 1976) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Act may be called the Members of\nParliament and Provincial Assemblies (Exemption of Advisers from Disqualification) Act, 1976.\n(2) It shall come into force at once and shall be deemed to have taken effect on the thirty-first\nday of December, 1975."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Advisor to Governor not to be disqualified. It is hereby declared that any person",
      "content": "holding the office of Adviser to the Governor of a Province during the period—\n(a)         that an Order under paragraph (c) of clause (2) of Article 232 of the\nConstitution is in force whereby the Federal Government has assumed to\nitself, or directed the Governor of a Province to assume on its behalf, all or\nany of the functions of the Government of that Province; or\n(b)        a Proclamation under Article 234 of the Constitution is in force;\nshall not be disqualified from being elected or chosen as, and from being, a member of\nParliament or a Provincial Assembly."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. [Repeal.] Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981",
      "content": "(XXVII of1981), s. 3 and Sch., 11.\n________________\nLast Uploaded on 2.11.2023\n1\nFor Statement of Objects and Reasons, see Gaz. of P., 1976, Ext., Pt. Ill, p. 308."
    }
  ],
  "definitions": []
}
