{
  "id": "pk-members-of-the-election-commission-salary-allowances-perks-and-privileges-act-20",
  "type": "statute",
  "title": "Members of the Election Commission (Salary, Allowances, Perks and Privileges) Act, 2016",
  "title_en": "Members of the Election Commission (Salary, Allowances, Perks and Privileges) Act, 2016",
  "short_name": "MOTEC",
  "status": "in_force",
  "issued_date": "2016-08-22",
  "in_force_date": "2016-08-22",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2JwZpw%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Members of the Election Commission (Salary, Allowances, Perks and Privileges) Act, 2016 (XLII of 2016) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Act may be called the Members of the Election\nCommission (Salary, Allowances, Perks and Privileges) Act, 2016.\n(2) It shall come into force at once and shall be deemed to have taken effect on and from the 13th\nJune. 2011."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject “Member” means a\nmember of the Election Commission appointed under paragraph (b) of clause (2) of Article 218 of the\nConstitution of the Islamic Republic of Pakistan."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Salary, allowances, perks and privileges",
      "content": "A member shall be entitled to such salary,\nallowances, perks and privileges as are admissible to a Judge of a High Court."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Provident Fund",
      "content": "A member may, at his option, become a subscriber to the General Provident\nFund and, if he so opts, shall subscribe to the Fund as a compulsory subscriber according to the\nProvident Funds Act, 1925(XIX) and the rules made thereunder."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Leave",
      "content": "A member may be granted leave by the President as follows:—\n(a)      leave on leave salary equivalent to full pay at the rate of one-eleventh of the period\nspent on duty:\n(b)      leave on leave salary equivalent to half pay at the rate of one-eleventh of the period\nspent on duty, such leave being convertible into leave on full pay at the rate of two\ndays of leave on half pay equal to one day's leave on full pay, if availed on medical\nground: and\n(c)      extraordinary leave without pay or allowances for a period not exceeding three\nmonths during his full term of five years, subject to a maximum of two months at\nany one time, the member being entitled to combine such leave with any other kind\nof leave admissible to him.\n____________\nRGN Date: 03-01-2024"
    }
  ],
  "definitions": []
}
