{
  "id": "pk-rtia-2017",
  "type": "statute",
  "title": "Right of Access to Information Act 2017",
  "title_en": "Right of Access to Information Act 2017 (RAIA)",
  "short_name": "RAIA",
  "status": "in_force",
  "issued_date": "2017-10-24",
  "in_force_date": "2017-10-24",
  "url": "https://moib.gov.pk/DocumentCenter/2017/Right_of_Access_to_Information_Act_2017.pdf",
  "description": "The Right of Access to Information Act 2017 guarantees every citizen of Pakistan the constitutional right to access information held by public bodies, establishing the principle of maximum disclosure and creating the Pakistan Information Commission (PIC) as the independent oversight body. The Act replaces earlier freedom of information laws and aligns Pakistan with international standards for transparency and accountability in government.",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short Title, Extent and Commencement",
      "content": "This Act shall be called the Right of Access to Information Act, 2017. It shall extend to the whole of Pakistan and shall apply to public bodies at the Federal, Provincial and Local Government levels, and to any other body, organization or institution carrying out public functions or receiving public funds, as may be prescribed. The Act shall come into force at once. The right of access to information shall be exercised in a manner consistent with the public interest, the requirements of security and confidentiality expressly established by law, and the privacy rights of individuals. The Act shall be construed liberally in favour of the right of access, and limitations on access shall be construed narrowly."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Right of Access to Information",
      "content": "Subject to the provisions of this Act, every citizen has the right to access information held by or under the control of a public body. The right of access to information includes the right to: obtain a copy of any record held by a public body; examine any record held by a public body; obtain a copy of any record or part thereof in any format; be informed of the existence of any record held by a public body; receive information in the language in which it was created or, where reasonable, in translation. No citizen shall be required to justify a request for access to information or to show any interest in the information requested. Public bodies shall process requests for access to information promptly and in good faith. The burden of proof that information is exempt from disclosure rests entirely on the public body."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Public Bodies Covered",
      "content": "The following are public bodies for the purposes of this Act: (a) any office or department of the Federal, Provincial or Local Government; (b) any agency, authority, board, commission, corporation or statutory body established by or under any law; (c) any court or tribunal; (d) any private organization that is substantially financed from public funds; (e) any private organization that performs public functions or exercises delegated powers of a public authority; (f) parliament and provincial assemblies, subject to such limitations as may be prescribed. Public educational institutions, public hospitals, and public utilities shall be public bodies for the purposes of this Act. The Federal Government may, by notification in the Gazette, designate additional bodies as public bodies for the purposes of this Act. The Act does not apply to the intelligence agencies or security services, except that their organizational structures and budgetary information shall be disclosed."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Exemptions",
      "content": "Access to information may be refused where disclosure would, or would be likely to: (a) endanger the life, safety or liberty of any person; (b) cause serious prejudice to the defence, security or international relations of Pakistan; (c) cause serious prejudice to the investigation, detection or prosecution of crime; (d) infringe the privacy of an individual as protected by law; (e) constitute a breach of a specific legal duty of confidentiality; (f) cause serious commercial harm to the competitive position of any person; (g) inhibit the free and frank provision of advice or the deliberative processes of government. The exemptions in this section are not applicable where: the overall public interest in disclosure outweighs the interest in refusing access; the information relates to human rights violations or corruption; or the information shows that a public body has failed to comply with the law. Information more than twenty years old shall not be withheld on any of the grounds in this section unless the public body demonstrates a compelling continuing reason for doing so."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Proactive Disclosure",
      "content": "Public bodies shall proactively disclose information of public interest without requiring an individual request. The minimum categories of information to be proactively disclosed include: (a) structure, functions, powers and duties of the public body; (b) organizational chart and details of senior officials; (c) budget, expenditure, procurement and financial statements; (d) policies, laws, regulations and guidelines applicable to the public body; (e) registers of licences, permits, contracts and subsidies; (f) decisions and resolutions of governing bodies; (g) reports, studies and research commissioned by the public body; (h) details of information held, information request policies, and contact details for the Information Officer. Proactive disclosure shall be made through the public body's website and in such other manner as may be prescribed. Information to be proactively disclosed shall be made available in accessible formats and, where possible, in machine-readable formats."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Processing of Information Requests",
      "content": "A person wishing to exercise the right of access to information shall make a request to the Information Officer of the relevant public body, setting out the information or category of information required. The public body shall respond to the request within ten working days of receipt, providing the requested information, requesting clarification of an unclear request, stating that the information requested falls within an exemption and explaining which exemption applies, or advising that the information is not held by the public body. The time limit may be extended by an additional ten working days in exceptional circumstances, provided the requestor is notified before the expiry of the initial period with reasons for the extension. Access to information shall be free of charge, except that reasonable charges may be levied for the physical production of documents in volumes exceeding twenty pages. The Information Officer shall record all information requests and their outcomes."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Pakistan Information Commission",
      "content": "There shall be established a Pakistan Information Commission consisting of a Chief Information Commissioner and not more than four Information Commissioners, appointed by the President of Pakistan on the advice of the Prime Minister. Commissioners shall serve for a fixed term of four years and shall be persons of integrity, with knowledge and experience in law, public administration, journalism, civil society, or related fields. The Commission shall: (a) receive and decide complaints from persons who have been refused access to information or whose requests have not been responded to; (b) monitor and report on compliance by public bodies with this Act; (c) advise public bodies on good practice in implementing the Act; (d) conduct outreach and education on the right of access to information; (e) submit annual reports to Parliament. The Commission shall be independent in the exercise of its functions. Its decisions shall be binding on public bodies and shall be subject to review by the High Court."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Penalties",
      "content": "Any officer of a public body who wilfully obstructs, hinders, delays or refuses to comply with the provisions of this Act, or who destroys, conceals, alters or falsifies a record in order to deny access to information under this Act, shall be liable to such disciplinary action as is determined by the Chief Information Commissioner, including a fine not exceeding two hundred thousand rupees in respect of each violation. Where the violation is continuing, a further fine not exceeding ten thousand rupees per day shall apply for each day the violation continues. The Chief Information Commissioner may also recommend criminal prosecution of an officer who: wilfully destroys records to prevent disclosure; wilfully misleads a requestor about the existence of a record; accepts bribes to refuse or grant access to information. Public bodies that repeatedly fail to comply with the Act's requirements may be named and shamed in annual reports to Parliament. Decisions of the Commission may be enforced as orders of the High Court."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Protection of Whistleblowers",
      "content": "No person shall be subject to any civil or criminal liability, or any other unfair treatment, by reason of having in good faith disclosed to the Commission, or to any person or body performing a similar function to the Commission, information about a violation of this Act or any other law relating to transparency, accountability or good governance. A public employee who discloses information in the reasonable belief that it shows an illegality, serious mismanagement, gross waste, abuse of authority, or substantial and specific danger to public health or safety, shall not be dismissed, demoted, suspended, threatened or otherwise discriminated against by reason of such disclosure. Persons who suffer retaliation for whistleblowing contrary to this section may seek remedy before the Commission, which may order reinstatement, compensation, and such other relief as is appropriate. The Commission shall maintain a secure mechanism for receiving reports of violations of this Act in confidence."
    }
  ],
  "definitions": [
    {
      "term": "information",
      "definition": "Any material in any form, including records, documents, memos, e-mails, opinions, advices, press releases, circulars, orders, logbooks, contracts, reports, papers, models, and data material in any electronic form.",
      "source_provision": "sec3"
    },
    {
      "term": "public body",
      "definition": "Any government office or department, statutory body, court or tribunal, or private organization substantially financed by public funds or performing public functions.",
      "source_provision": "sec5"
    },
    {
      "term": "Information Officer",
      "definition": "The officer designated by a public body to receive and process requests for access to information under the RAIA.",
      "source_provision": "sec13"
    },
    {
      "term": "proactive disclosure",
      "definition": "The obligation of public bodies to publish specified categories of information of public interest on their websites and in other accessible formats without requiring individual requests.",
      "source_provision": "sec10"
    }
  ]
}
