{
  "id": "pk-members-of-the-national-assembly-exemption-from-preventive-detention-and-persona",
  "type": "statute",
  "title": "Members Of The National Assembly (Exemption From Preventive Detention And Personal Appearance) Ordinance, 1963",
  "title_en": "Members Of The National Assembly (Exemption From Preventive Detention And Personal Appearance) Ordinance, 1963",
  "short_name": "MOTNA",
  "status": "in_force",
  "issued_date": "1963-11-15",
  "in_force_date": "1963-11-15",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJ%2BY-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Members Of The National Assembly (Exemption From Preventive Detention And Personal Appearance) Ordinance, 1963 (IX of 1963) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Proceedings in Civil Courts etc",
      "content": "THE MEMBERS OF THE NATIONAL ASSEMBLY (EXEMPTION FROM\nPREVENTIVE DETENTION AND PERSONAL APPEARANCE)\nORDINANCE, 1963\n1\nORDINANCE NO. IX OF 1963\n[16th November, 1963]\nAn Ordinance to provide for certain privileges of the Members of the National Assembly of Pakistan.\nWHEREAS Article 111 of the Constitution provides, inter alia, that the privileges of Members\nof an Assembly may be determined by law;\nAND WHEREAS it is expedient to provide for exemption from preventive detention, and from\npersonal appearance of the Members of the National Assembly of Pakistan in Civil and Revenue Courts\nand before Election Tribunals, for specified periods;\nAND WHEREAS the National Assembly is not in session and the President is satisfied that\ncircumstances exist which render immediate legislation necessary;\nNOW, THEREFORE, in exercise of the powers conferred by clause (1) of Article 29 of the\nConstitution, and of all other powers enabling him in that behalf, the President is pleased to make and\npromulgate the following Ordinance:___"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Ordinance may be called the Members\nof the National Assembly (Exemption from Preventive Detention and Personal Appearance)\nOrdinance, 1963.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context,",
      "content": "(a)        “Assembly” means the National Assembly of Pakistan;\n(b)        “Member” means a Member of the Assembly;\n(c)\n“session” means the period commencing on the day of the first meeting of the\nAssembly after having been summoned until the Assembly is prorogued or\ndissolved.\n3.The privilege etc.___(1) No Member shall be detained under any law relating to preventive\ndetention, nor shall any Member be required to appear in person in any Civil or Revenue Court,2[* *\n*] during a session, and for a period of fourteen days before and fourteen days after the session.\n3\n[(2) Nothing in sub-section (1) shall be construed as applying to any Member who is detained\nunder any such law as is referred to in sub-section (1)___\n1\nApproved by the National Assembly of Pakistan on the 27th November, 1963, see Gazette, of P., Ext., 1963. p. 813 k.\n2\nCertain words omitted by the Privileges, of Members of the National and Provincial Assemblies (Amdt.) Act, 1977 (21 of 1977), s. 2 and Schedule.\n3\nSubs. by the Members of National Assembly (Exemption from Preventive Detention and Personal Appearance) (Amdt.) Act, 1975 (17 of 1975), s. 2,\nfor sub-section (2) (w.e.f. 8-2-1975).\n(a)        at any time during the period commencing on the fifteenth day next after the\nconclusion of a session and ending on the 15th day before the commencement\nof the next session; or\n(b)        for reasons of State connected with defence, external affairs, or the security of\nPakistan or any part thereof.]"
    }
  ],
  "definitions": [
    {
      "term": "Assembly",
      "definition": "the National Assembly of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "a Member of the Assembly;",
      "source_provision": "sec2"
    },
    {
      "term": "session",
      "definition": "the period commencing on the day of the first meeting of the Assembly after having been summoned until the Assembly is prorogued or dissolved. 3.The privilege etc.___(1) No Member shall be detained under any law relating to preventive detention, nor shall any Member be required to appear in person in any Civil or Revenue Court,2[* * *] during a session, and for a period of fourteen days before and fourteen days after the session. 3 [(2) Nothing in sub-section (1) shall be construed as applying to any Member who is detained under any such law as is referred to in sub-section (1)___ 1 Approved by the National Assembly of Pakistan on the 27th November, 1963, see Gazette, of P., Ext., 1963. p. 813 k. 2 Certain words omitted by the Privileges, of Members of the National and Provincial Assemblies (Amdt.) Act, 1977 (21 of 1977), s. 2 and Schedule. 3 Subs. by the Members of National Assembly (Exemption from Preventive Detention and Personal Appearance) (Amdt.) Act, 1975 (17 of 1975), s. 2, for sub-section (2) (w.e.f. 8-2-1975). (a) at any time during the period commencing on the fifteenth day next after the conclusion of a session and ending on the 15th day before the commencement of the next session; or (b) for reasons of State connected with defence, external affairs, or the security of Pakistan or any part thereof.]",
      "source_provision": "sec2"
    }
  ]
}
