{
  "id": "pk-mesne-profits-and-improvements-act-1855",
  "type": "statute",
  "title": "Mesne Profits and Improvements Act, 1855",
  "title_en": "Mesne Profits and Improvements Act, 1855",
  "short_name": "MPAIA",
  "status": "in_force",
  "issued_date": "1855-03-26",
  "in_force_date": "1855-03-26",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Mesne Profits and Improvements Act, 1855 (XI of 1855) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Value of improvements made by bona fide holders under defective titles secured to them",
      "content": "1\n[THE MESNE PROFITS AND IMPROVEMENTS ACT, 1855]\nACT No XI OF 1855\n[27th March, 1855]\nAn Act relating to mesne profits and to improvements made by holders under defective titles 2* * *.\nWHEREAS it is expedient, 2*         *        * to limit the liability for mesne profits and to\nsecure to bona fide holders under defective titles the value of improvements made by them; It is\nenacted as follows:-"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. 3No person chargeable with rent bona fide paid to holder under defective title. 1No",
      "content": "person shall be chargeable with any rents or profits of any immovable property which he has bona\nfide paid over to any person of whom he bona fide held the same, notwithstanding it may afterwards\nappear that the person to whom such payment was made had no right to receive such rents or profits."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. [Act to apply only to cases governed by English Law.] Omitted by the Federal Laws",
      "content": "(Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch. II.\n__________\nDate: 13-09-2024\n1\nShort title given by the Short Titles Act, 1897 (14 of 1897).\nThe Act has been declared to be in force in all the Provinces and the Capital of the Federation, except the Scheduled Districts, by the Laws Local Extent\nAct, 1874 (15 of 1874), s. 3.\nIt has been declared, by notification under s. 3 (a) of the Scheduled Districts Act, 1874 (14 of 1874), to be in force in the following Scheduled Districts,\nnamely:-\nSind. .       ..         .. See Gazette of India, 1880, Pt. I, p. 672.\nThe Districts of Hazara, Peshawar, Kohat, Bannu, Dera Ismail Khan and Dera Ghazi Khan. [Portions of the Districts of Hazara, Bannu,\nDera Ismail Khan and Dera Ghazi Khan and the Districts of Peshawar and Kohat now form the N.W.F.P., see Gazette of India, 1901, Pt. I, p. 857 and\nibid., 1902, Pt. I, p. 575; but its application to that portion of the Hazara District known as Upper Tanawal has been barred by the Hazara (Upper\nTanawal) Regulation, 1900 (2 of 1900)]-See Gazette of India, 1886, Pt. I, p. 48.\n2\nCertain words omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and Sch. II.\n3\nis extended-See Act 4 of 1882; s. 2 and Sch."
    }
  ],
  "definitions": []
}
