{
  "id": "pk-microfinance-institutions-ordinance-2001",
  "type": "statute",
  "title": "Microfinance Institutions Ordinance, 2001",
  "title_en": "Microfinance Institutions Ordinance, 2001",
  "short_name": "MIO",
  "status": "in_force",
  "issued_date": "2001-10-15",
  "in_force_date": "2001-10-15",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pkaQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Microfinance Institutions Ordinance, 2001 (LV of 2001) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Removal of difficulties",
      "content": "ORDINANCE No. LV of 2001\nAn Ordinance to regulate the establishment, business and operations of microfinance institutions.\nWHEREAS it is expedient to promote the establishment of microfinance institutions for\nproviding organizational, financial and infrastructural support to poor persons, particularly\npoor women, for mitigating poverty and promoting social welfare and economic justice through\ncommunity building and social mobilization and to provide for matters connected therewith or\nancillary thereto;\nAND WHEREAS it is essential to regulate microfinance institutions to protect the depositors\nand customers and to safeguard these institutions against political and other outside interference;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of\nOctober, 1999, and Provisional Constitution Order No.1 of 1999, read with the Provisional\nConstitution (Amendment) Order No.9 of 1999, and in exercise of all powers enabling him in that\nbehalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the\nfollowing Ordinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Ordinance may be called the\nMicrofinance Institutions Ordinance, 2001.\n(2) It extends to the whole of Pakistan\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context,",
      "content": "(a)     “auditor” means any person who is appointed in accordance with the provisions\nof this Ordinance for the audit of the accounts of a microfinance institution;\n(b)     “Banking Companies Ordinance” means the Banking Companies Ordinance,\n1962 (LVII of 1962);\n(c)     “company” means a company incorporated under the Companies Ordinance,\n1984 (XLVII of 1984), or any other law for the time being in force;\n(d)     “customer” means any person or group of persons availing the services of a\nmicrofinance institution;\n(e)        “deposit” means the deposit of money, repayable on demand or otherwise,\naccepted by a microfinance institution from the public for the purpose of\nproviding microfinance services;\n(f)        “depositor” means a person in whose name a deposit is held by a\nmicrofinance institution;\n(g)        “license” means the license issued by the State Bank and the expression\n“licensed” should be construed accordingly;\n(h)        “member” means the member or shareholder who has contributed or\nsubscribed to the capital of a microfinance institution;\n1\n[(i)   “microfinance institution” means an institution, which extends micro credit and\nallied services to the poor through sources other than public savings and\ndeposits];\n1\n[(ia) “microfinance bank” means an institution licensed by State Bank under this\nOrdinance to establish and operate as microfinance bank;]\n(j)        “microfinance services” means the financial and other related services\nspecified in section 6, the value of which does not exceed such amount as\nthe State Bank may, from time to time, determine;\n(k)        “poor persons” means persons who have meager means of subsistence and\nwhose total income during a year is less than such minimum limit as the\nState Bank may, from time to time, prescribe;\n(l)        “prescribed” means prescribed by rules [and regulations] made under this\nOrdinance;\n(m)        “specified area” means the district, province or other specified area within\nwhich a microfinance institution is licensed to operate; and\n(n)        “State Bank” means the State Bank of Pakistan established under the State\nBank Act, 1956 ( XXXIII of 1956)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Applications of other laws",
      "content": "(1) The provisions of this ordinance shall be in addition to,\nand, save as hereinafter provided, not in derogation of, any other law for the time being in force."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Restrictions on establishment and operations",
      "content": "company, shall be established as a\nmicrofinance institution"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Name",
      "content": "_ (1) No person other than a licensed microfinance bank shall use with its name the\nwords “Microfinance Bank” or “MFB” or its derivatives or any words or letters which convey that it is\na microfinance bank.\n(2) Any person or company to whom license has not been granted under this Ordinance\nor the license granted has been cancelled, contravenes, or attempts to contravene or abets the\ncontravention of sub-section (1), the chief executive by whatever name called, a Director, a Manager\nand other officer of the company, and the individual and every member of the association or body of\nindividuals shall be deemed to be guilty of such contravention and shall be punishable with\nimprisonment for a term which may extend to three years or with fine which may extend to one\nmillion rupees or with both.”]."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Functions and powers",
      "content": "(1) A microfinance institution shall, in accordance with prudential\nregulations and subject to the terms and conditions of the license issued by the state bank, render\nassistance to micro-enterprises and provide microfinance services in a sustainable manner to poor\npersons, preferably poor women, with a view to alleviating poverty.\n(2) without prejudice to the generality of the foregoing provisions, the powers and functions\nof microfinance institutions shall be__\n(a)        to provide financing facilities, with or without collateral security, in cash or\nin kind, for such terms and subject to such conditions as may be prescribed,\nto poor persons for all types of economic activities including housing, but\n1\nexcluding business in foreign exchange transactions [except to receive\nremittances from abroad payable only in Pakistan Rupees to beneficiaries in\nPakistan subject to rules and regulations and authorization issued by State\nBank of Pakistan from time to time];\n(b)        to accept deposits;\n1\nAdded by the Finance Act, 2007 (4 of 2007), s.21, (w.e.f. 1-7-2007).\n(c)        to accept pledges, mortgages, hypothecations or assignments to it of any\nkind of movable or immovable property for the purpose of securing loans\nand advances made by it;\n(d)        to undertake the management, control and supervision of any Organization,\nenterprise, scheme, trust fund or endowment fund for the benefit and\nadvancement of poor persons;\n(e)        to buy, sell and supply on credit to poor persons industrial and agricultural\ninputs, livestock, machinery and industrial raw materials, and to act as agent\nfor any Organization for the sale of such goods or livestock;\n(f)        to invest in shares of anybody corporate, the objective of which is to provide\nmicrofinance services 1[and technical, vocational, education, business\ndevelopment and allied services to the poor and micro enterprises] to poor\npersons;\n(g)        to provide storage and safe custody facilities;\n(h)        to carry out survey and research, and to issue publication and maintain\nstatistics relating to the improvement of economic condition of poor persons;\n(i)        to provide professional advice to poor persons regarding investments in small\nbusiness and such cottage industries as may be prescribed;\n(j)        to encourage investments in such cottage industries and income generating\nprojects for poor persons as may be prescribed\n(k)        to provide services and facilities to customers to hedge various risks relating to\nmicrofinance activities;\n(l)        to render managerial, marketing, technical and administrative advice to\ncustomers and assisting them in obtaining services in such fields;\n(m)        to borrow and raise money and open bank accounts;\n(n)        to purchase, take on lease, or otherwise acquire, sell, exchange, surrender,\nlease, mortgage, dispose of and deal in any movable and immovable property\nand rights of all kinds for and on behalf of its customers for the purpose of\npromoting development opportunities, building of assets, resource allocation,\npromotion of markets, and adoption of better technology for economic growth\nand development;\n1Ins. by the Finance Act, 2006 (3 of 2006), s.18.\n(o)        to establish subsidiaries, whether wholly or partly owned, and to appoint\nagents in various locations for various activities which it may consider\nnecessary for the proper discharge of its functions;\n(p)        to pay, receive, collect and remit money and securities within the country;\n(q)        to acquire, maintain and transfer all movable and immovable property\nincluding residential premises, for carrying on its business;\n(r)        to open account or make any agency arrangement with, and to act as agent or\ncorrespondent of, any bank or financial institution;\n1\n(s)        to invest its surplus funds in Government [and such other marketable securities\nas State Bank may from time to time notify];\n(t)        to impose and receive fees, charges, profits or return for its services;\n(u)        to mobilize and provide financial and technical assistance and training to\nmicro enterprises;\n(v)        to undertake mobile banking to expedite transactions and reduce costs;\n(w)        to establish trust and endowment funds;\n(x)        to receive grants from the government and any other sources permitted by the\nState Bank; and\n(y)        to generally do and perform all such acts, deeds and things as may be necessary,\nincidental or conducive to the fulfillment of their functions and the attainment\nof their objectives."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Prohibition and restrictions",
      "content": "_ (1) A microfinance institution shall not undertake or transact\nany kind of business other than that authorized by, or under, this ordinance.\n(2) In performance of its functions under this Ordinance, a microfinance institution shall have\nproper regard to the economic and commercial merits of any or the transactions or activities it plans\nto undertake or assist.\n(3) Where a microfinance institution is required by any authority to undertake or assist\na micro enterprise or other such activities which it considers economically or otherwise unsound,\nauthority has provided adequate guarantee to the microfinance institution or indemnify any losses\nthat it may incur in the undertaking of such activity.\n1Subs. by the Finance Act, 2006 (3 of 2006),s.18 for “securities”.\n(4) No microfinance institution shall create a floating charge on the undertaking or any of\nits assets or part thereof, unless the creation of such floating charge is certified in writing by the State\nBank as not being detrimental to the interest of the depositors of such institution.\n(5) Any such charge created without obtaining the certificate of the State Bank shall be\ninvalid.\n(6) Any microfinance institution aggrieved by the refusal of a certificate under sub- section\n(4) may, within thirty days from the date on which such refusal is communicated to it, prefer an appeal\nto the Central Board of the State Bank whose decision thereon shall be final."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Principal Office",
      "content": "_ (1) The principal office of a microfinance institution shall be situated in\nthe specified area and shall not be changed without prior approval of the state Bank. The microfinance\ninstitution may, with the approval of the state Bank, establish branch offices at such other place, or\nplaces, in the specified area as it may think fit.\n(2) A microfinance institution shall furnish to the State Bank an annual plan indicating\nthe place where new branches will be opened or the names of agents to be appointed together\nwith the details of their duties and functions.\n(3) A microfinance institution shall give at least thirty days’ advance notice to the State\nBank for opening of a new branch or appointment of an agent.\n(4) Unless otherwise advised by the State Bank, the opening of the new branch or appointment\nof an agent shall be deemed to be licensed at the expiry of thirty days of the notice given to the State\nBank under sub-section (3)."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Area of operation. A microfinance institution shall be licensed to operate in an area",
      "content": "which may consist of,—\n(a)      a district;\n1\n[(aa) a region comprising up to five adjacent districts within the same\nProvince or any other area wherein this Ordinance is applied with\nnecessary adaptations as the case may be;].\n(b)      a province; or\n(c)      the whole of Pakistan"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Capitalization.___ 2[(1) Power to prescribe paid",
      "content": "up capital reuirements for microfinance\nbanks shall vest in State Bank of Pakistan and no microfinance bank shall operate unless it has a\nminimum paid-up capital as state Bank may, from time to time, prescribe. The State Bank may prescribe\ndifferent minimum paid-up capital requirements for microfinance banks operating at district, regional,\nprovincial, and national level.\n1 New clause (aa) ins.by the Finance Act, 2006 (3 of 2006), s.18\n2Subs. by the Finance Act, 2007, (4 of 2007),s.21, for, “sub-section (1)”.\nExplanation.__ For the purpose of this sub-section the expression “district” shall include the\nIslamabad capital territory and such other territories as specified by the Federal Government may, by\nnotification in officer Gazette, specify.]\n(2) Not less than fifty-one per cent of the paid up capital of a microfinance institution shall be\nsubscribed by the promoters or sponsor members and the shares subscribed to be the promoters or\nsponsor members shall remain in the custody of state bank and shall neither be transferable nor\nencumbrance of any kind shall be created thereon without prior permission, in writing, of the state\nBank."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Winding up. The provisions of Banking companies ordinance for winding up of banking",
      "content": "companies shall, mutates mutandis, apply to microfinance institutions of the purpose of their winding\nup.\n1[12. Existing microfinance institutions.___ (1) Any person performing the functions of a non-\ndeposit taking microfinance institution may make an application to the state bank on such forms\naccompanying such information and fee, as may be prescribed, for issuance of a license to set up\nmicrofinance bank and take deposits.\n(2) The State Bank may, on receipt of the application, make such enquiries as it considers\nnecessary and either grant a license as for a specified area as permissible under this ordinance, subject\nto such conditions as the State Bank may think fit to impose or for reasons to be recorded in writing,\nreject the application for the license.\n(3) Before granting the license, the State Bank shall satisfy itself by an inspection of the books\nof the microfinance institution, programme, project or otherwise, etc, that—\n(a)        the micro finance institution, project or programme, etc., enjoys a good\nfinancial health and is and will be in a position to meet its liabilities; and\n(b)        the affairs of the microfinance institution are not being, and are not likely to\nbe, conducted in a manner detrimental to the interests of its members and\npresent or future customers.\n(4) Where an application of a non-deposit taking microfinance institution for grant of license\nto take deposits is rejected, the concerned microfinance institutions may continue operations as a non-\ndeposit taking micro finance institution.\n(5) If the State Bank rejects such an application for grant of licence to take deposits, the\napplicant may, within thirty days from the date of the order of the State Bank, prefer an appeal to the\nCentral Board of the State Bank and the order passed by the Central Board in this respect shall be\nfinal.]\n1 Sub by the Finance Act, 2006 (3 of 2006), s.18 for “section 12”.\n1[13A. Suspension or cancellation of a licence.___ (1) The State Bank may suspend or cancel\na license granted to a microfinance bank if the microfinance bank.—\n(a)         at any time fails to comply with any of the conditions imposed upon it under\nsub-section (2) of section 12 or sub-section (2) of section 13, as the case may\nbe;\n(b)         at any time fails to pay its liabilities or in the opinion of State bank of Pakistan\nthe affairs of the microfinance bank are conducted in a manner detrimental\nto its depositors; or\n(c)         has furnished false or misleading information in its application for a licence;\nor\n(d)         has gone into liquidation, suspended its business activities or ceased to carry\non business as microfinance bank in Pakistan:\nProvided that before suspending or canceling a licence under clause (a)\nor clause (b), the State Bank, unless it is of opinion that the delay may be\nprejudicial to the interest of the micro finance bank’s depositors or the public,\nshall grant to the micro finance bank on such terms as it may specify, an\nopportunity of taking the necessary steps to comply with or fulfill such\nconditions.\n(2) No license shall be suspended or cancelled under sub-section (1) unless and until the\nmicrofinance bank is called upon by a notice in writing by the State Bank to show cause within fifteen\ndays as to why its licence should not be suspended or cancelled\n(3) In the event of suspension or cancellation of a license the microfinance bank concerned\nshall be notified forthwith and, from the date of such notification, shall cease to transact any business\nother than that required to wind up its affairs with the approval of the State Bank. The State Bank\nshall publish notice of such suspension or cancellation in one leading Urdu language newspaper and\none English language newspaper in addition to its publication in the official Gazette.\n(4) The provisions of sub-section (1) shall not prejudice the rights or claims of any person\nagainst the micro finance bank or of the micro finance bank against any person.\n(5) A micro finance bank aggrieved by the decision of the State Bank for suspension or\ncancellation of its licence may, within thirty days from the date on which such decision is\ncommunicated to it, apply for review to the Central Board of the State Bank.\n(6) The decision of the State Bank, subject to the result of review by the Central Board of\nthe State Bank under sub-section (5) shall be final.]\n1\nSubs. by the Finance Act, 2006 (3 of 2006),s.18 for “section 13”."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Management and administration: (1) The general superintendence and management",
      "content": "of the affairs of a microfinance institution shall vest in its Board of Directors which shall manage its\nbusiness and affairs in accordance with the principles of good governance.\n(2) There shall be a chief executive officer who shall work full time and be responsible\nfor the day-to-day administration of microfinance institution.\n(3) The State Bank shall ensure that the persons serving on the Board of Directors and the\nchief executive officer of a microfinance institution are persons of integrity and have good\nfinancial reputation."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Accounts",
      "content": "_ (1) A microfinance institution shall maintain porper books of accounts and,\nat the expiration of teach calendar year, prepare annual statement of accounts including the profit and\nloss account and balance sheet as may be prescribed.\n(2) A microfinance institution shall, in respect of such accounts, comply with such\ngeneral directions as the State Bank may, from time to time, issue."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Audit",
      "content": "_ (1) The accounts of a microfinance institution shall maintain proper books of\naccounts and, at the expiration of each calendar year, prepare annual statement of accounts including\nthe profit and loss account and balance sheet as may be prescribed.\n(2)    The auditor or auditors shall be appointed for such terms and on such remuneration, to\nbe paid by the microfinance institution, as the Board of Directors of such institution may fix:\n1\nProvided that the auditors once appointed shall not be removed before [five] years without\nthe prior approval of the State Bank and no auditor shall serve as external auditor of a microfinance\ninstitution consecutively for more than five years.\n(3) Every auditor, appointed under sub-section (2), shall be given a copy the annual balance\nsheet and other accounts of the microfinance institution who shall examine it, together with\nthe accounts and vouchers relating thereto, and shall have a list delivered to him of all books kept\nby the microfinance institution, and shall, at all reasonable times, have access to the books of\naccounts and documents of the microfinance institution, and may, in relation to such accounts,\nexamine any director or officer of the microfinance institution.\n(4) The auditors shall report to the Board of Directors of the microfinance institution upon the\nannual accounts and balance sheet and in their report they shall state whether, in their opinion, the\nbalance sheet contains all necessary particulars and is properly drawn up so as to exhibit a true and\ncorrect view of the state of affairs of the microfinance institution and, in case they have called for any\nexplanation or information from the microfinance institution, whether it has been given and whether\nit is satisfactory.\n1 Subs. by the Finance Act, 2006 (3 of 2006),s.18 for “Three”.\n(5) The audited financial statements shall be published within three months of close of its\nfinancial year and microfinance institution shall cause its accounts to be published in a daily\nnewspaper having wide circulation in the specified area.\n(6) A microfinance institution shall submit audited financial statements along with auditors’\nreport to the State Bank within three months of the close of its financial year.1\n2\n[Provided that in exceptional circumstances the State Bank may, for the reasons to be\nrecorded, extend such period up to a period of another one month.].\n(7) Nothing in this Ordinance shall apply to the preparation of accounts by a microfinance\ninstitution and its audit in respect of any accounting year which has expired prior to the\ncommencement of this Ordinance, and notwithstanding the other provision of this Ordinance such\naccounts shall be prepared, audited and submitted in accordance with the law in force immediately\nbefore such commencement."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Returns",
      "content": "_ (1) A microfinance institution shall furnish to the State Bank such returns,\nreports and information as may be prescribed.\n(2) Without limitation to the foregoing, a microfinance institution shall,—\n(a)        maintain a register of its members, Board of Directors and the chief executive\nofficer and provide information thereof to the State Bank at such time and in\nsuch manner as may be prescribed;\n(b)        maintain accounts and have the same audited at such time and in such manner\nas may be prescribed;\n(c)        submit its annual report and audited accounts to the State Bank and publish the\nsame for general information at such time and in such manner as may be\nprescribed; and\n(d)       furnish to the State Bank such particulars with regard to accounts and other\nrecords as the State Bank may from time to time require.\n(3) The State Bank, or any officer duly authorized by it in this behalf, may at all reasonable\ntimes inspect the books of account and other records of a microfinance institution, the securities, cash\nand other properties held by such institution, and all documents relating thereto."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Liquidity and reserves",
      "content": "_ (1) A microfinance institution shall maintain investment in\nliquid assets, i.e. cash, gold and unencumbered approved securities, valued at a price not exceeding\nthe lower of the cost and the current market price, which shall not at the close of business on any day\nbe less than such percentage of the total of its time and demand liabilities, as may be notified by the\nstate bank from time to time:\n1\nSubs. by the Finance Act, 2006 (3 of 2006),s.18 for “fullstop”.\n2\nProviso added ibid.\nProvided that the state bank may separately specify the applicable percentage either in general\nor in relation to any class of microfinance institution in particular.\nExplanation.__ (1) For the purpose of this section, the expression “unencumbered approved\nsecurities of a microfinance institution lodged with another microfinance institution or institution for\nan advance or any other credit management to the extent to which such securities have not been drawn\nagainst or availed of, and the expression “ liabilities” shall not include the paid up capital or reserves\nor any credit balance in the profit and loss account of the microfinance institution or any such\nliabilities as may be notified by the state bank for the purposes of this section.\nb) In computing the amount provided for in clause (a) any balances maintained in Pakistan\nby a microfinance institution in a current account with the State Bank or its agent or both 1* * *\nshall be deemed to be cash maintained.\n2\n[(c) The State Bank shall monitor the liquidity position through such returns and systems as\nmay be prescribed by it from time to time.].\n3\n[(2) A microfinance bank shall maintain by way of cash reserve in cash in current account,\nopened with the State Bank or its agent, a sum equivalent to five per cent of its deposits or such\npercentage as State Bank may from time to time notify. The State Bank shall monitor the reserve\nposition through such returns and systems as may be prescribed by it from time to time.]\nExplanation.__ For the purpose of this section the expression “liabilities” shall not include the\npaid up capital, the reserves or any credit balance in the profit and loss account of a microfinance\ninstitution, the amount of any loan taken from the state bank and the amount received as loan in\nPakistan currency by a microfinance institution from the Federal Government out of a foreign\ncurrency loan contracted by the Government or the amount of foreign currency loans obtained by the\nmicrofinance institution directly from any foreign agency but should include the amount of any\nother rupee loan taken from the Federal Government.\n(3) A microfinance institution shall create and maintain a Statutory Reserve Fund to which\nshall be credited each year, a sum equivalent to such percentage of its aftertax profit as may be\nprescribed. No appropriation from the Statutory Reserve Fund shall be made without prior written\napproval of The State Bank. A microfinance institution shall also create other reserves as required\nby the State Bank from time to time."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Depositors’ protection fund",
      "content": "_ (1) A microfinance institution shall, as required by the\nstate bank, establish and maintain depositors’ protection fund or scheme for the purpose of providing\nsecurity or guarantee to persons depositing money in such institution.\n(2) Five per cent of the annual after tax profits of a microfinance institution and profits\nearned on the investments of the fund shall be credited to the depositors’ protection fund and such\nfund shall either be invested in Government securities or deposited with State Bank in a remunerative\naccount.\n1 The certain words omitted by the Finance Act, 2006 (3 of 2006),s.18.\n2 Subs. by Act.3 of 2006, s.18, for “paragraph (c)”.\n3 Subs. ibid., for “sub-section (2)”.\n(3) The depositors’ protection fund shall be used to make payment to the individual depositors\nwith aggregate deposits of up to ten thousand rupees in case of liquidation of the microfinance\ninstitution.\n(4) The depositors’ protection fund shall be operative with effect from the expiry of five years\nfrom the date of first Annual Balance Sheet of the microfinance institution and shall remain\nunencumbered at all times."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Power to call for information. Where it appears to the state bank that a person is carrying",
      "content": "on the business of a microfinance institution in contravention of section 4, the state bank may,__\n(a)     direct such person or any other person who is, or has at any time, been dealing,\ndoing business or associating in any manner with such person, to give or\nfurnish to the State Bank within a specified period such books, accounts,\ninformation, documents or records relating to such microfinance institution’s\nbusiness as may be within the custody, possession or control of such person;\n(b)     authorize any person to enter and search any premises and seize books,\naccounts or other documents or records relating to such business;\n(c)     inspect and examine any of the books, accounts, documents or records referred\nto in clause (a); and\n(d)     exercise as far as may be applicable the powers conferred on the State Bank\nunder section 22."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Inspection and investigation",
      "content": "_ (1) The state Bank may, at any time, inspect books of\naccounts and records of any microfinance institution to evaluate its financial viability and may, of its\nown or on recipt of complaint investigate the affairs of such institution.\n(2) The inspection or investigation shall be carried out by such officer of the State Bank\nor by such other person as the State Bank may authorize.\n(3) It shall be the duty of every officer and employee of a microfinance institution or any other\nperson dealing with or connected with the operations of the microfinance institution to produce to\nany officer, making an inspection or investigation under this section, hereafter in this section called\nthe inspecting officer, all such books, accounts and other documents in his custody or power and to\nfurnish him with such statements and information relating to the affairs of the microfinance institution\nwithin such time as the inspecting officer may require.\n(4) The inspecting officer may examine on oath any officer or employee of the\nmicrofinance institution in relation to its business and may administer an oath accordingly.\n(5) The State Bank shall supply to the microfinance institution a copy of its report on the\ninspection made under this section.\n(6) The State Bank shall systematically monitor and evaluate the performance of a\nmicrofinance institution to ensure that it is complying with the applicable criteria and prudential rules\nand regulations:\nProvided that if any officer or any employee fails to produce any books of account or other\ndocuments or to furnish any statement or information which under sub-section (3) it is his duty to\nproduce or furnish or to answer correctly any question relating to the business of the microfinance\ninstitution which he is asked by an inspecting officer, such officer or employee shall be liable\nto fine as the State Bank may determine to be recovered from the salary of such officer or employee\nand, in the event such failure persists, the State Bank may order removal of such officer or employee\nand the microfinance institution shall comply with such order forthwith."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Powers to give directions",
      "content": "_ (1) Where the State Bank is satisfied that,\n(a)        in the public interest; or\n(b)        to prevent the affairs of a microfinance institution being conducted in a manner\ndetrimental to the interest of the depositors or in a manner prejudicial to the\ninterest of a microfinance institution; or\n(c)        in furtherance of monetary or financial sector policy; or\n(d)        to secure the proper management of a microfinance institution, it is necessary\nto issue directions to microfinance institutions generally or to any microfinance\ninstitution in particular, it may, from time to time, issue such directions as it\nmay deem fit and the microfinance institutions or the microfinance institution,\nas the case may be, shall comply with such directions.\n(2) The State Bank may, on representation made to it or of its own motion, modify or cancel\nany direction issued under sub-section (1), and in so modifying or canceling any direction may impose\nsuch condition, as it thinks fit, subject to which the modification or cancellation shall have effect.\n1\n[22A. Power of the State Bank to remove Directors or other managerial persons from\noffices. (1) Where the State Bank is satisfied that__\n__\n(a)      association of any chairman or director or chief executive by whatever name\ncalled or other officer of a microfinance bank not being lower in rank than a\nbranch manager, is or is likely to be detrimental to the interests of the\nmicrofinance bank or its depositors or is otherwise undesirable; or\n(b)        in the public interest; or\n(c)        to prevent the affairs of a microfinance bank being conducted in a manner\ndetrimental to the interest of its depositors or in a manner prejudicial to the\ninterests of the microfinance bank; or\n1New section 22A, 22B, 22C ins. by the Finance Act, 2006 (3 of 2006), s.18\n(d)     to secure the proper management of any microfinance bank, it is necessary\nso to do; the State Bank may, for reasons to be recorded in writing, by order,\nremove from office, with effect from such date as may be specified in the\norder, any chairman or director or chief executive officer by whatever name\ncalled or other officer of the microfinance bank.\n(2) No order under sub-section (1) shall be made unless the chairman or director or chief\nexecutive or other officer has been given a reasonable opportunity of making a representation to the\nState Bank against the proposed order:\nProvided that if, in the opinion of the State Bank, any delay shall be detrimental to the public\ninterest or the interest of the microfinance bank or its depositors, the State Bank may, at the time of\ngiving the opportunity aforesaid or at any time thereafter and pending the consideration of\nthe representation aforesaid, if any, by order direct that-\n(a)     the chairman or, as the case may be, director chief executive officer or other\nofficer, shall not, with effect from the date of the order,—\n(i)    act as such chairman or director or chief executive or other officer\nof the microfinance bank; or\n(ii)   in any way, whether directly or indirectly, be concerned with, or\ntake part in the management of the micro finance bank; and\n(b)     any person authorized by the state bank in this behalf shall act as such\nchairman or director or chief executive of the microfinance bank\n(3) Where any order under sub-section (1) is made in respect of a chairman, director, chief\nexecutive or other officer of a microfinance bank, he shall forthwith cease to be a Chairman or, as the\ncase may be, a director chief executive officer or other officer of the microfinance bank and shall\nnot in any way, whether directly or indirectly, be concerned with, or take part in, the management\nof the microfinance bank or any other microfinance bank for such period not exceeding three years\nas may be specified in the order.\n(4) Any person appointed as chairman director or chief executive officer under sub-section\n(2) shall—\n(a)     hold office during the pleasure of the State Bank subject to such conditions as\nmay be specified in the order of his appointment and, subject thereto, for\nsuch period, not exceeding three years as the State Bank specify in such order;\nand\n(b)     not incur any obligation or liability for anything, which is done or intended to\nbe done in his capacity as such chairman, director or chief executive.\n(5) No person removed from office under sub-section (1) shall be entitled to claim any\ncompensation for the loss or termination of office."
    },
    {
      "provision_ref": "sec22b",
      "section": "22B",
      "title": "Section 22B. Power of the state Bank to supersede Board of Directors of microfinance banks",
      "content": "_\n(1) Where the state Bank is satisfied that__\n(a)     the association of the Board of Directors, by whatever name called, of a\nmicrofinance bank, is or is likely to be detrimental to the interests of the\nmicrofinance bank or its depositors or otherwise undesirable; or\n(b)     for all or any of the reasons mentioned in sub-section (1) of section 22A, it is\nnecessary so to do, the State Bank may, for reasons to be recorded in writing,\nby order, supersede the Board of Directors of a microfinance bank with effect\nfrom such date and for such period as may be specified in the order.\n(2) The period of supersession specified in an order under sub-section (1) may from time to\ntime be extended by the State Bank and the total period of supersession shall in no case exceed three\nyears.\n(3) All orders and duties of the Board of Directors shall, during the period of supersession,\nbe exercised and performed by such persons as the State Bank may from time to time appoint in\nthis behalf\n(4) The provisions of sub-sections (2), (3), (4), and (5) of section 22A shall, apply to an\norder made under sub-section (1) or sub-section (3)."
    },
    {
      "provision_ref": "sec22c",
      "section": "22C",
      "title": "Section 22C. Limitations.___ (1) No order under section 22A or section 22B",
      "content": "shall be made except\nby the governor of the state bank on a report by a standing committee set up by the state bank for the\npurpose.\n(2) Any person or micro finance bank aggrieved by an order made by the Governor of the\nState Bank under section 22A or section 22B may make an appeal to the Central Board of Directors\nof the State Bank whose decision shall be final.\n(3) No action taken under section 22A or section 22B or sub-section (2) shall be called\nin question by or before any court, tribunal or other authority"
    },
    {
      "provision_ref": "sec22d",
      "section": "22D",
      "title": "Section 22D. Prosecution of directors, chief executive officers or other officers. Notwithstanding",
      "content": "anything contained in section 22A the State Bank may direct prosecution of a director or chief\nexecutive officer by whatever name called or other officer who, in its opinion, has knowingly acted\nin the manner causing loss of depositors’ money or of the income of the microfinance bank.\nExplanation.__ For the purpose of this section a director chief executive officer or other officer\nshall be deemed to have acted knowingly if he has departed from established banking practices and\nprocedures or circumvented the regulations or related restrictions laid down by the State Bank of\nPakistan from time to time.]"
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Penalties",
      "content": "_ (1) Whoever carries on the business of a microfinance institution without\nhaving been licensed to do so or who carries on such business after the license therefore has been\nsuspended or cancelled shall be punished with imprisonment for a term which shall not be less than\nfive years.\n(2) Any person who willfully withholds or fails to deliver any document or information\nor makes a statement in any return, balance sheet or other document or in any information required\nor furnished under, or for the purpose of any provision of, this Ordinance which to the\nknowledge of such person is false in any material respect, shall be punishable with imprisonment for\na term which may extend to one year, or with fine which may extend to one hundred thousand rupees,\nor with both.\n(3) Any person who contravenes any other provision of this Ordinance or does not comply\nwith any requirement of this Ordinance or any rule, regulation, order, instruction, condition made,\ngiven or imposed hereunder shall be liable to such fine as the State Bank may, from time to time\ndetermine.\n(4) If any officer of a microfinance institution, mismanages the affairs of the microfinance\ninstitution or misuses his position for gaining direct or indirect benefit for himself or any of his family\nmembers, he shall be punishable with imprisonment for a term which may extend to three years and\nshall also be liable to fine which may extend to one hundred thousand rupees, and shall be ordered,\nby the court trying the case, to deliver or refund within a time to be fixed by the court any property\nacquired or gained by him in his own name or in the name of his family members by using his\nposition or, in default, to suffer further imprisonment for a term which may extend to six years.\n(5) A microfinance institution, which fails to maintain liquid assets and reserves in accordance\nwith the provisions of this Ordinance, shall be punished with a fine equivalent to one per cent of the\nshortfall for every day in which the failure occurs."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Continuance of charge and priority",
      "content": "Where a charge over any property has been,\nor is, created by any person in favour of a microfinance institution to secure any of the services\nextended by the microfinance institution to such person, such charge shall continue to remain valid\nand shall maintain its priority in favour of the microfinance institution against all charges created by\nsuch person in favour of any other person subsequent to the original date of registration of such\ncharge."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Restrictions on removal of records and documents",
      "content": "No microfinance institution shall\nremove from the specified area, to a place outside the specified area, any of its records and documents\nrelating to its business without the prior permission in writing of the State Bank.\nExplanation.__ In this section the expression “records” includes ledgers, day books, cash\nbooks, books of accounts, and all other books, maintained either on paper books or on electronic or\nmagnetic devices, used in the business of a microfinance institution; and the expression “document”\nincludes vouchers, cheques, bills, pay orders, securities for advances and any other documents\nsupporting entries in the books of accounts, or claims by or against, a microfinance institution.\n1\n[26A. Declaration of fidelity and secrecy.—(1) Every member, director, auditor and staff\nmember of the microfinance bank shall, before entering upon his office and performance of duties,\nmake a declaration of fidelity and secrecy in the form as State Bank may prescribe.\n1\nNew section 26A ins. by the Finance Act, 2006 (3 of 2006),s.18.\n(2) Whoever contravenes the declaration of fidelity and secrecy shall be punishable with\nimprisonment for a term which may extend to six months, or with fine which may extend to one\nhundred thousand rupees, or up to the extent of loss caused, whichever is higher, or with both."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. False information. Whoever in any application for obtaining assistance or in any balance",
      "content": "sheet, statement of profit and loss, declaration or any other document submitted to the microfinance\ninstitution for the purpose of obtaining any financial aid sought or granted under this Ordinance, willfully\nmakes false statement or knowingly permits any false statement to be made or to remain, or uses or\npermits to be used any financial facility for any purpose other than that for which it is granted by\nthe microfinance institution shall be punishable with imprisonment for a term which may extend to six\nmonths, or with fine which may extend to one hundred thousand rupees, or with both."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Cognizance of offences",
      "content": "(1) No court shall take cognizance of an offence under this\nordinance except on complaint in writing made by an officer of the state bank authorized in this behalf.\n(2) Notwithstanding anything in the code of criminal procedure, 1898, (Act V of 1898),__\n(a)        no court other than that of a Judicial Magistrate of the first class shall try an\noffence under this Ordinance; and\n(b)        it shall be lawful for the Judicial Magistrate to pass any sentence authorized by\nthis Ordinance."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Indemnity",
      "content": "_ No suit or other legal proceeding shall lie against the federal by government,\nthe state bank or nay officer of the federal government or the state bank for anything which is in good faith\ndone, or intended to be done, under this ordinance or of any rules, regulations or orders made there under."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Power to make rules",
      "content": "_ (1) the state bank may, with the approval of the federal government,\nby notification in; the official Gazette, make rules for carrying out the purposes and provisions of this\nordinance.\n1\n*       *          *          *          *          *      *"
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Power to make regulations. The State Bank may make regulations, not inconsistent with the",
      "content": "provisions of this Ordinance and the rules, to provide for all matters for which provision is necessary or\nexpedient for the purpose of giving effect to the provisions of this Ordinance and efficient conduct of\nthe affairs of a microfinance institution."
    }
  ],
  "definitions": [
    {
      "term": "auditor",
      "definition": "any person who is appointed in accordance with the provisions of this Ordinance for the audit of the accounts of a microfinance institution;",
      "source_provision": "sec2"
    },
    {
      "term": "Banking Companies Ordinance",
      "definition": "the Banking Companies Ordinance, 1962 (LVII of 1962);",
      "source_provision": "sec2"
    },
    {
      "term": "company",
      "definition": "a company incorporated under the Companies Ordinance, 1984 (XLVII of 1984), or any other law for the time being in force;",
      "source_provision": "sec2"
    },
    {
      "term": "customer",
      "definition": "any person or group of persons availing the services of a microfinance institution;",
      "source_provision": "sec2"
    },
    {
      "term": "deposit",
      "definition": "the deposit of money, repayable on demand or otherwise, accepted by a microfinance institution from the public for the purpose of providing microfinance services;",
      "source_provision": "sec2"
    },
    {
      "term": "depositor",
      "definition": "a person in whose name a deposit is held by a microfinance institution;",
      "source_provision": "sec2"
    },
    {
      "term": "license",
      "definition": "the license issued by the State Bank and the expression “licensed” should be construed accordingly;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "the member or shareholder who has contributed or subscribed to the capital of a microfinance institution; 1 [(i) “microfinance institution” means an institution, which extends micro credit and allied services to the poor through sources other than public savings and deposits]; 1 [(ia) “microfinance bank” means an institution licensed by State Bank under this Ordinance to establish and operate as microfinance bank;]",
      "source_provision": "sec2"
    },
    {
      "term": "microfinance services",
      "definition": "the financial and other related services specified in section 6, the value of which does not exceed such amount as the State Bank may, from time to time, determine;",
      "source_provision": "sec2"
    },
    {
      "term": "poor persons",
      "definition": "persons who have meager means of subsistence and whose total income during a year is less than such minimum limit as the State Bank may, from time to time, prescribe;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules [and regulations] made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "specified area",
      "definition": "the district, province or other specified area within which a microfinance institution is licensed to operate; and",
      "source_provision": "sec2"
    },
    {
      "term": "State Bank",
      "definition": "the State Bank of Pakistan established under the State Bank Act, 1956 ( XXXIII of 1956).",
      "source_provision": "sec2"
    }
  ]
}
