{
  "id": "pk-mines-act-1923",
  "type": "statute",
  "title": "Mines Act, 1923",
  "title_en": "Mines Act, 1923",
  "short_name": "Mines Act, 1923",
  "status": "in_force",
  "issued_date": "1923-02-22",
  "in_force_date": "1923-02-22",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apya-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Mines Act, 1923 (IV of 1923) published by The Pakistan Code (Labour Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title extent and commencement.⸻(1) This Act may be called the 3* Mines Act",
      "content": "1923.\n4\n[(2) It extend to the whole of Pakistan.]\n(3) It shall come into force on the first day of July, 1924."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. [Saving the Regulation XII of 1887]",
      "content": "Omitted by para, 3 and Sch I of the Government\nof India (Adaptation of Indian Laws) Order, 1937."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Definitions",
      "content": "In this Act unless there is anything repugnant in the subject or context,⸻\n(a)        “agent”, When used in relation to a mine. Means any person appointed or\nacting as the representative of the owner in respect of the management of the\nmine or of any part thereof, and as such superior to a Manager under this Act;\n5\n[(aa) appropriate Government means in relation to mines of 6[nuclear substances\nmineral oil, natural gas and liquids, and substances declared by Federal Law\nto be dangerously inflammable oil fields and gas fields the 7[Federal\nGovernment] and in relation to other mines the Provincial Government;].\n1\nThis act has been applied to the Provincially Administered Tribal Areas or to the parts of those areas to which it does not already apply, see\nRegulation No. 1 of 1972, s. 2 and Sch.\n2\nThis Act has been extended to:⸻\n(i)         the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950), and applied in the\nFederated Areas of Baluchistan, see Gazette of India, 1937 Pt. I p. 1499;\n(ii)        the Baluchistan States Union, see the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G.G.O. 4 of\n1953), as amended by the Baluchistan States Union (Federal Laws) (Extension) (Second Amdt.) Order, 1953\n(G.G.O. 19 of 1953);\n(iii)       the Khairpur State, see G.G.O. 5 of 1953, as amended by G.G.O. 24 of 1953;\n(iv)        the State of Bahawalpur by the Bahawalpur (Extension of Federal Laws) Order, 1953 (G.G.O. 11 of 1953) as amended by the\nBahawalpur (Extension of Federal Laws) (Amdt.) Order, 1953 (G.G.O. 21 of 1953).\nThe Act has been and shall be deemed to has been brought into force in Gwadur with effect from the 8th September, 1958, by the Gwadur\n(Application of Central Laws) Ordinance, 1960 (XXXVII of 1960) s. 2.\nThis Act has been applied to the Provincially Administered Tribal Areas or to the parts of those areas to which it does not already apply, see\nRegulation No. 1 of 1972, s. 2 and Sch. also applied to FATA, SRO 220 (1)/2000, dated 21-4-2000.\n3\nThe word “Indian” omitted by A.O., 1949.\n4\nSubs. by the Central Laws (Statue Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for\nsub-section (2), as amended by A.O., 1949, and the Federal Laws (Revision and Declaration) Act, 1951 (XXVI of 1951), s. 8.\n5\nClause (aa) ins. by A.O., 1961, Art. 2 and Sch., (with effect from the 23rd March, 1956), has been subs. by A.O., 1964, Art. 2 and Sch.\n6\nSubs. by F.A.O., 1975, Art. 2 and Sch., for “nuclear substances, oilfields and gasfield”.\n7\nSubs. ibid., Art. 2 and Table, for “Central Government”.\n(b)         Chief Inspector means the Chief Inspector to Mines appointed under this Act;\n1\n[(c)    Child means a person who has not completed his fifteenth year;]\n2\n[(cc)   day means a period of twenty-four hours beginning at midnight;]\n3\n[*       *          *          *             *   *          *]\n(d)         a person is said to be “employed” in a mine who works under appointment by\nor with the knowledge of the manager, whether for wages or not, in any\nmining operation, or in cleaning or oiling any part of any machinery used in or\nabout the mine, or in any other kind of work whatsoever incidental to, or con-\nnected with, mining operations;\n(e)         “Inspector” means an inspector of Mines appointed under this Act, and\nincludes a District Magistrate when exercising any power or performing any\nduty of an inspector which he is empowered by this Act to exercise or\nperform;\n(f)         “mine” means any excavation where any operation for the purpose of\nsearching for or obtaining minerals has been or is being carried on, and\nincludes all works, machinery, tramways and sidings, whether above or blow\nground, in or adjacent to or belonging to a mine:\nProvided that it shall not include any part of such premises on which a manufacturing process\nis being carried on unless such process is a process for coke making or the dressing of:\n(g)         “owner” when used in relation to a mine, means say person who is the\nimmediate proprietor or lessee or occupier of the mine or of any part thereof,\nbut does not include a person who merely receives a royalty, rent or fine from\nthe mine or is merely the proprietor of the mine subject to any lease, grantor\nlicense for the working thereof, or is merely the owner of the soil and not\ninterested in the minerals of the mine but any contractor for the working of a\nmine car any like part thereof shall be subject to this Act ifs manner as it he\nwere ear owner, but not so as to exempt the owner from any liability;\n(h)         “prescribed” means prescribed by regulations, ruler or bye laws;\n(i)         “qualified medical practitioner” means any person registered 4[* * *] under\nany Act of 5[the Central Legislature or any Provincial Legislature], providing\nfor the maintenance of a register of medical practitioners, and includes, in any\narea where no such last-mentioned Act is in force, any person declared by the\n6\n[appropriate Government] by notification in the 7[official Gazette], to be a\nqualified medical practitioner for the purposes of this Act;\n1\nSubs. by the Indian Mines (Amdt.) Act, 1935 (V of 1935), s. 2. for the original clause (c).\n2\nClause (cc) ins., ibid\n3\nClause (ccc), omitted by A.O., 1949.\n4\nCertain words omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch. II.\n5\nSubs. by A.O., 1949, for “any Legislature in British India”.\n6\nSubs. by A.O., 1964, Art. 2 and Sch., for “Central Government”, which had been subs. by A.O., 1937, for “Local Government”.\n7\nSubs. by A.O., 1937, for “local official Gazette”.\n(j)         “regulations”, “rules” and “bye-laws” means respectively., regulations, rules\nand bye-laws under this Act ;\n1\n[(jj)   where work of the same kind is carried out by two or more sets of workers\nworking during different periods of the day each of such sets is called a ‘relay’\n2\n[and the period for which it works is called a ‘shift’];\n(k)         “serious bodily injury” means any injury which involves, or in all probability\nwill involve, the permanent loss of the use of, or permanent injury to any\n3\n[part of the body], or the permanent logs of or injury to the sight or hearing,\nor the fracture of any 3[part of the body] or the enforced absence of the injured\nperson from work for a period exceeding twenty days; and\n(l)         “week” means the period between midnight on Saturday night and midnight\non the succeeding Saturday night."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Chief Inspector and Inspectors",
      "content": "(1) The 4[appropriate Government] easy, by\nnotification in the 5[Official Gazette], appoint a duly qualified person to be Chief Inspector of Mines\nfor the whole of 6[Pakistan] 7[or, for the Province as the case may be], and duly qualified persons to\nbe Inspectors of Mines subordinate to the Chief Inspector.\n(2) No person shall be appointed to be Chief Inspector or an Inspector, or having been\nappointed shall continue to hold such office who is or becomes directly or indirectly interested in any\nmine or mining rights in 8[Pakistan].\n(3) The District Magistrate may exercise the powers and perform the duties of an Inspector\nsubject to the general or special orders of the 9[appropriate Government]:\nProvided that nothing in this sub-section shall be deemed to empower a District Magistrate to\nexercise any of the powers conferred by section 19 or section 33.\n(4) The Chief Inspector and every Inspector shall be deemed to be a public servant within the\nmeaning of the Pakistan Penal Code (XLV of 1860)."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Functions of Inspectors.⸻(1) The Chief Inspector may, by order in writing prohibit or",
      "content": "restrict the exercise by any Inspector named, or any class of Inspectors specified, in the order of any\npower conferred on Inspectors by this Act, and shall, subject as aforesaid, declare the local area or\nareas within which, or the group or class of mines with respect to which, Inspectors shall exercise\ntheir respective powers.\n1\nCl. (jj) was ins. by the Indian Mines (Amdt.) Act, 1935 (V of 1935),s.2.\n2\nAdded by the Mines (Amdt.) Act 1973 (XLV of 1973), s. 2.\n3\nSubs. ibid., s. 2,for “limb”.\n4\nSubs. by A.O., 1964, Art. 2 and Sch., for “Central Government”, which had been subs. by A.O., 1937, for “Governor General in Council.”.\n5\nSubs. A.O., 1937, for “Gazette of India”.\n6\nSubs. by the Central Laws (Statue Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for\n“the Provinces and the Capital of the Federation”, which had been subs. by A.O., 1949, for “British India”.\n7\nIns. by A.O., 1964, Art. 2 and Sch.\n8\nSubs. by the Federal Laws (Revision and Declaration)Act, 1951 (XXVI of 1951), s. 4 and III Sch., for “India”.\n9\nSubs. by A.O., 1964, Art. 2 and Sch., for “Central Government” which had been subs. by A.O., 1937, for “Local Government”.\n(2) The Inspector shall give information to owners, agents and managers of mines situate\nwithin the local area or areas or belonging to the group or class of mines, in respect of which he\nexercises powers under sub-section (1) as to all regulations and rules which concern them\nrespectively and as to the places where copies of such regulations and rules may be obtained."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Powers of Inspectors of Mines",
      "content": "The Chief Inspector and any Inspector may⸻\n(a)         make such examination and inquiry as he thinks fit in order to ascertain\nwhether the provisions of this Act and of the regulations, rules and bye-laws\nand of any orders made thereunder are observed in the case of any mine ;\n(b)         with such assistant (if any) as he thinks fit, enter, inspect and examine any\nmine or any part thereof at 1[* * *] ;\n(c)        examine into, and make inquiry respecting, the state and condition of any mine\nor any part thereof, the ventilation of the mine, the sufficiency of the bye-laws\nfor the time being in force relating to the mine and all matters and things\nconnected with or relating to the safety, 2[health and welfare] of the persons\nemployed in the mine ;\n3\n[(d)    take, whether on the precincts of the mine or elsewhere, statement of any\nperson which he may consider necessary for carrying out the purposes of this\nAct;\nProvided that no one shall be required under this section to answer or give any evidence\ntending to criminate himself ;\n(e)         require the production of any books, register or other documents, the keeping\nof which is prescribed in order to see that they are in conformity with the the\nprovisions of this Act and rules and regulations framed thereunder and take\ninto his custody, or make copies of, or extracts from, any such book register or\nother document;\n(f)         after informing the manager of a mine or his representative, take or remove,\nfor the purpose of analysis samples of materials and substances used or\nhandled in the mine]."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Powers of special officer to enter, measure, etc",
      "content": "Any person in the service of the\n4\n[State] duly authorised by a special order in writing of the Chief Inspector or of an Inspector in this\nbehalf may, for the purpose of surveying, levelling or measuring in any mine, after giving not less\nthan three days' notice to the manager of such mine, enter the mine and may survey, level or treasure\nthe mine or any part thereof at any reasonable time by day or night, but not so as unreasonably to\nimpede or obstruct the working if the mine 5[:]\n1\nCertain words omitted by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 3.\n2\nIns. ibid.,\n3\nAdded ibid.,\n4\nSubs. by A.O., 1961, Art. 2 and Sch. (with effect from the 23rd March, 1956), for “Crown”, which had been subs. by A.O., 1937, for\n“Government”.\n5\nSubs. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 4, for full stop.\n1\n[Provided that no such notice need be given if, for reasons to be recorded, the Chief\nInspector or Inspector is of opinion that there is an emergency.]"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Facilities to be afforded to Inspectors",
      "content": "Every owner agent and manager of a mine shall\nafford the Chief inspector and every Inspector and every person authorised under section I all\nreasonable facilities or making any entry, inspection, survey, measurement, examination or inquiry\nunder this Act."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Secrecy of information obtained.⸻(1) All copies of, and extracts from, registers or other",
      "content": "records appertaining any mine, and all other information acquired by the Chief Inspector of an\nInspector or by any one assisting him, it the course of the inspection of any spine under this Act or\nacquired lay any person authorised under section 7 in the exercise of his duties thereunder, shall he\nregarded as confidential, 2[and shall not he disclosed to any person tuber than a Magistrate 3[or a\nCommissioner for Workmen’s Compensation appointed under the Workmen’s Compensation Act,\n1923 (VIII of 1923) or an official superior or the owner, agent or manager of the mine concerned,\nunless the Chief inspector or the Inspector considers disclosure necessary to ensure the or with the\nsafety of any persons].\n(2) If the Chief Inspector, or an Inspector, or any other persona referred to in sub-section (1)\ndiscloses 4[contrary to the provisions of sub-section (1)] any such information at aforesaid without\nthe consent of 5[the appropriate Government], he shall be guilty of a breach of official trust., and\nshall lie punishable 6[with imprisonment for a term which may extend to one year, or with fine or\nwith both].\n(3) No court shall proceed to the trial of any offence, under this section 7[except with the\nprevious sanction of the 8[appropriate Government]].\n9[9A. Secrecy of source of compliant.—The Chief Inspector or an Inspector shall treat as\nabsolutely confidential the source of any complaint bringing to his notice a defect or breach of any\nprovision of this Act or any rules or regulations made thereunder and shall not give any intimation to\nthe owner of the mine or his representative that a visit of inspection was made in consequence of the\nreceipt of such a complaint.]\nMINING BOARDS, AND COMMITTEE"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Mining Board.⸻(1) The 8[appropriate Government] may constitute 10[for any part of",
      "content": "Pakistan] 11[or, as the case may be, of the Province], or for any group or class of mines 12[* * *] , a\nMining Board consisting of⸻\n1\nProviso added ibid.,\n2\nAdded by the Indian Mines (Amdt.) Act, 1937 (XXIX of 1937),s. 3.\n3\nIns. by Act XLV of 1973, s. 5.\n4\nSubs. by the Mines (Amdt.) Act 1973 (XLV of 1973)s. 5 for “to any one, other than a Magistrate or an officer to whom he is subordinate”.\n5\nThe original words “the G.G. in C. or the L.G.”, were first subs. by A.O., 1937, and then amended by A.O., 1964, Art. 2 and Sch., to read as\nabove.\n6\nSubs. by the Repealing and Amending Act, 1925 (XXXVII of 1925), s. 2 and Sch. I, for “in the manner provided by section 4 of the Indian\nOfficial Secrets Act, 1889”.\n7\nSubs. by Act XXIX of 1937, s. 3, for the original words as amended by A.O., 1937.\n8\nSubs. by A.O., 1964, Art. 2 and Sch., for “Central Government” which had been subs. by A.O., 1937, for \"Local Government\".\n9\nIns. by Act XLV of 1973,s.6.\n10\nThe original words “for the province, or for any part of the province” were first subs. by A.O., 1937 and then amended by A.O., 1949, and\nabove.\n11\nIns. by A.O., 1964, Art. 2 and Sch.\n12\nThe words “in the province” were rep. by A.O., 1937.\n(a)        a person in the service of 1[the State], not being the Chief Inspector or an\nInspector, nominated by the 2[appropriate Government] to act as Chairman ;\n(b)        the Chief Inspector or an Inspector;\n3\n[(c)   a person, not being the Chief Inspector or an Inspector, nominated by the\n2\n[appropriate Government ];]\n(d)        two persons nominated by owners of mines or their representatives in such\nmanner as may be prescribed ;\n4\n[(e)   two persons to represent the interest of miners, who shall be nominated in\naccordance with the following provisions :—\n(i)         if there are one or more registered trade unions having in the\naggregate as members not less than one quarter of the miners, the said\npersons shall be nominated by such trade union or trade unions in such\nmanner as may be prescribed ;\n(ii)      if sub-clause (i) is not applicable and there are one or more registered\ntrade unions having in the aggregate as members not less than 1,000\nminers, one of the said persons shall be nominated by such trade union\nor trade unions in such manner as may be prescribed and the other by\nthe 2[appropriate Government] ;\n(iii)       if neither sub-clause (i) nor sub-clause (ii) is applicable, the said\npersons shall be nominated by the 2[appropriate Government].\nExplanation. ⸻ In this clause ‘miner’ means a person employed otherwise than in a position\nof supervision or management, in any of the mines for which the Mining Board is constituted.]\n(2) The chairman shall appoint a person to act as secretary to the Board.\n(3) The 2[appropriate Government] may give directions as to the payment of travelling\nexpenses incurred by the secretary or any member of any such Mining Board in the performance of\nhis duty as such secretary or member."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Committees.⸻(1) Where under this Act any question relating to a mine is referred to a",
      "content": "Committee, the Committee shall consist of⸻\n(a)        a chairman nominated by the 2[appropriate Government] or by such officer or\nauthority as the 2[appropriate Government] may authorise in this behalf;\n(b)        a person nominated by the chairman and qualified by experience to dispose of\nthe question referred to the Committee; and\n1\nThe original words “the Government”, were first subs. by the Indian Mines (Amdt) Act, 1940 (XXIV of 1940), s. 2 and then\namended by A.O., 1961, Art. 2 and Sch. (with effect from the 23rd March, 1956), to read as above.\n2\nSubs. by A.O., 1964, Art. 2 and Sch., for “Central Government” which had been subs. by A.O., 1937, for \"Local Government\".\n3\nSubs. by the Indian Mines (Amdt.) Act, 1935 (V of 1935), s. 3, for the original clause. (c).\n4\nClause (e) and the Explanation added, ibid. by the Indian Mines (Amdt.) Act, 1935 (V of 1935), s. 3.\n(c)       two persons of whom one shall be nominated by the owner, agent or manager\nof the mine concerned, and the other shall be nominated by the 1[appropriate\nGovernment] to represent the interests of the persons employed in the mine.\n(2) No Inspector or person employed in or in the management of any mine concerned shall\nserve as chairman or member of a Committee appointed under this section.\n(3) Where an owner, agent or manager fails to exercise his power of nomination under clause\n(c) of sub-section (1), the Committee may, not with standing such failure, proceed to inquire into and\ndispose of the matter referred to it.\n(4) The Committee shall hear and record such information as the Chief Inspector or the\nInspector, or the owner, agent or manager of the mine concerned, may place before it, and shall\nintimate its decision to the Chief Inspector or the Inspector and to the owner, agent or manager of the\nmine, and shall report its decision to the 1[appropriate Government.]\n(5) On receiving such report the 1[appropriate Government] shall pass orders in conformity\ntherewith unless the Chief Inspector or the owner, agent or manager of the mine has lodged an\nobjection to the decision of the Committee, in which case the 1[appropriate Government] may\nproceed to review such decision and to pass such orders in the matter as it may think fit. If an\nobjection is lodged by the Chief Inspector, notice of the same shall forthwith be given to the owner,\nagent or manager of the mine.\n(6) The 1[appropriate Government] may give directions as to the remuneration, if any, to be\npaid to the members of the Committee or any of them, and as to the payment of the expenses of the\ninquiry including such remuneration."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Powers of Mining Boards.⸻(1) Any Mining Board constituted under section 10 and any",
      "content": "Committee constituted under section 11 may exercise such of the powers of an Inspector under this\nAct as it thinks necessary or expedient to exercise for the purpose of deciding or reporting upon any\nmatter referred to it.\n(2) Every Mining Board constituted under section 10 and every Committee appointed under\nsection 11 shall have the powers of a Civil Court under the Code of Civil Procedure, 1908 (V of\n1908) for the purpose of enforcing the attendance of witness and compelling the production of\ndocuments and material objects ; and every person required by any such Mining Board or Committee\nto furnish information before it shall be deemed to be legally bound to do so within the meaning of\nsection 176 of the Pakistan Penal Code (XLV of 1960)."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Recovery of expenses",
      "content": "The 1[appropriate Government] may direct that the expenses of\nany inquiry conducted by a Mining Board constituted under section 10 or by a Committee appointed\nunder section 11 shall be borne in whole or in the part by the owner or agent of the mine concerned,\nand the amount so directed to be paid may, on application by the Chief Inspector or an Inspector to a\nMagistrate having jurisdiction at the place where the mine is situated or where such owner or agent is\nfor the time being resident, be recovered by the distress and sale of any movable property within the\nlimits of the Magistrate's jurisdiction belonging to such 2[owner or agent].\n1\nSubs. by A.O., 1964, Art.2 and Sch., for \"Central Government\"., which had been subs. by A.O., 1937, for \"Local Government\".\n2\nSubs. by the Repealing and Amending Act, 1925 (XXXVII of 1925), s. 2 and Sch I, for “owner, agent or manager.”\n1[14.   Notice before commencement of mining operations.⸻(1) The owner, agent or\nmanager of a mine shall, in the case of an existing mine within one month from the commencement\nof the Mines (Amendment) Ordinance, 1973, or in the case of proposed mining operations, not less\nthan fifteen days before the commencement of such operations, give to the Chief Inspector and the\nDistrict Magistrate of the district in which the mine is situated or the operations will commence\nnotice in writing in such form and containing such particulars as may be prescribed.\n(2) If the proposed operations in respect of which notice is given under sub-section (1) are not\ncommenced within sixty days from the date on which the notice was given, the said notice shall be\ndeemed to have expired and no operations shall commence except after a notice has been given in\naccordance with that sub-section.]"
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Managers.⸻(1) Save as may be otherwise prescribed, every mine shall be under one",
      "content": "manager who shall have the prescribed qualifications and shall be responsible for the control,\nmanagement and direction of the mine, and the owner or agent of every mine shall appoint himself or\nsome other person, having such qualifications, to be such manager.\n(2) If any mine is worked without there being a manager for the mine as required by\nsub-section (1), the owner and agent shall each be deemed to have contravened the provisions of this\nsection."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Duties and responsibilities of owners, agents and managers.⸻(1) The owner, agent",
      "content": "and manager of every mine shall be responsible that all operations carried on in connection therewith\nare conducted in accordance with the provisions of this Act and of the regulations, rules and\nbye-laws and of any orders made thereunder.\n(2) In the event of any contravention of any such provisions by any person whomsoever, the\nowner, agent and manager of the mine shall each be deemed also to be guilty of such contravention\nunless he proves that he had taken all reasonable means, by publishing and to the best of his power\nenforcing those provisions, to prevent such contravention:\nProvided that the owner or agent shall not be so deemed if he proves⸻\n(a)       that he was not in the habit of taking, and did not in respect of the matter in\nquestion take, any part in the management of the mine; and\n(b)       that he had made all the financial and other provisions necessary to enable the\nmanager to carry out his duties; and\n(c)       that the offence was committed without his knowledge, consent or connivance.\n(3) Save as hereinbefore provided, it shall not be a defence in any proceedings brought\nagainst an owner or agent of a mine under this section that a manager of the mine has been appointed\nin accordance with the provisions of this Act.\n1\nSubs. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s, 7, for section 14."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Conservancy",
      "content": "There shall be provided and maintained for every mine latrine and urinal\naccommodation of such kind and on such scale, and such supply of water fit for drinking, as may be\nprescribed.\n1\n[17A. Canteens.—At every mine wherein more than one hundred persons are ordinarily\nemployed, a canteen of such standard as may be prescribed shall be provided for the use of persons\nemployed therein."
    },
    {
      "provision_ref": "sec17b",
      "section": "17B",
      "title": "Section 17B. Shelters",
      "content": "There shall be provided and maintained for use of persons working above\nground in a mine, during intervals for rest, shelters of such standard and on such scale as may be\nprescribed.]"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Medical Appliances. At every mine 2[* * *], such supply of ambulances or stretchers,",
      "content": "and of splints, bandages and other medical requirements, as may be prescribed, shall be kept ready at\nhand in convenient place and in good and serviceable order."
    },
    {
      "provision_ref": "sec318a",
      "section": "318A",
      "title": "Section 318A. First aid rooms",
      "content": "At every mine in respect of which the appropriate Government\nmay, by notification in the official Gazette, declare this section to apply, there shall be provided\nfirst-aid rooms of such size, with such equipment and in charge of such medical and nursing staff as\nmay be prescribed.]"
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Powers, of Inspectors when causes of danger not expressly provided against exist or",
      "content": "whist employment of persons is dangerous.⸻(1) If, in any respect when is not provided against by\nany express provision of this Act or of the regulations, rules or bye-laws or of any orders made\nthereunder, it appears to the Chief Inspector or the Inspector that any mine, or any part thereof or any\nmatter, tuning or practice in or connected with toe mine, or with the control, management or\ndirection thereof, is dangerous to human life, 4[health] or safety, or defective so to threaten, or tend\nto, the bodily injury of any person, he may give notice in writing thereof to the owner, agent or\nmanager of the mine and shall state in the notice the particulars in which he considers the mine, or\npart thereof, or the matter, thing or practice, to be dangerous or defective and require the same to be\nremedied within such time as he may specify in the notice.\n5\n[(1-A) Without prejudice to the generality of the provisions contained in sub-section (i), the\nChief Inspector or the Inspector may, in any area to which the 6[appropriate Government] may by\nnotification in the 7[Official Gazette] declares that this sub-section applies, by order in writing\naddressed to the owner, agent or manager of mine,___\n8\n[*] prohibit the extraction or reduction of pillars in any part of the mine if, in his opinion,\nsuch operation is likely to cause the crushing of pilars or the premature collapse of any part of the\nworkings or otherwise endanger the mine, or if, in his opinion adequate provision against the out-\nbreak of fire 9[or flooding] has not been made by providing for sealing off and isolation of the part of\nthe mine in which such operation is contemplated and for restricting the area that might be affected,\nby a fire 10[or flooding]. 10[*]\n1\nNew sections 17A and 17B ins. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 8.\n2\nCertain words omitted ibid., s. 9, these words were previously amended by various enactments.\n3\nNew section 18A ins. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 10.\n4\nIns. ibid., s. 11.\n5\nSub-section (1A) ins. by the Indian Mines (Amdt.) Act, 1936 (XI of 1936), s. 2, as amended by the Indian Mines (Amdt.) Act, 1937 (XXIX\nof 1937), s. 2.\n6\nSubs. by A. O., 1964, Art. 2 and Sch., for “Central Government”, which had been subs. by A. O., 1937, for “Governor General in Council”.\n7\nSubs. by A. O., 1937, for “Gazette of India”.\n8\nThe brackets and letter “(a) omitted by the Indian Mines (Amdt.) Act, 1940 (XXIV of 1940), s. 3.\n9\nIns. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 11.\n10\nThe word \"or\" omitted by Act XXIV of 1940, s.3.\n1\n[*             *               *                  *                *             *]\nAnd the provisions of sub-sections (3), (4), (5) and (6) shall apply to an order made under this\nsub-section as they apply to an order made under sub-section (2).]\n(2) If the Chief inspector or an Inspector authorised in this behalf by general or special order\nin writing by the Chief Inspector is of opinion that there is urgent and immediate danger to the\nlife, 2[health] or safety of any person employed in any mine or part thereof he may, by an order in\nwriting containing a statement of the grounds of his opinion, prohibit until the danger is removed, the\nemployment in or about the mine or part thereof any person where employment is not in his opinion\nreasonably necessary for the purpose of removing the danger.\n(3) Where an order has been made under sub-section (2) by an Inspector, the owner, agent or\nmanager of the mine may, within ten days after they confirm, modify or cancel the order.\n(4) The Chief Inspector or the Inspector making a requisition under subsection (I) or an order\nunder-section (2), and the Chief Inspector making an order (other than so order of cancellation) in\nappeal under sub-section (3), shall forthwith report the same to the 3[appropriate Government] and\nshall inform the owner, agent or manager of the mine that such report has been so made.\n(5) If the owner, agent or manager of the mine objects to a requisition made under sub-section\n(1) or to an order made by the Chief Inspector under sub-section (2), or sub-section (3), he may,\nwithin twenty days after the receipt of the notice containing the requisition of the order or after the\ndate of the decision of the appeal, as the case may be, send his objection in writing, stating the\ngrounds thereof, to the 3[appropriate Government], which shall refer the same to a Committee.\n(6) Every requisition made under sub-section (1), or order made under sub-section (2) or\nsub-section (3) to which objection is made under sub-section (5) shall be complied with pending the\nreceipt at the mine of the decision of the Committee:\nProvided that the Committee may, on the application of tine owner, agent or manager,\nsuspend the operation of a requisition under sub-section (1) pending its decision on the objection.\n(7) Nothing in this section shall affect the powers of a Magistrate under section 144 of the\nCode of Criminal Procedure, 1898 (V of 1898)."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Notice to be given of accidents",
      "content": "_ 4[(1) Whenever there occurs in or about a mine⸻\n(a)        an accident causing loss of life or serious bodily injury, or\n(b)        an accidental explosion, ignition, spontaneous heating, outbreak of fire or\neruption or inrush of water or other liquid matter, or\n(c)        an influx of inflammable or noxious gases, or\n(d)        a breakage of ropes, chains or other gear by which persons or materials are\nlowered or raised in a shaft or an incline, or\n1\n2\nIns. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 11.\n3\nSubs. by A.O., 1964, Art.2 and Sch., for \"Central Government\". Which had been subs. by A.O., 1937, for \"Local Government\".\n4\nSubs. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 12, for sub-section (1) which was previously amended by the Indian Mines\n(Amdt.) Act, 1935 (5 of 1935), s. 4.\n(e)        an overwinding of cages or other means of conveyance in any shaft while\npersons or materials are being lowered or raised, or\n(f)        an electric shock or burn caused by contact with a conductor carrying more\nthan 25 volts, or\n(g)        any other accident that may be prescribed,\nthe owner, agent or manager of the mine shall give notice of the occurrence to such\nauthorities, in such form and within such time as may be prescribed.\n(1A) Where a notice given under sub-section (1) relates to an accident causing loss of life, the\nInspector shall make, or, where the authority receiving the notice is one other than the Inspector, that\nauthority shall cause the Inspector to make, an inquiry into the occurrence as early as possible on\nreceipt of such notice or on Information received otherwise.\n(1B) When an accident causing loss of life occurs, the place of accident shall not be disturbed\nor tampered with for three clear days from the date of such accident unless the Inspector has earlier\ninspected it or given intimation that it is not proposed to make an inquiry:\nProvided that the place of accident may be disturbed if it is necessary for securing the safety\nof the mine or the persons employed therein, subject to the following conditions :___\n(a)        the decision that it is necessary to disturb the place must be taken by the\nmanager ;\n(b)      the disturbance must not prejudice subsequent investigation ;\n(c)        the workers' representative must have reasonable opportunity to inspect the\nplace if be wishes ;\n(d)        an accurate plan must be made and copies thereof made available to the\nInspector and the workers' representative ; and\n(e)        everything which is relevant to the accident must be preserved as far as\npossible, in the condition in which it was at the time of the accident.]\n1\n[(2) The 2[appropriate Government] may, by notification in the 3[Official Gazette] direct\nthat accidents other than those specified in subsection (1) which cause bodily injury resulting in the\nenforced absence from work of the person injured for a period exceeding forty-eight hours, shall be\nentered in a register in the prescribed form shall be subject to the provisions of sub-section (1).\n(3) A copy of the entries in the register referred to in the sub-section (2) shall be sent by the\nowner, agent, or manager, of the mine, within fourteen days after the 30th day of June and the 31st.\nday of December in each year to the Chief Inspector.]\n1\nSub-sections (2) and (3) were added, by Act V of 1935, s. 4.\n2\nSubs. by A. O., 1964, Art. 2 and Sch., for “Central Government” which had been subs. by A.O., 1937, for “ Local Government”.\n3\nSubs. by A. O., 1937, for “local official Gazette”.\n1\n[20A. Notice of occupational diseases.—(1) Where any person employed in a mine\ncontracts or is believed to have contracted any disease notified by the appropriate Government in the\nofficial Gazette as an occupational disease peculiar to any mining operation, the owner, agent or\nmanager of the mine, as the case may be, shall send notice thereof to the Chief Inspector and to such\nother authorities, in such form and within such time as may be prescribed.\n(2) The appropriate Government may, by order, appoint such qualified medical practitioners\non such terms and conditions as it thinks fit to be certifying doctors for the purpose of this section\nwithin such local limits as it may specify in the order.\n(3) If the Chief Inspector or an Inspector has reason to believe that any person working in a\nmine has contracted a disease notified under sub-section (1), he may refer that person to the\ncertifying doctor for his opinion.\n(4) If any qualified medical practitioner attends on a person who is or has been employed in a\nmine and who is or is believed by the medical practitioner to be suffering from any disease notified\nunder sub-section (1), the medical practitioner shall without delay send a report in writing to the\nChief Inspector stating___\n(a)      the name and address of the patient ;\n(b)      the disease from which the patient is or is believed to be suffering ; and\n(c)      the name and address of the mine in which the patient is or was last employed.\n(5) Where the report under sub-section (4) is confirmed to the satisfaction of the Chief\nInspector by the certificate of a certifying doctor that the person is suffering from a disease notified\nunder sub-section (1), the Chief Inspector shall pay to the medical practitioner such fee as may be\nprescribed, and the fee so paid shall be recoverable as an arrear of land revenue from the owner,\nagent or manager of the mine in which the person contracted the disease.\n(6) The Chief Inspector or an Inspector, if so advised by the certifying doctor, may direct the\nowner, agent or manager of the mine to shift for any specified period a person who has contracted an\noccupational disease to such working place where there is less or no danger of aggravation of the\ndisease.]"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Power of Government to appoint court of inquiry in cases of accidents.",
      "content": "(1) When\nany accidental explosion, ignition, outbreak of fire or irruption of water or other accident has\noccurred in or about any mine, the 2[appropriate Government], if it is of opinion that a formal inquiry\ninto the causes of, and circumstances attending, the accident ought to be held, may appoint a\ncompetent person to hold such inquiry, and may also appoint any person or persons possessing legal\nor special knowledge to act as assessor or assessors in holding the inquiry.\n(2) The person appointed to hold any such inquiry shall have all the powers of a Civil Court\nunder the Code of Civil Procedure, 1908 (V of 1908), for the purpose of enforcing the attendance of\nwitnesses and compelling the production of documents and material objects; and every person\nrequired by such person as aforesaid to furnish any information shall be deemed to be legally bound\nto do so within the meaning of section 176 of the Pakistan Penal Code (XLV of 1860).\n1\nNew section 20A ins. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 13.\n2\nSubs. by A. O., 1964, Art. 2 and Sch., for “Central Government” which had been subs. by A.O., 1937, for “ Local Government”.\n(3) A person holding an inquiry under this section may exercise such of the powers of an\nInspector under this Act as he may think it necessary or expedient to exercise for the purposes of the\ninquiry.\n(4) The person holding an inquiry under this section shall make a report to the 1[appropriate\nGovernment] stating the causes of the accident and its circumstances, and adding any observations\nwhich he or any of the assessors may think fit to make."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Publications of reports.― The 1[appropriate Government] may cause any report",
      "content": "submitted by a committee under section 11 2[and shall cause every report submitted] by a court of\ninquiry under section 21 to be published at such time and in such manner as it may think fit.\nHours and Limitation of Employment\n3\n[22A. Weekly, day of rest.― No person shall be allowed to work in a mine on more than\nsix days in any one week."
    },
    {
      "provision_ref": "sec22b",
      "section": "22B",
      "title": "Section 22B. Hours of work above ground.⸻(1) A person employed above ground in a mine shall",
      "content": "not be allowed to work for more than 4[forty eight] hours in any week or for more than 5[eight] hours\nin any day.\n(2) The periods of work of any such person shall be so arranged that, along with his intervals\nfor rest, they shall not in any day spread over more than 6[ten and a half] hours, and that be shall not\nwork for more than 7[five] hours before he has bad an interval for rest of at least 8[half an] hour.\n(3) Persons belonging to two or more relays shall not be allowed to do work of the same kind\nabove ground at the same moment:\nProvided that for the purposes of this sub-section persons shall not be deemed to belong to\nseparate relays by reason only of the fact that they receive their intervals for rest at different times."
    },
    {
      "provision_ref": "sec22c",
      "section": "22C",
      "title": "Section 22C. Hours of work below ground",
      "content": "_(1) A person employed below ground in a mine shall\nnot be allowed to work for more than 9[eight] hours in any day.\n(2) Work of the same kind shall not be carried on below ground is any mine for a period\nspreading over than [eight] hours in any day except by a system of relays so arranged that the periods\nof work for each relays are not spread over more than 8[eight] hours.\n(3) No person employed in a mine shall be allowed to be in any part of the mine below ground\nexcept during the periods of work shown in respect of him in the register kept under sub-section (1)\nof section 28.\n1\nSubs. by A. O., 1964, Art. 2 and Sch., for “Central Government” which had been subs. by A.O., 1937, for “ Local Government”.\n2\nSubs. by the Indian Mines (Amendment) Act, 1935 (5 of 1935), s. 5, for “or”\n3\nSections 22A to 22D were ins. by the Indian Mines (Amdt.) Act, 1935 (V of 1935), s. 6.\n4\nSubs. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 14, for “fifth four”.\n5\nSubs. ibid., for “ten”.\n6\nSubs. ibid., for “twelve”.\n7\nSubs. ibid., for “six”.\n8\nSubs. ibid., for “one”.\n9\nSubs. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 15. for “nine”."
    },
    {
      "provision_ref": "sec22d",
      "section": "22D",
      "title": "Section 22D. Special provision for night relays.― Where a worker works in a relay whose period",
      "content": "of work extends over midnight, the ensuing day for him shall be deemed to be the period of\ntwenty-four hours beginning at the end of the period of work fixed for the relay, and hours be has\nworked after midnight shall be counted towards the previous day.\n1[23. Prohibition of employment of certain persons.― No person shall be allowed to work\nin a mine who has already been working in any other mine within the preceding twelve bouts.]"
    },
    {
      "provision_ref": "sec223a",
      "section": "223A",
      "title": "Section 223A. [Limitation of working hours.]― Repealed by the Indian mines [Amendment) Act,",
      "content": "1935 (S of 1935), s. 8.\n3[23B. Notices regarding bouts of work.___(1) The manager of every mine shall cause to be\nposted outside the office of the mine a notice in the prescribed form stating the time of the\ncommencement and of the end of work at the mine and if it is proposed to work by a system of\n4\n[relays] the time of the commencement and of the end of work for each 5[relay] 6[The notice shall\nalso state the time of the commencement and of the end of the intervals for rest fixed for persons\nemployed above ground] A copy of each such notice shall be sent to the Chief Inspector, if he so\nrequires.\n(2) In the case of a mine at which mining operations commence after the 14th day of April,\n1930 the notice referred to in sub-section (1) shall in posted not less than seven days before the\ncommencement of work.\n(3) Where it is proposed to make any alteration in the time fixed for the commencement or\nfor the end of work in the mine generally or for any 7[relay or in the rest intervals fixed for persons\nemployed above ground] an amended notice in the prescribed form shall be posted outside the office\nof the mine not less than seven days before the change is made, and a copy of such notice shall be\nsent to the Chief Inspector not less than seven days before such change 8[* * *].]\n9\n[(4) No person shall be allowed to work in a mine otherwise than in accordance with the\nnotice required by sub-section (1)]\n10[23C. Employment of women.___(1) No woman shall be employed in any part of a mine\nwhich is below ground.\n(2) No woman shall be allowed to work in a mine above ground between the hours of 7 P.M.\nand 6 A. M.\n(3) The previsions of this section shall not apply to women who do to perform manual work\n___\nand are\n(a)        holding positions of managerial or technical character ; or\n(b)        employed in health and welfare services.]\n1\nSubs. by the Indian Mines (Amendment) Act. 1935 (V of 1935). s. 7 for the original section.\n2\nThis section was ins. by the Indian Mines (Amdt.) Act, 1928 (XIII of 1928), s. 3.\n3\nSection 23B ins, ibid.\n4\nSubs. by Act, V of 1935, s. 9 for “shifts”.\n5\nSubs. ibid. for “shift”.\n6\nIns. ibid.\n7\nSubs. by the Indian Mines (Amendment) Act, 1935 (V of 1935), s. 9 for “shifts”\n8\nThe comma and the words “, if he so requires or if the original notice was sent to him” omitted, ibid.\n9\nSub-section (4) ins, ibid.\n10\nSubs. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 16, for section 23C, which was previously amended by the Mines (Amdt.) Act,\n1951 (XXIX of 1951), s. 2.\n1[24.Supervising staff.—Nothing in section 22B, section 22C, section 23, sub-section (4) of\nsection 23B, or in section 23C shall apply to persons who may by rules be defined to be persons\nholding responsible positions of managerial or technical character or employed in health and welfare\nservices or employed in any confidential capacity.]"
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Exemption from provisions regarding employment",
      "content": "2[(1)] In case of an emergency\ninvolving serious risk to the safety of the mine or of persons employed therein, the manager may,\nsubject to the provisions of section 19, permit persons to be employed in contravention of 3[section"
    },
    {
      "provision_ref": "sec22a",
      "section": "22A",
      "title": "Section 22A. section 22B, section 22C, section 23 or sub",
      "content": "section (4) of section 23B] on such work as may be\nnecessary to protect the safety of the mine or of the persons employed therein:\nProvided that, where such occasion arises, a record of the fact shall immediately be made by\nthe manager and shall be placed before the Chief Inspector or the Inspector at his next inspection of\nthe mine.\n4\n[(2) When as a result of grant of an exemption to any mine from the provisions of section\n22A, any person employed therein is deprived of any of the weekly days of rest, he shall be allowed\nwithin two months from the date on which the weekly day of rest was due, compensatory days of rest\nequal in number to the days of rest of which he has been deprived.\n(3) In case of prescribed processes which are required by their nature to be carried on\ncontinuously by a succession of shifts, fine limit of hours of work provided in section 22B or section\n22C may, with the prior approval of the Chief Inspector, be raised to not more than fifty-six hours in\nany week or ten hours in any day.\n(4) In exceptional cases of pressure of work, the Chief Inspector may grant temporary\nexemption to a mine from the provisions of section 22A, section 22B or section 22C for a period not\nexceeding ninety days in arty calendar year, within the maximum limits of___\n(a)        ten hours of work in any one day, and\n(b)        twelve hours of spread over, inclusive of intervals for rest or meal, in any one\nday.\n(5) Subject to the maximum limits specified in sub-section (4), the appropriate Government\nmay, by order, grant permanent exemption, to such extent and subject to such conditions as may be\nspecified in the order, to a class of workers engaged either on preparatory car complementary work\nwhich must necessarily be carried on outside the mines or on work which is essentially intermittent].\n5[25A. Extra stages for overtime.___(1) Where in a mine a person. works for more than eight\nhours in any day or works for more than forty-night hours in any week, whether above ground or\nbelow ground, he shall in respect of such overtime work be entitled to wages at the rate of twice his\nordinary rate of wages, the period of overtime work being calculated on a daily basis or weekly\nbasis, whichever is more favourable to him.\n1\nSubs. by Act XXIX of 1951, s. 3., for the original s. 24, as amended by the Indian Mines (Amdt.) Act, 1935 (V of 1935), s. 10.\n2\nRe numbered as sub-section (I) of that section by Act XLV of 1973, s. 17.\n3\nSubs. by Act V of 1935, s. 11, for “section 23 or section 23A”.\n4\nAdded by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 17.\n5\nIns. ibid., s. 18.\nExplanation.___In this sub-section ordinary rate of wages means all remuneration capable of\nbeing expressed in terms of money which would, if the terms of contract of employment, express or\nimplied, were fulfilled, be payable to a worker in respect of his employment or of work done in such\nemployment, but does not include___\n(i)       the value of any house-accommodation, supply of light, water, medical\nattendance or other amenity ;\n(ii)       any contribution paid by the owner to any pension fund or provident fund ;\n(iii)      any travelling allowance or the value of travelling concession ;\n(iv)       any sum paid to the person employed to defray special expenses entailed on\nhim by the nature of his employment ; or\n(v)        any gratuity, bonus, overtime allowance or share in profits of the mine.\n(2) Where any person employed in a mine is paid on a piece-rate basis the appropriate\nGovernment, in consultation with the employer concerned and the representatives of the persons\nemployed in the mine may, for the purposes of this section fix time rates as nearly as possible\nequivalent to the average rate of earnings of the persons so employed, and the rates so fixed shall be\ndeemed to be the ordinary rates of wages of such persons.\n(3) The appropriate Government may prescribe the registers that shall be maintained in a\nmine for the purpose of securing compliance with the provisions of this section.]"
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Children",
      "content": "No child shall be employed in a mine, or be allowed to be present in any part\nof a mine which is below ground.\n1[26A.—Young persons not to be employed without certificates of fitness.— No person\nwho has not completed his seventeenth year shall be 2[employed to any part of a mine], unless:\n(a)        a certificate of fitness in the prescribed form and granted to him by a qualified\nmedical practitioner is in the custody of the manager of the mine, and\n(b)        he carries while at work a token giving a reference to such certificate.]\n3[26B. Limitation of working hours for young persons.—No person who his not completed\nhis seventeenth year shall be permitted to work in any part of a mine, either below ground or above\nground unless the hours of work of such person for any day are so fixed as to allow an interval of rest\nof at least twelve consecutive hours which shall include at-least such seven consecutive hours\nbetween the hours of 7 p.m. and 7 a.m. as may be prescribed :\nProvided that nothing in this section shall apply to any such person while employed or\npermitted to work in any mine as an apprentice or for the purpose of receiving vocational training, in\nsuch circumstances and in accordance with such conditions as may be prescribed 4[:]\n1\nSection 26A ins. by the Indian Mines (Amdt.) Act, 1935 (V of 1935) s. 12.\n2\nSubs. by the Mines (Amdt.) Act, 1967 (VII of 1967), s. 2, for “allowed to be present in any part of a mine which is below ground”.\n3\nSection 26B ins. by the Mines (Amdt.) Act, 1951 (XXIX of 1951), s. 4.\n4\nSubs. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 19, for the full-stop.\n1\n[Provided further that such person while so employed or permitted to work, shall be granted\na rest period of at least thirteen consecutive hours between two working periods.]"
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Dispute as to age",
      "content": "_(1) If any question arises between the Chief inspector or the\nInspector and the manager of any mine as to whether any Person is a child 2[or has not completed his\nseventeenth year] the question shall, in the absence of a certificate as to the age of such person\ngranted in the prescribed manner, be referred by the Chief Inspector or the Inspector for decision to a\nqualified medical practitioner.\n(2) Every certificate as to the age of a person which has been granted in the prescribed\nmanner and any certificate granted by a qualified medical practitioner on a reference under\nsub-section (1) shall, for the purposes of this act, be conclusive evidence as to the age of the person\nto whom it relates.\n3[28. Register of employees.___(1) For every mine there shall be kept, in the prescribed form\nand place a. register of all persons employed in the mine showing, in respect of each such person,___\n4\n(a)            [name, date of birth and the nature] of his employment,\n(b)        the periods of work fixed for him,\n(c)        the intervals for rest, if any, to which he is entitled,\n(d)        the days of rest to which he is entitled, and\n(e)        where work is carried on by a system of relays, \" the relay to which be\nbelongs.\n(2) The entries in the register prescribed by sub-section (1) shall be such that workers\nworking in accordance therewith would not be working in contravention of any of the provisions of\nthis Chapter.\n(3) No person shall be employed in a mine until the particulars required by sub-section (1)\nhave been recorded in the register in respect of such person and no person shall be employed except\nduring the periods of work shown in respect of him in the register.\n(4) For every mine which the 5[appropriate Government] may, by general or special order,\ndeclare this sub-section to be applicable, there shall be kept in the prescribed form and place a\nregister which shall show at any moment the name of every person then working below ground in the\nmine. ]\n6[CHAPTER VI-A]"
    },
    {
      "provision_ref": "sec28a",
      "section": "28A",
      "title": "Section 28A. Application of the Chapter",
      "content": "Nothing in this Chapter shall affect any right or,\nprivilege to which a person employed in a mine has been entitled on the date of coming into force of\n1\nProviso added ibid.\n2\nIns. by the Indian Mines (Amdt.) Act, 1935 (V of 1935), s. 13.\n3\nSubs. ibid., s. 14, for the original section 28.\n4\nSubs. by the Mines (Amdt.) Act, 1951 (XXIX of 1951), s. 5, for “the nature”.\n5\nSubs. by A. O., 1964, Art. 2 and Sch., for “Central Government”, which had been subs. by A. O., 1937, for “Local Government”.\n6\nNew Chapter VI-A ins by the Mines (Amdt.) Act, 1973 (XLV of 1973),s.20.\nunder any existing law or under any award, agreement, settlement, contract, custom or usage if such\nright or privilege is more favourable to him, nor shall such right or privilege be combined with or be\nin addition to, the benefits under the provisions of this Chapter."
    },
    {
      "provision_ref": "sec28b",
      "section": "28B",
      "title": "Section 28B. Annual leave with wages.⸻(1) Every person who has completed one year of",
      "content": "continuous service in a mine shall be allowed during the subsequent period of twelve months leave\nwith wages for a number of days calculated, at the rate of⸻\n(a)    one day for every seventeen days of work performed below ground during the\nprevious period of twelve months ;\n(b)    one day for every twenty days of work performed above ground during the\nprevious period of twelve months:\nProvided that a period of leave shall be inclusive of any holiday which may occur during such\nperiod.\n(2) If a person employed in a mine does not, in any such period of twelve months, take the\nleave to which he is entitled under subsection (1), either in whole or in part, such leave not taken by\nhim shall be added to the leave to be allowed to him under that subsection in the succeeding period\nof twelve months:\nProvided that such person shall cease to earn leave under this section when the leave due to\nhim amounts to twenty days: Provided further that any leave applied for by a person but refused by\nthe owner, agent or manager of the mine for any reason shall be added to the credit of such person\nbeyond the aforesaid limit.\n(3) If a person entitled to leave under subsection (1) is discharged before he has been allowed\nthe leave or, if having applied for and having been refused the leave, he quits his employment before\nhe has been allowed the leave, the owner, agent or manager shall pay him the amount payable under\nsection 28E in respect of the leave.\n(4) For the purpose of this section, a person shall be deemed to have completed a period of\ncontinuous service in a mine notwithstanding any interruption in service during that period due to___\n(a)     any holiday;\n(b)     any leave with wages;\n(c)     any leave, with or without wages, due to sickness or accident ;\n(d)     any maternity leave not exceeding twelve weeks ;\n(e)     any period of layoff arising due to failure, refusal or inability of any owner on\naccount of shortage of coal, power or raw material or the accumulation of\nstock or the breakdown of machinery or for any other reason, to give\nemployment to a person whose name is borne in the muster rolls of his mine ;\nor\n(f)     a strike which is not illegal or a lockout which is not legal."
    },
    {
      "provision_ref": "sec28c",
      "section": "28C",
      "title": "Section 28C. Festival holidays",
      "content": "Every person employed in a mine shall be allowed, with wages,\nsuch festival holidays as are declared by' the appropriate Government to be public holidays."
    },
    {
      "provision_ref": "sec28d",
      "section": "28D",
      "title": "Section 28D. Casual leave and sick leave",
      "content": "Every person employed in a mine shall be entitled in a\nyear to ten days' casual leave on full wages and sixteen days' sick leave on half average wages:\nProvided that casual leave or sick leave admissible under this section shall not be accumulated and\ncarried forward to the succeeding year."
    },
    {
      "provision_ref": "sec28e",
      "section": "28E",
      "title": "Section 28E. Wages during leave or holiday periods",
      "content": "For, the leave or holidays allowed to a\nperson under the provisions of this Chapter, he shall be paid.____\n(a)       in case of lease with full wages, at the rate equal to the daily average of his\nwages for the days on which be actually worked during the preceding three\nmonths ; and\n(b)       in case of leave with half average wages, at the rate equal to half daily average\nof this wages as aforesaid."
    },
    {
      "provision_ref": "sec28f",
      "section": "28F",
      "title": "Section 28F. Payment in advance in certain cases",
      "content": "Any person who has been allowed leave for\nnot less than four days under section 28B shall, before his leave begins, be paid the wages due for the\nperiod of the leave allowed."
    },
    {
      "provision_ref": "sec28g",
      "section": "28G",
      "title": "Section 28G. Power of Inspector to act for workers",
      "content": "Any Inspector may institute proceedings on\nbehalf of any person who has been or is employed in a mine to recover any sum required to be, but\nnot, paid by an owner, agent or manager in accordance with this Chapter.]\nREGULATIONS, RULES AND BYE-LAWS"
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Power of appropriate Government to make regulations",
      "content": "The 1[appropriate\nGovernment] may, by notification in the 2[official Gazette], make regulations consistent with this\nAct for all or any of the following purposes, namely:___\n(a)       for prescribing the qualifications to be required by a person for appointment as\nChief Inspector or Inspector ;\n(b)       for prescribing and regulating the duties and powers of the Chief inspector and\nof Inspectors in regard to the inspection of mines under this Act ;\n(c)       for prescribing the duties of owners, agents and managers of mines and of\npersons acting under them ;\n(d)       for prescribing the qualifications of managers of mines and of persons acting\nunder them ;\n(e)       for regulating the manner of ascertaining, by examination or otherwise, the\nqualifications of managers of mines and persons acting under them, and the\ngranting and renewal of certificates of competency ;\n1\nSubs. by A.O., 1964, Art. 2 and Sch., for \"Central Government\" which had been subs. by A.O., 1937 for \"Governor General in Council\".\n2\nSubs. by A. O., 1937, for “Gazette of India”.\n(f)         for fixing the fees, if any, to be paid in respect of such examinations and of the\ngrant and renewal of such certificates ;\n(g)         for determining the circumstances in which and the conditions subject to\nwhich it shall be lawful for more mines than one to be under a single manager,\nor for any mine or mines to be under a manager not having the prescribed\nqualifications;\n(h)         for providing for the making of inquiries into charges of misconduct or\nincompetency on the part of managers of mines and persons action under them\nand for the suspension and cancellation of certificate of competency ;\n1\n(hh) for providing for the appointment in mines wherein two hundred and fifty or\nmore persons are ordinarily employed of such number of welfare and safety\nofficers as may be specified and for prescribing the qualifications and the\nduties to be performed by such officer;]\n(i)         for regulating, subject to the provisions of the Explosives Act, 1884 (IV of\n1884), and of any rules made thereunder, the storage and use of explosives ;\n1\n[(ii) for regulating, subject to the provisions of the Electricity Act, 1910 (IX of\n1910), and the rules made thereunder, the generation, storage, transformation,\ntransmission and use of electricity in mines and for providing for the care and\nthe regulation of the use of all electrical apparatus and electrical cables in\nmines ;]\n(j)         for prohibiting, restricting or regulating the employment in mines or in any\nclass of mines of women either below ground or on particular kinds of labour\nwhich are attended by danger to the life, safety or health of such women ;\n1\n[(jj)   for providing for and regulating the training of persons before they are\nemployed in mines and also during the period of employment at such intervals\nas may be prescribed;\n(jjj)       for providing for and regulating the medical examination of the persons before\nthey are employed in mines and also during the period of employment at such\nintervals as may be prescribed ;]\n(k)         for providing for the safety of the persons employed in a mine, their means of\nentrance there into and exit therefrom, the number of shafts or outlets to be\nfurnished, and the fencing of shafts, pits, outlets, pathways and subsidences ;\n2\n[(kk) for prohibiting the employment in a mine either as manager or in any other\nspecified capacity of any persons except persons paid by the owner of the\nmine and directly answerable to the owner or manager of the mine] ;\n1\nIns. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 21.\n2\nCl. (kk) ins. by the Indian Mines (Amdt.) Act, 1940, (XXIV of 1940), s. 4.\n(l)         for providing for the safety of the roads and working places in mines,\nincluding the siting and maintenance of pillars and the maintenance of\nsufficient barriers between mine and mine ;\n1\n[(ll)   for prescribing the size of travelling roads in a mine, through which load is\ncarried by human agency and limit of load and the distance to which it is\ncarried ;\n(lll)       for providing for and regulating the inspection of workings, disused working\nand sealed off fire areas in mines and for the restriction of working in a mine\nunder or in the vicinity of goaves or the sea or any lake or river or any other\nbody of surface water, whether natural or artificial, or of any public roads, or\nbuildings; ]\n(m)         for providing for 2[and regulating] the ventilation of mines and the action to be\ntaken, in respect of dust 3[ionising radiations, radioactive gases and dust, fire\nand inflammable] and noxaious gases ;\n(n)         for providing for the care, and the regulation of the use, of all machinery,\n4\n[plant, equipment and material in mines];\n1\n[(nn) for providing for the safety of persons present on haulage roads in mines and\nfor prohibiting, restricting or regulating the use of certain classes of\nlocomotives underground; ]\n5\n[(o)    for providing for adequate and suitable lighting in mines and for requiring and\nregulating the use of safety lamps and for the search of persons entering a\nmine for the prescribed prohibited articles ; ]\n1\n[(oo) for prescribing protective equipments and clothings and breathing, apparatus\nfor all persons or classes of persons employed in mines or classes of mines and\nrequiring and regulating the use of such protective equipments, clothings and\napparatus;]\n6\n[(p)    for providing against explosions or ignitions or irruptions of or accumulations\nof water in mines and against danger arising therefrom, and for prohibiting,\nrestricting or regulating the extraction of minerals in circumstances likely to\nresult in or to aggravate irruptions of water or ignitions in mines;]\n(q)         for prescribing the notices of accidents and dangerous occurrences, and the\nnotices, reports and returns of minerals output, persons employed and other\nmatters provided for by regulations, to be furnished by owners, agents and\nmanagers of mines, and for prescribing the forms of such notices, returns and\nreports, the persons and authorities to whom they are to be furnished, the\nparticulars to be contained in them, and the time within which they are to be\nsubmitted;\n1\nIns. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 21.\n2\nIns. by the Indian Mines (Amdt.) Act, 1936 (XI of 1936), s. 3.\n3\nSubs. by Act XLV of 1973, s. 21.\n4\nSubs. by Act XLV of 1973, s. 21, for “and plant and of all electrical apparatus used for signaling purposes.”\n5\nSubs. ibid., s. 21, for clause (o).\n6\nSubs. by the Indian Mines (Amdt.) Act, 1936 (XI of 1936), s. 3, for the original clause (p).\n1\n[(qq) for prescribing the form of, the authorities to whom, and the time within\nwhich, the notice required by sub-section (1) of section 20A shall be sent by\nthe owner, agent or manager of a mine, and the fees to be paid to the medical\npractitioners under sub-section (5) of that section; ]\n(r)        for prescribing the plans to be kept by owners, agents and managers of mines\nand the manner and places in which such plans are to be kept for purposes of\nrecord ;\n(s)        for regulating the procedure on the occurrence of accidents or accidental\nexplosions or ignitions in or about mines.\n(t)        for prescribing the form of, and the particulars to be contained in the notice to\nbe given by the owner, agent or manager of a mine under section 14; and\n(u)        for prescribing the notice to be given by the owner, agent or manager of a\nmine before mining operations are commenced at or extended to any point\nwithin fifty yards of any railway subject to the provisions of the Railways Act,\n1890 (IX of 1980), or of any public work or classes of public works: which\nthe 1[appropriate Government] may, by general or special order, specify in this\nbehalf."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Power of appropriate Government to make rules",
      "content": "The 2[appropriate Government]\nmay, [* * *] by notification in the 4[official Gazette], make 5rules consistent with this Act for all\n3\nor any of the following purposes, namely:⸻\n(a)        for providing for the appointment of chairman and members of Mining\nBoards, and for regulating the procedure of such Boards;\n6\n[(aa) for prescribing the form of the register referred to in sub-section (2) of section\n20;]\n7\n[(aaa) for requiring facilities and security of service to be provided to managers of\nmines and other persons acting under them for enabling them to efficiently\ndischarge their duties;]\n(b)        for providing for the appointment of courts of inquiry under section 21, for\nregulating the procedure and powers of such courts, for the payment of\ntravelling allowance to the members and for the recovery of the expenses of\nsuch courts from the manager, owner or agent of the mine concerned ;\n8\n[(bb) for requiring the maintenance in mines wherein any women are ordinarily\nemployed of suitable rooms to be reserved for the use of children under the\nage of six years belonging to such women, and for prescribing either generally\nor with particular reference to the number of women ordinarily employed in\nthe mine, the number and standards of such rooms, and the nature and extent\nof the supervision to be provided therein ;]\n1\nIns. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 21.\n2\nSubs. by A.O., 1964, Art. 2 and Sch., for \"Central Government\" which had been subs. by A.O., 1937, for \"Local Government\".\n3\nThe words “subject to the control of the Governor General in Council” omitted by A.O., 1937.\n4\nSubs. ibid., for “local official Gazette”.\n5\nFor the Consolidated Mines Rules, 1952, see Gaz. of P., 1952, Pt. I, pp. 175-180.\n6\nCl. (aa) ins. by the Indian Mines (Amdt.) Act, 1935 (V of 1935), s. 15.\n7\nIns. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 22.\n8\nCl. (bb) ins. by the Mines (Amdt.) Ordinance, 1945 (XVII of 1945), s. 2.\n1\n[(bbb) for requiring for the maintenance at or near pit-heads of bathing places\nequipped with shower baths and of locker-rooms for the use of men employed\nin mines and of similar and separate places and rooms for the use of women in\nmines where women are employed, and for prescribing, either generally or\nwith particular reference to the number of men and women ordinarily\nemployed in a mine, the number and standards of such places and rooms ;]\n2\n[(bbbb)for prescribing the standard in respect of construction, accommodation,\nfurniture and other equipment of the canteens, the food-stuffs to be served\ntherein and the charges which may be made therefore and the representation of\nthe persons employed in the mines in the management of such canteens ; ]\n(c)        for prescribing the scale of latrine and urinal accommodation to be provided at\nmines, the provision to be made for the supply of drinking-water, 2[the\nstandard of first-aid rooms and shelters, the equipment and furniture therein\nand the nature and extent of supervision to be provided therefore,] the supply\nand maintenance of medical appliances and comforts, 3[* * *], and the\ntraining of men in ambulance work ;\n4\n[(cc) for prescribing the forms of notices required under section 23B, and for\nrequiring such notices to be posted also in specified vernaculars ;]\n5\n[(ccc) to fix seven consecutive hours between 7 p.m. and 7 a.m. for the purposes of\nsection 26 B ;\n(cccc) to specify the circumstances in which and conditions in accordance with\nwhich a young person may be employed or permitted to work as an apprentice\nor for the purposes of receiving vocational training in a mine for the purposes\nof the proviso to section 26B ;]\n(d)        for defining the persons who shall, for the purposes of section 24, be deemed\nto be persons holding positions of supervision or management or employed in\na confidential capacity ;\n(e)        for prohibiting the employment in mines of persons or any class of persons\nwho have not been certified by a qualified medical practitioner 6[to have\ncompleted their fifteenth year], and for prescribing the manner and the\ncircumstances in which such certificates may be granted and revoked ;\n7\n[(ee) for prescribing the form of the certificates of fitness required by section 26A\nand the circumstances in which such certificates may be granted and revoked\n;]\n(f)        for prescribing the form of 8[registers] required by section 28;\n1\nCl. (bbb) ins. by the Indian Mines (Amdt.) Act, 1946 (II of 1946), s . 2.\n2\nIns. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 22.\n3\nThe words “the formation and training of rescue brigades” omitted by the Indian Mines (Amendment) Act, 1936 (XI of 1938), s. 4.\n4\nCl. (cc) ins. by the Indian Mines (Amdt.) Act, 1928 (XIII of 1928), s. 6.\n5\nIns. by the Mines (Amdt.) Act, 1951 (XXIX of 1951),s. 6.\n6\nSubs. by the Indian Mines (Amdt.) Act, 1935 (V of 1935), s. 15, for “to be more than thirteen years of age”.\n7\nCl. (ee) ins. ibid.\n8\nSubs. ibid., for “register”.\n1\n[(ff)   to fix the time rates for the persons employed on piece-rated and for requiring\nthe maintenance of payment registers overtime work and prescribing the form\nthereof ;\n(fff)       for prescribing the forms in which record of applications for leave, the grant or\nrefusal thereof and the payment of wages during leave and holidays with\nwages is to be kept ; ]\n(g)         for prescribing abstracts of this Act 2[and of the regulations and rules] and the\nvernacular in which the abstracts and 3[* * *] bye-laws shall be posted as\nrequired by sections 32 and 33 ;\n(h)         for requiring the fencing of any mine or part of a mine, whether the same is\nbeing worked or not, where such fencing is necessary for the protection of the\npublic ;\n(i)         for the protection from injury, in respect of any mine when the workings are\ndiscontinued, of property vested in 4[Government] or any local authority or\nrailway company as defined in the Railways Act, 1890 (IX of 1890) ;\n(j)         for requiring notices, returns and reports in connection with any matters dealt\nwith by rules to be furnished by owners, agents and managers of mines, and\nfor prescribing the forms of such notices, returns and reports; the persons and\nauthorities to whom they are to be furnished, the particulars to be contained in\nthem, and the times within which they are to be submitted ; and\n(k)         generally to provide for any matter not provided for by this Act or the\nregulations, provision for which is required in order to give effect to this Act.\n5\n[30A. Power of appropriate Government to require rescue stations to be\nestablished.—The 6[appropriate Government] may, by notification in the 7[official Gazette], make\n8\n[rules] under this section-\n9\n[(a)    requiring the establishment of central rescue stations for groups of specified\nmines or for all mines in a specified area, and prescribing how and by whom\nsuch stations shall be established ;\n(b)         providing for the management of central rescue stations, and regulating the\nconstitution powers and functions of, and the conduct of business by, the\nauthorities (which shall include representatives of the owners and managers\nof, and of the miners employed in, the mines or groups of mines concerned)\ncharged with such management ;\n1\nIns. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 22.\n2\nIns. by the Repealing and Amending Act, 1925 (XXVII of 1925), s. 2 and Sch. I.\n3\nThe words “the regulations, rules and” omitted, ibid.\n4\nSubs. by A.O., 1961, Art. 2, for “His Majesty” (with effect from the 23rd March, 1956).\n5\nSection 30-A ins. by the Indian Mines (Amdt.) Act, 1936 (XI of 1936), section 5.\n6\nSubs. by A.O., 1964, Art. 2 and Sch., for “Central Government” which had been subs. by A.O., 1937 for “Governor General in Council”.\n7\nSubs. by A.O., 1937, for “Gazette of India”.\n8\nSubs. by the Indian Mines (Amdt.) Act, 1937 (XXIX of 1937), s. 4, for “regulations”.\n9\nSubs. ibid., for the original clauses (a), (b), (c) and (d).\n(c)        prescribing the position, equipment, control, maintenance and functions of\ncentral rescue stations ;\n(d)        providing for the levy and collection of a duty of excise (at a rate not\nexceeding 1[three paisa] per ton), on coke and coal produced in and\ndespatched from mines specified under clause (a) in any group or included\nunder clause (a) in any specified area, the utilisation of the proceeds thereof\nfor the creation of a central rescue station fund for such group or area and the\nadministration of such funds;\n(e)        providing for the formation, training, composition, and duties of rescue\nbrigades ; and\n(f)        providing generally for the conduct of rescue work in mines.]"
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Prier publication of regulations and rules.⸻(1) The power to make regulations and",
      "content": "rules conferred by sections 29, 2[30 and 30A] is subject to the condition of the regulations and rules\nbeing made after previous publication.\n(2) The date to be specified in accordance with clause (3) of section 23 of the General\nClauses Act, 1897 (X of 1897), as that after which a draft of regulations or rules proposed to be made\nwill be taken under consideration, shall not be less than three months from the date on which the\ndraft of the proposed regulations or rules is published for general information.\n(3) Before the draft of any regulation 3[* *] is published under this section it shall be\nreferred 4[* * *] to every Mining Board constituted in 5[Pakistan], 6[which is, in the opinion of the\n7\n[appropriate Government], concerned with the subject dealt with by the regulation] 8[* *]; and the\nregulation 3[* *] shall not be so published until each such Board has had a reasonable opportunity of\nreporting as to the expediency of making the same and as to the suitability of its provisions.\n9\n[(3A) No rule shall be made unless the draft thereof has been referred to every Mining Board\nconstituted 10[in the part of 5[Pakistan] affected by the rule], and unless each Board has had a\nreasonable opportunity of reporting as to the expediency of making the same and as to the suitability\nof its provisions.]\n(4) Regulations and rules shall be published in the 11[official Gazette] 12[* * *], and, on such\npublication, shall have effect as if enacted in this Act.\n1\nSubs. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 23, for “six pies”\n2\nSubs. by the Indian Mines (Amdt.) Act, 1937 (XXIX of 1937), s. 5, for “and 30”.\n3\nThe words “or rule” omitted by the Indian Mines (Amdt.) Act, 1928 (XIII of 1928), s. 7.\n4\nThe words “in the case of a regulation” omitted, ibid.\n5\nSubs. by the Central Laws (Statue Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for\n“the Provinces and the Capital of the Federation”, which had been subs. by A.O., 1949, for “British India”.\n6\nIns. by the Indian Mines (Amdt.) Act, 1935 (V of 1935), s. 16.\n7\nSubs. by A.O., 1964, Art. 2 and Sch., for “Central Government” which had been subs. by A.O., 1937, for “Governor General in Council”.\n8\nThe words “and in the case of a rule to every Mining Board constituted in the province” omitted by Act XIII of 1928, s. 7.\n9\nSub-section (3A) ins., ibid.\n10\nSubs. by A.O., 1937, for “in the province for which it is proposed to make the rule”.\n11\nSubs. by A.O., 1937, for “Gazette of India”.\n12\nThe words “and the local official Gazette, respectively” were omitted, ibid.\n1\n[(5) The provisions of sub-sections (1), (2) and (3A) shall not apply to the first occasion on\nwhich rules referred to in clause (bb) 2[or clause (bbb) of section 30 are made.]\n3\n[31A. Power to make regulations without previous publication.—Notwithstanding\nanything contained in sub-sections (1), (2) and (3) of section 31, regulations under clause (i) and\nclauses (k) to (s) inclusive of section 29 may be made without previous publication and without\nprevious reference to Mining Boards, if the 4[appropriate Government] is satisfied that for the\nprevention of apprehended danger or the speedy remedy of conditions likely to cause danger it is\nnecessary in making such regulations to dispense with the delay that would result from such\npublication and reference:\nProvided that any regulations so made shall not remain in force for more than two years from\nthe making thereof.]"
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Bye",
      "content": "laws.⸻(1) The owner, agent or manager of a mine may, and shall, if called upon to\ndo so by the Chief Inspector or Inspector, frame and submit to the Chief Inspector or Inspector a\ndraft of such bye-laws, not being inconsistent with this Act or any regulations or rules for the time\nbeing in force, for the control and guidance of the persons acting in the management of, or employed\nin, the mine as such owner, agent or manager may deem necessary to prevent accidents and provide\nfor the safety, convenience and discipline of the persons employed in the mine.\n(2) If any such owner, agent or manager⸻\n(a)        fails to submit within two months a draft of bye-laws after being called upon\nto do so by the Chief Inspector or Inspector, or\n(b)        submits a draft of bye-laws which is not in the opinion of the Chief Inspector\nor Inspector sufficient,\nthe Chief Inspector or Inspector may⸻\n(i)       propose a draft of such bye-laws as appear to him to be sufficient, or\n(ii)       propose such amendments in any draft submitted to him by the owner, agent\nor manager as will, in his opinion, render it sufficient,\nand shall send such draft bye-laws or draft amendments to the owner, agent or manager, as\nthe case may be, for consideration.\n(3) If within a period of two months from the date on which any draft bye-laws or draft\namendments are sent by the Chief Inspector or Inspector to the owner, agent or manager under the\nprovisions of sub-section (2), the Chief Inspector or Inspector and the owner, agent or manager, are\nunable to agree as to the terms of the bye-laws to be made under sub-section (1), the Chief Inspector\nor Inspector shall refer the draft bye-laws for settlement to the Mining Board or, where there is no\nMining Board, to such officer or authority as the 5[appropriate Government] may, be general or\nspecial order, appoint in this behalf.\n1\nAdded by the Mines (Amdt.) Ordinance, 1945 (XVII of 1945), s. 3, as amended by the Indian Mines (Amdt.) Act, 1946 (II of 1946), s. 3.\n2\nIns. by Act II of 1946, s. 3.\n3\nSection 31A ins. by the Indian Mines (Amdt.) Act, 1936 (XI of 1936), section 6.\n4\nSubs. by A.O., 1964, Art. 2 and Sch., for “Central Government” which had been subs. by A.O., 1937, for “Governor General in Council”.\n5\nSubs. by A.O., 1964, Art. 2 and Sch., for “Central Government” which had been subs. by A.O., 1937, for “Local Government”.\n(4)           (a) When such draft bye-laws have been agreed to by the owner, agent or manager\nand the Chief Inspector or Inspector, or, when they are unable to agree, have been\nsettled by the Mining Board or such officer or authority as aforesaid, a copy of the\ndraft bye-laws shall be sent by the Chief Inspector or Inspector to the 1[appropriate\nGovernment] for approval.\n(b)      The 1[appropriate Government] may make such modifications of the draft bye-laws as\nit thinks fit.\n(c)      Before the 1[appropriate Government] approves the draft bye-laws, whether with or\nwithout modifications, there shall be published, in such manner as the 1[appropriate\nGovernment] may think best adapted for informing the persons affected, notice of the\nproposal to make the bye-laws and of the place where copies of the draft bye-laws\nmay be obtained, and of the time (which shall not be less than thirty days) within\nwhich any objections with reference to the draft bye-laws, made by or on behalf of\npersons affected should be sent to the 1[appropriate Government].\n(d)           Every objection shall be in writing and shall state⸻\n(i)        the specific grounds of objection, and\n(ii)       the omissions, additions and modifications asked for,\n(e)           The 1[appropriate Government] shall consider any objection made within the required\ntime by or on behalf of persons appearing to it to be affected, and may approve the\nbye-laws either in the form in which they were published or after making such\namendments thereto as it thinks fit.\n(5) The bye-laws, when so approved by the 1[appropriate Government], shall have effect as if\nenacted in this Act, and the owner, agent or the manager of the mine shall cause a copy of the\nbye-laws, in English and in such vernacular or vernaculars as may be prescribed, to be posted up in\nsome conspicuous place at or hear the mine, where the bye-laws may be conveniently read or seen by\nthe persons employed; and, as often as the same became defaced, obliterated or destroyed, shall\ncause them to be renewed with all reasonable despatch.\n(6) The 1[appropriate Government] may, by order in writing, rescind, in whole or in part, any\nbye-law so made, and thereupon such bye-law shall cease to have effect accordingly."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Posting up of abstracts from Act, regulations, etc",
      "content": "There shall be kept posted up or\nnear, every mine in English and in such vernacular or vernaculars as may be prescribed, the\nprescribed abstracts of the Act and of the regulations and rules."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Obstruction.⸻(1) Whoever obstructs the Chief Inspector, an Inspector or any Person",
      "content": "authorised under section 7 in the discharge of his duties under this Act, or refuses or wilfully neglects\nto afford the Chief Inspector, an Inspector or such person any reasonable facility for making any\nentry, inspection, examination or inquiry authorised by or under this Act in relation to any mine,\nshall\n1\nSubs. by A.O., 1964, Art. 2 and Sch., for “Central Government” which had been subs. by A.O., 1937, for “Local Government”.\nbe punishable with imprisonment for a term which may extend to three months, or with fine which\nmay extend to 1[one thousand] rupees, or with both.\n(2) Whoever refuses to produce on the demand of the Chief Inspector or Inspector any\nregisters or other documents kept in pursuance of this Act, or prevents or attempts to prevent or does\nanything which he has reason to believe to be likely to prevent, any person from appearing before or\nbeing examined by an inspecting officer acting in pursuance of his duties under this Act shall be\npunishable with fine which may extend to 2[six] hundred rupees."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Falsification of records, etc.⸻ Whoever⸻",
      "content": "(a)        counterfeits, or knowingly makes a false statement in, any certificates, or any\nofficial copy of certificates, granted under this Act, or\n(b)        knowingly uses as true any such counterfeit or false certificate, or\n(c)        makes or produces or uses any false declaration, statement or evidence\nknowing the same to be false, for the purpose of obtaining for himself or for\nany other person a certificate, or the renewal of a certificate, under this Act, or\nany employment in a mine, or\n(d)        falsifies any plan or register or record the maintenance of which is required by\nor under this Act,\n(e)        makes, gives or delivers any plan, return, notice, record or report containing a\nstatement, entry or detail which is not to the best of his knowledge or belief\ntrue.\nshall be punishable with imprisonment for a term which may extend to three months, or with\nfine which may extend to 3[one thousand] rupees, or with both."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Omission to furnish plans, etc",
      "content": "Any person who, without reasonable excuse the burden\nof proving which shall lie upon him, omits to make or furnish in the prescribed form or manner at or\nwithin the prescribed time any plan, return, notice, register, record or report required by or under this\nAct to be made or furnished shall be punishable with fine which may extend to 4[four] hundred\nrupees."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Contraventions of provisions regarding employment of labour",
      "content": "Whoever save as\npermitted by section 25 contravenes any provision of this Act or of any regulation, rule or bye-law or\nany order made thereunder prohibiting, restricting or regulating the employment or presence of\npersons in or about a mine shall be punishable with fine which may extend to 5[one thousand] rupees."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Notice of accidents.⸻6[(1)] Wherever, in contravention of the provision 7[of sub",
      "content": "section\n(1)] of section 20, fails to give notice of any accidental occurrence shall,\n1\nSubs. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 24, for “Five hundred”.\n2\nSubs. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 24, for “three”.\n3\nSubs. ibid., s. 25, for “five hundred”.\n4\nSubs. ibid., s. 26, for “two”.\n5\nSubs. ibid., s. 27, for “five hundred”.\n6\nOriginal section 38 re-numbered as sub-section (1) by the Indian Mines (Amdt.) Act, 1935 (V of 1935), s. 17.\n7\nIns. ibid.\nif the occurrence results in serious bodily injury be punishable will fine which may extend to 1[one\nthousand] rupees or, if the occurrence results loss of, life, be punishable with imprisonment which\nmay extend to the months or with fine which may extend to 1[one thousand] rupees, or with both.\n2\n[(2) Whoever in contravention of a direction made by the 3[appropriate Government] under\nsub-section (2) of section 20 fails to record in the presented register or to give notice of any\naccidental occurrence shall be punishable with fine which may extend to 1[one thousand] rupees.]"
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Disobedience of orders",
      "content": "Whoever contravenes any provisions of the Act or of any\nregulation, rule or bye-law or of any order made thereunder for the contravention of which no\npenalty is hereinbefore provided shall be punish able with fine which may extend to 4[two] thousand\nrupees, and, in the case of a continuing contravention, with a further fine which may extend to 4[two]\nhundred rupees for every day on which the offender is proved to have persisted in the contravention\nafter the date of the first conviction."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Contravention of law with dangerous results.⸻(1) Notwithstanding anything",
      "content": "hereinbefore contained whoever contravenes any provision of this Act or of any regulation, rule or\nbye-law or of any order made thereunder, shall be punishable, if such contravention results in loss of\nlife, with imprisonment which may extend to one year, or with fine which may extend to 5[four]\nthousand rupees, or with both; or, if such contravention results in serious bodily injury, with\nimprisonment which may extend to six months, or with fine which may extend to 6[two] thousand\nrupees, or with both; or, if such contravention otherwise causes injury, or danger to workers or other\npersons in or about the mine with imprisonment which may extend to one month, or with fine which\nmay extend to 7[one thousand] rupees or with both.\n(2) Where a person having been convicted under this section is again convicted thereunder,\nbe shall be punishable with double the punishment provided by sub-section (1).\n(3) Any Court imposing, confirming in appeal, revision or otherwise, a sentence of fine\npassed under this section may, when passing judgment, order the whole or any part of the fine\nrecovered to be paid as compensation to the person injured, or, in the case of his death, to his legal\nrepresentative\nProvided that, if the fine is imposed in a case which is subject to appeal, no such payment\nshall be made before the period allowed for presenting the appeal has elapsed, or, if an appeal has\nbeen presented, before the decision of the appeal.\n8[40A. Special provision regarding fine.—Notwithstanding anything contained in section\n32 of the Code of Criminal Procedure, 1898 (Act V of 1898), it shall be lawful for a Magistrate of\nperson convicted of an offence thereunder.]"
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Prosecution of owner, agent or manager",
      "content": "No prosecution shall be instituted, against\nany owner, agent or manager for any offence under this Act except at the instance of the Chief\nInspector or of the District Magistrate or of an Inspector authorised in this behalf by general or\nspecial order in writing by the Chief Inspector.\n1\nSubs. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 28, for “five hundred”.\n2\nSub-section (2) added, by Act V of 1935, s. 17.\n3\nSubs. by A.O., 1964, Art. 2 and Sch., for “Central Government” which had been subs. by A.O., 1937, for “Local Government”.\n4\nSubs. by Act XLV of 1973, s. 29, for “one”.\n5\nSubs. ibid., for “two thousand”.\n6\nSubs. ibid., s. 30, for “one thousand”.\n7\nSubs. ibid., for “five hundred”.\n8\nIns. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 31.\n1[42. Limitation of promotion.— No court shall take cognizance of any offence under this\nAct unless complaint thereof has been made⸻\n(i)        within six months of the date on which the offence is alleged to have been\ncommitted, or\n(ii)       within six months of the date on which the alleged commission of the offence\ncame to the knowledge of the Inspector, or\n(iii)      in any case where a person has beet, appointed by the appropriate Government\nunder section 21 to hold an inquiry, within six months of the date of the\nmaking of the report referred to in sub-section (4) of that section, whichever is\nthe later.]"
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Cognizance of Offences",
      "content": "No Court inferior to that of a 2[* * *] Magistrate of tine first\nclass shall try any offence under this Act which is alleged to, have been committed by any owner\nagent or manager of a mine or any offence which is, by this Act made punishable with imprisonment."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Reference to Mining Board or Committee in lieu of prosecution in certain",
      "content": "cases.⸻(1) If the Court trying any case instituted at the instance of the Chief Inspector or of the\nDistrict Magistrate or of an Inspector under this Act is of opinion that the case is one which should in\nlieu of a prosecution, be referred to a Mining Board or a Committee, it may stay the Criminal\nproceedings and report the matter to the 3[appropriate Government] with a view to such reference\nbeing made.\n(2) On receipt of a report under sub-section (1), the 3[appropriate Government] may refer the\ncase to a Mining Board or a Committee, or way direct the Court to proceed with the trial."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Decision of question whether a mine is under this Act.⸻ If any question arises as to",
      "content": "whether any excavation or working is a mine within the meaning of this Act, the 3[appropriate\nGovernment] may decide the question, and a certificate signed by a Secretary of the 3[appropriate\nGovernment shall be conclusive on the point."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Power to exempt from operation of Act.⸻(1) The 4[appropriate Government] may, by",
      "content": "5\nnotification in the 6[Official Gazette], exempt 7[either absolutely or subject to any specified\nconditions] any local area or any mine or group or class of mines or any part of a mine or any class\nof persons from the operation of all or any specified provisions of this Act:\nProvided that no local area or mine or group or class of mines shall be exempted from the\nprovisions of section 26 unless it is also exempted from the operation of all the other provisions of\nthis Act 8[:]\n1\nSubs. ibid., s. 32, for the original section 42.\n2\nThe words “Presidency Magistrate or” omitted by A.O., 1949.\n3\nSubs. by A.O., 1964., Art. 2 and Sch., for “Central Government” which had been subs. by A.O., 1937, for “Local Government”.\n4\nSubs. by A.O., 1964, Art. 2 and Sch., for “Central Government” which had been subs. by A.O., 1937, for “Government General in\nCouncil”.\n5\nFor Notifying Exempting the Attock Oil Co. Ltd., from the provisions of sub-section (2) of section 22B of this Act, see Gaz. of P., 1953,\nPt. I, p. 122.\n6\nSubs. by A.O., 1937, for “Gazette of India”.\n7\nIns. by the Indian Mines (Amdt.) Act, 1935 (V of 1935), s. 18.\n8\nSubs. by the Mines (Amdt.) Act, 1967 (VII of 1967), s. 3, for fullstop.\n1\n[Provided further that no exemption from the operation of the provisions of section 23C\nshall be granted unless, in case of an emergency, the national interest so requires and the employers’\nand workers’ organisation have been consulted 2[:]\n3\n[Provided further that no exemption from the operation of the provisions of section 22B or\nsection 22C or section 25A shall be granted except in the event of war or other emergency\nthreatening the national safety.\n4\n[*       *           *                 *       *           *             *]\n5                  6"
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Power to alter or rescind orders",
      "content": "The [appropriate Government] [* * *] may reverse\nor modify any order passed under this Act 7[* * *] ."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Application of Act to Government mines",
      "content": "This Act shall apply to mines belonging to\n8\nthe [Government]."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Saving",
      "content": "No suit, prosecution or other legal proceeding whatever shall lie against any\nperson for anything which is in good faith done or intended to be done under this Act."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. [Repeals] Rep. by the Repealing Act, 1927 (XII of 1927), s. 2 and Schedule",
      "content": "THE SCHEDULE. [ENACTMENTS REPEALED.] Rep. by the Repealing Act, 1927 (XII of\n1927), s. 2 and Schedule.\n___________________\nDated: 05.04.24\n1\nProviso added. by the Mines (Amdt.) Act, 1967 (VII of 1967), s. 3.\n2\nSubs. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 33, for fullstop.\n3\nProviso added. by the Mines (Amdt.) Act, 1973 (XLV of 1973), s. 33.\n4\nSub-section (2) omitted by A.O., 1937.\n5\nSubs. by A.O., 1964, Art. 2 and Sch., for “Central Government” which had been subs. by A.O., 1937, for “Government General in\nCouncil”.\n6\nThe words “and every Local Government” omitted, by A.O., 1937.\n7\nThe words “by any authority subject to his or its control, as the case may be” omitted, ibid.\n8\nSubs. by A.O., 1961, Art, 2., for “Crown” (with effect from 23rd March, 1956)."
    }
  ],
  "definitions": [
    {
      "term": "Inspector",
      "definition": "an inspector of Mines appointed under this Act, and includes a District Magistrate when exercising any power or performing any duty of an inspector which he is empowered by this Act to exercise or perform;",
      "source_provision": "sec3"
    },
    {
      "term": "mine",
      "definition": "any excavation where any operation for the purpose of searching for or obtaining minerals has been or is being carried on, and includes all works, machinery, tramways and sidings, whether above or blow ground, in or adjacent to or belonging to a mine: Provided that it shall not include any part of such premises on which a manufacturing process is being carried on unless such process is a process for coke making or the dressing of:",
      "source_provision": "sec3"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by regulations, ruler or bye laws;",
      "source_provision": "sec3"
    },
    {
      "term": "qualified medical practitioner",
      "definition": "any person registered 4[* * *] under any Act of 5[the Central Legislature or any Provincial Legislature], providing for the maintenance of a register of medical practitioners, and includes, in any area where no such last-mentioned Act is in force, any person declared by the 6 [appropriate Government] by notification in the 7[official Gazette], to be a qualified medical practitioner for the purposes of this Act; 1 Subs. by the Indian Mines (Amdt.) Act, 1935 (V of 1935), s. 2. for the original clause (c). 2 Clause (cc) ins., ibid 3 Clause (ccc), omitted by A.O., 1949. 4 Certain words omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch. II. 5 Subs. by A.O., 1949, for “any Legislature in British India”. 6 Subs. by A.O., 1964, Art. 2 and Sch., for “Central Government”, which had been subs. by A.O., 1937, for “Local Government”. 7 Subs. by A.O., 1937, for “local official Gazette”.",
      "source_provision": "sec3"
    },
    {
      "term": "serious bodily injury",
      "definition": "any injury which involves, or in all probability will involve, the permanent loss of the use of, or permanent injury to any 3 [part of the body], or the permanent logs of or injury to the sight or hearing, or the fracture of any 3[part of the body] or the enforced absence of the injured person from work for a period exceeding twenty days; and",
      "source_provision": "sec3"
    },
    {
      "term": "week",
      "definition": "the period between midnight on Saturday night and midnight on the succeeding Saturday night.",
      "source_provision": "sec3"
    }
  ]
}
