{
  "id": "pk-motor-vehicles-act-1939",
  "type": "statute",
  "title": "Motor Vehicles Act, 1939",
  "title_en": "Motor Vehicles Act, 1939",
  "short_name": "MVA",
  "status": "in_force",
  "issued_date": "1939-02-15",
  "in_force_date": "1939-02-15",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJaV-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Motor Vehicles Act, 1939 (IV of 1939) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec92",
      "section": "92",
      "title": "Section 92. Power of Federal Government to make rules",
      "content": "(1) The 3[Federal Government] may,\nby notification in the official Gazette, make rules for all or any of the following purposes, namely:⸻\n(a)     the grant and authentication of traveling passes, certificates or authorisations\nto persons temporarily taking motor vehicles out of 2[Pakistan] to any place\n4\n[outside Pakistan] or to persons temporarily proceeding out of 2[Pakistan] to\nany place 4[outside Pakistan] and desiring to drive a motor vehicle during their\nabsence from 2[Pakistan];\n(b)     prescribing the conditions subject to which motor vehicles brought\ntemporarily into 2[Pakistan] from 4[outside Pakistan] by persons intending to\nmake a temporary stay in 1[Pakistan] may be possessed and used in\n2\n[Pakistan]; and\n1\nFor Statement of Objects and Reasons, see Gazette of India , 1938, Pt. V, p. 114 ; for Report of the Select Committee, see ibid., p. 187. See\nalso the India Independence (Miscellaneous Transitional Provisions) Order, 1947 (G.G.O. 13 of 1947), Art. 3.\nThis Act has been applied to⸻\nBaluchistan, see Notification No. 41-F., dated the 14th March, 1939, Gazette of India, 1939, Pt. I, p. 446, and Notification No. 126-F., dated\nthe 3rd July, 1939, Gazette of India, 1939, Pt. I, p. 1180;\nPhulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.W.F.P., subject to certain modifications, see\nN.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950; and extended to the Excluded Area of Upper Tanawal othe4r than\nPhuera by the N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950 and declared to be in force in that area with effect from\nthe 1st June, 1951, see N.W.F.P. Gazette, Extraordinary, dated the 1st June, 1951;\nSuch of the Baluch Tribal Areas beyond the western border of Dera Ghazi Khan District of the Punjab, as are not included in the\nBalochistan Tribal Areas, see Gazette of India, 1939, Pt. I, p. 1562; and\nProvince of West Pakistan by West Pakistan Ordinance 11 of 1963 (With effect from the 16th May, 1963)\nThe Act has been amended in its application to⸻\n(i)         Sind and Karachi, by the Motor Vehicles (Sind Amdt.) Act, 1948 (Sind Act 14 of 1948),\n(ii)        North-West Frontier Province by N.W.F.P. Act 8 of 1953, and\n(iii)       The Province of West Pakistan by West Pakistan Acts 19 of 1958, 31 and 36 of 1964 and West Pakistan Ordinance 35\nof 1960, s.2 (with effect from the 31st December, 1960).\nThe Act has been extended to⸻\n(i)         the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G.G.O.3 of 1950), and also applied in the\nFederated Areas of Baluchistan, see Gazette of India, 1937, Pt.I, p.1499;\n(ii)        the Baluchistan States Union by the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G.G.O.4 of\n1953), as amended ;\n(iii)       the Khairpur States, excluding sections 43 (4), 43A, 43B, 43C and 54 (2), by the Khairpur (Federal Laws) (Extension)\nOrder, 1953 (G.G.O.5 of 1953), as amended; and\n(iv)        the State of Bahawalpur, see the Bahawalpur (Extension of Federal Laws) Order, 1953 (G.G.O. 11 of 1953), as\namended.\nThe Act has been and shall be deemed to have been brought into force in Gwadur with effect form the 8 th September, 1958, by the Gwadur\n(Application of Central Laws) Ordinance, 1960 (37 of 1960), s.2.\nThis Act has been repealed in its application to the Province of West Pakistan except Chapters VII, VIII and section 125 by the Provincial\nMotor Vehicles Ordinance, 1965 (XIX of 1965), s.122 and 14th Schedule.\n2\nSubs. by the Central Las (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2nd Sch. (with effect from the 14th October, 1955).\n3\nSubs. by the Federal Adaptation of Laws Order, 1975 (F.A.O. No. 4 of 1975) , Art. 2 and Table.\n4\nSubs. by A.O., 1949.\n(c)        prescribing the conditions subject to which persons entering 1[Pakistan] from\nany place 2[outside Pakistan] for a temporary stay in 1[Pakistan] may drive\nmotor vehicles in 1[Pakistan].\n(2) No rule made under this section shall operate to confer on any person any immunity in\nany Province from the payment of any tax levied in that Province on motor vehicles or their users.\n3\n*                 *                *             *                *                *                   *                    *\n(4) Nothing in this Act or in any rule made thereunder by a Provincial Government relating\nto⸻\n(a)        the registration and identification of motor vehicles, or\n(b)        the requirements as to constructions, maintenance and equipment of motor\nvehicles, or\n(c)        the licensing and the qualifications of drivers of motor vehicles;\nshall apply to any motor vehicle to which or to any driver of a motor vehicle to whom any\nrules made under clause (b) or clause (c) of sub-section (1) apply."
    },
    {
      "provision_ref": "sec93",
      "section": "93",
      "title": "Section 93. Definitions. In this Chapter⸻",
      "content": "4\n[(a)   “authorised insurer” means an insurer in whose case the requirements of the\nInsurance Act, 1938 (VI of 1938). 5* * * with respect to the registration of\ninsurers are complied with and includes, where the business of insuring motor\nvehicles against third party risks is carried on by the 5[Federal Government] or\na Provincial Government 5* * * such Government;]\n(b)        “certificate of insurance” means a certificate issued by an authorised insurer in\npursuance of sub-section (4) of section 95; and includes 6[a cover note\ncomplying with such requirements as may be prescribed, and] where more\nthan one certificate has been issued in connection with a policy, or where a\ncopy of certificate has been issued, all those certificates or that copy, as the\ncase may be;\n7\n*          *            *               *               *               *              *\n1\nSubs. by the Central Law (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2nd Sch. (with effect from the 14th October, 1955).\n2\nSubs. by A.O., 1949.\n3\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981)., s.3 and Sch., II.)\n4\nSubs. by the Motor Vehicles (Amdt.) Act, 1947 (XXVII of 1947), s.2. (with effect from the 1st March, 1949).\n5\nSubs. Ordinance No. XXVIII of 1981.\n6\nIns. by the Motor Vehicles (Amdt.) Act, 1947 (XXVII of 1947), s.2 (with effect from the 1st March, 1949).\n7\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s.3 and Sch.II., which was previously\namended by various enactments."
    },
    {
      "provision_ref": "sec94",
      "section": "94",
      "title": "Section 94. Necessity for insurance against third party risk",
      "content": "(1) No person shall use except as a\npassenger or cause or allow any other person to use a motor vehicle in a public place, unless there is\nin force in relation to use of the vehicle by that person or that other person, as the case may be, a\npolicy of insurance complying with the requirements of this Chapter.\nExplanation.⸻A person driving a motor vehicle merely as a paid employee, while there is in\nforce in relation to the use of the vehicle no such policy as is required by this sub-section, shall\nnot be deemed to act in contravention of the sub-section unless he know or has reason to believe that\nthere is no such policy in force.\n1\n[(2) Subject to any prescribed conditions, sub-section (1) shall not apply to any vehicle\nowned by any of the following authorities, namely:⸻\n(i)        the 2[Federal Government];\n3\n*           *            *              *                *               *               *\n(iii)      any Provincial Government;\n4\n*           *            *              *                *               *               *\n(vi)       any local authority in 5[Pakistan] exempted from the operation of sub-section\n(1) by order of the 2[Federal Government] or of a Provincial Government;\n6\n*               *                *                   *                   *                     *"
    },
    {
      "provision_ref": "sec95",
      "section": "95",
      "title": "Section 95. Requirements of policies and limits of liability",
      "content": "(1) In order to comply with the\nrequirements of this Chapter, a policy of insurance must be a policy which⸻\n(a)        is issued by a person who is an authorised insurer 7[or by a co-operative\nsociety allowed under section 108 to transact the business of an insurer], and\n(b)        insurers the person or classes of person specified in the policy to the extent\nspecified in sub-section (2) against any liability which may be incurred by him\nor them in respect of the death of or bodily injury to any person caused by or\narising out of the use of the vehicle in a public place 7[in 5[Pakistan] 6* * *:\nProvided that a policy shall not, 8* * *, be required⸻\n1\nSubs. by Act. XXVII of 1947, s.3. (with effect from the 1st March, 1949).\n2\nSubs. by the Federal Adaptation of Laws Order, 1975 (F.A.O. No. 4 of 1975) , Art. 2 and Table.\n3\nOmitted by A.O., 1949.\n4\nOmitted by Ordinance, 27 of 1981, s,.3 and Sch. II.\n5\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960),s. 3 and 2nd Sch. (with effect from the 14th October, 1955).\n6\nOmitted by the Federal Laws (Revision and Declaration) Ordinance 1981 (XXVII of 1981), s.3 and Sch.II.\n7\nIns. by the Motor Vehicles (Amdt.) Act, 1947 (XXVII of 1947), s.4 (with effect from the 1st March, 1949).\n8\nOmitted by Act 27 of 1947, s.4 (with effect from the 1st March,   1949).\n(i)        to cover liability in respect of the death, arising out of and in the course of his\nemployment, of the employee of a person insured by the policy or in respect of\nbodily injury sustained by such an employee arising out of and in the course of\nhis employment, 1[other than a liability arising under the Workmen’s\nCompensation Act, 1923 (VIII of 1923), in respect of the death of, or bodily\ninjury to, any such employee⸻\n(a)        engaged in driving the vehicle, or\n(b)        if it be a public service vehicle, engaged as a conductor of the vehicle\nor in examining tickets on the vehicle, or\n(c)        if it be a goods vehicle, being carried in the vehicle,] or\n(ii)       except where the vehicle is a vehicle in which passengers are carried for hire\nor reward or by reason of or in pursuance of contract of employment, to cover\nliability in respect of the death of or bodily injury to persons being carried in\nor upon or entering or mounting or alighting from the vehicle at the time of the\noccurrence of the event out of which a claim arises, or\n(iii)      to cover any contractual liability.\n(2) Subject to the proviso to sub-section (1), a policy of insurance shall cover any liability\nincurred in respect of any one accident up to the following limits, namely.__\n2\n[(a)   where the vehicle is a goods vehicle, a limit of twenty thousand rupees in all,\n(VIII of 1923), in respect of the death of, or bodily injury to, employees other\nthan the driver being carried in the vehicle being limited to six such\nemployees;]\n(b)        where the vehicle is a vehicle in which passengers are carried for hire or\nreward or by reason of or in pursuance of a contract of employment, in\nrespect of persons other than passengers carried for hire or reward, a limit of\ntwenty thousand rupees; and in respect of passengers a limit of twenty\nthousand rupees in all, and four thousand rupees in respect of an individual\npassenger, if the vehicle is registered to carry not more than six passengers\nexcluding the driver or two thousand rupees in respect of an individual\npassenger, if the vehicle is registered to carry more than six passengers\nexcluding the driver;\n(c)        where the vehicle is a vehicle of any other class the amount of the liability\nincurred.\n3\n*                       *                     *                    *                    *        *\n1\nIns. by the Motor Vehicles (Amdt.) Act, 1947 (XXVII of 1947), s.4 (with effect from the 1st March, 1949).\n2\nSubs. by the Motor Vehicles (Amdt.) Act, 1947 (XXVII of 1947), s.4. (with effect from the 1st March, 1949).\n3\nOmitted, ibid.\n(4) A policy shall be of no effect for the purposes of this Chapter unless and until there is\nissued by the insurer in favour of the person by whom the policy is effected a certificate of insurance\n1\n* * * in the prescribed form and containing the prescribed particulars of any conditions subject to\nwhich the policy is issued and of any other prescribed matters; and different forms, particulars and\nmatters may be prescribed in different cases.\n(5) Notwithstanding anything elsewhere contained in any law, a person issuing a policy of\ninsurance under this section shall be liable to indemnify the person or classes of person specified in\nthe policy in respect of any liability which the policy purports to cover in the case of that person or\nthose classes of person."
    },
    {
      "provision_ref": "sec96",
      "section": "96",
      "title": "Section 96. Duty of insurers to satisfy judgments against persons insured in respect of third",
      "content": "party risks.—(1) If, after a certificate of insurance 1* * * has been issued under sub-section (4) of\nsection 95 in favour of the person by whom a policy has been effected, judgment in respect of any\nsuch liability as is required to be covered by a policy under clause (b) of sub-section (1) of section\n95 (being a liability covered by the terms of the policy) is obtained against any person insured by the\npolicy, then, notwithstanding that the insurer may be entitled to avoid or cancel or may have avoided\nor cancelled the policy, the insurer shall, subject to the provisions of this section, pay to the person\nentitled to the benefit of the decree any sum not exceeding the sum assured payable thereunder, as if\nhe were the judgment-debtor, in respect of the liability, together with any amount payable in respect\nof costs and any sum payable in respect on interest of that sum by virtue of any enactment relating to\ninterest on judgments.\n(2) No sum shall be payable by an insurer under sub-section (1) in respect of any judgment\nunless before or after the commencement of the proceedings in which the judgment is given the\ninsurer had notice through the Court of the bringing of the proceedings, or in respect of any\njudgment so long as execution is stayed thereon pending an appeal; and an insurer to whom notice of\nthe bringing of any such proceedings is so given shall be entitled to be made a party thereto and to\ndefend the action on any of the following grounds, namely:⸻\n(a)        that the policy was cancelled by mutual consent or by virtue of any provision\ncontained therein before the accident giving rise to the liability, and that either\nthe certificate of insurance was surrounded to the insurer or that the person to\nwhom the certificate was issued has made an affidavit stating that the\ncertificate has been lost or destroyed, or that either before or not later than\nfourteen days after the happening of the accident the insurer has commenced\nproceedings for cancellation of the certificate after compliance with the\nprovisions of section 105; or\n(b)        that there has been a breach of a specified condition of the policy, being one of\nthe following conditions, namely:⸻\n(i)        a condition excluding the use of the vehicle⸻\n(a)        for hire or reward, where the vehicle is on the date of the\ncontract of insurance a vehicle not covered by a permit to ply\nfor hire or reward, or\n(b)        for organised racing and speed testing, or\n1\nOmitted by Act, 1947 (XXVII of 1947), ss.4 and 5. (with effect from the 1st March, 1949).\n(c)        for a purpose not allowed by the permit under which the\nvehicle is used, where the vehicle is a public service vehicle or\na goods vehicle, or\n(d)        without side-car being attached, where the vehicle is a motor\ncycle; or\n(ii)       a condition excluding driving by a named person or persons or by any\nperson who is not duly licensed, or by any person who has been\ndisqualified for holding or obtaining a driving licence during the period\nof disqualification; or\n(iii)      a condition excluding liability for injury caused or contributed to by\nconditions of war, civil war, riot or civil commotion; or\n(c)        that the policy is void on the ground that it was obtained by the non-disclosure\nof a material fact or by a representation of fact which was false in some\nmaterial particular.\n1\n[(2A) Where any such judgment as is referred to in sub-section (1) is a foreign judgment\nand is, by virtue of the provisions of section 13 of the Code of Civil Procedure, 1908 (V of 1908),\nconclusive as to any matter adjudicated upon by it, the insurer (being an insurer) registered under the\nInsurance Act, 1938 (IV of 1938), shall be liable to the person entitled to the benefit of the decree in\nthe manner and to the extent specified in sub-section (1) as if the judgment were given by a Court in\nPakistan:]\nProvided that no sum shall be payable by the insurance in respect of any such judgment\nunless, before or after the commencement of the proceedings in which the judgment is given, the\ninsurer had notice through the Court in the reciprocating territory of the bringing of the proceedings\nand the insurer to whom notice is so given is entitled under the corresponding law of the\nreciprocating territory, to be made a party to the proceedings and to defend the action on grounds\nsimilar to those specified in sub-section (2).]\n(3) Where a certificate of insurance 2* * * has been issued under sub-section (4) of section\n95 to the person by whom a policy has been effected, so much of the policy as purports to restrict the\ninsurance of the persons insured thereby by reference to any conditions other than those in clause (b)\nof sub-section (2) shall, as respects such liabilities as are required to be covered by a policy under\nclause (b) of sub-section (1) of section 95, be of no effect:\nProvided that any sum paid by the insurer in or towards the discharge of any liability of any\nperson which is covered by the policy by virtue only of this sub-section shall be recoverable by the\ninsurer from that person.\n(4) If the amount which an insurer becomes liable under this section to pay in respect of a\nliability incurred by a person insured by a policy exceeds the amount for which the insurer would\napart from the provisions of this section be liable under the policy in respect of that liability, the\ninsurer shall be entitled to recover the excess from that person.\n1\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s.3 and Sch.II.\n2\nOmitted by the Motor Vehicle (Amdt.) Act, 1947 (XXVII of 1947), s.5 (with effect from the 1st March, 1949).\n(5) In this section the expressions “material fact” and “material particular” mean,\nrespectively, a fact or particular of such a nature as to influence the judgment of prudent insurer in\ndetermining whether he will take the risk and, if so, at what premium and on what conditions, and\nthe expression “liability covered by the terms of the policy” means a liability which is covered by the\npolicy or which would be so covered but for the fact that the insurer is entitle to avoid or cancel or\nhas avoided or cancelled the policy.\n(6) No insurer to whom the notice referred to in sub-section (2) 1[or sub-section (2A)] has\nbeen given shall be entitled to avoid his liability to any person entitled to the benefit of any such\njudgment as is referred to in sub-section (1) 1[or sub-section (2A)] otherwise than in the manner\nprovided for in sub-section (2) 2* * *."
    },
    {
      "provision_ref": "sec97",
      "section": "97",
      "title": "Section 97. Rights of third parties against insurers on insolvency of the insured",
      "content": "(1) Where\nunder any contract of insurance effected in accordance with the provisions of this Chapter a person is\ninsured against liabilities which he may incur to third parties then—\n(a)        in the event of the person becoming insolvent or making a composition or\narrangement with his creditors, or\n(b)        where the insured person is a company, in the event of a winding up order\nbeing made or a resolution for a voluntary winding up being passed with\nrespect to the company or of a receiver or manager of the company’s business\nor undertaking being duly appointed, or of possession being taken by or on\nbehalf of the holders of any debentures secured by a floating charge of any\nproperty comprised in or subject to the charge.\nif, either before or after that event, any such liability is incurred by the insured person, his\nrights against the insurer under the contract in respect of the liability shall, notwithstanding anything\nto the contrary in any provision of law, be transferred to and vest in the third party to whom the\nliability was so incurred.\n(2) Where an order for the administration of the estate of a deceased debtor is made according\nto the law of insolvency, then, if any debt provable in insolvency is owing by the deceased in respect\nof a liability to a third party against which he was insured under a contract of insurance in\naccordance with the provisions of this Chapter, the deceased debtor’s rights against the insurer in\nrespect of that liability shall, notwithstanding anything to the contrary in any provision of law, be\ntransferred to and vest in the person to whom the debt is owing.\n(3) Any condition in a policy issued for the purposes of this Chapter purporting either directly\nor indirectly to avoid the policy or to alter the rights of the parties thereunder upon the happening to\nthe insured person of any of the events specified in clause (a) or in clause (b) of sub-section (1) or\nupon the making of an order for the administration of the estate of a deceased debtor according to the\nlaw of insolvency shall be of no effect.\n(4) Upon a transfer under sub-section (1) or sub-section (2) the insurer shall be under the\nsame liability to the third party as he would have been to the insured person, but—\n1\nIns. by the Motor Vehicles (Amdt.) Act, 1947 (XXVII of 1947), s.5 (with effect from the 1st March, 1949).\n2\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981),s. 3 and Sch.II.\n(a)     if the liability of the insurer to the insured person exceeds the liability of the\ninsured person to the third party, nothing in this Chapter shall affect the rights\nof the insured person against the insurer in respect of the excess, and\n(b)     if the liability of the insurer to the insured person is less than the liability of\nthe insured person to the third party, nothing in this Chapter shall affect the\nrights of the third party against the insured person in respect of the balance."
    },
    {
      "provision_ref": "sec98",
      "section": "98",
      "title": "Section 98. Duty to give information as to insurance",
      "content": "(1) No person against whom a claim is\nmade in respect of any liability referred to in clause (b) of sub-section (1) of section 95 shall on\ndemand by or on behalf of the person making the claim refuse to state whether or not he was insured\nin respect of that liability by any policy issued under provisions of this Chapter, or would have been\nso insured if the insurer had not avoided or cancelled the policy, nor shall he refuse, if he was or\nwould have been so insured, to give such particulars with respect to that policy as were specified in\nthe certificate of insurance issued in respect thereof.\n(2) In the event of any person becoming insolvent or making a composition or arrangement\nwith his creditors or in the event of an order being made for the administration of the estate of a\ndeceased person according to the law of insolvency, or in the event of a winding up order being\nmade or a resolution for a voluntary winding up being passed with respect to any company or of a\nreceiver or manager of the company’s business or undertaking being duly appointed or of possession\nbeing taken by or on behalf of the holders of any debentures secured by a floating charge on any\nproperty comprised in or subject to the charge, it shall be the duty of the insolvent debtor, personal\nrepresentative of the deceased debtors or company, as the case may be, or the official assignee or\nreceiver in insolvency, trustee, liquidator, receiver or manager or person in possession of the\nproperty to give at the request of any person claiming that the insolvent debtor, deceased debtor or\ncompany is under such liability to him as is covered by the provisions of this Chapter, such\ninformation as may reasonably be required by him for the purpose of ascertaining whether any rights\nhave been transferred to and vested in him by section 97, and for the purpose of enforcing such\nrights, if any; and any such contract of insurance as purports whether directly or indirectly to avoid\nevents aforesaid, or otherwise to prohibit or prevent the giving thereof in the said events, shall be of\nno effect.\n(3) If, from the information given to any person in pursuance of sub-section (2) or otherwise,\nhe has reasonable ground for supposing that there have or may have been transferred to him under\nthis Chapter rights against any particular insurer, that insurer shall be subject to the same duty as is\nimposed by the said sub-section on the persons therein mentioned.\n(4) The duty to give the information imposed by this section shall include a duty to allow all\ncontracts of insurance, receipts for premiums, and other relevant documents in the possession or\npower of the person on whom the duty is so imposed to be inspected and copies thereof to be taken."
    },
    {
      "provision_ref": "sec99",
      "section": "99",
      "title": "Section 99. Settlement between insurers and insured persons",
      "content": "(1) No settlement made by an\ninsurer in respect of any claim which might be made by a third party in respect of any liability of the\nnature referred to in clause (b) of sub-section (1) of section 95 shall be valid unless such third party\nis a party to the settlement.\n(2) Where a person who is insured under a policy issued for the purposes of this Chapter has\nbecome insolvent, or where, if such insured person is a company, a winding up order has been made\nor a resolution for a voluntary winding up has been passed with respect to the company no\nagreement made between the insurer and the insured person after liability has been incurred to a third\nparty and after the commencement of the insolvency or winding up, as the case may be, nor any\nwaiver, assignment or other disposition made by or payment made to the insured person after the\ncommencement aforesaid shall be effective to defeat the rights transferred to the third party under\nthis Chapter, but those rights shall be the same as if no such agreement, wavier, assignment or\ndisposition or payment has been made."
    },
    {
      "provision_ref": "sec100",
      "section": "100",
      "title": "Section 100. Saving in respect of sections 97, 98 and 99",
      "content": "(1) For the purposes of sections 97, 98\nand 99 a reference to “liabilities to third parties” in relation to a person insured under any policy of\ninsurance shall not include a reference to any liability of that person in the capacity of insurer under\nsome other policy of insurance.\n(2) The provisions of sections 97, 98 and 99 shall not apply where a company is wound up\nvoluntarily merely for the purposes of reconstruction or of an amalgamation with another company."
    },
    {
      "provision_ref": "sec101",
      "section": "101",
      "title": "Section 101. Insolvency of insured persons not to affect liability of insured or claims by third",
      "content": "parties.—Where a certificate of insurance has been issued to the person by whom a policy has been\neffected, the happening in relation to any person insured by the policy of any such event as is\nmentioned in sub-section (1) or sub-section (2) of section 97 shall, notwithstanding anything in the\nChapter, not effect any liability of that person of the nature referred to in clause (b) of sub-section (1)\nof section 95; but nothing in this section shall affect any rights against the insurer conferred under\nthe provisions of section 97, 98 and 99 on the person to whom the liability was incurred."
    },
    {
      "provision_ref": "sec102",
      "section": "102",
      "title": "Section 102. Effect of death on certain causes of action. Notwithstanding anything contained in",
      "content": "section 306 of the Succession Act, 1925 (XXXIX of 1925), the death of a person in whose favour a\ncertificate of insurance 1* * * had been issued, if it occurs after the happening of an event which has\ngiven rise to a claim under the provisions of this Chapter, shall not be a bar to the survival of any\ncause of action arising out of the said event against his estate or against the insurer."
    },
    {
      "provision_ref": "sec103",
      "section": "103",
      "title": "Section 103. Effect of certificate of insurance. When an insurer has issued a certificate of insurance",
      "content": "in respect of a contract of insurance between the insurer and the insured person, then –\n(a)        if and so long as the policy described in the certificate has not been issued by\nthe insurer to the insured, the insurer shall, as between himself and any other\nperson except the insured, be deemed to have issued to the insured person a\npolicy of insurance conforming in all respects with the description and\nparticulars stated in such certificate; and\n(b)        If the insurer has issued to the insured the policy described in the certificate,\nbut the actual terms of the policy are less favorable to persons claiming under\nor by virtue of the policy against the insurer either directly or through the\ninsured than the particulars of the policy as stated in the certificate, the policy\nshall, as between the insurer and any other person except the insured, be\ndeemed to be in terms conforming in all respects with the particulars stated in\nthe said certificate.\n1\nOmitted by the Motor Vehicles (Amdt.) Act, 1947 (XXVII of 1947), s.6 (with effect from the 1st March, 1949)."
    },
    {
      "provision_ref": "sec104",
      "section": "104",
      "title": "Section 104. Duty to surrender certificate on cancellation of policy",
      "content": "(1) Whenever the period of\ncover under a policy of insurance issued under the provisions of this Chapter is terminated or\nsuspended by any means before its expiration by effluxion of time, the insured person shall within\nseven days after such termination or suspension deliver to the insurer by whom the policy was issued\nthe latest certificate of insurance given by the insurer in respect of the said policy, or, if the said\ncertificate has been lost or destroyed, made an affidavit to that effect.\n(2) Whoever fails to surrender a certificate of insurance or to make an affidavit, as the case\nmay be, in accordance with the provisions of this section shall be punishable with fine which may\nextend to fifteen rupees for every day that the offence continues subject to a maximum of five\nhundred rupees."
    },
    {
      "provision_ref": "sec105",
      "section": "105",
      "title": "Section 105. Duty of insurer to notify registering authority cancellation or suspension of the",
      "content": "policy. Whenever a policy of insurance issued under the provisions of this Chapter is cancelled or\nsuspended by the insurer who has issued the policy, the insurer shall within seven days notify such\ncancellation or suspension to the registering authority in whose records the registration of the vehicle\ncovered by the policy of insurance is recorded or to such other authority as the Provincial\nGovernment may prescribe."
    },
    {
      "provision_ref": "sec106",
      "section": "106",
      "title": "Section 106. Production of certificate of insurance",
      "content": "(1) Any person driving a motor vehicle in any\npublic place shall on being so required by a police officer in uniform 1[authorised in this behalf by\nthe Provincial Government] produce the certificate of insurance relating to the use of the vehicle ;\n2\n*                 *                     *                      *                     *                    *   *\n(2) If, where owing to the presence of a motor vehicle in a public place an accident occurs\ninvolving bodily injury to another persons, the driver of the vehicle does not at the time produce the\ncertificate of insurance to a police officer, he shall produce the certificate of insurance at the police\nstation at which he makes the report required by section 89:\n2\n*                 *                     *                      *                     *                    *   *\n3\n[(2A) No person shall be liable to conviction under sub-section (1) or sub-section (2) by\nreason only of the failure to produce the certificate of insurance if, within seven days from the date\non which its production was required under sub-section (1) or, as the case may be, from the date of\noccurrence of the accident, he produces the certificate at such police station as may have been\nspecified by him to the police officer who required its production or, as the case may be, to the police\nofficer at the site of accident or to the officer in charge of the police station at which he reported the\naccident:\nProvided that, except to such extent and with such modifications as may be prescribed the\nprovisions of this sub-section shall not apply to the driver of a transport vehicle.]\n(3) The owner of a motor vehicle shall give such information as he may be required by or on\nbehalf of a police officer empowered in this behalf by the provincial Government to give for the\npurpose of determining whether the vehicle was or was not being driven in contravention of section\n94 and on any occasion when the driver was required under this section to produce his certificate of\ninsurance.\n1\nIns. by the Motor Vehicles (Amdt.) Act, 1947 (XXVII of 1947), s.7 (with effect from the 1st March, 1949).\n2\nOmitted, ibid. (with effect from the 1st March, 1949).\n3\nIns. ibid. (with effect from the 1st March, 1949).\n(4) In this section the expression “produce his certificate of insurance” means produce for\nexamination the relevant certificate of insurance or such other evidence as may be prescribed that the\nvehicle was not being driven in contravention of section 94."
    },
    {
      "provision_ref": "sec107",
      "section": "107",
      "title": "Section 107. Production of certificates of Insurance on application for authority to use vehicle",
      "content": "A Provincial Government may make rules requiring the owner of any motor vehicle when applying\nwhether by payment of a tax or otherwise for authority to use the vehicle in a public place to produce\nsuch evidence as may be prescribed by those rules to the effect that either—\n(a)        on the date when the authority to use the vehicle comes into operation there\nwill be in force the necessary policy of insurance in relation to the use of the\nvehicle by the applicant or by other persons on his order or with his\npermission, or\n(b)        the vehicle is a vehicle to which section 94 does not apply."
    },
    {
      "provision_ref": "sec108",
      "section": "108",
      "title": "Section 108. Co",
      "content": "operative Insurance.— (1) A Provincial Government may, on the application of a\nco-operative society of 1[transport vehicle] owners registered or deemed to have been registered\nunder the Co-operative Societies Act, 1912 (II of 1912), or under an Act of a Provincial Legislature\ngoverning the registration of Co-operative Societies and subject to the control of the Registrar of\nCo-operative Societies of the Province, allow the society to transact the business of an insurer for\nthe purposes of this Chapter 2* * *, subject to the following conditions, namely:__\n(a)        the society shall establish and maintain a fund of not less than twenty-five\nthousand rupees for the first fifty vehicles or fractional part thereof and pro\nrata for every additional vehicle in the possession of members of 3[and insured\nwith,] the society and the said fund shall be lodged in such custody as the\nProvincial Government may prescribe and shall not be available for meeting\nclaims or other expenses except in the event of the winding up of the society;\n4\n[(b) the insurance business of the society shall except to the extent permitted under\nclause (cc) be limited to transport vehicles owned by its members, and its\nliability shall be limited as specified in sub-section (2) of section 95;]\n(c)        the society shall, if required by the Provincial Government, re-insure against\nclaims above 5[such amount as may be specified by the Provincial\nGovernment];\n6\n[(cc) the society may, if permitted by the Provincial Government and subject to\nsuch conditions and limitations as may be imposed by it, accept reinsurances\nfrom other societies allowed to transact the business of an insurer under this\nsection;]\n(d)        the provisions of this Chapter, in so far as they relate to the protection of third\nparties and to the issue and production of certificates, shall apply in respect of\nany insurance effected by the society;\n1\nSubs. by the Motor Vehicles (Amdt.) Act, 1947 (XXVII of 1947), s.8 (with effect from the 1st March, 1949).\n2\nOmitted ibid. (with effect from the 1st March, 1949).\n3\nIns. ibid, (with effect from the 1st March, 1949).\n4\nSubs. ibid., (with effect from the 1st March, 1949).\n5\nSubs. ibid., (with effect from the 1st March, 1949).\n6\nIns. by the Motor Vehicles (Amdt.) Act, 1947 (XXVII of 1947), s.8 (with effect from the 1st March, 1949).\n(e)        an independent authority not associated with the society shall be appointed by\nthe Provincial Government to facilitate and assist in the settling of claims\nagainst the society;\n(f)        the society shall operate on an insurance basis, that is to say,__\n(i)        it shall levy its premiums in respect of a period not exceeding twelve\nmonths, during which period the insured shall be held covered in\nrespect of all accidents arising, subject to the limits of liability\nspecified in 1* * * sub-section (2) of section 95;\n(ii)       it shall charge premiums estimated to be sufficient, having regard to\nthe risks, to meet the capitalised value of all claims arising during the\nperiod of cover, together with an adequate charge for expenses\nattaching to the issue of policies and to the settlement of claims arising\nthereunder;\n(g)        the society shall furnish to the 2[Controller] of Insurance the returns required\nto be furnished by insurers under the provisions of the Insurance Act, 1938 (IV\nof 1938), and the 2[Controller] of Insurance may exercise in respect thereof\nany of the powers exercisable by him in respect of returns made to him under\nthe said Act; and\n3\n[(h)   the society shall, in respect of any business transacted by it of the nature\nreferred to in clause (i) of the proviso to sub-section (1) of section 95, be\ndeemed to be an insurer within the meaning of sub-section (1) of section 10\nand sub-section (6) of section 13 of the Insurance Act,1938 (IV of 1938)].\n4\n[(2) The provisions of the Insurance Act, 1938 (IV of 1938), relating to the winding up of\ninsurance companies shall, to the exclusion of any other law inconsistent therewith and subject to\nsuch modifications as may be prescribed, apply to the winding up of a co-operative society allowed\nto transact the business of an insurer under this section as if it were an insurance company; but save\nas hereinbefore provided, the Insurance Act, 1938 (IV of 1938), shall not apply to such society.]"
    },
    {
      "provision_ref": "sec109",
      "section": "109",
      "title": "Section 109. Duty to furnish particulars of vehicle involved in accident. A registering authority or",
      "content": "the officer in charge of a police station shall, if so required by a person who alleges that he is entitled\nto claim compensation in respect of an accident arising out of the use of a motor vehicle, or if so\nrequired by an insurer against whom a claim has been made in respect of any motor vehicle, furnish\nto that person or to that insurer, as the case may be, on payment of prescribed fee any information at\nthe disposal of the said authority or the said police officer relating to the identification marks and\nother particulars of the vehicle and the name and address of the person who was using the vehicle at\nthe time of the accident or was injured by it."
    },
    {
      "provision_ref": "sec110",
      "section": "110",
      "title": "Section 110. Power to appoint persons to investigate and report on accidents. A Provincial",
      "content": "Government may, by notification in the official Gazette, appoint a person or a body of persons to\ninvestigate and report on accidents involving the death of or bodily injury to any person arising out\nof the use of motor vehicles and the extent to which their claims to compensation have been satisfied\n1\nThe words “clause (b) of omitted ibid.\n2\nSubs. by the Motor Vehicles (Amdt.) Act, 1953 (XIX of 1953),s.6. (with effect from the 15th May, 1950).\n3\nSubs. by the Motor Vehicles (Amdt.) Act, 1947 (XXVII of 1947), s.8 (with effect from the 1st March, 1949).\n4\nSubs. ibid. (with effect from the 1st March, 1949).\nand to advise and assist such persons or their representatives in presenting their claims for\ncompensation:\nProvided that nothing in this section shall confer on any such person or body of persons the\nright to adjudicate in any way on the liability of the insurer or on the amount of damages to be\nawarded except at the express desires of the insurer concerned."
    },
    {
      "provision_ref": "sec111",
      "section": "111",
      "title": "Section 111. Power to make rules",
      "content": "(1) The 1[Federal Government] may make rules for the purpose\nof carrying into effect the provisions of this Chapter.\n(2) Without prejudice to the generality of the foregoing power, such rules may provide for—\n(a)        the forms to be used for the purposes of this Chapter;\n(b)        the making of applications for and the issue of certificates of insurance;\n(c)        the issue of duplicates to replace certificates of insurance 2[mutilated,\ndefaced,] lost or destroyed;\n(d)        the custody, production, cancellation and surrender of certificates of\ninsurance;\n(e)        the records to be maintained by insurers of policies of insurance issued under\nthis Chapter;\n(f)        the identification by certificates or otherwise of persons or vehicles exempted\nfrom the provisions of this Chapter;\n(g)        the furnishing of information respecting policies of insurance by insurers;\n(h)        the carrying into effect of the provisions of section 108;\n(i)        adapting the provisions of this Chapter to vehicles brought into 3[Pakistan] by\npersons making only a temporary stay therein by applying those provisions\nwith prescribed modifications; and\n(j)        any other matter which is to be or may be prescribed.\nOFFENCES, PENALTIES AND PROCEDURE"
    },
    {
      "provision_ref": "sec125",
      "section": "125",
      "title": "Section 125. Driving uninsured vehicles. Whoever drives a motor vehicle or causes or allows a",
      "content": "motor vehicle to be driven in contravention of the provisions of section 94 shall be punishable with\nimprisonment which may extend to three months, or with fine which may extend to five hundred\nrupees, or with both.\n[Chapters IX, X (except section 125) and Schedules I to XI have been repealed in its\napplication to the Province of West Pakistan by the Provincial Motor Vehicles Ordinance, 1965 (XIX\nof 1965), section 122 and 14th Schedule.]                                       Date: 11-11-2024\n157439\n1\nSubs. by the Federal Adaptation of Laws Order, 1975 (F.A.O. No. IV of 1975) , Art. 2 and Table.\n2\nIns. by the Motor Vehicles (Amdt.) Act, 1947 (XXVII of 1947), s.9 (with effect from the 1st March, 1949).\n3\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2 nd Sch. (with effect from the 14th October, 1955), for\n“the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, for “British India”."
    }
  ],
  "definitions": [
    {
      "term": "authorised insurer",
      "definition": "an insurer in whose case the requirements of the Insurance Act, 1938 (VI of 1938). 5* * * with respect to the registration of insurers are complied with and includes, where the business of insuring motor vehicles against third party risks is carried on by the 5[Federal Government] or a Provincial Government 5* * * such Government;]",
      "source_provision": "sec93"
    },
    {
      "term": "certificate of insurance",
      "definition": "a certificate issued by an authorised insurer in pursuance of sub-section (4) of section 95; and includes 6[a cover note complying with such requirements as may be prescribed, and] where more than one certificate has been issued in connection with a policy, or where a copy of certificate has been issued, all those certificates or that copy, as the case may be; 7 * * * * * * * 1 Subs. by the Central Law (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2nd Sch. (with effect from the 14th October, 1955). 2 Subs. by A.O., 1949. 3 Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981)., s.3 and Sch., II.) 4 Subs. by the Motor Vehicles (Amdt.) Act, 1947 (XXVII of 1947), s.2. (with effect from the 1st March, 1949). 5 Subs. Ordinance No. XXVIII of 1981. 6 Ins. by the Motor Vehicles (Amdt.) Act, 1947 (XXVII of 1947), s.2 (with effect from the 1st March, 1949). 7 Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s.3 and Sch.II., which was previously amended by various enactments.",
      "source_provision": "sec93"
    }
  ]
}
