{
  "id": "pk-multi-unit-co-operative-societies-act-1942",
  "type": "statute",
  "title": "Multi-unit Co-operative Societies Act, 1942",
  "title_en": "Multi-unit Co-operative Societies Act, 1942",
  "short_name": "MCSA",
  "status": "in_force",
  "issued_date": "1942-03-01",
  "in_force_date": "1942-03-01",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJeW-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Multi-unit Co-operative Societies Act, 1942 (VI of 1942) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title extent and application.―(1) This Act may be called the Multi",
      "content": "unit\nCo-operative Societies Act, 1942.\n2\n[(2) It extends to the whole of Pakistan.]\n(3) It applies to all co-operative societies with objects not confined to one Province\nincorporated before the commencement of this Act under the Co-operative Societies Act, 1912, (II of\n1912), or under any Act relating to co-operative societies in force in any Province, and to all\nco-operative societies with objects not confined to one Province to be incorporated after the\ncommencement of this Act."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Co",
      "content": "operative societies to which this Act applies registered before commencement of\nthis Act.―(1) A co-operative society to which this Act applies which has been registered in any\nProvince under the law relating to co-operative societies in force in that Province shall be deemed in\nany other Province to which its objects extend to be duly registered in that other Province under the\nlaw there in force relating to co-operative societies, but shall, save as provided in sub-sections (2)\nand (3), be subject for all the purposes of registration, control and dissolution to the law relating to\nco-operative societies in force for the time being in the Province in which it is actually registered.\n(2) Where any such co-operative society has established before the commencement of this\nAct or establishes after the commencement of this Act a branch or place of business in a Province\nother than that in which it is actually registered, it shall, within six months from the commencement\nof this Act or the date of establishment of the branch or place of business, as the case may be, furnish\nthe Registrar of Co-operative Societies of the Province in which such branch or place of business is\nsituated a copy of its registered bye-laws, and shall at any time it is required to do so by the said\nRegistrar submit any returns and supply any information which the said Registrar might require to be\nsubmitted or supplied to him by a co-operative society actually registered in that Province.\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1942, Pt. V, p. 17.\nThe Act has been applied to Baluchistan, see Notification No. 54-F, dated the 9th April, 1942, Gazette of India, 1942, Pt. I, p. 682.\nIt has been extended to the Leased Areas of Baluchistan by the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950).\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for the original\nsub-section (2), as amended by A. O., 1949.\n(3) The Registrar of Co-operative Societies of the Province in which a branch or place of\nbusiness such as is referred to in sub-section (2) is situated may exercise in respect of that branch or\nplace of business any powers of audit and of inspection which he might exercise in respect of a\nco-operative society actually registered in the Province."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Co",
      "content": "operative societies to which this Act applies registered after commencement of\nthis Act.―(1) A society which might, if its objects were confined to one Province, be registered as a\nco-operative society in any Province under the law relating to co-operative societies in force in that\nProvince, shall, notwithstanding that its objects are not confined to the Province in which its\nprincipal place of business is to be situated, be deemed for the purposes of registration as a\nco-operative society to be situated wholly in that Province, and may be registered by the Registrar of\nCo-operative Societies of that Province in accordance with the law relating to co-operative societies\nfor the time being in force in that Province, and if so registered shall be deemed in any other\nProvince to which its objects extend to be duly registered in that other Province under the law there\nin force relating to co-operative societies but shall, save as provided in sub-sections (2) and (3), be\nsubject for all the purposes of registration, control and dissolution to the law relating to co-operative\nsocieties in force for the time being in the Province in which it is actually registered.\n(2) Where any such co-operative society establishes a branch or place of business in a\nProvince other than that in which it is actually registered, it shall within six months from the date of\nestablishment of the branch or place of business furnish to the Registrar of Co-operative Societies of\nthe Province in which such branch or place of business is situated a copy of its registered bye-laws,\nand shall at any time it is required to do so by the said Registrar submit any returns and supply any\ninformation which the said Registrar might require to be submitted or supplied to him by a\nco-operative society actually registered in that Province.\n(3) The Registrar of Co-operative Societies of the Province in which a branch or place of\nbusiness such as is referred to in sub-section (2) is situated may exercise in respect of that branch or\nplace of business any powers of audit and of inspection which he might exercise in respect of a\nco-operative society actually registered in that Province.\n1\n[3A. Co-operative Societies to which this Act applies registered in the Federal\nCapital.―(1) A society which might, if its objects were confined to the Federal Capital, be\nregistered as a co-operative society in the Federal Capital under the law relating to co-operative\nsocieties in force therein, shall, notwithstanding that its objects are not confined to the Federal\nCapital, be deemed for the purpose of registration as a co-operative society to be situated wholly in\nthe Federal Capital , and may be registered, in accordance with the law relating to co-operative\nsocieties for the time being in force in the Federal Capital, by the Registrar of Co-operative Societies\nof the Federal Capital appointed by the Federal Government, and if so registered shall be deemed in\nany Province to which its objects extend to be duly registered in that Province under the law there in\nforce relating to co-operative societies but shall, save as provided in sub-sections (2) and (3), be\nsubject for all the purposes of registration, control and dissolution to the law relating to co-operative\nsocieties in force for the time being in the Federal Capital, reference in that law to “Registrar” being\nconstrued as a reference to the said Registrar of Co-operative Societies appointed by the Federal\nGovernment.\n1\nIns. by the Multi-unit Co-operative Societies (Amdt.) Ordinance, 1979 (5 of 1979),s.2.\n(2) Where any such co-operative society establishes a branch or place of business in any\nProvince, it shall within six months from the date of establishment of the branch or place of business\nfurnish to the Registrar of Co-operative Societies of the Province in which such branch or place of\nbusiness is situated a copy of its registered bye-laws, and shall at any time it is required to do so by\nthe said Registrar submit any returns and supply any information which the said Registrar might\nrequire to be submitted or supplied to him by a co-operative society actually registered in that\nProvince.\n(3) The Registrar of Co-operative Societies of the Province in which a branch or place of\nbusiness such as is referred to in sub-section (2) is situated may exercise in respect of that branch or\nplace of business any powers of audit and of inspection which he might exercise in respect of a co-\noperative society actually registered in that Province.]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Appointment and powers of Central Registrar of Co",
      "content": "operative Societies.―(1) The\n2\n[Central] Government may, if it thinks fit, appoint a 2[Central] Registrar of Co-operative Societies.\n(2) The 2[Central] Registrar of Co-operative Societies, if appointed, shall exercise in respect\nof any co-operative society to which this Act applies, to the exclusion of Provincial Registrars, the\npowers and functions exercisable by the Registrar of Co-operative Societies of the Province in which\nsuch society is actually registered."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Penalty for failure to furnish information required under this Act. If any co",
      "content": "operative\nsociety fails to furnish the information which it is required to furnish by or under sub-section (2) of\nsection 2 or sub-section (2) of section 3, or to submit any return required to be submitted under either\nof those sub-sections, the society, and any officer or member of the society responsible for the\nfailure, shall each be liable to fine which may extend to fifty rupees, and the registration of the\nsociety may, at the discretion of the Registrar of Co-operative Societies of the Province in which the\nsociety is actually registered, be cancelled."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power of 1[Federal Government] to make rules.―The 2[Federal] Government may, by",
      "content": "notification in the official Gazette, make rules for carrying into effect the provisions of this Act.\n1\nSubs by F. A. O., 1975, Art. 2 and Table, for “Central Government”.\n2\nSubs. for “Central” by pb.A.O.,0.1.00. 1974"
    }
  ],
  "definitions": []
}
