{
  "id": "pk-muslim-family-laws-ordinance-1961",
  "type": "statute",
  "title": "Muslim Family Laws Ordinance, 1961",
  "title_en": "Muslim Family Laws Ordinance, 1961",
  "short_name": "MFLO",
  "status": "in_force",
  "issued_date": "1961-03-01",
  "in_force_date": "1961-03-01",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5po-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Muslim Family Laws Ordinance, 1961 (VIII of 1961) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Omitted",
      "content": "ORDINANCE NO. VIII OF 1961\n[2nd March, 1961]\nAn Ordinance to give effect to certain recommendations of the Commission on Marriage and\nFamily Laws\nWHEREAS it is expedient to give effect to certain recommendations of the Commission on\nMarriage and Family Laws;\nNow, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958,\nand in exercise of all powers enabling him in that behalf, the President is pleased to make and\npromulgate the following Ordinance:⸺"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, application and commencement",
      "content": "(1) This Ordinance may be called\n(2) It extends to the whole of Pakistan, and applies to all Muslim citizens of Pakistan,\nwherever they may be.\n(3) It shall come into force on such date 1as the 2[Federal Government] may, by notification\nin the official Gazette, appoint in this behalf."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Ordinance unless there is anything repugnant in the subject or\ncontext,⸺\n(a)        “Arbitration Council” means a body consisting of the Chairman 3[* * * *] and\na representative of each of the parties to a matter dealt with in this\nOrdinance 4[:]\n5\n[Provided that where any party fails to nominate a representative\nwithin the prescribed time, the body formed without such representative shall\nbe the Arbitration Council;]\n6\n[(b)   ‘Chairman’ means the Chairman of the Union Council or a person appointed\nby the 7[2[Federal Government] in the Cantonment areas, or by the\nProvincial Government in other areas,] or by an officer authorized in that\nbehalf by any such Government, to discharge the functions of Chairman\nunder this Ordinance:\n_________________________________________________________________________________\n1\nThe 15th day of July, 1961, see Gaz. of P., S.R.O. 56 (R), 1961, Ext., p. 1128.a.\n2\nSubs.by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n3\nThe words “of the Union Council” omitted by the Muslim Family Laws (Amdt.) Ordinance, 1961 (XXI of 1961), s. 2.\n4\nSubs., ibid, for semi-colon.\n5\nProviso added, ibid.\n6\nSubs ibid, for the original clause (b).\n7\nSubs. by A.O., 1964, Art. 2 and Sch., for “Central or a Provincial Government”.\nProvided that where the Chairman of the Union Council is a non-\nMuslim, or he himself wishes to make an application to the Arbitration\nCouncil, or is, owing to illness or any other reason, unable to discharge the\nfunctions of Chairman, the Council shall elect one of its Muslim members as\nChairman for the purposes of this Ordinance;]\n(c)        “Prescribed” means prescribed by rules made under section 11;\n(d)        “Union Council” means the Union Council or the Town or Union Committee\nconstituted under the Basic Democracies Order, 1959, and 1[having in the\nmatter jurisdiction as prescribed];\n(e)        “Ward” means a ward within a Union or Town as defined in the aforesaid\nOrder."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Ordinance to override other laws, etc.⸺(1) The provisions of this Ordinance shall have",
      "content": "effect notwithstanding any law, custom or usage, and the registration of Muslim marriages shall\ntake place only in accordance with those provisions.\n(2) For the removal of doubt, it is hereby declared that the provisions of the Arbitration Act,\n1940 (X of 1940), the Code of Civil Procedure 1908 (Act V of 1908), and any other law regulating\nthe procedure of courts shall not apply to any Arbitration Council."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Succession.⸺ 2 [(1)] In the event of the death of any son or daughter of the propositus",
      "content": "before the opening of succession, the children of such son or daughter, if any, living at the time the\nsuccession opens, shall per stripes receive a share equivalent to the share which such son or\ndaughter, as the case may be, would have received if alive.\n2\n[(2) If a Muslim male from Ahl-e-Teshih dies, the share of a widow in the immovable\nproperty left behind by her deceased husband shall be as follows:―\n(a)        one-fourth share of the fixed price or value of the property, if there is no child\nleft behind the deceased husband; and\n(b)        one-eighth share, if there is child left behind.\n(3) If there are two or more widows, the share, as mentioned in sub-section (2), shall be\ndivided equally among them.\n(4) The price or value of the property shall be the price or value existing at the time of\npayment and not the price or value which existed at the time of death of the husband:\nProvided that if the legal heirs of the deceased do not give the widow her share in the above\nterms, she shall become entitled to her due share in the corpus of immovable property.\n(5) A widow is entitled to her share in the corpus of movable property of her deceased\nhusband provided that the provisions of sub-sections (2) and (3) shall mutatis mutandis apply.\n1\nSubs. by the Muslim Family Laws (Amdt.) Ordinance, 1961 (XXI of 1961), s. 2, for “having jurisdiction in the area concerned”.\n2\nRenumbered as sub-section (1) and added new sub-sections from (2) to (8) by Act, XXVIII of 2021, s. 2.\n(6) Fiqah-e-Jafri recognizes right of a husband to get his share from the property left by his\ndeceased wife, either movable or immovable, as follows:⸺\n(a)     one-half share, if there is no child left behind; and\n(b)     one-fourth share of the property, if there is child left behind.\n(7) In case of dispute, the parties or any of the parties may have recourse to a court of\ncompetent jurisdiction or by approaching the Mujtahid-e-Alam from the panel maintained by the\nCouncil of Islamic Ideology. The decision of Mujtahid-e-Alam shall have a status of an award and\n1940).\nExplanation.—The expression “Mujtahid-e-Alam (Faqih-e-Azam)” means a juris-consult,\nreligious scholar or doctor of Shia school of thought well versed with Shariah having international\nrepute and of such recognition. The Council of Islamic Ideology shall maintain a panel of Mujtahid-\ne-Alam having aforesaid qualifications.\n(8) As enshrined in Article 227 of the Constitution of the Islamic Republic of Pakistan, the\ninheritance rights of Ahl-e-Tashih and matters connected therewith or ancillary thereto shall be\ndecided according to their personal law interpreted by Fiqah-e-Jafria (Shia school of thought).]"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Registration of marriages.⸺(1) Every marriage solemnized under Muslim Law shall be",
      "content": "registered in accordance with the provisions of this Ordinance.\n(2) For the purpose of registration of marriages under this Ordinance, the Union Council\nshall grant licences to one or more persons, to be called Nikah Registrars, but in no case shall more\nthan on Nikah Registrar be licensed for any one Ward.\n(3) Every marriage not solemnized by the Nikah Registrar shall, for the purpose of\nregistration under this Ordinance, be reported to him by the person who has solemnized such\nmarriage.\n(4) Whoever contravenes the provisions of sub-section (3) shall be punishable with simple\nimprisonment for a term which may extent to three months, or with fine which may extend to one\nthousand rupees, or with both.\n(5) The form of nikah nama, the registers to be maintained by Nikah Registrars, the records\nto be preserved by Union Councils, the manner in which marriages shall be registered and copies of\nnikah nama shall be supplied to the parties and the fees to be charged thereof, shall be such as may\nbe prescribed.\n(6) Any person may, on payment of the prescribed fee, if any, inspect at the office of the\nUnion Council the record preserved under sub-section (5), or obtain a copy of any entry therein."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Polygamy.⸺(1) No man, during the subsistence of an existing marriage, shall, except",
      "content": "with the previous permission in writing of the Arbitration Council, contract another marriage, nor\nshall any such marriage contracted without such permission be registered under this Ordinance.\n(2) An application for permission under sub-section (1) shall be submitted to the Chairman\nin the prescribed manner, together with the prescribed fee, and shall state reasons for the proposed\nmarriage, and whether the consent of the existing wife or wives has been obtained thereto.\n(3) On receipt of the application under sub-section (2), t h e Chairman shall ask the\napplicant and his existing wife or wives each to nominate a representative, and the Arbitration\nCouncil so constituted may, if satisfied that the proposed marriage is necessary and just, grant,\nsubject to such conditions, if any, as may be deemed fit, the permission applied for.\n(4) In deciding the application the Arbitration Council shall record its reasons for the\ndecision, and any party may, in the prescribed manner, within the prescribed period, and on payment\nof the prescribed fee, prefer an application for revision, 1 [to the Collector] concerned and his\ndecision shall be final and shall not be called in question in any Court.\n(5) Any man who contracts another marriage without the permission of the Arbitration\nCouncil shall⸺\n(a)        pay immediately the entire amount of the dower, whether prompt or deferred,\ndue to the existing wife or wives, which amount, if not so paid, shall be\nrecoverable as arrears of land revenue; and\n(b)        on conviction upon complaint be punishable with simple imprisonment which\nmay extend to one year, or with fine which may extend to five thousand\nrupees, or with both."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Talaq",
      "content": "(1) Any man who wishes to divorce his wife shall, as soon as may be after the\npronouncement of talaq in any form whatsoever, give the Chairman notice in writing of his having\ndone so, and shall supply a copy thereof to the wife 2[:]\n2\n[Provided that where the parties belong to Fiqah-e-Jafria,⸺\n(a)        the man may voluntarily and with his free will pronounce himself or through\nduly authorized attorney (Vakil) Talaq uttering in literal Arabic words\n(seegha) in the physical presence of at least two witnesses qualifying the\nrequirements of clause (1) of Article 17 of the Qanun-e-Shahadat, 1984 (P.O.\nNo. 1 of 1984);\n(b)        the pronouncement of Talaq shall be ineffective if it is done jokingly or under\nanger, intoxication, insanity, duress or coercion of any kind and from any\ncorner whatsoever; and\n(c)        in case of dispute, with reference to clauses (a) or (b) arising due to difference\nof opinion, the parties or any of the parties may have recourse to a court of\ncompetent jurisdiction or by approaching the “Mujtahid-e-Alam” and the\ndecision of Mujtahid-e-Alam shall have a status of an award and the same\nshall be dealt with in accordance with the provisions of the Arbitration Act,\n1940 (X of 1940).\nExplanation.⸺The expression “Mujtahid-e-Alam (Faqih-e-Azam)” means a juris-consult,\nreligious scholar or doctor of Shia school of thought well versed with Shariah having international\nrepute and of such recognition. The Council of Islamic Ideology shall maintain a panel of Mujtahid-\ne-Alam having aforesaid qualifications.]\n_________________________________________________________________________________\n1\nSubs. by F.A.O., 1975, Art. 2 & Sch., for certain words.\n2\nSubs. and ins. by the Muslim Family Law (Second Amendment) Act, 2021 (XXIX of 2021), s. 2.\n1\n[(1A) As enshrined in Article 227 of the Constitution of the Islamic Republic of Pakistan,\nthe divorce and matters connected therewith or ancillary thereto shall be decided according to the\npersonal law interpreted by Fiqah-e-Jafria (Shia school of thought).]\n(2) Whoever contravenes the provisions of sub-section (1) shall be punishable with simple\nimprisonment for a term which may extend to one year or with fine which may extend to five\nthousand rupees or with both.\n(3) Save as provided in sub-section (5), a talaq unless revoked earlier, expressly or\notherwise shall not be effective until the expiration of ninety days from the day on which notice\nunder sub-section (1) is delivered to the Chairman.\n(4) Within thirty days of the receipt of notice under sub-section (1), the Chairman shall\nconstitute an Arbitration Council for the purpose of bringing about a reconciliation between the\nparties, and the Arbitration Council shall take all steps necessary to bring about such reconciliation.\n(5) If the wife be pregnant at the time talaq is pronounced, talaq shall not be effective until\nthe period mentioned in sub-section 2[(3)] or the pregnancy, whichever be later, ends.\n(6) Nothing shall debar a wife whose marriage has been terminated by talaq effective under\nthis section from re-marrying the same husband, without an intervening marriage with a third person\nunless such termination is for the third time so effective."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Dissolution of marriage otherwise than by talaq.⸺Where the right to divorce has been",
      "content": "duly delegated to the wife and she wishes to exercise that right, or where any of the parties to a\nmarriage wishes to dissolve the marriage otherwise than by talaq, the provisions of section 7 shall,\nmutatis mutandis and so far as applicable, apply."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Maintenance.⸺(1) If any husband fails to maintain his wife adequately, or where there",
      "content": "are more wives than one, fails to maintain them equitably, the wife, or all or any of the wives, may\nin addition to seeking, any other legal remedy available apply to the Chairman who shall constitute\nan Arbitration Council to determine the matter, and the Arbitration Council may issue a certificate\nspecifying the amount which shall be paid as maintenance by the husband.\n(2) A husband or wife may, in the prescribed manner, within the prescribed period, and on\npayment of the prescribed fee, prefer an application for revision of the certificate, 3 [to the Collector]\nconcerned and his decision shall be final and shall not be called in question in any Court.\n(3) Any amount payable under sub-section (1) or (2), if not paid in due time, shall be\nrecoverable as arrears of land revenue."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Dower.⸺Where no details about the mode of payment of dower are specified in the",
      "content": "nikah nama, or the marriage contract, the entire amount of the dower shall be prescribed to\nbe payable on demand.\n_________________________________________________________________________________\n1\nIns. new sub-section (1A) by the Muslim Family Law (Second Amendment) Act, 2021 (XXIX of 2021), s. 2.\n2\nSubs. by the Muslim Family Law (Second Amendment) Ordinance, 1961 (XXX of 1961), s. 2 for “(2)”.\n3\nSubs. by F.A.O., 1975, Art., 2 and Sch., for certain words."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Power to make rules.⸺(1) The 1[2[Federal Government] in respect of the Cantonment",
      "content": "areas and the Provincial Government in respect of other areas] may make rules to carry into effect\n(2) In making rules under this section, the 1 [such Government] may provide that a breach\nof any of the rules shall be punishable with simple imprisonment which may extend to one month,\nor with fine which may extent to two hundred rupees, or with both.\n(3) Rules made under this section shall be published in the official Gazette, and shall\nthereupon have effect as if enacted in this Ordinance."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. [Amendment of Child Marriage Restraint Act, 1929 (XIX of 1929).] Omitted by the",
      "content": "Federal Laws (Revision and declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch., II."
    }
  ],
  "definitions": [
    {
      "term": "Arbitration Council",
      "definition": "a body consisting of the Chairman 3[* * * *] and a representative of each of the parties to a matter dealt with in this Ordinance 4[:] 5 [Provided that where any party fails to nominate a representative within the prescribed time, the body formed without such representative shall be the Arbitration Council;] 6 [(b) ‘Chairman’ means the Chairman of the Union Council or a person appointed by the 7[2[Federal Government] in the Cantonment areas, or by the Provincial Government in other areas,] or by an officer authorized in that behalf by any such Government, to discharge the functions of Chairman under this Ordinance: _________________________________________________________________________________ 1 The 15th day of July, 1961, see Gaz. of P., S.R.O. 56 (R), 1961, Ext., p. 1128.a. 2 Subs.by F.A.O., 1975, Art. 2 and Table, for “Central Government”. 3 The words “of the Union Council” omitted by the Muslim Family Laws (Amdt.) Ordinance, 1961 (XXI of 1961), s. 2. 4 Subs., ibid, for semi-colon. 5 Proviso added, ibid. 6 Subs ibid, for the original clause (b). 7 Subs. by A.O., 1964, Art. 2 and Sch., for “Central or a Provincial Government”. Provided that where the Chairman of the Union Council is a non- Muslim, or he himself wishes to make an application to the Arbitration Council, or is, owing to illness or any other reason, unable to discharge the functions of Chairman, the Council shall elect one of its Muslim members as Chairman for the purposes of this Ordinance;]",
      "source_provision": "sec2"
    },
    {
      "term": "Prescribed",
      "definition": "prescribed by rules made under section 11;",
      "source_provision": "sec2"
    },
    {
      "term": "Union Council",
      "definition": "the Union Council or the Town or Union Committee constituted under the Basic Democracies Order, 1959, and 1[having in the matter jurisdiction as prescribed];",
      "source_provision": "sec2"
    },
    {
      "term": "Ward",
      "definition": "a ward within a Union or Town as defined in the aforesaid Order.",
      "source_provision": "sec2"
    }
  ]
}
