{
  "id": "pk-mussalman-wakf-validating-act-1913",
  "type": "statute",
  "title": "Mussalman Wakf Validating Act, 1913",
  "title_en": "Mussalman Wakf Validating Act, 1913",
  "short_name": "MWVA",
  "status": "in_force",
  "issued_date": "1913-03-06",
  "in_force_date": "1913-03-06",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apiZ-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Mussalman Wakf Validating Act, 1913 (VI of 1913) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent",
      "content": "(1) This Act may be called the Mussalman Wakf Validating\nAct, 1913.\n2\n[(2) It extends to the whole of Pakistan.]\n3\n[(3) It shall be deemed to apply to wakfs created before its commencement :\nProvided that nothing herein contained shall be deemed in any way to affect any right, title,\nobligation or liability already acquired, accrued or incurred before the twenty-fifth day of July,\n1930.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(1)        \" Wakf \" means the permanent dedication by a person professing the\n4\n[Muslim] faith of any property for any purpose recognized by the 4[Muslim]\nlaw as religious, pious or charitable.\n(2)        \" Hanafi 4[Muslim] \" means a follower of the 4[Muslim], faith who conforms\nto the tenets and doctrines of the Hanafi school of 4[Muslim] law."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Power of 4[Muslims] to create certain wakfs. It shall be lawful for any person professing",
      "content": "4\nthe [Muslim] faith to create a wakf which in all other respects is in accordance with the provisions\nof 4[Muslim] law, for the following among other purposes:—\n(a)        for the maintenance and support wholly or partially of his family, children or\ndescendants, and\n(b)        where the person creating a wakf is a Hanafi 4[Muslim], also for his own\nmaintenance and support during is lifetime or for the payment of his debts out\nof the rents and profits of the property dedicated:\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1911, Pt. V, p. 107; for Report of Select Committee, see ibid., 1913, Pt. V,   p.39;\nand for Proceedings in Council, see ibid., 1911, Pt. VI, p.402 and ibid., 1913, Pt. VI, pp.29, 65 and 147.\nThis act has been amended to the extent of Islamabad Capital Territory, see Ord. 27 of 1981, s. 5 and 4th Sch.\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2nd Sch. (with effect from the 14th October, 1955), for   the\noriginal sub-section (2) as amended by A.O., 1949, Arts. 3 (2) and 4.\n3\nNew sub-section (3) added by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s.3 and Sch. II.\n4\nSubs. by F.A.O, 1975, Art. 2 and Table, for “Mussalman” and “Mussalmans”.\nProvided that the ultimate benefit is in such cases expressly or impliedly reserved for the poor\nor for any other purpose recognised by the 1[Muslim] law as a religious, pious or charitable purpose\nof a permanent character."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Wakfs not to be invalid by reason of remoteness of benefit to poor, etc. No such wakf",
      "content": "shall be deemed to be invalid merely because the benefit reserved therein for the poor or other\nreligious, pious or a permanent nature is postponed until after the extinction of the family, children or\ndescendants of the person creating the wakf."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Saving of local and sectarian custom. Nothing in this Act shall affect any custom or",
      "content": "usage whether local or prevalent among 1[Muslims] of any particular class or sect.\n______________\nDate: 11-09-2024\n1\nSubs. by F.A.O, 1975, Art. 2 and Table, for “Mussalman” and “Mussalmans”."
    }
  ],
  "definitions": []
}
