{
  "id": "pk-national-accountability-ordinance-1999",
  "type": "statute",
  "title": "National Accountability Ordinance, 1999",
  "title_en": "National Accountability Ordinance, 1999",
  "short_name": "NAO",
  "status": "in_force",
  "issued_date": "1999-09-23",
  "in_force_date": "1999-09-23",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5ljaQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Accountability Ordinance, 1999 (XVIII of 1999) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. National Accountability Bureau",
      "content": "(a)        There shall be constituted a National Accountability Bureau for the whole of\nPakistan.\n2\n[(b)   Chairman, National Accountability Bureau: —\n(i)   There shall be a Chairman, National Accountability Bureau to be\nappointed by the Federal Government after consultation between the\nLeader of the House and the Leader of the Opposition in the National\nAssembly:\nProvided that the consultation between Leader of the House\nand Leader of the Opposition shall be initiated two months prior to the\nexpiry of the term of outgoing Chairman and shall be concluded within\nthe period of forty five days;\n(ii)        If there is no consensus on the name of the Chairman, the names\nproposed by the Leader of the House and the Leader of the Opposition\nshall be forwarded by the Chairman of the Senate and Speaker of the\n1\nNew section 5B ins. by Ord. No. 35 of 2001. s. 4.\n2\nSubs. by Act XI of 2022, s. 5\n3\nSubs. by Act XVI of 2022, s.4\nNational Assembly, as the case may be, to the Parliamentary Committee\nappointed under clause (iii), which may confirm any one name for\nappointment as Chairman:\nProvided that the Leader of the House and Leader of the opposition\nshall propose two names each for consideration of the Parliamentary\nCommittee;\n(iii)      The Parliamentary Committee under clause (ii) shall be constituted by the\nSpeaker, National Assembly, comprising fifty percent members from the\ntreasury benches and fifty percent from the opposition benches, based on\ntheir strength in Majlis-e-Shoora (Parliament), to be nominated by the\nrespective Parliamentary Leaders:\nProvided that the Parliamentary Committee shall recommend the\nname of the Chairman not later than thirty days;\n(iv)       The total strength of the Parliamentary Committee shall be twelve members\nout of which one third shall be from the Senate. If the National Assembly\nstands dissolved at the material time, all the members of the Committee\nshall be from the Senate;\n(v)        The Chairman shall, on such terms and conditions as may be determined by\nthe Federal Government, hold office for a non- extendable term of three\nyears and shall not be eligible for subsequent appointment as Chairman and\nshall not be removed from office except on the grounds and in the manner\nas provided in Article 209 of the Constitution:\n5\n[Provided that as and when the office of the Chairman NAB falls\nvacant or when the Chairman NAB is absent or unable to perform the\nfunctions of his office, due to any reason whatsoever, the Deputy Chairman\nNAB shall act as Chairman NAB and in absence of Deputy Chairman NAB,\namongst the senior officers of the NAB; and]\n(vi)       The Chairman may, by writing under his hand, addressed to the Federal\nGovernment, resign from his office.]\n2\n[(ba) A person shall not be appointed as Chairman NAB unless he—\n(i)        is a retired Chief Justice or a Judge of the Supreme Court or a Chief Justice\nof a High Court; or\n(ii)       is a retired officer of the Armed Forces of Pakistan equivalent to the rank\nof a Lieutenant General; or\n(iii)      is a retired Federal Government Officer in BPS 22 or equivalent.]\n4\n[(c) *      *      *     *      *      *     *]"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Deputy Chairman, National Accountability Bureau",
      "content": "(a)        There shall be a Deputy Chairman NAB appointed by the 3[Federal Government]\nin consultation with the Chairman NAB. The Deputy Chairman 1[NAB] shall assist\nthe Chairman 1[NAB] in the performance of his duties and 1[shall] carry out such\nfunctions as may be directed by the Chairman 1[NAB].\n1\nIns. by the National Accountability Bureau (Amdt.) Ordinance, 2002 (133 of 2002), s. 8.\n2\nNew sub-section (ba) added ibid. s. 7.\n3\nSubs. by the Act XI, 2022, s. 6.\n4\nOmitted by Act XVI of 2022, s.5\n5\nSubs by Act No. XXIV of 2023, s. 2.\n1\n[(aa) A person shall not be appointed as Deputy Chairman NAB unless he—\n(i)         is or has been an officer of the Armed Forces of Pakistan equivalent to\nthe rank of a Major General 10[or above] ; or\n(ii)        is or has been a Federal Government officer in BPS 21 or equivalent 10[or\nabove] ;]\n3\n[(b)   The Deputy Chairmen 2[NAB] shall hold office for a 2[non-extendable] period\nof three years and shall not be removed except on the ground of misconduct as\ndefined in 10[the rules relating to efficiency and discipline of civil servants of\n1973)].]"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Prosecutor General Accountability",
      "content": "4[(a) (i) The 9[Federal Government, on\nrecommendation of] the 5[* * *] Chairman NAB, may appoint any person, who is qualified to be\nappointed as a Judge of the Supreme Court, as Prosecutor General Accountability.\n6\n[(ii)   Subject to the provisions of 10[this Ordinance], the Prosecutor General\nand Special Prosecutors shall render independent advice to the\nChairman and shall ensure fair, consistent, uniform, non-discriminatory\nand expeditious prosecution of cases and in doing so shall protect and\naccord all lawful rights and interests of the accused persons.]\n6\n[(iii) The Prosecutor General Accountability shall hold office for 9[**]\nextendable term of three years.]\n(iv)        The Prosecutor General Accountability shall not be removed from office\nexcept on the grounds of removal of a Judge of Supreme Court of\nPakistan.\n(v)         The Prosecutor General Accountability may, by writing under his hand\naddressed to the 6[Federal Government], resign his office.]\n(b)        The Prosecutor General 7[Accountability] shall give advice to the Chairman\nNAB upon such legal matters and perform such other duties of a legal character\nas may be referred or assigned to him by the Chairman NAB and in the\nperformance of his duties, he shall have the right of audience in all 8[Courts\nestablished under this Ordinance and all other 10[courts] 7[including the\nSupreme Court and a High Court] 10[and tribunals]] in Pakistan.\n1\nNew sub-section (aa) ins. by Ord. No.133 of 2002, s.8.\n2\nIns. by the National Accountability Bureau (Amdt.) Ordinance, 2002 (133 of 2002), s. 8.\n3\nSubs. by the National Accountability Bureau (Amdt.) Ord. 2001 (35 of 2001), s.6., for sub-section (b).\n4\nSubs. by the National Accountability Bureau (Amdt.) Ord. 2001 (35 of 2001), s.7., for sub-section (a).\n5\nThe words “Chief Justice of Pakistan and” omitted by the National Accountability Bureau (Amdt) Ord. 2002 (133 of 2002), s. 9.\n6\nSubs. by the Act XI of 2022, s. 7.\n7\nIns. by the National Accountability Bureau (Amdt) Ord. 2002 (133 of 2002), s. 9.\n8\nSubs. by the National Accountability Bureau (Amdt) Ord. 2000 (4 of 2000), s.5, for certain words.\n9\nSubs. and Omitted by Act XVI of 2022, s.6.\n10\nIns. and Subs. by Act No. XXIV of 2023 ss. 5&6.\n1\n[(c)   The Prosecutor General Accountability, with the approval of Chairman NAB\n2\n[* * *] may appoint Special Prosecutors to conduct prosecution of cases and to\nappoint advocates to institute or defend cases, appeals, petitions, applications\nand all other matters before any 3[Court or courts or tribunals] including the\nHigh Courts and Supreme Court in matters arising out of or relating to\nproceedings under this Ordinance.]\n4\n[(d)   In case the Prosecutor General Accountability is absent or unable to perform the\nfunctions of his office due to any reason whatsoever, any other Law Officer of\nGeneral Accountability.]\n5\n[(e)   Chairman, NAB shall provide Investigation Report to the Prosecutor General\nand seek concurrence of the Prosecutor General for commencement or\ncontinuation of prosecution.]\n6\n[9. Corruption and corrupt practices.—(a) A holder of a public office, or any other\nperson, is said to commit or to have committed the offence of corruption and corrupt practices—\n(i) if he accepts or obtains from any person or offers any gratification directly or\nindirectly, other than legal remuneration, as a motive or reward such as is specified\nin section 161 of the Pakistan Penal Code (Act XLV of 1860) for doing or\nforbearing to do any official act, or for showing or for bearing to show, in the\nexercise of his official functions, favour or disfavour to any person, or for rendering\nor attempting to render any service or disservice to any person; or\n(ii) if he accepts or obtains or offers any valuable thing without consideration, or for\na consideration which he knows to be inadequate, from any person whom he\nknows to have been, or likely to be, concerned in any proceeding or business\ntransacted or about to be transacted by him, or having any connection with his\nofficial functions or from any person whom he knows to be interested in or related\nto the person so concerned; or\n(iii) if he dishonestly or fraudulently mis-appropriates or otherwise converts for his\nown use, or for the use of any other person, any property entrusted to him, or under\nhis control, or willfully allows any other person so to do; or\n(iv) if he by corrupt, dishonest, or illegal means, obtains or, seeks to obtain for himself,\nor for his spouse or dependents or any other person, any property, valuable things\nor pecuniary advantage; or\n(v) if he or any of his dependents or other Benamidars, through corrupt and dishonest\nmeans, owns, possesses or acquires rights or title in assets substantially dis-\nproportionate to his known sources of income which he can not reasonably account\nfor.\n1\nSubs. by Ord. no.35 of 2001, s.7, for sub-section (c).\n2\nThe certain words omitted by Ord. 133 of 2002, s.9.\n3\nSubs. by Act. No XXIV of 2023 by s.6.\n4\nNew sub-section (d) ins. By the National Accountability Bureau (amdt) Ord. 2002 (133 of 2002), s.9.\n5\nIns. by the Act XI of 2022, s. 7.\n6\nSub. by the Act XI of 2022, s. 8.\nExplanation I.—The valuation of immovable property shall be reckoned on the\ndate of purchase either according to the actual price shown in the relevant title\ndocuments or the applicable rates prescribed by District Collector or the Federal\nBoard of Revenue whichever is higher. No evidence contrary to the later shall\nbe admissible.\nExplanation II.—For the purpose of calculation of movable assets, the sum\ntotal of credit entries of bank account shall not be treated as an asset. Bank\nbalance of an account on the date of initiation of inquiry may be treated as a\nmovable asset. A banking transaction shall not be treated as an asset unless there\nis evidence of creation of corresponding asset through that transaction.\n(vi) if he intentionally misuses his authority by dis-regarding law so as to gain any\nmonetary benefit or favour for himself or any other person related to him or on his\nbehalf.\nExplanation I.—That an act done in good faith and in discharge of duties and\nperformance of official function shall not constitute an offence under this clause.\nExplanation II.—That nothing shall be an offence of misuse of authority unless\nit is proved through material evidence that the holder of public office has gained\nany monetary benefit or asset from the person in whose favour the act of misuse\nof authority has been rendered.\nExplanation III.—That the authority of the holder of a public office shall be\nclearly specified as per the applicable Government rules and regulations.\n(vii) Omitted;\n(viii) if he commits an offence of willful default; or\n(ix) if he commits the offence of cheating as defined in section 415 of the Pakistan\nPenal Code, 1860 (Act XLV of 1860) and thereby dishonestly induces members\nof the public at large to deliver any property including money or valuable security\nto any person:\nProvided that nothing shall be an offence under clause (ix) unless it is established\nthat there was an intention of cheating at the time of initiation of a transaction.\nExplanation. —The civil and commercial disputes between parties shall not\nbe triable under the provisions of this Ordinance.\nIllustration I: A runs a Ponzi scheme and gives profit to its investors with intent\nto allure public. A is said to have committed cheating.\nIllustration II: A receives investments in a lawful business and continued to pay\nagreed profits to the investors. Later the business runs into losses and a default on his\nobligations. A has not committed cheating.\n(x)     if he commits the offence of criminal breach of trust as defined in section 405 of\nincluding money or valuable security entrusted to him by members of the public\nat large;\n(xi) if he, in his capacity as a banker, merchant, factor, broker, attorney or agent,\ncommits criminal breach of trust as provided in section 409 of the Pakistan\nPenal Code, 1860 (Act XLV of 1860) in respect of property entrusted to him or\nover which he has dominion; and\n(xii) if he aids, assists, abets, attempts or acts in conspiracy with a person or a holder\nof public office accused of an offence as provided in clauses (i) to (xi).\n(b)          Subject to the provisions contained in sections 439, 496, 497, 498 and 498A of\nhave powers to grant bail or order release of the accused.\n(c)           If after completing the investigation of an offence against a holder of public\noffice or any other person, the Chairman NAB is satisfied that no prima facie\ncase is made out against him and the case may be closed, the Chairman NAB\nshall refer the matter to a Court for approval and for the release of the accused,\nif in custody.\n(d)\nThe closure of an inquiry or investigation shall be communicated to the accused\nand such inquiry and investigation shall not be reopened without prior\npermission of the Court.]"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Punishment for corruption and corrupt practice",
      "content": "1\n(a)      [A holder of public office or any other person] who commits the offence of\ncorruption and corrupt practices shall be punishable with 2[rigorous]\nimprisonment for a term which may extend to 3[fourteen] years 4[and with fine]\nand such of the assets and 5[pecuniary resources] of such 6[holder of public office\nor person, as are] found to be disproportionate to the known sources of his income\nor which 7[are] acquired by money obtained through corruption and corrupt\npractices whether in his name or in the name of any of his dependents, or\nbenamidars shall be 8* * * forfeited to the appropriate Government 9[, or the\nconcerned bank or financial institution as the case may be] 3[:]\n[Provided that the convict shall be entitled to benefit under section\n3\n382-B of the Code.]\n10\n[(b) The offences specified in the Schedule to this Ordinance shall be punishable in\nthe manner specified therein.\n(c) The Federal Government may, by notification in the official Gazette, amend the\nSchedule so as to add any entry thereto or modify or omit any entry therein.\n3\n[(d) *    *     *          *           *     *       *]]\n1\nSubs. by the National Acconutability Bureau (Amdt.) Ordinance, 2002 (133 of 2002), s.11 for “A person”.\n2\nIns. ibid.,\n3\nSubs., added and omitted by the Act XI of 2022, s. 9.\n4\nSubs. by the National Acconutability Bureau (Amdt.) Ordinance, 2002 (133 of 2002), s.11, for “or with fine or with both”.\n5\nSubs. ibid., for “property”.\n6\nSubs. ibid., for “person which is.”.\n7\nSubs. ibid., for:”is”.\n8\nThe words “liable to be” omitted by the National Acocuntability Bureau (amdt) Ord., 2002 (133 of 2002), s. 11.\n9\nAdded ibid.\n10\nSubs. ibid, for “sub-section (b)”.\n11[11.    *          *          *          *          *          *          ]"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power 1[***] to freeze property",
      "content": "(a)        The Chairman NAB or the court trying 2[an accused] for any offence as\nspecified under this Ordinance, may, at any time, if there appear reasonable\ngrounds for believing that the accused has committed such an offence, order the\nfreezing of his property 3[* * *] or part thereof, whether in his possession or in\nthe possession of any relative, associate or person on his behalf.\n(b)        If the property ordered to be frozen under sub-section (a) is a debt or other\nmovable property, the freezing may be made:\n(i) by seizure; or\n(ii)    by appointment of receiver; or\n(iii) by prohibiting the delivery of such property to the accused or to anyone\non his behalf; or\n(iv) by all or any of such or other methods as the court or the Chairman NAB\nas the case may be, deem fit.\n(c)        If the property ordered to be frozen is immovable, the freezing shall, in the case\nof land paying revenue, be made through the Collector of the district in which\nthe land is situated, and in all other cases—\n(i)       by taking possession; or\n(ii)      by appointment of receiver; or\n(iii)     by prohibiting the payment of rent or delivery of property to the accused\nor to any other person on his behalf; or\n(iv)by all or any of such methods as the Chairman NAB or the Court may\ndeem fit:\nProvided that any order of seizure, freezing, attachment or any prohibitory order\nmentioned above by the Chairman NAB shall remain in force for a period not\nexceeding 4[fifteen] days unless confirmed by the 5[*] Court, where the Reference\nunder this Ordinance shall be sent by 6[Chairman] NAB:\nProvided further that notwithstanding 7[anything to the contrary contained\nherein,] the order of 6[Chairman] NAB or the Court shall be effective from the time of\npassing thereof or proclamation thereof in a newspaper, widely circulated and dispatch\nat the last known address of the accused 8[either by registered post A.D. or courier\nservice or 9[* * *] electronic media as the 10[Court] may deem proper having regard\nto the facts and circumstances of the case.]\n1\nThe words “of the Court” omitted by the National Accountability Bureau (Amdt) Ord., 2000 (4 of 2000), s. 7\n2\nSubs. by Ord. No.133 of 2002, s.13, for “a person”.\n3\nThe words and comma “movable or immovable,” omitted ibid.,\n4\nSubs, by the National Accountability Bureau (Amdt.) Ordinance, 2001 (35 of 2001), s. 9, for “30.”.\n5\nThe word “Accountability” omitted by the National Accountability Bureau (Amdt.) Ordinance. 2002 (133 of 2002), s.13.\n6\nIns. ibid,\n7\nSubs, ibid, for “that”.\n8\nAdded by the National Accountability Bureau (Second Amdt.) Ordinance, 2000 (24 of 2000), s. 5.\n9\nThe words “any other mode of” omitted by Ord. No. 133 of 2002. s. 13.\n10\nSubs, ibid, for “court”.\n11\nOmitted by Act XVI of 2022, s.7\n(d)        If the property ordered to be frozen consists of livestock or is of a perishable\nnature, the Chairman NAB, or the Court may, if it deems proper and expedient,\norder the immediate sale thereof and the proceeds of the sale may be deposited\nwith the Chairman NAB or the Court, or as either may direct as Appropriate.\n(e)        The powers, duties, and liabilities of a receiver, if any, appointed under this\nsection shall be the same as those of a receiver appointed under Order-XL of\n1\n[(f)   The order of freezing mentioned in sub-sections ‘a’ to ‘e’ shall remain operative\nuntil the final disposal of the case by the Court, and in the event of the acquittal\nof the accused, shall continue to remain operative for a period of ten days after\nreceipt of certified copy of the order of acquittal 2[or release] by NAB,\nwhereafter it shall be subject to an order by the court in which an appeal, if any,\nis filed.]"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Claim or objection against freezing",
      "content": "(a)        Notwithstanding the provisions of any law for the time being in force, the 3[*]\nCourt shall have exclusive jurisdiction to entertain and adjudicate upon all\nclaims or objections against the freezing of any property under section 12 above.\nSuch claims or objection shall be made before the 3[*] Court within 14 days\nfrom the date of the order freezing such property.\n(b)        The Court may for sufficient cause extend the time for filing such claims or\nobjections for a period not exceeding additional 14 days.\n4\n[(c)   The accused or any other aggrieved party, whose claim or objection against\nfreezing of property has been dismissed by the Court, may, within ten days file\nan appeal against such order before the High Court.]\n5\n[14.    *         *          *           *          *          *          *           *]"
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Disqualification to contest elections 6[or to hold public office]",
      "content": "7\n[(a)   Where an accused person is convicted 8[of an offence under section 9, of this\nOrdinance] he shall forthwith cease to hold public office, if any, held by him\nand further he shall stand disqualified for a period of ten years, to be reckoned\nfrom the date he is released after serving the sentence, for seeking or from being\nelected, chosen, appointed or nominated as a member or representative of any\npublic body or any statutory or local authority or in service of Pakistan or of any\nProvince:\n1\nSubs, by the National Accountability Bureau (Amdt.) Ordinance, 2001 (35 of 2001), s. 9, for sub-section (f).\n2\nIns. by the National Accountability Bureau (Amdt.) Ordinance, 2002 (133 of 2002), s 13.\n3\nThe word “Accountability” omitted ibid., s. 14.\n4\nSubs, by Ord. No. 35 of 2001, s. 10. for sub-section (c), which was previously amended by Ord. No. 4 of 2000, s. 8.\n5\nOmitted by Act. XI of 2022, S.10.\n6\nAdded by the National Accountability Bureau (Amdt) Ord., 2000 (4 of 2000), s.10.\n7\nSubs. by Ord. 35 of 2001, s.12, for sub-section (a).\n8\nSubs. by Ord. no.133 of 2002 s.16, for certain words.\nProvided that any accused person who has availed the benefit 11[*] 1[ 2[* *]\nof section] 25 shall also be deemed to have been convicted for an offence under this\nOrdinance, and shall forth with cease to hold public office, if any, held by him and\nfurther he shall stand disqualified for a period of ten years, to be reckoned from the\ndate he has discharged his liabilities relating to the matter or transaction in-issue,\nfor seeking or from being elected, chosen, appointed or nominated as a member or\nrepresentative of any public body or any statutory or local authority or in service of\nPakistan or of any Province.]\n(b)        Any person convicted of an offence 7[under section 9 of this Ordinance] shall not\nbe allowed to apply for or be granted or allowed any financial facilities in the form\nof any loan or advances 8[or other financial accommodation by] any bank or\nfinancial institution 9[owned or controlled by the Government] for a period of 10\nyears from the date of conviction.\n3\n[16. Case management and trial of offences.—(a) Notwithstanding anything contained in\nany other law for the time being in force, an accused shall be prosecuted for an offence under this Ordinance\nin the Court established under this Ordinance and the case shall be disposed of within one year.\n(b)        The Court shall sit at such place or places as the Federal Government may, by\norder, specify in this behalf.\n(c)        Where more Courts than one have been established at a place, the Chief Justice of\nthe High Court 11[***] concerned shall designate a Judge of any such Court to be\nan administrative Judge and a case triable under this Ordinance shall be filed before\nthe Court of the Administrative Judge who may either try the case himself or, assign\nit for trial by any other 11[Court established] at that place at any time prior to the\nframing of the charge.\n(d)        In respect of a case assigned to a Court under sub-section (c), all orders made or\nproceedings taken before the assignment shall be deemed to have been made or\ntaken by the Court to which the case has been assigned.\n10\n[(e)    Notwithstanding anything contained in this section, an accused shall be tried for an\noffence under this Ordinance in the Court in whose territorial jurisdiction the\noffence is alleged to have been committed:\nProvided that NAB shall file the reference, after the investigation is fully\ncompleted, which shall be treated as the final reference, and no supplementary\nreference shall be filed thereafter, unless investigation reveals new facts and with\nthe permission of the Court.]]\n4\n[16A. Transfer of cases.—\n(a)        Notwithstanding anything contained in any other law for the time being in force,\nthe Chairman NAB may apply to any court of law or tribunal that any case\ninvolving 5[any] offence under this Ordinance pending before such court or tribunal\nshall be transferred to a Court established under this Ordinance, then such other\n11\n[court or tribunal] shall transfer the said case to any Court established under this\nOrdinance and it shall 6[be deemed to be a reference under section 18 of 11[this\nOrdinance], and it shall] not be necessary for the Court to recall any witness or\nagain to record any evidence that may have been recorded.\n1\nSubs. by Ord. No. 133 of 2002, s.16, for “section”.\n2\nOmitted by Act. XI of 2022, S.11\n3\nSubs. by Act. XI of 2022, S.12\n4\nNew section 16A added by the National Accountability Bureau (Amdt.) Ordinance, 2000 (4 of 2000), s. 12.\n5\nSubs. by Ord. No. 133 of 2002, s. 18, for “a Schedule”.\n6\nIns. Ibid\n7\nSubs. Ibid, s. 16\n8\nSubs. by the National Accountability Bureau (Second Amdt.) Ord. 2000 (24 of 2000), s.6 for “from”.\n9\nSubs. Ibid, for “in the public sector”\n10\nSubs. by Act XVI of 2022, s.8\n11\nOmitted and Subs. by Act. No XXIV of 2023 by ss.7-9.\n1\n[(b)    In respect of any case pending before a Court, 2[if] the Prosecutor General\nAccountability or any Special Prosecutor authorised by him in this behalf,\nhaving regard to the facts and circumstances of the case and in the interest of\njustice and for the protection and safety of witnesses, considers it necessary that\nsuch case is 5[required to be] transferred for trial, he may apply, for the transfer\nof the case from any such Court in one Province to a Court in another Province\nor from one 2[Court] in a Province to another Court in the same Province.\n(i)       to the Supreme Court of Pakistan in case the transfer is intended from a\nCourt in a Province to a Court in another Province; and\n(ii)      to the High Court of the Province in case the transfer is intended from\none Court in a Province to another Court in the same Province5[:]\nand the Supreme Court or the High Court, as the case may be, if it is in the\ninterest of justice, transfer the case from one 2[Court] to another 2[Court] and\nwitness whose evidence may have been recorded.\n(c)       The accused may also make an application to the Supreme Court for the transfer\nof a case from a Court in one Province to a Court in another Province and to the\nHigh Court for transfer of a case from one Court in a Province to another Court\nin the same Province and the Supreme Court or the High Court, as the case may\nbe, if it is in the interest of justice, transfer the case from one Court to another\nCourt, and the case so transferred shall be tried under this Ordinance without\nrecalling any witness whose evidence may have been recorded.]]\n4\n[(d)    The provisions of this section shall mutatis mutandis apply to the Islamabad\nCapital Territory.]\n3\n[16B. Contempt of Court.—The Court shall have the power to punish for contempt of court\nwith imprisonment for a term which may extend to six months and with fine which may extend to\none million rupees any person who—\n(a)        abuses, interferes with or obstructs the process of the Court in any way or\ndisobeys any order or direction of the Court;\n(b)        scandalizes the Court or otherwise does anything which tends to bring the Court\nor a person constituting the Court into hatred, ridicule or contempt;\n(c)        does anything which tends to prejudice the determination of a matter pending or\nmost likely to come up before the Court; or\n(d)        does anything which, by any other law, constitutes, contempt of court.\n1\nSubs. by the National Accountability Bureau (Amdt.) Ordinance, 2001 (35 of 2001) s. 14, for sub-section (b).\n2\nSubs. & Ins. by Ord. No. 133 of 2002, s. 18, for “court”.\n3\nNew section 16B ins. by the National Accountability Bureau (Second Amdt.) Ordinance, 2000 (24 of 2000), s. 7.\n4\nAdded by Act XVI of 2022, s.9\n5\nIns. and Subs. by Act XXIV of 2023 by s.9.\n1\n[*      *          *          *          *          *         *]"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. 2[Provisions] of the Code to apply",
      "content": "(a)        Notwithstanding anything contained in any other law for the time being in force,\nunless there is anything inconsistent with the provisions of this Ordinance, the\nprovisions of the Code of Criminal procedure, 1898, (Act V of 1898) shall\nmutatis mutandis, apply to the proceedings under this 3[Ordinance].\n(b)        Subject to sub-section (a), the provisions of Chapter XXIIA of the Code shall\napply to trials under this Ordinance.\n7\n[(c)   *          *          *          *          *          *          *         ]\n5\n[(d)   Notwithstanding anything in section 234 of the Code, a person accused of more\noffences than one of the same kind committed during the space of any number\nof years, from the first to the last of such offences, may be charged with and\ntried at one trial for any number of such offences.]"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Cognizance of offences",
      "content": "(a)        The 4[*]Court shall not take cognizance of any offence under this Ordinance\nexcept on a reference made by 6[the Chairman NAB or an officer of the NAB\nduly authorised by him.]\n1\nExplanation omitted by the National Accountability Bureau (Amdt.) Ordinance, 2001 (35 of 2001), s. 15.\n2\nSubs. by Ord. no.133 of 2002, s.19, for “Provision”.\n3\nSubs. ibid., for “Order”.\n4\nThe word “Accountability” omitted by the National Accountability Bureau (Amdt.) Ordinance, 2002 (133 of 2002) s. 20.\n5\nNew sub-section (d) ins. ibid, s.19.\n6\nSubs. by the National Accountability Bureau (Second Amdt.) Ordinance, 2000 (24 of 2000), s. 8, for certain words.\n7\nOmitted. by Act XVI of 2022, s.10\n(b)        A reference under this Ordinance shall be initiated by the 1[*] National\nAccountability Bureau on—\n(i)        a reference received from the 2[***] appropriate government; or\n(ii)       receipt of a complaint; or\n3\n(iii)          [its] own accord.\n4\n[(c)   Where the Chairman NAB, or an officer of the NAB duly authorized by him, is\nof the opinion that it is, or may be, necessary and appropriate to initiate\nproceedings against any person, he shall refer the matter for inquiry 5[. If after\ncompletion of inquiry the allegations of commission of an offence under this\nOrdinance are substantiated with material evidence, the matter shall be\nconverted into investigation:\nProvided that the report of the inquiry shall be provided to the accused.]]\n(d)        The responsibility for inquiry into and investigation of an offence alleged to\nhave been committed under this Ordinance, shall rest on the NAB to the\nexclusion of any other agency or authority, unless any agency or authority is\nrequired to do so by the Chairman 6[NAB] 7[or by an officer of the NAB duly\nauthorised by him]5[*].\n5\n[(e)   *          *          *          *          *          *          *]\n(f)        Any Inquiry 8[or] Investigation under this Ordinance shall be completed\n5\n[within six months] 9[***].\n(g)        The 10[*] Chairman NAB, 11[or 12[*] an officer of the NAB duly authorized by\nhim,] shall appraise the material and the evidence placed before him during the\ninquiry and the investigation, and if he decides that it would be proper and just\nto proceed further 13[and there is sufficient material to justify filing of a\nreference], he shall refer the matter to 14[a] Court.\n1\nThe word “Chairman” omitted, by NAB (amdt) Ordonnance, 2000 (24 of 2000), s.8.\n2\nThe words “Chief Executive of an” omitted by the National Accountability Bureau (Amdt.) Ordinance, 2000 (4 of 2000), s. 13.\n3\nSubs. by Ord. No. 24 of 2000, s. 8 for “his”.\n4\nSubs. ibid for the original sub-section (c).\n5\nSubs. and Omitted by Act. XI of 2022, S. 13\n6\nIns. by Ord. No. 133 of 2002, s. 20.\n7\nSubs. by Ord. No. 24 of 2000, s. 8 for “or/and Deputy Chairman”.\n8\nSubs. by the National Accountability Bureau (Amdt.) Ordinance, 2002 (133 of 2002) s. 20, for “and”.\n9\n10\nThe word “Deputy” omitted by the national Accountability Bureau (Amdt) Ord. 2000 (4 of 2000), s. 13.\n11\nIns. by Ord. no. 24 of 2000, s.8.\n12\nThe word “by” omitted by the National Accountability Bureau (Amdt) Ord. 2001 (35 of 2001), s.16.\n13\nIns. ibid.\n14\nSubs. by Ord. No.133 of 2002, s.20, for “an Accountability”.\n(h)       If a complaint is inquired into and investigated by the NAB and it is concluded\nthat the complaint received was prima facie frivolous or has been filed with\nintent to malign or defame any persons, the Chairman 1[NAB] or Deputy\nChairman NAB or 2[an officer of the NAB duly authorised by the Chairman\nNAB], may refer the matter to the Court, and if the complainant is found guilty\nhe shall be punishable with imprisonment for a term which may extend to one\nyear, or with fine or with both."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Power to call for information",
      "content": "10[(1)] The Chairman NAB or 3[an officer of the NAB\nduly authorised by him] may, during the course of an inquiry 4[or investigation] 5[of an offence under\nthis Ordinance]:—\n(a)        call for information from any person 9[with regard to particulars of the subject\ninquiry or investigation] for the purpose of satisfying himself whether there has\nbeen any contravention of the provisions of this Ordinance or any rule or order\nmade there under;\n(b)        require any person to produce or deliver any document or thing useful or\nrelevant 9[with regard to the subject inquiry or investigation];\n(c)        examine any person acquainted with the facts and circumstances of the case\n9\n[with regard to the subject inquiry or investigation] ; 11[and] 6[*]\n7\n[(d)   require an bank or financial institution, notwithstanding anything contained in\nany other law for the time being in force, to provide any information relating to\nany person whosoever, including copies of entries made in a bank’s or a\nfinancial institution’s books such as ledgers, day books, cash books and all other\nbooks including record of information and transactions saved in electronic or\ndigital form, and the keepers of such books or records shall be obliged to certify\nthe copies in accordance with law 9[with regard to the subject inquiry or\ninvestigation] 8[.]]\n9 12\n[ [(2)] 11[Any] person called to provide information 11[under sub-section (1)] in relation to an\noffence alleged to have been committed under this Ordinance, shall be informed if he is an accused\nperson or otherwise, and if the person is alleged to have committed an offence he shall be informed of\nthe allegations against him in such manner as would enable him to file his defence.]\n1\nIns, by the National Accountability Bureau (Amdt.) Ord. 2002 (133 of 2002) s. 20.\n2\nSubs. by the National Accountability Bureau (Amdt.) Ord. 2002 (133 of 2002) s. 20. for “the prescribed law officer”.\n3\nSubs. by the National Accountability Bureau (Amdt.) Ordinance, 2002 (133 of 2002) s. 21, for “any authorised officer”.\n4\nIns. by the National Accountability Bureau (Amdt) Ordinance 2000 (4 of 2000), s. 14.\n5\nSubs. by Ord. No. 133 of 2002, s. 21, for “in connection with the contraventions of any provisions of this Ordinance.”\n6\nThe word “and” omitted ibid.\n7\nSubs. by the National Accountability Bureau (Amdt.) Ordinance, 2001 (35 of 2001), s. 17 for clause (d).\n8\nSubs. by Act No. XXIV of 2023 s.10 for the expression “; and”.\n9\nIns. and Subs. by Act XVI of 2022, s.11\n10\n11\nIns. and Subs. by Act No. XXIV of 2023 s.10.\n12\nClause (e) re-numbered as sub-section 2 by Act XXVI of 2023 s.10."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Reporting of suspicious financial transactions. ―",
      "content": "(a)        Notwithstanding anything contained in any law for the time being in force, it\nshall be the duty of all banks and financial institutions to take prompt and\nimmediate notice of all unusual or large transactions 1[in an] account, which\nhave no apparently genuine economic or law full purpose and upon bonafide\nprofessional judgment of the Bank 2[or financial institution] that such\ntransactions could constitute or be related to 3[an offence under this Ordinance],\nthe manager or director of such 4[Bank or] financial institution shall report all\nsuch transactions to the Chairman NAB forthwith by the quickest possible mode\nof communication to be confirmed in writing.\n(b)        Whoever fails to supply the information in accordance with sub-section (a) shall\nbe punishable with rigorous imprisonment which may extend to 5 years, 5[and]\nwith fine 6[***].\n[Explanation. —For the purposes of this section, a transaction in cash over two million\n11\nRupees shall be considered as an unusual or large transaction.]\n7\n[(c)   *          *           *           *          *          *          *]"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. International Cooperation Request for mutual legal assistance.12[(1)] The Chairman",
      "content": "NAB or any officer authorized by the Federal Government may request a Foreign State to do 8[any or\nall of] the following acts in accordance with the law of such State: —\n(a)        have evidence taken, or documents or other articles produced;\n(b)        obtain and execute search warrants or other lawful instruments authorizing\nsearch for things relevant to investigation or proceedings in Pakistan believed\nto be located in that State, and if found, seize them;\n(c)        freeze assets, by whatever processes are lawfully available in that State, to the\nextent to which the assets are believed on reasonable grounds to be situated in\nthat State;\n(d)        confiscate articles and forfeit assets to the extent to which the articles or assets,\nas the case may be, are believed to be located in that State;\n(e)        transfer to Pakistan any such evidence, documents, things, articles, assets or\nproceeds realized from the disposal of such articles or assets; 13[and] 9[*]\n(f)        transfer in custody to Pakistan a person detained in 10[that] State who consent\nto assist Pakistan in the relevant investigation or proceedings 13[.]\n1\nSubs. by the National Accountability Bureau (Amdt.) Ordinance, 2001 (35 of 2001), s. 18, for “with context to the”.\n2\nSubs. ibid., for “suspicion”.\n3\nSubs. by Ord. No. 133 of 2002 s. 22, for certain words.\n4\nIns. by Ord. No. 35 of 2001, s. 18.\n5\nSubs. by Ord. No, 133 of 2002, s. 22, for “or”.\n6\nThe Comma and words “, or with both” omitted ibid.\n7\nSub-section (c) omitted ibid.\n8\nIns. ibid., s.23.\n9\nThe word “and” omitted by the National Accountability Bureau (Amdt,) Ordinance, 2001 (35 of 2001) s. 19.\n10\nSubs. by the National Accountability Bureau (Amdt.) Ordinance, 2002 (133 of 2002), s. 23, for “the foreign”.\n11\nAdded by Act XVI of 2022, s.12\n12\n13\nAdded and Subs. by Act No. XXIV of 2023 s.11.\n1\n[(g)   *         *          *          *          *          *          *]\n2 6\n[ [(2)] 7[Notwithstanding] anything to the contrary contained 7[in sub-section (1)], the\nChairman NAB may, on such terms and conditions as he deems fit, employ any person or organisation,\nwhether in Pakistan or abroad, for detecting, tracing or identifying assets acquired by an accused in\nconnection with an offence under this Ordinance, and secreted or hoarded abroad, or for recovery of\nand repatriation to Pakistan of such assets.]"
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Jurisdiction.―",
      "content": "(a)        The Chairman NAB may 3[inquire into and] investigate any suspected offence\nwhich appears to him on reasonable grounds to involve 4[an offence under] this\nOrdinance, and has been referred to him, or of his own accord.\n(b)        The Chairman NAB may, if he thinks fit, conduct any such investigation in\nconjunction with any other agency or any other person 5[*] who is, in the\nopinion of the Chairman NAB, a proper Agency or person to be concerned in\nit.\n1\n[23.   *          *         *          *          *          *          *]\n1[24. Arrest.—(a)   The Chairman NAB may issue warrant of arrest during the course of\ninvestigation under this Ordinance, if—\n(i) the accused is intentionally or willfully not joining the investigation after\nrepeated notices;\n(ii) the accused is attempting to abscond;\n(iii) there are sufficient grounds that the accused would temper with the\nprosecution evidence; or\n(iv) there is credible information regarding repetition or continuation of offence\nunder this Ordinance.\n(b)        If the Chairman, NAB, or an officer of the NAB duly authorized by him, decides to refer\nthe case to a Court, such reference along-with report of Investigation Officer shall\ncontain the substance of the offence or offences as the case may be, alleged to have been\ncommitted by the accused and a copy of such reference shall be forwarded to the\nRegistrar of the Court to which the case has been sent to try the accused, and another\ncopy shall be delivered to the accused.\n(c)        The provisions of sub-section (a) shall also apply to cases, which have already been\nreferred to the Court.\n1\nOmitted and Subs. by Act. XI of 2022, Ss. 14 , 15 and 16.\n2\nNew clause (h) added by the National Accountability Bureau (Amdt.) Ordinance, 2002(133 of 2002) s. 23.\n3\nIns. by the National Accountability Bureau (Amdt.) Ordinance, 2000 (4 of 2000), s. 15.\n4\nSubs. by Ord. No. 133 of 2002, s. 24, for certain words.\n5\nThe word and oblique “which/” omitted ibid.\n6\nClause (h) re-numbered as sub-section 2 by Act No. XXIV of 2023, s.11.\n7\nSubs. by Act No. XXIV of 2023 s.11.\n(d)        Notwithstanding anything contained in the Code, where the holder of a public office or\nany other person accused of an offence is arrested by NAB under this Ordinance, NAB\nshall, 3[at the time of arrest], inform him of the grounds and substance on the basis of\nwhich he has been arrested and produce him before, the Court within a period of twenty\nfour hours of arrest excluding the time necessary for the journey from the place of arrest\nto the Court and such person shall, having regard to the facts and circumstances of the\ncase, be liable to be detained in the custody of NAB for purpose of inquiry and\ninvestigation for a period not exceeding fourteen days.\n(e)        The chairman, NAB may declare and notify any place as a police station or a\nsub-jail at his discretion.]\n1\n[25. Voluntary return and plea bargain.―\n(a)        Notwithstanding anything contained in section 15 or in any other law for the\ntime being in force, where a holder of public office or any other person, prior to\nthe authorization of investigation against him, voluntarily comes forward and\noffers to return the assets or gains acquired or made by him in the course, or as\naccept such offer and after determination of the amount due from such person\nand its deposit with the NAB discharge such person from all his liability in\nrespect of the matter or transaction in issue:\nProvided that the matter is not sub judice in any court of law.\n(b)        Where at any time after the authorization of investigation, before or after the\ncommencement of the trial or during the pendency of an appeal, the accused\noffers to return to the NAB the assets or gains acquired or made by him in the\ncourse, or as a consequence, of any offence under this Ordinance, the Chairman,\nNAB, may, in his discretion, after taking into consideration the facts and\ncircumstances of the case, accept the offer on such terms and conditions as he\nmay consider necessary, and if the accused agrees to return to the NAB the\namount determined by the Chairman, NAB, the Chairman, NAB, shall refer the\ncase for the approval of the Court, or as the case may be, the Appellate Court\nand for the release of the accused2[:]\n4\n[Provided that statement of an accused entering into plea bargain or\nvoluntarily return shall not prejudice case of any other accused:\nProvided further that in case of failure of accused to make payment in\naccordance with the plea bargain agreement approved by the Court, the\nagreement of plea bargain shall become inoperative to the rights of the parties\nimmediately.]\n4\n[(ba) Where an accused challenges validity of order approving plea bargain or it\ncomes to the knowledge of the Court otherwise that the plea bargain was a result\nof duress, coercion or any other illegal pressure exerted on the accused during\nthe course of inquiry or investigation, the Court after hearing both the parties\nmay recall the approval of plea bargain to the extent of that accused.]\n1\nSubs. by Ord. No. 133 of 2002, s. 27. for “section 25”, which was previously amended by various enactments.\n2\nSubs. by Act. XI of 2022, S. 17.\n3\nSubs. by Act XVI of 2022, s.13\n4\nSubs. and Ins. by Act XVI of 2022, s.14\n(c)         The amount deposited by the accused with the NAB shall be transferred to the\nFederal Government or, as the case may be, a Provincial Government or the\nconcerned bank or financial institution, company, body corporate, co-operative\nsociety, statutory body, or authority concerned 8[* *      *].]\n1\n[25A. Payment of loans, etc.―\n2\n[(a)    Where 3[an accused person] has been arrested or is in the custody of NAB or\napprehends such arrest or custody for the investigation of the charge against him\nof committing an offence of wilful default on account of non-payment of dues\nto a bank or financial institution or Co-operative Society, he may at any stage\nbefore or after such arrest or before, during or after such custody or investigation\napply to the Governor, State Bank of Pakistan for reconciliation of his liability\nthrough the Conciliation Committee and the Governor may, if he deems fit, refer\nthe matter to the Conciliation Committee.\n(aa)        The Governor, State Bank of Pakistan shall constitute one or more Conciliation\nCommittees for the purposes of this Ordinance.]\n4\n[(b)    The Conciliation Committee shall consist of a nominee of the Governor, State\nBank of Pakistan, being a senior officer of the State Bank well qualified in the\nprofession of banking who shall be the Chairman of the Committee, two\nnominees of the NAB to be nominated by the Chairman NAB, two chartered\naccountants to be nominated by the Governor, State Bank of Pakistan, one\nChartered Accountant to be nominated by the Council of the Institute of\nChartered Accountants of Pakistan, Karachi, such nomination to be obtained by\nthe Governor, State Bank of Pakistan, a Chartered Accountant to be nominated\nby the 5[accused] and a Chartered Accountant to be nominated by the lender\nbank or financial institution.\nExplanation. —Where the 6[lender] is a consortium or group of banks\nor financial institutions, the lender means the lead bank or financial institution.\n(bb)        The Chairman of the conciliation Committee shall convene the meetings and\nconduct proceedings of the 7[Conciliation] Committee in the manner he deems\nfit.]\n1\nNew section 25A ins. by the National Accountability Bureau (Amdt.) Ordinance, 2000 (4 of 2000), s. 18.\n2\nSubs. by the National Accountability Bureau (Second Amdt.) Ordinance, 2000 (24 of 2000), s. 11, for sub-section (a) which was previously\namended by Ord. No. 4 of 2000, s. 18.\n3\nSubs. by the National Accountability Bureau (Amdt.) Ordinance, 2002 (133 of 2002), s. 28, for “a person”.\n4\nSubs. by Ord. No. 24 of 2000, s. 11, for sub-section (b).\n5\nSubs. by the National Accountability Bureau (Amdt.) Ordinance, 2002 (133 of 2002), s. 28, for “borrower”.\n6\nSubs. ibid., for “Leader”.\n7\nIns. ibid.,\n8\nOmitted. by Act XVI of 2022, s.14\n1\n[(c)   The Conciliation Committee, after examination of the record of the lending\nbank or financial institution and the 2[accused] and after hearing the parties\nthrough their Chartered 3[Accountants], shall determine the amount outstanding\nagainst the 2[accused] calculated in accordance with law, rules, regulations and\ncirculars of the State Bank of Pakistan and further determine the manner and the\nschedule of repayment having regard to the facts of each case. The 2[accused],\nif he so desires, shall be heard at commencement and before the conclusion of\nproceedings:\nProvided that the 2[accused] shall have the right to have access to, and\ninstruct, the Chartered Accountant representing him before the Conciliation\nCommittee even if the 2[accused] is in 4[*] custody, during the proceedings of\nthe Conciliation Committee.]\n(d)        The Conciliation Committee shall conclude the reference within thirty days and\nits recommendations shall be recorded by its Chairman and shall contain the\nviews of all member of the 5[Conciliation] Committee. The recommendations\nof the Conciliation Committee shall be submitted to the 6[Governor, State Bank\nof Pakistan].\n7\n[(e)   The Governor, State Bank of Pakistan shall consider the recommendations\nsubmitted to him under sub-section (d) and may accept the recommendations or\nmay, for reasons to be recorded, pass such other appropriate order thereon as he\ndeems fit. The acceptance of the recommendations of the 5[Conciliation]\nCommittee or passing any other order as aforesaid shall constitute the decision\nof the Governor, State Bank of Pakistan.]\n8\n[(f)   Where the 2[accused] undertakes to repay the amount as determined by the\nConciliation Committee, the Chairman NAB, with the approval of the Court,\nmay release the accused.]\n9\n[(g)   The decision of the Governor State Bank of Pakistan shall be communicated to\nthe Chairman NAB, which shall be binding on him, except for valid reasons to\nbe recorded in writing subject to approval of the Court, to be accorded within a\nperiod of seven days.]\n10\n[(h) In the event of failure either of the Conciliation Committee to conclude the\nreference within thirty days of the commencement of the conciliation\nproceedings or the failure of the 2[accused] to accept and implement the decision\nof the Governor, State Bank of Pakistan regarding the payment and matters\nrelating thereto, such failure to accept or implement the decision shall be\nreferred to the 11[*]Court subject to the provisions of Section 31 D and the Court\nmay proceed with the case thereafter:\n1\nSubs. by the National Accountability Bureau (Second Amdt.) Ordinance, 2000 (24 of 2000), s. 11, for sub-section (c).\n2\nSubs. by Ord. No. 133 of 2002, s. 28, for “borrower”.\n3\nSubs. ibid., for “Accountant”.\n4\nThe word “the” omitted ibid.\n5\nIns. by the National Accountability Bureau (Amdt.) Ordinance, 2002 (133 of 2002), s. 28.\n6\nSubs. by the National Accountability Bureau (Second Amdt.) Ordinance, 2000 (24 of 2000), s. 11, for the “Chairman NAB”.\n7\nSubs. ibid., for sub-section (e).\n8\nSubs. by the National Accountability Bureau (Amdt.) Ordinance, 2001 (35 of 2001), s. 23, for sub-section (f), which was previously amended\nby Ord. No. 24 of 2000, s. 11.\n9\nSubs. by Ord. No. 35 of 2001, for sub-section (g).\n10\nSubs. by Ord. No. 24 of 2000, s. 11, for sub-section (h).\n11\nThe word “Accountability” omitted by Ord. No. 133 of 2002, s. 28.\nProvided that the period of thirty days may be extended by the Governor,\nState Bank of Pakistan by such further period or periods as he may find\nnecessary having regard to the facts and circumstances of the case and for\nreasons to be recorded.]\n1\n[26. Tender of pardon.—(a) Notwithstanding anything contained in the Code, at any stage of\ninquiry, investigation or trial, the Chairman NAB may, with a view to obtaining the evidence of any\nperson supposed to have been directly or indirectly concerned in or privy to any offence, tender a\nfull or conditional pardon to such a person on condition of his making a full and true disclosure of the\nwhole of the circumstances within his knowledge based on material relating to the said offence\nincluding the names of the persons involved therein whether as principals or abettors or otherwise:\nProvided that such person shall stand disqualified for a period of ten years, to be reckoned\nfrom the date of termination of the trial, for seeking or from being elected, chosen appointed or\nnominated as a member or representative of any public body or any statutoryor local authority or in\nservice of Pakistan or of any Province.\n(b)        Every person accepting a tender of pardon under sub-section (a) shall be examined by\na Magistrate in the presence of the accused who shall be given an opportunity of cross-\nexamining the person and the person shall also be examined as a witness in the\nsubsequent trial.]\n(c)        Subject to sub-section (d), the person to whom pardon has been granted under this\nsection shall not—\n(i)        in the case of a full pardon be tried for the offence in respect of which the pardon\nwas granted; and\n(ii)       in the case of a conditional pardon be awarded a punishment or penalty higher\nor other than that specified in the grant of pardon notwithstanding the\npunishment or penalty authorized by law.\n(d)        Where the Chairman NAB certifies that in his opinion, any person who has accepted\nsuch tender has, either by wilfully concealing anything essential or by giving false\nevidence through wilful or reckless mis-statement, not complied with the condition on\nwhich the tenders 2[of pardon] was made, such a person may be tried for the offence in\nrespect of which the pardon was so tendered, or for any other offence of which he\nappears to have been guilty in connection with the said matter including the offence of\ngiving false evidence, which he knows or ought to know is false.\n(e)        Any statement made before 3[a magistrate] by a person who has accepted tender of\npardon may be given in evidence against him at 4[the] trial.\n1\nSubs. by Act XI of 2022, S. 18\n2\nIns. by Ord. No. 133 of 2002, s. 29.\n3\nSubs. by the National Accountability Bureau (Second Amdt.) Ordinance. 2000 (24 of 2000). s. 12, for certain words.\n4\nSubs. ibid., for “such”."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Power to seek assistance. The Chairman NAB 1[,or an officer of the NAB duly authorised",
      "content": "by him,] shall have the power to seek full and complete assistance and call for all or any documents\nand information relevant to or in connection with any matter or 2[inquiry or investigation] pending\nbefore the NAB, 3[or disposal of any property surrendered to or seized by the NAB,] from any\ndepartment of the Federal Government, Provincial Government, local authority, bank, financial\ninstitution, person or any authority and institution or department in the public sector or the private\nsector, as he may deem fit and proper to demand or require, 11[ except to seek information, document\nor assistance the secrecy of which is protected under the law].\n4[28. Appointment of officers and staff in the National Accountability Bureau. —\n(a) The National Accountability Bureau may, in such manner and on such 12[terms] and\nconditions of service, efficiency, discipline and conduct etc. as may be prescribed\nby rules, appoint such officers and staff as may be considered necessary for the\nefficient performance of its functions.\n(b) The National Accountability Bureau, may appoint advisers, consultants and experts,\non payment of such fee or remuneration as may be prescribed by rules to perform\nits functions and exercise its powers under this Ordinance.]"
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Accused to be competent witness. 5[An accused] shall be a competent witness for the",
      "content": "defence and may give evidence on oath in disproof of the charges made against him:\nProvided that the accused shall not be compelled to be a witness against himself:\nProvided further that, where an accused 6[*] appears as a witness of his own choice and refuses\nto answer any question, the Court may draw such adverse inference from such refusal as it may think\nproper."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. False evidence etc",
      "content": "(a) Notwithstanding anything 7[to the contrary] contained in 8[this\nOrdinance] or any other law 9[for the time being] in force, on pronouncement of judgement the 10[*]\nCourt shall have the jurisdiction and power to take cognizance of an offence committed in the course\nof the investigation or trial of a case by any officer, any witness, including an expert, who has tendered\nfalse evidence in the case, whether he deposed in 12[Court] or not, or any other person, under sections\n176 to 182 of Chapter X, or sections 191 to 204, or 211 to 223, or 225-A of Chapter XI, of the Pakistan\nPenal Code 1860, (Act XLV of 1860) or under any other law relating to false evidence and offences\nagainst public justice, and to summarily try him and award punishment provided for the offence under\nthe law.\n1\nIns. by the National Accountability Bureau (Second Amdt.) Ord. 2000 (24 of 2000), s. 13.\n2\nSubs. by the National Accountability Bureau (Amdt.) Ordinance, 2002 (133 of 2002), s. 30, for “proceeding”.\n3\nIns. ibid., s 30.\n4\nSubs.by Act XI of 2022, S. 19.\n5\nSubs. by the National Accountability Bureau (Amdt.) Ordinance, 2002 (133 of 2002), s. 32, for certain words.\n6\nThe word “person” omitted by the National Accountability Bureau (Amdt.) Ordinance, 2002 (133 of 2002) s. 32.\n7\nIns. ibid, s. 33.\n8\nSubs. ibid, for the “the preceding provisions”.\n9\nSubs. ibid., for “already”.\n10\nThe word “Accountability” omitted ibid.,\n11\nSubs. by Act XVI of 2022, s.15\n12\nSubs. by Act No. XXIV of 2023 ss.12 & 13.\n(b)        For the purpose of trial under sub-section (a), the Court may, as nearly as may\nbe, follow the procedure specified in Chapter XXII of the Code.\n(c)        The proceeding under sub-section (a) may be initiated by the 1[*] Court on its\nown accord at any time after the decision of the case or, in the event that there\nis an appeal, after the decision thereof, or on an application made by the 1[*]\n2\n[prosecution] 3[or the accused] tried by the Court, within thirty days."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. 4[Prohibition to hamper investigation]",
      "content": "(a) Notwithstanding anything contained in any\nother law for the time being in force, if any person concerned with the inquiry 5[,] investigation and\nprosecution of a case consciously and deliberately and with malice 6[*] compromises, hampers,\nmisleads, jeopardizes or defeats an 7[inquiry or] investigation of a case under process before NAB or\nany concerned agency or authority or 8[the Court or any other court] he shall be 9[guilty of an offence\nunder this Ordinance punishable with rigorous imprisonment for a term which may extend to ten\nyears].\n(b)        No person will be proceeded 10[against] under this section except with the\nsanction of a Committee 11[comprising] the Chairman NAB Deputy Chairman\nNAB and the Prosecutor General Accountability.\n* 12\n[ [31A.          *          *          *          *          *          *          *          ]\n13\n[31B. Withdrawal and termination of pending proceedings. — (1) Prior to filing of a\nreference, the Chairman, NAB in consultation with the Prosecutor General, having regard to the totality\nof facts, circumstances and evidence, may partly, wholly, conditionally or unconditionally withdraw\nor terminate any proceedings under this Ordinance, if such proceedings are unjustified.\n(2) After the filing of a reference, if the Chairman, NAB in consultation with the Prosecutor\nGeneral, having regard to the totality of facts, circumstances and evidence is of the view that the\nreference is Partly or wholly unjustified, he may recommend to the Court for approval where the matter\nis pending that the reference may partly or wholly be withdrawn or terminated and upon such\nwithdrawal or termination—\n(i)        if it is made before a charge has been framed, the accused shall be discharged\nin respect of such offence or offences; and\n(ii)       if it is made after a charge has been framed, he shall be acquitted in respect of\nsuch offence or offences.]\n1\nThe word “Special” omitted by the National Accountability Bureau (Amdt.) Ordinance, 2000 (4 of 2000), s. 20.\n2\nSubs. by the National Accountability Bureau (Amdt.) Ordinance, 2001 (35 of 2001), s. 24, for “Prosecutor”.\n3\nSubs. by Ord. No. 133 of 2002, s. 33, for “of the person accused of an offence”.\n4\nAmended by Ord. No.4 of 2000, s.21.\n5\nSubs. by the National Accountability Bureau (Amdt.) Ordinance, 2002 (133 of 2002), s. 34, for “and”.\n6\nThe word “aforethought” omitted ibid.,\n7\nIns. by the National Accountability Bureau (Amdt.) Ordinance, 2002 (133 of 2002), s.34.\n8\nSubs. ibid., for “any Court or an Court” which was previously amended by Ord. NO. 4 of 2000, s. 21.\n9\nSubs. ibid., for certain words.\n10\nSubs. ibid., for “with”.\n11\nSubs. ibid., for “composing”.\n12\nOmitted. by Act XVI of 2022, s.16\n13\nSubs. by Act XVI of 2022, s.17\n*Ss. 31A, 31B and 31C Ins. by the National Accountability Bureau (Amdt.) Ordinance, 2000 (4 of 2000), s. 22."
    },
    {
      "provision_ref": "sec31c",
      "section": "31C",
      "title": "Section 31C. 1[Court to take cognizance of offence with prior approval of the State Bank.] No",
      "content": "Court established under this Ordinance shall take cognizance of an offence against an officer or an\nemployee of a bank or financial institution for writing off, waiving, restructuring or refinancing any\nfinancing facility, interest or mark-up without prior approval of the State Bank of Pakistan.]\n2\n[31D. Inquiry, investigation or proceedings in respect of imprudent bank loans, etc.\nNotwithstanding anything contained in this Ordinance or any other law for the time being in force, no\ninquiry, investigation or proceedings in respect of imprudent loans, defaulted loans or rescheduled\nloans shall be initiated or conducted by the National Accountability Bureau against any person,\ncompany or financial institution without reference from Governor, State Bank of Pakistan:\nProvided that cases pending before any Accountability Court before coming into force of the\nNational Accountability Bureau (Second Amendment) Ordinance, 2000, shall continue to be\nprosecuted and 11[conducted] without reference from the Governor, State Bank of Pakistan.]\n3\n[31DD. Approval of the State Bank of Pakistan. —Notwithstanding anything\ncontained in this Ordinance or any other law for the time being in force, no inquiry, investigation or\nproceedings in respect of a decision of a Board 11[or credit committee] of a Bank or financial\ninstitution, shall be initiated without the prior approval of the Governor, State Bank of Pakistan.]\n4\n[31E. Protection of witnesses. The Chairman NAB or the Court may in the facts and\ncircumstances of a case take such measures as may be considered necessary for the safety, security\nand protection of witnesses and their families.]"
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Appeal 5[and revision]",
      "content": "(a) Any 6[person convicted or the Prosecutor General\nAccountability, if so directed by 7[the Chairman] NAB,] aggrieved by the final judgement and order\nof the Court under this Ordinance may, within 8[thirty] days of the final Judgement and order of the\n9\n[*] Court prefer an appeal to the High Court 11[under whose jurisdiction] where the Court is situated\n10\n[:]\n10\n[Provided that no appeal shall lie against any interlocutory order of the Court.]\n1\nIns by Ord. No. 24 of 2000 s.15.\n2\nNew section 31D ins. ibid., s. 16.\n3\nIns. by Act XI of 2022, S. 20.\n4\nNew section 3IE, ins. by the National Accountability Bureau (Amdt.) Ordinance, 2001 (35 of 2001), s. 26.\n5\nAdded by the National Accountability Bureau (Amdt.) Ordinance, 2002 (133 of 2002), s. 37.\n6\nSubs. by the National Accountability Bureau (Amdt.) Ordinance, 2000 (4 of 2000), s. 23, for “Party to the Proceedings”.\n7\nIns. by Ord. No. 133 of 2002, s. 37.\n8\nSubs. by Act XI of 2022, S. 21for “ten”\n9\nThe word “Accountability” omitted by Ordinance, 2002 (133 of 2002), s. 37.\n10\nSubs. and Ins. by the National Accountability Bureau (Amdt.) Ordinance, 2001, (35 of 2001), s. 27.\n11\nSubs. and Ins. by Act No. XXIV of 2023 ss.14-16.\n(b)        All Appeals against the final Judgement 1[* *] filed before the High Court will\nbe heard by a Bench of not less than two judges constituted by the Chief Justice\nof the High Court 2[The provisions contained in section 426 of the Code shall\napply mutatis mutandis in case of an appeal filed against order of conviction.]\n3\n[(c)   No revision shall lie against any interlocutory order of the Court.]\n4\n[(d)   *          *           *          *          *          *          *]\n5\n[33. Transfer of pending proceedings.— Any and all proceedings pending before a 6[court]\nunder the Ehtesab Act, 1997(IX of 1997), shall stand transferred to 7[a] Court as soon as it is constituted\nunder this Ordinance within the same Province 13[or area of jurisdiction], and it shall not be necessary\nto recall any witness or again to record any evidence that may have been recorded.]\n8\n[33A. Payment of bonuses etc. There may be paid bonuses or ex-gratia 9[payments] to the\nofficers and staff of the 10[NAB], other Government servants, public servants and rewards to members\nof public for rendering commendable services in detection, investigation and prosecution of 11[any\noffence under this Ordinance] as may be prescribed by rules].\n12\n[33B. Reporting of public contracts.― All Ministries, Divisions and Attached Departments\nof the Federal Government, all departments of Provincial and local governments, statutory\ncorporations or authorities established by the Federal Government or Provincial Government and\nholders of public office shall furnish to NAB a copy of any contract, entered into by such Ministries,\nDivisions and Attached Departments of the Federal Government, all departments of Provincial\nGovernment or local government, statutory corporations or authorities established by the Federal\nGovernment or Provincial Government or such holder of public office on its behalf, as the case may\nbe, of the minimum monetary value of fifty million rupees or more, within such time as is reasonably\npracticable from the date of signing such contract."
    },
    {
      "provision_ref": "sec33c",
      "section": "33C",
      "title": "Section 33C. Measures for the prevention of corruption and corrupt practices.― The Chairman",
      "content": "NAB, shall from time to time as he deems fit, constitute committees comprising officers of the NAB\nor other persons or organisations from the private or public sectors to—\n(a)        educate and advise public authorities, holders of public office and the\ncommunity at large on measures to combat corruption and corrupt practices;\n(b)        develop, arrange, supervise, participate in or conduct educational programmes\nor media campaigns, and generally to disseminate information on the\ndetrimental effects of corruption and corrupt practices and the importance of\nmaintaining the integrity of public administration;\n1\nThe words “and order” omitted by Ord. 4 of 2000, s.23\n2\nSubs. by Act XI of 2022, S. 21\n3\nSubs. by Ord. No. 133 of 2002, s. 37, for “sub­section (c)” which was previously amended by various enactments.\n4\nSub-section (d) omitted by Ord. No. 35 of 2001, s. 27.\n5\nSubs. and shall be deemed always to have been so subs, by the National Accountability Bureau (Amdt.) Ordinance, 1999 (19 of 1999), s.3,\nfor the original section 33.\n6\nSubs. by Ord. No. 133 of 2002, s. 38, for “Court”.\n7\nSubs, ibid., for “an Accountability”.\n8\nNew section 33A ins. by the National Accountability Bureau (Amdt.) Ordinance. 2001 (35 of 2001), s.28.\n9\nSubs. by the National Accountability Bureau (Amdt.) Ordinance. 2002 (133 of 2002). s. 39, for “payment”.\n10\nSubs. ibid,, for “National Accountability Bureau”.\n11\nSubs. ibid., for certain words.\n12\nNew sections 33B, 33C, 33D and 33E ins. by Ord. No. 133 of 2002, s. 40.\n13\nIns. by Act No. XXIV of 2023 by s.17.\n(c)        examine the laws in force, and also rules and regulations relating to the practice\nand procedure of various ministries, departments of the Federal Government or\nProvincial Government, statutory or other public corporations or bodies, and the\nconduct of holders of public office and to recommend amendments in such laws,\nrules or regulations, as the case may be, in order to eliminate corruption and\ncorrupt practices;\n(d)        instruct, advise and assist any statutory or other public corporation or bodies or\nupon request, any organisation in the private and public sector on measures for\nthe reduction and elimination of corruption and corrupt practices; and\n(e)        monitor the implementation of the instructions and advice as aforesaid and to\nassess and evaluate the success or otherwise of such instructions and advice on"
    },
    {
      "provision_ref": "sec33d",
      "section": "33D",
      "title": "Section 33D. NAB to submit an annual report. The Chairman NAB shall as soon as possible after",
      "content": "the end of every calendar year but before the last day of March next following, submit to the 1[National\nAssembly and the Senate] a report of its affairs for that year which report shall be a public document\nand on its publication copies thereof shall be provided to the public at a reasonable cost."
    },
    {
      "provision_ref": "sec33e",
      "section": "33E",
      "title": "Section 33E. Recovery of amount of fines, etc., as arrears of land revenue",
      "content": "Any fine or other sum\ndue under this Ordinance, or as determined to be due by a Court, shall be recoverable as arrears of land\nrevenue.]\n2\n[33F. Restriction on issuance of public statements. —No official of NAB, in any capacity,\nshall make any statement in public or to the media regarding persons involved in any inquiry or\ninvestigation conducted by NAB until a reference has been filed against such persons.]\n3\n[33G. Punishment for making public statements. —Whoever contravenes the\nprovisions of section 33F shall be punished with imprisonment for a term which may extend to one\nyear but shall not be less than one month and with a fine of one million Rupees.]\n4\n[34. Power to make rules. —The Federal Government may, by notification in the\nofficial Gazette, make rules to carry out the purposes of this Ordinance.]\n5\n[34A. Delegation of powers.― The Chairman NAB may, by an order in writing delegate any\nof his powers to and authorise performance of any of his functions by, an officer of the NAB as he\nmay deem fit and proper, subject to such conditions, if any, as may be specified in the order, for\ncarrying out the purposes of this Ordinance.]\n1\nSubs. by Act XI of 2022, S. 22 for “President”\n2\nIns. by Act XI of 2022, S. 23.\n3\nIns. by Act XI of 2022, S. 24.\n4\nSubs. by Act XI of 2022, S. 25\n5\nNew section 34A ins. by the National Accountability Bureau (Amdt.) Ordinance 2001 (35 of 2001), s. 29."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Repeal",
      "content": "(a) The Ehtesab Act 1997 shall stand repealed from the date of promulgation of\nthis Ordinance, provided that notwithstanding the repeal of the said Act, any proceedings pending\nunder Ordinance CXI of 1996, Ordinance No. XX of 1997 and the Ehtesab Act, 1997, before any Court\nestablished under the said Act of 1997 1[*] or any of the aforesaid Ordinances amending the same,\nshall 2[continue under this Ordinance as transferred under 3[***] section 33 to 4[a] Court.]\n5\n[(b)   Any case or proceedings pending under the aforesaid Ordinances and the Act of\n1997 immediately before the commencement of this Ordinance and transferred\nto any 6[Court] 7[***] shall be proceeded with and all subsequent proceedings\nshall be completed in accordance with, and under the provisions of, this\nOrdinance.]"
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Indemnity. No suit, prosecution, or any other proceedings shall lie against the Federal",
      "content": "Government, Provincial Government, Chairman NAB, or any other member of the NAB or any person\nexercising any power or performing any function under this Ordinance or the Rules made hereunder\nfor any act or thing which has been done in good faith or intended to be done under this Ordinance or\nthe rules thereof 8[:]\n8\n[Provided that if the accused has been acquitted by the Court on the ground that the case was\ninitiated with malafide intention or based on false or fabricated evidence, the person responsible shall\nbe punished with imprisonment of either description for a term which may extend to five years and\nshall also be liable to fine.]\n9\n[37. Removal of difficulties. ― If any difficulty arises in giving effect to any provision of\nthis Ordinance, the 10[Chairman NAB] 11[with the approval of the 8[Federal Government]], may make\nsuch order, not inconsistent with the provisions of this Ordinance, as may appear to him to be necessary\nfor the purpose of removing such difficulty.]\n1\nThe word “and/” omitted by Ord. No. 133 of 2002, s. 42.\n2\nSubs. by Ord. No. 4 of 2000, s. 25, for certain words, which was previously ins. by Ord. No. 19 of 1999 s. 4.\n3\nThe words “sub-section (b) of” omitted by Ord. No. 35 of 2001, s. 30.\n4\nSubs. by Ord. No. 133 of 2002, s. 42, for “an Accountability”.\n5\nSubs. by Ord. No. 4 of 2000, s. 25, for the original sub-section (b).\n6\nSubs. by Ord. No. 133 of 2002, s. 42, for “court”.\n7\nThe words “established under this Ordinance” omitted ibid.,\n8\nSubs. and added by Act XI of 2022, Ss. 26-27.\n9\nSubs. by the National Accountability Bureau (Amdt.) Ordinance, 2001 (35 of 2001), s. 31, for section 37.\n10\nSubs. by the National Accountability Bureau (Amdt.) Ordinance, 2002 (133 of 2002), s. 43 for “President”.\n11\nSubs. ibid., for certain words.\n1\n[THE SCHEDULE]\n[See section 10(b)]\nS.NO                                             Offences                                                         Punishment\n(1)                                                   (2)                                                                (3)\nAny person who aids, abets or through any wilful act or                                        Rigorous imprisonment\nomission is instrumental in the commission of the offence of                                   for a term which may\nwilful default or with wrongful intent for illegal gratification by                            extend to fourteen years\nmisuse of power, authority, influence, nepotism, favouritism                                   and fine.\nwrites off, waives, restructures or refinances illegally,\nimproperly or without sufficient justification the principal"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. amount of loan on any financial facility, interest or mark",
      "content": "up on\nany loan or financial facility provided to any person by any\nbank or financial institution, a co-operative society, a\nGovernment department or an authority established or\ncontrolled by the Government shall have committed or be\ndeemed to have committed the offence of corruption or corrupt\npractices.\nRefuses to answer questions, or to provide information to any                                  Rigorous imprisonment\nmember of the NAB or any other agency when required to do                                      for a term which may"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. so. extend to five years",
      "content": "Giving false information or\nfabricating false evidence during inquiry into or investigation\nof an offence by the NAB or any agency authorised by the\nNAB in this regard when given by—"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. (a) a complainant, witness or an accused person or any inquiry Rigorous imprisonment",
      "content": "officer; and                                                                                   for a term which may\nextend to five years.\n(b) the investigator of the National Accountability Bureau or                                  Rigorous imprisonment\nconcerned agency.                                                                              for a term which may\nextend to ten years.\n1\nSubs by the National Accountability Bureau (Amdt.) Ordinance, 2002 (133 of 2002), s. 44 for “the Schedule”, which was previously\namended by various enactments.\nS.NO                                               Offences                              Punishment\n(1)                                                        (2)                               (3)\nMisuse of authority or power in committing any offence          Rigorous imprisonment for\nspecified above, by any person holding a public office          a term which may extend to\nfourteen years.\nincluding any offence under sections 161 to 165A of the"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Pakistan Penal Code (Act XLV of 1860)",
      "content": "Deceitfully, fraudulently or dishonestly causing loss to a      Rigorous imprisonment for\nbank, a financial institution, a co-operative society, a        a term which may extend to\nfourteen years.\nGovernment department, a statutory body or an authority"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. established or controlled by the Federal Government, a",
      "content": "Provincial Government or a local government.\n1\nSection 168 PPC-Public Servant unlawfully engaging in           Simple imprisonment for\n[6.\ntrade.                                                          one year, or fine, or both.\nSection 169 PPC-Public Servant unlawfully buying or             Simple imprisonment for\nbidding for property.                                           two years, or fine, or both,\nand      confiscation     of"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. person from punishment, or property from fine, or both",
      "content": "forfeiture.\nSection 219 PPC-Public servant in a judicial      Imprisonment       of     either\nproceeding    corruptly    making       and       description for seven years, or"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. cheating. description for seven years and",
      "content": "fine.\nSection 471 PPC-Using as genuine a forged         Punishable for forgery of such"
    }
  ],
  "definitions": []
}
