{
  "id": "pk-national-agri-trade-and-food-safety-authority-act-2026",
  "type": "statute",
  "title": "National Agri-trade and Food Safety Authority Act, 2026",
  "title_en": "National Agri-trade and Food Safety Authority Act, 2026",
  "short_name": "NAAFS",
  "status": "in_force",
  "issued_date": "2025-12-18",
  "in_force_date": "2025-12-18",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tobQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Agri-trade and Food Safety Authority Act, 2026 (IV of 2026) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act shall be called the National Agri-\ntrade and Food Safety Authority Act, 2026.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context, —\n(i)      —adulterated pesticidel means a pesticide with which spurious, deleterious or\nharmful substance has been mixed or which is wholly or mainly ineffective for the\npurpose for which it is intended;\n(ii)     —Advisory Committeel means the committee constituted under section 10;\n(iii)    —Agricultural productl includes all produce of agriculture or horticulture, forest,\nand plants, all products of genetic sequencing information, single-cell proteins,\nand products of biotechnology intended for use food or feed and all good related\nto food or drink wholly or partly manufured from any such produce;\n(iv)     —agro-chemicals includes pesticides, growth regulators, pheromones,\nkairamones, growth inhibitors, attrants, repellents, rodenticides, miticides,\nexcluding fertilizers or micro-nutrients, DNA based chemicals used for\ntraceability;\n(v)      —animal means a living thing that is not a human or plant;\n(vi)     —animal products means anything originating or made, whether in whole or in\npart, from an animal or from a carcass and includes blood. bones. bone marrow,\ncasings, dairy products, eggs, honey. fat, foodstuffs of animal origin, hair, hides,\nhorns, hooves, hormones, and their biological preparations, offal, seed materials\nfor research purposes, semen, ova and embryos, skin, tendons, viscera, wool and\nany other substance of animal origin excluding germinal products, biological\nproducts and pathological material as may be specified;\n(vii)   —Appellate Committee means the Committee constituted under this Act;\n(viii) —Authority means the National Agri-trade and Food Safety Authority (NAFSA)\nestablished under this Act;\n(ix)    —authorized officer means an officer nominated by the Authority under this Act\nfor exercising powers and performing functions in accordance with the provisions\nof this Act and the rules and regulations made thereunder;\n(x)     —Board means the Board of Governors constituted under this Act;\n(xi)    —business operator means a natural or legal person registered with the Authority\nunder this Act;\n(xii)   —certificate means the certificate of quality and sanitary and phytosanitary (SPS)\ncompliance, animal health certificate, or any other certificate issued by the\nauthorized officer to the business operator confirming compliance with the\nprovisions of this Act;\n(xiii) —Chairperson means Chairperson of the Board;\n(xiv)   —compartment means an animal sub-population contained in one or more\npremises under a common biosecurity management system with a distinct health\nstatus with respect to a specific animal disease or diseases for which surveillance,\ncontrol and biosecurity measures have been applied for the purpose of\ninternational trade;\n(xv)    —Complaint Resolution Committee means the complaint resolution committee\nconstituted under this Act;\n(xvi)   —crop includes all agricultural or horticultural crops and all trees, bushes, herbs,\nshrubs, grass, plants, roots, fungi and algae grown for commercial or recreational\npurposes;\n(xvii) —Department means Animal Quarantine Department and Department of Plant\nProtection;\n(xviii) —Director General means the director general of the Authority appointed under\nthis Act;\n(xix)   —disease means suffering from or carrying any infections or contagious disease\nor such disease as may be declared by the Federal Government from time to time\nby notification in the official Gazette;\n(xx)    —feed means animal feed, including hay, roughage, concentrate or any other\nsubstance used for feeding animals;\n(xxi)   —formulation means the combination of various ingredients designed to render\nthe product useful and effective for the purpose claimed and for the envisaged\nmode of application.\n(xxii) food means any substance, whether processed. semi-processed or raw, which is\nintended for human consumption and includes liquid and any substance which has\nbeen used in the manufacturing, preparation or treatment of food excluding\n(a)    medicinal products within the meaning of the Drug Regulatory Authority\nof Pakistan Act, 2012 (XXI of 2012);\n(b)    tobacco and tobacco products; and\n(c)    narcotic or psychotropic substances;\n(xxiii) —food safety means safety measures taken by the Federal Government to ensure\nthat food intended for export or import complies with applicable SPS standards;\n(xxiv) —goods means agricultural product, agro-chernicals, animal, animal products,\nplant, fish, fish products, feed, food and pesticides;\n(xxv) —grade designation means the grade designation prescribed as indicative of the\nquality of any product;\n(xxvi) —grade designation mark- means a mark prescribed as representing a particular\ngrade designation;\n(xxvii) —harmful organisml means any living stage of any or all insects, mites,\nnematodes, protozoa, slugs, snails, or other invertebrate animals, fungi, bacteria,\nparasitic plants, virus or reproductive parts thereof, or any pathogen. weed, rodent,\nor other plant and animal organism which may, directly or indirectly, injure or\ncause disease to any plant or animal species;\n(xxviii) —hazard means a biological, chemical or physical agent including bio-identical\nor synthetic hormones with the potential to cause an adverse effect on food safety,\nanimal health or plant health and includes bio-identical or synthetic hormones;\n(xxix) —international standards, guidelines and recommendations shall include, inter-\nalia,—\n(a)    for food safety, the standards, guidelines and recommendations established\nby the Codex Alimentarius Commission;\n(b)    for animal health and zoonoses, the standards. guidelines and\nrecommendations developed under the auspices of the World Organization\nfor Animal Health (WOAH);\n(c)    for plant health, the international standards. guidelines and\nrecommendations developed under the auspices of the Secretariat of the\nInternational Plant Protection Convention (IPPC) in cooperation with\nregional organizations operating within the framework of the (IPPC);\n(d)     for testing laboratories, the general requirements for the competence of\ncalibration and testing laboratories laid down in ISO Standard 17025 of\nthe International Standards Organization; and\n(e)     for matters not covered above, appropriate standards, guidelines, and\nrecommendations adopted by other relevant international organizations;\n(xxx) —invasive alien species means plants, animals or other organisms that cause\nsignificant harm to the environment, economy human health, where those are not\nnative;\n(xxxi) —maximum residue limit or —MRL means the maximum concentration of a\nresidue that is legally permitted or recognized as acceptable in or on a food or\nagricultural commodity or animal feedstuff;\n(xxxii) —nominated department means department or any legal entity in the provinces\nnominated by the provincial Government;\n(xxxiii) —notifiable animal disease means the animal diseases of national and\ninternational concern, that must be reported to the veterinary authority within a\ndefined time frame when suspected by owners, vets or laboratories;\n(xxxiv) —official control means programmes, processes, procedures or mechanisms\ndeveloped by the Authority for the purpose of implementing the SPS measures\nand control of pathogenic agents, harmful organisms, pests, pesticides or diseases\nas prescribed under the regulations;\n(xxxv) —person means a natural or artificial person and may include a company, firm,\nassociation of persons, authority, or any other body corporate;\n(xxxvi) —pest means any species, strain or biotype of plant, animal or pathogenic agent\ninjurious to plants and plant products, materials or environments and includes\nvectors of parasites or pathogens of human and animal disease and animals\ncausing public health nuisance;\n(xxxvii) —pesticides means any substance or mixture of substances used or represented\nas a means for preventing, destroying, repelling, mitigating or controlling, directly\nor indirectly or any harmful organism;\n(xxxviii) —placed on the market means the holding or displaying for sale, offering for\nsale, selling, delivering or any other form of placing on the market, and retail and\nwholesale trade;\n(xxxix) —plant means all species of plants, crops, or parts thereof, whether living or dead,\nincluding stems, branches, tubers, bulbs, corns, stocks, bud-wood, cuttings, layers,\nslips, suckers, roots, aquatic algae, leaves, flowers, fruits and seeds;\n(xl)   —points of entry and —points of exit mean any sea port, airport, dry-port or land\nroutes respectively declared by the Federal Government designated for the import\nor export of any goods;\n(xli)   —prescribed means prescribed by rule or regulations made under this Act;\n(xlii) —quality means conformity to prescribed requirement or specification of a\nproduct or service;\n(xliii) —quarantine facility means a site or premises provided or approved by the\nAuthority for the isolation and examination of goods intended for import or export;\n(xliv) —sanitary and phytosanitary (SPS) measure means measures to be prescribed by\nrules and implemented to—\n(a)    protect human life or health or environment from risks arising from\nharmful organisms carried by animals, plants or products based thereon,\nor from the entry, establishment or spread of harmful organisms including\ninvasive alien species;\n(b)    protect animal or plant life or health from risks arising from the entry,\nestablishment or spread of harmful organisms;\n(c)    protect human, animal or plant life or health from risks arising from\nadditives, contaminants, residues of pesticides and veterinary drugs. toxins\nor disease-causing organisms in food and feed; or\n(d)    prevent or limit other damage from the entry, establishment or spread of\nharmful organisms including alien invasive species via trade and\ncommerce in products to which this Act applies.\n(xlv)   —Scientific Committee means the committee constituted under this Act;\n(xlvi) —scientific advice means the advice rendered by the scientific committee based\non scientific evidence and knowledge under this Act;\n(xlvii) —sub-standard when used with reference to a pesticide, means any pesticide the\nstrength or purity of which falls below the professed standard or quality which is\nexpressed on its label or under which it is sold or a pesticide any valuable\ningredient of which has been wholly or partially extracted;\n(xlviii) —WOAH means —World Organization of Animal Health previously known as\n—Office International des Epizooties (OIE) an\nintergovernmental organization and global authority on animal health.\n(xlix) —zone means a defined part of a territory containing an animal subpopulation\nwith a distinct health status with respect to a specific animal disease or diseases\nfor which surveillance, control and biosecurity measures have been applied for the\npurpose of animal disease prevention, control or eradication and international\ntrade."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Authority",
      "content": "(1) Upon the commencement of this Act, there shall be\nestablished an authority to be known as the National Agri-trade and Food Safety Authority (NAFSA) to\ncarry out the purposes of this Act.\n(2) The Authority shall be a body corporate, having perpetual succession and a common seal with\npower, to enter into contracts, acquire, hold and dispose of property, both movable and immovable, and\nto sue and be sued in its name.\n(3) The headquarters of the Authority shall be at Islamabad and it may establish such other places\nin Pakistan as it may deem necessary."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Board of Governors",
      "content": "(1) The general superintendence, policy direction. oversight, and all\nmatters pertaining to the policy and administration of the Authority shall vest in the Board. The Board\nshall consist of a Chairperson and the following members who shall be appointed by the Prime Minister\nfor a term of three years, namely:—\n(a)    six members who are Secretaries of the department concerned with the affairs of\nAgriculture or livestock Departments in the Punjab, Sindh, Khyber Pakhtunkhwa,\nBalochistan, Azad Jammu and Kashmir and Gilgit-Baltistan;\n(b)    one representative each, not below the rank of Additional Secretary from division\nconcerned with the affairs of national food security and research, climate change,\ncommerce, science and technology and finance;\n(c)    two female members with expertise in food safety, food technology, public health,\nagronomy, or a related field;\n(d)    two members from academia or research organizations; and\n(e)    three members, one each from—\n(i)     plant related trading associations;\n(ii)    animal trading associations; and\n(iii)   the Federation of Pakistan Chambers of Commerce and Industry (FPCCI).\n(2) The Chairperson shall be a person known for his integrity and eminence having experience of\nnot less than twelve years in any relevant field including food safety, food technology, public health,\nagronomy, animal health, trade and economics or a related field.\n(3) The Director General of the Authority shall serve as an ex-officio member of the Board, having\nno right to vote, and shall act as the secretary of the Board.\n(4) The members, other than ex-officio member, shall be appointed on such terms and conditions\nas may be determined by the Prime Minister. No person shall be appointed as a member of the Board for\nmore than two consecutive term.\n(5) The Chairperson or a member, other than the ex-officio members, may in writing addressed\nto the Prime Minister, resign from his office.\n(6) The Prime Minister may remove the Chairperson or any member from office if they are found\nincapable of discharging their duties due to lack of interest, non-performance, or upon conviction by a\ncourt of law.\n(7) The Chairperson or any member, other than an ex-officio member, shall be deemed to have\nvacated their office if they are absent without prior intimation to the Board from more than three\nconsecutive meetings of the Board."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Functions and powers of the Authority",
      "content": "(I) The Authority shall carry out its functions,\nnamely:—\n(i)     develop, apply and achieve compliance with SPS measures in relation to import,\nexport and inter-regional trade of goods taking into account international\nstandards, guidelines and recommendations;\n(ii)    adopt and administer all acts already taken by the Federal Government with regard\nto SPS measures in relation to imports, exports, and inter-regional trade of goods;\n(iii)   register any business operator if not already registered with any other authority or\ngovernment entity in such manner as may be prescribed;\n(iv)    ensure compliance with SPS standards by business operators through a system of\nofficial controls, which it may carry out at any stage of preparation of goods meant\nfor export;\n(v)     ensure compliance by business operators with track and trace or marking and\ngrade designation requirements of goods;\n(vi)    register and regulate formulation plants in such manner as may be prescribed;\n(vii)   implement inspection and quarantine controls at points of entry and points of exit\nwith regard to import and export of goods;\n(viii) constitute sub-committees as required for carrying out the purposes of this Act;\n(ix)    regulate, prohibit and restrict the import or export of goods likely to introduce\nharmful organism, invasive species, or diseases to any other goods or humans, as\nper the prescribed mechanism;\n(x)     issuing and cancel registration or other certificates and licenses for activities\nrequiring certificates or licenses under this Act;\n(xi)    supervising and monitoring business operators regarding SPS compliance, food\nsafety and quality standards;\n(xii)   coordinate with Provincial Governments to implement SPS measures for the\nproduction, transportation, storage, and marketing of goods intended for export\nfrom Pakistan, as well as for related purposes under this Act;\n(xiii) prepare and implement national crisis management plans for the control of risks\nregarding the application of SPS measures with the coordination of the relevant\nProvincial authorities on such terms and conditions as may be prescribed;\n(xiv)   nominate, notify or establish the accredited testing laboratories;\n(xv)    submit all mandatory or voluntary documentation or reporting to the international\nbodies, convention, associations or organizations;\n(xvi)   management and administration of biosecurity measures applied to zones and\ncompartments for the purposes of export certification;\n(xvii) conduct official veterinary diagnostic tests and analysis, issuance of test results\nand international veterinary certificates for the purposes of international\nnotifications of notifiable animal diseases or the export of Goods;\n(xviii) represent Pakistan in bilateral regional and international forums related to\ninternational trade in animals and animal products;\n(xix)   international coordination and market access negotiations for export and import\nof goods including animals and animal products;\n(xx)    protection of endangered areas and designation, maintenance and surveillance of\npest free areas and areas of low pest prevelance.\n(2) In performing its functions and exercising its powers as set out in sub-section (1), the\nAuthority may—\n(i)     engage in any study or project relating to any matter under this Act and in\nconjunction with other authorities, international agencies or organizations;\n(ii)    levy such charges and fees for the performance of its functions in such manner as\nmay be prescribed;\n(iii)   determine a service structure appropriate to the functions and appoint such officers\nand employees, advisors, consultants, experts or scientists as required necessary\non such terms and conditions as may be prescribed;\n(iv)    approve annual budget estimates for the submission to the Federal Government;\n(v)     receive and manage property, income, grants, contributions made to it, raise loans\nand to invest any fund representing such property, grants, bequests, trusts, gifts,\ndonations, endowments or contributions in accordance with applicable laws;\n(vi)    hold training programmes, national and international conferences, policy\nseminars, symposia, or awareness workshops or any other activity deemed\nnecessary for promoting the SPS measures;\n(vii)   conduct studies, surveys, experiments and analysis of data for application of the\nSPS measures in international trade;\n(viii) work to secure and sustain market access for goods governed under this Act, and\nensuring their unrestricted and continuous movement within domestic and\ninternational markets and approve digital transaction and guarantee for system\ngenerated certificate, as the case may be;\n(ix)    impose penalty or fines; and\n(x)     perform any other function and deal with matters and things that may be necessary\nor incidental thereto for the fulfilment of its functions under this Act or may be\nassigned to it by the Federal Government, from time to time.\n(3) The Authority may entrust or outsource any of its functions to a person, authority, agency or\ncompany through a contract arrangement, on such terms and conditions as may be mutually agreed."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Delegation",
      "content": "The Authority may delegate any of its powers and functions under this Act to\nconditions as may be prescribed."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Meetings of the Board",
      "content": "(1) The Board shall meet quarterly or as often as is expedient to\nperform its functions or on the specific advice of the Federal Government.\n(2) The Chairperson, and in his absence, any other member elected by the members present at a\nmeeting, shall preside the meeting of the Authority.\n(3) The quorum of a meeting of the Board shall be simple majority of the total membership,\nincluding the Chairperson and a representative from the Ministry of National Food Security and\nResearch.\n(4) A meeting of the Authority shall be held in such manner as may be prescribed, and until so\nprovided, as may be determined by the Authority.\n(5) No act or proceeding of the Board or its committees shall be deemed invalid solely due to any\nvacancy or defect in their constitution."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Director General",
      "content": "(1) The Federal Government shall, by notification in the official Gazette,\nappoint a person as Director General on such terms and conditions as may be prescribed by rules, for a\nterm of three years. The Director General may be reappointed for another term for three years.\n(2) The Director General shall be the Chief Executive Officer of the Authority and shall be\nresponsible for the day to day administration of the affairs of the Authority and shall exercise such powers\nand functions as may be prescribed or assigned to him by the Authority."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Scientific Committee",
      "content": "(1) There shall be a scientific committee of the Authority which shall\nbe responsible for rendering scientific or technical advice on matters referred by the Board or the Director\nGeneral.\n(2) The Board shall establish operational guidelines for the Scientific Committee.\n(3) The scientific committee shall comprise of a minimum of fifteen (15) eminent scientists from\nthe public and private sector who shall be appointed by the Authority for a term of three years on such\nterms and conditions as may be prescribed.\n(4) The Authority shall appoint the convener of the scientific committee from amongst its\nmembers.\n(5) If a subject requiring advice from the Scientific Committee falls outside the expertise of its\nmembers, the Scientific Committee may recommend to the Board or the Director General that the matter\nbe referred to any other committee established under this Act.\n(6) The Board or the Director General, as the case may be, shall take into account the scientific\nadvice, which shall be binding only with respect to the issues specifically referred by the Board.\n(7) The Scientific Committee may, on its own initiative, provide technical or scientific advice to\nthe Board or the Director General:\nProvided that such advice shall not be binding on the Board or the Director General."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Advisory Committees",
      "content": "(1) The Board shall establish as many Advisory committees as it\ndeems appropriate for various trades and subjects and shall be responsible for improving the existing\nSPS standards, monitoring maximum residual limits (MRLs) of pesticides and other chemicals, assessing\nof goods, providing training and awareness, provincial coordination or and carrying out any other\nfunctions as directed by the Authority.\n(2) The Board shall establish the operational guidelines for the advisory committees.\n(3) The advisory committee shall comprise of representatives of the Federal and provincial\ngovernments, experts in the subject area and relevant stakeholders from public and private sector.\n(4) The Board shall appoint the convener of the advisory committee from amongst its members."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Remuneration and expenses",
      "content": "(1) The Authority shall pay such remuneration to the\nDirector General and its employees as may be prescribed.\n(2) The Authority shall pay such meeting fees, expenses or remuneration, as the case may be, as\nmay be prescribed, to the Chairperson, members of the Board and the Committees, constituted under this\nAct."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Requirement to comply with the SPS measures",
      "content": "The goods intended for import or export\nshall comply with the SPS measures under this Act as may be prescribed."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Inter",
      "content": "regional trade.—(1) The inter-regional trade in goods between provinces shall comply\nwith the SPS and food safety standards.\n(2) The Authority shall advise provinces to adopt uniform SPS measures and food safety\nstandards.\n(3) The Authority shall notify provinces of risks associated with the regional movement of food,\nfeed, or animals, as may be prescribed.\n(4) Any dispute arising between provinces regarding compliance with SPS measures or food\nsafety standards, or associated risks to human, plant, or animal health, shall be referred to the advisory\ncommittee for resolution and, if required so, to the Scientific Committee for technical advice."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Import and export of agricultural products, food, feed, animal and animal products",
      "content": "(1) Notwithstanding any provisions contained in this Act, the Authority shall have the power to\nrecognize, assess, and notify SPS certificates. The Authority may, based on scientific advice, impose\nspecial conditions on any country whose SPS measures are deemed unsatisfactory to safeguard plant,\nanimal and human health within Pakistan.\n(2) No goods shall be imported into Pakistan unless accompanied by a certificate issued by the\nrelevant authority of the exporting country, certifying compliance with the SPS conditions notified under\nsub-section (1).\n(3) All goods in transit through the territory of Pakistan for transportation to another destination\nshall be subject to the applicable SPS conditions.\n(4) Transit of banned pesticides, genetically modified organisms (GMOs) which are not regulated\nby the National Biosafety Committee (NBC) of Pakistan and unlicensed food or seeds, shall not be\nallowed."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Appointment of authorized officers",
      "content": "(1) The Authority may appoint such number of\nofficers as authorized officers as may be necessary for the performance of its functions under this Act.\n(2) Subject to the provisions of this Act and the regulations made thereunder, the Authority may\nconfer the powers of the Authorized Officers, as may be prescribed, upon any officers of the Authority,\nFederal Government, Provincial Government or any other statutory entity established by the Federal or\nProvincial government."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Powers of authorized officers",
      "content": "(1) Subject to provisions of this Act, the authorized officer\nmay, —\n(a)     at any reasonable hour or whenever work is in progress in any establishment in\nwhich goods are believed to be produced, stored, processed or packaged for\nexport, enter that establishment for the purposes of carrying out official controls\nso as to determine compliance with the SPS measures, animal health or food\nsafety;\n(b)     inspect or examine goods in any establishment to which this Act applies, or which\nis used or capable of being used for the preparation of goods for export purposes\nand shall take samples thereof for laboratory analysis;\n(c)     stop and search any person, luggage, vehicle, vessel, railway wagon, or aircraft at\nany point of entry or exit carrying goods subject to this Act, examine such goods\nand take samples thereof;\n(d)     require disinfection of any premises, aircraft, railway wagon, carriage, vessel or\nvehicle of any description used for carrying animals or animal products;\n(e)     inspect the goods for compliance with the prescribed grade designation and\nmarking;\n(f)     call for such books, documents or other records in any medium whatsoever which\nhe believes to contain any information or data relevant to the enforcement of the\nprovisions of this Act with respect to the goods, make copies thereof and take\nextracts there from;\n(g)     seize or detain for such time, as may be necessary, the goods by means of, or in\nrelation to which, he is of the opinion that the provisions of this Act have been\ncontravened and shall, at the time of seizure or detention, inform, in writing, the\nbusiness operator or the person from whose possession the seizure or detention is\nmade, of the grounds for the said action;\n(h)     prohibit the export of animals which does not compliant to SPS measure or other\nspecified conditions to carry;\n(i)     deport any animal or animal products, at the expense of the person importing such\nanimal or animal product, the import of which is prohibited by the Federal\nGovernment;\n(j)     transfer goods to a quarantine facility for such time period as may be prescribed;\n(k)     ensure that the prescribed conditions are followed in the quarantine facility;\n(1)     direct business operators or importer or exporter, as the case may be to conduct\nthe prescribed tests, processes, or procedures on Goods and order their destruction\nif such tests confirm the presence of any harmful organism or disease;\n(m)     order disposal of clothing, fittings, fodder, harness, container or litter that may\nhave been in contact with, or pertaining to, diseased animals or animal products;\n(n)     conduct survey of goods processing plants with a view to determine their fitness\nfor registration and their observance with the provisions of this Act;\n(o)     seek assistance from a police officer or officer of any law enforcement agency for\nuse of force that is reasonably necessary while carrying out his functions under\nthis Act; and\n(p)     exercise any other function assigned to him by the Authority."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Transparency",
      "content": "(1) The Authority may conduct consultative and stakeholder consultation\ncompliance to international commitments and market access, during the preparation, evaluation and\nrevision of SPS measures under this Act.\n(2) Without prejudice to any other law for the time being in force, where there are reasonable\ngrounds to suspect that Goods may present a risk for human health, animal health and plant health, then\ndepending on the nature, seriousness and extent of that risk, the Authority shall take appropriate steps to\ninform the business operator and, if necessary, the general public, of the nature of the risk to human\nhealth, animal health, plant health or identifying to the fullest extent possible the risk that the Goods may\npresent, and the measures which are taken or about to be taken to prevent, reduce or eliminate that risk.\n(3) Without prejudice to any other law, the Authority shall prescribe internal accountability\nmechanism to prevent the misuse of funds, power or authority under this Act.\nJURISDICTION, OFFENCES AND PENALTIES"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Aiding or abetting and offence under section 20",
      "content": "Any person who by any means\nwhatsoever attempts or aid or abets the commission of an offence under section 20 shall be punishable\nwith the same punishment as provided for the offence itself."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Offences by companies, etc",
      "content": "Where an offence punishable under section 20 has been\ncommitted by a company, any person who, at the time the offence was committed, was in charge of and\nwas responsible to the company for the conduct of the business of the company, as well as any director\nor partner of the company, shall be deemed to be guilty of the offence and shall be liable to be proceeded\nagainst and punished accordingly:\nProvided that nothing contained in this section shall render any such person liable to any\npunishment provided in this Act if he proves that the offence was committed without his knowledge or\nthat he exercised due diligence to prevent the commission of such offence."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Offences",
      "content": "A person shall be guilty of an offence under this Act, if he—\n(i)      imports or causes the importation of any animal or animal product from a country\nor territory from where such import is banned or prohibited due to the presence or\nsuspected presence, or risk of transmission of specified disease;\n(ii)      imports or exports any animal without a valid health certificate issued by the\ncompetent authority of the exporting country, or with a fake, forged, or fraudulent\ncertificate;\n(iii)    imports, manufacteures, formulates, sells, offer for sell, hold in stock for sale, or\nadvertise for sale an adulterated pesticide;\n(iv)     refuses to permit inspection of a formulation plant;\n(v)      supplies animal or animal product from, or process animal product in, any\nestablishment or premises which is not approved or registered for that particular\nexport;\n(vi)     denies to quarantine the animals as required under this Act or regulations\nthereunder;\n(vii)    removes animal, animal products from a quarantine facility or shift the same to\nsome other unapproved premises;\n(viii)   stores or process sub-standard pesticides or agrochemicals;\n(ix)     exports the animals and animal products without observing the sanitary\nrequirements of the importing country;\n(x)      submits fake or forged lab reports, pre-shipment inspection report, manufacturing\ncertificate, country of origin certificate regarding quantity, quality or type of\ngoods;\n(xi)     fails to report any disease, pathogen associated with imported plant, plant material\nor animal in quarantine facility;\n(xii)    fails to submit report, data or any other documents required by the Authorize\nOfficer about imported goods in quarantine facility;\n(xiii) plants plant and plant material at unregistered quarantine facility;\n(xiv)    imports or store banned agrochemicals pesticides;\n(xv)     imports and stores hazardous pesticides without due precautions;\n(xvi)    denies to perform SPS measures or fulfill special conditions;\n(xvii)    willfully obstructs, hinders or resists the Authorized Officer from carrying out a\nfunction under this Act;\n(xviii) stores or process adulterated pesticides or agrochemicals;\n(xix)    wilfully obstructs, hinders or resists the police officer or officer of law enforcing\nagenies assisting the Authorized Officer, in carrying out a function under this Act;\n(xx)     imports, manufactures, formulates, sells, offers for sale, holds in stock for sale or\nadvertises for sale an adulterated or banned pesticide;\n(xxi)    sells, offers to sale, stores or holds unregistered, fake, adulterated expired\nagrochemicals or pesticides in market;\n(xxii) attempts to import or export without the required documents or attempting to\nimport or export undeclared goods;\n(xxiii) refuses to comply with special conditions of importing country;\n(xxiv) imports any animal without declaring and registering a quarantine facility;\n(xxv) sells or offers to sale agrochemicals and pesticides with incomplete label and seal\nof pesticide containers, bags or similar items;\n(xxvi) wilfully conceals a fact, makes a false statement to, or misleads, the Authorized\nOfficer who is carrying out a function under this Act or regulations; and\n(xxvii) denies to show prescribed register, areas, stores, labs etc."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Penalties",
      "content": "Whosoever contravene any provision of section 20, shall be in case of\ncontravention of clauses, —\n(i)      (i), (ii), (iii) or (iv) shall be punishable with imprisonment for a term which may\nextend to three years, or with fine which may extend to three million rupees or\nwith both and where an accused was directed by the Authorized Officer for\nimmediate discontinuance of the offence, the Court may impose a further fine\nwhich may extend to fifty thousand rupees for every day for the period the offence\ncontinues;\n(ii)    (v), (vi), (vii) and (viii) shall be punishable with imprisonment for a term which\nmay extend to two years, or with fine which may extend to two million rupees or\nwith both and where an accused was directed by the authorized officer for\nimmediate discontinuance of the offence, the Court may impose a further fine\nwhich may extend to twenty five thousand rupees for every day for the period the\noffence continues;\n(iii)   (ix), (x), (xi), (xii), (xiii), (xiv), (xv), (xvi), (xvii), (xviii), (xix), (xx) or (xxi) shall\nbe punishable with imprisonment for a term which may extend to one year, or with\nfine which may extend to one million rupees or with both and where an accused\nwas directed by the Authorized Officer for immediate discontinuance of the\noffence, the Court may impose a further fine which may extend to ten thousand\nrupees for every day for the period the offence continues; and\n(iv)    (xxii), (xxiii), (xxiv), (xxv), (xxvi) or (xxvii) shall be liable to pay fine which may\nextend to five hundred thousand rupees and where an accused was directed by the\nauthorized officer for immediate discontinuance of the offence, the Court may\nimpose a further fine which may extend to one thousand rupees for every day for\nthe period the offence continues."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Cognizance of offences",
      "content": "(1) Notwithstanding anything contained in the Code of Criminal\nProcedure, 1898 (Act V of 1898), the Court of Sessions shall take cognizance of any offence punishable\nunder section 20, on a complaint in writing made by the Director General or an Authorized Officer.\n(2) For the purposes of trial appeal etc. the provisions of Code of Criminal Procedure, 1898 (Act\nV of 1898) shall mutatis mutandis apply."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Disposal of forfeited goods",
      "content": "Any goods forfeited on conviction of a person by the Court\nunder this Act shall be disposed of by the Authority at the cost of the convicted person or business\noperator as the case may be, in the prescribe manner."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Complaint resolution committee",
      "content": "(1) The Authority shall constitute a complaint resolution\ncommittee and establish a mechanism for the redressal of complaints arising from the refusal of\nregistrations or licenses or certificates by the Authority, or any other matters as may be prescribed.\n(2) The Authority shall prescribe the procedure and related matters concerning the complaint\nresolution committee.\n(3) Any person or business operator feeling aggrieved of any order of the Authority or the\nAuthorized Officer under this Act, may file application within thirty days for redressal of his grievances\nbefore the complaint resolution committee in the prescribed manner."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Appellate Committee",
      "content": "(1) The Authority shall constitute an appellate committee and\nprescribe a mechanism for redressal of all appeals against the decisions of the complaint resolution\ncommittee.\n(2) Any person or business operator aggrieved by any decision of the complaint resolution\ncommittee may file an appeal within thirty days of passing of such order before the appellate committee."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Bar of jurisdiction",
      "content": "Notwithstanding anything contained in any other law for the time being\nin force and except as provided under this Act, no decision or action taken under this Act or rules or\nregulations made thereunder shall be questioned by any agency or challenged in any court or tribunal,\nnor shall any injunction be granted against such decisions or actions."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Coordination with Provincial Governments",
      "content": "The Authority shall,—\n(a)     require the nominated department of provincial governments to prepare an annual\nprogramme of official control activities in relation to matters falling within the\njurisdiction of the department as set out in sub-section (1) of section 5 and submit\nthe same to the Authority, specifying, —\n(i)      the type of control activities to be carried out; and\n(ii)     the criteria applied in drawing up the programme;\n(b)     communicate policy guidelines and policy decisions made or taken by the Board\nfor their compliance in the respective provinces relating to the SPS measures,\nanimal health, pesticide regulation and food safety.\n(c)     publish model regulations, guidelines and manuals with regard to the application\nof the SPS measures to be adopted by Provincial Governments; and\n(d)     facilitate harmonization of provincial laws, rules and regulations relating to the\nSPS measures required for obtaining and sustaining market access."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Emergency measures for ensuring SPS conditions",
      "content": "(1) Where the nominated department\nof provincial government knowing that any goods are likely to constitute a serious risk to human health,\nanimal health or plant health and that such risk cannot be contained satisfactarily by means of measures\ntaken under the provisions of this Act, or other laws for the time being in force, the nominated department\nshall immediately adopt one or more of the following measures, depending on the gravity of the situation\n(a)     in the case of goods of national origin\n(i)      ensure the suspension of the placing on the market or use of the agricultural\nproduct, food or feed in question;\n(ii)     lay down special conditions for the agricultural product, food or feed in\nquestion;\n(iii)    use its best endeavors to identify the source of the hazard, and take\nmeasures to prevent its future occurrence;\n(iv)     any other appropriate interim measure; and\n(v)     inform the Authority about the measures taken in this regard; and\n(b)     in the case of imported goods, the Authority may take additional measures to—\n(i)     inform the relevant authorities in the country of origin or transit\nresponsible for official control of the hazard identified;\n(ii)    ensure the suspension of the placing on the market or use of that goods;\n(iii)   suspend import of that goods from the country concerned and, where\napplicable, from the country of transit;\n(iv)    lay down special conditions for the future import of that goods from the\ncountry concerned; and\n(v)     any other measure deemed appropriate.\n(2) The actions taken under sub-section (1) shall be subject to—\n(a)     approval of the Board;\n(b)     information to the nominated department of Provincial Governments;\n(c)     information to the business operators; and\n(d)     information to such other department including the Customs Department.\nCHAPTER—VI"
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Laboratory analysis of samples",
      "content": "(1) The samples collected for analysis under section 16\nfor the purpose of official control, testing of agrochemicals, animal diseases, food safety and SPS\nmeasures shall be analyzed by a testing laboratory notified under this section.\n(2) The Authority may notify any accredited testing laboratory established in the private or public\nsector, a university laboratory, a research organization laboratory, or a laboratory established by the\nFederal or Provincial Government for conducting all tests including for official control of SPS conditions.\n(3) The Authority may establish testing laboratories or recognize any existing laboratory where\nit is expedient to perform the functions under this Act.\n(4) The Authority shall maintain and publish in the official Gazette the list of testing laboratories\nnotified under this section.\n(5) The samples collected under section 16 for the purpose of official control of food safety,\nanimal, pesticides or SPS conditions etc., shall be transmitted to the notified laboratory by the authorized\nofficer that shall carry out its functions on such terms and conditions as may be prescribed."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Accreditation of testing laboratories",
      "content": "(1) All testing laboratories designated for official\ncontrols, food safety, SPS conditions, and agrochemical testing shall adhere to the general requirements\nfor competence of calibration and testing laboratories as prescribed in the latest ISO Standard of the\nInternational Standards Organization, or any superseding standard. Such competence shall be accredited\nby the Pakistan National Accreditation Council (PNAC) or any accreditation body that is a signatory to\nthe International Laboratory Accreditation Cooperation (ILAC) Mutual Recognition Arrangement\n(MRA) for the purpose of conducting sample analysis.\n(2) The laboratories shall only be notified for the testing methods and parameters, which are\nwithin the scope of their accreditation.\nCHAPTER—VII"
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. The Fund",
      "content": "(1) There shall be a non-lapsable fund of Authority to be called as National\nAgri-trade and Food Safety Authority Fund, which shall be utilized for the performance of its functions\nunder this Act, including the payment of remuneration, salaries, and all other expenses of the Authority.\n(2) The Fund shall consist of,—\n(a)    seed money provided by the Federal Government;\n(b)    sums as the Federal Government may, from time to time, allocate to the Authority\nin the annual budget or otherwise;\n(c)    any financial allocation made by the Federal Government from any fund or\nrevenue received in relation to the promotion of exports, such as the Export\nDevelopment Fund or from imports;\n(d)    endowments, donations, contributions, bequests, trusts and grants provided by\ndomestic and international institutions and organizations;\n(e)    loans, aid and assistance in any form and from any source as approved by the\nBoard;\n(f)    income from sales, subscriptions or royalties of publications and remuneration for\nprofessional services rendered by the officers, researchers, advisors and experts of\nthe Authority;\n(g)    charges and fees levied for, and the fine received under, the performance of control\nfunctions;\n(h)    income from investments, if any, made in the schemes of the Federal Government\nas approved by the Board;\n(i)    all other sums or properties which may in any manner become payable to, or vest\nin the Authority, in respect of any matter; and\n(j)    any surplus of receipts over the actual expenditure in a year shall be remitted to\nbe made-up by the Federal Government.\n(3) Subject to the Public Finance Management Act, 2019 all funds of the Authority shall be kept\nand deposited in one or more accounts maintained by it, in local or foreign currency, in any scheduled\nbank and shall be operated as approved and directed by the Board."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Audit",
      "content": "(1) The Auditor General of Pakistan shall annually audit the accounts of the\nAuthority.\n(2) The Government may, in addition to the audit under sub-section (1), cause the accounts of the\nAuthority to be annually audited by a Chartered Accountant or a firm of Chartered Accountants and, at\nany time, appoint a Chartered Accountant or a firm of Chartered Accountants, to conduct an additional\nexternal audit of the accounts of the Authority and submit its report to the Government\n(3) The Authority shall produce all books of accounts and documents and furnish such\nexplanation and information as an auditor may require for purposes of audit.\nCHAPTER—VIII\nGeneral and Miscellaneous Provisions"
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Act to override other laws",
      "content": "The provisions of this Act shall have effect notwithstanding\nanything to the contrary contained in any other law for the time being in force. In case of any\ninconsistency, the provisions of this Act shall prevail."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Repeal and savings",
      "content": "(1) After the commencement of this Act, the following laws shall\nstand repealed on such date the Federal Government may by notification in the official Gazette appoint,\nnamely:—\n(i)     the Pakistan Plant Quarantine Act, 1976 (LXXV of 1976);\n(ii)    the Pakistan Animal Quarantine (Import and Export of Animals and Animal\nProducts) Ordinance, 1979 (XLIX of 1979);\n(iii)   the Agricultural Pesticides Ordinance, 1971 (II of 1971); and\n(iv)    the Agricultural Produce (Grading and Marking) Act, 1937 (I of 1937).\n(2) The Federal Government may, by notification in the official Gazette, specify the law which\nis required to be repealed under sub-section (1) from the date specified in the notification\n(3) Anything done, action taken, permitted, granted licence or applications made, obligations or\nliabilities incurred, rights and assets acquired, persons appointed or authorised, jurisdiction or powers\nconferred, order issued under any of the provisions of the repealed laws and the rules or regulations made\nthereunder shall continue and be deemed to be as if that were taken or provided under this Act unless\nrepealed or amended."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Members, officers and officials, etc., to be public servants",
      "content": "The Chairperson, Director\nGeneral, members, officers, of the Authority shall, when acting or purporting to act in pursuance of any\nof the provisions of this Act or regulations made thereunder, be deemed to be public servants within the\nmeaning of section 21 of the Pakistan Penal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Access to statistical data and information, etc",
      "content": "Notwithstanding anything contained in\nany other law for the time being in force, the Authority shall have the right to obtain and access data,\nstatistic and information relating to imports and exports of goods based thereon from a business operator\nthat may be necessary, as for official use and analysis."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Validity of proceedings",
      "content": "No act or proceedings shall be invalid by reason only of existence\nof a vacancy, or defect, in the constitution of the Authority, Board, scientific committee or advisory\ncommittee:\nProvided that the invalidity shall be validated within six months by the Board or the Committee\nas the case may be."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Abolishment of Departments",
      "content": "(1) On the appointed date under section 34, the Animal\nQuarantine Department and the Department of Plant Protection shall stand abolished.\n(2) On the appointed date all assets, liabilities, rights, obligations, patents, licenses, and interests\nof the departments shall stand transferred to the Authority upon its establishment, subject to such terms\nand conditions as may be specified by the Federal Government.\n(3) Every employee of the departments specified in sub-section (1) shall stand transferred to the\nsurplus pool of the Establishment Division."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Transition period",
      "content": "The trade-related functions performed by the Department of Plant\nProtection and the Animal Quarantine Department shall continue for a period not exceeding six months\nfrom the appointed date under section 34, during which the Authority shall make its regulations and\nappoint employees."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Power to make rules",
      "content": "Subject to this Act, the Federal Government may, by notification in"
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Power to make regulations",
      "content": "The Authority with the previous approval of the Federal\nGovernment may by notification in the official Gazette make regulations for carrying out the purposes\nof this Act."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Confidentiality of data",
      "content": "(1) Subject to the Right of Access to Information Act, 2017\n(XXXIV of 2017), no information relating to any business operator, obtained by the Authority in the\ncourse of official controls under this Act, shall be disclosed without the prior written consent of the\nbusiness operator, except—\n(a)     in accordance with the directions of the Board, to the extent necessary for the\npurposes of this Act;\n(b)     for the purposes of any proceedings for an offence under this Act, or for any report\nof such proceedings; or\n(c)     in compliance with an order of a court of competent jurisdiction.\n(2) Any person who discloses information in contravention of sub-section (1) shall be liable for\nproceedings of misconduct in accordance with the provisions of this Act or regulations made thereunder."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Removal of difficulties",
      "content": "If a difficulty arises in giving effect to any provision of this Act,\nappear to it to be necessary or expedient for the purpose of the removal of such difficulty:\nProvided that the power under this section shall not be exercised after two years of the\ncommencement of this Act.                                              RGN Date: 04-02-2026"
    }
  ],
  "definitions": []
}
