{
  "id": "pk-national-agri-trade-and-food-safety-authority-ordinance-2025",
  "type": "statute",
  "title": "National Agri-trade and Food Safety Authority Ordinance, 2025",
  "title_en": "National Agri-trade and Food Safety Authority Ordinance, 2025",
  "short_name": "NAAFS",
  "status": "in_force",
  "issued_date": "2025-05-01",
  "in_force_date": "2025-05-01",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tjbQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Agri-trade and Food Safety Authority Ordinance, 2025 (VI of 2025) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Ordinance, unless there is anything\nrepugnant in the subject or context,—\n(i) “adulterated pesticide” means a pesticide with which spurious.\ndeleterious or harmful substance has been mixed or which is wholly\nor mainly ineffective for the purpose for which it is intended;\n(ii) “Advisory Committee” means the committee constituted under\nBRE section 10;\n; al 2 (iii) “Agricultural product” includes all produce of agriculture or\nTeli horticulture, forest, and plants, all products of genetic sequencing\nRrhi p information, single-cell proteins, and products of biotechnology\nEND intended for use food or feed and all good related to food or drink\nap wholly or partly manufOrdinanceured from any such produce;\nSi (iv) “agro-chemicals” includes pesticides, growth regulators,\nBins pheromones, kairamones, growth inhibitors, attrOrdinanceants,\nBae repellents, rodenticides, miticides, excluding fertilizers or micro-\nse nutrients, DNA based chemicals used for traceability;\no! (v) “animal” means a living thing that is not a human or plant;\nPART I] THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 157\n(vi) “animal products” means anything originating or made, whether in\nwhole or in part, from an animal or from a carcass and includes\nblood. bones. bone marrow, casings, dairy products, eggs, honey.\nfat, foodstuffs of animal origin, hair, hides, horns, hooves,\nhormones, and their biological preparations, offal, seed materials\nfor research purposes, semen, ova and embryos, skin, tendons,\nviscera, wool and any other substance of animal origin excluding\ngerminal products. biological products and pathological material as\nmay be specified;\n(vii) “Appellate Committee” means the Committee constituted under\nthis Ordinance;\n(viii) “Authority” means the National Agri-trade and Food Safety\nAuthority (NAFSA) established under this Ordinance;\n(ix) “authorized officer” means an officer nominated by the Authority\nunder this Ordinance for exercising powers and performing\nfunctions in accordance with the provisions of this Ordinance and\nthe rules and regulations made thereunder;\n(x) “Board” means the Board of Governors constituted under this\nOrdinance;\nPe : (xi) “business operator” means a natural or legal person registered with\nthe Authority under this Ordinance;\n| (xii) “certificate” means the certificate of quality and sanitary and\nphytosanitary (SPS) compliance, animal health certificate, or any\nother certificate issued by the authorized officer to the business\n| operator confirming compliance with the provisions of this\nOrdinance;\n| (xiii) “Chairperson” means Chairperson of the Board;\n(xiv) “compartment” means an animal sub-population contained in one\nor more premises under a common biosecurity management system\nwith a distinct health status with respect to a specific animal disease\n: or diseases for which surveillance, control and biosecurity measures\n: ~~ have been applied for the purpose of international trade;\nFv te NY) “Complaint Resolution Committee” means the complaint resolution\n~~ committee constituted under this Ordinance;\n158 THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 [PART |\n— ee\n(xvi) “crop” includes all agricultural or horticultural crops and all trees,\nbushes, herbs, shrubs, grass, plants, roots, fungi and algae grown\nfor commercial or recreational purposes;\n(xvii) “Department” means Animal Quarantine Department and\nDepartment of Plant Protection;\n(xviii) “Director General” means the director general of the Authority\nappointed under this Ordinance;\n(xix) “disease” means suffering from or carrying any infectious or\ncontagious disease or such disease as may be declared by the\nFederal Government from time to time by notification in the official\nGazette;\n(xx) “feed” means animal feed, including hay, roughage, concentrate or\nany other substance used for feeding animals;\n(xxi) “formulation” means the combination of various ingredients\ndesigned to render the product useful and effective for the purpose\nclaimed and for the envisaged mode of application.\n(xxii) “food” means any substance, whether processed. semi-processed or\nraw, which is intended for human consumption and includes liquid\nand any substance which has been used in the manufacturing,\npreparation or treatment of food excluding\n(a) medicinal products within the meaning of the Drug Regulatory\nAuthority of Pakistan Act, 2012 (XXI of 2012);\n: (b) tobacco and tobacco products; and\n(c) narcotic or psychotropic substances;\n(xxiii) “food safety” means safety measures taken by the Federal\nGovernment to. ensure that food intended for export or import\ncomplies with applicable SPS standards;\n(xxiv) “goods” means agricultural product, agro-chernicals, animal,\n: animal products, plant, fish, fish products, feed, food and\nSR pesticides;\nFh (xxv) “grade designation” means the grade designation prescribed as\n: “indicative of the quality of any product;\nPART I] THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 159\nee ee ee —————\n(xxvi) “grade designation mark- means a mark prescribed as representing\na particular grade designation;\n(xxvii) “harmful organism” means any living stage of any or all insects,\nmites, nematodes, protozoa, slugs, snails, or other invertebrate\nanimals, fungi, bacteria, parasitic plants, virus or reproductive parts\nthereof, or any pathogen. weed, rodent. or other plant and animal\norganism which may, directly or indirectly, injure or cause disease\nto any plant or animal species;\n(xxviii) “hazard” means a biological, chemical or physical agent including\nbio-identical or synthetic hormones with the potential to cause an\nadverse effect on food safety, animal health or plant health and\nincludes bio-identical or synthetic hormones;\n(xxix) “international standards, guidelines and recommendations” shall\ninclude, inter-alia,—\n(a) for food safety, the standards, guidelines and recommendations\n| established by the Codex Alimentarius Commission; :\n| :\n(b) for animal health and zoonoses, the standards. guidelines and\nrecommendations developed under the auspices of the World\nOrganization for Animal Health (WOAH);\n| (¢) for plant health, the international standards. guidelines and\nrecommendations developed under the auspices of the Secretariat of\n| the International Plant Protection Convention (IPPC) in cooperation\nwith regional organizations operating within the framework of the\n(IPPC);\n(d) for testing laboratories, the general requirements for the\ncompetence of calibration and testing laboratories laid down in ISO\n| Standard 17025 of the International Standards Organization; and\n(e) for matters not covered above, appropriate standards, guidelines,\nand recommendations adopted by other relevant international\norganizations; ;\n(xxx) “invasive alien species” means plants, animals or other organisms\nthat cause significant harm to the environment, economy human\n2 health, where those are not native;\n: (xxxi) “maximum residue limit” or “MRL” means the maximum\nBio ~~ concentration of a residue that is legally permitted or recognized as\n160 THE GAZETTE OF PAKISTAN, EXTRA. MAY 2, 2025 [PART I\n——————————\nacceptable in or on a food or agricultural commodity or animal\nfeedstulT:\n(xxxii) “nominated department” means department or any legal entity in\nthe provinces nominated by the provincial Government;\n(xaxiii) “notifiable animal disease” means the animal diseases of national\nand international concern, that must be reported to the veterinary\nauthority within a defined time frame when suspected by owners,\nvets or laboratories;\n(xxxiv) “official control” means programmes, processes, procedures or\nmechanisms developed by the Authority for the purpose of\nimplementing the SPS measures and control of pathogenic agents,\nharmful organisms, pests, pesticides or diseases as prescribed under\nthe regulations;\n(xxxv) “person” means a natural or artificial person and may include a\ncompany, firm, association of persons, authority, or any other body\ncorporate;\n(xxxvi) “pest” means any species, strain or biotype of plant, animal or\npathogenic agent injurious to plants and plant products, materials or\nenvironments and includes vectors of parasites or pathogens of\nhuman and animal disease and animals causing public health\nnuisance;\n(xxxvii) “pesticides” means any substance or mixture of substances used or\nrepresented as a means for preventing, destroying, repelling,\nmitigating or controlling, directly or indirectly or any harmful\norganism;\n(xxxviii) “placed on the market” means the holding or displaying for sale,\noffering for sale, selling, delivering or any other form of placing on\nthe market, and retail and wholesale trade;\n(xxxix) “plant” means all species of plants, crops, or parts thereof, whether\nliving or dead, including stems, branches, tubers, bulbs, corns,\nstocks, bud-wood, cuttings, layers, slips, suckers, roots, aquatic\n\\ algae, leaves, flowers, fruits and seeds;\n(x1) “points of entry” and “points of exit” mean any sea port, airport,\ndry-port or land routes respectively declared by the Federal\nGovernment designated for the import or export of any goods;\nAR [ THE GAZETTE OF PAKISTAN, EXTRA, MAY 2, 20% 16]\n(Ji) prescribed” means prescribed by rule or repalations made under\nthis Ordinance:\n(xl) “quality” means conformity to prescribed requirement or\nspecification of a product or service;\n(alii) “quarantine facility” means a site or premises provided or approved\nby the Authority for the isolation and examination of goods\nintended for import or export;\n(xliv) “sanitary and phytosanitary (SPS) measure” means measures to be\nprescribed by rules and implemented to\n(a) protect human life or health or environment from risks arising from\nharmful organisms carried by animals, plants or products bascd\nthereon, or from the entry, establishment or spread of harmful\norganisms including invasive alien species;\n(b) protect animal or plant life or health from risks arising from the\nentry, establishment or spread of harmful organisms;\n(c) protect human, animal or plant life or health from risks arising from\nadditives, contaminants, residues of pesticides and veterinary drugs.\ntoxins or disease-causing organisms in food and feed; or\n(d) prevent or limit other damage from the entry, establishment or\nspread of harmful organisms including alien invasive species via\ntrade and commerce in products to which this Ordinance applies.\n(xlv) “Scientific Committee” means the committee constituted under this\nOrdinance;\n(xlvi) “scientific advice” means the advice rendered by the scientific\ncommittee based on scientific evidence and knowledge under this\nOrdinance;\n(xlvii) “sub-standard” when used with reference to a pesticide, means any\npesticide the strength or purity of which falls below the professed\n| standard or quality which is expressed on its label or under which it\nis sold or a pesticide any valuable ingredient of which has been\nwholly or partially extracted;\n(xlviii) “WOAH” means “World Organization of Animal Health”\npreviously known as “Office International des Epizooties” (OIE) an |\n162 THE GAZETTE OF PAKISTAN, EXTRA, MAY 2, 2025 [PART |\n—————————————— —————————————————————— A  — cy\nintergovernmental organization and global authority on animal\nhealth.\n(Alix) “zone” means a defined part of a territory containing an animal\nsubpopulation with a distinct health status with respect to a specific\nanimal disease or diseases for which surveillance, control and\nbiosecurity measures have been applied for the purpose of animal\ndisease prevention, control or eradication and international trade.\nCHAPTER II : |"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Authority",
      "content": "(1) Upon the commencement\nof this Ordinance, there shall be established an authority to be known as the\nNational Agri-trade and Food Safety Authority (NAFSA) to carry out the\npurposes of this Ordinance. fo :\n(2) The Authority shall be a body corporate, having perpetual\nsuccession and a common seal with power, to enter into contracts, acquire, hold\nand dispose of property, both movable and immovable, and to sue and be sued in\nits name. . |\n(3) The headquarters of the Authority shall be at Islamabad and it may\nestablish such other places in Pakistan as it may deem necessary."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Board of Governors",
      "content": "{1) The general superintendence, policy\ndirection. oversight, and all matters pertaining to the policy and administration of\nthe Authority shall vest in the Board. The Board shall consist of a Chairperson\nand the following members who shall be appointed by the Prime Minister for a\nterm of three years, namely :— :\n(a) six members who are Secretaries of the department concerned with\nthe affairs of Agriculture or livestock Departments in the Punjab,\nSindh, Khyber Pakhtunkhwa, Balochistan, Azad Jammu and\nKashmir and Gilgit-Baltistan;\n(b) one representative each, not below the rank of Additional Secretary\nfrom division concerned with the affairs of national food security\nand research, climate change, commerce, science and technology\nand finance;\n(c¢) two female members with expertise in food safety, food\ntechnology, public health, agronomy, or a related field;\n(d) two members from academia or research organizations; and\n|} AAARILY | BEI ERT] 2 e2 SRE. TERRIER va '\n(0) theee members, one each from\n(plant related trading, associntlons:\nGb antmal trading associations, and\n5) \\ 1 \\ ' | aie d\n(i) the Federation of Pakistan Chambers of Commerce al\nIndustry (KPC,\n(2) The Chairperson shall bo a person known for his integrity uty\neminence having experience of not less than twelve years in any relevant fiel\nincluding, food safety, food technology, public health, agronomy, animal health,\nwade and economies or a related field,\n(3) The Director General of the Authority shall serve as an ex-officio\nmember of the Board, having no right to vote, and shall act as the secretary of the\nBoard,\n(0) The members, other than ex-officio member, shall be appointed on\nsuch terms and conditions as may be determined by the Prime Minister, No\nperson shall be appointed as a member of the Board for more than two\nconsecutive term,\n(5) The Chairperson or a member, other than the ex-officio members,\nmay in writing addressed to the Prime Minister, resign from his office.\n(6) The Prime Minister may remove the Chairperson or any member\nfrom office if they are found incapable of discharging their duties due to lack of\ninterest, non-performance, or upon conviction by a court of law.\n(7) The Chairperson or any member, other than an ex-officio member,\nshall be deemed to have vacated their office if they are absent without prior\nintimation to the Board from more than three consecutive meetings of the Board."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Functions and powers of the Authority",
      "content": "——(1) The Authority shall\ncarry out its functions, namely:—\n(1) develop, apply and achieve compliance with SPS measures in\nrelation to import, export and inter-regional trade of goods taking\ninto account international standards, guidelines and\nrecommendations;\n|\n164 THE GAZETTE OF PAKISTAN, EXTRA, MAY 2, 2025 [PART |\nte te\n(it) adopt and administer all acts already taken by the Federal\nGovernment with regard to SPS measures in relation to imports,\nexports, and inter-regional trade of goods,\n(iii) register any business operator if not already registered with any\nother authority or government entity in such manner as may be\nprescribed,\n(iv) ensure compliance with SPS standards by business operators\nthrough a system of official controls, which it may carry out at any\nstage of preparation of goods meant for export;\n(V) ensure compliance by business operators with track and trace or\nmarking and grade designation requirements of goods;\n(vi) register and regulate formulation plants in such manner as may be\nprescribed;\n(vii) implement inspection and quarantine controls at points of entry and\npoints of exit with regard to import and export of goods;\n(viii) constitute sub-committees as required for carrying out the purposes\nof this Ordinance;\n(ix) regulate, prohibit and restrict the import or export of goods likely to\nintroduce harmful organism, invasive species, or diseases to any\nother goods or humans, as per the prescribed mechanism;\n(x) issuing and cancel registration or other certificates and licenses for\nactivities requiring certificates or licenses under this Ordinance;\n(xi) supervising and monitoring business operators regarding SPS\ncompliance, food safety and quality standards;\n(xii) coordinate with Provincial Governments to implement SPS\nmeasures for the production, transportation, storage, and marketing\nof goods intended for export from Pakistan, as well as for related\npurposes under this Ordinance; :\n(xiii) prepare and implement national crisis management plans for the\ncontrol of risks regarding the application of SPS measures with the\ncoordination of the relevant Provincial authorities on such terms\nand conditions as may be prescribed; :\n(xiv) nominate, notify or establish the accredited testing laboratories;\nPART 1) THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 165\n(xv) submit all mandatory or voluntary documentation or reporting to\nthe international bodies, convention, associations or organizations;\n(xvi) management and administration of biosecurity measures applied to\nzones and compartments for the purposes of export certification;\n(xvii) conduct official veterinary diagnostic tests and analysis, issuance of\ntest results and international veterinary certificates for the purposes\nof international notifications of notifiable animal diseases or the\nexport of Goods;\n(xviii) represent Pakistan in bilateral regional and international forums\nrelated to international trade in animals and animal products;\n(xix) international coordination and market access negotiations for export\nand import of goods including animals and animal products;\n(xx) protection of endangered areas and designation, maintenance and\nsurveillance of pest free areas and areas of low pest prevelance.\n(2) In performing its functions and exercising its powers as set out in\nsub-section (1), the Authority may—\n(i) engage in any study or project relating to any matter under this\nOrdinance and in conjunction with other authorities, international\nagencies or organizations;\n(i) levy such charges and fees for the performance of its functions in\nsuch manner as may be prescribed;\n(iii) determine a service structure appropriate to the functions and\nappoint such officers and employees, advisors, consultants, experts\nor scientists as required necessary on such terms and conditions as\nmay be prescribed;\n(iv) approve annual budget estimates for the submission to the Federal\nGovernment; :\n(v) receive and manage property, income, grants, contributions made to\nit, raise loans and to invest any fund representing such property,\norante bequests, trusts, gifts, donations, endowments or\n166 THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 [PART |\n(vii) conduct studies, surveys, experiments and analysis of data for\napplication of the SPS measures in international trade;\n(viii) work to secure and sustain market access for goods governed under\nthis Ordinance, and ensuring their unrestricted and continuous\nmovement within domestic and international markets and approve\ndigital transaction and guarantee for system generated certificate, as\nthe case may be;\n(ix) impose penalty or fines; and\n(x) perform any other function and deal with matters and things that\nmay be necessary or incidental thereto for the fulfilment of its\nfunctions under this Ordinance or may be assigned to it by the\nFederal Government, from time to time.\n(3) The Authority may entrust or outsource any of its functions to a\nperson, authority, agency or company through a contract arrangement, on such\nterms and conditions as may be mutually agreed."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Delegation",
      "content": "The Authority may delegate any of its powers and\nfunctions under this Ordinance to the Director General or any authorized officer,\nexcept section 42, under this Ordinance, subject to such conditions as may be\nprescribed."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Meetings of the Board",
      "content": "(1) The Board shall meet quarterly or as\noften as is expedient to perform its functions or on the specific advice of the\n: Federal Government.\n(2) The Chairperson, and in his absence, any other member elected by\nthe members present at a meeting, shall preside the meeting of the Authority.\n(3) The quorum of a meeting of the Board shall be simple majority of\nthe total membership, including the Chairperson and a representative from the\nMinistry of National Food Security and Research.\n(4) A meeting of the Authority shall be held in such manner as may be\nprescribed, and until so provided, as may be determined by the Authority,\n(5) No act or proceeding of the Board or its committees shall be\ndeemed invalid solely due to any vacancy or defect in their constitution.\n; 8. ; Director General. —(1) The Federal Government shall, by\n| notification in the official Gazette, appoint a person as Director General on such\nterms and conditions as may be prescribed by rules, for a term of three years. The\nDirector General may be reappointed for another term for three years.\nPART I] THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 167\nee —ee LSS eee ae —————\n(2) The Director General shall be the Chief Executive Officer of the\nAuthority and shall be responsible for the day to day administration of the affairs\nof the Authority and shall exercise such powers and functions as may be\nprescribed or assigned to him by the Authority."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Scientific Committee",
      "content": "(1) There shall be a scientific committee\nof the Authority which shall be responsible for rendering scientific or technical\nadvice on matters referred by the Board or the Director General.\n(2) The Board shall establish operational guidelines for the Scientific\nCommittee.\n(3) The scientific committee shall comprise of a minimum of fifteen\n(15) eminent scientists from the public and private sector who shall be appointed\nby the Authority for a term of three years-on such terms and conditions as may be\nprescribed.\n(4) _ The Authority shall appoint the convener of the scientific\ncommittee from amongst its members.\n(5) If a subject requiring advice from the Scientific Committee falls\noutside the expertise of its members, the Scientific Committee may recommend\nto the Board or the Director General that the matter be referred to any other\ncommittee established under this Ordinance.\n(6) The Board or the Director General, as the case may be, shall take :\n\"into account the scientific advice, which shall be binding only with respect to the\nissues specifically referred by the Board.\n(7) The Scientific Committee may, on its own initiative, provide\ntechnical or scientific advice to the Board or the Director General:\nProvided that such advice shall not be binding on the Board or the\nDirector General."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Advisory Committees",
      "content": "(1) The Board shall establish as many\nAdvisory committees as it deems appropriate for various trades and subjects and\nshall be responsible for improving the existing SPS standards, monitoring\nmaximum residual limits (MRLs) of pesticides and other chemicals, assessing the\nstorage and post-harvest losses, improvement in farm practeices, transportation,\ninter-regional trade of goods, providing training and awareness, provincial\ncoordination or and carrying out any other functions as directed by the Authority.\n(2) The Board shall establish the operational guidelines for the\nadvisory committees.\n168 THE GAZETTE OF PAKISTAN, EXTRA., MAY 2,2025 [PART |\n(3) The advisory committee shall comprise of representatives of the\nFederal and provincial governments, experts in the subject area and relevent\nstakeholders from public and private sector.\n(4) The Board shall appoint the convener of the advisory committee\nfrom amongst its members.\n| 11. Remuneration and expenses.— (1) The Authority shall pay such\nremuneration to the Director General and its employees as may be prescribed.\n(2) The Authority shall pay such meeting fees, expenses or\nremuneration, as the case may be, as may be prescribed, to the Chairperson,\nmembers of the Board and the Committees, constituted under this Ordinance."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Requirement to comply with the SPS measures",
      "content": "The goods\nintended for import or export shall comply with the SPS measures under this\n\"Ordinance as may be prescribed."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Inter",
      "content": "regional trade—(1) The inter-regional trade in goods\nbetween provinces shall comply with the SPS and food safety standards.\n(2) The Authority shall advise provinces to adopt uniform SPS -\nmeasures and food safety standards.\n(3) The Authority shall notify provinces of risks associated with the\nregional movement of food, feed, or animals, as may be prescribed.\n(4) Any dispute arising between provinces regarding compliance with\nSPS measures or food safety standards, or associated risks to human, plant, or\nanimal health, shall be referred to the advisory committee for resolution and, if\nrequired so, to the Scientific Committee for technical advice."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Import and export of agricultural products, food, feed, animal",
      "content": "and animal products.—(1) Notwithstanding any provisions contained in this\nOrdinance, the Authority shall have the power to recognize, assess, and notify\nSPS certificates. The Authority may, based on scientific advice, impose special\nconditions on any country whose SPS measures are deemed unsatisfactory to\nsafeguard plant, animal and human health within Pakistan.\n|\nPART I] THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 169\n—_—\n(2) No goods shall be imported into Pakistan unless accompanied by a\ncertificate issued by the relevant authority of the exporting country, certifying\ncompliance with the SPS conditions notified under sub-section (1).\n(3) All goods in transit through the territory of Pakistan for\ntransportation to another destination shall be subject to the applicable SPS\nconditions.\n(4) Transit of banned pesticides, genetically modified organisms\n(GMOs) which are not regulated by the National Biosafety Committee (NBC) of\nPakistan and unlicensed food or seeds, shall not be allowed."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Appointment of authorized officers",
      "content": "(1) The Authority may\nappoint such number of officers as authorized officers as may be necessary for\n(2) Subject to the provisions of this Ordinance and the regulations\nmade thereunder, the Authority may confer the powers of the Authorized\nOfficers, as may be prescribed, upon any officers of the Authority, Federal\nGovernment, Provincial Government or any other statutory entity established by\n~ the Federal or Provincial government."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Powers of authorized officers",
      "content": "(1) Subject to provisions of this\nOrdinance, the authorized officer may,—\n(a) at any reasonable hour or whenever work is in progress in any\nestablishment in which goods are believed to be produced, stored,\nprocessed or packaged for export, enter that establishment for the\npurposes of carrying out official controls so as to determine\ncompliance with the SPS measures, animal health or food safety;\n(b) inspect or examine goods in any establishment to which this\nOrdinance applies, or which is used or capable of being used for the\npreparation of goods for export purposes and shall take samples\nthereof for laboratory analysis;\n(c) stop and search any person, luggage, vehicle, vessel, railway\nwagon, or aircraft at any point of entry or exit carrying goods\nsubject to this Ordinance, examine such goods and take samples\nthereof’\n170 THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 [PART |\n—_——\n(d) require disinfection of any premises, aircraft, railway wagon,\ncarriage,vessel or vehicle of any description used for carrying\nanimals or animal products;\n(e) inspect the goods for compliance with the prescribed grade\ndesignation and marking;\n(f) call for such books, documents or other records in any medium\nwhatsoever which he believes to contain any information or data\nrelevant to the enforcement of the provisions of this Ordinance with\nrespect to the goods, make copies thereof and take extracts there\nfrom;\n(g) seize or detain for such time, as may be necessary, the goods by\nmeans of, or in relation to which, he is of the opinion that the\nprovisions of this Ordinance have been contravened and shall, at\nthe time of seizure or detention, inform, in writing, the business\noperator or the person from whose possession the seizure or\ndetention is made, of the grounds for the said action;\n(h) prohibit the export of animals which does not compliant to SPS\nmeasure or other specified conditions to carry; |\n(i) deport any animal or animal products, at the expense of the person\nimporting such animal or animal product, the import of which is\nprohibited by the Federal Government;\n(i) transfer goods to a quarantine facility for such time period as may\nbe prescribed;\nf\n(k) ensure that the prescribed conditions are followed in the quarantine\nfacility;\n(I) direct business operators or importer or exporter, as the case may be\nto conduct the prescribed tests, processes, or procedures on Goods\nand order their destruction if such tests confirm the presence of any\nharmful organism or disease; |\n(m) order disposal of clothing, fittings, fodder, harness, container or i\nlitter that may have been in contact with, or pertaining to, diseased\nanimals or animal products; |\ni\n(n) conduct survey of goods processing plants with a view to determine |\ntheir fitness for registration and their observance with the\nprovisions of this Ordinance;\nas\nPART |] THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 171\n—_—\n(0) seek assistance from a police officer or officer of any law\nenforcement agency for use of force that is reasonably necessary\nwhile carrying out his functions under this Ordinance; and\n(p) exercise any other function assigned to him by the Authority."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Transparency",
      "content": "(1) The Authority may conduct consultative and\nstakeholder consultation compliance to international commitments and market\naccess, during the preparation, evaluation and revision of SPS measures under\nthis Ordinance.\n(2) Without prejudice to any other law for the time being in force,\nwhere there are reasonable grounds to suspect that Goods may present a risk for\nhuman health, animal health and plant health, then depending on the nature,\nseriousness and extent of that risk, the Authority shall take appropriate steps to\ninform the business operator and, if necessary, the general public, of the nature of\nthe risk to human health, animal health, plant health or identifying to the fullest\nextent possible the risk that the Goods may present, and the measures which are\ntaken or about to be taken to prevent, reduce or eliminate that risk.\n(3) Without prejudice to any other law, the Authority shall prescribe\ninternal accountabiluity mechanism to prevent the misuse of funds, power or\nauthority under this Ordinance.\nJURISDICTION, OFFENCES AND PENALTIES"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Aiding or abetting and offence under section 20",
      "content": "Any person\nwho by any means whatsoever attempts or aid or abets the commission of an\noffence under section 20 shall be punishable with the same punishment as\nprovided for the offence itself."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Offences by companies, etc",
      "content": "Where an offence punishable under\nsection 20 has been committed by a company, any person who, at the time the\noffence was committed, was in charge of and was responsible to the company for\nthe conduct of the business of the company, as well as any director or partner of\nthe company, shall be deemed to be guilty of the offence and shall be liable to be\nproceeded against and punished accordingly:\nProvided that nothing contained in this section shall render any such\nperson liable to any punishment provided in this Ordinance if he proves that the\noffence was committed without his knowledge or that he exercised due diligence\nto prevent the commission of such offence.\n172 THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 [PART |\nfm eee SE EERE ————N"
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Offences",
      "content": "A person shall be guilty of an offence under this\nOrdinance, if he—\n(1) imports or causes the importation of any animal or animal product\nfrom a country or territory from where such import is banned or\nprohibited due to the presence or suspected presence, or risk of\ntransmission of specified disease;\n(ii) imports or exports any animal without a valid health certificate\nissued by the competent authority of the exporting country, or with\na fake, forged, or fraudulent certificate;\n(iii) imports, manufacteures, formulates, sells, offer for sell, hold in\nstock for sale, or advertise for sale an adulterated pesticide;\n(iv) refuses to permit inspection of a formulation plant;\n(v) supplies animal or animal product from, or process animal product\nin, any establishment or premises which is not approved or\nregistered for that particular export;\n(vi) denies to quarantine the animals as required under this Ordinance or\nregulations thereunder;\n(vii) removes animal, animal products from a quarantine facility or shift\nthe same to some other unapproved premises;\n(viii) stores or process sub-standard pesticides or agrochemicals;\n(ix) exports the animals and animal products without observing the\nsanitary requirements of the importing country;\n(x) submits fake or forged lab reports, pre-shipment inspection report,\nmanufacturing certificate, country of origin certificate regarding\nquantity, quality or type of goods;\n(xi) fails to report any disease, pathogen associated with imported plant,\nplant material or animal in quarantine facility;\n(xii) fails to submit report, data or any other documents required by the\n: Authorize Officer about imported goods in quarantine facility;\n(xiii) plants plant and plant material at unregistered quarantine facility;\n(xiv) imports or store banned agrochemicals pesticides;\nPART 1] THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 173\nan PEE ee me\n(xv) imports and stores hazardous pesticides without due precautions;\n(xvi) denies to perform SPS measures or fulfill special conditions;\n| (xvii) willfully obstructs, hinders or resists the Authorized Officer from\ncarrying out a function under this Ordinance;\n(xviii) stores or process adulterated pesticides or agrochemicals;\n|\n| (xix) wilfully obstructs, hinders or resists the police officer or officer of\nlaw enforcing agenies assisting the Authorized Officer, in carrying\nout a function under this Ordinance;\n(xx) imports, manufactures, formulates, sells, offers for sale, holds in\nstock for sale or advertises for sale an adulterated or banned\n- pesticide;\nd \\ 2\n(xxi) sells, offers to sale, stores or holds unregistered, fake, adulterated\n| expired agrochemicals or pesticides in market; ;\n(xxii) attempts to import or export without the required documents or\ni attempting to import or export undeclared goods;\n(xxiii) refuses to comply with special conditions of importing country;\n(xxiv) imports any animal without declaring and registering a quarantine\nfacility;\n(xxv) sells or offers to sale agrochemicals and pesticides with incomplete\nlabel and seal of pesticide containers, bags or similar items;\n(xxvi) wilfully conceals a fact, makes a false statement to, or misleads, the\nAuthorized Officer who is carrying out a function under this\nOrdinance or regulations; and\n(xxvii) denies to show prescribed register, areas, stores, labs etc."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Penalties",
      "content": "Whosoever contravene any provision of section 20,\nshall be in case of contravention of clauses,—\n(i) (i), (ii), (iii) or (iv) shall be punishable with imprisonment for a\nterm which may extend to three years, or with fine which may\nextend to three million rupees or with both and where an accused\nwas directed by the Authorized Officer for immediate\ndiscontinuance of the offence, the Court may impose a further fine\n174 THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 [PART |\nEe\nwhich may extend to fifty thousand rupees for every day for the\nperiod the offence continues;\n(ii) (Vv), (vi), (vii) and (viii) shall be punishable with imprisonment for a\nterm which may extend to two years, or with fine which may\nextend to two million rupees or with both and where an accused\nwas directed by the authorized officer for immediate discontinuance\nof the offence, the Court may impose a further fine which may\nextend to twenty five thousand rupees for every day for the period\nthe offence continues;\n(iit) (ix), (x), (xi), (xii), (xiii), (xiv), (xv), (xvi), (xvii), (xviii), (xix), (xx)\nor (xxi) shall be punishable with imprisonment for a term which\nmay extend to one year, or with fine which may extend to one\nmillion rupees or with both and where an accused was directed by\nthe Authorized Officer for immediate discontinuance oi the\noffence, the Court may impose a further fine which may extend to\nten thousand rupees for every day for the period the offence\ncontinues; and\n(iv) (xxii), (xxiii), (xxiv), (xxv), (xxvi) or (xxvii) shall be liable to pay\nfine which may extend to five hundred thousand rupees and where\nan accused was directed by the authorized officer for immediate\ndiscontinuance of the offence, the Court may impose a further fine\nwhich may extend to one thousand rupees for every day for the\nperiod the offence continues."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Cognizance of offences",
      "content": "(1) Notwithstanding anything contained\nin the Code of Criminal Procedure, 1898 (Act V of 1898), the Court of Sessions\nshall take cognizance of any offence punishable under section 20, on a complaint\nin writing made by the Director General or an Authorized Officer.\n(2) For the purposes of trial appeal etc. the provisions of Code of\nCriminal Procedure, 1898 (Act V of 1898) shall mutatis mutandis apply."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Disposal of forfeited goods",
      "content": "Any goods forfeited on conviction\nof a person by the Court under this Ordinance shall be disposed of by the\nAuthority at the cost of the convicted person or business operator as the case may\nbe, in the prescribe manner."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Complaint resolution committee",
      "content": "(1) The Authority shall\n: constitute a complaint resolution committee and establish a mechanism for the\nredressal of complaints arising from the refusal of registrations or licenses or\ncertificates by the Authority, or any other matters as may be prescribed.\nPART 1] THE GAZETTE OF PAKISTAN, EXTRA, MAY 2, 2025 175\n—————— eet ee tr te\n(2) The Authority shall prescribe the procedure and related matters\n~ concerning the complaint resolution committee.\n(3) Any person or business operator feeling aggrieved of any order of\n~ application within thirty days for redressal of his grievances before the complaint\nresolution committee in the prescribed manner."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Appellate Committee",
      "content": "(1) The Authority shall constitute an\nappellate committee and prescribe a mechanism for redressal of all appeals\nagainst the decisions of the complaint resolution committee.\n(2) Any person or business operator aggrieved by any decision of the\ncomplaint resolution committee may file an appeal within thirty days of passing\nof such order before the appellate committee."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Bar of jurisdiction",
      "content": "Notwithstanding anything contained in any\nother law for the time being in force and except as provided under this\nOrdinance, no decision or action taken under this Ordinance or rules or\nregulations made thereunder shall be questioned by any agency or challenged in\nany court or tribunal, nor shall any injunction be granted against such decisions\nor actions. |"
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Coordination with Provincial Governments",
      "content": "The Authority\nshall,—\n(a) require the nominated department of provincial governements to\nprepare an annual programme of official control activities in\nrelation to matters falling within the jurisdiction of the department\nas set out in sub-section (1) of section 5 and submit the same to the\nAuthority, specifying,—\n(i) the type of control activities to be carried out; and\n(ii) the criteria applied in drawing up the programme;\n(b) communicate policy guidelines and policy decisions made or taken\nby the Board for their compliance in the respective provinces\nrelating to the SPS measures, animal health, pesticide regulation\nand food safety.\n176 THE GAZETTE OF PAKISTAN, EXTRA, MAY 2, 2025 [PART 1\n—_—\n(c) publish model regulations, guidelines and manuals with regard to\nthe application of the SPS measures to be adopted by Provincial\nGovernments; and\n(d) facilitate harmonization of provincial laws, rules and regulations\nrelating to the SPS measures required for obtaining and sustaining\nmarket access."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Emergency measures for ensuring SPS conditions",
      "content": "(1) Where\nthe nominated department of provincial government knowing that any goods are\nlikely to constitute a serious risk to human health, animal health or plant health\nand that such risk cannot be contained satisfactarily by means of measures taken\nunder the provisions of this Ordinance, or other laws for the time being in force,\nthe nominated department shall immediately adopt one or more of the following |\nmeasures, depending on the gravity of the situation\n(a) in the case of goods of national origin\n(i) ensure the suspension of the placing on the market or use of\nthe agricultural product, food or feed in question;\n(ii) lay down special conditions for the agricultural product, food\nor feed in question;\n: (iii) use its best endeavors to identify the source of the hazard, and |\ntake measures to prevent its future occurrence;\n(iv) any other appropriate interim measure; and\n(v) inform the Authority about the measures taken in this regard;\nand .\n(b) in the case of imported goods, the Authority may take additional\nmeasures to—\n(i) inform the relevant authorities in the country of origin or\ntransit responsible for official control of the hazard identified;\n(ii) * ensure the suspension of the placing on the market or use of\nthat goods;\n(iii) suspend import of that goods from the country concerned and,\nwhere applicable, from the country of transit;\n|\n| |\n| PART 1] THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 177\n| —\n| (iv) lay down special conditions for the future import of that goods\nfrom the country concerned; and\n(v) any other measure deemed appropriate.\n(2) The actions taken under sub-section (1) shall be subject to—\n(a) approval of the Board,\n(b) information to the nominated department of Provincial\nGovernments;\n(c) information to the business operators; and\n(d) information to such other department including the Customs\nDepartment.\nCHAPTER — VI"
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Laboratory analysis of samples",
      "content": "(1) The samples collected for\nanalysis under section 16 for the purpose of official control, testing of\nagrochemicals, animal diseases, food safety and SPS measures shall be analyzed\nby a testing laboratory notified under this section.\n(2) The Authority may notify any accredited testing laboratory\nestablished in the private or public sector, a university laboratory, a research\norganization laboratory, or a laboratory established by the Federal or Provincial\nGovernment for conducting all tests including for official control of SPS\nconditions.\n(3) The Authority may establish testing laboratories or recognize any\nexisting laboratory where it is expedient to perform the functions under this\nOrdinance.\n(4) The Authority shall maintain and publish in the official Gazette the\nlist of testing laboratories notified under this section.\n(5) The samples collected under section 16 for the purpose of official\ncontrol of food safety, animal, pesticides or SPS conditions etc., shall be\ntransmitted to the notified laboratory by the authorized officer that shall carry out\nits functions on such terms and conditions as may be prescribed. :"
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Accreditation of testing laboratories",
      "content": "(1) All testing laboratories\ndesignated for official controls, food safety, SPS conditions, and agrochemical\n178 THE GAZETTE OF PAKISTAN, EXTRA, MAY 2, 2025 [PART |\ntesting shall adhere to the general requirements for competence of calibration and\ntesting laboratories as prescribed in the latest ISO Standard of the International\nStandards Organization, or any superseding standard. Such competence shall be\naccredited by the Pakistan National Accreditation Council (PNAC) or any\naccreditation body that is a signatory to the International Laboratory,\nAccreditation Cooperation (ILAC) Mutual Recognition Arrangement (MRA) for\nthe purpose of conducting sample analysis.\n(2) The laboratories shall only be notified for the testing methods and\nparameters, which are within the scope of their accreditation.\nCHAPTER — VII"
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. The Fund",
      "content": "(1) There shall be a non-lapsable fund of Authority to\nbe called as National Agri-trade and Food Safety Authority Fund, which shall be\nutilized for the performance of its functions under this Ordinance, including the\npayment of remuneration, salaries, and all other expenses of the Authority.\n(2) The Fund shall consist of,—\n(a) seed money provided by the Federal Government;\n(b) sums as the Federal Government may, from time to time, allocate to\nthe Authority in the annual budget or otherwise;\n(c) any financial allocation made by the Federal Government from any\nfund or revenue received in relation to the promotion of exports,\nsuch as the Export Development Fund or from imports; g\n(d) “endowments, donations, contributions, bequests, trusts and grants |\nprovided by domestic and international institutions and\norganizations;\n(e) loans, aid and assistance in any form and from any source as\napproved by the Board;\n(f) income from sales, subscriptions or royalties of publications and\nremuneration for professional services rendered by the officers,\nresearchers, advisors and experts of the Authority;\n(g) charges and fees levied for, and the fine received under, the\nperformance of control functions:\nPART I] THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 179\n(h) income from investments, if any, made in the schemes of the\nFederal Government as approved by the Board;\n(1) all other sums or properties which may in any manner become\npayable to, or vest in the Authority, in respect of any matter; and\n(J) any surplus of receipts over the actual expenditure in a year shall be\nremitted to the Federal Consolidated Fund and any deficit from the\nactual expenditure shall be made-up by the Federal Government.\n(3) Subject to the Public Finance Management Act, 2019 all funds of\nthe Authority shall be kept and deposited in one or more accounts maintained by\nit, in local or foreign currency, in any scheduled bank and shall be operated as\napproved and directed by the Board. | :"
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Audit",
      "content": "1) The Auditor General of Pakistan shall annually audit\n| the accounts of the Authority.\n(2) The Government may, in addition to the audit under sub-section\n(1), cause the accounts of the Authority to be annually audited by a Chartered\nAccountant or a firm of Chartered Accountants and, at any time, appoint a\nChartered Accountant or a firm of Chartered Accountants, to conduct an\nadditional external audit of the accounts of the Authority and submit its report to\"\nthe Government\n(3) The Authority shall produce all books of accounts and documents\nand furnish such explanation and information as an auditor may require for\npurposes of audit.\nCHAPTER - VIII :\nGeneral and Miscellaneous Provisions :"
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Ordinance to override other laws",
      "content": "The provisions of this\n; Ordinance shall have effect notwithstanding anything to the contrary contained in\nany other law for the time being in force. In case of any inconsistency, the\nprovisions of this Ordinance shall prevail."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Repeal and savings",
      "content": "(1) After the commencement of this\nOrdinance, the following laws shall, stand repealed on such date the Federal\nGovernment may by notification in the official Gazette appoint, namely: —\n(i) the Pakistan Plant Quarantine Act, 1976 (LXXV of 1976);\n(ii) the Pakistan Animal Quarantine (Import and Export of Animals and\nAnimal Products) Ordinance, 1979 (XLIX of 1979);\ni\n\\ \"\n180 THE GAZETTE OF PAKISTAN, EXTRA., MAY 2,2025 (PART |\ngimp = RS eS EEE ——— [|\n(iii) the Agricultural Pesticides Ordinance, 1971 (II of 1971); and |\n|\n(iv) the Agricultural Produce (Grading and Marking) Act, 1937 (I of 1937), |\n(2) The Federal Government may, by notification in the official |\nGazette, specify the law which is required to be repealed under sub-section (1)\nfrom the date specified in the notification. , |\n|\n(3) Anything done, action taken, permitted, granted licence or\napplications made, obligations or liabilities incurred, rights and assets acquired, |\npersons appointed or authorised, jurisdiction or powers conferred, order issued |\nunder any of the provisions of the repealed laws and the rules or regulations|\nmade thereunder shall continue and be deemed to be as if that were taken or\nprovided under this Ordinance unless repealed or amended. |"
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Members, officers and officials, etc., to be public servants",
      "content": "The Chairperson, Director General, members, officers, of the Authority shall,\nwhen acting or purporting to act in pursuance of any of the provisions of this |\nOrdinance or regulations made thereunder, be deemed to be public servants\nwithin the meaning of section 21 of the Pakistan Penal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Access to statistical data and information, etc",
      "content": "Notwithstanding\nanything contained in any other law for the time being in force, the Authority\nshall have the right to obtain and access data, statistic and information relating to\nimports and exports of goods based thereon from a business operator that may be\nnecessary, as for official use and analysis."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Validity of proceedings",
      "content": "No act or proceedings shall be invalid\nby reason only of existence of a vacancy, or defect, in the constitution of the\nAuthority, Board, scientific committee or advisory committee:\nProvided that the invalidity shall be validated within six months by the\nBoard or the Committee as the case may be.\n3%. Abolishment of Departments.—(1) On the appointed date under\nsection 34, the Animal Quarantine Department and the Department of Plant\nProtection shall stand abolished. :\n(2) On the appointed date all assets, liabilities, rights, obligations,\npatents, licenses, and interests of the departments shall stand transferred to the\nAuthority upon its establishment, subject to such terms and conditions as may be\nspecified by the Federal Government,\nPARTI] THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 181\nee\n(3) Every employee of the departments specified in sub-section (1)\nshall be given an irrevocable option, within six months of commencement of this\nOrdinance, either to continue on the same terms and conditions applicable to\nthem or to opt for absorption in the service of the Authority:\n| Provided that all those civil servants who do not exercise option under\nthis sub-section within the period of six months shall stand transferred to the\nsurplus pool of the Establishment Division and other employees shall continue on\nintact it shall not be subject to extension further."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Transition period",
      "content": "The trade-related functions performed by the\nDepartment of Plant Protection and the Animal Quarantine Department shall\ncontinue for a period not exceeding six months from the appointed date under\n\"section 34, during which the Authority shall make its regulations and appoint\nemployees."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Power to make rules",
      "content": "Subject to this Ordinance, the Federal\nGovernment may, by notification in the official Gazette, make rules for carrying\nout the purposes of this Ordinance."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Power to make regulations",
      "content": "The Authority with the previous\napproval of the Federal Government may by notification in the official Gazette\nmake regulations for carrying out the purposes of this Ordinance."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Confidentiality of data",
      "content": "(1) Subject to the Right of Access to\nInformation Act, 2017 (XXXIV of 2017), no information relating to any business\noperator, obtained by the Authority in the course of official controls under this\nOrdinance, shall be disclosed without the prior written consent of the business\noperator, except—\n(a) in accordance with the directions of the Board, to the extent\nnecessary for the purposes of this Ordinance;\n(b) for the purposes of any proceedings for an offence under this\nOrdinance, or for any report of such proceedings; or\n(c) in compliance with an order of a court of competent jurisdiction.\n(2) Any person who discloses information in contravention of sub-\nsection (1) shall be liable for proceedings of misconduct in accordance with the\nprovisions of this Ordinance or regulations made thereunder."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Removal of difficulties",
      "content": "If a difficulty arises in giving effect to\nany provision of this Ordinance, the Federal Government may make such order,\n182 THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 [PART I\n—_—\nnot inconsistent with the provisions of this Ordinance, as may appear to it to be\nnecessary or expedient for the purpose of the removal of such difficulty:\nProvided that the power under this section shall not be exercised after\ntwo years of the commencement of this Ordinance.\nASIF ALI ZARDARI,\nPresident. )\nRAJA NAEEM AKBAR,\nSecretary.\n:\n:\nee ep yA PE Serpe rr\nPRINTED BY THE MANAGER, PRINTING CORPORATION OF PAKISTAN PRE /\nPUBLISHED BY THE DEPUTY CONTROLLER, STATIONERY AND FORMS, UNIVERSITY ROAD, KARA i"
    }
  ],
  "definitions": [
    {
      "term": "adulterated pesticide",
      "definition": "a pesticide with which spurious. deleterious or harmful substance has been mixed or which is wholly or mainly ineffective for the purpose for which it is intended;",
      "source_provision": "sec2"
    },
    {
      "term": "Advisory Committee",
      "definition": "the committee constituted under BRE section 10; ; al 2 (iii) “Agricultural product” includes all produce of agriculture or Teli horticulture, forest, and plants, all products of genetic sequencing Rrhi p information, single-cell proteins, and products of biotechnology END intended for use food or feed and all good related to food or drink ap wholly or partly manufOrdinanceured from any such produce; Si (iv) “agro-chemicals” includes pesticides, growth regulators, Bins pheromones, kairamones, growth inhibitors, attrOrdinanceants, Bae repellents, rodenticides, miticides, excluding fertilizers or micro- se nutrients, DNA based chemicals used for traceability; o! (v) “animal” means a living thing that is not a human or plant; PART I] THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 157",
      "source_provision": "sec2"
    },
    {
      "term": "animal products",
      "definition": "anything originating or made, whether in whole or in part, from an animal or from a carcass and includes blood. bones. bone marrow, casings, dairy products, eggs, honey. fat, foodstuffs of animal origin, hair, hides, horns, hooves, hormones, and their biological preparations, offal, seed materials for research purposes, semen, ova and embryos, skin, tendons, viscera, wool and any other substance of animal origin excluding germinal products. biological products and pathological material as may be specified;",
      "source_provision": "sec2"
    },
    {
      "term": "Appellate Committee",
      "definition": "the Committee constituted under this Ordinance; (viii) “Authority” means the National Agri-trade and Food Safety Authority (NAFSA) established under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "authorized officer",
      "definition": "an officer nominated by the Authority under this Ordinance for exercising powers and performing functions in accordance with the provisions of this Ordinance and the rules and regulations made thereunder;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of Governors constituted under this Ordinance; Pe : (xi) “business operator” means a natural or legal person registered with the Authority under this Ordinance; | (xii) “certificate” means the certificate of quality and sanitary and phytosanitary (SPS) compliance, animal health certificate, or any other certificate issued by the authorized officer to the business | operator confirming compliance with the provisions of this Ordinance; | (xiii) “Chairperson” means Chairperson of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "compartment",
      "definition": "an animal sub-population contained in one or more premises under a common biosecurity management system with a distinct health status with respect to a specific animal disease : or diseases for which surveillance, control and biosecurity measures : ~~ have been applied for the purpose of international trade; Fv te NY) “Complaint Resolution Committee” means the complaint resolution ~~ committee constituted under this Ordinance; 158 THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 [PART | — ee",
      "source_provision": "sec2"
    },
    {
      "term": "crop",
      "definition": "all agricultural or horticultural crops and all trees, bushes, herbs, shrubs, grass, plants, roots, fungi and algae grown for commercial or recreational purposes; (xvii) “Department” means Animal Quarantine Department and Department of Plant Protection; (xviii) “Director General” means the director general of the Authority appointed under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "disease",
      "definition": "suffering from or carrying any infectious or contagious disease or such disease as may be declared by the Federal Government from time to time by notification in the official Gazette;",
      "source_provision": "sec2"
    },
    {
      "term": "feed",
      "definition": "animal feed, including hay, roughage, concentrate or any other substance used for feeding animals;",
      "source_provision": "sec2"
    },
    {
      "term": "formulation",
      "definition": "the combination of various ingredients designed to render the product useful and effective for the purpose claimed and for the envisaged mode of application. (xxii) “food” means any substance, whether processed. semi-processed or raw, which is intended for human consumption and includes liquid and any substance which has been used in the manufacturing, preparation or treatment of food excluding (a) medicinal products within the meaning of the Drug Regulatory Authority of Pakistan Act, 2012 (XXI of 2012); : (b) tobacco and tobacco products; and (c) narcotic or psychotropic substances; (xxiii) “food safety” means safety measures taken by the Federal Government to. ensure that food intended for export or import complies with applicable SPS standards; (xxiv) “goods” means agricultural product, agro-chernicals, animal, : animal products, plant, fish, fish products, feed, food and SR pesticides; Fh (xxv) “grade designation” means the grade designation prescribed as : “indicative of the quality of any product; PART I] THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 159 ee ee ee ————— (xxvi) “grade designation mark- means a mark prescribed as representing a particular grade designation; (xxvii) “harmful organism” means any living stage of any or all insects, mites, nematodes, protozoa, slugs, snails, or other invertebrate animals, fungi, bacteria, parasitic plants, virus or reproductive parts thereof, or any pathogen. weed, rodent. or other plant and animal organism which may, directly or indirectly, injure or cause disease to any plant or animal species; (xxviii) “hazard” means a biological, chemical or physical agent including bio-identical or synthetic hormones with the potential to cause an adverse effect on food safety, animal health or plant health and includes bio-identical or synthetic hormones; (xxix) “international standards, guidelines and recommendations” shall include, inter-alia,— (a) for food safety, the standards, guidelines and recommendations | established by the Codex Alimentarius Commission; : | : (b) for animal health and zoonoses, the standards. guidelines and recommendations developed under the auspices of the World Organization for Animal Health (WOAH); | (¢) for plant health, the international standards. guidelines and recommendations developed under the auspices of the Secretariat of | the International Plant Protection Convention (IPPC) in cooperation with regional organizations operating within the framework of the (IPPC); (d) for testing laboratories, the general requirements for the competence of calibration and testing laboratories laid down in ISO | Standard 17025 of the International Standards Organization; and (e) for matters not covered above, appropriate standards, guidelines, and recommendations adopted by other relevant international organizations; ;",
      "source_provision": "sec2"
    },
    {
      "term": "invasive alien species",
      "definition": "plants, animals or other organisms that cause significant harm to the environment, economy human 2 health, where those are not native; : (xxxi) “maximum residue limit” or “MRL” means the maximum Bio ~~ concentration of a residue that is legally permitted or recognized as 160 THE GAZETTE OF PAKISTAN, EXTRA. MAY 2, 2025 [PART I —————————— acceptable in or on a food or agricultural commodity or animal feedstulT: (xxxii) “nominated department” means department or any legal entity in the provinces nominated by the provincial Government; (xaxiii) “notifiable animal disease” means the animal diseases of national and international concern, that must be reported to the veterinary authority within a defined time frame when suspected by owners, vets or laboratories; (xxxiv) “official control” means programmes, processes, procedures or mechanisms developed by the Authority for the purpose of implementing the SPS measures and control of pathogenic agents, harmful organisms, pests, pesticides or diseases as prescribed under the regulations; (xxxv) “person” means a natural or artificial person and may include a company, firm, association of persons, authority, or any other body corporate; (xxxvi) “pest” means any species, strain or biotype of plant, animal or pathogenic agent injurious to plants and plant products, materials or environments and includes vectors of parasites or pathogens of human and animal disease and animals causing public health nuisance; (xxxvii) “pesticides” means any substance or mixture of substances used or represented as a means for preventing, destroying, repelling, mitigating or controlling, directly or indirectly or any harmful organism; (xxxviii) “placed on the market” means the holding or displaying for sale, offering for sale, selling, delivering or any other form of placing on the market, and retail and wholesale trade; (xxxix) “plant” means all species of plants, crops, or parts thereof, whether living or dead, including stems, branches, tubers, bulbs, corns, stocks, bud-wood, cuttings, layers, slips, suckers, roots, aquatic \\ algae, leaves, flowers, fruits and seeds; (x1) “points of entry” and “points of exit” mean any sea port, airport, dry-port or land routes respectively declared by the Federal Government designated for the import or export of any goods; AR [ THE GAZETTE OF PAKISTAN, EXTRA, MAY 2, 20% 16] (Ji) prescribed” means prescribed by rule or repalations made under this Ordinance:",
      "source_provision": "sec2"
    },
    {
      "term": "quality",
      "definition": "conformity to prescribed requirement or specification of a product or service; (alii) “quarantine facility” means a site or premises provided or approved by the Authority for the isolation and examination of goods intended for import or export; (xliv) “sanitary and phytosanitary (SPS) measure” means measures to be prescribed by rules and implemented to (a) protect human life or health or environment from risks arising from harmful organisms carried by animals, plants or products bascd thereon, or from the entry, establishment or spread of harmful organisms including invasive alien species; (b) protect animal or plant life or health from risks arising from the entry, establishment or spread of harmful organisms; (c) protect human, animal or plant life or health from risks arising from additives, contaminants, residues of pesticides and veterinary drugs. toxins or disease-causing organisms in food and feed; or (d) prevent or limit other damage from the entry, establishment or spread of harmful organisms including alien invasive species via trade and commerce in products to which this Ordinance applies.",
      "source_provision": "sec2"
    },
    {
      "term": "Scientific Committee",
      "definition": "the committee constituted under this Ordinance; (xlvi) “scientific advice” means the advice rendered by the scientific committee based on scientific evidence and knowledge under this Ordinance; (xlvii) “sub-standard” when used with reference to a pesticide, means any pesticide the strength or purity of which falls below the professed | standard or quality which is expressed on its label or under which it is sold or a pesticide any valuable ingredient of which has been wholly or partially extracted; (xlviii) “WOAH” means “World Organization of Animal Health” previously known as “Office International des Epizooties” (OIE) an | 162 THE GAZETTE OF PAKISTAN, EXTRA, MAY 2, 2025 [PART | —————————————— —————————————————————— A — cy intergovernmental organization and global authority on animal health. (Alix) “zone” means a defined part of a territory containing an animal subpopulation with a distinct health status with respect to a specific animal disease or diseases for which surveillance, control and biosecurity measures have been applied for the purpose of animal disease prevention, control or eradication and international trade. CHAPTER II : |",
      "source_provision": "sec2"
    }
  ]
}
