{
  "id": "pk-national-and-provincial-assemblies-elections-to-reserved-seats-act-1976",
  "type": "statute",
  "title": "National and Provincial Assemblies (Elections to Reserved Seats) Act, 1976",
  "title_en": "National and Provincial Assemblies (Elections to Reserved Seats) Act, 1976",
  "short_name": "NAPAT",
  "status": "in_force",
  "issued_date": "1976-04-17",
  "in_force_date": "1976-04-17",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUZWRt-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National and Provincial Assemblies (Elections to Reserved Seats) Act, 1976 (XVIII of 1976) published by The Pakistan Code (Election Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the National and\nProvincial Assemblies (Elections to Reserved Seats) Act, 1976.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(i) \"Article\" means Article of the Constitution;\n(ii) \"Assembly\" means the National Assembly or a Provincial Assembly for a Province;\n(iii) \"candidate\" means a person seeking election as a member;\n(iv) \"Commission\" means the Election Commission constituted under Article 218;\n1 For Statement of Objects and Reasons, see Gaz. of P ., 1976, Ext., Pt. III, p. 325.\nThis Act has been r epealed in its application to the election to which the Repr    esentation of the People Act, 1976 (85 of 1976) applies, see Act No. 85 of 1976, s. 109.\n(V) \"Commissioner\" means the Chief Election Commissioner appointed under the\nConstitution and includes—\n(i) the person continuing in the office of Chief Election Commissioner by virtue of Article\n275; and\n(ii) a judge of the Supreme Court nominated under Article 217 to act as Chief Election\nCommissioner ;\n(vi) \"constituency\" means a constituency delimited under the Delimitation of Constituencies\nAct, 1974 (XXXIV of 1974), provided that in respect of a bye­election to a seat reserved\nfor women, in the National Assembly or a Provincial Assembly, to be held at any time\nbefore the expiry of the term of the first National Assembly, it shall mean a constituency\ndelimited under the Delimitation of Constituencies Order, 1970;\n(vii) \"election\" means election to a seat of a member held under this Act;\n(viii) “election petition” means an election petition made under section 12;\n(ix) “elector”, in relation to an Assembly, means a person elected to a general seat in that\nAssembly;\n(x) “member” means member of an Assembly;\n(xi) “prescribed” means prescribed by rules made under this Act;\n(xii) “returned candidate” means a candidate who has been declared elected as a member\nunder this Act;\n(xiii) \"Tribunal\" means an Election Tribunal appointed under section 17 for the trial of\nelection petitions."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Procedure of the Commission",
      "content": "(1) Subject to the provisions of this section, the Commission\nshall regulate its procedure.\n(2) If, upon any matter requiring a decision of the Commission, there is difference of opinion\namong its members, the opinion of the majority shall prevail and the decision of the Commission shall\nbe expressed in terms of the opinion of the majority.\n(3) The Commission may exercise its powers and perform its functions notwithstanding that there\nis a vacancy in the office of any one of its members or that any one of its members is, for any reason,\nunable to attend its proceedings and the decision of the other two members shall have the effect of\nthe decision of the Commission:\nProvided that, in the event of a difference of opinion between the two members attending the\nproceedings of the commission,—\n(a) if the Commissioner is one of the two members, his opinion shall prevail and the decision\nof the Commission shall be expressed in terms of that opinion; and\n(b) in the other case, the matter shall be placed for a deci sion before the Commission."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to punish for contempt. The Commission, the Commissioner and the members of the",
      "content": "Commission shall have the same powers to punish its or their contempt as are vested in a High Court\nunder Article 204."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Delegation of powers, etc. The Commission may authorise its Chairman or any of its members",
      "content": "or any of the officers of the Commission to exercise and perform all or any of its powers and\nfunctions under this Act."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Assistance to the Commission",
      "content": "(1) All executive authorities in the Federation and in the\nProvinces shall render such assistance to the Commissioner and the Commission in the discharge of\nhis or their functions as may be required of them by the Commissioner or the Commission.\n(2) The Commissioner or the Commission may require any person or authority to perform such\nfunctions or render such assistance for the purpose of this Act as he or it may direct.\n_______"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Election to reserved seats",
      "content": "(1) The members for seats reserved for women in an Assembly\nshall be elected, subject to the provisions of clause (5) of Article 51 or, as the case may be, clauses\n(4) and (5) of Article 106, by the persons elected to the general seats in that Assembly so that there is\none member for each of the constituencies for seats reserved for women in that Assembly.\n(2) The members for seats reserved in an Assembly for persons belonging to the Christian, Hindu.\nSikh, Buddhist and Parsi Communities and persons of the Quadiani group or the Lahori group (who\ncall themselves ‘Ahmadis’) and other non­Muslims and persons belonging to the scheduled castes\nshall be elected, subject to the provisions of clause (4A) of Article 51 or, as the case may be, clause\n(5) of Article 106, by the persons elected to the general seats in that Assembly.\n(3) The Commission shall hold and conduct the election to fill the seats reserved in an Assembly\nfor the persons referred to in clause (3) of Article 106 or for women in such manner as it may think fit\n_______"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Definition. In this Chapter, \"election expenses\" means any expenditure incurred before,",
      "content": "during and after an election or payment made, whether by way of gift, loan, advance, deposit or\notherwise, for the arrangement, conduct or benefit of or in connection with, or incidental to, the\nelection of a candidate, including the expenditure on account of issuing circulars or publications or\notherwise presenting to the electors the candidate or his views, aims or objects."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Restriction on election expenses",
      "content": "(1) No person shall, except as provided in sub­section (2),\nmake any payment whatsoever towards the election expenses of a candidate except to such\ncandidate.\n(2) No person other than the candidate shall incur any election expenses of such candidate:\nProvided that any person may, if so authorised by a candidate in writing specifying a maximum\namount, to the extent of such amount, make payment for stationery, postage, telegram and other petty\nexpenses.\n(3) The election expenses of a candidate shall not exceed,—\n(a) in the case of an election to a seat in the National Assembly, thirty­five thousand rupees;\n(b) in the case of an election to a seat in a Provincial Assembly, twenty­five thousand rupees.\n(4) Any person incurring any expenditure or making any payment under sub­section (2) shall,\nwithin fourteen days of the declaration of the result of the election, send to the candidate a statement\nof such expenditure or the particulars of such payment.\n(5) A candidate shall, by a bill stating the particulars and by a receipt, vouch for every payment\nmade in respect of election expenses, except where the amount is less than twenty­five rupees."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Return of election expenses",
      "content": "(1) Every candidate shall, within forty­five days after the\npublication of the name of the returned candidate, submit to the returning Officer a return of election\nexpenses in the prescribed form containing ;\n(a) a statement of all payments made by the candidate together with all the bill and receipts;\n(b) a statement of all disputed claims of which the candidate is aware;\n(c) a statement of all unpaid claims, if any, of which the candidate is aware; and\n(d) a statement of all moneys, securities or equivalent of money received from any person for\nthe purpose of election expenses specifying the name of every such person.\n(2) The return submitted under sub­section (1) shall be accompanied by an affidavit in the\nprescribed form sworn by the contesting candidate."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Inspection of returns, etc",
      "content": "(1) The return and documents submitted under section 10 shall\nbe kept by the Commissioner in his office or at such other convenient place as he may think fit and\nshall, during one year from the date of their receipt by him, be open to inspection by any person on\npayment of the prescribed fee.\n(2) The Commissioner shall, on an application made in this behalf and payment of the prescribed\nfee, give any person copies of any return or document kept under sub­section (1) or of any part\nthereof.\n_______"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Election Petition",
      "content": "(1) No election shall be called in question except by an election petition\nmade by a candidate for that election (hereinafter in this Chapter referred to as the petitioner).\n(2) An election petition shall be presented to the Commissioner within forty­five days of the\npublication in the official Gazette of the name of the returned candidate and shall be accompanied by\na receipt showing that the petitioner has deposited at any branch of the National Bank of Pakistan or\nat a Government Treasury or sub­Treasury in favour of the Commissioner, under the prescribed head\nof account, as security for the costs of petition, a sum of one thousand rupees."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Presentation of petition",
      "content": "(1) An election petition shall be presented by a petitioner and\nshall be deemed to have been presented—\n(a) when it is delivered in person to the Secretary to the Commission or to such other officer\nas may be appointed by the Commission in that behalf,—\n(i) by the petitioner; or\n(ii) by a person authorised in writing in this behalf by the petitioner ; or\n(b) when delivered by registered post to the Secretary to the Commission or to such other\nofficer as aforesaid.\n(2) An electron petition, if sent by registered post, shall be deemed to have been presented in time\nif it is posted within the period specified in sub­section (2) of section 12."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Parties to the petition. The petitioner shall join all the candidates as respondents to his",
      "content": "election petition and shall serve personally or by registered post on each such respondent a copy of\nhis petition."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Contents of petition",
      "content": "(1) Every election petition shall contain—\n(a) a precise statement of the material facts on which the petitioner relies;\n(b) full particulars of any corrupt or illegal practice or other illegal act alleged to have been\ncommitted, including as full a statement as possible of the names of\nand place of the commission of such practice or act; and ‘\n(c) the relief claimed by the petitioner.\n(2) A petitioner may claim as relief any of the following declarations, namely:—\n(a) that the election of the returned candidates is void;\n(b) that the election of the returned candidate is void and that the petitioner or some other\nperson has been duly elected; or\n(c) that the election as a whole is void.\n(3) Every election petition and every schedule or annex to that petition shall be signed by the\npetitioner and verified in the manner laid down in the Code of Civil Procedure, 1908 (Act V of 1908),\nfor the verification of pleadings."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Procedure on receipt of petition by the Commissioner",
      "content": "(1) If the Commissioner finds that\nany provision of section 12, section 13 or section 14 has not been compiled with, the petition shall be\ndismissed forthwith.\n(2) If an election petition is not dismissed under sub­section (1), the Commissioner shall refer it\nfor trial to a Tribunal."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Appointment of Tribunal",
      "content": "(1) For the trial of election petitions under this Act, the\nCommissioner shall appoint as many Election Tribunals as may be necessary.\n(2) An Election Tribunal shall consist of a person who is or has been a judge of the Supreme\nCourt or High Court."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Power to transfer petition. The Commissioner, either of his own motion or on an application",
      "content": "made in this behalf by any of the parties, may, at any stage, transfer an election petition from one\nTribunal to another Tribunal and the Tribunal to which the election petition is so transferred—\n(a) shall proceed with the trial of the petition from the stage from which it is transferred; and\n(b) may, if it thinks fit, recall and examine any of the witnesses already examined."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Attorney­General, etc., to assist the Tribunal. In the case of an election petition relating to",
      "content": "an election to the National Assembly, the Attorney­General for Pakistan, and in the case of such\npetition relating to an election to a Provincial Assembly, the Advocate­General for the Province, shall\nrender to the Tribunal such assistance at the hearing of the petition as it may require."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Appearance before Tribunal. Any appearance, application or act before a Tribunal may be",
      "content": "made or done by a party in person or by an advocate or any other person entitled or allowed to plead\nin any civil court and duly appointed to act on his behalf:\nProvided that the Tribunal may, where it considers it necessary, direct any party to appear in\nperson."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Procedure before Tribunal",
      "content": "(1) Subject to the provisions of this Act and the rules, every\nelection petition shall be tried, as nearly as may be, in accordance with the procedure for the trial of\nsuits under the Code of Civil Procedure, 1908 (Act V of 1908):\nProvided that the Tribunal may—\n(a) make a memorandum of the substance of the evidence of each witness as his examination\nproceeds unless it considers that there is special reason for taking down the evidence of\nany witness in full; and\n(b) refuse to examine a witness if it considers that his evidence is not material or that he has\nbeen called on a frivolous ground for the purpose of delaying the proceedings.\n(2) Subject to the provisions of this Act the Evidence Act, 1872 (Act I of 1872) shall apply for the\ntrial of an election petition.\n(3) The Tribunal may, at any time, upon such terms and on payment of such fee as it may direct,\nallow a petition to be amended in such manner as may, in its opinion, be necessary for ensuring a fair\nand effective trial and for determining the real questions at issue, so, however, that no new ground of\nchallenge to the election is permitted to be raised.\n(4) At any time during the trial of an election petition, the Tribunal may call upon the petitioner to\ndeposit such further sum by way of security, in addition to the sum deposited under section 12, as it\nmay think fit."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Dismissal of petition during trial. The Tribunal shall dismiss an election petition, if",
      "content": "(a) the provisions of section 14 or section 15 have not been complied with; or\n(b) if the petitioner fails to make the further deposit required under sub­section (4) of section"
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Further provision relating to evidence and witnesses",
      "content": "(1) Notwithstanding anything to\nthe contrary contained in any other law for the time being in force, no document shall be inadmissible\nin evidence at the trial of an election petition only on the ground that it is not duly stamped or\nregistered.\n(2) No witness shall be excused from answering any question as to any matter in issue, or relevant\nto a matter in issue, in the trial of an election petition upon the ground that the answer to such\nquestion may incriminate or tend to incriminate him or that it may expose or tend to expose him to\nany penalty or forfeiture; but no witness shall be required or permitted to state for whom he has voted\nat an election.\n(3) A witness who answers truly all questions which he is required to answer shall be entitled to\nreceive a certificate of indemnity from the Tribunal and an answer given by him to a question put by\nor before the Tribunal shall not, except in the case of any criminal proceeding for perjury in respect\nof his evidence, be admissible in evidence against him in any civil or criminal proceedings.\n(4) A certificate of indemnity granted to any witness under sub­section (3) may be pleaded by\nhim in any court and shall be a full and complete defence to or upon any charge under Chapter IXA\nof the Pakistan Penal Code (Act XLV of 1860) or under this Act arising out of the matter to which\nsuch certificate relates, but it shall not be deemed to relieve him from any disqualification in\nconnection with an election imposed by any law for the time being in force.\n(5) The reasonable expenses incurred by any person in attending to give evidence may be allowed\nto him by the Tribunal and shall, unless the Tribunal otherwise directs, be deemed to be part of the\ncosts."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Recrimination where seat is claimed",
      "content": "(1) Where in an election petition a declaration is\nclaimed that a candidate other than the returned candidate has been duly elected, the returned\ncandidate or any other party may produce evidence to prove that the election of such other candidate\nwould have been declared void had he been the returned candidate and had a petition been presented\ncalling his election in question:\nProvided that the returned candidate or such other party as aforesaid shall not be entitled to give\nsuch evidence unless he or it has, within the fourteen days next following the commencement of the\ntrial, given notice to the Tribunal of his intention so to do and has also deposited the security referred\nto in section 12.\n(2) Every notice referred to in sub­section (1) shall be accompanied by a statement of the case,\nand all the provisions relating to the contents, verification, trial and procedure of an election petition,\nor to the security deposit in respect of an election petition, shall apply to such a statement as if it were\nan election petition."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Decision of the Tribunal",
      "content": "(1) The Tribunal may, upon the conclusion of the trial of an\nelection petition, make an order—\n(a) dismissing the petition;\n(b) declaring the election of the returned candidate to be void;\n(c) declaring the election of the returned candidate to be void and the petitioner or any other\ncandidate to have been duly elected; or\n(d) declaring the election as a whole to be void.\n(2) The decision of a Tribunal on an election petition shall be final."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Ground for declaring election of returned candidate void",
      "content": "(1) The Tribunal shall declare\nthe election of the returned candidate to be void if it is satisfied that—\n(a) the returned candidate was not qualified for, or was disqualified from, being elected as a\nmember; or\n(b) the election of the returned candidate has been procured or induced by any corrupt or\nillegal practice; or\n(c) a corrupt or illegal practice has been committed by the returned candidate or by any other\nperson with the connivance of the candidate.\n(2) The election of a returned candidate shall not be declared void on the ground—\n(a) that any corrupt or illegal practice has been committed, if the Tribunal is satisfied that it\nwas not committed by, or with the consent or connivance of, that candidate and that the\ncandidate took all reasonable precaution to prevent its commission; or\n(b) that any of the other candidates was not qualified for, or was disqualified from, being\nelected as a member."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Ground for declaring a person other than a returned candidate elected. The Tribunal",
      "content": "shall declare the election of the returned candidate to be void and the petitioner or any other\ncandidate to have been duly elected, if it is so claimed by the petitioner or any of the respondents and\nthe Tribunal is satisfied that the petitioner or such other candidate was entitled to be declared elected."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Ground for declaring election as a whole void. The Tribunal shall declare the election as a",
      "content": "whole to be void if it is satisfied that the result of the election has been materially affected by reason\nof—\n(a) the failure of any person to comply with the provisions of this Act or the rules; or\n(b) the prevalence of extensive corrupt or illegal practice al the election."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Decision in case of equality of votes",
      "content": "(1) Where after the conclusion of the trial, it\nappears that there is an equality of votes between two or more candidates and the addition of one\nvote for one candidate would entitle him to be declared elected, the Tribunal shall so inform the\nCommissioner who shall then direct a fresh poll to be taken in respect of the said candidates and fix a\ndate for such poll.\n(2) All the provisions of this Act relating to preservation and inspection of documents shall apply\nto the fresh poll as at an election held under the provisions of this Act."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Other provisions relating to Tribunal",
      "content": "(1) An order of the Tribunal under section 27 shall\ntake effect on the date on which it is made and shall be communicated to the Commissioner who shall\npublish it in the official Gazette.\n(2) The Tribunal shall after an election petition has been disposed of, forward the record thereof\nto the Commissioner who shall retain it for a period of five years from the date of its receipt and shall\nthereafter cause it to be destroyed."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Withdrawal of petition",
      "content": "(1) An election petition may be withdrawn—\n(a) before the Tribunal has been appointed, by leave of the Commissioner; and\n(b) after a Tribunal has been appointed, by leave of the Tribunal.\n(2) Where leave is granted by the Tribunal, the petitioner shall be ordered to pay the costs\nincurred by the respondents to the election petition or such portion thereof as the Tribunal may direct."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Abatement on death of petitioner",
      "content": "(1) An election petition shall abate on the death of a\nsole survivor of several petitioners.\n(2) Where a petition abates under sub­section (1) after a Tribunal has been appointed, notice of\nthe abatement shall be given by the Tribunal to the Commissioner."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Death or withdrawal of respondent. If, before the conclusion of the trial of an election",
      "content": "petition, a respondent dies or gives notice in the prescribed form that he does not intend to contest the\npetition, and no respondent remains to contest the petition, the Tribunal shall, without any further\nhearing, or after giving such person as it may think fit an opportunity of being heard, decide the case\nex­parte."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Failure of petitioner to appear. Where, at any stage of the trial of an election petition, no",
      "content": "petitioner makes an appearance, the Tribunal may dismiss the petition for default, and make such\norder as to costs as it may think fit."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Order as to costs",
      "content": "(1) The Tribunal shall, when making an order under section 27, also\nmake an order determining in its discretion the costs and specifying the person by and to whom such\ncosts are to be paid.\n(2) If, in any order as to costs under sub­section (1) there is a direction for the payment of costs\nby any party to any person, such costs shall, if they have not already been paid, be payable in full and\nshall, upon application in writing in that behalf made to the Tribunal within six months of the order by\nthe person to whom costs have been awarded, be paid, as far as possible, out of the security for costs\ndeposited by such party.\n(3) Where no costs have been awarded against a party who has deposited security for costs, or\nwhere no application for payment of costs has been made within the aforesaid six months, or where a\nresidue remains after costs have been paid out of the security, such security or the residue thereof, as\nthe case may be, shall upon application in writing therefor by the person who made the deposit or by\nhis legal representative, be returned by the Tribunal to the person making the application.\n(4) Any order for costs may be enforced upon application in writing made to the principal civil\ncourt of original jurisdiction of the district in which the person from whom the costs are to be\nrecovered resides or owns property, as if such order were a decree passed by that court:\nProvided that no proceeding shall be brought under this sub­section except in respect of costs\nwhich have not been recovered by an application under sub­section (2).\n_______\nOFFENCES, PENALTY AND PROCEDURE"
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Corrupt practice. A person is guilty of corrupt practice if he",
      "content": "(1) contravenes the provisions of section 9;\n(2) is guilty of bribery, personation or undue influence;\n(3) makes or publishes a false statement concerning the personal character of a candidate or any\nof his relations calculated to adversely affect the election of such candidate or for the purpose of\npromoting or procuring the election of another candidate, unless he proves that he had reasonable\ngrounds for believing, and did believe, the statement to be true; or\n(4) calls upon or persuades any person to vote, or to refrain from voting, for any candidate on the\nground that he belongs to a particular religion, community, race, cast, bradari, sect or tribe."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Bribery. A person is guilty of bribery, if he, directly or indirectly, by himself or by any other",
      "content": "person on his behalf,—\n(1) receives or agrees to receive or contracts for any gratification for voting or refraining from\nvoting, or for being or refraining from being a candidate, at an election; or\n(2) gives, offers or promises any gratification to any person—\n(a) for the purpose of inducing—\n(i) a person to be, or to refrain from being, a candidate at an election ; or\n(ii) an elector to vote, or refrain from voting, as an election; or\n(b) for the purpose of rewarding a person for having been or for having refrained from being,\na candidate at an election.\nExplanation.— In this section, \"gratification\" includes a gratification in money estimable in\nmoney and all forms of entertainment or employment."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Undue influence. A person is guilty of undue influence, if he",
      "content": "(1) in order to induce or compel any person to vote or refrain from voting, or to offer himself as a\ncandidate, at an election, directly or indirectly, by himself or by any other person on his behalf,—\n(a) makes or threatens to make use of any force, violence or restraint;\n(b) inflicts or threatens to inflict any injury, damage, harm or loss;\n(c) calls down or threatens to call down divine displeasure or the displeasure of any saint or\npir;\n(d) gives or threatens to give any religious sentence; or\n(e) use any official influence or governmental patronage; or\n(2) on account of any person having voted or refrain from voting, or having offered himself as a\ncandidate, does any of the acts specified in clause (1); or\n(3) by abduction, duress or any fraudulent device or contrivance,—\n(a) impedes or prevents the free exercise of the fran chise by an elector; or\n(b) compels, induces or prevails upon any elector to vote or refrain from voting.\nExplanation.—In this section, \"harm\" includes social ostracism or ex­communication or\nexpulsion from any caste or community."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Penalty for corrupt practice. Any person guilty of corrupt practice shall be punishable with",
      "content": "imprisonment for a term which may extend to two years, or with fine which may extend to five\nthousand rupees, or with both."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Illegal practice",
      "content": "(1) A person is guilty of illegal practice if he—\n(a) fails to comply with the provisions of section 10;\n(b) obtains or procures, or attempts to obtain or procure, the assistance of any person in the\nservice of Pakistan to further or hinder the election of a candidate; or\n(c) knowingly induces or procures any person to do any of the aforesaid acts.\n(2) Any person guilty of illegal practice shall be punishable with fine which may extend to two\nthousand rupees."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Assistance by Government servant. A person in the service of Pakistan is guilty of an",
      "content": "offence punishable with imprisonment for a term which may extend to two years, or with fine which\nmay extend to two thousand rupees, or with both, if he misuses his official position in a manner\ncalculated to influence the result of the election."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Certain offences cognizable. Notwithstanding anything contained in the Code of Criminal",
      "content": "Procedure, 1898 (Act V of 1898), an offence punishable under section 41 shall be cognizable offence."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Court proceedings relating to election expenses. The Commission shall direct an officer",
      "content": "subordinate to it to launch proceedings in the appropriate court against persons who contravene the\nprovisions of section 9 or fail to comply with the provisions of section 10."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Court to report convictions to the Commission. A court convicting any person for an",
      "content": "offence punishable under this Chapter, other than corrupt practice, shall send a report to the\nCommission of such conviction together with its recommendations, if any, considering the special\ncircumstances of any case, for the mitigation or remission of any disqualification incurred by such\nperson under this Act."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Punishment under this Chapter not in derogation of any other Liability. Any punishment",
      "content": "imposed on any person for an offence punishable under this chapter shall be in\naddition to, and not in derogation of, any liability incurred by such person under any other\nprovision of this Act.\n_______"
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Disqualifications. A person shall be disqualified from being elected as, and",
      "content": "from being, a member of an Assembly, if:—\n(a) he has been, on conviction for any offence, sentenced to imprisonment for a term of not\nless than two years, unless a period of five years has elapsed since his release; or\n(b) he has been dismissed or removed or compulsorily retired from the service of Pakistan,\nunless a period of five years has elapsed since his dismissal or removal or compulsory\nretirement; or\n(c) he, whether by himself or by any person in trust for him or for his benefit or on his\naccount or as a member of a Hindu undivided family, has any share or interest in a\ncontract, not being a contract between a cooperative society and Government, for the\nsupply of goods to, or for the execution of any work or the performance of any service\nundertaken by Government :\nProvided that the disqualification under this clause shall not apply to a person—\n(i) where the share or interest in the contract devolves on him by inheritance or succession or\nas a legatee executor or administrator, until the expiration of six months after it has so\ndevolved on him; or\n(ii) where the contract has been entered into by or on behalf of a public company as defined\nin the Companies Act, 1913 (VII of 1913), of which he is a shareholder but is neither a\ndirector nor a person holding an office of profit under the company nor a managing agent;\nor\n(iii) where the contract entered into by him in the course of his trade or business with the\nGovernment for the supply of goods to, or for the execution for any work or the\nperformance of any service undertaken, by that Government, does not subsist;\nExplanation.—A contract shall not be deemed to subsist by reason only of the fact that the\nperson was enrolled as a contractor with the Government or that the government has not performed\nits part of the contract, either wholly or in part.\niii­ where he is a member of a Hindu undivided family and the contract has been entered into\nby any other member of that family in the course of carrying on a separate business in\nwhich he has no share or interest;\n(d) he is a managing agent, manager or secretary of, or holds any other office carrying the\nright to remuneration in any company or corporation (other than a cooperative society) in\nthe capital of which the Government has not less than\ntwenty­five per cent share or which is managed by the Government; or\n(e) he is found guilty of a corrupt or illegal practice under any other law for the time being in\nforce, unless a period of five years has elapsed from the date on which that order takes\neffect; or\n(f) he holds any office of profit in the service of Pakistan other than the following offices,\nnamely:—\n(i) an office which is not a whole time office remunerated either by salary or by fee;\n(ii) the office of Lambardar, whether called by this or any other title;\n(iii) the Qaumi Razakars;\n(iv) any office the holder whereof, by virtue of holding such office, is liable to be called\nup for military training or military service under any law providing for the\nconstitution or raising of a force.\nExplanation.—For the avoidance of doubt, it is hereby declared that a judge of Supreme Court or\na High Court the Auditor­General and an Advocate­General are persons holding an office of profit in\nthe service of Pakistan."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Disqualification on account of certain offences. Where a person has been convicted for",
      "content": "having exceeded the limit of election expenses laid down by section 9 or having failed to file the\nreturn of election expenses in accordance with section 10 or for any other offence under this Act or\nhas been found guilty of any corrupt or illegal practice by a Tribunal, he shall, if the Commissioner\nmakes an order to that effect, be disqualified, for such period not exceeding five years as may be\nspecified in the order, from being, or being elected as, a member of an Assembly."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Removal and remission of disqualification. The Commissioner may, on an application made",
      "content": "in this behalf, remit any disqualification for failure to submit the return of election expenses or for\nany error or incorrect statement in such return, if he is satisfied that such failure or error occurred or\nincorrect statement was made due to circumstances beyond the control of the applicant.\n________"
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Commission to ensure fair election, etc. Save as otherwise provided, the Commission may",
      "content": "issue such instructions and exercise such powers, and make such consequential orders, as may, in its\nopinion, be necessary for ensuring that an election is conducted honestly, justly and fairly, and in\naccordance with the provisions of this Act and the rules."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Directions of Commission in certain matters. Anything required to be done for carrying out",
      "content": "authority and in such manner as the Commission may direct."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Jurisdiction of courts barred. No court shall question the legality of any action taken in",
      "content": "good faith by or under the authority of the Commission or the Commissioner, or any decision given\nby the Commission or the Commissioner."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Protection of action taken in good faith. No suit, prosecution or other legal proceeding shall",
      "content": "lie against the Commission, the Commissioner or any officer or other person in respect of anything\nwhich is in good faith done or intended to be done under or in pursuance of this Act or of any rule or\norder made or any direction given thereunder."
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Power to make rules. The Commissioner may, with the approval of the President, make rules",
      "content": "for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. Commission to be construed as Commissioner in certain cases. For the purpose of holding",
      "content": "an election to fill a casual vacancy in an Assembly, reference in this Act to the Commission shall be\nconstrued as referred to the Commissioner."
    }
  ],
  "definitions": [
    {
      "term": "Article",
      "definition": "Article of the Constitution;",
      "source_provision": "sec2"
    },
    {
      "term": "Assembly",
      "definition": "the National Assembly or a Provincial Assembly for a Province;",
      "source_provision": "sec2"
    },
    {
      "term": "candidate",
      "definition": "a person seeking election as a member;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the Election Commission constituted under Article 218; 1 For Statement of Objects and Reasons, see Gaz. of P ., 1976, Ext., Pt. III, p. 325. This Act has been r epealed in its application to the election to which the Repr esentation of the People Act, 1976 (85 of 1976) applies, see Act No. 85 of 1976, s. 109.",
      "source_provision": "sec2"
    },
    {
      "term": "Commissioner",
      "definition": "the Chief Election Commissioner appointed under the Constitution and includes— (i) the person continuing in the office of Chief Election Commissioner by virtue of Article 275; and (ii) a judge of the Supreme Court nominated under Article 217 to act as Chief Election Commissioner ;",
      "source_provision": "sec2"
    },
    {
      "term": "constituency",
      "definition": "a constituency delimited under the Delimitation of Constituencies Act, 1974 (XXXIV of 1974), provided that in respect of a bye­election to a seat reserved for women, in the National Assembly or a Provincial Assembly, to be held at any time before the expiry of the term of the first National Assembly, it shall mean a constituency delimited under the Delimitation of Constituencies Order, 1970;",
      "source_provision": "sec2"
    },
    {
      "term": "election",
      "definition": "election to a seat of a member held under this Act; (viii) “election petition” means an election petition made under section 12;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "member of an Assembly;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "returned candidate",
      "definition": "a candidate who has been declared elected as a member under this Act; (xiii) \"Tribunal\" means an Election Tribunal appointed under section 17 for the trial of election petitions.",
      "source_provision": "sec2"
    }
  ]
}
