{
  "id": "pk-national-anti-money-laundering-and-counter-financing-of-terrorism-authority-act-",
  "type": "statute",
  "title": "National Anti-Money Laundering and Counter Financing of Terrorism Authority Act, 2023",
  "title_en": "National Anti-Money Laundering and Counter Financing of Terrorism Authority Act, 2023",
  "short_name": "NALAC",
  "status": "in_force",
  "issued_date": "2023-08-06",
  "in_force_date": "2023-08-06",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pnZw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Anti-Money Laundering and Counter Financing of Terrorism Authority Act, 2023 (LIII of 2023) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act shall be called the National Anti-\nMoney Laundering and Counter Financing of Terrorism Authority Act, 2023.\n(2) It shall extend to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(a)    “Authority” means the National Anti-Money Laundering and Counter\nFinancing of Terrorism Authority of Pakistan established under Section 3;\n(b)    “Competent authorities” means the term as defined in the Anti-Money\nLaundering Act, 2010; the National Counter Terrorism Authority, Provincial\nHome Departments, Federal Board of Revenue, Ministry of Interior, Ministry\nof Foreign Affairs and such other authorities, departments, organizations or\nagencies as may be notified by the Federal Government from time to time;\n(c)    “Director General” means the Director General of the Authority appointed\npursuant to Section 9;\n(d)    “Division concerned” means the Cabinet Division;\n(e)     “Rules” means rules made under the Act;\n(f)     “Regulations” means regulations made under this Act; and\n(g)     “Prescribed” means prescribed by rules or regulations."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Authority",
      "content": "(1) The National Anti-Money Laundering and Counter\nFinancing of Terrorism Authority Pakistan is hereby established for carrying out the purposes of this\nAct.\n(2) The Authority shall be a body corporate having perpetual succession and a common seal\nwith powers, subject to the provision of this Act, to acquire and hold property, movable and\nimmovable, and to sue and be sued by its name. The Authority shall have administrative and financial\npowers to carry out its functions.\n(3) The headquarters of the Authority shall be at Islamabad and it may set up offices at such\nother places in Pakistan as may be deemed appropriate."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Composition of the Authority",
      "content": "(1) The Authority shall be comprised of the following:\n(a)     Chairman — To appointed by the Prime Minister\n(b)     Secretary, Finance Division of the Ministry of Finance— Member\n(c)     Secretary, Foreign Affairs Division of the Ministry of Foreign Affairs—\nMember\n(d)     Secretary, Interior Division of the Ministry of Interior — Member\n(e)     Governor, State Bank of Pakistan — Member\n(f)     Chairman, Securities and Exchange Commission of Pakistan—\nMember\n(g)     Chairman, National Accountability Bureau — Member\n(h)     Director General, Federal Investigation Agency — Member\n(i)     Director General, Anti Narcotics Force — Member\n(j)     Chairman, Federal Board of Revenue — Member\n(k)     Director General, Financial Monitoring Unit — Member\n(l)     National Coordinator, National Counter Terrorism Authority—\nMember\n(m)     The Director General of the Authority — Member/Secretary\n(n)     Chief Secretary for his nominee not below BPS-21 of each province including\nAzad Jammu and Kashmir and Gilgit Baitistan— Member\n(o)   Any other member as recommended by the Prime Minister.\n(2) The Authority may, from time to time, invite such persons, as it may deem appropriate,\nfor the purposes of this Act."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Procedures of Authority",
      "content": "(1) The Authority may meet any time on requisition of the\nChairman or at requisition of at least fifty percent of the members. Provided however, the Authority\nshall meet at least twice a year.\n(2) The quorum of the Authority’s meeting shall be fifty percent of the total membership.\n(3) A meeting of the Authority shall be presided over by the Chairman. In the absence of the\nChairman, a member nominated by the Chairman shall preside over the meeting. A meeting of the\nAuthority may also be convened virtually.\n(4) The Director General shall, at least five days prior to the meeting, circulate to all the\nmembers working papers of each agenda item to be discussed in the meeting alongwith proposed\nactions on which decisions of the Authority is required. All decisions in the meeting shall be made\nwith majority of the present members. The Chairman or the member presiding the meeting, as the\ncase may be, shall not have second vote.\n(5) The Director General shall have the minutes of each meeting prepared and seek\nendorsement of all members of the Authority through circulation.\n(6) The Director General shall maintain record of each meeting of the Authority, which shall\nbe available to any member of the Authority as and when so requested."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Powers and Functions of the Authority",
      "content": "(1) The Authority shall act as overarching body\nfor implementation by the relevant competent authorities under the relevant laws with respect to anti-\nmoney laundering, countering of financing of terrorism and targeted financial sanctions;\n(2) Without prejudice and generality of the foregoing, the Authority shall have following\npowers and functions:—\n(a)    to act as focal point for the Financial Action Task Force and related international\norganizations, bodies and to carry out liaison with the competent authorities\nand other national, international organizations, bodies and or entities for\nfacilitating cooperation in areas relating to anti-money laundering, countering\nof financing of terrorism and targeted financial sanctions;\n(b)    to coordinate and oversee the implementation of a national strategy to fight\nmoney laundering, countering financing of terrorism and targeted financial\nsanctions and approve national action plan(s) for implementation of such\nnational strategy(s);\n(c)    to review, from time to time, national policies, laws and regulations\nrelating to anti-money laundering, countering financing of terrorism and\ntargeted financial sanctions and propose amendments to the Federal\nGovernment;\n(d)    to coordinate at policy level and provide policy advice to the federal/\nprovincial/local competent authorities and the Provincial Governments on\nimplementation of anti-money laundering, countering financing of terrorism and\ntargeted financial sanctions regime to maintain uniformity at national level;\n(e)    to formulate rules and regulations, and conditions of the employees of the\nAuthority and grant additional allowances, rewards or any other incentives in\nconsultation with the Finance Division after the approval of the Federal\nGovernment;\n(f)    to enter into any agreement, memorandum of understanding or protocols with\ncounterpart national or international organizations in relation to cooperation in\nanti-money laundering and countering financing of terrorism and targeted\nfinancial sanctions; provided however, that this function shall not be\nconstrued to override powers of any competent authority to enter into such\narrangements under their respective laws; and\n(g)    to discuss and deliberate on any other issue of national importance relating to\nmoney laundering, financing of terrorism and targeted financial sanctions.\n(3) Except stipulated in paragraph (g) of sub-Section (2) of this Section, the Authority\nmay delegate any of its powers and functions to the Chairman of the Authority with such terms\nand conditions as it may deem appropriate."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Chairman of the Authority",
      "content": "(1) There shall be a Chairman of the Authority to be\nappointed by the Prime Minister for term of three years on such terms and conditions as may be\nprescribed. The Chairman shall be eligible fur reappointment for another term.\n(2) The Chairman shall not be removed from the office prior to the expiry of the term unless\nhe is guilty of gross misconduct; or is incapable of properly performing the duties of his office by\nreason of physical or mental incapacity:\nProvided that no proceedings under this sub-section shall be initiated unless a show cause\nnotice, including an opportunity of being heard, is given to such person.\n(3) The Chairman may tender his resignation under his own hand to the Prime Minister.\n(4) In the absence of the Chairman, the Director General shall act as acting Chairman and\nperform all functions and powers of the Chairman under this Act."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Functions and Powers of the Chairman",
      "content": "(1) The Chairman shall exercise general\ncontrol and supervision over the affairs of the Authority; shall be the Principal Accounting Officer of\nthe Authority and; shall ensure that the provisions of the Act, the rules, regulations, policies and\ndirections of the Authority are properly executed.\n(2) Without prejudice to the generality of the foregoing, the Chairman shall have the following\npowers, namely:—\n(a)    to ensure implementation by th relevant competent authorities of the laws\nwith respect to anti-money laundering, countering financing of terrorism\nand targeted financial sanctions;\n(b)     to develop national action plans with respect to anti-money laundering,\ncountering financing of terrorism and targeted financial sanctions in\ncoordination and consultation with the relevant authorities; analyse the data\nreceived from the competent authorities and report to the Authority about\nimplementation of these plans, on periodical basis;\n(c)     to propose guidelines with the approval of the authority to the competent\nauthorities in line with the international best practices and requirements of\nFinancial Action Task Force for developing and implementing the risk based\nsupervisory plans or framework whatsoever called; annual training and\noutreach plans and monitoring of implementation of the aforesaid guidelines or\ndirections by the competent authorities; and make recommendations to the Federal\nGovernment for effective implementation of anti-money laundering, countering\nof financing of terrorism and targeted financial sanctions action plans;\n(d)     to authorize expenditure provided for in the budget in accordance with the\nrules and regulations;\n(e)     to re-appropriate funds within the approved budget;\n(f)     to execute deeds and documents on behalf of the Authority;\n(g)     to appoint experts from public or private sector for deliberations in areas related\nto the mandate and functions of the Authority;\n(h)    to issue guidelines and resolve issues of overlapping of functions inter se\ncompetent authorities; and\n(i)     to execute the policies and plans approved by the Authority and instructions\nissued by the Federal Government.\n(3) The Chairman may delegate any of its functions and powers to the Director General with\nsuch terms and conditions as it may deem appropriate."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Director General of the Authority",
      "content": "(1) There shall be a Director General of the Authority\nappointed by the Prime Minister upon recommendation of the Authority. The Director General shall\nbe appointed for a term of three years. A Director General shall be eligible for reappointment\nprovided that his age shall not exceed sixty-five years at the time of appointment or re-appointment,\nas the case may be and, in case he achieves the age of sixty-five during the term, he shall be deemed\nretired.\n(2) A Director General shall have following qualifications to become eligible for appointment\nof Director General:\n(a)     he shall be a professional of known integrity, competence and shall be a retired\ncivil servant (BS-21 or above) or serving civil servant (BS-21 or equivalent) or\nan officer of the Authority having the at least five (5) years’ experience;\n(b)     he shall have minimum twenty-five (25) years post qualification experience\nin the administration, law enforcement, finance, taxation and legal matters\nincluding a minimum ten (10) years experience in senior management position\nin the relevant field; and\n(c)     he should have understanding in anti-money laundering, countering financing\nof terrorism and targeted financial sanctions laws, rules, regulations and\nprocedures.\n(3) The Director General shall assist the Chairman of the Authority in the performance of his\nduties and shall have the following powers and functions, namely:—\n(a)     to coordinate and propose necessary instructions, guidelines to the competent\nauthorities, the Federal and Provincial ministries and departments and local\ngovernment authorities on implementation of anti-money laundering,\ncountering financing of terrorism and targeted financial sanctions regime;\nnational action plans; analyse the data received, identify gaps and report to the\nAuthority about implementation of these plans, on periodical basis;\n(b)     to set up committees, sub-committees, working groups for the purposes of this\nAct and compliance with Pakistan’s commitments and or obligations with\nrespect to the requirements of concerned international organizations whom\nPakistan is in cooperation with;\n(c)     issue necessary directions to the competent authorities for the purposes of this\nAct;\n(d)     seek reports from the competent authorities responsible for compliance of anti-\nMoney laundering, countering of financing of terrorism and targeted financial\nsanctions regimes as it may require;\n(e)     to seek input and coordinate formulation of risk assessments with periodical\nreviews for making adequate and timely efforts to counter money laundering,\nterrorism and targeted financial sanctions;\n(f)     to establish central data base of all relevant data fields related to compliance of\nanti-money laundering, countering financing of terrorism and targeted financial\nsanctions through development of online data management system;\n(g)     to carry out research on topics relevant to money laundering, financing of\nterrorism and targeted financial sanctions and to prepare and circulate\ndocuments, if deemed required;\n(h)     to have financial and administrative powers for effective administration of the\nAuthority, as approved by the Chairman;\n(i)     issue notices of meetings of the Authority and to maintain proper record of the\nminutes and proceedings thereof; and\n(j)     to perform such other functions as may be delegated by the Chairman;\nprovided that in the absence of the Director General, the senior most officer\npresent in the Authority shall act as the Director General.\n(4) The Director General may by special order delegate his powers and functions to any other\nsenior officer of the Authority:\nProvided that the Director General may delegate his powers and functions under this\nprovision sparingly and not as a rule."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Assistance and call for information",
      "content": "(1) The Federal Government’s agencies,\nProvincial Governments’ departments shall assist the Authority in providing information and data as\nmay be required for the purposes of this Act.\n(2) For the purposes of Sub-section (1), the Director General or any officer authorized by\nhim may call for information and data from all Federal Ministries, Provincial Departments and any\ncompetent authority at such intervals and time, as and when required.\n(3) All information and data provided to the Authority under this Act shall be kept confidential\nand shall not be disclosed to any national or international organization other than for the purposes of\nthis Act.\n(4) Upon contravention of any of the provisions of this Act or violation or non-implementation\nof any law pertaining to anti-money laundering, countering financing of terrorism and targeted\nfinancial sanctions by any official of any competent authority, the Authority shall recommend\nappropriate disciplinary action under relevant law against such official."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Appointment of officers, staff etc., by the Authority",
      "content": "(1) The Authority with the\napproval of the Federal Government may from time to time appoint, either through direct recruitment\nor through deputation such cadre or ex-cadre officials, experts or consultants as it may consider\nnecessary for the performance of functions under this Act.\n(2) The Authority with the approval of the Federal Government shall prescribe service\nregulations for the appointment, promotion and transfer of officers, staff, experts and consultants, their\nterms and conditions of service including additional financial incentives such as special salaries,\nallowances, pension or gratuity, constitution and management of pension and gratuity and shall be\ncompetent to take disciplinary action against them.\n(3) The Authority may delegate powers contained in this section to the Chairman and may\nspecify terms and conditions for exercising such powers."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Fund",
      "content": "(1) There shall be established a fund to be known as National Anti-Money\nLaundering and Countering Terrorism Authority Research and Development Fund.\n(2)   The Fund shall consist of,—\n(a)     funds or budget amount received from the Federal Government;\n(b)     grants made by the international bodies, organizations and entities, in\naccordance with procedures laid down by the Federal Government; and\n(c)     such other sums as may be received by the Authority.\n(3) The Fund shall be administered by the Director General in such manner as may be\nprescribed.\n(4) The Authority may receive international assistance in the field of anti-money laundering\nand countering terrorism in the manner as may be prescribed."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Budget for the Authority",
      "content": "The Director General shall, in respect of each financial year\nin accordance with the financial procedures approved by the Authority, prepare the annual budget\nestimates of the Authority and submit the same to the Federal Government after the approval of the\nAuthority."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Maintenance of accounts and internal control",
      "content": "The Authority shall maintain complete\nand accurate books of accounts in connection with the discharge of its responsibilities as may be\nprescribed by the Auditor-General of Pakistan."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Audit",
      "content": "(1) The accounts of the Authority shall be audited every year by the Auditor-\nGeneral of Pakistan in such manner as may be prescribed.\n(2) The Authority shall appoint its own financial advisor to regulate the financial matters and\nfor internal audit."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Annual Report",
      "content": "The Authority shall compile and submit an annual-report on its activities\nand accounts to the Federal Government."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Indemnity",
      "content": "No prosecution, suit or other legal proceedings shall lie against the Authority\nor its officers and consultants for anything done in good faith for carrying out the purposes of this Act\nor rules and regulations made thereunder."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Power of the Federal Government to issue directives",
      "content": "The Federal Government may,\nas and when it considers necessary, issue directives to the Authority on matters of policy and such\ndirectives shall be binding on the Authority and if a question arises whether any matter is a matter of\npolicy or not, the decision of the Federal Government thereon shall be final."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Power to make rules and regulations",
      "content": "(1) The Federal Government may, on the\nrecommendation of the Authority, make rules for carrying out the purposes of this Act.\n(2) The Authority may make regulations for the following purposes, namely:—\n(a)     effective and smooth functioning of the Authority;\n(b)     internal working of the Authority;\n(c)     terms and conditions of the employees and grant of additional allowances,\nrewards or any other incentives,"
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Relationship with other laws",
      "content": "(1) Save as provided in the proviso to sub-section (2)\nof this section and section 24, the provisions of this Act shall be in addition to and not in derogation\nwith any other law for the time being enforce.\n(2) Nothing contained in this Act shall override, limit or extinguish any functions and or\npowers of any authority, agency, department or competent authority in connection with anti-money\nlaundering, countering of financing of terrorism and targeted financial sanctions, whether such\nfunctions and or powers have been conferred upon any authority, agency, department or competent\nauthority under any law or through executive or administrative order of the Federal or Provincial\nGovernment, as the case may be:\nProvided that section 5 of the Anti-Money Laundering Act, 2010 shall continue to be\nimplemented to the extent the same is not inconsistent or overlapping with the provisions of this Act."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Employees deemed to be Public Servants",
      "content": "The employees of the Authority shall be\ndeemed to be Public Servants within the meaning of Section 21 of the Pakistan Penal Code (Act\nXLV 1860)."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Repeals, Savings and Validity of Actions, etc",
      "content": "(1) On the commencement of this Act—\n(a)    the Prime Minister’s Office Order No 3021/M/SPM/2019 dated 2nd August,\n2019 constituting the National Financial Action Task Force Coordination\nCommittee shall stand rescinded; and\n(b)    Notification No. 4-1/2019-Min-I dated 30-12-2019 of the Federal Government\nsetting up the National Financial Action Task Force Cell shall stand rescinded.\n(2) All rights, powers, authorities and privileges, of whatever kind of the National Financial\nAction Task Force Coordination Committee and the National Financial Action Task Force Cell\nsubsisting immediately before their dissolution shall stand transferred to and vest in the Authority\nestablished under this Act.\n(3) Anything done, actions taken, orders passed, instruments made, notifications issued,\nagreements made, proceedings initiated, processes or communication issued, powers conferred,\nassumed or exercised, by the National Financial Action Task Force Coordination Committee and or\ndates of the respective notifications referred to in paragraph (a) and (b) of sub-Section (1) of this\nSection and before commencement of this Act, shall be deemed to have been validly done, made,\nissued, taken, initiated, conferred, assumed, and exercised and provisions of the Act shall have,\nand shall be deemed always to have had, effect accordingly.\n(4) At the time of commencement of this Act, all officers and staff deputed to the National\nFinancial Action Task Force Cell shall continue working under the Authority until the Federal\nGovernment shall make appropriate order with respect to retention, posting or repartriation of such\nofficers and staff.\n(5) Notwithstanding anything contrary contained in any other law for the time being in\nforce, upon commencement of this Act, reference to the Director General FATF Cell appearing\nin any existing law shall be deemed to be the Director General of the Authority under this Act."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Power to interpret",
      "content": "(1) The Federal Government may issue clarification with regards\nto any ambiguity arising out of interpretation of this Act in relation to other relevant laws for the\ntime being in force."
    }
  ],
  "definitions": [
    {
      "term": "Authority",
      "definition": "the National Anti-Money Laundering and Counter Financing of Terrorism Authority of Pakistan established under Section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Competent authorities",
      "definition": "the term as defined in the Anti-Money Laundering Act, 2010; the National Counter Terrorism Authority, Provincial Home Departments, Federal Board of Revenue, Ministry of Interior, Ministry of Foreign Affairs and such other authorities, departments, organizations or agencies as may be notified by the Federal Government from time to time;",
      "source_provision": "sec2"
    },
    {
      "term": "Director General",
      "definition": "the Director General of the Authority appointed pursuant to Section 9;",
      "source_provision": "sec2"
    },
    {
      "term": "Division concerned",
      "definition": "the Cabinet Division;",
      "source_provision": "sec2"
    },
    {
      "term": "Rules",
      "definition": "rules made under the Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Regulations",
      "definition": "regulations made under this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "Prescribed",
      "definition": "prescribed by rules or regulations.",
      "source_provision": "sec2"
    }
  ]
}
