{
  "id": "pk-national-archives-act-1993",
  "type": "statute",
  "title": "National Archives Act, 1993",
  "title_en": "National Archives Act, 1993",
  "short_name": "NAA",
  "status": "in_force",
  "issued_date": "1993-11-30",
  "in_force_date": "1993-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Fra54%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Archives Act, 1993 (VI of 1993) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the National\nArchives Act,1993.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(a)     “Board” means the Advisory Board for National Archives ;\n(b)     “Director General” means the Director General of National Archives ;\n(c)     “National Archives” means the Department of the Government of Pakistan\ndesignated as the National Archives of Pakistan;\n(d)     “public office” means any ministry, division, department, federal\nparliament, commission, board, corporation, agency, local authority, or any\nother office of the Government of the Federation and includes such office\nor corporation or other body as the Federal Government may, by\nnotification in the official Gazette, declare to be a public office ;\n(e)     “public record” means ;\n(i)    papers, documents, records, registers, printed materials, books,\nmaps, plans, drawings, computer records (machine readable\nrecords), photographs, microfilms, cinematograph films, and audio\nand video recordings of any kind whatsoever officially received or\nproduced by any public office for the conduct of its affairs or by any\nofficer or employees, of a public office in the course of his official\nduties, including records relating to Commissions and Committees\nappointed by the Federal Government;\n(ii)   any document, book, pamphlet, brochure, letter, handout, gazette,\nnewspaper, journal, file, manuscript, whether written, printed or\ntyped and other archival material of historical and national\nsignificance to Pakistan acquired for the National Archives by the\nDirector General."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Management of National Archives",
      "content": "(a) The National Archives shall be responsible\nfor the storage and preservation of public records and other archival materials of historical and\nnational significance to Pakistan :\nProvided that such documents as the Federal Government may from time to time specify\ncan be kept at a place other than the National Archives.\n(2) The National Archives shall be managed and controlled by the Director General who\nshall be appointed by the Federal Government and for the purpose of such management and control\nit shall be the duty of the Director General—\n(a)     to ensure the conservation and, where necessary the restoration, of all public\nrecords and other archival material entrusted to his care :\n(b)     to make use of all types of Repregraphic techniques for reproduction of\nthem where necessary ;\n(c)     to describe and arrange all public records and other archival material\nacquired by the National Archives ;\n(d)     to provide facilities for research and reference ;\n(e)     subject to the terms and conditions on which they are acquired, to reproduce\nor publish any public records and other archival material ;\n(f)     to examine any records in the custody of a public office and to advise such\noffice as to the care and custody of such records ;\n(g)     to accept and preserve records which are transferred to the National\nArchives;\n(h)     at the request of any administrative head of a public office, to return to that\noffice for such period as may be agreed upon between the Director General\nand the administrative head concerned, the public records transferred from\nthat office to the National Archives ;\n(i)    to acquire by purchase in accordance with the delegated financial authority,\ndonation, request or otherwise any document, book or other material which\nis, or is likely to be, of enduring national or historical value ; and\n(j)    to perform such other functions as are necessary for the purpose of the said\nmanagement and control and as may be assigned to him by the Federal\nGovernment or the Board."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Advisory Board",
      "content": "(1) there shall be established an Advisory Board consisting of a\nChairman, the Director General and not more than fifteen other members, of whom two shall be\nmembers of Parliament, as may be appointed by the Federal Government.\n(2) The function of the Board shall be :—\n(a)    to lay down the policies and guidelines for the effective management of\nNational Archives ;\n(b)    to review the working of the National Archives ;\n(c)    to evolve the framework for co-ordination among Archival Institutions ;\n(d)    to frame rules for conduct of the official business of the National Archives\n; and\n(e)    any other function assigned to it by the Federal Government."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Transfer of public records to National Archives",
      "content": "Any non-current public records\nwhich are more than five years old including records of defunct agencies, shall be transferred to\nthe National Archives for management and preservation :\nProvided that the Secretary of the Administrative Division in consultation with the Director\nGeneral may withhold the transfer of any such records to the National Archives for such period or\nperiods as may be prescribed."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Public records to be surrendered on demand",
      "content": "Any person in possession of public\nrecords, whether such possession is authorised or unauthorised, shall on the demand of the Director\nGeneral in writing deposit them with the National Archives :\nProvided that any public records exempted under section 5 from being transferred to the\nNational Archives shall not be required to be so deposited :\nProvided further that nothing contained in this section shall be deemed to apply to any\npublic records which may be legally in the possession of any person otherwise than in his capacity\nof an officer or employee of a public office."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Public records not to be destroyed or disposed of without the authority of the",
      "content": "Director General.— (1) No person or officer shall, without the consent of the Director General,\ndestroy or otherwise dispose of, or authorise the destruction or disposal of, any public records\nwhich are in his possession or under his control.\n(2) The Director General may, with the approval of a Committee consisting of the Director\nGeneral, one departmental representative and two academicians nominated by the Federal\nGovernment authorise the destruction of any specified classes of public records."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Access to public records",
      "content": "(1) Public records referred to in sub-clause (i) of clause (e)\nof section 2 shall be made available to the public for the purposes of reference or research after\ntwenty years of their creation :\nProvided that public records having a bearing on national security, including the records of\nthe intelligence agencies, shall be made available within twenty years of their creation unless on a\nreference from the Secretary of the Administrative Division a Committee headed by Cabinet\nSecretary and including such members as may be appointed by the Federal Government may\ndecide to exempt any record on grounds of national security from the provisions of this sub-section.\n(2) Access to other public records specified in sub-clause (ii) of clause (e) of section 2 shall\nbe allowed in accordance with the conditions and deposit of fee prescribed in rules made under\nthis Act."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Penalty",
      "content": "Whoever contravenes the provisions of section 6 or section 7 shall be\npunishable with imprisonment for a term which may extend to three months, or with fine, or with\nboth."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Jurisdiction to try offences",
      "content": "No court shall take cognizance of an offence punishable\nunder this Act except on a complaint in writing made by an officer authorised in this behalf by the\nFederal Government."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Indemnity",
      "content": "No suit, prosecution or other legal proceeding shall lie against any person\nfor anything which is in good faith done or intended to be done under this Act."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Annual report",
      "content": "(1) The Director General shall each year cause to be prepared and\ntransmitted to the Board a report dealing with the activities of the National Archives during the\npreceding year.\n(2) The Board shall cause a copy of such report to be placed before the Federal\nGovernment."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Rules",
      "content": "The Federal Government may, by notification in the official Gazette, make\nrules for carrying out the purposes of this Act.\n____________                    RGN Date: 17-02-2026"
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Advisory Board for National Archives ;",
      "source_provision": "sec2"
    },
    {
      "term": "Director General",
      "definition": "the Director General of National Archives ;",
      "source_provision": "sec2"
    },
    {
      "term": "National Archives",
      "definition": "the Department of the Government of Pakistan designated as the National Archives of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "public office",
      "definition": "any ministry, division, department, federal parliament, commission, board, corporation, agency, local authority, or any other office of the Government of the Federation and includes such office or corporation or other body as the Federal Government may, by notification in the official Gazette, declare to be a public office ;",
      "source_provision": "sec2"
    },
    {
      "term": "public record",
      "definition": "; (i) papers, documents, records, registers, printed materials, books, maps, plans, drawings, computer records (machine readable records), photographs, microfilms, cinematograph films, and audio and video recordings of any kind whatsoever officially received or produced by any public office for the conduct of its affairs or by any officer or employees, of a public office in the course of his official duties, including records relating to Commissions and Committees appointed by the Federal Government; (ii) any document, book, pamphlet, brochure, letter, handout, gazette, newspaper, journal, file, manuscript, whether written, printed or typed and other archival material of historical and national significance to Pakistan acquired for the National Archives by the Director General.",
      "source_provision": "sec2"
    }
  ]
}
