{
  "id": "pk-national-assembly-secretariat-employees-act-2018",
  "type": "statute",
  "title": "National Assembly Secretariat Employees Act, 2018",
  "title_en": "National Assembly Secretariat Employees Act, 2018",
  "short_name": "NASEA",
  "status": "in_force",
  "issued_date": "2018-03-13",
  "in_force_date": "2018-03-13",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Nobpw%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Assembly Secretariat Employees Act, 2018 (VII of 2018) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, application and commencement",
      "content": "(1) This Act may be called the National\nAssembly Secretariat Employees Act, 2018.\n(2) It applies to all employees in the National Assembly Secretariat wherever they may be.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the subject or context, —\n(a)     “ad hoc appointment” means appointment of a duly qualified person made\notherwise than in accordance with the prescribed method of recruitment,\npending recruitment in accordance with such method;\n(b)     “appointing authority” in relation to a post means the person authorized to\nmake appointment to a post;\n(c)     “Basic Pay Scales (BPS)” means pay scales prescribed by the Government and\nadopted by the Secretariat;\n(d)     “civil servant” shall have the same meaning as assigned to it in the Civil\nServants Act, 1973 (LXXI of 1973);\n(e)     “competent authority” means the appointing authority;\n(f)     “Constitution” means the Constitution of the Islamic Republic of Pakistan;\n(g)     “deputation” means temporary transfer on loan of the services of an employee\nfrom the Secretariat or transfer to the Secretariat of a person from Federation or\nany Province or other authority;\n(h)     “directions” means written directions of the Speaker as notified in the official\nGazette;\n(i)         “employee” means a person appointed in the Secretariat, who shall have the\nstatus of a civil servant subject to such modifications as the Speaker in\nconsultation with the Finance committee may make, but does not include—\n(a)    a person who is on deputation to the Secretariat; and\n(b)    a person who is employed on contract or work-charged basis or who is\npaid from contingencies;\n(j)         “Finance Committee” means the Finance Committee of the National Assembly\nconstituted as provided in Article 88 of the Constitution;\n(k)         “Government” means the Federal Government;\n(l)         “initial appointment” means appointment made otherwise than by promotion\nor transfer;\n(m)         “pay” means the amount drawn monthly by an employee as pay and includes\ntechnical pay, special pay, personal pay and other emoluments declared as such\nby the Government for the civil servants subject to such modifications as the\nSpeaker or the Finance Committee, as the case may be, may make;\n(n)         “permanent post” means a post sanctioned without limit of time;\n(o)         “post” means a post sanctioned in the Secretariat;\n1\n(p)          [“prescribed” means prescribed under this Act and rules made thereunder, or\nas the case may be, prescribed under the Civil Servants Act, 1973 (Act No.\nLXXI of 1973) and rules made thereunder including regulations, policies,\ninstructions, guidelines clarifications and orders for the time being applicable to\nthe civil servants.];\n(q)         “rules” means rules made or deemed to have been made under this Act;\n(r)         “Secretariat” means the National Assembly Secretariat;\n(s)         “Secretary” means the Secretary of the Secretariat who shall have the status of\na Secretary of the Government and, in case of absence of Secretary, includes\nany other person authorized by the Speaker to perform the functions as Acting\nSecretary for the time being;\n(t)         “selection authority” means the Federal Public Service Commission, a\nDepartmental Selection Committee or other authority or body on the\nrecommendation of or in consultation with which any appointment or\npromotion, as may be prescribed, is made;\n(u)         “Speaker” means the Speaker of the National Assembly; and\n(v)         “temporary post” means a post other than a permanent post.\n1\nSubs. by the Act No. V of 2026, s. 2.\n(2) For the purposes of this Act, an appointment, whether by promotion or otherwise, shall be\ndeemed to have been made on regular basis if it is made in the prescribed manner.\n(3) All words and expressions used but not defined in this Act, shall unless the context\notherwise requires, have the meanings assigned to them in the Constitution."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Secretariat",
      "content": "There shall be a separate Secretariat of the National Assembly headed by the\nSecretary.\n1\n[4. Strength and Composition of the Secretariat.—(1) The total strength of the Secretariat,\nconsisting all types of posts, including but not limited to permanent and temporary posts, shall not\nexceed four hundred percent of the total membership of the National Assembly prescribed in Article\n51 of the Constitution of the Islamic Republic of Pakistan:\nProvided that the existing strength of the Secretariat shall be reduced to the strength\nprescribed in sub-section (1) within a period of eighteen months from the date of\ncommencement of the National Assembly Secretariat Employees (Amendment) Act, 2025.\n(2) Subject to sub-section (1), creation, up-gradation, re-designation or abolition of any post\nshall be approved by the Finance Committee and shall be notified in the official Gazette.\n(3) Appointment to a post created or up-graded under sub-section (2) shall be made in the\nmanner prescribed in section 6 of this Act.]\n1\n[5. Terms and conditions of service.— Subject to this Act and rules made thereunder, the\nterms and conditions of service prescribed under the Civil Servant Act, 1973 and rules made thereunder\nincluding regulations, policies, instructions, guidelines, clarifications and orders for the time being\napplicable to the civil servants shall be applicable and deemed to be and always to have been applicable\nto the employees of the Secretariat in the corresponding posts or BPS.\nExplanation: The following references in the Civil Servants Act, 1973 and rules made\nthereunder including regulations, policies, instructions, guidelines, clarifications and orders shall be\nconstrued as under:—\n(a) “Civil Servants” or “Government Servants” or “Government employees” as “employees of\nthe National Assembly secretariat”;\n(b) “Ministry” or “Division” of Federal Government as “National Assembly Secretariat”;\n(c) “President” or “Prime Minister” as “Speaker”; and\n(d) “Secretary” as “Secretary of National Assembly Secretariat”.]\n1\nSubs. by the Act No. V of 2026, ss. 3-4.\n1\n[6. Appointments.—(1) Appointments in the Secretariat shall be made in the prescribed\nmanner by the appointing authority through one of the following methods, namely:—\n(a)        by promotion of a person employed in the Secretariat on the basis of\nrecommendations by the Departmental Promotion Committee; or\n(b)       by initial appointment in the following manner:\n(i)         in BPS-15 and below on the basis of recommendations by the\nDepartmental Selection Committee through an open advertisement and\nselection process in accordance with section 5 of this Act; and\n(ii)       in BPS-16 and above on the basis of recommendations by the Federal\nPublic Service Commission:\nProvided that in case a post is not advertised by the Commission within a period\nof six months of receipt of a requisition from the Secretariat, the appointing authority\nmay withdraw such requisition and make appointments against posts in BPS-16 and\nabove on the basis of recommendations by the Departmental Selection Committee\nthrough an open advertisement and selection process in accordance with section 5 of\nthis Act.\n(2) The Secretariat shall observe the same quota of vacancies as the Federal Government by\nmaintaining a roster of each category of the quota from commencement of the National Assembly\nSecretariat Employees (Amendment) Act, 2025.]\n1\n[7. Appointments on deputation.—(1) The appointing authority may appoint on deputation\na person from the Federation or any Province or Authority through circulation of the post amongst\ncivil servants if no employee eligible for appointment is available in the Secretariat. For this purpose,\nthe Departmental Selection Committee shall circulate the post in the Secretariat and place on record\nwith reasons that no eligible employee is available for appointment on the post in the Secretariat.\n(2) Upon receipt of applications the Departmental Selection Committee, after interviewing the\ncandidates, shall recommend the eligible and the most suitable candidate in the best interest of the\nSecretariat.\n(3) Appointment on deputation may be made for a period of three years extendable for two\nyears only.\n(4) A deputationist shall neither be retained after a period of five years nor appointed by transfer\nor absorbed in the Secretariat.\n(5) A person appointed on deputation in BPS-20 and below shall only be entitled to draw\ndeputation allowance in addition to pay and allowances he was drawing as per the Last Pay Certificate\nissued by his parent department only:\nProvided that sub-section (5) shall apply from commencement of the National Assembly\nSecretariat Employees (Amendment) Act, 2025.]\n1\nSubs. by the Act No. V of 2026, ss. 5-6.\n1\n[8. *     *       *          *   *      *       *]\n1\n[9. *     *       *          *   *      *       *]\n1\n[10. *     *      *          *   *      *       *]"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Promotion",
      "content": "(1) An employee possessing such minimum qualifications as may be\nprescribed shall be eligible for promotion to a higher post for the time being reserved under the rules\nfor promotion in the service or cadre to which he belongs.\n(2) A post referred to in sub-section (1) may either be a selection post or a non selection post\nto which promotions shall be made as may be prescribed, —\n(a) in the case of selection post, on the basis of selection on merit; and\n(b) in the case of a non-selection post, on the basis of seniority-cum-fitness.\n1\n[12. *            *          *   *      *       *      *]\n1\n[13. *            *          *   *      *       *      *]\n1\n[14. *            *          *   *      *       *      *]\n1\n[15. *            *          *   *      *       *      *]\n1\n[16. *            *          *   *      *       *      *]\n1\n[17. *            *          *   *      *       *      *]\n1\n[18. *            *          *   *      *       *      *]\n1\n[19. *            *          *   *      *       *      *]\n1\n[20. *            *          *   *      *       *      *]\n1[21. *               *          *   *      *       *      *]\n1\n[22. *            *          *   *      *       *      *]\n1[23. *               *          *   *      *       *      *]\n1[24. *               *          *   *      *       *      *]"
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Interpretation",
      "content": "All questions relating to interpretation of provisions of this Act shall be\nreferred to the Speaker whose decision thereon shall be final.\n1\n[26. *            *          *   *      *       *      *]\n1\nOmitted. by the Act No. V of 2026, s. 7."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Rules",
      "content": "(1) The Speaker may, with the concurrence of the Finance Committee, make rules\nfor carrying out the purposes of this Act.\n(2) Any rules, orders or instructions in respect of any terms and conditions of service of\nemployees duly made or issued by an authority competent to make them and in force immediately\nbefore the commencement of this Act shall, in so far as such rules, orders or instructions are not\ninconsistent with the provisions of this Act, be deemed to be rules made under this Act.\n1\n[28. *   *       *          *            *     *       *]\n1\n[29. * *         *          *            *     *       *]"
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Repeal",
      "content": "(1) The National Assembly Secretariat (Recruitment and Conditions of Service)\nRules, 1973 are hereby repealed:\nProvided that orders and instructions, including method of appointment already notified issued\nand posts created under these rules shall continue to be in force until relevant directions and rules are\nmade under this Act.\n(2) Notwithstanding the repeal of the National Assembly Secretariat (Recruitment and\nConditions of Service) Rules, 1973, all orders made, proceedings taken and acts done, including\nappointments made either through initial recruitment, induction, absorption, promotion, regularization\nor on contract basis, obligation, liability or penalty incurred, power conferred or exercised, by any\nauthority or by any person, under the said rules and anything done in exercise of the powers, or\npurported exercise of the powers, conferred by or under the said rules, shall continue and be deemed\nto be and always to have been validly made, taken, done incurred, conferred, exercised or issued under\nthis Act and shall not be called in question in any court on any ground whatsoever.\n1\n[31. Act to override other laws.— The provisions of this Act shall have effect\nnotwithstanding anything contained in any other law for the time being in force.]\n_______________\nRGN Dated: 23-01-2026\n1\nOmitted and added by the Act No. V of 2026, ss. 7-8."
    }
  ],
  "definitions": [
    {
      "term": "ad hoc appointment",
      "definition": "appointment of a duly qualified person made otherwise than in accordance with the prescribed method of recruitment, pending recruitment in accordance with such method;",
      "source_provision": "sec2"
    },
    {
      "term": "Basic Pay Scales (BPS)",
      "definition": "pay scales prescribed by the Government and adopted by the Secretariat;",
      "source_provision": "sec2"
    },
    {
      "term": "competent authority",
      "definition": "the appointing authority;",
      "source_provision": "sec2"
    },
    {
      "term": "Constitution",
      "definition": "the Constitution of the Islamic Republic of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "deputation",
      "definition": "temporary transfer on loan of the services of an employee from the Secretariat or transfer to the Secretariat of a person from Federation or any Province or other authority;",
      "source_provision": "sec2"
    },
    {
      "term": "directions",
      "definition": "written directions of the Speaker as notified in the official Gazette;",
      "source_provision": "sec2"
    },
    {
      "term": "employee",
      "definition": "a person appointed in the Secretariat, who shall have the status of a civil servant subject to such modifications as the Speaker in consultation with the Finance committee may make, but does not include— (a) a person who is on deputation to the Secretariat; and (b) a person who is employed on contract or work-charged basis or who is paid from contingencies;",
      "source_provision": "sec2"
    },
    {
      "term": "Finance Committee",
      "definition": "the Finance Committee of the National Assembly constituted as provided in Article 88 of the Constitution;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "initial appointment",
      "definition": "appointment made otherwise than by promotion or transfer;",
      "source_provision": "sec2"
    },
    {
      "term": "pay",
      "definition": "the amount drawn monthly by an employee as pay and includes technical pay, special pay, personal pay and other emoluments declared as such by the Government for the civil servants subject to such modifications as the Speaker or the Finance Committee, as the case may be, may make;",
      "source_provision": "sec2"
    },
    {
      "term": "permanent post",
      "definition": "a post sanctioned without limit of time;",
      "source_provision": "sec2"
    },
    {
      "term": "post",
      "definition": "a post sanctioned in the Secretariat; 1 (p) [“prescribed” means prescribed under this Act and rules made thereunder, or as the case may be, prescribed under the Civil Servants Act, 1973 (Act No. LXXI of 1973) and rules made thereunder including regulations, policies, instructions, guidelines clarifications and orders for the time being applicable to the civil servants.];",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made or deemed to have been made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Secretariat",
      "definition": "the National Assembly Secretariat;",
      "source_provision": "sec2"
    },
    {
      "term": "Secretary",
      "definition": "the Secretary of the Secretariat who shall have the status of a Secretary of the Government and, in case of absence of Secretary, includes any other person authorized by the Speaker to perform the functions as Acting Secretary for the time being;",
      "source_provision": "sec2"
    },
    {
      "term": "selection authority",
      "definition": "the Federal Public Service Commission, a Departmental Selection Committee or other authority or body on the recommendation of or in consultation with which any appointment or promotion, as may be prescribed, is made;",
      "source_provision": "sec2"
    },
    {
      "term": "Speaker",
      "definition": "the Speaker of the National Assembly; and",
      "source_provision": "sec2"
    },
    {
      "term": "temporary post",
      "definition": "a post other than a permanent post. 1 Subs. by the Act No. V of 2026, s. 2. (2) For the purposes of this Act, an appointment, whether by promotion or otherwise, shall be deemed to have been made on regular basis if it is made in the prescribed manner. (3) All words and expressions used but not defined in this Act, shall unless the context otherwise requires, have the meanings assigned to them in the Constitution.",
      "source_provision": "sec2"
    }
  ]
}
