{
  "id": "pk-national-bank-of-pakistan-nbp-ordinance-1949",
  "type": "statute",
  "title": "National Bank of Pakistan (NBP) Ordinance, 1949",
  "title_en": "National Bank of Pakistan (NBP) Ordinance, 1949",
  "short_name": "NBOPO",
  "status": "in_force",
  "issued_date": "1949-11-08",
  "in_force_date": "1949-11-08",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-a5aVaQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Bank of Pakistan (NBP) Ordinance, 1949 (XIX of 1949) published by The Pakistan Code (Banking/Financial Laws).",
  "provisions": [
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "ESTABLISHMENT, INCORPORATION AND SHARE CAPITAL OF THE NATIONAL BANK"
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. [Omitted.]",
      "content": "1\nORDINANCE NO. XIX OF 1949\n[9th November, 1949]\nAn Ordinance to constitute a National Bank of Pakistan.\nWHEREAS an emergency has arisen which renders it necessary to extend banking facilities\ngenerally and also to provide credit for agriculture and agricultural produce;\nNOW, THEREFORE, in exercise of the powers conferred by section 42 of the Government of\nIndia Act, 1935 (26 Geo.5,c.2.), the Governor-General is pleased to make and promulgate the\nfollowing Ordinance:___"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Ordinance may be called the National\nBank of Pakistan Ordinance, 1949.\n2\n[(2) It extends to the whole of Pakistan.]\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment and incorporation of the Bank",
      "content": "__(1) As soon as may be after the\ncommencement of this Ordinance, there shall be constituted in accordance with the provisions of this\nOrdinance a bank to be called the National Bank of Pakistan to carry on the business of banking.\n(2) The Bank shall be a body corporate having perpetual succession and a common seal, and\nshall by the said name sue and be sued."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Share Capital",
      "content": "_(1) Subject to the provisions of this Ordinance the authorised 2[Capital]\nof the Bank shall be 3[such as the Federal Government, may by notification in the official Gazette,\nspecify and the amount so specified shall be divided into] 4[Ordinary shares of ten] rupees each.\n(2) Out of the said capital there shall, from time to time, be issued such number of shares and\non such terms, if any, including the terms of brokerage and underwriting, as the Central Board may\ndecide 5[.]\n6\n*              *              *              *               *             *          *\n(3) The liability of the shareholders of the Bank shall be limited to the amount not fully paid\nup on their shares.\n(4) The shareholders of the Bank may, subject to the sanction of the 7[Federal Government],\n8\n* * * by special resolution, increase or reduce the capital of the Bank.\n___"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Nature of shares. The shares of the Bank shall be movable property and each share shall",
      "content": "be distinguished by its appropriate number."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Principal register of shareholders",
      "content": "_The Bank shall maintain at its Head Office\nestablished under section 11 a register, to be called the principal register, of all shareholders of the\nBank, and shall enter therein such particulars as may be prescribed.\n1\nSubs. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 2, for the original cl. (1).\n2\nSubs. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 3, for “share capital”.\n3\nSubs. by the National Bank of Pakistan (Amdt.) Ordinance, 1981 (42 of 1981), s. 2, for “[three crores] or rupees divided into thirty lakh” The words in\ncrotchets were subs. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s., 3, for “six crores”.\n4\nSubs. by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1971), s. 2, for “six hundred thousand Ordinary shares of fifty”.\n5\nSubs. by Ord. 52 of 1960, s. 3 for the colon.\n6\nProviso omitted ibid.\n7\nSubs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 6, for “Central Government”.\n8\nThe original words “and subject to the provision of the proviso to sub-section (2),” omitted by the National Bank of Pakistan (Amdt.) Ordinance, 1960\n(52 of 1960), s. 2."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Branch registers",
      "content": "_(1) The Bank shall cause to be maintained at the offices of its Local\nBoards branch registers of the shareholders qualified and entitled to be registered therein, containing\nsuch particulars as may be prescribed.\n(2) Subject to the provisions of this Ordinance shares shall be transferable from one branch\nregister to another."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Qualifications of shareholders",
      "content": "_(1) No person shall be qualified to be registered as a\nshareholder who by reason of anything contained in any law for the time being in force is not\ncompetent to enter into any contract.\n(2) A person who subsequent to his registration, is discovered to have been not qualified as\naforesaid at the time of registration shall not be entitled to exercise any of the rights of a shareholder\notherwise than for the purpose of the sale of his shares under the orders of a competent Court.\n(3)     (a)     A shareholder shall be entitled to be registered in any area defined in\nsub-section (5) in which he ordinarily resides or has his principal place of\nbusiness.\n(b)     A shareholder who neither resides nor has a place of business in the areas\ndefined in sub-section (5) shall be registered in such branch register as the\nCentral Board 1[may from time to time].\n(c)     No person shall be registered as a shareholder in more than one branch\nregister.\n2\n[*            *              *                *              *               *           *]\n3\n[(5) The area served by the branch register maintained at Karachi shall consist of the 4[the\nProvinces of Sind and Baluchistan including the Provincially Administered Tribal Areas; 5[and] the\narea served by the branch register maintained at Lahore shall consist of the Provinces of the Punjab\nand North West Frontier including the Provincially Administered Tribal Areas, 5[and] the Islamabad\nCapital Territory and the 6[Federally] Administered Tribal Areas] 5[*           *      *].\n___"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Central Government a shareholder. Notwithstanding anything contained in section 8,",
      "content": "the Central Government shall be a shareholder of the Bank and shall purchase at par not less than\ntwenty-five percent of the shares issued by the Bank from time to time."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. No notice to be taken of trusts",
      "content": "_No notice of any trust, express, implied or constructive\nshall be entered on the principal or any branch register or be receivable by the Bank."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Head office of the Bank",
      "content": "_The Head Office of the Bank shall be at Karachi."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Central Board",
      "content": "_The general superintendence and direction of the affairs and business\nof the Bank shall be entrusted to the Central Board which may exercise all powers and do all such\nacts and things as may be exercised or done by the Bank and are not by this Ordinance expressly\ndirected or required to be done by the Bank in general meeting."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Local Boards",
      "content": "_7[Two] Local Boards shall be established for the areas mentioned in\nsub-section (5) of section 8, one each at 8[Karachi] and Lahore, and shall without prejudice to the\npowers conferred by section 12, have power, within the prescribed limits, generally to transact all the\nusual business of the Bank.\n1\nSubs. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 4 for certain original words.\n2\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and Sch. II.\n3\nSubs. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 4, for the original sub-section (5), as amended by the Federal Laws\n(Revision and Declaration), Act, 1951 (26 of 1951), and the Central Laws (Statute Reforms), Ordinance, 1960 (21 of 1960).\n4\nSubs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 2.\n5\nIns. and omitted by F.A.O., 1975, Art. 2 and Sch.\n6\nSubs. ibid., Art. 2 and Table.\n7\nSubs. by F.A.O., 1975, Art. 2 and Sch., for “three”.\n8\nSubs. ibid., for “Karachi, Dacca”."
    },
    {
      "provision_ref": "sec114",
      "section": "114",
      "title": "Section 114. Constitution of the Central Board",
      "content": "_(1) The Central Board shall consist of the\nfollowing Directors, namely:___\n(a)     the Managing Director appointed by the 2[Federal Government] under section\n16;\n3\n[(b)   four Directors elected in local or special local meetings by the shareholders in\nsuch manner that the shareholders registered in a branch register maintained\nfor an area mentioned in sub-section (5) of section 8 shall elect from amongst\nthemselves such number of Directors for that area as may be decided before\nelection by the Central Government having regard to the proportion which the\nshare capital subscribed by the shareholders of that area bears to the whole:\nProvided that the Federal Government may, at any time, by order in writing, direct that, for\nsuch period as may be specified in the order, no Director Shall be elected for any area so specified,\nand, where it makes such an order, shall allocate to the other areas the seats of the Directors who\nwould have been elected for that area had no such order been made;]\n4\n[(c)   Five Directors appointed by the Federal Government:]\n(2)    The 4[Chairman] of the Central Board shall be appointed by the                                                           5\n[Federal\nGovernment] from amongst the Directors."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Constitution of Local Boards",
      "content": "_A Local Board shall consist of the following members,\nnamely:___\n(a)        the Managing Director 6[* * *]:\nProvided that in the event of the inability of 7[Managing Director] to attend the\nmeeting of a Local Board 8[he] may nominate an officer of the Bank to attend\nas an ex-officio Member;\n(b)        one Member appointed by the Central Board from amongst the Directors\nelected by the shareholders registered in the branch register of that area;\n(c)        two Members appointed by the 5[Federal Government] from the area in which\nthe Local Board is established;\n9\n(d)         [three] Members elected in a local or special local meeting from amongst\nthemselves by the shareholders registered in the branch register of that area."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Managing Director and Deputy Managing Directors",
      "content": "_10[(1) The Managing Director\nshall be appointed by the 2[Federal Government] for a period not exceeding 11[five] years and on\nsuch salary and terms and conditions of service as the 2[Federal Government] may determine:\nProvided that neither the salary nor the terms and conditions of service shall be varied to his\ndisadvantage during his tenure of office 12[ : ]]\n1\nFor notification under this section, see Gaz. of P., 1953, Ext., p. 299.\n2\nSubs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 6, for “Central Government”.\n3\nSubs. ibid., s. 3.\n4\nSubs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 3.\n5\nSubs. ibid., s. 6, for “Central Government”.\n6\nThe original words “or a Deputy Managing Director” omitted by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 6.\n7\nSubs. ibid., for “either of them”.\n8\nSubs. ibid., for “the Managing Director”.\n9\nSubs. ibid., s. 6, for “two”.\n10\nSubs. by the National Bank of Pakistan Ordinance (Amdt.) Act, 1953 (29 of 1953), s. 2 for the original sub-section (1).\n11\nSubs. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 7, for “three”.\n12\nSubs. ibid., for full-stop.\n1\n[Provided further that the appointment may be terminated by six months’ notice in writing\ngiven by the 2[Federal Government] to him or by him to the 2[Federal Government.]\n3\n[*                *                      *                    *                        *          *   *]\n4                                             5\n(3) The Managing Director [* * *] shall on the expiry of [his term] of office be eligible for\nre-appointment:\nProvided that no person shall hold office as Managing Director 6[* * *] who is a member of\n7\nthe [Federal] or a Provincial Legislature.\n8\n[(4) The Managing Director shall be the chief executive officer of the Bank and shall,\nsubject to any bye-laws made in this behalf, direct and control, on behalf of the Central Board, the\naffairs of the Bank.]."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Qualifications and disqualifications of Directors and Members",
      "content": "_(1) No person not\nappointed by the 2[Federal Government] to serve as a Director or Member shall be qualified to serve\nas a Director or Member unless he is a holder in his own right of unencumbered shares of the Bank\nto the nominal amount of ten thousand rupees at the least.\n(2)        No person shall be qualified to serve as a Director or Member___\n9\n[*                *                      *                    *                        *          *   *]\n10\n[*]\n(b)        if he is a salaried officer of any Government 11[,whether within or without\nPakistan, and is] not authorised by the 2[Federal Government] to serve as a\nDirector or Member 12[;]\n13\n[(c) if he has been convicted of an offence involving moral turpitude;\n(d)       if he was at any time in the service of the Bank and was dismissed or his\nservices had been terminated by the bank;\n(e)        if he is a Director of any commercial bank other than a bank sponsored or\nestablished by or under the authority of the 2[Federal Government] or the State\nBank of Pakistan for the development of industry or agriculture in the country,\nor a bank which is a society registered under the Cooperative Societies Act,\n1912 (Act II of 1912) or any other law for the time being in force in Pakistan\nrelating to co-operative societies;\n(f)        if he is in the employment of any banking company, whether on salary or on\ncommission, or is engaged in the performance of any continuous service for\nremuneration for any such company; 14*\n1\nSecond proviso added . by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960 ), s.7\n2\nSubs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 6, for “Central Government”.\n3\nSub-section (2) omitted ibid.\n4\nThe original words “and Deputy Managing Director” omitted ibid.\n5\nSubs. ibid. for “their respective terms”.\n6\nThe original words “or Deputy Managing Director” omitted ibid.\n7\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central”.\n8\nAdded by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 3.\n9\n10\nThe original word “or” omitted by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 8.\n11\nSubs. ibid., “in Pakistan”.\n12\nSubs. ibid., for full-stop.\n13\nNew cls. (c) to (g) added, ibid.\n14\nOmitted by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 4.\n1\n[(g)   if he is for the time being disqualified for membership of any body established\nby or under any law (P.O 13 of 1959) for the time being in force of which the\nConstituent members are wholly or partly chosen by means of election 2[;]\n2\n[(h)   if having been a Director or Member, his office as such has been vacated, or\ndeemed to be vacated under the provisions of clause (h) of sub-section (3); or\n(i)        If he has vacated his office as Director or, as the case may be, Member under\nclause (i) of sub-section (3) unless a period of three years has elapsed since the\ndate he so vacated his office.].\n(3)        The office of a Director or Member shall be vacated___\n(a)        if the person holding it resigns his office or dies;\n(b)        if he accepts or holds any other office of profit under the Bank;\n(c)        if he is, or at any time has been, adjudicated an insolvent, or compounds with\nhis creditors or suspends payment;\n(d)        if he is found lunatic, or becomes of unsound mind;\n(e)        if he has absented himself from three consecutive meetings of the Central or a\nLocal Board, as the case may be, or from all such meetings for a continuous\nperiod of six months, whichever is longer, without leave of absence from the\nBoard concerned; 3[*]\n(f)        if he ceases to hold in his own right the amount of shares required to qualify\nhim for the office 4[;] 5[*]\n6\n[(g)   if he incurs any of the disqualifications mentioned in sub-section (2) 7[;]\n8\n[(h)   if, in relation to the Bank he has failed to pay any advance, loan or credit limit\nor any installment thereof or interest thereon, or any amount due on any\nguarantee, or to do or perform any act agreed or undertaken in writing to be\ndone or performed by him, and such failure continues for a period of one\nmonth after notice in writing has been served on him by the Bank calling upon\nhim to make the payment or to do or perform the act; or\n(i)        if he has been a Director or Member for a continuous period of six years from\nthe date when he was first elected as such Director or Member or, as the case\nmay be, was appointed by name and otherwise than by designation of office,\nas such Director or Member.]\n9\n[Explanation.___ In computing the period of six years for the purpose of this clause any break\nof less than three years in the continuity of office shall be disregarded.].\n(4) No two persons who are partners of the same mercantile firm, or who are directors of the\nsame private company, or one of whom is the general agent of, or holds a power of procuration from\nthe other or from a mercantile firm of which the other is a partner, shall be eligible or qualified to\nserve as Directors of the Central Board, or as Members of the same Local Board at the same time\n10\n[:]\n1\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and II Sch.\n2\nSubs. and added by Ord. 14 of 1970, s. 4.\n3\nThe original word “or” omitted by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 8.\n4\nSubs. ibid., for full-stop.\n5\nThe word “or” which was added ibid., have been omitted by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 4.\n6\nCl. (g) added ibid.\n7\nSubs. by Ord. 14 of 1970, s. 4.\n8\nAdded, ibid.\n9\nAdded by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 4.\n10\nSubs. omitted and added by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 4.\n1\n[*                *                     *                      *                     *                     *                *]\n1\n[(5) Nothing in sub-section (1), or in clause (b) of sub-section (2), or in clauses (b) and (i) of\nsub-section (3) shall apply to the Managing Director or an officer nominated by the Managing\nDirector or an officer nominated by the Managing Director under the proviso to clause (a) of section\n15.]."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Removal of Directors and Members",
      "content": "_(1) The shareholders may, by a special\nresolution passed by the votes of shareholders holding in the aggregate more than one half of the\npaid-up capital for the time being, removed any Director, other than a Director appointed by the\n2\n[Federal Government], before the expiration of his period of office, and appoint in his stead a\nqualified person who shall hold office subject to sub-section (2) of section 21.\n(2) The shareholders on a branch register may, by a special local resolution passed by the\nvotes of shareholders holding in the aggregate more than one half of the paid-up capital for the time\nbeing on the branch register concerned, remove any Member, other than a Member appointed by the\n2\n[Federal Government] or the Central Board of the Local Board concerned, before the expiration of\nhis period of office, and appoint in his stead a qualified person who shall hold office subject to\nsub-section (2) of section 21.\n(3) Directors and Members appointed by the 2[Federal Government] and the Central Board\nmay be removed and replaced by other Director and Members at the discretion of the appointing\nauthorities concerned."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. [First Constitution of the Central and Local Boards.] Omitted by the National Bank of",
      "content": "Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 9."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Terms of office of Directors and Members",
      "content": "_(1) 3[At every general meeting] one third\n4\nof the [elected] Directors and Members for the time being, or if their number is not three or a\nmultiple of three then the number nearest to one third, shall retire from office 5[; but the retired\nDirector or Members shall, subject to the provisions of section 17, be eligible for re-election].\n(2) The Directors and Members to retire at every general 6[* *] meeting shall be those who\nhave been longest in office, and as between those Directors and Members who are to retire and who\nhave been in office for an equal length of time the Director and Member to retire shall in default of\nagreement amongst themselves be determined by lot, the length of time a Director or Member has\nbeen in office being subject to subsection (2) of section 21, computed from his last election.\n7\n[*            *              *                *            *               *          *]\n8\n[(3) A Director or Member appointed by the Federal Government, other than the Managing\nDirector, shall hold office during the pleasure of the Federal Government.\n(4) A Member appointed by the Central Board shall cease to hold office when he ceases to be\na Director.]"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Vacancies",
      "content": "__ (1) Any vacancy occurring on the Central or a Local Board by the death,\nresignation 9[, removal] or disqualification of any Director or Member shall be filled by the\nremaining Directors or Members, as the case may be, who shall co-opt a duly qualified person to fill\nthe vacancy:\n1\nSubs. omitted and added by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 4.\n2\nSubs. by Act 11 of 1973, s. 6, for “Central Government”.\n3\nSubs. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 10, for certain original words.\n4\nIns. by the National Bank of Pakistan Ordinance (Amdt.) Act, 1953 (29 of 1953), s. 3.\n5\nAdded by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 5.\n6\nThe original words “and local” omitted by Ordinance 52 of 1960, s. 10.\n7\nSub-section (2A) which was originally inserted by Ord. 52 of 1960, s. 10 have been omitted by Ord. 14 of 1970, s. 5.\n8\ns. 5.\n9\nIns. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 11.\nProvided that where a vacancy occurs in the office of a Director or Member appointed by the\n1\n[Federal Government] or the Central Board, the vacancy shall be filled only by appointment by the\n1\n[Federal Government] or the Central Board, as the case may be.\n(2) Any Director or Member so 2* * appointed shall be deemed to have held office from the\ndate on which the Director or Member in whose place he is 2[* *] appointed was 3[* *] appointed, or,\nwhen such Director or Member was co-opted or appointed under this sub-section, from the date on\nwhich his mediate or immediate predecessor was 2[* *] appointed, as the case may be.\n4\n[(3) Any Director or Member co-opted under sub-section (1) shall retire at the next general\nor local meeting, as the case may be, and the vacancy so occurring on the Central or a Local Board\nshall be filled by election as provided in clause (b) of sub-section (1) of section 14 or clause (d) of\nsection 15, as the case may be.]"
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. General and Special meetings",
      "content": "_(1) In the first week of March in every year, or as soon\nthereafter as is convenient, a general meeting shall be held annually in rotation at the towns where\nthe Local Boards are established, at such time as may be determined by the Central Board and at the\nmeeting the 5[shareholders present shall be entitled to discuss the annual account, the report of the\nCentral Board on the working of the Bank throughout the year, and the auditors report on the annual\nbalance sheet and accounts, made up to the preceding thirty-first day of December].\nProvided that the first general meeting shall be held at Karachi.\n(2) Special meetings shall be convened and held in such manner and at such time and place as\nmay be prescribed."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Local and special local meetings",
      "content": "_Local and special local meetings shall be convened\nand held in such manner and at such time and place as may be prescribed."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Votes of shareholders",
      "content": "_(1) Every shareholder shall be entitled to attend any meeting\nand each shareholder who has been registered as such for a period of not less than three months prior\nto the date of such meeting shall when present in person and on a show of hands, have one vote; and\non a poll each shareholder so registered for a like period shall have one vote for every ten shares\n6\n[, subject to a maximum of 7[ten] votes]:\nProvided that no shareholder shale be entitled to vote at any meeting unless all calls or other\nsums presently payable by him in respect of shares of the Bank have been paid.\n8\n[(2) On a poll votes may be given either personally or by proxy, but the 4[Federal\nGovernment], as a shareholder may appoint any person to be present at any general meeting and to\nvote on its behalf.]."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Business which the Bank is authorised to transact",
      "content": "_The Bank is authorised to carry\non and transact the 13 several kinds of business hereinafter specified, namely:___\n(1) the advancing and lending of money, and opening of cash-credits upon the security of___\n(a)    stocks, funds and securities 9[* * *] in which a trustee is authorised to invest\ntrust money by any law for the time being in force in Pakistan and shares of\nthe State Bank of Pakistan;\n1\nSubs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 6, for “Central Government”.\n2\nThe original words “co-opted or” omitted by Ordinance, 52 of 1960, s. 11.\n3\nThe original words “elected or” omitted ibid.\n4\nSub-section (3) added, ibid.\n5\nSubs. ibid., s. 12, for certain original words.\n6\nIns . by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960 ), s.13\n7\nSubs. by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 6 for “fifty”.\n8\nSub-section (2) subs. Ibid.\n9\nThe original brackets and words “(other than immoveable property)” omitted by the National Bank of Pakistan (Amdt.) Ordinance, 1960, (52 of 1960),\ns. 14.\n(b)        debentures or other securities for money issued under the authority of any law\nor a time being in force in Pakistan by, or on behalf of, a port trust authority or\na district board or a municipal board or committee 1[* * *];\n(c)        goods which, or the documents of title to which, are deposited with, or\nassigned to, the Bank as security for such advances, loans or credits;\n(d)        subject to such directions as may be issued by the Central Board, debentures\nof companies with limited liability;\n(e)        shares of companies with limited liability, in accordance with such directions\nin this regard as may be issued from time to time by the State Bank of\nPakistan;\n(f)goods which are hypothecated to the Bank as security for such advances, loans\nor credits 2[* * *];\n(g)    accepted bills of exchange and promissory notes endorsed by the payees and\njoint and several promissory notes of two or more persons or firms\nunconnected with each other in general partnership; 3[*]\n4\n[(h) immovable property or documents of title relating thereto, subject to such\ndirections as may be issued by the Central Board;]\n5\n[(i) subject to such directions as may be issued by the Central Board, tea crops;]\nProvided that any advances or loans which are guaranteed by the 6[Federal Government] or\nany Provincial Government in Pakistan may be made without any specific security;\n(2)      the selling and realisation of proceeds of sale of any such promissory notes,\ndebentures, stock receipts, bonds, annuities, stocks, shares, securities or goods which, or the\ndocuments of title to which, have been deposited with, or pledged, hypothecated, assigned or trans-\nferred to, the Bank as security for such advances, loans or credits or which are held by the Bank or\nover which the Bank is entitled to any lien or charge in respect of any such advance or loan or credit\nor any debt or claim of the Bank, and which have not been redeemed in due time in accordance with\nthe terms and conditions (if any) of such deposit, pledge, hypothecation, assignment or transfer;\n(3) the advancing and lending of money to Courts of Wards upon the security of estates in\ntheir charge or under their superintendence and the realisation of such advances or loans and any\ninterest due thereon:\nProvided that no such advance or loan shall be made without the previous sanction of the Provincial\nGovernment concerned;\n(4) the drawing, accepting, discounting, buying and selling of bills of exchange and other\nnegotiable securities;\n7\n[(5)the investing of the funds of the Bank in or the underwriting of, any stocks, funds,\nshares, securities, debentures, bonds or scripts or other securities for money issued by any public\nlimited company or any corporation established by or under any law for the time being in force or\nunder the authority of the 6[Federal Government] or the State Bank of Pakistan, and converting the\nsame into money when required, and altering, converting and transposing any such investment for or\ninto any other of such investments;]\n1\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and II Sch.\n2\nThe original comma and words “, if so authorised by special directions of the Central Board” omitted by Ordinance, 52 of 1960, s. 14.\n3\nThe original word “and” omitted by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 14.\n4\nSubs. ibid., for the original sub-clause (h).\n5\nNew sub-clause (i) added, ibid.\n6\nSubs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 6, for “Central Government”.\n7\nSub-section (5) which was previously amended by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 14 have been subs. by the\nNational Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 7.\n(6) the issuing of letters of credit;\n(7) the buying and selling of gold and silver whether coined or uncoined;\n(8) the receiving of deposits and keeping cash accounts on such terms as may be agreed on;\n(9) the acceptance of the charge of plate, jewels, titledeeds or other valuable goods o such\nterms as may be agreed on;\n(10) the 1[managing,] selling and realising of all property whether movable or immovable\nwhich may in any way come into the possession of the Bank in satisfaction or part satisfaction of any\nof its claims, and the acquisition and holding of, and generally the dealing with, any right, title or\ninterest in any property movable or immovable which may be the Bank’s security for any advance or\nloan or may be connected with any such security 2[:]\n3\n[Provided that the Bank shall not take over the management of any such property except in\npursuance of an agreement with the debtor or of an order, judgment or decree of a court of competent\njurisdiction;]\n(11) the transacting of pecuniary agency business on commission and the entering into of\ncontracts of indemnity, suretyship or guarantee with specific security or otherwise 4[, and the\nunder-writing, participating in, and carrying out of the issue of any stock, shares, debentures and\nother securities];\n(12) the administration of estates for any purpose whether as an executor, trustee or otherwise\nand the acting as agent on commission in the transaction of the following kinds of business,\nnamely:___\n(a)\nthe buying, selling, transferring and taking charge of any securities or any\nshares in any public company;\n(b)    the receiving of the proceeds whether principal, interest or dividends, of any\nsecurities or shares;\n(c)    the remittance of such proceeds by public or private bills of exchange, payable\neither in Pakistan or elsewhere;\n(13) the drawing of bills of exchange and the granting of letters of credit payable out of\nPakistan;\n(14) the buying of bills of exchange payable out of Pakistan;\n(15) the borrowing of money for the purpose of the Bank’s business, and the giving of\nsecurity for money so borrowed by pledging assets or otherwise;\n(16) the paying, receiving, collecting and remitting money, bullion and securities under any\nagreement with the State Bank of Pakistan as its agent on behalf of any Government in Pakistan, or\nundertaking and transacting any business which the State Bank of Pakistan may from time to time\nentrust to it;\n(17) the establishing and discontinuing of branches and agencies;\n(18) the acquiring, maintaining and transferring of the Bank’s residential and business\npremises;\n(19) the taking over of the business, including the capital assets and liabilities of any other\nbank, with the sanction of the 5[Federal Government];\n1\nIns. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 14.\n2\nSubs. ibid., for semi-colon.\n3\nProviso added ibid.\n4\nAdded by the National Bank of Pakistan (Amdt.) Ordinance, 1962 (61 of 1962), s. 3.\n5\nSubs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 6, for “Central Government”.\n(20) the granting of advances or loans to any other bank for the purpose of averting or\nfacilitating its winding up; 1[*]\n2\n[*             *             *              *               *              *                                              *]\n3\n[(21) with the previous permission in writing of the State Bank of Pakistan,___\n(a)        the investing of the funds of the Bank in any bank incorporated outside\nPakistan, and\n(b)        participating in the management and administration of any such bank in which\nthe funds of the Bank have been invested; and]\n(22) generally, the doing of all such matters and things as may be incidental or subsidiary to\nspecified."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Business which the Bank is not authorised to transact",
      "content": "_The Bank shall not transact\nany kind of banking business other than those specified in section 25, and in particular___\n4\n[(1) the Bank shall not make any advance or loan upon the security of its shares;]\n5\n[*     *      *       *      *      *      *]\n(2) the Bank shall not discount or buy or advance or lend to any individual or\npartnership-firm an amount exceeding in the whole at any one time such sum as may be prescribed;\n(3) the Bank shall not discount or buy or advance or lend or open cash-credits on the security\nof any negotiable instrument of any individual or partnership-firm, payable in the town or at the\nplace where it is presented for discount, which does not carry on it the several responsibilities of at\nleast two persons or firms unconnected with each other in general partnership:\nProvided that nothing in this section shall be deemed to prevent the Bank from 6[granting overdrafts\nand loans], without security, to such extent as may be prescribed 7[;]\n7\n[(4) the Bank shall not grant to any person who has been elected or appointed as a Director\nor Member and for so long as he continues to hold that office any advance, loan, credit limit,\nguarantee or other facilities, or alter to his advantage the terms and conditions of any advance, loan,\ncredit limit, guarantee or other facilities granted before his election or appointment as a Director or\nMember :\nProvided that nothing in this clause shall prevent the Bank from continuing or renewing any\nsuch advance, loan, credit limit, guarantee or other facilities as may have already been granted to\nsuch person before his election or appointment as a Director or Member.].\n8\n[26A. Exceptions___Notwithstanding anything contained in sections 25 and 26 the Bank is\nauthorised to___\n(1) grant advances or loans to its officers and staff for the purpose of building residential\nhouses, including the cost of land, on such security, including immovable property, and on such\nterms and conditions and for such periods as may be prescribed;\n1\nThe word “and” which was added by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 14, has been omitted by the National\nBank of Pakistan (Amdt.) Ordinance, 1963 (5 of 1963), s. 2.\n2\n3\nNew cl. (21) ins. by the National Bank of Pakistan (Amdt.) Ordinance, 63 (5 of 1963), s. 2.\n4\nSubs. by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 8. for original sub-section. (1)\n5\n6\nSubs. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 15, for “allowing any person who keeps an account with the Bank of\noverdraw such account”.\n7\nSubs. and added by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 8.\n8\nSubs. ibid., s. 16, for section 26A which was ins. by the National Bank of Pakistan Ordinance (Amdt.) Act, 1953 (29 of 1953), s.4.\n1\n[(1a) grant advances or loans, or any period exceeding one year but not exceeding\nfive years, to such small and medium industries as may, from time to time, be\nspecified by the Central Board on such terms and conditions as may be\nprescribed:\nProvided that the amount of advances and loans outstanding at any time under this clause\nshall not exceed five percent of the total amount of bank deposits at such time;]\n(2)     grant or subsidise, from time to time, pensions, gratuities, bonuses or other\nfunds created for the benefit of its officers and staff or their dependents;\n(3)     contribute to the promotion of research in banking and allied subjects; and\n(4)     donate funds for any charitable objects or to any charitable institutions or\nsocieties.]"
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Auditors",
      "content": "_(1) Not more than two auditors who shall be Registered Accountants shall be\nelected and their remuneration fixed at the general meeting. The auditors may be shareholders, but\nno Director or Member or other officer of the Bank shall be eligible during his continuance in office.\nAny auditor shall be eligible on quitting office for re-election.\n(2) The first auditors of the Bank may be appointed and their remuneration fixed by the\nCentral Board before the general meeting and if so appointed shall hold office only until the first\ngeneral meeting. All auditors elected under this section shall severally be and continue to act as\nauditors until the first general meeting after their respective elections:\nProvided that if any casual vacancy occurs in the office of any auditor elected under this section, the\nvacancy may be filled by the Central Board."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Government auditors",
      "content": "_Without prejudice to anything contained in the foregoing\nprovisions, the 2[Federal Government] may appoint such auditors as it thinks fit to examine and\nreport upon the accounts of the Bank."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Rights and duties of auditors",
      "content": "_(1) Every auditor shall be supplied with a copy of the\nannual balance sheet and statement of profit and loss and it shall be his duty to examine the same,\nwith the accounts and vouchers relating thereto. Every auditor shall have list livered to him of all\nbooks kept by the Bank, and shall at all reasonable times have access to the books, accounts and\nother documents of the Bank, and may, at the expense of the Bank if appointed by it, and at the\nexpense of the 1[Federal Government] if appointed by it, employ accountants or other persons to\nassist him in investigating such accounts, and may, in relation to Such accounts examine any\nDirector, or any Member or any other officer of the Bank.\n(2) The auditors shall make a report to the shareholders or to the 2[Federal Government] as\nthe case may be, upon the annual balance sheet, the statement of profit and loss and accounts, and in\nevery such report they shall state whether, in their opinion, the balance sheet and the statement of\nprofit and loss are full and fair statements containing the prescribed particulars and properly drawn\nup so as to exhibit a true and correct view of the state of the Bank's affairs, and in case they have\ncalled for any explanation or information from the Central Board or a Local Board, whether it has\nbeen given and whether it is satisfactory. Any such report made to the shareholders shall be read\ntogether with the report of the Central Board at the general meeting."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Acceptance of liabilities",
      "content": "_The Bank shall accept and honour all liabilities, obligations\nand commitments incurred and made by the Promotors Company, Limited, formed to provide for the\nestablishment of the Bank in accordance with the rights and powers with which that Company, is\ninvested by its Memorandum of Association.\n1\nNew cl. (1a) ins. by the National Bank of Pakistan (Amdt.) Ordinance, 1962 (61 of 1962), s. 4.\n2\nSubs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 6, for “Central Government”"
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Liquidation of the Bank",
      "content": "_Nothing in the Companies Act, 1913 (VII of 1913), shall apply\nto the Bank, and the Bank shall not be placed in liquidation save by order of the 1[Federal Government],\nand in such manner and under such terms and conditions, including the terms as to calls on and\nforfeiture of shares, as the 1[Federal Government] may by its order of liquidation direct."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Power of the Central Board to make bye",
      "content": "laws.___(1) The Central Board may, with the\nprevious approval of the 1[Federal Government], make bye-laws not inconsistent with this Ordinance\nto provide for all matters for which provision is necessary or convenient for the purpose of giving\neffect to the provisions of this Ordinance.\n(2) In particular and without prejudice to the generality of the foregoing provisions, such\nbye-laws may provide for all or any of the following matters, namely :___\n(i)        the maximum amounts which may be advanced or lent to, or for which bills\nmay be discounted for or purchased from, any individual or partnership-firm\nwith or without security;\n(ii)       the conditions subject to which alone advances may be made to Directors,\nMembers or 2[*] officers 3[or other staff] of the Bank, or the relative of such\nDirectors, Members or officers, 4[or other staff] or to companies, firms or\nindividuals with which or with whom such Directors, Members, officers 4[or\nother staff] or relatives are connected as partners, directors, managers,\nservants, shareholders or otherwise;\n(ii)       the manner in which and the conditions subject to which the Bank may take\nover the business, including the capital, assets and liabilities, of any other\nbank;\n(iii)      the granting of advances or loans to any other bank for the purpose of averting\nor facilitating its winding up;\n(iv)       the procedure and manner in which the capital of the Bank may be increased\nor reduced;\n(vi)       the acquisition, maintenance and transfer of the Bank's residential and\nbusiness premises;\n(vii)      the contents, maintenance, inspection and closure of the principal and branch\nregisters of shareholders;\n(viii)     the books and accounts to be kept at the various offices of the Bank;\n(ix)       the balancing of accounts and ascertainment of profit and loss;\n(x)        the form and manner in which the balance sheet and the statement of profit\nand loss shall be drawn up;\n(xi)       the determination and payment of dividend and transfer of profits to reserves;\n(xii)      the preparation and transmission of returns to the Registrar of Joint Stock\nCompanies and to the 1[Federal Government];\n(xiii) the evidentiary value, form, issue and renewal of certificates of shares;\n(xiv)      the calls on shares, the payment of such calls, joint and several liabilities of\nshareholders respect of such calls, the Bank's lien on the manner of its\nenforcement, the application of proceeds of sale;\n1\nSubs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 6, for “Central Government”.\n2\nThe word “other” omitted by the National Bank of Pakistan Ordinance (Amdt.) Act, 1953 (29 of 1953), s. 5.\n3\nIns. ibid.\n4\nIns. by the National Bank of Pakistan Oridnance (Amdt.) Act, 1953 (29 of 1953), s. 5.\n(xv)   the manner in which and the conditions subject to which shares may be\nallotted, held, transferred and transmitted and generally all matters relating to\nthe rights and duties of shareholders;\n(xvi) the manner in which general and special meetings shall be convened and held,\nthe quorum thereat, the procedure to be followed at such meetings, the manner\nin which votes may be exercised and the appointment and election of\nChairmen of such meetings;\n(xvii) the manner in which local and special local meetings shall be convened and\nheld, the quorum thereat, the procedure to be followed at such meetings, the\nmanner in which votes may be exercised and the appointment and election of\nChairmen of such meetings;\n(xviii) the powers exercisable by local and special local meetings;\n(xix)   the holding and conduct of elections under this Ordinance;\n(xx)    the final decisions on doubts and of disputes regarding the qualifications of\ncandidates, or the validity of elections;\n(xxi)   the manner in which meetings of the Central and Local Boards shall be\nconvened and held, their quorum, the procedure to be followed at such\nmeetings, votes of Directors, Members and ex officio Members and the\nmanner in which they may be exercised, and the appointment or and election\nof Chairmen of such Boards;\n(xxii) the effect of vacancies in the Central or Local Boards and of subsequent\ndiscovery of disqualifications of a Director or Member;\n(xxiii) the obligations and immunities of Directors and Members and their\nremuneration, if any;\n(xxiv) the distribution of business amongst the Directors and Member, and their\nremuneration, if any;\n(xxv) the powers of the Local Boards and the limits within which they shall\nexercise such powers;\n(xxvi) the delegation of any powers of the Central or Local Boards to committees\nconsisting of Directors or Members, as the case may be, and the conduct of\nbusiness in such committees;\n(xxvii) the establishment and discontinuance of branches and agencies in Pakistan or\nelsewhere and the nature and extent of the business any branch or agency may\ntransact;\n(xxviii) the recruitment of officers and staff of the Bank including the terms and\nconditions of their service, and the constitution and management of staff and\nsuperannuation funds for the officers and servants of the Bank;\n(xxix) the authority to draw, accept, endorse and execute documents on behalf of the\nBank;\n(xxx) the provision of common and official seals of the Bank and the manner and\neffect of their use;\n(xxxi) the manner and form in which contracts binding on the Bank may be executed;\n(xxxii) the conduct 1[, institution] and defence of legal proceedings and the manner of\nsigning pleadings;\n(xxxiii) the addresses of shareholders and the issue and service of notices;\n(xxxiv) the service of notice on the Bank; and\n(xxxv) generally, for the efficient conduct of the business, discharge of functions and\nmanagement of the Bank."
    }
  ],
  "definitions": []
}
