{
  "id": "pk-national-college-of-arts-ordinance-1985",
  "type": "statute",
  "title": "National College of Arts Ordinance, 1985",
  "title_en": "National College of Arts Ordinance, 1985",
  "short_name": "NCOAO",
  "status": "in_force",
  "issued_date": "1985-03-30",
  "in_force_date": "1985-03-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-b5uW-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National College of Arts Ordinance, 1985 (XXVIII of 1985) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Removal of difficulties",
      "content": "ORDINANCE XXVIII OF 1985\n[31st March, 1985]\nAn Ordinance to confer on the National College of Arts, Lahore, the power to award degrees.\nWHEREAS it is expedient to confer on the National College of Arts, Lahore, the power to\naward degrees and to provide for matters connected therewith or ancillary thereto;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary to\ntake immediate action ;\nNOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, and in\nexercise of all powers enabling him in that behalf, the President is pleased to make and promulgate\nthe following Ordinance:___"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement.",
      "content": "_ (1) This Ordinance may be called the National College\nof Arts Ordinance, 1985.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.",
      "content": "_In this Ordinance, unless there is anything repugnant in the subject or\ncontext, ___\n(a)     “Board” means the Board of Governors of the College;\n(b)     “Chairman” means Chairman of the Board;\n(c)     “College” means the National College of Arts, Lahore, established by the late\nGovernment of West Pakistan under letter No. C-II-26/58, dated the 14th\nOctober, 1958;\n(d)     “Commission” means the University Grants Commission;\n(e)     “Controlling Authority” means the Controlling Authority of the College ;\n(f)     “Member” means member of the Board ;\n(g)     “Patron” means the President of the Islamic Republic of Pakistan ;\n(h)     “prescribed” means prescribed by Regulations or Rules made under this\nOrdinance ; and\n(i)     “Principal” means Principal of the College."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the College.",
      "content": "_The National College of Arts Lahore as reconstituted in\naccordance with the provisions of this Ordinance shall be a body corporate having perpetual\nsuccession and a common seal with power to acquire, hold and dispose of property, both movable\nand immovable, and shall by the said name sue and be sued."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. The purpose, powers and functions of the College.",
      "content": "_(1) The purpose of the College\nshall be to provide for instruction, training, research, demonstration and service in the fields of arts\nand allied disciplines at the under-graduate, graduate and post graduate levels.\n(2) The College shall, under prescribed conditions, perform academic functions to achieve its\nobjectives, in particular, to___\n(a)     admit and examine students ;\n(b)     award degrees, diplomas, certificates and other academic distinction;\n(c)     select, appoint and promote academic and administrative staff;\n(d)     frame and prescribe courses of study ;\n(e)     pursue research ;\n(f)     establish and support other sites and facilities for educations, training and\nresearch;\n(g)     affiliate or associate itself with other institutions for better discharge of its\nfunctions and responsibilities;\n(h)     decide teaching methods and strategies in order to ensure the most effective\neducational and other programmes ; and\n(i)     undertake such other activities as would ensure effective and efficient\noperation of the College."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Teaching and Examinations.",
      "content": "__(1) All academic programmers of the college shall be\nconducted in the prescribed manner and the Commission shall ensure that the courses of study, the\ncurriculum, and the practical work at the college are comparable in standard with other similar\ninstitutions.\n(2) The college shall associate external examiners in the conduct of its examinations.\n(3) No degree shall be granted unless a student has passed an examination in Islamic and\nPakistan Studies, or, in the case of a non-Muslim student, in Ethics and Pakistan Studies."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Patron.",
      "content": "_The President of the Islamic Republic of Pakistan shall be the Patron of the\nCollege."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. The Controlling Authority.",
      "content": "_(1) The Federal Minister for Education shall be the\nControlling Authority of the College.\n(2) The Controlling Authority shall preside at the Convocation and when present at the\nmeetings of the Board or Committees.\n(3) If the Controlling Authority is satisfied that the proceedings of the Board or Committees\nare not in accordance with the provisions of this Ordinance, the Regulations and the Rules, it may\nannul such proceedings."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Visitation.",
      "content": "_(1) The Controlling Authority may cause an inspection or inquiry to be made\nin respect of any matter connected with the affairs of the College and shall, from time to time, direct\nthe Commission to carry out, or appoint such person or persons as it may deem fit for the purpose of\ncarrying out, inspection of :__\n(i)     the College, its buildings, laboratories, library and other facilities ;\n(ii)    any department or teaching unit or hostel maintained by the College ;\n(iii)   the instruction, training, research, curriculum, examinations and overall\nperformance, of the College;\n(iv)    such other matters as the Controlling Authority may determine.\n(2) The Controlling Authority shall communicate to the Board its views with regard to the\nresult of the inspection or the inquiry and, after ascertaining the views of the Board, advise the Board\nas to the action to be taken by it.\n(3) Where the Board does not take action within a specified time, to the satisfaction of the\nControlling Authority, the Controlling Authority may issue such directions as it may deem fit to the\nPrincipal who shall comply with all such directions."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. The Principal.",
      "content": "_(1) The Principal shall be appointed by the Controlling Authority in\nconsultation with the Chairman, on such terms and conditions as may be determined by the\nControlling Authority.\n(2) The Principal shall hold office during the pleasure of the Controlling Authority for a term\nnot exceeding four years, and shall be eligible for re-appointment.\n(3) The Principal shall be the academic and executive head of the College and shall be\nresponsible to the Board for carrying out the day to day administration of the College.\n(4) The Principal shall perform such other functions and exercise such powers as may be\nassigned to him by the Chairman.\n(5) The Principal shall ensure that the provisions of this Ordinance and the Regulations and\nRules framed thereunder are faithfully complied with by the College."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Board of Governors.",
      "content": "_(1) There shall be a Board of Governors consisting of the\nfollowing:\n(i)     Chairman,\nUniversity Grants Commission,\nIslamabad.\n(ii)    Secretary, Ministry of Education,\nGovernment of Pakistan,\nor his nominee not below\nthe rank of a Joint Educational\nAdviser.\n(iii)   Vice-Chancellor,\nUniversity of the Punjab.\n(iv)    Vice-Chancellor,\nUniversity of Engineering\nand Technology, Lahore.\n(v)     One Judge of the Lahore High Court to be nominated\nby the Chief Justice of the Court.\n(vi)    Principal,\nPakistan Administrative Staff College,\nLahore.\n(vii)   Secretary Education,\nGovernment of the Punjab,\nLahore.\n(viii) Chairman,\nPakistan Television Corporation,\nIslamabad.\n(ix)    Outstanding professionals, one\neach in the fields of Architecture,\nCommercial Design and Fine Arts,\nto be nominated by the Controlling\nAuthority.\n(x)     One outstanding industrialist to\nbe nominated by the Controlling\nAuthority.\n(xi)    Two distinguished Educationists\nto be nominated by the Chairman.\n(xii)   One outstanding alumnus to be\nnominated by the Chairman.\n(xiii) Secretary, Ministry of Finance,\nGovernment of Pakistan,\nor, if nominated by him, Financial Adviser\nto the Ministry of Education,\nIslamabad.\n(xiv)   Two distinguished citizens to\nbe nominated by the Controlling\nAuthority.\n(xv)    Two eminent women representatives\nto be nominated by the\nControlling Authority.\n(xvi)   Principal Member/Secretary.\n(2) Members other than ex-officio member shall hold office for two years.\n(3) The quorum for a meeting of the Board shall be one half of the total number of members,\na fraction being counted as one."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Powers and functions of the Board.",
      "content": "_(1) The Board shall be the principal executive\nbody of the College, and shall, subject to the provisions of this Ordinance and the Rules and\nRegulations made thereunder, exercise general supervision over the affairs of the College.\n(2) In particular and without prejudice to the generality of the foregoing provisions, the Board\nshall have the power :__\n(i)     to conduct teaching and research in arts and allied or auxiliary disciplines at\nthe Bachelor and higher levels ;\n(ii)    to prescribe courses of studies and curricula ;\n(iii)   to hold examinations through external evaluation and grant degrees, diplomas,\ncertificates and other academic distinctions ;\n(iv)    to create, suspend or abolish such posts for teaching, research, administration\nand other related matters as may be necessary ;\n(v)     to prescribe the terms and conditions of service of teaching and non-teaching\nstaff including their qualifications, experience and eligibility for appointment,\nand to appoint, confirm, suspend, remove, dismiss or take disciplinary action\nagainst the staff ;\n(vi)    to institute fellowships, scholarships, medals and prizes ;\n(vii)   to devise and adopt ways and means for the promotion of education and\nresearch in arts and related subjects ;\n(viii) to hold, control and administer the property and funds of the College ;\n(ix)    to consider and approve the annual report and the annual and revised budget\nestimates of the college and re-appropriate funds from one head of expenditure\nto another ;\n(x)     to enter into, vary, carry out and cancel contracts on behalf of the College ;\n(xi)    to invest any money belonging to the College ;\n(xii)   to receive and manage property, grants, bequests, trusts, gifts, donations,\nendowments and other contributions made, to the College ;\n(xiii) to decide about the location of the College and its constituent institutes, if any;\n(xiv)   to regulate the conduct and enforce discipline among the teachers and students\nof the College;\n(xv)    to govern, maintain, regulate and operate the finances, accounts and\ninvestments of the College ;\n(xvi)   to take all steps necessary for the proper and efficient functioning of the\nCollege ; and\n(xvii) to perform such other functions as may be necessary for the advancement of\narts in the country.\n(3) The meetings of the Board shall be presided at by the Chairman or, in his absence by one\nof the members to be elected by the members present.\n(4) The quorum for a meeting of the Board shall not be less than half of its members.\n(5) The Board may for speedy and efficient working of the College delegate to the Principal\nor a Committee or a Sub-Committee or any other person such of its powers as it may deem fit."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Chairman of the Board.",
      "content": "_(1) The Chairman of University Grants Commission shall be\nthe Chairman of the Board.\n(2) The Chairman shall ensure that the provisions of this Ordinance, the Regulations and\nRules are faithfully observed in the College.\n(3) The Chairman shall perform such other functions as may be entrusted to him by the Board\nor the Controlling Authority."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Committees.",
      "content": "_(1) There shall be the following Committees of the College, namely:_\n(i)     the Executive Committee ;\n(ii)    she Academic Committee;\n(iii)   the Selection Committee ;\n(iv)    the Finance and Planning Committee ; and\n(v)     such other Committees as may be constituted by the Board.\n(2) The decisions of the Executive, Finance and Selection Committee shall be subject to the\napproval of the Board.\n(3) The constitution, functions and powers of the Committees shall be such as may be\nprescribed."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Regulations.",
      "content": "_(1) Subject to the provisions of this Ordinance, Regulations may be made\nby the Board with the approval of the Controlling Authority to regulate all or any of the following\nmatters, namely : ___\n(a)    the constitution of pension, insurance, gratuity, provident fund and benevolent\nfund for College employees ;\n(b)    the scales of pay and other terms and conditions of service of officers, teachers\nand other employees of the college ;\n(c)    the establishment of Departments ;\n(d)    the conditions under which the College may enter into arrangements with\nother institutions or with public bodies for purposes of research, consultancy\nand advisory services ;\n(e)    the general scheme of studies, including the duration of courses and the\nnumber of subjects or pacers for an examination ;\n(f)    the conduct of examination ;\n(g)    the formation of Institutes and Boards of Studies ;\n(h)    the constitution, functions and powers of the Committees ; and\n(i)    all other matters which are to be or may be prescribed by Regulations.\n(2) The draft of Regulations shall be proposed by the Board to the Controlling Authority who\nmay approve it, or refer it back to the Board for reconsideration or may reject it."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. First Regulations.",
      "content": "_Notwithstanding anything contained in section 14 the Regulations\nset out in the Schedule shall be deemed to be Regulations framed under the said section and shall\nremain in force until they are amended or replaced by new Regulations framed in accordance with\nthis Ordinance."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Rules.",
      "content": "_(1) The Board and other bodies of the College may make Rules consistent with\nthis Ordinance and the Regulations to regulate the conduct of their business and the time and place of\nmeetings and related matters:\nProvided that the Board may direct the amendment or the annulment of any Rules made by\nanother body under this section:\nProvided further that, if such other body is dissatisfied with such direction, it may appeal to\nthe Controlling Authority whose decision in the matter shall be final.\n(2) The Board may make Rules to regulate any matter relating to the affairs of the College\nparticularly on the following:\n(a)    the powers and duties of officers and teachers ;\n(b)     the courses of study for degrees, diplomas and certificates of the College ;\n(c)     the manner in which the recognised teaching referred to in sub-section (1) of\nsection 4 shall be organised and conducted ;\n(d)     the admission of students to the College ;\n(e)     fees and other charges to be paid by the students for admission to the courses\nof study and the examinations of the College ;\n(f )    the conduct and discipline of students of the College ;\n(g)     conditions of residence of the students of the College including the levying of\nfees for residence in halls of residence and hostels ;\n(h)     the institution of stipends and free and half-free studentships ;\n(i)     the academic costume."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Fund of the College.",
      "content": "_The College shall have a fund to which shall be credited:\n(i)     grants made by the Federal Government ;\n(ii)    contribution and donations from individuals, local bodies, corporations,\ninstitutions, organisations and agencies ; and\n(iii)   income from fees, publications and such other sources as may be approved by\nthe Board."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Audit and accounts.",
      "content": "_(1) The accounts of the College shall be maintained in the\nprescribed form and manner and shall be audited annually by an auditor appointed by the Accountant\nGeneral, Pakistan Revenue.\n(2) No expenditure shall be made from the funds of the College unless a bill for its payment\nhas been audited by the Audit Officer of the College in accordance with the rules made under this\nOrdinance.\n(3) The College shall furnish to the Federal Government each year a report on annual audited\naccounts, a report on the activities of the College during the preceding year and such information\nrelating to its activities as may be asked for by the Federal Government."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Transfer of assets and liabilities, etc.",
      "content": "_Upon the commencement of this Ordinance,__\n(i)     everything done, action taken, obligations and liabilities incurred, persons\nappointed or authorised, fellowships or scholarships instituted and orders\nissued prior to such commencement shall be continued and, so far as may be,\nbe deemed to have been respectively done, taken, incurred, appointed or\nauthorised, instituted or issued by the College.\n(ii)    all moneys and properties held by the College immediately before such\ncommencement shall stand transferred to, and vest in, the College ; and\n(iii)   any rules made by the College shall, in so far as they are not inconsistent with\nrepealed, rescinded or modified under this Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Board of Governors of the College;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "Chairman of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "College",
      "definition": "the National College of Arts, Lahore, established by the late Government of West Pakistan under letter No. C-II-26/58, dated the 14th October, 1958;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the University Grants Commission;",
      "source_provision": "sec2"
    },
    {
      "term": "Controlling Authority",
      "definition": "the Controlling Authority of the College ;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "member of the Board ;",
      "source_provision": "sec2"
    },
    {
      "term": "Patron",
      "definition": "the President of the Islamic Republic of Pakistan ;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by Regulations or Rules made under this Ordinance ; and",
      "source_provision": "sec2"
    },
    {
      "term": "Principal",
      "definition": "Principal of the College.",
      "source_provision": "sec2"
    }
  ]
}
