{
  "id": "pk-national-commission-for-human-development-ordinance-2002",
  "type": "statute",
  "title": "National Commission For Human Development Ordinance, 2002",
  "title_en": "National Commission For Human Development Ordinance, 2002",
  "short_name": "NCFHD",
  "status": "in_force",
  "issued_date": "2002-07-18",
  "in_force_date": "2002-07-18",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Frbp0%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Commission For Human Development Ordinance, 2002 (XXIX of 2002) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Removal of Difficulties",
      "content": "ORDINANCE XXIX OF 2002\nAn\nOrdinance\nto provide for the establishment of National Commission for Human Development\nWHEREAS it is expedient to establish a National Commission for Human Development to\nimplement various programmes and projects in the social sector in collaboration with philanthropists;\nAND WHEREAS the objective of the National Commission for Human Development is to\npromote Human Development by supporting Government line departments, non-Governmental\nOrganizations and elected officials at the district level in primary education literacy, income\ngenerating activities and basic health care service etc;\nAND WHEREAS the President is satisfied that circumstances exist which render necessary to\ntake immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the Fourteenth lay\nof October, 1999, and the Provisional Constitution Order No.1 of 1999, read with the Provisional\nConstitutional (Amendment) Order No.9 of 1999, and in exercise of all power, enabling him in that\nbehalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the\nfollowing Ordinance."
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extend and commencement",
      "content": "(1) This Ordinance may be called the National\nCommission for Human Development Ordinance, 2002.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Ordinance, unless there is anything repugnant in the subject or\ncontext,—\n(a)     “Chairman” means the Chairman of the Commission;\n(b)     “Commission”     means    the    National       Commission       for   Human\nDevelopment establishment under section 3;\n(c)     “Director-General” means the principal staff officer and in-charge of\ngeneral Administration of the Commission;\n(d)     “Fund” means the Pakistan Human Development Fund registered under\nthe companies Ordinance 1984 (XLVII of 1984);\n(e)     “Member” means a member of the Commission;\n(f)     “Prescribed” means prescribed by rules made under this Ordinance;\n(g)     “President” means President of the Islamic Republic of Pakistan;\n(h)     “Regulations” means the regulations made under this Ordinance;\n(i)    “Rules” means the rules made under this Ordinance; and\n(j)    “staff' means the members of staff of the Commission and includes persons on\ndeputation or employed on contract."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Commission",
      "content": "(1) There shall be established a National\nCommission for Human Development for carrying out the purposes of this Ordinance.\n(2) The Commission shall be a body corporate having perpetual succession and a common seal\nwith powers, subject to the provisions of this Ordinance, to enter into agreements, contracts, acquire\nand hold property, both moveable and immovable, and to sue and be sued in its name.\n(3) The President shall be the Patron-in-Chief of the Commission.\n(4) The Commission shall comprise the Chairman, to be appointed by the President, and\nfive Members, including a representative of Ministry of Finance, to he appointed by the President on\nthe recommendation of the Chairman:\nProvided that Provincial representation and gender equality will be ensured amongst the\nMembers.\n(5) The main office of the Commission shall be at Islamabad and the Commission may set-\nup sub-offices at such place or places as it may deem necessary.\n(6) The Commission shall be an autonomous body of the Cabinet Division, Government of\nPakistan."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Chairman of the Commission",
      "content": "(1) The Chairman shall be an eminent professional of\nknown integrity, reputation, competence, and expertise in the social sector.\n(2) The Chairman shall hold office for a period of five years.\n(3) The Chairman may resign his office by writing under his hand addressed to the President.\n(4) The Chairman shall be the Chief Executive Officer of the Commission."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Members of the Commission",
      "content": "(1) The Members of the commission shall be professionals\nof known integrity and experience in the social sector.\n(2) A Member shall hold office during the pleasure of the President.\n(3) A Member may resign his office by writing in his hand addressed to the Chairman.\n(4) The business of the Commission shall be conducted as prescribed."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Terms and conditions of office of Chairman and Members",
      "content": "The terms and conditions\nof the Chairman and Members and their remuneration and privileges shall be such as may be\ndetermined by the President."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Functions of the Commission",
      "content": "The functions of the Commission shall be to—\n(a)    formulate, approve manage, promote, enhance, implement, execute monitor\nand organize its support programmes and projects fur assistance of the line\nMinistries, Departments and agencies concerned, inter alia, for-\n(i)     capacity building, training, and enhancement of competency of\nGovernmental functionaries and line departments, and non--\ngovemmental organizations working in the social sectors, specially\nunder District Governments;\n(ii)    literacy and non-formal basic education programmes supported by\nskills training programmes for income generating activities;\n(iii)   programmes to assist in universal primary education;\n(iv)    programmes to assist in primary health-care;\n(v)     programmes to assist in alleviation of poverty;\n(vi)    national volunteer programme to assist in the social sectors.\n(b)     undertake research, studies and surveys to assess the needs an requirements of\nan area for extending scope of its activities and disseminate information in\nrespect thereof;\n(c)    keep informed the Federal Government and respective Provincial\nGovernments and their District Administration of its programme and projects\nbeing carried out by it in performance of its functions;\n(d)    global resource mobilization including finances, intellectual expertise and talent\nto assist in the social sectors; and'\n(e)    perform such other functions as may be incidental or ancillary to the execution\nof its programmes and projects."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Policy Guidelines",
      "content": "(1) The Commission may for the implementation and execution of its\nprogrammes and projects pursuant to its aims and objectives, issue Policy Guidelines for the\nCommission.\n(2) Without prejudice to the generality of the provisions of sub-section (1), the Policy\nGuidelines shall lay down parameters for:—\n(a)    alleviation of poverty;\n(b)    non-formal basic education and promotion of literacy;\n(c)    primary health care;\n(d)    sustainable livelihood; and\n(e)     capacity building, training, and enhancement of competency of Governmental\nagencies and non-government organizations working in the social sector,\nespecially under District Governments.\n(3) The advice of the Advisory Council shall be given due consideration by the Commission."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Advisory Council",
      "content": "(1) There shall be an Advisory Council of the Commission consisting\nof—\n(a)    the Chairman who shall act as its Convener;\n(b)    representatives from civil society, community based organizations an such other\npersons as are approved by the Commission;\n(c)     one representative each of :-\n(i)      the Ministry of Education, Government of Pakistan;\n(ii)     the Ministry of Health, Government of Pakistan;\n(iii)    the Ministry of Finance, Government of Pakistan;\n(iv)     Ministry of Environment, Local             Government      and    Rural\nDevelopment Government of Pakistan;\n(v)      the Government of Balochistan Government of North west Frontier\nProvince, Government of Sindh, and Government of the Punjab;\n(vi)     States and Frontier Regions Division, Government of Pakistan;\n(vii)    the Ministry of Women Development, Social Welfare and Special\nEducation; Government of Pakistan;\n(viii)   Planning Commission;\n(ix)     National Reconstruction Bureau of Pakistan.\n(2) The functions of the Advisory Council shall be—\n(a)     to render assistance and advice in improvement of the Policy Guidelines of the\nCommission; and\n(b)     to make recommendations         for augmenting    financial   resources   of the\nCommission.\n(3) The Advisory Council shall meet at least once in every quarter and may hold its meetings\nas and when necessary.\n(4) The Advisory Council may invite any technical expert or person possessing specialized\nknowledge on related subjects for assistance in performance of its functions.\n(5) The Advisory Council shall make rules of procedure and conduct of its business."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Director General",
      "content": "(1) The Chairman may appoint, as prescribed, a person of known\nintegrity, and experience in the field of administration and management as Director General, who\nshall be the principal staff officer of the commission.\n(2) The Director General shall be responsible for—\n(a)     the administration and day to day business of the Commission;\n(b)     the execution of all orders and directions given by the Chairman;\n(c)     the preparation of periodical reports, for submission to the President by the\nChairman;\n(d)     coordinate the monitoring of the work for the Commission down to the level of\neach district and tehsil; and\n(e)     any other duty or assignment given by the Chairman.\n(3) In addition to the responsibilities specified in sub-section (1) the Chairman may assign any\nother function or assignment to the Director General.\n(4) The Director General shall be entitled to such remuneration and privileges as the\nCommission may determine.\n(5) The Director General may resign his office in writing addressed to the Chairman."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Committees of the Commission",
      "content": "(1) The Commission may, for carrying out its\nfunctions, constitute such committees as may be considered appropriate by the Commission.\n(2) The membership of a Committee and conduct of business thereof shall be such as may be\nprescribed."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Remuneration of officers and staff of the Commission",
      "content": "(1) The Commission shall, by\nregulations, determine the terms and conditions of, including salaries, allowances and other benefits\nfor officers and staff commensurate with the economic condition of the country and compatible with\nother such organizations, including private sector.\n(2) The regulations referred to in sub-section (1) shall include the procedure it inquires and\ndisciplinary action to be taken in result thereof against any employee of the Commission\nProvided that any person in the service of Pakistan employed in the Commission\nwhether on deputation or on transfer, shall be governed by the service rules and regulations applicable\nto him before his appointment in the Commission."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Employment of advisors, consultants, etc",
      "content": "(1) Subject to subsection (1) of section\n12 and sub-section (2), the Commission may appoint any professional, adviser, consultant, expert\nor such other person as may be considered necessary for performance of its functions.\n(2) The appointment of the persons referred to in sub-section (1) shall be made in accordance\nwith the requirements of the Policy Guidelines of the Commission:\nProvided that the terms and conditions of appointment of such persons, including tenure,\nshall be determined by the Commission."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. The Budget of the Commission, etc",
      "content": "(1) The budget of the Commission shall be met out\nof the Fund for the implementation and execution of the programmes and projects of the Commission\nand fulfillment of its objectives.\n(2) The Director General with the approval of the Chairman shall prepare and submit the annual\nplan of the budget of the Commission to the Fund.\n(3) The Commission shall, three months before the commencement of a financial year review\nits budget position and if there are some additional requirement, the same shall be met through re-\nappropriation by the Commission or as the case may be by fresh allocation by the Fund, in case there\nare some savings, the same shall be surrendered to the Fund by 15th of June.\n(4) The Commission may maintain bank accounts in scheduled banks as it may determine.\n(5) The Chairman shall be the Principal Accounting Officer of the Commission."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Expenditure of the Commission",
      "content": "(1) All programmes, projects, operations and schemes\nof the, Commission shall be met and executed from the budget of the Commission referred to in section"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Delegation of powers",
      "content": "(1) The Commission may delegate all or any of its powers and\nfunctions to the Chairman or such other officer of the Commission, subject to such conditions and\nlimitations, as it may deem appropriate.\n(2) The Chairman or the Director General may delegate all or any of their powers and functions\nunder this Ordinance to any officer of the Commission, subject to such conditions and limitations, as\nhe may deem fit."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Audit and accounts",
      "content": "(1) The accounts of the Commission shall be audited by a reputable\nfirm of Chartered Accountants to be appointed by the Commission on such remuneration as it may\ndetermine.\n(2) The auditors appointed under sub-section (1) shall be provided access to the books, accounts\nand other documents as may be considered necessary by them for audit of the accounts of the\nCommission and may examine any Member, officer or member of the staff of the Commission in\nconnection with such audit.\n(3) The auditors shall submit periodical reports to the Commission after audit of the accounts."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Annual and other reports",
      "content": "(1) Within three months of the conclusion of each calendar\nyear, the Chairman shall submit an annual report to the President in respect of activities of the\nCommission including the status of its existing programmes, projects and future plans formulated\nin furtherance of its aims and objects.\n(2) In addition to the annual report referred to in sub-section (1), the Chairman shall, from time\nto time, place before the President such other reports relating to the performance of the Commission\nor whenever so directed by the President."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Rules",
      "content": "(1) The Commission may, with the approval of the President, lake rules to carry\nout the purposes of this Ordinance.\n(2) Without prejudice to the generality of the forgoing provision, the rules referred to therein\nmay provide for—\n(a)    Policy Guidelines for setting up of District Human Development Centres for the\npurpose of—\n(i)     strengthening competence of line department officials;\n(ii)    support to elected representatives with required skills;\n(iii)   facilitate change management;\n(iv)    coordinate the work of stake holders; and\n(v)     capacity building of non-government organizations;\n(b)     procedure of appointment of members of the different committees and\nlaying down rules for conduct of their business."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Regulations",
      "content": "(1) The Commission may make regulations not consistent with-this\nOrdinance and the rules to carry out the purposes of this Ordinance.\n(2) Without prejudice to the generality of the forgoing provisions regulations referred to therein\nmay provide for—\n(a)     the determination of salaries and allowances and other benefits of the\nmembers of the staff of the Commission;\n(b)     disciplinary proceedings and award of punishment,\n(c)     prescription of different scales and grades etc. for and privileges of officers and\nstaff of the Commission; and\n(d)     all or any of the matters, which by this Ordinance, are to be, or may be,\nprescribed."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Authorities to aid the Commission",
      "content": "(1) All executive authorities in the\nFederation and in the Provinces shall render such assistance to the Commission as may be necessary\nfor execution of its programmes and projects being carried out under this Ordinance."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Immunity of the Commission",
      "content": "No suit, prosecution or other legal proceeding shall lie\nagainst the Commission, the Chairman, Members, officers, advisors, consultants and other\npersons and employees of the Commission in respect of anything done or intended to be done in\ngood faith under this Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "Chairman",
      "definition": "the Chairman of the Commission;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the National Commission for Human Development establishment under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Director-General",
      "definition": "the principal staff officer and in-charge of general Administration of the Commission;",
      "source_provision": "sec2"
    },
    {
      "term": "Fund",
      "definition": "the Pakistan Human Development Fund registered under the companies Ordinance 1984 (XLVII of 1984);",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "a member of the Commission;",
      "source_provision": "sec2"
    },
    {
      "term": "Prescribed",
      "definition": "prescribed by rules made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "President",
      "definition": "President of the Islamic Republic of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "Regulations",
      "definition": "the regulations made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "Rules",
      "definition": "the rules made under this Ordinance; and",
      "source_provision": "sec2"
    },
    {
      "term": "staff",
      "definition": "the members of staff of the Commission and includes persons on deputation or employed on contract.",
      "source_provision": "sec2"
    }
  ]
}
