{
  "id": "pk-national-commission-for-human-rights-act-2012",
  "type": "statute",
  "title": "National Commission for Human Rights Act, 2012",
  "title_en": "National Commission for Human Rights Act, 2012",
  "short_name": "NCFHR",
  "status": "in_force",
  "issued_date": "2012-06-04",
  "in_force_date": "2012-06-04",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5lrbA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Commission for Human Rights Act, 2012 (XVI of 2012) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the National\nCommission for Human rights Act, 2012.\n(2) It extends to the whole of Pakistan except Chapter V which shall extend to the Islamabad\nCapital Territory.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(a)        “armed forces” means army, navy, air force and all other civil armed forces\nincluding military intelligence agencies;\n(b)        “Chairperson” means the Chairperson of the Commission, as appointed under\nsection 4;\n(c)        “Commission” means National Commission for Human Rights constituted\nunder section 3;\n1\n[(ca) \"Division concerned\" means the Division to which business of this Act stands\nallocated;]\n(d)        “human rights” means the rights relating to life, liberty and dignity of the\nindividual guaranteed and included in the international instruments including\npolitical and women rights;\n1Ins. by Act No. VII of 2026, s.2\n(e)        “member” means a member of the Commission and includes the Chairperson;\n(f)        “prescribed” means prescribed by rules made under this Act; and\n(g)        “public servant” means a public servant defined under section 21 of the\nPakistan Penal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of Commission",
      "content": "(1) The Federal Government shall constitute a\nCommission to be known as the National Commission for Human Rights to exercise the powers and\nperform the functions under this Act.\n(2) The Commission shall consist of —\n(a)        a Chairperson, who has been, or is qualified to be, a judge of the Supreme\nCourt or a person having demonstrable knowledge of, or practical experience\nin, matters relating to human rights;\n(b)        one member from each Province 1[****] and Islamabad Capital Territory\nhaving demonstrable knowledge of, or practical experience in, matters relating\nto human rights;\n(c)        Chairperson of the National Commission on Status of Women;\n(d)        one member from minority communities; and\n(e)        a Secretary, who shall be appointed by the Commission:\nProvided that of the total membership of the Commission, at-least two\nshall be women members.\n(3) A member shall not be less than forty years of age and shall have knowledge and\nexperience relating to human rights.\n(4) The headquarters of the Commission shall be at Islamabad and it may establish its offices\nat other place or places in Pakistan as it may consider appropriate.\n1Omitted by Act No. VII of 2026, s.3\n(5) The Commission shall be a body corporate having perpetual succession and a common\nseal with powers, among other, to acquire, hold and dispose of any property and shall sue and be\nsued by the said name.\n(6) All members of the Commission shall work on full time basis on prescribed terms and\nconditions and the Chairman on ceasing to hold office shall be inelligible for holding any office of\nprofit in the Government, Federal or Provincial, for a period of two years:\nProvided that it shall not apply to the Chairperson of the National Commission on the Status\nof Women."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Appointment of Chairperson and members",
      "content": "(1) The 1[Division concerned] shall,\nthrough public notice, invite suggestions for suitable persons for appointment as Chairperson and\nmembers of the Commission and, after proper scrutiny, shall submit a list of these persons to the\nPrime Minister and the Leader of the Opposition in the National Assembly.\n(2) The Prime Minister shall in consultation with the Leader of the Opposition in the National\nAssembly forward three names for each post to a Parliamentary Committee for hearing and\nconfirmation of any one person for each post:\nProvided that in case there is no consensus between the Prime Minister and the Leader of the\nOpposition, each shall forward separate lists to the Parliamentary Committee.\n(3) The Parliamentary Committee shall be constituted by the Speaker of the National\nAssembly consisting of the following four members, namely:—\n(a)        two members from the Senate; and\n(b)        two members from the National Assembly:\nProvided that when the National Assembly is dissolved, the total membership of the\nParliamentary Committee shall consist of the members from the Senate only as mentioned in\nparagraph (a) and the provisions of this section shall, mutatis-mutandis, apply:\nProvided further that out of the four members of the Committee, two shall be from the\nTreasury Benches, one from each House and two from the Opposition Benches, one from each\nHouse. The nomination of members from the Treasury Benches shall be made by the Leader of the\nHouse and from the Opposition Benches by the Leader of the Opposition.\n(4) The Parliamentary Committee shall regulate its own procedure.\n(5) The Parliamentary Committee shall forward the names of the nominees confirmed by it to\nthe President, who shall appoint the Chairperson and members accordingly.\n1Subs. by Act No. VII of 2026, s.4"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Term of office of Chairperson and of members",
      "content": "(1) A person appointed as\nChairperson or a member shall hold office for a term of four years from the date on which he enters\nupon his office 1[, however, upon the expiry of the term, the Chairperson shall continue to hold office\ntill the appointment of a new Chairperson]:\nProvided that the term of office may be extended once in the manner provided in section 4.\n(2) The Chairperson or a member may resign from his office in writing under his hand\naddressed to the President and on acceptance of the resignation, such vacancy shall be filled within\nsixty days."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Removal of the Chairperson and members",
      "content": "The Chairman and members may be\nremoved from office on the grounds and in the manner provided for in Article 209 of the\nConstitution of the Islamic Republic of Pakistan."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Acting Chairperson",
      "content": "At any time when the Chairperson is absent or unable to perform\nthe duties of his office for any reason, or in the event of the vacancy in the office of the Chairperson\nby reason of his death, resignation or otherwise, the members of the Commission shall elect an\nActing Chairperson from amongst themselves until the incumbent Chairperson resumes his office, or\nas the case may be, until the appointment of a new Chairperson to fill such vacancy which shall not\nexceed sixty days."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Terms and conditions of service of members including Chairperson",
      "content": "The salaries and\nallowances payable to, and terms and conditions of service of the members, other than ex-officio\nmember, shall be such as may be prescribed by the Federal Government in consultation with the\nCommission:\nProvided that neither the salary and allowances nor the terms and conditions of service of a\nmember shall be varied to his disadvantage after his appointment."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Functions of the Commission",
      "content": "The Commission shall perform all or any of the\nfollowing functions, namely:—\n(a)     suo-moto or on a petition presented to it by a victim or any person on his behalf,\ninquire into complaints of—\n(i)        violation of human rights or abetment thereof; or\n(ii)       negligence in the prevention of such violation, by a public servant;\n1Ins. by Act No. VII of 2026, s.5\n(b)   intervene in any proceeding involving any allegation of violation of human rights\npending before a court by making application for becoming a party to the proceedings\nbefore such court;\n(c)   notwithstanding anything contained in any other law for the time being in force, the\nCommission or any person authorized by it may visit any jail, place of detention or\nany other institution or place under the control of the Government or its agencies,\nwhere convicts, under trial prisoners, detainees or other persons are lodged or\ndetained for purposes of ascertaining the legality of their detention as well as to find\nout whether the provisions of the applicable laws or other provisions relating to the\ninmates living conditions and their other rights are being complied with;\n(d)   review the safeguards provided by or under the Constitution of the Islamic Republic\nof Pakistan or any other law for the time being in force for the protection of human\nrights and recommend adoption of new legislation, the amendment of existing laws\nand the adoption or amendment of administrative measures for their effective\nimplementation:\nProvided that if requested by the Government, the Commission may examine\nany legislation and submit its views thereon and comment on the implication of the\nsame for legislation;\n(e)   review the factors, including acts of terrorism, that inhibit the enjoyment of human\nrights and recommend appropriate remedial measures;\n(f)   study treaties, other international instruments on human rights and reports submitted\nby the Government of Pakistan on them including the comments thereon, to make\nrecommendations for their effective implementation;\n(g)   undertake and promote research in the field of human rights, maintain database on the\ncomplaints on violence of human rights received and development of human rights\nnorms;\n(h)   spread human rights literacy among various sections of society and promote\nawareness of the safeguards available for the protection of these rights through\npublications, print and electronic media, seminars and other available means in all\nmajor languages of the country;\n(i)   direct investigation and inquiry in respect of any incident of violation of human\nrights;\n(j)   submit independent reports to the Government on the state of human rights in\nPakistan for incorporation in reports to United Nations’ bodies or committees;\n(k)   develop a national plan of action for the promotion and protection of human rights;\nand\n(l)    such other functions as it may consider necessary for the promotion of human rights."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Procedure of the Commission",
      "content": "(1) The Commission shall regulate its own procedure.\n(2) All orders and decisions of the Commission shall be authenticated by the Secretary or any\nother officer of the Commission duly authorized by the Chairperson in this behalf.\n(3) The quorum for a meeting of the Commission shall not be less than one-half of the total\nmembership of the Commission.\n(4) The decision of the Commission shall be taken by the majority of its members present\nand, in case of a tie, the member presiding the meeting shall have a casting vote."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Advisory Committee",
      "content": "The Commission may constitute an advisory committee\nconsisting of human rights activists, civil society organizations, members of bar associations,\nmembers of press clubs and such other representatives of the Federal and Provincial Governments as\nmay be concerned with the functions of the Commission:\nProvided that the members of the advisory committee shall perform their functions in an\nhonorary capacity to assist the Commission in their areas of competence and expertise."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Inquiry into complaints",
      "content": "(1) The Commission while inquiring into the complaints of\nviolations of human rights may call for information or report from the Federal Government or a\nProvincial Government or any other authority or organization, subordinate thereto, within such time\nas may be specified by it:\nProvided that if the information or report is not received within the time stipulated by the\nCommission, it may proceed to inquire into the complaint on its own:\nProvided further that in case the complaint relates to areas that are security sensitive, the\nCommission shall obtain a report within fifteen days from the Federal Government and if the report\nis not received within thirty days the Commission may proceed to inquire into complaint on its own:\nProvided also that if on receipt of information or report, the Commission is satisfied either\nthat no further inquiry is required or that the required action has been initiated or taken by the\nconcerned Government or authority, it may not proceed with the complaint and inform the\ncomplainant accordingly.\n(2) Without prejudice to anything contained in sub-section (1), if the Commission considers\nnecessary, having regard to nature of the complaint, it may initiate an inquiry.\n(3) if at any stage of the inquiry, the Commission—\n(a)     considers it necessary to inquire into the conduct of any person; or\n(b)     is of the opinion that the reputation of any person is likely to be prejudicially\naffected by the inquiry,\nit shall give to that person a reasonable opportunity of being heard in the inquiry and to produce\nevidence in his defence:\nProvided that nothing in this section shall apply where the credit of a witness is being\nimpeached."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Powers relating to inquires",
      "content": "(1) The Commission shall, while inquiring into\ncomplaints under this Act, have all the powers of a civil court trying a suit under the Code of Civil\nProcedure, 1908 (Act V of 1908), in respect of the following matters, namely:—\n(a)    summoning and enforcing the attendance of witnesses and examining them on oath;\n(b)    discovery and production of documents;\n(c)    receiving evidence on affidavits;\n(d)    requisitioning any public record or copy thereof from any court or office;\n(e)    issuing commissions for the examination of witnesses or documents; and\n(f)    any other matter which may be prescribed.\n(2) The Commission shall have power to require any person, subject to any privilege which\nmay be claimed by that person under any law for the time being in force, to furnish information on\nsuch points or matters as, in the opinion of the Commission, may be useful for, or relevant to, the\nsubject-matter of the inquiry and any person so required shall be deemed to be legally bound to\nfurnish such information within the meaning of section 176 and section 177 of the Pakistan Penal\nCode (Act XLV of 1860).\n(3) The Commission shall be deemed to be a civil court to the extent that is described in\nsections 175, 178, 179, 180 and 228 of the Pakistan Penal Code, 1860 (Act XLV of 1860). If the\noffence is committed in the view or presence of the Commission, the Commission may, after\nrecording the facts constituting the offence and the statement of the accused as provided for in the\nCode of Criminal Procedure, 1898 (Act V of 1898), forward the case to a Magistrate having\njurisdiction to try the same and the Magistrate to whom any such case is forwarded shall proceed to\nhear the complaint against the accused as if the case has been forwarded to him under section 346 of\n(4) Every proceeding before the Commission shall be deemed to be a judicial proceeding\nwithin the meaning of sections 193, 196 and 228 of the Pakistan Penal Code, 1860 (Act XLV of\n1860).\n(5) The Commission shall be deemed to be a civil court for the purposes of section 195 and\nChapter XXVI of the Code of Criminal Procedure, 1898 (Act V of 1898)."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Procedure with respect to armed forces",
      "content": "(1) Notwithstanding anything contained in\nany other law for the time being in force while dealing with the complaints of human rights\nviolations by the members of the armed forces, the Commission shall adopt the following procedure,\nnamely:—\n(a)       it may either on its own motion or on receipt of a petition, seek a report from the\n1\n[Defence Division] on complaint or violation;\n(b)       after the receipt of the report it may either not proceed with the complaint or, as the\ncase may be, make its recommendations to the 1[Defence Division].\n(2) The Federal Government shall inform the Commission of the action taken on the\naforesaid recommendations within three months or such extended time as the Commission may deem\nappropriate.\n(3) The Commission shall publish its report together with its recommendations made under\nparagraph (b) of sub-section (1) and the action taken by the Federal Government.\n(4) The Commission shall provide a copy of the report published under sub-section (3) to the\npetitioner or his representative."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Procedure with respect to intelligence agencies",
      "content": "(1) Notwithstanding anything\ncontained in this Act, the functions of the Commission do not include inquiring into the act or\npractice of intelligence agencies and where a complaint is made to the Commission alleging that an\nact or practice of such an agency is inconsistent with or contrary to any human right, the Commission\nshall refer the complaint to the competent authority concerned.\n(2) The procedure thereafter shall be the same as in sub-section (1) of section 14 with respect\nto the armed forces."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Independence of the Commission",
      "content": "(1) The Commission and every member of its staff\nshall function without political or other bias or interference and shall, unless this Act expressly\notherwise provides, be independent and separate from any government, administrations, or any other\nfunctionary or body directly or indirectly representing the interests of any such entity.\n1Subs. by Act No. VII of 2026, s.6\n(2) If at any stage during the course of proceedings at any meeting of the Commission, it\nappears that a member has or may have a financial or personal interest which may cause a substantial\nconflict of interests in the performance of his functions as such, the member shall forthwith and fully\ndisclose the nature of his interest and absent himself from that meeting so as to enable the remaining\nmembers to decide whether the member should be precluded from participating in the meeting by\nreason of that interest. Such a disclosure and the decision taken by the remaining members shall be\nentered on the record of the proceedings.\n(3) If a member fails to disclose any conflict of interest as required under sub-section (2) and\nis present at a meeting of the Commission or in any manner participates in the proceedings, such\nproceedings in relation to the relevant matter shall, as soon as such non-disclosure is discovered, be\nreviewed and be varied or set aside by the Commission without the participation of the member\nconcerned and such conduct on the part of the member shall be treated as misconduct."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Investigation",
      "content": "(1)Notwithstanding anything contained in any other law for the time\nbeing in force, the Commission may, for the purpose of conducting an investigation into a matter\nwhich is the subject of a complaint, requisition the services of any officer or investigation agency of\nthe Federal Government or a Provincial Government with their concurrence.\n(2) For the purposes of investigating into any matter which is the subject of a complaint, any\nofficer or agency whose services are requisitioned under sub-section (1) shall, under the direction\nand control of the Commission,—\n(a)     summon and enforce the attendance of any person and examine him;\n(b)     require the discovery and production of any document; and\n(c)     requisition any public record or copy thereof from any office.\n(3) The provisions of section 13 shall apply in relation to any statement made by a person\nbefore any officer or agency whose services are requisitioned under sub-section (1), as they apply in\nrelation to any statement made by a person in the course of giving evidence before the Commission.\n(4) The officer or agency, whose services are requisitioned under sub-section (1), shall\nsubmit a report to the Commission within such period as may be specified.\n(5) The Commission shall consider the report submitted to it under sub-section (4) and, after\nsatisfying itself that the procedure prescribed by or under this Act has been duly observed in the\ninvestigation, may proceed in accordance with the provisions of section 16."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Steps after inquiry",
      "content": "The Commission may take any of the following, amongst other,\nsteps upon the completion of an inquiry held under this Act, namely:—\n(a)     where the inquiry discloses the commission of violation of human rights or negligence\nin the prevention of violation of human rights by a public servant, it may recommend\nto the concerned Government or authority the initiation of proceedings for\nprosecution or such other action as the Commission may deem fit against the\nconcerned person or persons;\n(b)     recommend to the concerned Government or authority for the grant of such immediate\ninterim relief to the victim or the members of his family as the Commission may\nconsider necessary;\n(c)     provide a copy of the inquiry report to the complainant or his representative;\n(d)     the Commission shall send a copy of its inquiry report together with its\nrecommendations to the Government or authority which shall, within a period of one\nmonth or such further time as the Commission may allow, submit its reply indicating\nthe action taken or proposed to be taken to implement the recommendations or\nreasons why these cannot or should not be implemented; and\n(e)     the Commission shall publish its inquiry report together with its recommendations\nand the reply of the Government or authority thereto."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Statement made by persons to the Commission.⸺ No statement made by a person",
      "content": "while giving evidence before the Commission shall subject him to or be used against him in any civil\nor criminal proceeding except prosecution for giving false evidence:\nProvided that where—\n(a)     it is necessary to inquire into the conduct of any person; or\n(b)     the reputation of any person is likely to be prejudicially affected by the inquiry,\nit shall give an opportunity to such person of being heard and to produce evidence in his defence, if\nany."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Commission to preserve identity",
      "content": "Where the Commission considers that the\npreservation of the identity of a person who, has—\n(i)     made a complaint; or\n(ii)    furnished or proposes to furnish information; or\n(iii)   produced or proposes to produce a document; or\n(iv)    given or proposes to give evidence; or\n(v)     made or proposes to make a submission,\nto the Commission or to a person acting for or on behalf of the Commission, is necessary to protect\nthe security of employment, the privacy or any human right of the person, the Commission may give\ndirections prohibiting the disclosure of the identity of the person."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Human Rights Court",
      "content": "For the purposes of speedy trial of offences arising out of\nviolation of human rights, the 1[Law and Justice Division] may, in consultation with Chief Justice of\nIslamabad High Court, by notification in the official Gazette, specify a Court of Sessions to be the\nHuman Rights Court for that District to try such offences:\nProvided that nothing in this section shall apply, if—\n(a)        a Court of Sessions is already specified as a special court; or\n(b)        a special court is already constituted,\nfor such offences under any other law for the time being in force."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Special prosecutors",
      "content": "The 1[Law and Justice Division], on the advice of the\nCommission, shall, by notification in the official Gazette, appoint an advocate from the list prepared\nby the Commission, who has been practicing as an advocate for not less than seven years, to be the\nspecial prosecutor for the purposes of conducting cases in that Court."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Fund of the Commission",
      "content": "(1) There shall be established a fund to be known as the\nNational Commission for Human Rights Fund which shall vest in the Commission and shall be used\nby the Commission to meet the charges in connection with its functions under this Act.\n(2) Source of the Fund shall amongst other monies be the following, namely:—\n(a)       such sums as the Federal Government shall, after due appropriation made by the\nMajlis-e-Shoora (Parliament) by law in this behalf, pay to the Commission by any of\ngrants such sums of money for being utilized for the purposes of this Act;\n(b)        grants and endowments and income therefrom; and\n(c)        all other sums or properties which may in any manner become payable to, or vest in,\nthe Commission in respect of any matter.\n(3) The Commission, while performing its functions and exercising its powers under this Act,\nshall exercise highest sense of prudence as far as expenditures are concerned.\n1Subs. by Act No. VII of 2026, ss.7-8."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Expenditure to be charged on the Fund",
      "content": "The Fund shall be expended for the purposes\nof —\n(a)     paying any expenditure lawfully incurred by the Commission, relating to\nremuneration of its members, employees, advisors and consultants of the Commission\nincluding legal fees and costs as well as other fees and costs;\n(b)     paying any other expenses, costs or expenditure properly incurred or accepted by the\nCommission in the performance of its functions or in the exercise of its powers under\nthis Act;\n(c)     purchasing or hiring equipment, machinery and any other work and undertakings in\nthe performance of its functions or in the exercise of its powers-under this Act;\n(d)     repaying any financial accommodation received; and\n(e)     generally, paying any expenses for carrying into effect the provisions of this Act."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Power to obtain finances and receive grants",
      "content": "The Commission may, from time to\ntime, obtain and receive unconditional grants or contributions from donors and non-governmental\norganizations in a transparent manner. No contribution from any foreign source, private or\ngovernmental, shall be acceptable except after the approval of the Federal Government."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Accounts and audit",
      "content": "(1) The Commission shall maintain proper accounts and other\nrelevant records and prepare an annual statement of accounts in such form as may be prescribed by\nthe Federal Government in consultation with the Auditor-General of Pakistan.\n(2) The accounts of the Commission shall be audited by the Auditor-General at such intervals\nas may be specified by him.\n(3) The Auditor-General and any person appointed by him in connection with the audit of the\naccounts of the Commission under this Act shall have the same rights and privileges and the\nauthority in connection with such audit as the Auditor-General generally has in connection with the\naudit of Government’s accounts and in particular shall have the right to demand the production of\nbooks, accounts, connected vouchers and other documents and paper and to inspect any of the offices\nof the Commission.\n(4) The accounts of the Commission, as certified by the Auditor-General or any other person\nappointed by him in this behalf, together with the audit report thereon shall be forwarded annually to\nthe Federal Government by the Commission and the Federal Government shall cause the audit report\nto be laid, as soon as may be after it is received, before each House of Majlis-e-Shoora (Parliament)."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Financial freedom of the Commission",
      "content": "The Government shall allocate specific\namount of money for the Commission in each financial year and it shall not be necessary for the\nCommission to take prior approval from the Government to spend such allocated money for the\napproved and specific purposes."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Annual and special reports of the Commission",
      "content": "(1) The Commission shall prepare an\nannual report at the end of the financial year and may at any time prepare special reports on any\nmatter which in its opinion is of particular urgency or importance.\n(2) The 1[Division concerned] shall cause the annual report and the special reports to be laid\nbefore the Majlis-e-Shoora (Parliament) within ninety and thirty days, respectively, from the date of\ntheir receipt, alongwith a memorandum indicating the action taken or proposed to be taken on the\nrecommendations of the Commission and reasons for non-implementation of the recommendations,\nif any.\n(3) The report shall be placed on the website of the Commission immediately after its lying\nbefore the Majlis-e-Shoora (Parliament) for information of general public."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Appointment of officers and employees",
      "content": "(1) There shall be a Secretary of the\nCommission as appointed under section 3.\n(2) The Commission may, under this Act, appoint such officers and employees or consultants\nas it considers necessary for the efficient performance of its functions.\n(3) Salary, remuneration and other terms and conditions of the services of the officers and\nemployees of the Commission shall be determined by the Commission in consultation with the\n1\n[Divisions concerned].\n(4) The 1[Division concerned] may, on request from the Commission, appoint any officer or\nemployees of the Federation to the Commission on deputation 1[as per deputation policy of\nEstablishment Division]."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Indemnity",
      "content": "No suit, prosecution or legal proceedings shall lie against the Commission,\nthe Chairperson or any member, officer, servant, advisors or consultant of the Commission in respect\nof anything in good faith done or intended to be done under this Act or the rules made thereunder or\norder made or published by or under the authority of the Federal Government, a Provincial\nGovernment, Commission or any report, paper or proceedings."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Members and officers to be public servants",
      "content": "Every member of the Commission and\nevery officer appointed or authorized by the Commission to exercise functions under this Act shall\nhe deemed to be a public servant within the meaning of section 21 of the Pakistan Penal Code, 1860\n(Act XLV of 1860).\n1Subs. and ins. by Act No. VII of 2026, ss. 9-10"
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Validity of proceedings",
      "content": "No act or proceedings of the Commission shall be invalid by\nreason only of the existence of a vacancy in, or defect in the constitution of, the Commission."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Power to make rules",
      "content": "(l) The Commission may in consultation with the Federal\nGovernment and by notification in the official Gazette make rules to carry out the purposes of this\nAct.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules\nmay provide for all or any of the following matters, namely:—\n(a)    the salaries and allowances and other terms and conditions of service of the members\nas provided under section 8;\n(b)    the conditions subject to which other administrative, technical and scientific staff may\nbe appointed by the Commission and the salaries and allowances of officers and other\nstaff appointed under section 29;\n(c)    the form in which the annual statement of accounts is to be prepared by the\nCommission under section 26; and\n(d)    any other matter which has to be, or may be, prescribed."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Power to remove difficulties",
      "content": "If any difficulty arises in giving effect to the provisions\nof this Act, the Federal Government may, by order published in the official Gazette, make such\nprovisions not inconsistent with the provisions of this Act as appears to it to be necessary or\nexpedient for removing the difficulty:\nProvided that this power shall be available for a period of one year from the date of\ncommencement of this Act.\n_____________\nRGN Date: 29-01-2026"
    }
  ],
  "definitions": [
    {
      "term": "armed forces",
      "definition": "army, navy, air force and all other civil armed forces including military intelligence agencies;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairperson",
      "definition": "the Chairperson of the Commission, as appointed under section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "National Commission for Human Rights constituted under section 3; 1 [(ca) \"Division concerned\" means the Division to which business of this Act stands allocated;]",
      "source_provision": "sec2"
    },
    {
      "term": "human rights",
      "definition": "the rights relating to life, liberty and dignity of the individual guaranteed and included in the international instruments including political and women rights; 1Ins. by Act No. VII of 2026, s.2",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of the Commission and includes the Chairperson;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "public servant",
      "definition": "a public servant defined under section 21 of the Pakistan Penal Code (Act XLV of 1860).",
      "source_provision": "sec2"
    }
  ]
}
