{
  "id": "pk-national-commission-for-minorities-rights-act-2025",
  "type": "statute",
  "title": "National Commission for Minorities Rights Act, 2025",
  "title_en": "National Commission for Minorities Rights Act, 2025",
  "short_name": "NCFMR",
  "status": "in_force",
  "issued_date": "2025-12-15",
  "in_force_date": "2025-12-15",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5toaA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Commission for Minorities Rights Act, 2025 (XL of 2025) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act shall be called the National\nCommission for Minorities Rights Act, 2025.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(a)     “Commission” means the National Commission for Minorities Rights constituted under\nthis Act;\n(b)     “Chairperson” means the Chairperson of the Commission as appointed under this Act;\n(c)     “Member” means a person appointed as member of the Commission by the Prime\nMinister under this Act and includes Chairperson;\n(d)     “Fund” means National Commission for Minorities Fund created under this Act;\n(e)         “Government concerned” means the ministries and departments of the Federal\nGovernment, Provincial Governments or Local Governments, as the case may be;\n(f)         “human rights” means the rights relating to life, liberty and dignity of the citizens\nguaranteed and included in the international instruments including political and women\nrights;\n(g)         “minorities” means the persons who are non-Muslims as defined in Article 260 of the\nConstitution of the Islamic Republic of Pakistan;\n(h)         “Minorities rights” means the minorities rights as laid down in Article 20 of the\nConstitution of Islamic Republic of Pakistan and prevalent laws in relation thereto;\n(i)         “Prescribed” means prescribed by rules or regulations made under this Act,\n(j)         “Regulations” means the regulations made by the Commission under this Act,\n(k)         “Rules” means the rules made by the Commission with the approval of the Federal\nGovernment under this Act; and\n(l)         “Secretary” means a person appointed as secretary of the Commission under this Act.\nNational Commission for Minorities"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Constitution of the Commission",
      "content": "(1) Upon the commencement of this Act, the National\nCommission for Minorities Rights shall stands established to exercise its powers and perform its\nfunctions under this Act.\n(2) The Commission shall consist of—\n(a)       Chairperson who shall be a citizen of Pakistan not below the age of thirty-five years\nand shall be a professional of known integrity and eminence possessing demonstrable\nknowledge in the field of human rights advocacy;\n(b)       two minority members from each Province shall be nominated by the respective\nProvincial Governments, each of whom shall be a citizen of Pakistan not below the\nage of thirty-five years and shall be a professional of known integrity and eminence\npossessing demonstrable knowledge in the field of human rights advocacy:\nProvided that one such member from each Province shall preferably be woman\nand one shall belong to a dominant minority group of the respective Province;\n(c)       one minority member from Islamabad Capital Territory shall be nominated by the\nChief Commissioner Islamabad Capital Territory who shall be a citizen of Pakistan\nnot below the age of thirty-five years and shall be a professional of known integrity\nand eminence possessing demonstrable knowledge in the field of human rights\nadvocacy;\n(d)      a member of the National Commission for Human Rights as nominated by the\nChairperson of the National Commission for Human Rights;\n(e)      a member of the National Commission on the Status of Women as nominated by the\nChairperson of the National Commission on the Status of Women;\n(f)      a member of the National Commission on the Rights of the Child as nominated by\nthe Chairperson of the National Commission on the Rights of the Child;\n(g)      a representative not below the rank of an officer in BPS-21 or equivalent of the\nMinistry of Human Rights as an ex-officio member;\n(h)      a representative not below the rank of an officer in BPS-21 or equivalent of the\nMinistry of Law and Justice as an ex-officio member;\n(i)      a representative not below the rank of an officer in BPS-21 or equivalent of the\nMinistry of Religious Affairs and Interfaith Harmony as an ex-officio member; and\n(j)      a representative not below the rank of an officer in BPS-21 or equivalent of the\nMinistry of Interior as an ex-officio member.\n(3) For the appointment of the members of the Commission under this Act, the Ministry of\nHuman Rights shall perform the Secretariat function and shall forward all names recommended under\nclauses (a) and (b) of sub-section (2) to the Prime Minister for appointment.\n(4) The Commission shall be a body corporate, having perpetual succession and a common seal,\nwith power to acquire and hold property both movable and immovable, and to enter into contracts, and\nshall by the said name sue and be sued.\n(5) The headquarters of the Commission shall be located at Islamabad and the Commission may\nestablish its offices at such other places as the Chairperson may determine, with approval of the Ministry\nof Human Rights.\n(6) A vacancy of member shall be filled in the manner provided under this Act within thirty days\nof occurrence of the vacancy:\nProvided that a member shall continue to hold office until their successor is duly appointed and\nnotified in accordance with the provisions of this Act.\n(7) The appointment of the members under clauses (a) and (b) of sub-section (2) shall be on such\nterms and conditions as may be prescribed by rules."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Appointment of Chairperson",
      "content": "(1) Upon the commencement of this Act or whenever\nrequired thereafter, the National Assembly Secretariat shall within sixty days initiate and complete the\nprocess for the appointment of the Chairperson of the Commission in the following manner, namely:—\n(a)         the Parliamentary Committee shall be constituted by the Speaker of the National\nAssembly after consultation with Chairman Senate, consisting of the following four\nmembers, namely:—\n(i)     two members from the Senate preferably Non-Muslim; and\n(ii)    two members from the National Assembly preferably Non-Muslim:\nProvided that when the National Assembly is dissolved, the total membership of\nthe Parliamentary Committee shall consist of the members from the Senate only:\nProvided further that out of the four members of the Committee, two shall be from\nthe Treasury Benches, one from each House and two from the Opposition Benches, one\nfrom each House:\nProvided also that the nomination of members from the Treasury Benches shall\nbe made by the Leader of the House and from the Opposition Benches by the Leader of\nthe Opposition in the National Assembly and the Senate of Pakistan, respectively;\n(b)     each member shall propose one name for consideration by the Parliamentary Committee\nfor appointment as Chairperson of the Commission;\n(c)     the decision of the Parliamentary Committee shall be made by a majority of its members:\nProvided that if the Committee fails to reach to a majority decision on any one\ncandidate, within thirty days of its first meeting, it shall forward all the names to the Prime\nMinister, who shall appoint one of them as the Chairperson; and\n(d)     the committee shall, in its first meeting, make the rules of its procedure.\n(2) The Chairperson of the Commission shall be the chief executive officer and principal\naccounting officer of the Commission and his appointment shall be such as may be or full time.\n(3) The terms and conditions of service of the Chairman shall be prescribed by rules."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Term of office of Chairperson and members",
      "content": "(1) The Chairperson and every member,\nother than ex-officio members, shall hold office for a term of four years from the date on which he enters\nupon his office.\n(2) The Chairperson or a member may, at any time, resign from his office in writing under his\nhand addressed to the Prime Minister through the Ministry of Human Rights."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Acting Chairperson",
      "content": "By reason of a vacancy in the office of Chairperson due to death,\nillness, resignation or otherwise, the Prime Minister shall appoint acting Chairperson from amongst the\nmembers of the Commission to act as Chairperson for a period of not exceeding ninety days or till the\nappointment of a new Chairperson, whichever is earlier."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Salary and travelling of Service of Chairperson and members",
      "content": "The salary, travelling and\ndaily allowance of the Chairperson and members of the Commission shall be prescribed by regulations."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Vacancy in office of the Chairperson or a member",
      "content": "If a vacancy occurs in the office of the\nChairperson or of any member, whether by reason of death, resignation or removal, such vacancy shall\nbe filled within a period of ninety days by making a fresh appointment in accordance with the provisions\nof this Act and the person so appointed on the initial appointment shall hold the office for the residual of\nthe term of office of the Chairperson or member of whom the vacancy has arisen."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Disqualification",
      "content": "A person shall be disqualified for becoming or being Chairperson or a\nmember of the Commission, if such person—\n(a)     is an un-discharged insolvent or has been by a competent court of law declared as\nbankrupt or his application for such declaration is pending adjudication of law; or\n(b)     has been by a competent court of law declared as of unsound mind or has physical\ninfirmity to discharge his functions under this Act; ог\n(c)     has been dismissed from service of Pakistan on grounds of inefficiency, misconduct,\nfraud or corruption; or\n(d)     has been by a competent court of law convicted of an offence of moral turpitude."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Removal of Chairperson and Members",
      "content": "The Chairperson and members may be removed\nfrom office by the Prime Minister, on the basis of any of the reasons for disqualification, as far as\napplicable including corruption and misuse of authority, specified in Article 209 of the Constitution of\nthe Islamic Republic of Pakistan."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Secretary, officers and other employees of the Commission",
      "content": "(1) The Prime Minister on\nthe recommendation of the Ministry of Human Rights shall appoint Secretary of the Commission in such\nmanner and on such terms and conditions as may be prescribed by rules.\n(2) The Secretary shall be responsible for proper administration of affairs of the Commission and\nshall exercise such other powers and perform such other functions as may be prescribed by rules.\n(3) The Commission with the consultation of the Ministry of Human Rights may appoint\nconsultants, researchers, experts, advisers, officers and other staff members in the manner and on such\nterms and conditions, as may be prescribed by rules."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Functions of the Commission",
      "content": "The Commission shall perform the following functions,\nnamely:—\n(a)         assess and monitor implementation of the constitutional guarantees and safeguard for\npromotion and protection of rights of minorities;\n(b)         examine and review existing or proposed policies or programmes, plans of action,\nlegislation, rules, regulations, administrative instruments, or other affirmative\nmeasures and to the Government concerned, recommend amendments, give advice or\npropose suggestion for prevention of discrimination and protection of rights of\nminorities to the concerned authorities;\n(c)       develop a national action plan for promotion and protection of rights of minorities;\n(d)       study the application of international minorities, rights, agreements and conventions\nand provide to the Government reports, proposals or recommendations necessary for\neffective application of such rights or agreements and conventions;\n(e)       establish and maintain database on complaints received concerning violation of rights\nof minorities or any such violations otherwise coming to notice of the Commission;\n(f)       advise on the victims about applicable legal procedures and, where appropriate, assist\nthem in pursuing their complaints with the relevant authorities;\n(g)       ensure and monitor implementation of minorities job quota in private and public\nsector organizations;\n(h)       on a petition presented to it by a victim or any person on his behalf, inquire into\ncomplaints of—\n(i)     any violation of rights of minorities or abetment or aiding thereof by any\norganization, public or private, or any body, department, authority or\ninstrumentality of any Federal, Provincial or Local Government; or\n(ii)    any neglect or willful breach of any provision of law in the prevention of or\nfair and independent inquiry or investigation of such a violation by any person\nor authority;\n(i)   coordinate with the relevant departments of the Federal and Provincial Governments for\nspecial measures for protection of minorities on special occasions, festivals and\npreservation of places of worship across Pakistan;\n(j)   subject to any relevant law, rules, regulations and policy, participate in proceedings\ninvolving violation of rights of minorities, before a civil society forum or police or a court,\nby becoming a party to such proceedings;\n(k)   subject to law, a member of the Commission or any person authorized by it may visit any\npolice station, jail or any other place of detention under the control of the Government or\nits agencies, where convicts, under trial prisoners, or detainees being minorities are\nlodged or detained to ascertain legality of such detention and recommend appropriate\nlegal measures to the concerned authorities if so required;\n(1)   sponsor, initiate, encourage and undertake studies, research and other necessary\ninterventions for analysis of the issues faced by minorities, and make appropriate\nrecommendations to the Government for empowerment, progress and development of\nthese communities;\n(m)    subject to law, seek and receive information, data and documents regarding minorities\ncommunities, from relevant department in the course of performance of its functions;\n(n)     organize consultations, dialogues and seminars, with civil society groups, actors and\nother similar institutions for promoting awareness on issues of minorities, institutional\nsafeguard available for their protection and proposing a way forward to the Government\nin these matters;\n(o)    monitor implementation status of minorities rights, judgments and, where necessary, seek\nguidance of indulgence and support of higher judiciary to effectively deal with any\nbottlenecks;\n(p)    subject to the relevant law, recommend to the concerned authorities to remove any\ndiscriminatory, hate material or other divisive content appearing on social media, which\nis aimed at any minorities in Pakistan and to take appropriate action under the law against\nthe publishers and creators of such material;\n(q)    submit special reports to the Majlis-e-Shoora (Parliament) through the Government on\nany matter pertaining to minorities and in particular the challenges encountered by them;\n(r)    take part in International forums and interact with Human Rights experts across the globe;\n(s)    take special measures for integration of all groups among minorities including Dalit and\nscheduled caste to promote solidarity and eliminate racial discrimination and recommend\npolicy measures for social emancipation;\n(t)    investigation and inquiry in respect of any incident of violation of rights of minorities\nenvisaged under this Act,\n(u)    the Commission shall monitor and prepare independent fact finding reports on Human\nRights issues and shall submit to the Government for action; and\n(v)    carry out such other functions related or incidental to the above functions as the\nCommission may consider necessary for promotion and protection of the rights of\nminorities under this Act."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Advice of the Commission",
      "content": "The Federal Government and Provincial Governments may\nrefer to the Commission for opinion any issue deemed appropriate relating to the functions of the\nCommission."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Financial and legal support for rehabilitation",
      "content": "Notwithstanding anything contained in\nother law for the time being enforce, the Federal Government shall allocate adequate rehabilitation fund\nto the Commission for extending financial and legal aid to the victims of the minority communities."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Administrative and financial powers of the Commission",
      "content": "(1) The Commission shall\nenjoy administrative and financial autonomy as per applicable laws.\n(2) The Commission shall have powers to re-appropriate, in the manner as may be prescribed by\nregulations, funds from one head of account to another head of account and to sanction expenditure on\nany item from within the allocated budget.\n(3) The Chairperson shall be the chief executive officer of the Commission and also its principal\naccounting officer."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Procedure of meeting of the Commission",
      "content": "(1) The Commission shall regulate its own\nprocedure in the manner prescribed by regulations.\n(2) The Commission shall meet at least on quarterly basis or whenever a need so arises.\n(3) Notice for the meeting either at the direction of the Chairperson or when so requested by one-\nthird of the Commission’s total strength shall be issued, along with agenda, at least ten days before the\ndate of meeting.\n(4) The quorum for meetings shall be one-half of the Commission’s total existing strength,\nincluding any members joining through modern techniques like video link conferencing.\n(5) No decision of the Commission shall be valid unless taken by a majority of the total members\npresent and voting:\nProvided that where an issue or matter pertains to a particular minority, no decision of the\nCommission shall be valid unless the members belonging to that minority community are part of the\nsession of the Commission in which such a decision is taken.\n(6) In the event of a tie, the person chairing the meeting shall have a casting vote.\n(7) The Chairperson may invite to the Commission’s meeting any persons whose opinion or\nexperience he deems appropriate to seek concerning a matter brought before the Commission for\ndiscussion, decision or review. Any such person shall not be entitled to vote.\n(8) All orders and decisions of the Commission shall be authenticated by the Secretary or any\nother officer of the Commission duly authorized by the Chairperson in this behalf."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Vacancy not to invalidate proceedings of Commission",
      "content": "No act or proceedings of the\nCommission shall be invalid merely by reason of existing of a vacancy in or defect in constitution of the\nCommission."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Executive Committee of the Commission",
      "content": "(1) The Commission shall constitute an\nexecutive committee comprising the Chairperson, two members to be elected by the Commission and\nSecretary of the Commission.\n(2) The executive committee constituted under sub-section (1) shall perform such functions as\nmay be prescribed by regulations and as may be assigned by the commission."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Appointment of sub",
      "content": "committees of the Commission.—(1) The Commission may constitute\nsub-committees comprising of its members, including Chairperson and may refer to them any matter for\nconsideration.\n(2) The Commission may as it thinks fit constitute an expert or advisory committee, possessing\na special knowledge, which shall fix an honorarium for services of the experts from the designated fund.\n(3) The sub-committees constituted under sub-section (2) shall be need based and time bound."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Inquiry into complaints",
      "content": "(1) The Commission, while inquiring into the complaints of\nviolations of minorities’ rights, may call for information or report from the Government or any other\nauthority or organization subordinate thereto, within such time as may be specified by it:\nProvided that if the information or report is not received within the time stipulated for the\npurpose, the Commission may proceed to inquire into the complaint on its own.\n(2) Without prejudice to anything contained in sub-section (1), if the Commission considers it\nnecessary, having regard to nature of the complaint, it may initiate an inquiry without calling for any\ninformation or report.\n(3)     If at any stage of the inquiry, the Commission—\n(a)     considers it necessary to inquire into the conduct of any person; or\n(b)     is of the opinion that the reputation of any person is likely to be prejudicially affected by\nthe inquiry, it shall give to that person a reasonable opportunity of being heard and to\nproduce evidence in his defence:\nProvided that nothing in this sub-section shall apply where the credit of a witness\nis being impeached."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Powers of the Commission relating to inquiries",
      "content": "(1) The Commission shall, while\ninquiring into complaints under this Act, have all the powers of a civil court trying a suit under the Code\nof Civil Procedure, 1908 (Act V of 1908), in respect of the following matters, namely:—\n(a)      summoning and enforcing the attendance of witnesses and examine them on oath;\n(b)     requiring discovery and production of documents;\n(c)     receiving evidence on affidavits;\n(d)      requisitioning any public record or copy thereof from any court or office; and\n(e)      issuing commission for the examination of witnesses or documents.\n(2) The Commission shall have power to require any person, subject to any privilege which may\nbe claimed by that person to furnish information on such points or matters as in opinion of the\nCommission may be useful for or relevant to the subject matter of the inquiry.\n(3) The Commission may take any of the following, amongst others, steps upon the completion\nof an inquiry held under this Act, namely:—\n(a)     where the inquiry discloses violation of minorities’ rights or negligence in prevention of\nviolation of minorities’ rights by a public servant, it may recommend to the concerned\nGovernment or authority the initiation of proceedings for prosecution or such other action\nas the Commission may deem fit against the concerned person or persons;\n(b)     recommend to the concerned Government or authority for the grant of such immediate\ninterim relief to the victim or the members of his family as the Commission may consider\nnecessary;\n(c)     provide a copy of the inquiry report to the accused and complainant or his representative;\n(d)      the Commission shall send a copy of its inquiry report together with its recommendations\nto the concerned Government or authority which shall, within a period of one month or\nsuch further time as the Commission may allow, submit its reply indicating the action\ntaken or proposed to be taken to implement the recommendations or reasons why these\ncannot or should not be implemented; or\n(e)     the Commission shall publish its inquiry report together with its recommendations and\nthe reply of the Government or authority thereto, and place the same on its website.\n(4) The Commission may recommend any disciplinary action to the competent authority against\nany person or employee, as the case may be, on non-compliance of the order of the Commission under\nthis Act."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Statement made to the Commission",
      "content": "Any statement made by a person while giving\nevidence before the Commission shall not subject him to, or be used against him, in any civil or criminal\nproceeding except prosecution for giving false evidence."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Protecting witness identity",
      "content": "Where the Commission considers it necessary to protect the\nidentity of a person who has made a complaint or furnished or proposes to furnish information or\nproduced or proposes to produce a document or given or proposes to give evidence or made or proposes\nto make a submission to the Commission or to a person acting for or on behalf of the Commission, it\nmay give directions prohibiting the disclosure of the identity of such person:\nProvided that if the Commission is satisfied that such person, his family, friends or associates are\nat risk of any kind of serious harm in the case of disclosure of his identity, it may give directions for their\nprotection:\nProvided further that such directions may, where appropriate, include directions for giving\nrequisite physical protection, security of employment, protection of privacy and securing human rights\nof such person."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Council of the Commission",
      "content": "(1) There shall be a Council to be established under this Act.\nby the Commission.\n(2) The Council shall consist of the following eighteen members from whom,—\n(a)     three members from Hindus out of which two from scheduled caste;\n(b)     three members from Christians;\n(c)     one member from Sikhs;\n(d)     one member from Bahai;\n(e)     one member from the Parsee Community;\n(f)     two Muslim members who are human rights background;\n(g)     one representative from each Provincial Human Rights or Minorities Affairs\nDepartments; and\n(h) one minority member from Islamabad Capital Territory.\n(3) The members of the council shall be appointed by the Prime Minister on the recommendations\nof the Commission on such terms and conditions as may be prescribed.\n(4) The tenure of the members other than the ex-officio members shall be for three years.\n(5) The Council shall perform such powers and exercise such functions as assigned to it by the\nCommission from time to time.\nFUNDS, FINANCE, ACCOUNTS AND AUDIT"
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. National Commission for Minorities Fund",
      "content": "(1) There shall be created a fund to be known\nas the National Commission for Minorities Fund which shall vest in the Commission and shall be used\nby the Commission to meet charges in connection with its functions under this Act.\n(2) The following shall be the sources of the Fund, created under sub-section (1), namely:—\n(a)     Federal Government shall allocate specific amount of money for the commission in each\nfinancial year and it shall not be necessary for the commission to take the prior approval\nfrom the government to spend such allocated money for the approved and specific\npurposes;\n(b)     donations, contributions or grants made by the Provincial Governments;\n(c)     donations, if any, made by private individuals, national and international institutions and\nother Governments; and\n(d)     income from investment made by the Commission.\n(3) There shall be a separate account maintained at a scheduled bank for meeting routine expenses\nof the Commission out of the Fund in the manner as may be prescribed in the regulations.\n(4) The provisions of the Public Finance Management Act, 2019 shall apply to the Commission."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Expenditure to be charged on the Fund",
      "content": "The following expenditures shall be charged to\nthe Fund, namely:—\n(a)     expenditure lawfully incurred by the Commission, relating to remuneration of its\nmembers, employees, advisers and consultants, including legal fees and other costs;\n(b)     expenses, costs or expenditure incurred or accepted by the Commission in performance\nof its functions or in exercise of its powers under this Act;\n(c)     purchasing or hiring of accommodation, equipment, machinery, repair and maintenance\nthereof and any other work or undertaking in the course of performance of its functions\nor in the exercise of its powers under this Act; and\n(d)     repayment of any financial liabilities."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Accounts and audit",
      "content": "(1) The Commission shall maintain proper accounts and other relevant\nrecords and prepare an annual statement of accounts in such a form as may be prescribed in accordance\nwith the provisions of Articles 169 and 170 of the Constitution.\n(2) The Chairperson shall be the principal accounting officer of the Commission. The accounts\nof the Commission shall be audited by the Auditor-General at such intervals as may be specified by him.\n(3) The Auditor-General and any person appointed by him in connection with the audit of the\naccounts of the Commission under this Act shall have the same rights and privileges and the authority in\nconnection with the audit of Government’s accounts and in particular shall have the right to demand the\nproduction of books, accounts, connected vouchers, other related documents and papers, and to inspect\nany of the offices of the Commission.\n(4) The accounts of the Commission, as certified by the Audit-General or any other person\nappointed by him in this behalf, together with the audit report thereon shall be forwarded annually to the\nFederal Government by the Commission, and the Federal Government shall cause the audit report to be\nlaid, as soon as may be after it is received, before both Houses of the Majlis-e-Shoora (Parliament)."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Annual and other reports",
      "content": "(1) The Commission shall, each year, prepare bi-annual reports\ngiving a true and full account of the Commission’s activities during the previous financial year along\nwith any recommendations.\n(2) The Chairperson shall present the report to the President. The Commission shall\nsimultaneously forward copies of the report to the Government. The report shall also be tabled in the\nParliament for consideration.\n(3) The Commission may at any time prepare special reports on any matters which in its opinion\nare of particular urgency or importance.\n(4) The Federal Government shall, within three months of receipt of annual report and within one\nmonth of receipt of any special report, cause these reports to be laid before each House of the Majlis-e-\nShoora (Parliament) along with a memorandum indicating the action taken or proposed to be taken on\nthe recommendations of the Commission and reasons for non-implementation of the recommendations,\nif any.\n(5) In case of non-acceptance of any recommendations, the Federal Government shall inform the\nCommission of its reasons thereof.\n(6) The Commission shall, after presentation to the President under sub-section (2), place the\nannual report and special reports on its official website for information of general public."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Chairperson, members and employees of the Commission to be public servants",
      "content": "The\nChairperson, members and employees of the Commission shall be deemed to be public servants within"
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Returns or information",
      "content": "The Commission shall furnish to the Federal Government such\nreturns or other information with respect to its activities as the Federal Government may, from time to\ntime, require."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Delegation of powers",
      "content": "The Commission may, by notification in the official Gazette,\ndelegate such of its powers as deemed necessary to a standing committee or a member."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Indemnity",
      "content": "No suit or any other proceeding shall lie against the Commission, Chairperson,\nmember or employee of the Commission for anything which is done in good faith, in pursuance of this\nAct or the rules or regulations made thereunder or by or under the authority of the Commission."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Power to make rules",
      "content": "(1) The Commission shall, within six months of the commencement\nof this Act and with the approval of the Federal Government make rules for carrying out the purposes of\nthis Act."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Power to make regulations",
      "content": "(1) The Commission may, with approval of the Federal\nGovernment and by notification in the official Gazette, make regulations for the conduct of its internal\nbusiness, including efficiently and effectively organizing and managing its resources and its\nadministrative, operational and other functions under this Act.\n(2) In particular and without prejudice to generality of the foregoing powers, the regulations may\nprovide for all or any of the following matters, namely:—\n(a)     terms and conditions of service of officers and other staff including their salaries and\nallowances;\n(b)     the form in which the annual statement of accounts is to be prepared under this Act; and\n(c)     any other matter which has to be, or may be, prescribed by regulations under this Act."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Power to remove difficulties",
      "content": "If a difficulty arises in giving effect to any provision of this\nAct, the Federal Government may, within a period not exceeding two years of the commencement of this\nAct and by order in writing published in the official Gazette, make such provision as may appear to it to\nbe necessary for removing the difficulty.\n____________\nRGN Date: 08-01-2026"
    }
  ],
  "definitions": [
    {
      "term": "Commission",
      "definition": "the National Commission for Minorities Rights constituted under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairperson",
      "definition": "the Chairperson of the Commission as appointed under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "a person appointed as member of the Commission by the Prime Minister under this Act and includes Chairperson;",
      "source_provision": "sec2"
    },
    {
      "term": "Fund",
      "definition": "National Commission for Minorities Fund created under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Government concerned",
      "definition": "the ministries and departments of the Federal Government, Provincial Governments or Local Governments, as the case may be;",
      "source_provision": "sec2"
    },
    {
      "term": "human rights",
      "definition": "the rights relating to life, liberty and dignity of the citizens guaranteed and included in the international instruments including political and women rights;",
      "source_provision": "sec2"
    },
    {
      "term": "minorities",
      "definition": "the persons who are non-Muslims as defined in Article 260 of the Constitution of the Islamic Republic of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "Minorities rights",
      "definition": "the minorities rights as laid down in Article 20 of the Constitution of Islamic Republic of Pakistan and prevalent laws in relation thereto;",
      "source_provision": "sec2"
    },
    {
      "term": "Prescribed",
      "definition": "prescribed by rules or regulations made under this Act,",
      "source_provision": "sec2"
    },
    {
      "term": "Regulations",
      "definition": "the regulations made by the Commission under this Act,",
      "source_provision": "sec2"
    },
    {
      "term": "Rules",
      "definition": "the rules made by the Commission with the approval of the Federal Government under this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "Secretary",
      "definition": "a person appointed as secretary of the Commission under this Act. National Commission for Minorities",
      "source_provision": "sec2"
    }
  ]
}
