{
  "id": "pk-national-commission-on-the-rights-of-child-act-2017",
  "type": "statute",
  "title": "National Commission on the Rights of Child Act, 2017",
  "title_en": "National Commission on the Rights of Child Act, 2017",
  "short_name": "NCOTR",
  "status": "in_force",
  "issued_date": "2017-02-16",
  "in_force_date": "2017-02-16",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NoaZ0%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Commission on the Rights of Child Act, 2017 (XX of 2017) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the National\nCommission on the Rights of Child Act, 2017.\n(2)   It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in subject or context,—\n(a)    “Chairperson” means the Chairperson of the Commission;\n(b)    “child” means any person below the age of eighteen years;\n(c)     “child rights” mean and include, but limited to, rights of child in the United\nNations’ Convention on Rights of the Child and in any other domestic law;\n(d)    “Commission” means the National Commission on the Rights of Child\nconstituted under section 3;\n(e)     “member” means a person appointed as member of the Commission and where\nthe context so permits includes the Chairperson;\n(f)    “prescribed” means prescribed by rules made under this Act;\n(g)   “rules” mean rules made under this Act; and\n(h)   “Secretary” means Secretary of the Commission appointed under section 14.\n·\n_____________"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Constitution of Commission",
      "content": "(1) The 1[Prime Minister] shall constitute a\ncommission to be known as the National Commission on the Rights of Child to exercise its\npowers and perform its functions under this Act.\n(2) The Commission shall consist of—\n(a)      a person being citizen of Pakistan of not                             Chairperson\nless than forty-five years of age, having\nexperience of not less than fifteen years\nof working in the field of child rights, to\nbe appointed by the 1[Prime Minister]\nin the prescribed manner;\n(b)      Secretary of the Division, allocated with the                          Member ex-officio\nbusiness of child rights, or his representative\nnot below the rank of Joint Secretary (B-20);\n(c)      a representative of Foreign Affairs Division                           Member ex-officio\nnot below the rank of Joint Secretary (B-20);\n(d)      a representative of Interior Division not                              Member ex-officio\nbelow the rank of Joint Secretary (B-20);\n(e)      Chairperson of the National Commission for                             Member ex-officio\nHuman Rights or his representative not below the\nrank of an officer in BS-20;\n(f)      Chairperson of the National Commission on           Member ex-officio\nthe Status of Women or her representative not below\nthe rank of an officer in BS-20;\n(g) Chairpersons of provincial commissions                                     Members ex-officio\non the rights of child, set up under provincial\nlaws;\n(h)      six members, one each from each Province,                                    Members\nIslamabad Capital Territory and the Federally\nAdministered Tribal Areas, out of which two\nmembers shall be from women and one from\nminorities, all having experience of not less than\nten years of work in the field of child rights;\n1\nSubs. by the National Commission on the Rights of Child (Amendment) Act, 2022 (I of 2022), s. 2.\n(i)       two children one boy and one girl not below the                                     Members\nage of 15 years; and\n(j)       Secretary of the Commission.                                                  Member ex-officio\n(3) The Secretary shall act as secretary of the Commission as well.\n(4) The Commission shall be a body corporate having perpetual succession and a\ncommon seal with powers, among others, to acquire, hold and dispose of any property, movable and\nimmovable, and shall sue and be sued by its name."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Secretariat of the Commission",
      "content": "(1) The secretariat of the Commission shall be at\nIslamabad.\n(2) The Commission may establish its offices at such other places as the Chairperson\nmay determine, with approval of the 1[Division concerned]."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Appointment of Chairperson and Members",
      "content": "(1) The Chairperson and members,\nother than ex-officio members, shall be appointed by the 1[Prime Minister] on such salary,\nallowances, privileges and other terms and conditions as may be prescribed.\n(2) The salary, allowances, privileges and other terms and conditions under sub-section\n(1) of the Chairperson or any member, as the case may be, shall not be varied to their disadvantage\nafter their appointment."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Term of office of Chairperson and members",
      "content": "(1) The Chairperson and every\nmember, other than ex-officio members, shall hold office for a term of three years, extendable for a\nfurther term of three years, provided that Chairperson or a member, other than ex-officio member,\nshall not hold office for more than two terms.\n(2) The Chairperson or a member may, at any time by writing under his hand addressed\nto the 1[Prime Minister], resign from his office."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Disqualification",
      "content": "(1) A person shall be disqualified for becoming or being the\nChairperson or a member of the Commission, if such person—\n(a)     is an un-discharged insolvent or has been declared a bankrupt; or\n(b) is of unsound mind or has physical infirmity to discharge his functions\nunder this Act; or\n(c)     has been dismissed from public service of Pakistan on grounds of\ninefficiency, misconduct, fraud or corruption; or\n(d) has been convicted of an offence of moral turpitude.\n_______________________________________________________________________________________________\n1\nSubs. by the National Commission on the Rights of Child (Amendment) Act, 2022 (I of 2022), ss. 3-5."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Removal from office",
      "content": "(1) Subject to the provisions of sub-section (2), the\nChairperson or a member may be removed from office on—\n(a)      the grounds of misconduct;\n(b)      any condition under section 7; or\n(c) a resolution passed for such removal by fifty percent of the total members\nof the Commission."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Vacancy in office of the Chairperson or member",
      "content": "If a vacancy occurs in the\noffice of the Chairperson or of any member, whether by reason of death, resignation or removal\nunder section 8, such vacancy shall be filled within a period of sixty days by making a fresh\nappointment in accordance with the provisions of section 5 and the person so appointed shall hold\noffice for the residual of the term of office of the Chairperson or member of whom the vacancy has\narisen."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Acting Chairperson",
      "content": "Where at any time the Chairperson is unable to perform his\nfunctions due to any reason, the 1[Prime Minister] may appoint acting Chairperson for performance\nof functions under this Act till the vacancy is filled on regular basis under section 5:\nProvided that period of acting appointment shall not exceed four months."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Vacancy not to invalidate proceedings of Commission",
      "content": "No act or proceedings of\nthe Commission shall be invalid merely by reason of existing of a vacancy in or defect in\nconstitution of, the Commission."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Procedure for transaction of business",
      "content": "(1) The Commission shall meet regularly at\nsuch time as the Chairperson thinks fit, but at least once in every quarter.\n(2) All decisions at a meeting shall be taken by majority:\nProvided that in the case of equality of votes, the Chairperson or in his absence the person\npresiding shall have and can exercise a second or casting vote.\n________________________________________________________________________________\n1\nSubs. by the National Commission on the Rights of Child (Amendment) Act, 2022 (I of 2022), ss. 6-7.\n(3) If for any reason, the Chairperson is unable to attend a meeting of the Commission, any\nmember chosen by the members present from amongst themselves at the meeting shall preside.\n(4) Quorum of the meeting shall not be less than fifty percent of its total membership at the\ntime of such meeting:\nProvided that fifty percent of ex-officio members are also present.\n(5) In the event of a requisition signed and presented by one-fourth of the members, the\nChairperson shall call a meeting of the Commission within seven days of such requisition, presented\nto the Chairperson."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Executive committee of the Commission",
      "content": "(1) The Commission shall constitute an\nexecutive committee comprising the Chairperson, two members and Secretary of the Commission.\n(2) The executive committee shall perform such functions as may be assigned to it by the\nCommission."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Secretary, officers and other employees of the Commission",
      "content": "(1) The 1[Prime\nMinister] shall appoint Secretary of the Commission on such terms and conditions as may be\nprescribed.\n(2)     The Secretary shall be responsible for proper administration of affairs of the\nCommission and its day-to-day management and shall exercise and discharge such other powers and\nperform such other functions as may be prescribed.\n(3) The Commission may appoint consultants, researchers, experts, advisers, officers and\nother staff members on such terms and conditions and criteria as may be prescribed."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Functions of the Commission",
      "content": "The Commission shall perform all or any of the\nfollowing functions, namely:—\n( a)      examine existing or proposed legislations and administrative instruments\nand proposals related to child rights and make such recommendations as it\ndeems appropriate;\n(b)          liaise with provincial commissions set up under provincial laws and other\nconcerned provincial organizations;\n(c)  examine and review any law or policy or practice, for the time being in force,\nfor protection of child rights and recommend measures for their effective\nimplementation;\n_________________________________________________________________________________\n1\nSubs. by the National Commission on the Rights of Child (Amendment) Act, 2022 (I of 2022), s. 8\n(d)         Present to the 1[Division concerned] and to 1[the departments concerned of]\nthe provincial governments, as the case may be, reports upon working of such\nlaw or policy or practice specified under clause (c);\n(e)         inquire into violation of child rights and recommend to the relevant agency or\ndepartment initiation of proceedings in such cases;\n(f)         examine all factors that inhibit enjoyment of rights of child, such as violence,\nabuse and exploitation, trafficking, torture, pornography and prostitution and\nrecommend appropriate remedial measures;\n(g)         sponsor, steer, encourage research and maintain a database relating to children\nand their issues to provide knowledge and awareness for national policy and\nstrategic action for its remedy;\n(h)        spread awareness and promote dialogue on child rights among various sections\nof the society and promote awareness of the safeguards available for\nprotection of these rights;\n(i)        examine international instruments and undertake periodical review of existing\npolicies and programmes on child rights and make recommendations for their\neffective implementation in the best interest of children;\n(j)         advise the 1[Division concerned] to sign, ratify or accede to any such proposed\ninternational treaty, protocol, etc.;\n(k)          while inquiring into complaints of violations of child rights, may call for\ninformation or report from 1[the ministries, divisions, attached departments\nand subordinate offices of] the Federal Government, civil society\norganizations and autonomous or concerned bodies and in this regard the\nCommission shall have the powers vested in a civil court under the Code of\nCivil Procedure, 1908 (Act V of 1908), for enforcing the attendance of any\nperson and compelling the production of documents; and\n(l)          undertake such other functions as assigned by the 1[Prime Minister or the\nDivision concerned] and as it may consider necessary for promotion and\nprotection of child rights and any other matter incidental to the above\nfunctions."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Delegation of functions",
      "content": "The Commission or the Chairperson may, by\nnotification in the official Gazette, delegate its functions subject to such conditions as it\nor he may specify in this behalf to anybody or individual that is part of the Commission."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Annual reports of the Commission",
      "content": "(1) The Commission shall prepare an\nannual report on the situation of child rights in the country and performance of the\nCommission and submit it to the 1[Division concerned] which shall lay the report before\neach House of Majlis-e-Shoora (Parliament).\n(2) The Commission may at any time submit special reports on any matter which, in its\nopinion, is of such urgency or importance that it should not be deferred till submission of\nthe annual report.\n_______________________________________________________________________\n1\nSubs. and ins. by the National Commission on the Rights of Child (Amendment) Act, 2022 (I of 2022), ss. 9-10.\n(3) The Commission shall assist the 1[Division concerned] in preparation of its\nperiodic reports in accordance with international declarations, conventions, treaties,\ncovenants and agreements relating to children and their rights.\nFUND, FINANCE, ACCOUNTS AND AUDIT"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Fund",
      "content": "(1) There shall be established by the 1[Division concerned, in\nconsultation with the Finance Division] a fund to be known as the Child Rights Fund,\nwhich shall vest in the Commission and shall be used by the Commission to meet charges\nin connection with its functions under this Act.\n(2) The sources of the Fund, amongst other moneys, may be the following,\nnamely: —\n(a)     such fund as the Federal Government shall allocate each year as a non-\nlapsable grant in annual budget of the Fund;\n(b)    such voluntary donations, contributions or subscriptions as may be made\nby Provincial Governments;\n(c)    donations, If any, made by private individuals, national and international\nnatural and juristic persons;\n(d)     income from investment by the Commission as may be prescribed; and\n(e)     all other sums or properties or assets which may in any manner become\npayable to or vest in the Commission in respect of any matter.\n(3) The Commission shall, while performing its functions and exercising its powers\nunder this Act, ensure highest sense of prudence in respect of expenditures incurred from\nthe Fund.\n(4)        The Fund shall be expended for the purposes of—\n(a)     performing functions of the Commission;\n(b)      establishment charges of Chairperson and members, including\nconsultants, researchers, experts, advisers, officers and other staff\nmembers, legal and other fees and costs; and\n(c)     such other activities which fall within purview of the Commission.\n(5)     The Commission may invest money from the Fund in accordance with\ninstructions of the 1[Finance Division].\n_________________________________________________________________________________\n1\nSubs. by the National Commission on the Rights of Child (Amendment) Act, 2022 (I of 2022), ss. 10-11."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Accounts and audit of Commission",
      "content": "(1) The Commission shall maintain proper\naccounts and other relevant records and prepare an annual statement of accounts in such form as\nmay be prescribed by the Federal Government.\n(2) The Chairperson shall be the Principal Accounting Officer of the Commission and the\naccounts of the Commission shall be audited by the Auditor-General at such intervals as may be\nspecified by him.\n(3) The accounts of the Commission, as certified by the Auditor-General or any other\nperson appointed in his behalf, together with the audit report thereon shall be forwarded annually to\nthe 1[Division concerned] by the Commission and the 1[Division concerned] shall cause the audit\nreport to be laid, as soon as may be after it is received, before each House of the Parliament."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Power of the Federal Government to issue directives",
      "content": "The 1[Prime Minister] may,\nas and when it considers necessary, issue directives to the Commission on matters of policy and\nsuch directives shall be binding on the Commission and if a question arises as to whether any matter\nis a matter of policy or not, the decision of the 1[Prime Minister] thereon shall be final."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Returns or information",
      "content": "The Commission shall furnish to the 1[Division concerned]\nsuch returns or other information with respect to its activities as the 1[Division concerned] may,\nfrom time to time, require."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Power to make rules",
      "content": "Within six months of the commencement of this Act, the\nFederal Government may, in consultation with the Commission and by notification in the official\nGazette, make rules to carry out purposes of this Act."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Power to remove difficulties and doubts",
      "content": "If any difficulty or doubt arises in giving\neffect to the provision of this Act, the Federal Government may, by order in writing published in the\nofficial Gazette, make such provision as may appear to it to be necessary for removing the difficulty\nor doubt:\nProvided that no order shall be made under the section after expiry of a period of three years\nfrom commencement of this Act.\n_________________________________________________________________________________\n1\nSubs. by the National Commission on the Rights of Child (Amendment) Act, 2022 (I of 2022), ss. 12-14."
    }
  ],
  "definitions": [
    {
      "term": "Chairperson",
      "definition": "the Chairperson of the Commission;",
      "source_provision": "sec2"
    },
    {
      "term": "child",
      "definition": "any person below the age of eighteen years;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the National Commission on the Rights of Child constituted under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a person appointed as member of the Commission and where the context so permits includes the Chairperson;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Secretary",
      "definition": "Secretary of the Commission appointed under section 14. · _____________",
      "source_provision": "sec2"
    }
  ]
}
