{
  "id": "pk-national-commission-on-the-status-of-women-act-2012",
  "type": "statute",
  "title": "National Commission on the Status of Women Act, 2012",
  "title_en": "National Commission on the Status of Women Act, 2012",
  "short_name": "NCOTS",
  "status": "in_force",
  "issued_date": "2012-03-09",
  "in_force_date": "2012-03-09",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pm-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Commission on the Status of Women Act, 2012 (VIII of 2012) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the National\nCommission on the Status of Women Bill, 2012.\n(2)     It extends to the whole of Pakistan.\n(3)     It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.__ In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(a)     “Chairperson” means the Chairperson of the Commission as appointed under section 4,\nand includes acting chairperson appointed under section 7;\n(b)     “Commission” means the National Commission on the status of Women established\nunder section 3;\n(c)     “girl” means a female human being under the age of eighteen years;\n(d)     “Member” means the Member of the Commission;\n(e)     “prescribed” means prescribed by rules made under this Act;\n(f)     “Secretary” means the Secretary of the Commission appointed under section 9; and\n(g)     “women” means a female human being of eighteen years or above."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Commission",
      "content": "(1) The Federal Government shall constitute a\nCommission to be known as the National Commission on the Status of Women (NCSW), to exercise\n(2) The Commission shall consist of,__\n(a)         a Chairperson, who shall be a woman with experience of working on issues related to\nwomen's rights for more than fifteen years, and is committed to the cause of women's\nempowerment;\n(b)         two members from each Province of whom at least one member shall be a woman, one\nwoman member each from Federally Administered Tribal Areas, Azad Jammu and\nKashmir, Gilgit-Baltistan, the Islamabad Capital Territory and from minorities;\n(c)         five ex-officio members who shall be representatives of the Ministries of Law, Finance,\nForeign Affairs and Interior and the Ministry concerned with the subject of women’s\nrights not below BPS-20, and who shall not have the right to vote;\n(d)         Chairperson or a designated member of each Provincial Commission on the Women’s\nrights, set up under provincial laws; and\n(e)         Secretary of the Commission, who shall not have the right to vote.\n(3) A member appointed under Paragraph (b) of sub-section (2), shall not be less than thirty\nyears of age, with experience of working on issues related to women's rights and is committed to the\ncause of women’s empowerment.\n(4) The headquarter of the Commission shall be at Islamabad.\n(5) The Commission shall be a body corporate having perpetual succession and a common seal\nwith powers, among others to acquire, hold and dispose of any property and shall sue and be sued by\nthe said name."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Appointment of Chairperson",
      "content": "(1) The 1[administrative division] shall through public\nnotice, invite suggestions for suitable persons for appointment as Chairperson and, after proper\nscrutiny, shall submit a list of those persons to the Prime Minister and the Leader of the Opposition in\nthe National Assembly.\n(2) The Prime Minister shall in consultation with the Leader of the Opposition in the National\nAssembly forward three names for Chairperson to a Parliamentary Committee for hearing and\nconfirmation of any one person:\nProvided that in case there is no consensus between the Prime Minister and the Leader of the\nOpposition, each shall forward separate list to the Parliamentary Committee.\n1\nSubs. by Act No. III of 2025, s.2.\n(3) The Parliamentary Committee shall be constituted by the Speaker of the National Assembly\nand shall comprise fifty per cent members from the treasury benches and fifty per cent from the\nopposition parties, based on their strength in Majlis-e-Shoora (Parliament), to be nominated by the\nrespective Parliamentary Leaders:\nProvided that the total strength of the Parliamentary Committee shall not exceed twelve\nmembers out of which one-third shall be from the Senate.\n(4) The Parliamentary Committee shall regulate its own procedure.\n(5) The Parliamentary Committee shall forward the name of the nominee confirmed by it to the\nPrime Minister, who shall appoint the Chairperson accordingly.\n1\n[(6) A vacancy of Chairperson shall be filled in as provided in this Act within thirty days of\noccurrence of the vacancy.]"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Appointment of members.__ (1) The members, including ex",
      "content": "officio members, shall be\nappointed by the Prime Minister from amongst the names recommended under sub-section (2).\n(2) The 2[administrative division] shall, after consultation with relevant stake-holders,\nrecommend to the Prime Minister three names for each Member who fulfill the qualifications laid\ndown in Section 3.\n(3) A vacancy of a Member shall be filled as provided in sub-sections (1) and (2) within thirty\ndays of the occurrence of the vacancy."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Term of Office of Chairperson and of Members",
      "content": "(1) A person appointed as the\nChairperson and Member shall hold office for a term of three years from the date on which he or she\nenters upon his or her office 3[* * * * * * *].\n(2)     The Chairperson or a Member may resign his or her office in writing under his or her\nhand addressed to Prime Minister of the Islamic Republic of Pakistan and on acceptance of such\nresignation, such vacancy shall be filled within thirty days for the unexpired term of the member."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Removal of Chairperson and Members",
      "content": "The Chairperson and Members may be\nremoved from office by the Prime Minister if he or she, as the case may be,—\n(a)         is, after proper inquiry, found guilty of misconduct:\nProvided that in the case of the Chairperson, such finding shall be submitted to\nthe Parliamentary Committee for confirmation;\n(b)        is adjudged an insolvent;\n(c)        is unfit to continue in office by reason of being mentally or physically challenged and\nstands so declared by a competent medical authority; and\n1\nAdded by Act No. II of 2018, s. 2.\n2\nSubs. by Act No. III of 2025, s.3.\n3\nOmitted by Act No. XIX of 2021, s. 2.\n(d)        has, on conviction of any offence involving moral turpitude been sentenced to\nimprisonment for a term of not less than two years, unless a period of five years has\nelapsed since his or her release."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Acting Chairperson",
      "content": "By reason of a vacancy in the office of Chairperson due to death,\nillness, resignation or otherwise, the Prime Minister shall appoint a woman from amongst the members\nof the Commission to act as Chairperson for a period of not exceeding thirty days 1[* * * * * * *]."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Terms and Conditions as applicable to members",
      "content": "(1) The traveling and daily\nallowance and other allowances payable to and terms and conditions as applicable to members, other\nthan ex-officio members, shall be such as may be prescribed.\n(2)    The salary and allowances payable to and terms and conditions applicable to the\nChairperson, shall be such as prescribed by the Federal Government.\n(3)      The Chairperson of the Commission shall be full time, shall have the status equivalent\nto a Minister of State of the Federal Government. The executive and financial authority and\nresponsibility of the Commission shall vest in the Chairperson who shall be the overall in-charge of\nthe Commission.\n(4)   A member of the Commission shall have status equivalent to BPS-21 of the Federal\nGovernment."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Secretariat of the Commission",
      "content": "(1) There shall be a Secretariat of the Commission\nheaded by the Secretary with complement of officers and support staff as may be prescribed.\n(2) The Secretary on the instructions of the Commission will prepare a draft three year strategic\nplan, the Annual Work Plan and budget.\n(3) The Secretary shall be appointed in the manner as may be prescribed.\n(4) The appointment and terms and conditions of the employees of the Commission shall be\nsuch as may be prescribed."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Functions and Powers of the Commission",
      "content": "The Commission,__\n(a)        shall examine the policy, programs and other measures taken by the Federal\ngovernment for gender equality, women's empowerment, political participation,\nrepresentation, assess implementation and make suitable recommendations to the\nconcerned authorities;\n(b)        shall review all Federal laws, rules and regulations affecting the status and rights of\nwomen and suggest repeal, amendment or new legislation essential to eliminate\ndiscrimination, safeguard and promote the interest of women and achieve gender\nequality before law in accordance with the Constitution and obligations under\ninternational covenants and commitments;\n1\nOmitted by Act No. II of 2018, s. 3.\n(c)         shall sponsor, steer, encourage research to generate information, analysis and studies\nand maintain a database relating to women and gender issues to provide knowledge and\nawareness for national policy and strategic action for women empowerment;\n(d)         shall develop and maintain interaction and dialogue with non governmental\norganizations, experts and individuals in society and an active association with similar\ncommissions and institutions in other countries for collaboration and action to achieve\ngender equality at the national, regional and international level;\n(e)         mobilize grants from domestic and international, including multi and bilateral agencies,\napproved by the Federal Government, for meeting any of its obligations or performing\nits functions;\n(f)          shall facilitate and monitor implementation of international instruments and\nobligations affecting women and girls to which Pakistan is a signatory, and advise the\nFederal Government before accession to any such proposed international instrument,\nprotocol or treaty;\n(g)         shall recommend to the Federal Government the signing or ratifying of international\ninstruments (conventions, treaties and covenants) affecting rights of women and girls;\n(h)         may seek and receive information, data and documents from any Federal source or\nentity in the course of performance of its functions;\n(i)          while inquiring into complaints of violations of women's rights may call for\ninformation or report from the 1[concerned authorities] civil society organizations and\nautonomous or concerned bodies; and in this regard the Commission shall have the\npowers vested in a civil Court under the Code of Civil Procedure, 1908 (Act V of 1908)\nfor enforcing the attendance of any person and compelling the production of\ndocuments;\n(j)          may in accordance with relevant laws and rules and prior permission of the provincial\ngovernment concerned inspect any jail, sub-jail or other places of custody where\nwomen and girls are kept and to make appropriate recommendations to the authorities\nconcerned;\n(k)         may act for advocacy, lobbying, coalition building, networking and as a catalyst for\npromotion of cause of women to facilitate their participation in all spheres of life\nincluding legal, economic, social and political empowerment;\n(l)         liaise with the Provincial Commissions set up under provincial laws and other\nconcerned provincial organizations;\n(m)         shall monitor the mechanism and institutional procedure for redressal of violation of\nwomen's rights; and\n(n)         may perform any other functions which may be assigned to it by the Federal\nGovernment.\n1\nSubs. by Act No. III of 2025, s.4."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Meetings of the Commission",
      "content": "(1) A meeting of the Commission shall be held in each\nquarter of the year at such times and at such place as the Chairperson may decide. The Chairperson\nmay call additional meetings if and when required.\n(2) All meetings shall be chaired by the Chairperson.\n(3) The Commission will consider, approve and monitor implementation of the Strategic Plan\nand the Annual Budget.\n(4) The Commission shall, with the approval of Executive Committee, fix an honorarium or\nremuneration of advisors, consultants and experts as may be prescribed.\n(5) The meeting of the Commission shall be conducted in accordance with the procedure as\nmay be prescribed.\n(6) All decisions of the Commission shall be authenticated by the signature of the Chairperson\nor any person authorized in this behalf by the Chairperson.\n(7) The quorum for the meeting of the Commission shall not be less than one half of the total\nstrength of the Commission.\n(8) The decisions of the Commission shall be taken by the majority of the members present. In\ncase of a tie, the Chairperson of the meeting shall have the casting vote.\n(9) No act or proceeding of the Commission shall be invalid on the ground merely of the\nexistence of any vacancy in or defect in the constitution of the Commission."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Appointment of Committees of the Commission",
      "content": "(1) There shall be an Executive\nCommittee of the Commission consisting of the Chairperson and three other members to be appointed\nby the Commission which shall be responsible to oversee the implementation of the decisions and\nrecommendations of the Commission.\n(2) The Commission may establish such other Committees from amongst its members as it\ndeems fit and may refer to them any matter for consideration and report. The Commission may, if it\nconsiders necessary, co-opt to a Committee any person possessing special knowledge and expertise on\nthe relevant subject.\n(3) All Committees except the executive Committee will be time bound."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Fund",
      "content": "(1) There shall be established by the 1[administrative division in consultation with\nministry of finance] a Fund to be known as the National Commission on the Status of Women Fund,\nwhich shall vest in the Commission and shall be used by the Commission to meet charges in connection\nwith its functions under this Act.\n1\nSubs. by Act No. III of 2025, s.5.\n(2) Source of the Fund amongst other moneys may be the following,__\n(a)         such fund as the Federal Government shall allocate each year as a non-lapsable grant\nin the annual budget;\n(b)         donations, if any, made by private individuals, national and international agencies;\n(c)         income from investment by the Commission, as may be prescribed;\n(d)         all funds held by the Federal Government under the title of ‘National Commission's\nFund; and\n(e)         all other sums or properties or assets which may in any manner become payable to or\nvest in, the Commission in respect of any matter.\n(3) The Commission whilst performing its functions and exercising its powers under this Act,\nshall ensure the highest sense of prudence in respect of expenditures incurred.\n(4) The Fund shall be expended for the purpose of,__\n(a)         Performing functions of the Commission;\n(b)         the establishment charges, including its members, employees, consultants, legal and\nother fees and costs; and\n(c)         such other activities which fall within the purview of the Commission.\n(5) The Commission may invest its Fund in accordance with the instructions of the Federal\nGovernment.\n(6) The Chairperson shall be the Principal Accounting Officer of the Commission."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Accounts and Audit",
      "content": "(1) The Commission shall maintain proper accounts and other\nrelevant records and prepare an annual statement of accounts in such form as may be prescribed by the\nFederal Government in consultation with the Auditor-General of Pakistan.\n(2) The accounts of the Commission shall be audited by the Auditor-General at such intervals\nas may be specified by him or her.\n(3) The Auditor-General and any other person appointed by him or her in connection with the\naudit of the accounts of the Commission under this Act shall have the same rights and privileges and\nthe authority in connection with such audit as the Auditor-General generally has in connection with\nthe audit of Federal Government accounts and in particular shall have rights to demand the production\nof books, accounts connected vouchers and other documents and papers and to inspect any of the\noffices of the Commission.\n(4) The accounts of the Commission, as certified by the Auditor-General or any other person\nappointed by him or her in this behalf, together with the Audit Report, thereon shall be forwarded\nannually to the 1[administrative division] by the Commission and the 1[administrative division] shall\ncause the audit report to be laid, as soon as may be after it is received, before each House of Parliament.\n1\nSubs. by Act No. III of 2025, s.6."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Annual Report of the Commission",
      "content": "(1) The Commission shall prepare its Annual Report\nand shall be presented to the Prime Minister and concerned Ministry. The Annual report shall include\nan account of its performance and utilization of funds.\n(2) The Annual Report of the Commission shall be laid and discussed in the Parliament."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Assistance to the Commission",
      "content": "All Federal executive authorities shall assist the\nCommission in the performance of its functions."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Indemnity",
      "content": "No suit, prosecution or legal proceedings shall lie against the Commission,\nthe Chairperson or any Member, officer, employees, advisors or consultants of the Commission in\nrespect of anything done in good faith or intended to be done under this Act or the Rules made there\nunder or order made, or publication by or under the authority of the Federal Government, a Provincial\nGovernment, Commission or any report, paper or proceedings."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Members and officers to be public servants",
      "content": "Every member of the Commission and\nevery officer appointed or authorized by the Commission to exercise functions under this Act shall be\ndeemed to be a public servant within the meaning of section 21 of the Pakistan Penal Code (Act XLV\nof 1860)."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Power to make Rules",
      "content": "(1) The Federal Government in consultation with the Commission\nand by notification in the official Gazette, make Rules for the purpose of giving effect to the provisions\nof this Act.\n(2) The rules of the Commission shall be made within ninety days of the commencement of\nthis Act."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Delegation of powers",
      "content": "The Commission may subject to such conditions, as it may\nspecify, delegate any of its powers under this Act to the Executive Committee or member and to other\nsuch committees formed by the Commission."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Power to remove difficulties",
      "content": "If any difficulty arises in giving effect to the provisions of\nthis Act, the Federal Government may by order published in the official gazette make such provisions\nnot inconsistent with the provisions of this Act as appears to it, be necessary or expedient for removing\nthe difficulty:\nProvided that this power shall be available for a period of one year from the date of\ncommencement of this Act."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Repeal",
      "content": "(1) The National Commission on the Status of Women Ordinance, 2000 (XXVI\nof 2000), hereinafter called as the repealed Ordinance, is hereby repealed.\n(2) Notwithstanding the repeal of Ordinance referred to in sub-section (1).__\n(a)   any notification, rule, regulation, bye-law, order or exemption issued, made or granted\nunder the repealed Ordinance shall have effect as if it had been issued, made or granted\nunder the corresponding provision of this Act;\n(b)   any official appointed and any body elected or constituted under the repealed Ordinance\nshall continue and shall be deemed to have been appointed, elected or constituted, as\nthe case may be, under the corresponding provision of this Act;\n(c)   any document referring to the repealed Ordinance shall be constructed as referring, as\nfar as may be, to this Act, or to the corresponding provision of this Act.\n(3) The provisions of the General Clauses Act, 1897 (X of 1897), in general, and sections 6, 8\nand 24 thereof, in particular, shall apply to the repeal and re-enactment of the repealed Ordinance.\n_______\nDate: 18.3.2025\n113365"
    }
  ],
  "definitions": [
    {
      "term": "Chairperson",
      "definition": "the Chairperson of the Commission as appointed under section 4, and includes acting chairperson appointed under section 7;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the National Commission on the status of Women established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "girl",
      "definition": "a female human being under the age of eighteen years;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "the Member of the Commission;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Secretary",
      "definition": "the Secretary of the Commission appointed under section 9; and",
      "source_provision": "sec2"
    },
    {
      "term": "women",
      "definition": "a female human being of eighteen years or above.",
      "source_provision": "sec2"
    }
  ]
}
