{
  "id": "pk-national-database-and-registration-authority-ordinance-nadra-2000",
  "type": "statute",
  "title": "National Database and Registration Authority Ordinance (NADRA), 2000",
  "title_en": "National Database and Registration Authority Ordinance (NADRA), 2000",
  "short_name": "NDARA",
  "status": "in_force",
  "issued_date": "2000-03-09",
  "in_force_date": "2000-03-09",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tq-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Database and Registration Authority Ordinance (NADRA), 2000 (VIII of 2000) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Safe and proper custody of cards",
      "content": "(1) Every person to whom a card is issued by the\nAuthority shall be responsible for its safe custody and for maintaining it in proper shape.\n(2) The Authority may by regulations prescribe standards for custody and maintenance of\nvarious cards issued by it."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Inspection of cards. A Registration Officer or any officer under the control of and",
      "content": "authorized by the Authority in this behalf may require a person to whom any card has been issued to\nproduce the card for inspection before him or, if it is not in his possession when so required to produce\nit within such time, before such officer and at such place as the Registration Officer or the officer so\nauthorized may direct."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Surrender of cards",
      "content": "(1) In case of the death of any holder of a card or certificate issued\nunder this Ordinance, his card or certificate shall be surrendered or given up to the District Registrar,\nor any other person or authority prescribed by regulations, by the spouse, heir, next of kin, parent or\nguardian, as the case may be, of such holder within sixty days of such death.\n(2) The holder of a card who ceases to be eligible to hold such card or whose card becomes\ninvalid in accordance with the terms and conditions of his card or under the provisions of this\nOrdinance or any rules or regulations made thereunder, shall surrender or give up his card to the District\nRegistrar or any other person or authority prescribed by regulations within such period of his so ceasing\nto be eligible or his card becoming invalid, as may be prescribed.\n(3) The Authority shall issue such receipt in relation to the card or certificate surrendered under\nthis section in such form and manner and containing such information relating to the person whose\ncard or certificate has been surrendered as may be prescribed.\n(4) A receipt issued under sub-section (3) shall be admissible in evidence for the purpose of\nproving the information or particulars contained in such receipt relating to the person to whom such\nreceipt relates."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Power to cancel, impound or confiscate cards",
      "content": "(1) A card issued under this Ordinance\nshall be the property of the Federal Government and may, by an order in writing under the seal of the\nAuthority or an officer authorised by it in this behalf, be required to be returned and shall also be liable\nto be cancelled, impounded or confiscated by a like order:\nProvided that no order shall be made unless such person has been given notice in writing calling\nupon him to show cause why the order should not be made.\n(2) An order under sub-section (1) cancelling, impounding or confiscating a card may be made\nonly if there is reason to believe that-\n(a)     the card has been obtained by a person who is not eligible to hold such card, by\nposing himself as eligible;\n(b)     more than one cards have been obtained by the same person on the same\neligibility criteria;\n(c)    the particulars shown on the card have been obliterated or tampered with; or\n(d)    the card is forged.\n(3) Any person in respect of whose card an order under sub-section (1) has been made may,\nwithin thirty days of the order, appeal to the Federal Government against the order and the decision of\nthe Federal Government in appeal shall be final:\nProvided that no order on such appeal shall be passed unless the appellant has been given an\nopportunity of being heard."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Cards necessary for certain purposes",
      "content": "(1) No citizen who has attained the age of\neighteen years but does not possess or produce a National Identity Card shall be granted a passport,\npermit or other travel document for going out of Pakistan.\n(2) Any officer charged with the duty of conducting the poll at an election to the National\nAssembly or a Provincial Assembly or to a municipal committee, cantonment board or other local\nauthority or body may, for the purpose of satisfying himself as to the identity of any person, require\nsuch person to produce his National Identity Card.\n(3) The Federal Government may, by notification in the Official Gazette, specify any other\npurpose for which the production of any card or certificate or receipt issued under this Ordinance shall\nbe necessary.\n(4) A card including a National Identity Card, issued to a person under this Ordinance shall be\nproof of his identity as could be established from the contents of such card for any purpose for which\nhis identity is required to be established."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Power to exempt. The Federal Government, or with the approval of Federal Government,",
      "content": "the Authority or any officer authorised by the Authority in this behalf may, by order, in special\ncircumstances to be recorded in writing exempt any person or class of persons from the requirement of\npossessing or producing any card for any purpose for which it is required by or under this Ordinance, or\nany rules or regulations made thereunder, to be possessed or produced."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Information relating to births, deaths, marriages, divorces, etc",
      "content": "(1) The birth of a\nnewly born citizen and the death of a citizen or any other prescribed persons or class thereof, shall be\nreported to the District Registrar by such authority or officer in such manner as the Authority may, by\nregulations, prescribe.\n(2) The marriage or divorce of a citizen or any other prescribed persons or class thereof, shall\nbe reported to the District Registrar by such authority or officer as may be prescribed by regulations."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Information and assistance by user or feeder agencies",
      "content": "(1) The Authority may request\na user or feeder agency for information or other necessary assistance and co•operation.\n(2) All user or feeder agencies shall comply with all such reasonable requests of the Authority\nas are made in order to carry out the purposes of this Ordinance.\n(3) Any such compliance shall be made in a timely, complete and effective manner and the\nAuthority may, if deemed fit in a particular case, fix such reasonable period of time for compliance\nwith its request by a user or feeder agency as may be necessary in the circumstances and the concerned\nuser or feeder agency shall be bound by such dead•line.\n(4) It shall be the duty of the head of a user or feeder agency to whom a request is made by the\nAuthority to ensure compliance with the provisions of this section and sub-section (3) of section 7 on\npart of his user or feeder agency."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Power to call for proof of information. The Authority or any person authorized by it in",
      "content": "this behalf may require a person who has given any information to furnish such documentary or other\nevidence of the truth of that information as it is within the power of that person to furnish.\n__________\nFUND, ACCOUNTS AND AUDIT"
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. NADRA Fund",
      "content": "(1) There shall be formed a non-lapsable fund vesting in the Authority\nto be known as the “NADRA Fund” for the purpose of meeting charges in connection with the\nfunctions and operations of the Authority under this Ordinance, including payment of salaries and other\nremuneration payable to the Chairman, members, Registration Officers, members of its staff, experts,\nconsultants, advisers and other officers and employees of the Authority.\n(2) There shall be placed to the credit of NADRA Fund, all funds received by the Authority\nfrom which the Authority can incur expenditure related to its functions and operations, including—\n(a)   grants made by the Federal Government or any Provincial Government or local\nauthority;\n(b)   funds provided by the Federal Government or any Provincial Government or\nlocal authority;\n(c)   loans obtained from the Federal Government or any Provincial Government or\nlocal authority;\n(d)    other loans obtained by the Authority;\n(e)     foreign aid, grants and loans negotiated and raised, or otherwise obtained, by\nthe Authority;\n(f)    fees and other sums charged for the provision of services and other transactions,\noperations and matters, etc. including fees or other sums charged for\nregistration, or received for or in relation to the issuance or renewal of cards, or\nfor the provision of any information or report, automated or otherwise, to any\ngovernmental, private or any other person or entity, etc;\n(g)    income from the sale of movable or immovable property;\n(h)     funds from floating bonds, shares, debentures, commercial papers, modarbas or\nother securities issued by the Authority or through any other means; and\n(i)    all other sums received by the Authority.\n(3) The NADRA Fund shall be kept in one or more accounts maintained by the Authority in\nlocal or foreign currency in any scheduled bank in Pakistan and shall be operated in accordance with\nregulations of the Authority.\n(4) Notwithstanding anything contained in this Ordinance or any rules or regulations made\nthereunder, all charges in connection with the functions and operations of the Authority under this\nOrdinance, except such functions and operations as are envisaged to be funded by any Provincial\nGovernment or local authority or as may be notified by the Authority to the Federal Government from\ntime to time, shall be exclusively funded by the Federal Government including all administrative,\noperating and any other expenses like payment of salaries and other remuneration to the Chairman, the\nmembers, the Registration Officers, its staff, experts, consultants, advisers and other officers and\nemployees appointed or employed or deemed to have been appointed or employed under section 35 of\nthis Ordinance and any such funding or budgetary allocation furnished or made by the Federal\nGovernment for the establishment charges of the Authority shall be placed to the credit of NADRA\nFund but shall be lapseable unlike the rest of NADRA Fund and the concerned account shall be\noperated as a Personal Ledger Account to the extent of such funding or budgetary allocation furnished\nor made as aforesaid:\nProvided that responsibility of the Federal Government to exclusively fund the operations and\nfunctions of the Authority shall cease at such appropriate time, but not in any case earlier than the\nexpiry of three calendar years from the date of establishment of the Authority, when in the opinion of\nthe Federal Government, the Authority shall have become capable of funding its functions and\noperations envisaged under this Ordinance to be funded by the Authority:\nProvided further that the Federal Government shall notify such time as aforesaid to the\nAuthority with precision at least three months prior to such precise time being so notified."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Authority to be deemed to be a local authority. The Authority shall be deemed to be a",
      "content": "local authority under the Local Authorities Loans Act, 1914 (IX of 1914), for the purpose of borrowing\nmoney under the said Act, and the making and execution of any scheme, proposal or plan or the\nperformance of any of its functions laid down in this Ordinance shall be deemed to be a work which\nsuch authority is legally authorised to carry out."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Budget. The Authority shall, in respect of each financial year submit for the approval of",
      "content": "Federal Government by such date and in such form as may be specified by the Federal Government a\nstatement showing the estimated receipts and current and development expenditure and the sums which\nare likely to be required from the Federal Government during the next financial year.\n1[26A. Surplus to be remitted to Federal Consolidated Fund.— Any surplus of receipts over\nthe actual expenditure in a year, after payment of tax, shall be remitted to the Federal Consolidated Fund\n(FCF) and any deficit from the actual expenditure shall be made up by the Federal Government to the\nextent of funds deposited in FCF]"
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Accounts and Audit",
      "content": "(1) The Authority shall maintain complete and accurate books of\naccounts of its actual expenses and receipts.\n(2) The Authority shall cause to be carried out audit of its accounts by one or more auditors who\nare chartered accountants within the meaning of the Chartered Accountants Ordinance, 1961 (X of 1961)\nappointed by the Federal Government in consultation with the Auditor General of Pakistan from a panel\nof Chartered accountants proposed by the Authority on such remuneration as the Federal Government\nmay determine.\n1\nIns. by financial act No V of 2019 s.10.\nOFFENCES, PENALTIES AND PROCEDURE"
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Information not to be divulged. Any person who",
      "content": "(a)     being a person employed for the purposes of this Ordinance, publishes or\ncommunicates to any person, otherwise than in the ordinary course of such\nemployment, any information acquired by him in the course of the employment;\nor\n(b)     having possession of any information which to his knowledge has been\ndisclosed in contravention of this Ordinance, publishes or communicates that\ninformation to any other person,\nshall be punishable with imprisonment for a term which may extend to five years, or with fine which\nmay extend to one million rupees, or with both:\nProvided that nothing in this section shall apply to any publication or communication of\ninformation made—\n(a    ) for the purpose of any criminal proceedings; or\n(b)   to any gazetted officer authorised by the Authority."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Security, secrecy, etc. of data not to be breached",
      "content": "(1) No person shall use, or deal with,\nor do any other thing or act of omission or commission in relation to—\n(a)     the registration or database systems developed, established or maintained, or so\ncaused to be developed, established or maintained, under this Ordinance\nincluding any database, data warehouse or networking infrastructure; or\n(b)   the data or information contained, or housed, or transmitted therein,\nin contravention of the regulations made under clause (d) of sub-section (4) of section (5).\n(2) Whoever contravenes the provisions of sub-section (1) shall be punished with rigorous\nimprisonment for a term which may extend to fourteen years, or with fine commensurate with the\nnature of offence and harm, if any, caused to a particular registration or database system as aforesaid\nby such contravention, but in any case not less than one million rupees, or with both."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Other offences and penalties",
      "content": "(1) Any person who—\n(a)     does not, without reasonable cause, apply for registration required under this\nOrdinance;\n(b)     conceals, or refuses to furnish, any information he ought to disclose or furnish;\n(c)     fails, without reasonable cause, to report to any Registration Officer any loss of\na card within thirty days of such loss;\n(d)        refuses or fails to produce or surrender a card as required respectively under\nsection 17 or section 18 of this Ordinance or the rules and regulations made\nthereunder;\n(e)       does not, without reasonable cause, apply for a National Identity Card within\nninety days of his attaining the age of eighteen years; or\n(f)        knowingly contravenes any other provision of this Ordinance or the rules or\nregulations except regulations made under clause (d) of sub-section (4) of\nsection 5,\nshall, in addition to any other penalty to which he may be liable under any other law, be punishable\nwith rigorous imprisonment for a term which may extend to six months, or with fine not exceeding\nfifty thousand rupees, or with both.\n(2) Any person who—\n(a)        makes any statement or furnishes any information which he knows or has reason\nto believe to be false in any material particular or which he does not believe to\nbe true;\n(b)      obliterates or changes any particulars written or printed on any card;\n(c)         forges any card or makes or has in his possession any document so closely\nresembling a card as to be calculated to deceive;\n(d)      allows any other person to have possession of a card for the custody of which\nhe is responsible;\n(e)      holds more than one card on the same eligibility criteria; or\n(f)        who attests or verifies any statement or information made or furnished for the\npurpose of this Ordinance which he knows or has reason to believe to be false\nin any material particular or which he does not believe to be true,\n1\n[(g) is an employee of Authority, and is involved in the issuance of a fake National\nIdentity Card, or the officer•in•charge of that Branch] and\nshall, in addition to any other penalty to which he may be liable under any other law, be punishable\nwith rigorous imprisonment for a term which may extend to 1[five years] or with fine not exceeding\none hundred thousand rupees, or with both:\nProvided that nothing in this section shall apply to a person acting pursuant to a request made\nby the Authority under section 22.\n1Added and Subs. by Act XIX of 2011, s. 2\n[30A. Fines and penalties to be credited to the Federal Consolidated Fund. All fines and\n1\npenalties recovered by the Authority shall be credited to the Federal Consolidated Fund.]"
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Cognizance of offences. No court shall take cognizance of any offence under this",
      "content": "Ordinance except upon complaint in writing made by the Authority or any gazetted officer authorised\nby it in this behalf."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Trial of offences",
      "content": "(1) No court inferior to that of a Magistrate of the first class shall try\nan offence punishable under this Ordinance.\n(2) Notwithstanding anything contained in section 32 of the Code of Criminal Procedure, 1898,\n(Act V of 1898) it shall be lawful for any Magistrate of the first class to pass any sentence authorised\nby this Ordinance even if such sentence exceeds his powers under the said section 32.\n(3) Any Magistrate of the first class empowered, for the time being, to try in a summary way\nV of 1898), may try in accordance with the provisions contained in sections 262 to 265 of the Code\nany offences punishable under this Ordinance.\n_________"
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Remuneration. The Chairman and members shall be paid such emoluments as may be",
      "content": "determined by the Federal Government and shall not be varied to their disadvantage during their term\nof office."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Chairman and members not to engage in certain business, etc",
      "content": "(1) The Chairman and\nmembers shall not, during their term of office, engage themselves in any other service, business,\nvocation or employment, or enter into the employment of, or accept any advisory or consultancy\nrelationship with any person or entity engaged in providing services or products whatsoever to the\nAuthority on, any of the projects, schemes, proposals or plans undertaken, executed or supervised by\nthe Authority or any related undertaking of such aforesaid person or entity.\n(2) The Chairman and members shall not have any direct or indirect financial interest, or have\nany connection with any such person, entity or related undertaking as mentioned in sub-section (1) for\nso long as he holds office."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Registration Officers, officers, employees, etc. To carry out the purposes of this",
      "content": "Ordinance, the Authority may, from time to time, appoint Registration Officers, members of its staff,\nexperts, consultants, advisers and other officers and employees on such terms and conditions as it may\ndeem fit."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Registration Officers, etc. deemed to be public servants. The Chairman, members,",
      "content": "Registration Officers, members of its staff, experts, consultants, advisors, other officers and employees\nof the Authority shall be deemed to be public servants within the meaning of section 21 of the Pakistan\nPenal Code, 1860 (XLV of 1860).\n__________________________________________________________________________\n1\nIns. by financial act No V of 2019 s.10."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Delegation. The Authority may by general or special order delegate to the Chairman or a",
      "content": "member or a Registration Officer, or any member of its staff, or an expert, consultant, adviser, or other\nofficer or employee of the Authority, any of its powers or functions under this Ordinance subject to\nsuch conditions as it may think fit:\nProvided that any person to whom the powers of a Registration Officer, not including the\nDirector General, stood delegated under the provisions of the National Registration Act, 1973 (LVI of\n1973), immediately before the commencement of this Ordinance shall be deemed to have been\ndelegated under this section unless revoked by the Authority by a general or special order."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Reports to the Governments",
      "content": "(1) The Authority shall submit at the end of every calendar\nyear, but not later than 31st of January of the following year—\n(a)     a report to the Federal Government on the performance of its functions and\nexercise of its powers and the carrying out of its purpose and objects during the\nyear so ending and the anticipated developments for the following year; and\n(b)     a report on the state of development, establishment and maintenance of\nregistration and database systems in the country and all related matters\nidentifying the problems, prospects and other necessary areas and matters for\nthe Federal Government, or concerned Provincial Government or local\nauthority's consideration and action, if any suggested in the report.\n(2) Copies of the report, or relevant portions thereof, mentioned in clause (b) of sub-section (1)\nidentifying problems, prospects and other necessary areas and matters for a particular Provincial\nGovernment's or local authority's consideration or action shall also be furnished simultaneously to the\nconcerned Provincial Government or local authority."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Certain arrangements to continue. All contracts, agreements, promises, negotiations and",
      "content": "working arrangements made and understandings reached including any bidding process initiated as a\nresult of any requests for proposals sought from prospective contractors, and all liabilities incurred\nincluding any contingent or future liability on account of availing any services, etc., by the National\nDatabase Organization and the Registration Organization on behalf of the Federal Government in\nconnection with, or for the purpose of, or in relation to the same objects, purposes, functions and powers\nas those of the Authority, before the establishment of the Authority, shall be deemed to have been\nmade, reached or incurred, as applicable, by the Authority under this Ordinance and shall have effect\naccordingly."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Indemnity. No suit, prosecution or other legal proceeding shall lie against the Federal",
      "content": "Government or any Provincial Government or Local Authority, any Registration Officer or any other\nperson exercising any power or performing any function under this Ordinance, for anything which is\nin good faith done or purporting or intended to be done under this Ordinance or any rule."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Transfer of employees and assets etc",
      "content": "(1) Notwithstanding anything contained in any\nlaw, rules regulations, contract, agreement, or in the terms and conditions of their service or in the\nprovisions of the National Registration Act, 1973 (LVI of 1973), the Civil Servants Act, 1973 (LXXI\nof 1973), on the establishment of the Authority, all persons appointed or employed in the National\nDatabase Organization and the Registration Organization, immediately before the establishment of the\nAuthority, in particular, all Registration Officers appointed pursuant to section 3 of the National\nRegistration Act, 1973 (LVI of 1973), and other officers and employees, whether recruited initially or\nabsorbed or inducted subsequently, including a person on deputation to any other organization,\ndepartment, agency or formation in Pakistan or abroad but not being person on deputation or\nsecondment to the Registration Organization or the National Database Organization from any other\norganization, department, agency or formation, shall stand transferred to and become Registration\nOfficers and other officers and employees, as applicable, of the Authority on the same terms and\nconditions including remuneration, tenure of service, rights and privileges as to pension and gratuity\nand other matters which were applicable to them immediately prior to the establishment of the\nAuthority.\n(2) The Federal Government shall pay to the Authority, pension charges and gratuity in respect\nof, and provident fund accumulations of, persons transferred to the Authority by virtue of sub-section\n(1) or sub-section (9), as they have become entitled to, or have been earned by them, or have\naccumulated till their transfer to the Authority as aforesaid.\n(3) On transfer to the Authority as provided in sub-section (1) or sub-section (9), all\nRegistration Officers and other officers and employees shall, where applicable, cease to be civil\nservants and shall be deemed to have been appointed and have respectively become the Registration\nOfficers and other officers and employees of the Authority as if originally appointed under this\nOrdinance as if they were always the Registration Officers, officers and employees of the Authority,\nas applicable, except for the purposes of financial benefits which they shall not claim from a date prior\nto the date of their transfer to the Authority as aforesaid.\n(4) On transfer as aforesaid, such a Registration Officer, other officer or employee, until his\nemployment in the Authority is terminated in accordance with his terms and conditions of service or\nhis terms and conditions as altered by regulations which shall not be less favourable than those by\nwhich he was governed immediately before his transfer to the Authority, shall continue to be so\ngoverned.\n(5) Notwithstanding anything to the contrary in this section, any person referred to in sub-\nsection (1) may within three months from the date of establishment of the Authority opt not to be\ntransferred to the service of the Authority and the option so exercised shall be final and those persons\nwho do not exercise their right of option in writing within the aforesaid period shall be deemed to have\nopted to be transferred to the Authority.\n(6) All persons who opt under sub-section (5) not to be transferred to the service of the\nAuthority shall be provided a suitable posting elsewhere within six months from the date of exercise\nof their option and till that time they shall remain on surplus pool of the Federal Government.\n(7) The service of a person who does not accept the alternative appointment or posting offered\nto him within the time allowed by sub-section (6) shall stand terminated on the date on which he\ndeclines the offer or the time allowed to accept the offer expires, whichever is earlier, and such persons\nshall be entitled to be paid for a maximum period of three months.\n(8) The termination of services of an employee under sub-section (7) shall be deemed to be\ndischarge from service owing to abolition of a permanent post for the purposes of admissibility of\ncompensation pension, etc.\n(9) Every person on deputation or secondment to the Registration Organization or the National\nDatabase Organization from any other organization, department, agency or formation immediately\nbefore the establishment of the Authority shall, on such establishment, have an option either—\n(a)         to remain employed in the Authority as a deputationist on the same terms and\nconditions of deputation as were applicable to him immediately before the\nestablishment of the Authority; or\n(b)        to opt for being absorbed in the Authority whereupon, if his option is so\naccepted by the Authority, he shall stand and be deemed to have been transferred\nto the Authority from the date of establishment of the Authority on such terms\nand conditions of service as the Authority may deem fit, which shall however not\nbe less favourable, than those applicable to him as per his terms and conditions\nof deputation immediately before the establishment of the Authority:\nProvided that the aforesaid option must be exercised within one month of the establishment of\nthe Authority, where after a person not exercising either of the above options, or having opted under\nclause (b) but not accepted by the Authority, shall be deemed to have opted under clause (a) and all\nconsequences shall thereafter accrue as if he had so opted under the said clause.\n(10) No person who stands transferred to the Authority by virtue of sub-section (1) or\nsub-section (9) shall, notwithstanding anything contained in any law for the time being in force, be\nentitled to any compensation because of such transfer.\n(11) Any assets or other property of the Federal Government assigned or allocated for their use\nor any other purpose to such offices including the District Registration Offices, other offices, counters\nand any other formation of the Registration Organization as well as that of the National Database\nOrganization shall stand transferred to and vested in the Authority.\n(12) All suits and other legal proceedings instituted by or against the Federal Government, the\nDirectorate of National Registration and the National Database Organization immediately before the\ncommencement of this ordinance shall be deemed to be suits and proceedings by or against the\nAuthority, as the case may be, and may proceed and be dealt with accordingly.\n(13) All debts and liabilities incurred, contracts entered into or rights acquired and all matters\nand things, engaged to be done, by with and for the Directorate of National Registration and the\nNational Database Organization before the commencement of this ordinance shall be deemed to have\nbeen incurred, entered into, acquired or engaged to be done by, with or for the Authority as the case\nmay be.\n1[41-A. Transfer of assets and liabilities of Alien Registration Authority.— (1) On transfer\nof the Alien Registration Authority (NARA) under Section 17 of the Foreigners Act, 1946 (XXXI of\n1946), all employees of the NARA shall, subject to the following provisions, cease to be civil servants\nwithin the meaning of the Civil Servants Act, 1973 (LXXI of 1973) and shall be deemed to have always\nbeen appointed on comparable posts of the Authority, except for the purposes of financial benefits\nwhich shall not be admissible to them prior to the date of their transfer to the Authority.\n1\nIns. by Act, No. XXVII of 2016, s. 3\n(2) Notwithstanding anything to the contrary contained in this section, any person referred to\nin sub-section (1) may, within three months of the transfer, exercise an irrevocable option either to\nremain civil servant or, as the case may be, become employee of the Authority:\nProvided that where any person does not exercise the option within the said period he shall be\ndeemed to have opted to become employee of the Authority.\n(3) Any person who opts under sub-section (2) to remain civil servant shall be provided with a\ncomparable posting elsewhere within three months of the exercise of option and till such posting\nremain on surplus pool of the Federal Government.\n(4) On transfer as aforesaid, a person, until his employment in the Authority is terminated in\naccordance with his terms and conditions of service or his terms and conditions as altered by\nregulations which shall not be less favourable than those by which he was governed immediately before\nhis transfer, shall continue to be governed accordingly.\n(5) No person who stands transferred to the Authority by virtue of sub-section (2) shall,\nnotwithstanding anything contained in any law for the time being in force, not entitled to any\ncompensation because of such transfer.\n(6) All assets and liabilities of the NARA including its counters and other formations shall, on\ncommencement of the Foreigners (Amendment) Act, 2016 (XX of 2016), stand transferred to and\nvested in the Authority.\n(7) The Federal Government shall pay to the Authority capitalized value of pension and gratuity\nin respect of employees, transferred to the Authority under sub•-section (1) to which they have become\nentitled to or have been earned by them or have accumulated till their transfer to the Authority.\n(8) All suits and other legal proceedings instituted by or against the Federal Government and\nNARA in respect of the matters of the foreigners registration immediately before commencement of\nof the Authority on and from such commencement and shall be dealt with by the Authority accordingly.\n(9) All debts and liabilities incurred, contracts entered into or rights acquired and all matters\nand things done, engaged or to be done by or for the NARA immediately before commencement of\nbeen incurred, entered into, acquired, done. engaged or, as the case may be, to be done by or for the\nAuthority.]"
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Exemption from taxes. Notwithstanding anything contained in the 1[Income Tax",
      "content": "Ordinance, 2001 (XLIX of 2001)] or any other law for the time being in force relating to income-tax,\nsuper tax and wealth• tax, the Authority shall not be liable to pay and be exempted from paying any\nsuch taxes as aforesaid on its incomes, profits or gains for a period of five years beginning from the\ndate of its establishment.\n1\nSubs. by Act No. V of 2007, s. 3"
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Ordinance 1[XCI of 2002] not to apply to Authority. The Industrial Relations Ordinance,",
      "content": "1\n[2002 (XCI of 2002)] shall not apply to or in relation to the Authority or any person in the service of\nthe Authority."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Power to make rules. The Federal Government may, by notification in the Official",
      "content": "Gazette, make rules for carrying out the purposes of this Ordinance:\nProvided that till the time any amendments are made or any fresh rules are made in this behalf,\nmanner as before to the extent the same are not inconsistent with the provisions of this Ordinance with\nany references to the Registrar General, Director General Registration Organization, or any competent\nauthority by whatever nomenclature therein to be deemed to be a reference to the Authority."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Regulations",
      "content": "(1) The Authority may, by notification in the official Gazette, make\nregulations, not inconsistent with the provisions of this Ordinance or the rules, for the carrying out of\nits functions under this Ordinance and any other matter for which, under this Ordinance, provision may\nbe made by regulations.\n(2) Without prejudice to the generality of the foregoing powers, such regulations may provide\nfor appointment of Registration Officers, members of its staff, experts, consultants, advisers and other\nofficers and employees and the terms and conditions of their service:\nProvided that, subject to the provisions of section 40 till the time any amendments are; made\nor any fresh regulations are made in this behalf, any rules or regulations governing the terms and\nconditions of their service and in force at the time of the establishment of the Authority shall be applied\nas nearly as practicable in the same manner as before to the extent the same are not inconsistent with\ncompetent authority by whatever nomenclature therein to be deemed to be a reference to the Authority."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Ordinance to override other laws. The provisions of this Ordinance shall have effect",
      "content": "notwithstanding anything contained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Removal of difficulties. If any difficulty arises in giving effect to any provision of this",
      "content": "Ordinance, the Federal Government may make such order, not inconsistent with the provisions of this\nOrdinance, as may appear to it to be necessary for the purpose of removing the difficulty."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Repeal",
      "content": "(1) The National Registration Act, 1973 (LVI of 1973), is hereby repealed.\n(2) Notwithstanding the repeal of the National Registration Act, 1973 (LVI of 1973), any\nnotification issued, powers delegated, contracts entered into, proceedings commenced, rights and\nliabilities incurred, fee or charges levied, things done or actions taken under any provision of the said\nAct shall, so far as they are not inconsistent with the provision of this Ordinance, be deemed to have\nbeen made, passed, issued, delegated, entered into, commenced, acquired, incured, levied, done or\ntaken under this Ordinance.\n1\nSubs by Act V of 2007, s. 4"
    }
  ],
  "definitions": []
}
