{
  "id": "pk-national-forensics-agency-act-2024",
  "type": "statute",
  "title": "National Forensics Agency Act, 2024",
  "title_en": "National Forensics Agency Act, 2024",
  "short_name": "NFAA",
  "status": "in_force",
  "issued_date": "2024-12-23",
  "in_force_date": "2024-12-23",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pqbg%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Forensics Agency Act, 2024 (XXXVII of 2024) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act shall be called the National Forensics\nAgency Act, 2024.\n(2) It shall extend to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the subject or context,—\n(a) “Agency” means the National Forensics Agency established under section 3 of this Act;\n(b) “alumni” means the alumni of, inter alia, science, technology, engineering, mathematics\n(STEM) Careers Program, Higher Education Commission of Pakistan or any other STEM\nprogram of any university of Pakistan who is a citizen of Pakistan;\n(c) “artificial intelligence” or “AI” means the use of intelligent and smart technologies to\ncreate a system that depicts humans or human systems using machines;\n(d) “Board” means a Board of Governors of the Agency constituted. under section 6 of this\nAct;\n(e) “conventional forensics” conventional forensics refers to traditional methods and\npractices used in the investigation of crimes or incidents. It includes pathology,\nanthropology, DNA analysis, toxicology, narcotics, fingerprints, serology, ballistics,\nexplosives, odontology, entomology, document examination and crime scene\ninvestigation, etc.;\n(f) “consultant” an alumni, expert or company in a relevant field who or which may be\nhired for a specific period of time on a specified fee determined by the Board;\n(g) “deep fake” means an audio, video, picture or any other form of fabricated digital media\nusing AI deep learning algorithms to impersonate or malign any real or imaginary person;\n(h) “Director General” or “DG” means the Director General of the Agency;\n(i) “digital forensics” also known as computer forensics, a branch that focuses on the\ninvestigation and analysis of digital devices and electronic data to gather evidence for\nlegal purposes. Its branches include computer forensics, mobile device forensics, network\nforensics, memory forensics, digital forensics imaging, database forensics and cloud\nforensics etc.;\n(j) “employee” means an officer, official, expert or such other person appointed on regular\nbasis;\n(k) “forensics services” means to render expert opinion with regards to forensics cases\nreferred to the Agency by a court, tribunal or an authority;\n(l) “forensics material” means a document, material, equipment, impression, sample or any\nother object connected with the commission of an offence, a civi1 cause, an inquiry or\nany other proceedings;\n(m) “Government” means the Federal Government;\n(n) “project” means any identified and approved project of the agency;\n(o) “prescribed” means prescribed by rules and regulations made under this Act;\n(p) “rules” means rules made under this Act; and\n(q) “regulations” means regulations made under this Act.\n(2) Words or expressions used but not defined under this Act shall have the same meaning as\nassigned thereto in the Pakistan Penal Code (Act XLV of 1860), the Code of Criminal Procedure,1898\n(Act V of 1898), the Qanun-E-Shahadat Order, 1984 (P.O. No. 10 of 1984) and the Prevention of\nElectronic Crimes Act,2016 (XL of 2016)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Agency",
      "content": "(1) On commencement of this Act, there stands established an\nagency to be called the National Forensics Agency, which shall be independent in the performance of\nits functions. The Agency shall be a body corporate with financial and administrative autonomy and\nhaving perpetual succession and a common seal with power, subject to the provisions of this Act, to\nenter into contracts, acquire and hold property, both movable and immovable, and to sue and be sued\nin its name:\nProvided that the Agency established under this sub-section shall be at the existing facility of the\nNational Forensics Agency (NFA) with additional infrastructure.\n(2) The headquarters of the Agency shall be at Islamabad, and the Agency may, from time to time,\nestablish other offices at such places as it deems appropriate.\n(3) The Agency shall consist of a Director General, Directors, Additional Directors, Deputy\nDirectors, Assistant Directors and such other officers and employees as may be prescribed:\nProvided that till such time the regular Director General is appointed in accordance with the\nprovisions of this Act, the Project Director of NFA project shall exercise the powers and functions of\nthe Director General."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Functions and responsibilities of the Agency",
      "content": "(1) The following shall be the functions and\nresponsibilities of the Agency, namely;\n(a) expand its infrastructure and human resource to establish a research department, other\nforensics departments and a state-of-the-art digital forensics department to assist in matter\nof national security and work as a Centre of Excellence for the country and one window\nresources center,\n(b) act as a central coordinating agency being a supreme agency providing intimate\nconventional, digital forensics services in prescribed manners to Government\ndepartments as well as private sector at Federal and provincial level including Azad\nJammu and Kashmir (AJK) and Gilgit- Baltistan (GB) and all forensics agencies and\nlaboratories in country including the law enforcing agencies;\n(c) be center of excellence for conventional, digital forensics, employing cutting-edge AI\ntools and a new research center to develop indigenous solutions;\n(d) prepare, update and approve standard operating procedures under this Act, International\nOrganization for Standardization (ISO) and world best practices for sharing to all\ngovernment departments and forensic laboratories to follow the same to maintain the\nintegrity of conventional, digital forensics material;\n(e) collect, preserve and handle conventional, digital forensics materials as and when\nrequired from crime scene;\n(f) through notified experts conduct examination, render expert opinion, appear in a court as\nsuch expert with regard to conventional, digital forensics materials referred to the Agency\nby a court, tribunal, authority or an any other entity in a prescribed manner;\n(g) levy and collect such fees, in respect of any of its functions at such rates as may be\nprescribed;\n(h) maintain record and database of conventional, digital forensics material or data received\nand analyzed by the Agency;\n(i) image, video, voice enhancement to maximize the output while maintaining the integrity\nof actual digital media as per international best practices;\n(j) procure, operate, and maintain scientific instruments for examination of conventional,\ndigital forensics material;\n(k) accreditation and certification of public and private conventional, digital forensics\nlaboratories, facilities and experts in Pakistan as deemed appropriate by the government;\n(l) re-examination of conventional, digital forensics reports shared by any federal,\nprovincial, local or international agency;\n(m) perform research to identify specialized projects related to conventional and digital\nforensics, Artificial Intelligence new technologies that are of national importance and\nAlumni or expert consultants from STEM fields shall be hired for these projects;\n(n) conduct gap analysis of the country with contemporary systems used in modern world in\nterms of conventional, digital forensics, AI, new technologies and give recommendation\nto bridge this gap;\n(o) training of Judicial and law officers with latest trends in conventional, digital forensics\nand recommend appropriate laws to the government;\n(p) to work as a member of a committee that drafts and finalize international agreements\nrelated to conventional, digital forensics;\n(q) coordinate and collaborate with provincial government departments, public and private\nsector institutions, international organizations, universities, research institutes and\nconventional, digital forensics laboratories for research and training programs;\n(r) coordinate and oversee collaboration between public and private institutes, organizations,\nuniversities and conventional, digital forensics labs from within the country and abroad;\n(s) perform referral and consultative role whenever requested by provincial governments or\nby courts of law or any other entity;\n(t) perform such other functions as the Government may assign to the Agency in furtherance\nof the aims and objectives of the Agency.\n(2) The report and opinion of the Agency shall be an admissible evidence in courts and\ntribunals for the purposes of section 510 of the Code of Criminal Procedure, 1898 (Act\nV of 1898) and Articles 59 and 164 of the Qanoon-e-Shahadat Order, 1984 (P.O. No. 10\nof 1984)."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Superintendence of the Agency",
      "content": "The general directions and superintendence of the Agency\nshall vest in the Board under this Act."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Board of Governors",
      "content": "There shall be a Board of Governors of the Agency which shall\ncomprise-\nS. No.                            Membership                                         Status\n(1)                                   (2)                                             (3)"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Meetings of the Board",
      "content": "(1) The Chairperson may convene meetings of the Board at such time\nand place as he considers necessary for the efficient performance of the functions of the Board.\n(2) At any meeting of the Board the quorum shall be three members.\n(3) All issues arising at any meeting of the Board shall be decided by the majority of votes of the\nmembers present and voting.\n(4) Subject to the provisions of this Act, the Chairperson may give directions regarding the\nprocedure to be followed at or in connection with any meeting of the Board."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Powers and functions of the Board",
      "content": "(1) The powers and ·functions of the Board shall\ninclude-\n(a) lay down procedures for the conduct of the business of the Board, committees, bodies or\nworking groups constituted by the Board to assist in discharge of its functions;\n(b) oversee functioning activities of the Agency;\n(c) approve guidelines to be followed by the Agency for vetting of local and international\nagreements that relate to conventional, digital forensics;\n(d) approve guidelines for the Director General and Directors to take cognizance of cases\nrelated to conventional and digital forensics;\n(e) approve specialized projects, resources required for consultants, consultancy fee, etc.;\n(f) creation, abolishment, re-designation and up-gradation or down-gradation of any post\nprovided the expenditure is met from within the allocated budget of the Agency;\n(g) to re-appropriate funds from one head of account to another head of account and to\nsanction expenditure on any item from within the allocated budget;\n(h) hiring appointment of human resource on initial appointment, regular, contract,.\ndeputation or on attachment basis in prescribed manner;\n(i) to recommend absorption of officers posted in Agency on attachment, deputation or on\ncontract basis against regular approved posts in prescribed.manner;\n(j) to conduct its business in a prescribed manner; and\n(k) to approve the annual budget prepared by the Agency.\n(2) The annual report and accounts of the Agency for every financial year shall be submitted at a\nmeeting of the Board within three months after the end of the financial year to which the accounts\nrelate.\n(3) There shall be an executive committee of the Board which shall consist of-\n(a) Secretary of the division to which business of the Agency stands allocated.\n(b) any member of the Board appointed by the Chairperson; and\n(c) Director General of the Agency or in his absence his nominee not below an officer of\nBPS-20 or equivalent.\n(4) The executive committee shall exercise all the powers of the Board in urgent matters. All\ndecisions of the executive committee shall be placed before the Board in the next meeting for its\napproval.\n(5) The Board may constitute committees for performing functions of the Agency under this Act.\n(6) The Board shall conduct and hold its meetings in a prescribed manner."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Appointment of the Director General",
      "content": "(1) There shall be a Director General of the Agency\nwho shall within six months of the commencement of this Act be appointed by the Federal Government\nin such manner and on such terms and conditions as may be prescribed by rules:\nProvided that no person shall be appointed if he holds nationality of any other country.\n(2) Till such time the regular Director General is appointed in accordance with sub-section (1),\nDirector General in accordance with the provisions of this Act.\n(3) The Prime Minister may, after notice and inquiry in the prescribed manner, remove the\nDirector General on the ground of inefficiency, misconduct, corruption or inability to perform-\nfunctions.\n(4) The Director General may, by writing under his hand addressed to the Prime Minister through\nthe division concerned, tender his resignation and shall cease to hold office upon acceptance of his\nresignation:\nProvided that where the Prime Minister does not accept the resignation within thirty days, it shall\nbe deemed that the resignation stands accepted."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Appointment of officers, staff, etc. by the Agency",
      "content": "The Agency may appoint employees,\nconsultants and such other persons in the manner and on the terms and conditions as may be prescribed\nby regulations."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Employees to be public servants",
      "content": "The Director General, employees and such other persons\nappointed under this Act, when acting or purporting to act in pursuance of any of the provisions of this\nAct, shall be deemed to be public servants within the meaning of section 21 of the Pakistan Penal\nCode, 1860 (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Powers of the Director General",
      "content": "(1) The Director General, as the chief executive of the\nAgency, shall exercise administrative as well as financial powers with regards to the functioning of\n(2) The Director General shall ensure that the Agency performs its activities and functions in\naccordance with the provisions of this Act, as well as the rules and regulations made thereunder.\n(3) In particular and without prejudice to generality of the foregoing powers, the powers of the\nDirector General shall include-\n(a) acting as a principal accounting officer of the Agency;\n(b) proposing, recommending and presenting budget estimates of the Agency to the Board;\n(c) sanctioning all expenditure provided for in the approved budget as may be prescribed;\n(d) constituting sub-committees and assigning specific tasks to the said committees or sub-\ncommittees, for performance of the Agency's functions under this Act; and\n(e) exercising and performing such other powers and functions as may be deemed connected\nwith or ancillary to works and activities of the Agency under this Act.\n(4) Until the executive committee is duly constituted, the Director General shall, subject to such\ndirections as the Government may give from time to time, exercise the powers and perform the\nfunctions of the executive committee.\n(5) The employees of the Agency shall have such powers and perform such functions as may be\nassigned to them by the Director General."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Establishment of Agency fund",
      "content": "(1) There shall be a fund of the Agency which shall be non-\nlapsable fund vesting in the Agency to be known as the NFA fund. The Fund shall consist of-\n(a) grants made by the Government;\n(b) funds provided by the Federal and Provincial Government, if the Provincial Governments\nso desired;\n(c) loans and grants from the national or international agencies received by the Government\nto finance the functions of the Agency;\n(d) charges and fees collected for services provided or from such sources as may be approved\nby the Board;\n(e) income from investments and deposits as approved by the Board and in accordance with\nrules;\n(f) income from the sale of movable or immovable property;\n(g) donations and endowments;\n(h) all other sums received by the Agency in lieu of service; and\n(i) proceeds from any other service rendered by the Agency, including Inspection Services\n(foreign or local), projects or income from sale of any publication;\n(2) All sums received in lieu of services provided by the Agency shall be credited to NFA fund.\n(3) The Director General may utilize the NFA fund for expenditure in accordance with the\nregulations of the Agency.\n(4) The NFA Fund shall be kept in one or more accounts maintained by the Agency in local or\nforeign currency in any scheduled bank in Pakistan and shall be operated in accordance with\nregulations of the Agency."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Re",
      "content": "examination of forensic material.—Aggrieved person or a department may seek the\nprovision of re-examination of conventional, digital forensics material against a report submitted in an\ninvestigation through a court or tribunal in a prescribed manner."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Bar to action and indemnity",
      "content": "(1) No action taken under this Act shall be called in question\nin any court or otherwise except in the manner provided in this Act.\n(2) No civil or criminal proceedings shall be instituted against any person for anything done in\ngood faith or purported to have been done under this Act.\n(3) No suit, prosecution or other legal proceeding shall lie against the Government or any\nProvincial Government or local authority or any other person exercising any power or performing any\nfunction under this Act or for anything which is done in good faith or purporting or intended to be\ndone under this Act or any rules made thereunder."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Accounts and audit",
      "content": "(1) Subject to Articles 169 and 170 of the Constitution, the Agency\nshall prepare its budget, with respect to each financial year, and shall maintain complete and accurate\nbooks of accounts of their actual expenses, income, payments, receipts, assets and liabilities, etc.\n(2) The annual accounts of the Agency shall be audited by the Auditor General of Pakistan, in\nterms of Articles 169 and 170 of the Constitution and if required by a reputable firm of chartered\naccountants, within the meaning of Chartered Accountants Ordinance, 1961 (X of 1961), appointed\nby the Board."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Annual report",
      "content": "(1) The Agency shall submit its annual report to the Prime Minister through\nthe division concerned before the 31st day of September of each financial year.\n(2) The Minister concerned shall, within the period of one month of the receipt of the annual\nreport, lay the same in the National Assembly and the Senate.\n(3) The Director General shall submit the following reports to the Board, namely:-\n(a) periodical reports, returns, statements and statistics as may be required by the\nGovernment or the Board;\n(b) annual report on different research and operational activities;\n(c) information and reports required by the Government on any specific point;\n(d) copies of documents required by the Government; or\n(e) any other information or data required by the Government."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Power to make rules",
      "content": "The Government may, by notification in the official Gazette, make\nrules for carrying out the purposes of this Act in respect of external matters of the Agency."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Power to make regulations",
      "content": "The Agency may, with approval of the Board and by\nnotification in the official Gazette, make regulations for its internal matters not inconsistent with the\nprovisions of this Act and the rules."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Delegation of powers",
      "content": "The Agency may, by general or special order and subject to such\nconditions as it may deem appropriate in writing delegate, all or any of its powers and functions to the\nDirector General or any other officer of the agency under this Act."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Assistance to Agency",
      "content": "The Agency may seek assistance from all executive authorities of the\nFederation and in the provinces as may be required for the exercise or performance of Agency’s\nactivities and functions under this Act."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Issuance of policy directives",
      "content": "(1) The Government may, as and when deemed necessary,\nissue policy directives to the Agency.\n(2) The Board shall take all necessary steps to ensure that the activities and works of the Agency,\nto the extent practicable, are carried out in accordance with the policy directives issued by the\nGovernment."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Relationship with other laws",
      "content": "Save as provided in this section the provisions of this Act\nshall be in addition to and not in derogation of any other law for the time being in force."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Transfer and savings",
      "content": "(1) On commencement of this Act,-\n(a) all acts done, actions taken, obligations and liabilities incurred, rights and assets acquired,\npersons appointed or authorized, jurisdictions or powers conferred, endowments,\nbequests, funds or trusts created, donations or grants made, orders issued and rules or\nregulations made by or in relation to the Agency, before the commencement of this Act,\nshall be deemed to have been done, taken, incurred, acquired, appointed, conferred,\ncreated, made or issued with respect to the Board or the Agency, respectively, under this\nAct;\n(b) all funds, properties, rights and interests, etc. issued, used, enjoyed, possessed, owned or\nvested in the National Forensics Science Agency (NFSA) Project and its Transformation\nto National Forensic Agency (NFA) Project shall immediately stand transferred to the\nAgency established under this Act;\n(c) all persons in service of the NFA Project shall immediately stand transferred to the\nAgency established under this Act without entitlement to any additional compensation or\nbenefit in lieu thereof:\nProvided that-\n(i) the persons so transferred shall have the option to exercise a non-revocable one-time\noption within sixty days of the commencement of this Act either to retain the terms\nand conditions of their service existing immediately before commencement of this\nAct or opt for the new terms and conditions as shall be admissible to the employees\nof the Agency on commencement of this Act which shall not be less favourable than\ntheir former terms and conditions of service;\n(ii) the persons on deputation, attachment or secondment, etc. to the NFA Project shall\non exercising the option under sub-clause (i) may continue with their existing status\nof appointment on their existing terms and conditions of service in the Agency or\nmay opt for absorption with consent of their lending organization as employee of the\nAgency on new terms and conditions of service or opt for repatriation to their parent\norganization;\n(iii) where no option is exercised under sub-clause (i) or sub-clause (ii), it shall be deemed\nthat the persons have opted for absorption in the Agency on the new terms and\nconditions of their service in case of the persons under sub-clause (i) at their own\nconsent and in case of the persons under sub-clause (ii) with consent of their lending\norganization; and\n(iv) where any departmental proceedings or criminal proceedings in the court of\ncompetent jurisdiction are pending finalization against any person so transferred to\nthe Agency, the same shall remain pending and shall be decided in accordance with\nhis terms and conditions of service immediately existing before commencement of\nthis Act.\n(2) The provisions of the Industrial Relations Act, 2012 (X of 2012) shall not apply to matters\nrelating to or arising out of transfer of employees to the Agency."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Offence",
      "content": "(1) If an expert or official of the Agency knowingly or negligently renders false,\nincorrect or misleading opinion before a court, tribunal or authority, he shall be liable to the\npunishment of imprisonment which may extend to one year or with fine which may extend to one\nhundred thousand Rupees or with both.\n(2) No court shall take cognizance of an offence under this Act unless an officer authorize by the\nDirector General makes a complaint in writing in this behalf."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Removal of difficulties",
      "content": "In case a difficulty arises in giving effect to any of the provisions\nof this Act, the Government may make such orders, not inconsistent with the provisions of this Act, as\nmay appear to be necessary for the purpose of removing such difficulty.\n________\nRGN Date: 03-01-2025"
    }
  ],
  "definitions": [
    {
      "term": "Agency",
      "definition": "the National Forensics Agency established under section 3 of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "alumni",
      "definition": "the alumni of, inter alia, science, technology, engineering, mathematics (STEM) Careers Program, Higher Education Commission of Pakistan or any other STEM program of any university of Pakistan who is a citizen of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "a Board of Governors of the Agency constituted. under section 6 of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "deep fake",
      "definition": "an audio, video, picture or any other form of fabricated digital media using AI deep learning algorithms to impersonate or malign any real or imaginary person;",
      "source_provision": "sec2"
    },
    {
      "term": "employee",
      "definition": "an officer, official, expert or such other person appointed on regular basis;",
      "source_provision": "sec2"
    },
    {
      "term": "forensics services",
      "definition": "to render expert opinion with regards to forensics cases referred to the Agency by a court, tribunal or an authority;",
      "source_provision": "sec2"
    },
    {
      "term": "forensics material",
      "definition": "a document, material, equipment, impression, sample or any other object connected with the commission of an offence, a civi1 cause, an inquiry or any other proceedings;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "project",
      "definition": "any identified and approved project of the agency;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules and regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Act. (2) Words or expressions used but not defined under this Act shall have the same meaning as assigned thereto in the Pakistan Penal Code (Act XLV of 1860), the Code of Criminal Procedure,1898 (Act V of 1898), the Qanun-E-Shahadat Order, 1984 (P.O. No. 10 of 1984) and the Prevention of Electronic Crimes Act,2016 (XL of 2016).",
      "source_provision": "sec2"
    }
  ]
}
