{
  "id": "pk-national-institute-of-electronics-ordinance-1979",
  "type": "statute",
  "title": "National Institute of Electronics Ordinance, 1979",
  "title_en": "National Institute of Electronics Ordinance, 1979",
  "short_name": "NIOEO",
  "status": "in_force",
  "issued_date": "1979-01-21",
  "in_force_date": "1979-01-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cZya-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Institute of Electronics Ordinance, 1979 (III of 1979) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.―(1) This Ordinance may be called the National",
      "content": "Institute of Electronics Ordinance, 1979.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context;",
      "content": "(a)    “Director” means the Director of a Division;\n(b)    “Director General” means the Director General of the Institute;\n(c)    “Division” means a unit of the Institute;\n(d)    “electronic components” means metallic and non-metallic parts possessing\ndefinite electrical and mechanical characteristics which are connected together\nin a specific pattern to produce electronic equipment;\n(e)    “electronic equipment” means an electronic device assembled and finally\nprepared for use, such as radio and television receivers, radio transmitters, tape\nrecorders, radar sets, tele-communication apparatus, computers, electronic\ncontrols, military and space electronic equipment;\n(f)    “electronic industry” means an industry producing electronic materials,\ncomponents and equipment;\n(g)     “electronics” means the branch of science, engineering and technology which\ndeals with the controlled flow of electrons in networks consisting of metallic\nconductors, insulators, semi-conductors, electronic valves, resulting in coherent\nand meaningful signals which find application in communication, data\nprocessing, data transmission and display as well as in the automatic and\nsemiautomatic control of machines, missiles and such other devices;\n(h)     “Governing Body” means the Governing Body of the Institute;\n(i)     “Institute” means the National Institute of Electronics Established under section\n3;\n(j)     “Laboratory” means a laboratory set up by the Institute;\n(k)     “Member” means member of the Governing Body;\n(l)     “standardization” means uniformity in equipment, components and techniques\naiming to achieve efficiency and economy in production and maintenance, and\nincludes uniformity of specifications and nomenclature."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Institute.―(1) As soon as may be after the commencement of this",
      "content": "Ordinance, the Federal Government shall establish, in accordance with the provisions of this\nOrdinance, an Institute to be called the National Institute of Electronics.\n(2) The Institute shall be a body corporate by the name of the National Institute of Electronics,\nhaving perpetual succession and a common seal, with power, subject to the provisions of this\nOrdinance, to acquire, hold and dispose of property, both movable and immovable, and shall by the\nsaid name sue and be sued.\n(3) The headquarters of the Institute shall be at Islamabad."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. The functions of the Institute shall be to",
      "content": "(a)     carry out design and development work in vital areas in electronics not within\nthe resources of the existing development centres;\n(b)     design and develop items of common utility for the various user organizations\nand production units and assist in augmenting the local content in production;\n(c)     develop know-how in advanced electronic techniques of value and exchange\nspecialized know-how with other research centres in the country;\n(d)     participate with other development centres in research and development projects\nof national importance and coordinate the work of various research centres in\nthe country;\n(e)     assist in advanced training in electronics;\n(f)     design, develop and guide fabrication of electronic components, particularly\nintegrated circuits, keeping abreast of the latest technologies;\n(g)     design, develop and guide production of electronic measuring instruments,\nindustrial control equipment, computing devices, medical electronic equipment\nand opto-electronic devices;\n(h)     design, develop and guide production of radio and television sets, including\ncolour television and other consumer electronic devices;\n(i)     develop expertise in digital electronic techniques to enable its application to\ncontrol systems, data processing and data transmission equipment of the future;\n(j)     establish and maintain close liaison with other development centres,\nuniversities, user organizations and production units for the promotion of\nelectronic research and development activities;\n(k)     undertake design and development projects on contract with user organizations\nand coordinate the work in the various development centres in case of composite\nprojects;\n(l)     conduct seminars on electronic topics of national interest and exchange\nspecialised knowhow with other research organizations, universities and centres\nof competence;\n(m)     publish an electronics journal with the objects of disseminating knowledge and\nexpertise and the progress of research and development work;\n(n)     undertake small quantity production of specialised components; integrated\ncircuits and equipment;\n(o)     assist industry to enable increased use of local components circuits and design;\nand\n(p)     assist in standardization of components, equipment and techniques on the\nnational level."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. The Governing Body.―(1) The general administration of the affairs of the Institute and the",
      "content": "formulation of its policies shall vest in the Governing Body.\n(2) The Governing Body shall consist of the following members to be appointed by the Federal\nGovernment, namely:\n(a)     Fulltime Members:\n(i)    Director General, who shall also be the Chairman of the Governing\nBody; and\n(ii)   Directors of Divisions;\n(b)     Ex-officio Members:\n(i)    Five members representing the Ministries and Organizations concerned,\nincluding the Ministry of Science and Technology; and\n(ii)   A member representing the Universities.\n(3) The Governing Body may, for such time as it may deem fit, co-opt as member a\nrepresentative of any unit or organization relating to electronic industry or an establishment engaged\nin research in, or development of electronics.\n(4) A person appointed to be a member of the Governing Body by virtue of his holding an\noffice or appointment shall cease to be such member when he ceases to hold that office or appointment.\n(5) A person appointed to be member of the Governing Body may at any time resign his office\nby writing in his hand addressed to the Chairman:\nProvided that no resignation shall take effect until it has been accepted by the Federal\nGovernment.\n(6) No act or proceeding of the Governing Body shall be invalid by reason only of the existence\nof vacancy in, or defect in the constitution of, the Government Body."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. The Director General and Directors.―(1) The Director General shall be the chief",
      "content": "executive of the Institute and shall exercise both administrative and financial powers within the\nframework of policy laid down by the Governing Body.\n(2) The Director-General shall be appointed by the Federal Government and shall be an eminent\ntechnologist of standing by virtue of his contribution to the profession of electronic engineering and\ntechnology.\n(3) The Directors, other than the Director, Finance, shall be appointed by the Federal\nGovernment from amongst eminent technologists in the field of activity of the Division concerned and\nshall perform such functions as may be assigned to them by the Director General, and the Director,\nFinance, shall be nominated by the Ministry of Finance.\n(4) The Director-General and a Director shall hold office for such period not exceeding three\nyears as the Federal Government may determine at the time of his appointment and shall be eligible\nfor re-appointment for such further period or periods, not exceeding three years at any one time, as the\nFederal Government may deem fit.\n(5) The remuneration and other terms and conditions of service of the Director-General and\nDirectors shall be such as may be determined by the Federal Government."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Executive Committee of the Governing Body.―(1) There shall be an Executive Committee",
      "content": "of the Governing Body consisting of the Director-General and the Directors.\n(2) The Executive Committee shall be responsible for the day to day functioning of the Institute\nwithin the framework of policy laid down by the Governing Body."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Meeting of the Governing Body.― (1) Meetings of the Governing Body shall be convened",
      "content": "by the Director-General on such date and at such time and place as may be specified by him:\nProvided that not less than four meetings shall be held every year and not less than eight days’\nnotice of a meeting shall be given to the members, specifying the date, time and place of the meeting.\n(2) To constitute a quorum at a meeting of the Governing Body, not less than five members,\nincluding the Director-General, shall be present.\n(3) The Director General or, in his absence, a member authorised by him in writing shall preside\nat a meeting of the Governing Body."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Committees and working groups. The Governing Body may from time to time appoint",
      "content": "such working groups or committees from amongst its members as it may consider necessary to assist\nit in the performance of its functions and to discharge such of its functions as it may assign to them"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Funds of the Institute. The funds of the Institute shall consist of",
      "content": "_\n(a)     grants made by the Federal Government and the Provincial Government;\n(b)     donations and endowments;\n(c)     income from investments and royalties;\n(d)     income from development contracts; and\n(e)     foreign aid and loans obtained with the approval of the Federal Government."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Budget and accounts.―(1) The Institute shall cause to be prepared and submit for the",
      "content": "approval of the Federal Government a statement of its receipts and expenditure for each financial year\nand the sums which are likely to be required from the Federal Government during that financial year.\n(2) The funds of the Institute shall be kept in a personal ledger account of the Institute with the\nState Bank of Pakistan or with any Branch of the National Bank of Pakistan, acting as an agent of the\nState Bank of Pakistan.\n(3) The accounts of the Institute shall be maintained in such form and manner as the Auditor-\nGeneral of Pakistan may determine in consultation with the Federal Government.\n(4) The accounts of the Institute shall be audited by the Auditor-General of Pakistan or one or\nmore auditors who are chartered accountants within the meaning of he Chartered Accountants\nOrdinance, 1961 (X of 1961), and are appointed by the Institute in consultation with the Auditor-\nGeneral of Pakistan."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Appointments. The Executive Committee of, the Governing Body may appoint, subject to",
      "content": "such general or special orders as the Federal Government may issue to it from time to time, such\nofficers and sub-ordinate staff and engage such consultants or experts as it may consider necessary for\nthe efficient performance of the functions of the Institute on such terms and conditions as it may deem\nfit."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. International cooperation. The Institute may with the prior approval of the Federal",
      "content": "Government cooperate with any foreign agency or international organization for the development of\nelectronics, pursuant to an international agreement or arrangement made before or after the\nestablishment of the Institute."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Reports and returns.―(1) The annual report and accounts of the Institute for every",
      "content": "financial year shall be considered and approved at a meeting of the Governing Body to be held within\nsix months of the close of that year and shall be submitted to the Federal Government.\n(2) The Institute shall submit to the Federal Government such reports, returns, summaries,\ncomments, statements and accounts, at such times and in such form as it may specify."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Directives of the Federal Government. The Federal Government may from time to time,",
      "content": "issue to the Institute such directives and orders as it may consider necessary to guide the functions of\nthe Institute and the Institute shall be bound to comply with or carry out such directives and orders."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Ordinance XXIII of 1969 not to apply to Institute. Nothing contained in the Industrial",
      "content": "Relations Ordinance, 1969 (XXIII of 1969), shall apply to or in relation to the Institute or any of the\nofficers, employees, consultants or experts employed by it."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Discoveries and inventions. All rights relating to discoveries, inventions, designs and any",
      "content": "improvements in materials, techniques, processes, apparatus or equipment made by any officer or\nemployee of the Institute in the course of his employment shall vest in the Institute, but the Institute\nmay grant to any such officer or employee such award or honorarium as it may deem fit."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Declaration of fidelity and decrecy. Every member of the Governing Body and every",
      "content": "officer, employee, consultant or expert of the Institute shall make such declaration of fidelity and\nsecrecy as may be prescribed by rules made under this Ordinance."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Power to make rules and regulations.―(1) The Federal Government may, by notification",
      "content": "in the official Gazette, make rules for carrying out the purposes of this Ordinance.\n(2) The Institute may, with the prior sanction of the Federal Government make such regulations\nnot inconsistent with this Ordinance or the rules made thereunder as may in its opinion be necessary\nor expedient for the achievement of its aims and objects or for the performance of its functions."
    }
  ],
  "definitions": [
    {
      "term": "Director",
      "definition": "the Director of a Division;",
      "source_provision": "sec2"
    },
    {
      "term": "Director General",
      "definition": "the Director General of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Division",
      "definition": "a unit of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "electronic components",
      "definition": "metallic and non-metallic parts possessing definite electrical and mechanical characteristics which are connected together in a specific pattern to produce electronic equipment;",
      "source_provision": "sec2"
    },
    {
      "term": "electronic equipment",
      "definition": "an electronic device assembled and finally prepared for use, such as radio and television receivers, radio transmitters, tape recorders, radar sets, tele-communication apparatus, computers, electronic controls, military and space electronic equipment;",
      "source_provision": "sec2"
    },
    {
      "term": "electronic industry",
      "definition": "an industry producing electronic materials, components and equipment;",
      "source_provision": "sec2"
    },
    {
      "term": "electronics",
      "definition": "the branch of science, engineering and technology which deals with the controlled flow of electrons in networks consisting of metallic conductors, insulators, semi-conductors, electronic valves, resulting in coherent and meaningful signals which find application in communication, data processing, data transmission and display as well as in the automatic and semiautomatic control of machines, missiles and such other devices;",
      "source_provision": "sec2"
    },
    {
      "term": "Governing Body",
      "definition": "the Governing Body of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Institute",
      "definition": "the National Institute of Electronics Established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Laboratory",
      "definition": "a laboratory set up by the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "member of the Governing Body;",
      "source_provision": "sec2"
    },
    {
      "term": "standardization",
      "definition": "uniformity in equipment, components and techniques aiming to achieve efficiency and economy in production and maintenance, and includes uniformity of specifications and nomenclature.",
      "source_provision": "sec2"
    }
  ]
}
