{
  "id": "pk-national-institute-of-folk-and-traditional-heritage-lok-virsa-ordinance-2002",
  "type": "statute",
  "title": "National Institute of Folk and Traditional Heritage (Lok Virsa), Ordinance, 2002",
  "title_en": "National Institute of Folk and Traditional Heritage (Lok Virsa), Ordinance, 2002",
  "short_name": "NIOFA",
  "status": "in_force",
  "issued_date": "2002-09-16",
  "in_force_date": "2002-09-16",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Jvb5g%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Institute of Folk and Traditional Heritage (Lok Virsa), Ordinance, 2002 (LIV of 2002) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Repeal and savings",
      "content": "HERITAGE (LOK VIRSA) ORDINANCE, 2002\nORDINANCE NO. LIV OF 2002\n[17th September, 2002]\nAn Ordinance to provide for reconstitution of the National Institute of Folk and Traditional Heritage\n(Lok Virsa) to effectively preserve indigenous cultural heritage to project true identity of Pakistan\nAND WHEREAS it is expedient to provide for the reconstitution of the National Institute of\nFolk and Traditional Heritage (Lok Virsa), and for matter connected herewith or ancillary thereto;\nAND WHEREAS the President is satisfied that circumstances exist which render it\nnecessary to take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day\nof October, 1999, and the Provisional Constitution Order No. l of 1999, read with the Provisional\nConstitution (Amendment) Order No. 9 of 1999, and in exercise of all powers enabling him in that\nbehalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the\nfollowing Ordinance:―"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Ordinance may be called the National\nInstitute of Folk and Traditional Heritage (Lok Virsa) Ordinance, 2002.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Ordinance, unless there is anything repugnant in the subject or\ncontext,―\n(a)     “Board” means the Board of Governors of the Institute;\n(b)     “Chairman” means the Chairman of the Board;\n(c)     “Executive committee” means the Executive Committee of the Board;\n(d)     “Executive Director” means the Executive Director of the Institute;\n(e)     “Fund” means fund of the Institute;\n(f)    “Institute” means the National Institute of Folk and Traditional Heritage (Lok Virsa)\nestablished by the Government of Pakistan vide its Resolution No.F.10- 11/82―\nAdmn, dated the 19th June, 1983;\n(g)     “prescribed”‘ means prescribed by rules or regulations;\n(h)     “regulations” means the regulations made under this Ordinance; and\n(i)     “rules” means the rules made under this Ordinance."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Institute.― (1) The National Institute of Folk and Traditional",
      "content": "Heritage (Lok Virsa) as reconstituted in accordance with the provisions of this Ordinance shall be a\nbody corporate having perpetual succession and a common seal with powers, subject to the\nprovisions of this Ordinance, to acquire, hold and dispose of property, both moveable and\nimmovable, and shall by the said name sue and be sued.\n(2) The head office of the Institute shall be at Islamabad.\n(3) The Institute may, with the approval of the Federal Government, from time to time\nestablish regional offices, local offices and research establishments at such places as it may deem fit."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Functions and Powers of the Institute",
      "content": "The functions and powers of the Institute shall\nbe―\n(a)     to engage in research, systematic collection, documentation, scientific preservation,\nprojection and dissemination of oral tradition, folklore and other aspects of indigenous\ncultural heritage;\n(b)     to aim at strengthening and nurturing the roots of Pakistan culture and to achieve\nfundamental objectives regarding its rediscovery and reinterpretation to project the\ntrue identity of Pakistan;\n(c)     to establish cultural complexes and museums for the purpose of displaying living arts\nand crafts, cultural artifacts and, rare objects from all parts of Pakistan;\n(d)     establish cultural industries, art and craft galleries, artisan villages and to hold and\norganize festivals;\n(e)     to retrieve advance knowledge of the general public and promotion of cultural\nheritage and cultural industries of Pakistan;\n(f)     to carry out studies, investigations, surveys, to collect data to prepare feasibility report\nabout schemes, projects and programmes to the extent required for fulfilling the\nobjects;\n(g)     to arrange and provide training and technical assistance to its staff as well as\nparticipating NGOs and community based organizations, educational institutions\nthrough training programmes, purchase of existing services, workshops, seminars,\npublications and training programmes and scholarships within Pakistan or in\nsuch other countries as the Board may deem appropriate;\n(h)     to improve knowledge, understanding and practices of different aspects of indigenous\ncultural heritage and to devise ways and means for a broader dissemination through\nemployment of modern media technologies;\n(i)     to establish centres of excellence and to activate existing institutions and build or\ninnovate new institutions and forge mutually beneficial private/ public\nsector partnerships;\n(j)     to prepare and implement such other plans and programmes to promote cultural\nheritage of Pakistan;\n(k)     to promote cultural heritage such that it plays its rightful role in developmental issues\nsuch as economic reforms, investment, industry, education, literature, poverty\nalleviation, human rights and human development;\n(1)     to cause to be prepared and implemented such schemes and programmes for the\npromotion of welfare of its employees; and\n(m)     to do all such other things as are necessary or incidental to the promotion or\nadvancement of the objects of the Institute."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power of the Federal Government to issue directives",
      "content": "The Federal Government may,\nas and when it considers necessary, issue directives to the Institute on matters of policy, and such\ndirectives shall be binding on the Institute, and if a question arises whether any matter is a policy\nmatter or not, the decision of the Federal Government shall be final."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Board of Governors",
      "content": "(1) The overall control, direction and superintendence of the affairs\nof the Institute shall vest in a Board of Governors consisting of the following members, namely: __\n(a) Minister for Culture                                                  Chairman.\n(b) Secretary (Culture)                                              Vice-Chairman.\n(c)   Financial Adviser                                                     Member.\n(d)   Executive Director                                                    Member.\n(e)   three eminent persons in the\nfield of cultural heritage                                           Members.\n(f)    three persons from non-\ngovernment financial and corporate                                   Members.\nsector………..\n(2) The members, other than ex-officio members, shall be appointed by the Federal\nGovernment and shall hold office during the pleasure of the Federal Government.\n(3) The Executive Director shall act as Secretary of the Board."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Terms of Office of the Members of the Board.―(1) Subject to sub",
      "content": "section (2) of section\n6 the members of the Board, other than ex-officio members, shall hold office for a term of three years\nand shall be eligible for reappointment, but no person shall hold that office for more than two\nconsecutive terms:\nProvided that a person shall be eligible for reappointment after break of one term of his\noffice.\n(2) Any causal vacancy in the office of a member, other than ex-officio member, shall be\nfilled by a person nominated by the Federal Government and the person so nominated shall hold\noffice for remainder of the term of office.\n(3) A member of the Board, other than ex-officio member may resign from office by\nsubmitting his resignation in writing to the Chairman:\nProvided that the resignation shall take effect from the date it is accepted by the Federal\nGovernment."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Meetings",
      "content": "(1)The meeting of the Board shall be held at least twice a year and shall be\npresided over by the Chairman.\n(2) Subject to the provisions of sub-section (1), the meeting of the Board and of the Executive\nCommittee shall be held at such time and at such place and in such manner as may be prescribed by\nregulations:\nProvided that until regulations are made in this behalf, such meeting shall be\nconvened by the Chairman.\n(3) Unless otherwise prescribed one-third of the total members in case of the Board and one-\nhalf of the total members in case of the Executive Committee shall form a quorum at the meeting of\nthe Board or, as the case may be, the Executive Committee.\n(4) The Vice Chairman shall act as Chairman in the absence of the Chairman."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Executive Committee",
      "content": "The Board shall be assisted by an Executive Committee,\nconsisting of not less than three members, to be constituted from amongst members of the Board and\nperform such functions, as may be prescribed by the regulations."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Executive Director.―(1) The Executive Director shall be the overall incharge of",
      "content": "technical and administrative work of the Institute and shall be appointed by the Federal Government\non such terms and conditions as it may determine.\n(2) The Executive Director shall exercise such powers and perform such functions as may be\nprescribed."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Delegation of Powers.―The Board may, from time to time delegate to the Chairman, the",
      "content": "Executive Committee and Executive Director such of its powers and functions and subject to such\nconditions as it may consider necessary."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Validity of Proceedings",
      "content": "No act, proceedings, decision or order of the Institute, Board\nor Executive Committee shall be invalid by reason only of the existence of a vacancy in, or any\ndefects in the constitution of, the Institute, Board or Executive Committee."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Appointment of Officers etc.―The Institute may, from time to time, appoint such",
      "content": "Officers, servants, experts and consultants as it may consider necessary for the efficient\nperformance of its functions on such terms and conditions as may be prescribed, by rules."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Members, officers etc., to be public servants. ―Every member of the Board and every",
      "content": "officer, servant, expert, consultant and employee of the Institute shall, when acting or purporting, to\nact in pursuance of any of the provisions of this Ordinance or the rules, or regulations made\nthereunder shall be deemed to be public servant within the meaning of section 21 of the Pakistan\nPenal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Funds.―There shall be established a fund to be called the National Institute of Folk and",
      "content": "Traditional Heritage (Lok Versa) Fund which shall consist of―\n(a)     grant-in-aid from the Federal Government, the Provincial Governments, local bodies\nand statutory or non-statutory corporations;\n(b)     collections, subscriptions, and donations from any person, body, association or\norganization;\n(c)     receipts from other sources as may be approved by the Federal Government\nincluding sale proceeds from the Institute’s products, publications, and holding of\nexhibitions, programmes, festivals and projects as a sell-generated fund, which the\nInstitute may, with the approval of the Board, retain and spend therefrom and the\nbalance, if any, shall be deposited in the self-generated fund account maintained by\nthe Institute separately for this purpose in the scheduled banks;\n(d)     generation of funds through multi-media productions, cultural telecasts, broadcasts,\netc; and\n(e)     such funds as it may generate through private-public partnerships."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Budget.―The Institute shall, in respect of each financial year, by such date as may be",
      "content": "determined by the Federal Government, submit to it for approval a statement, to be called the annual\nbudget statement, in the prescribed manner, showing the estimated receipts and expenditure and the\nsums likely to be required during the next financial year along with detail programme of works for\nthat year."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Maintenance of accounts and audit.― The Institute shall maintain complete and",
      "content": "accurate accounts and other relevant records in such manner and form as may be prescribed by\nthe Federal Government in consultation with Auditor-General of Pakistan which shall be\naudited by the Auditor-General of Pakistan."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Annual Report.―The Institute shall, as soon as possible, after the end of each financial",
      "content": "year, but not later than the last day of December, submit to the Federal Government a detailed report,\ncalled the Annual Report, on the conduct of its affairs and its achievements during the preceding\nfinancial year along with financial statements where necessary."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Indemnity.―No suit, prosecution or order legal proceedings shall lie against the Board",
      "content": "or any of its members, officers, servants, experts or consultants of the Institute in respect of anything\nin good faith done or intended to be done under this Ordinance, the rules or the regulations, made\nthereunder."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Transfer of civil servants etc., to the Institute.―(1) Notwithstanding anything",
      "content": "contained in any law, contract or agreement or in the condition of service, every civil servant\nemployed in the National Institute of Folk and Traditional Heritage, existing immediately before the\ncommencement of this Ordinance, including persons on deputation to other organizations shall, save\nas hereinafter provided, cease to be civil servants and stand transferred, to and become an employee\nof the Institute as established in this Ordinance on the same terms and conditions, including\nremuneration, tenure of service, rules and privileges as to pension and gratuity and other matters as\nwere applicable to him immediately before the commencement of this Ordinance, until his re-\nemployment in the Institute is terminated in accordance with the conditions of service or his terms\nand conditions are altered by regulation which shall not be less favourable than those by which he\nwas governed immediately before his transfer to the Institute.\n(2) Any person referred to in sub-section (1) who is on deputation with the Institute shall\ncontinue in his employment of the Institute on deputation in accordance with the terms of his\ndeputation.\n(3) Any person referred to in sub-section (1) may, within three months from the\ncommencement of this Ordinance, opt not to be transferred to the service of the Institute and option\nso exercised shall be final."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Winding up.― No provision of law relating to the winding up of the bodies corporate",
      "content": "shall apply to the Institute and the Institute shall not be wound up except by the order of the Federal\nGovernment in such manner as the Federal Government may direct. ‘"
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to any provisions of\nthis Ordinance, the Federal Government may make such order, not inconsistent with the express\nprovisions of this Ordinance, as may appear to it to be necessary or expedient for the purpose of\nremoving the difficulty."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Board of Governors of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "Executive committee",
      "definition": "the Executive Committee of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "Executive Director",
      "definition": "the Executive Director of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Fund",
      "definition": "fund of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Institute",
      "definition": "the National Institute of Folk and Traditional Heritage (Lok Virsa) established by the Government of Pakistan vide its Resolution No.F.10- 11/82― Admn, dated the 19th June, 1983;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "the regulations made under this Ordinance; and",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "the rules made under this Ordinance.",
      "source_provision": "sec2"
    }
  ]
}
