{
  "id": "pk-national-institute-of-health-re-organization-act-2021",
  "type": "statute",
  "title": "National Institute of Health (Re-organization) Act, 2021.",
  "title_en": "National Institute of Health (Re-organization) Act, 2021.",
  "short_name": "NIOHA",
  "status": "in_force",
  "issued_date": "2021-07-28",
  "in_force_date": "2021-07-28",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NpaZ1n-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Institute of Health (Re-organization) Act, 2021. (XIII of 2021) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act shall be called the National\nInstitute of Health (Re-organization) Act, 2021.\n(2)     It extends to the whole of Pakistan.\n(3)     It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context;\n(a)       “Board” means the Board of Governors of the NIH established under section 6;\n(b)       “center” means a center established under section 4;\n(c)       “Chairperson” means the Chairperson of the Board;\n(d)       “Chief Executive Officer” means the chief executive officer of NIH appointed\nby the Board;\n(e)       “Chief Financial Officer” means the person appointed under section 22;\n(f)       “confidential national data” means such data as may be defined as confidential\nin the national or security interests of Pakistan by the Federal Government;\n(g)       “Executive Director” means the Executive Director of an institute or center\nappointed by the Federal Government;\n(h)       “Institute” means an institute provided for under section 4;\n(i)       “National Institute of Health” or “NIH” means the National Institute of Health\nestablished under section 3;\n(j)     “prescribed” means prescribed by rules or regulations made under this Act;\n(k)     “rules” means rules made under this Act;\n(l)     “regulations” means regulations made by the Board under this Act; and\n(m)     “unit” means a unit established within an Institute or center."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the National Institute of Health",
      "content": "(1) Immediately and not later\nthan thirty days after the commencement of this Act, the Federal Government shall establish an\nautonomous body, in accordance with the provisions of this Act, to be called the National Institute of\nHealth.\n(2)     The National Institute of Health shall be an autonomous body corporate having\nperpetual succession and a common seal with power, subject to the provisions of this Act, to acquire,\nhold and dispose of property, both movable and immovable, and shall by its name sue and be sued.\n(3)     The headquarters of the National Institute of Health shall be at Islamabad.\n(4)     The National Institute of Health shall be subject to policies of the Federal Government."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Institutes and Centers of Health and Disease Control",
      "content": "(1) The following institutes\nand centers for health and disease control shall be setup and operate under the control and authority of\nthe National Institute of Health;\n(a)     Center for disease control;\n(b)     Health Research Institute;\n(c)     National Health Laboratory;\n(d)     Health Data Center;\n(e)     Institute of Nutrition and Health;\n(f)     Vaccine and Biological Products Center; and\n(g)     center for environmental and occupational health.\n(2)    Each institute and center shall be headed by an Executive Director appointed in\naccordance with the provisions of this Act."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Search and nomination committee",
      "content": "(1) The Prime Minister shall constitute a search\nand nomination committee, for recommendations of persons suitable to be appointed as members of\nthe Board of Governors, which shall consist as per following Table, namely:-\nTable\nSr. No. Person appointed or nominated                                    Status\n(1)                                 (2)                                  (3)\na.       Minister in-charge or a Federal Minister                Chairman\nnominated by the Prime Minister\nb.       Secretary Establishment Division                        Vice-Chairman\nc.       Secretary Ministry of National Health Services          member\nThe head of a renowned public or private                Member\nd.       medical university\nThe head of a public or private medical                 member\ne.       institution renowned for research\nA representative of civil society with                  Member\nf.       substantial contribution to public healthcare to\nbe nominated by the Prime Minister\na senior member of the medical profession               member\ng.       to be nominated by the Prime Minister\n(2)    The Chairman shall chair the meeting of the search and nomination committee and in\nhis absence, the Vice-Chairman shall chair the meeting.\n(3)     A member nominated under sub-section (f) or (g) shall, unless otherwise directed by\nthe Prime Minister, hold office for a period of three years and shall be eligible for another term of three\nyears or part thereof as the Prime Minister may deem appropriate:\nProvided that the appointing authority, may remove a member other than ex-officio member at\nany time after giving him an opportunity of being heard.\n(4)     A quorum for a meeting of the Committee shall be five members of which at least three\nare members appointed under clause (d) to (g) of sub-section (1). All decisions of the Committee shall\nbe taken by a majority."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Board of Governors",
      "content": "(1) There shall be a Board of Governors of the NIH to\nadminister and manage its affairs and shall have overall superintendence and control over the functions\nof the NIH and the Institutes and Centers functioning under the NIH and all related matters.\n(2)     The Board shall comprise of the following nine members, none of whom shall have a\nconflict of interest including any affiliations with interest groups or non-governmental organizations;\n(a)        Secretary, Ministry of National Health Services, Regulation and Coordination; Ex-\nofficio;\n(b)        Surgeon General of Pakistan;\n(c)        an Infectious disease specialist of recognized high repute and standing with not less\nthan twenty years’ experience in the field;\n(d)        a Pathologist of recognized high repute and standing with not less than twenty years\nexperience in the field;\n(e)        a scientist in the basic health fields, such as physiology, immunology, neurosciences,\ngenetics, proteomics etc. of recognized high repute and standing with not less than\ntwenty years experience in the field;\n(f)     a Microbiologist or Molecular Biologist of recognized high repute and standing with\nnot less than twenty years experience in the field;\n(g)     a person specializing in research in health nutrition, occupational health or\nenvironmental health and of recognized high repute and standing with not less than\ntwenty years experience in the field;\n(h)     a clinical research scientist of recognized high repute, as assessed, amongst other\nqualities, by number of peer reviewed publications in indexed journals, citation index\nand impact factor; and\n(i)     any person nominated by the Prime Minister.\n(3)    The members under clause (c) to (h) of sub-section (2) shall be appointed and notified\nby the Government on the recommendation of the Search and Nomination Committee constituted\nunder section 5, provided that the members shall hold office for a period of three years and be eligible\nfor re-appointment for one further term.\n(4)    The Chairperson shall be appointed by the Prime Minister from amongst the members\nappointed under clause (c) to (i) of sub-section 2 and he shall preside over the Board meetings. In case\nof his absence, the Board shall elect an acting Chairperson.\n(5)     A member other than members under clause (a) and (b) of sub- section 2, shall cease to\nhold office if he resigns or fails to attend three consecutive meetings without sufficient cause or for\nany other reasons which incapacitate the member to remain as member. Any such vacancy shall be\nfilled within one month.\n(6)    The membership of a member, other than members under clause (a) and (b) of sub-\nsection 2, may be terminated by the Government by notification and for reasons to be recorded on\ngrounds of incompetence, or on the grounds in sub-section 7, or in view of actions of such member\nwhich brings the NIH or the Board into disrepute.\n(7)      No person shall be appointed under clause (c) to (i) of sub-section 2, or remain as a\nmember of the Board, if such person;\n(a)     is not of sound mind;\n(b)     has applied to be adjudged as an insolvent and his application is pending;\n(c)     is declared by a competent court of law as an un-discharged insolvent;\n(d)     has been convicted by a court of law for an offence involving moral turpitude;\n(e)     has been debarred from holding any office under provisions of law; or\n(f)     has a conflict of interest with such a position."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Powers of the National Institute of Health",
      "content": "(1) The NIH through the Board of\nGovernors shall;—\n(a)    frame policies for the financial and administrative management of the affairs of the\ninstitutes and centers functioning under the NIH and do all such acts and take all such\nsteps as are necessary for the promotion and fulfillment of the objectives and functions\nof the NIH, institutes and centers;\n(b)    frame regulations to, govern the working of each of the institutes and centers and to lay\ndown procedure for the conduct of the business of the NIH, institutes and centers and\nits various committees and sub-committees;\n(c)    prescribe functions of an institute or center in addition to those prescribed under this\nAct;\n(d)    be the custodian of the national health fund and administer the fund;\n(e)    frame national policies and programs for disease control;\n(f)    provide a national or provincial health disease advisory to the Federal Government and\nany or all the Provincial Governments;\n(g)    appoint working groups, committees and sub-committees from amongst its members or\nexperts, whether foreign or Pakistani, as it may consider necessary to assist it in the\ndischarge of its functions or assist in the discharge of the functions of any institute or\ncenter as deemed necessary;\n(h)    appoint and prescribe the terms and conditions of employment and manner of\nappointment for all officers and employees of the NIH and each of its institutes and\ncenters to carry out the purposes of this Act; and\n(i)    prescribe fees and charges for services to be rendered by the NIH or any institute or\ncenter on a commercial basis for raising revenue.\n(2)    In the discharge of its functions, the Board shall be guided by policies of the Federal\nGovernment and the Provincial Governments as may be issued from time to time."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Functions of the Board",
      "content": "(1) The functions of the NIH and its Board of Governors,\nand its institutes and centers where applicable, notwithstanding additional functions and powers of\neach Institute and Center provided for in this Act, shall include__\n(a)    to advise the Federal Government and Provincial Governments on the control of\ndiseases by suitable methods;\n(b)    to implement programs of disease control;\n(c)    to implement any schemes for health management and disease control as approved by\nthe Federal Government or a Provincial Government under a bilateral arrangement with\nthe NIH;\n(d)    to investigate epidemics and other communicable diseases and to conduct research on\nthese using modern techniques and achieve excellence and to collaborate with other\nconcerned agencies under the Federal Government or the Provincial Governments;\n(e)    to develop methodology and standardized techniques for investigating various diseases\nand health issues prevalent in the country;\n(f)   to dissipate these techniques to the people working in the health profession including\nbut not limited to training programs;\n(g)   to promote medical research in all medical and related fields by review and provision\nof research funds for research projects, and overview of these projects for scientific\nvalidity and ethical standards.\n(h)   to advise regarding environment with special reference to air, water and food pollution;\n(i)   to advise government on legislation regarding occupational health and to promote\nresearch into occupational and environmental health;\n(j)   to analyze and test the quality of drugs and act as a laboratory for the purpose of sub-\nsection (5) of section 22 of the Drugs Ordinance, 1976 (XXXI of 1976);\n(k)   to function as a producer of vaccines, sera and biologic products for prophylactic and\ntherapeutic use and acquire capability of meeting domestic and foreign demands;\n(l)   to collaborate with international and domestic research institutes, universities and\nagencies for the purposes of promoting, fostering and enhancing medical and health\nresearch;\n(m)   to collaborate with the World Health Organization in matters of disease and health;\n(n)   to conduct research on applied nutrition and undertake nutrition education programme;\n(o)   to advise and assist the Federal Government and Provincial Governments and\nregulatory authorities in developing food standards and pure food laws;\n(p)   to collect data from all over Pakistan relating to health and disease research and control;\n(q)   to issue an annual national health and disease report and approve the annual reports to\nbe issued by each institute and center;\n(r)   to conduct the audit of the NIH and all its institutes and centers and approve the annual\ncumulative accounts of the NIH;\n(s)   to prepare and approve the annual budget of the NIH and each institute and center and\nrecommend to the Federal Government for approval the annual budget which requires\na grant by the Federal Government;\n(t)   to prescribe the terms of services of the Chief Financial Officer, Executive Directors\nand all other persons employed by the NIH and its institutes and centers commensurate\nwith their roles, responsibilities and organizational hierarchy;\n(u)   to enter into any and all contracts to carry out the purposes of the Ordinance as may be\nnecessary;\n(v)   to receive funding, donations or grants in any form or manner for the purposes of the\nOrdinance and to carry out functions of the Board;\n(w)   to approve the creation of a Division within an institute or center and define its functions\nand scope of work;\n(x)     to develop a national health emergency action plan; and\n(y)     to perform such other functions as the Board may decide.\n(2)     The NIH may on behalf of the Federal Government or a Provincial Government,\nperform functions relating to research and investigation on health and disease problems on such terms\nand conditions as may be agreed upon between the NIH and the Federal or Provincial Government."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Meetings of the Board",
      "content": "(1) The meeting of the Board shall be called by the\nChairperson on such date and at such time and place as may be specified by him.\n(2)     The Board shall meet at least once every three months.\n(3)     To constitute a quorum at a meeting of the Board not less than five members shall be\npresent.\n(4)    All the meetings of the Board shall be presided at by the Chairperson and, in the absence\nof the Chairperson, by the acting Chairperson.\n(5)    All matters shall be decided at a meeting of the Board by a majority of the members\npresent and voting, and, in the case of equality of votes, the Chair shall have a casting vote. There shall\nbe no proxy votes at a meeting of the Board:\nProvided that, in an emergency, any matter may be decided by circulation among all the\nmembers and any proposal so circulated and approved by a majority of the members shall be as\neffective and binding as if such proposal had been approved at a regular meeting of the Board.\n(6)    No act or proceeding of the Board shall be invalid by reason only of the existence of\nany vacancy in or defect in the constitution of the Board."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Chief Executive Officer",
      "content": "(1) The Board shall select and recommend to the Federal\nGovernment for appointment an Executive Director of any of the institutes or centers as the Chief\nExecutive Officer.\n(2)    The Chief Executive Officer shall attend the meetings of the Board of Governors and\nshall perform such functions as prescribed including the consolidated administration and functioning\nof the National Institutes of Health."
    },
    {
      "provision_ref": "sec10a",
      "section": "10A",
      "title": "Section 10A. Executive Directors",
      "content": "(1) The Board shall through a transparent and merit based\nprocess select and recommend to the Federal Government for appointment of an Executive Director\nfor each of the institutes and centers of the NIH provided under Section 4 in the manner prescribed\nunder this Act.\n(2)    The vacancy of an Executive Director shall be advertised in national and international\nprint media and on the web site of the NIH and the Ministry of National Health Services, Regulations\nand Coordination.\n(3)    The Board shall prescribe qualifications and eligibility criteria for the post of each\nExecutive Director.\n(4)   The Board shall from amongst the applicants shortlist not less than five applicants for\ninterview in person by the Board and select by a majority the candidate on merit for the post of\nExecutive Director.\n(5)     Unless earlier removed by the Federal Government on the recommendation of the\nBoard, the term of an Executive Director shall be four years. An Executive Director may resign his\noffice by writing under their hand addressed to the Chairperson of the NIH.\n(6)     The terms and conditions of service of an Executive Director shall be prescribed by the\nBoard commensurate with the qualifications and experience of the person to ensure a person of the\nhighest capability.\n(7)     The Board may recommend to the Federal Government reappointment an Executive\nDirector for one further term on the expiry of their first term based on their performance.\n(8)     An Executive Director shall have no conflict of interest and shall issue a declaration of\nno conflict."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Functions and Powers of Executive Director",
      "content": "(1) An Executive Director shall be\nthe administrative head of the relevant institute or center.\n(2)     The Executive Director shall,__\n(a)     keep in custody the records and seal of the institute or center;\n(b)     appoint officers and other employees of the institute or center as may be delegated by\nthe Board in the prescribed manner;\n(c)     supervise and control the administration of the institute or center, including disciplinary\naction against employees in a manner prescribed by the Board;\n(d)     authorise payments and incur expenditures in accordance financial rules as may be\nprescribed;\n(e)     to execute deeds, documents and contracts on behalf of the institute or center in a\nmanner delegated by the Board;\n(f)     propose budget estimates and revised budget estimates and in consultation with the\nChief Financial Officer prepare the same to be placed before the Board for approval;\n(g)     take steps for the implementation of the functions of the institute or center, decisions of\nthe Board, working groups, committees and sub-committees;\n(h)     prepare the annual report of the institute or center and present to the Board for approval;\n(i)     negotiate grants, funding and receive donations for the benefit of the institute or center\ngenerally or for specific projects; and\n(j)     to perform any other duties or functions as may be assigned by the Board or the Federal\nGovernment."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Functions of the Center for Disease Control",
      "content": "(1) The Center for Disease Control\nshall set the strategic agenda and mandate related to infectious disease surveillance as well as\npromotive, preventive and therapeutic aspects for infectious diseases of public health importance in\nPakistan.\n(2)    The Center shall perform such functions as are directed and assigned by the Federal\nGovernment or the Board including,-\n(a)    advisory on epidemics, disease outbreaks, prevention, control, surveillance and\nresponse to an outbreak;\n(b)    preparation and application of the principles and techniques of emergency and\npreparedness at the national and sub-national levels;\n(c)    develop an Emerging Infections Unit, the functions of which shall include—\n(i)     Surveillance and monitoring of emerging infections and conditions of public\nhealth importance via scientific and modern methods and technologies;\n(ii)    Analysis and interpretation of surveillance data and information;\n(iii)   Formulation of emergency response to prevent, control and manage emerging\ninfections;\n(iv)    Formulation of disease prevention programs which shall institute population-\nbased and individual-based prevention interventions that aim to minimize the\nimpact of emergency on the loss of life and property, and to reduce the risks\nassociated with the disease;\n(v)     drug and vaccine stockpiles;\n(vi)    health promotion and health security;\n(vii)   communication and coordination with international, national and sub-national\norganizations for development of strategies of disease control; and\n(viii) dissemination of information and communication with the public for\nimplementing controls and mitigation strategies;\n(d)    develop a Diseases Specific Unit, the functions of which shall include;\n(i)     management of ongoing special disease programs such as Polio, HIV, Hepatitis,\nTuberculosis, Malaria etc.;\n(ii)    management of future emerging special disease Programs as identified by\nexperts such as carbapenem resistant Enterobacteriaceae, drug-resistant\ntyphoid, COVID-19 etc.;\n(iii)   access, examine and incorporate emerging international developments in public\nhealth laboratory and drugs sciences;\n(iv)    Preventive activities contained in a program may include vaccination and post-\nexposure prophylaxis, provision of information on behavioral and health risks,\ncounselling, nutritional and food supplementation; hygiene and health services;\nand screening programmes for early detection of disease.\n(3)    The Center shall with the assistance of the Federal and Provincial Governments and all\npublic authorities develop and maintain a surveillance system to monitor infections and conditions of\npublic health importance.\n(4)    The Center shall develop a testing and quarantine policy for the augmenting of the\ncontact tracing efforts of exposed or infected individuals, which shall be implemented in collaboration\nwith the Federal and Provincial Health Departments and other the health authorities in Pakistan who\nshall all ensure assistance to the Center in implementation of the provisions of this Act.\n(5)     The Center in implementing its functions and the provisions of this Act shall ensure the\nhighest standards of human respect, dignity and privacy and shall ensure maintenance of secrecy of\npersonal health information and data of the citizens in a manner that the same is not disclosed to any\nperson so as to cause any damage to the respect, dignity and reputation of a the citizens."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Declaration of Health Emergency or Epidemic",
      "content": "The Center for Disease Control\non the basis of national disease surveillance data received through national and provincial disease\nsurveillance centers or reporting by health care professionals and health care institutions or due to an\nextraordinary event that constitutes a public health risk through the international spread of disease and\nafter having determined that;\n(i)     a disease or disorder presents a serious risk to the public at large; or\n(ii)    that an outbreak of infectious disease is significant enough to warrant the declaration\nof a health emergency; or\n(iii)   that an outbreak has significant potential to imminently affect national security or the\nhealth and security of Pakistani citizens, domestically, or internationally, through local\nor imported transmission;\ndeclare a national or localized Health Emergency or Epidemic.\n(2) Upon declaration of a state of health emergency or epidemic, the Center shall advise\nand recommend measures to the Federal and Provincial Governments, relevant authorities and the\npublic.\n(3)      The Center and the NIH shall take all measures within its power and capacity and\nprovide all assistance to the governments and authorities and the public to address a health emergency\nor epidemic.\n(4)     The Center may establish and categorize levels of a health emergency or epidemic and\nfrom time to time upgrade or downgrade the level of a health emergency or epidemic.\n(5)      The Center shall withdraw its declaration of a health emergency or epidemic when\nsatisfied that the reasons for such declaration have ceased to exist.\n(6)     The federal and provincial governments and national and local authorities shall provide\nall requested assistance to the Center and the NIH in the event of a declaration of health emergency or\nepidemic.\n(7)    The Center and the NIH shall in the event of a health emergency or epidemic prepare,\nestablish and provide screening and testing protocols including providing testing facilities where\npossible and have the authority to public or private facilities to undertake screening and testing\nprotocols and services."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Functions of the Health Research Institute",
      "content": "(1) The National Health Research\nInstitute shall promote and coordinate health research in Pakistan and act as the custodian of public\nresearch funds.\n(2)    The Institute shall perform such functions as are directed and assigned by the Federal\nGovernment or the Board including.\n(3)     To promote, organize, coordinate, and conduct scientific research in the field of health\nincluding allopathy, homeopathy, herbal, unani, ayurvedic and traditional medicine,__\n(a)     ensure ethical compliance of medical and health related research to establish national\nand international standards;\n(b)     provide financial support for health research through grants and fellowships;\n(c)     evaluate submitted research proposals for scientific quality, ethical compliance and\nvalidity of outcomes, in order to grant funds for the research purpose;\n(d)     Oversee research projects funded by the NIH for scientific integrity and ethical\ncompliance;\n(e)     establish a National Bioethics Committee to coordinate and promote ethical oversight\nas necessary of biomedical research in Pakistan;\n(f)     advise the Federal and Provincial Governments and any other relevant body or\norganization on matters related to health research;\n(g)     establish, strengthen and expand bioinformatics for support of research;\n(h)     establish linkages with national and international research institutions, bodies and\norganizations as well as relevant community groups and agencies; and\n(i)     develop financial and other resources for its functions and for the support of research."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Functions of the National Health Laboratory",
      "content": "(1) The National Health Laboratory\nshall establish and operate state of the art Core laboratories capable of performing all complex, modern\nmeasurements on human materials in terms of chemical, biologic, immunologic, bacteriologic,\nvirologic, and molecular analysis.\n(2)    The Laboratory shall perform such functions as are directed and assigned by the Federal\nGovernment or the Board.\n(3)   The Laboratory shall serve as a reference laboratory for uncommonly available tests\nincluding new research tests and shall collaborate with research investigators to provide tests and\nanalyses."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Functions of the Health Data Center",
      "content": "(1) The Health Data Center shall function as\nthe national central repository for all aspects of health information and data.\n(2)    The Center shall perform such functions as are directed and assigned by the Federal\nGovernment or the Board including;-\n(a)     access from relevant authorities information and data and house, collate and analyze all\nhealth information and epidemiologic data nationally;\n(b)       establish a central repository for all aspects of health information and data to ensure its\neasy availability on in digital format;\n(c)       provide appropriate data analytics;\n(d)       to maintain and continually update data maternal and neonatal health, neonatal, child\nhealth immunizations, adolescent and, communicable diseases, and non-communicable\ndiseases, population and demographics, health accounts, health services, health system\nincluding human resource, supplies, equipment and infrastructure;\n(e)       to develop and advise adoption of the standards and methods standards and methods\nfor efficient and secure exchange and interoperability of healthcare data and\ninformation.\n1\n[(2A) The center shall assure the registration of cancer patients in central repository, as a vital\nstep to understand the actual burden of disease, and to implement a national action plan for cancer\nprevention, and management strategies to control the growing epidemic and to provide for matters\nancillary thereto; to collect the report data on Cancer cases; to acquire, and form a data base including\nnames and CNIC numbers of cancer patients from all over the country in the repository in particular,__\n(a)       to call any hospital or laboratory to provide data related to cancer patients in any form;\n(b)       to analyze the data and have updated statistics;\n(c)       to encourage and participate in the awareness regarding cancer even at the village and\nunion council level;\n(d)       to work with other Governmental and non-governmental agencies whose goal is\neradication of cancer;\n(e)       to co-operate with and assist the institutions having similar functions in the spirit of\nsolidarity to achieve humanitarian objectives of those countries; and\n(f)       also, to do such supplementary, incidental or consequential acts and things as are\nnecessary or convenient for carrying out its functions.\nfor the purposes of this sub-section “cancer” means,__\n(a)       a neoplasm of human tissue;\n(b)       in which cell multiplication is uncontrolled and progressive; and\n(c)       that, if unchecked, may invade adjacent tissues or extend beyond its site of origin; and\n(d)       that has the propensity to recur, either locally or remotely in the body; or\n(e)       The Federal Minister of health may, by official Gazette notice, declare a disease to be\ncancer for this sub-section.\n1\nIns. by Act No. XXIX of 2025, s.2.\n(2B) The center shall cause the registry of cancer in the following categories, namely;__\n(a)     Confirmed cancer cases;\n(b)     Deaths due to cancer;\n(c)     Recoveries from cancer;\n(d)     Hospitalized pendency of cancer; and\n(e)     Cancer Demographic information age, gender, location:\nProvided that the personal particulars of a cancer patient shall not be disclosed to any\nunauthorized person without the prior written consent of the patient.\n(2C) The center shall cause collection of data from the sources including,__\n(a)     Hospital records;\n(b)     Laboratory reports; and\n(c)     Surveillance systems.]\n(3) The Center shall ensure that its advice, policies, material, research and reports are available\nto the general public on the web site of the NIH."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Functions of the Institute of Nutrition and Health",
      "content": "(1) The Institute of Nutrition\nand Health shall perform such functions as are directed and assigned by the Federal Government or\nthe Board including,-\n(a)     recommend policy, technical advice and research for nutrition sciences;\n(b)     prepare education materials for the nutrition domain and conduct of capacity building\nactivities for nutrition and dietary experts and students of various nutrition programs in\nnational universities;\n(c)     engage with universities and their students for various projects and research activities\nundertaken for the domain of nutrition;\n(d)     approving and commissioning research on nutrition and ongoing enhancements of role\nin the context of developments in the Nutrition Sciences; and\n(e)     extend technical support to the federal and provincial nutrition cells and Federal and\nProvincial Governments for nutrition interventions planning and implementation.\n(2)      The Institute shall ensure that its advice, policies, material, research and reports are\navailable to the general public on the web site of the NIH."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Functions of Vaccine and Biological Center",
      "content": "(1) The Vaccine and Biological\nCenter shall perform such functions as are directed and assigned by the Federal Government or the\nBoard including;—\n(a)     produce biological materials and vaccines;\n(b)     organize training programs through national diploma and specialized short-term\ntraining courses for vaccine and biologic production;\n(c)     collaborate with national and international research institutes to provide the technical\ninput in the areas of vaccine development, vaccines research; and\n(d)     promote research activities and development towards improvement of biological\nproducts, up-scaling of technologies, introduction of newer vaccines, diagnostics and\nother biological products."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Functions of Center for Environmental and Occupational health",
      "content": "(1) The center\nfor occupational and environmental health shall perform such functions as are directed and assigned\nby the Federal Government or the Board, including;\n(a)     evaluate, perform research, analyse and advise on environmental hazards and\noccupational safety;\n(b)     develop and provide national guidelines on environmental safety;\n(c)     develop and provide national guidelines on occupational safety including radiological,\nbiological and chemical hazards;\n(d)     assist the Federal and Provincial Governments in formulating laws and policies related\nto environmental and occupational safety;\n(e)     act in an advisory, investigative and consultative capacity to the Federal or Provincial\nGovernments or the public in specific instances of actual or suspected environmental\nor occupational hazards.\n(2)      The Institute shall ensure that its advice, policies, material, research and reports are\navailable to the general public on the web site of the NIH."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. National Health Fund",
      "content": "(1) Immediately and not later than thirty days after the\ncommencement of this Act, the Federal Government shall establish the National Health Fund to\nprovide for the operations and functions of the NIH and its institutes and centers.\n(2)     The National Health Fund shall consist of;\n(a)     special grant by the Federal Government to provide for any shortfall in the annual\napproved budget of the NIH and grants in aid from the Federal Government and the\nProvincial Governments;\n(b)     one-time special grant as seed money at the time of establishment of NIH of Rs.50\nbillion by the Federal Government;\n(c)     donations and endowments;\n(d)     sale proceeds of vaccine sera, fee from Laboratory tests and health certificates;\n(e)     income from investments and deposits;\n(f)     receipts from such sources as may be approved by the Board;\n(g)     aid from international agencies, donors and foreign countries; and\n(h)     loans from national and international agencies obtained with the approval of the Federal\nGovernment.\n(3)    The National Health Fund shall be administered and controlled by the Board and shall\nbe audited annually and accounts published publicly.\n(4)     The funds of the National Health Fund shall be maintained with the National Bank of\nPakistan or any other scheduled bank as approved by the Board."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Budget, audit and accounts",
      "content": "(1) Each institute and center shall submit, by such date\nas may be prescribed, to the Board its budget in the prescribed manner showing its estimated receipts\nand expenditure for approval of the Board.\n(2)     The Board shall approve the financial regulations.\n(3)  The accounts of the NIH including each institute and center shall be maintained in such\nform and manner as directed by the Board and as may be advised by the Accountant General of\nPakistan.\n(4)    The accounts of the NIH shall be audited by one or more auditors who are chartered\naccountants within the meaning, of the Chartered Accountants Ordinance, 1961 (X of 1961), and are\nappointed by the Board on the recommendation of the Chief Financial Officer in a transparent, manner.\nAny grants, aid, funds or loans provided by the Federal or Provincial Governments or a public body\nshall be audited by the Auditor General of Pakistan.\n(5)    The audited accounts of the NIH shall be provided to the Federal Government and shall\nbe published on the website of the NIH."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Chief Financial Officer",
      "content": "(1) The Board shall select and recommend to the Federal\nGovernment for appointment a Chief Financial Officer of the NIH in a transparent manner on merit\nand on terms and conditions to be prescribed by the Board. All provisions of sub-section (2) to (8) of\nsection 10A shall apply mutatis mutandis to the appointment of a Chief Executive Officer.\n(2)     The Board shall forward for approval the selected candidate for the position of Chief\nFinancial Officer to a committee comprising of Secretary Cabinet Division, Secretary Finance Division\nand Secretary Economic Affairs Division. The appointment of the Chief Financial Officer shall be\nmade after approval of the committee pursuant to this sub-section (2).\n(3)   The Chief Financial Officer shall be appointed for a term of four years, unless removed\nby the Board earlier, which term may be extended for one further term by the Board based on\nperformance.\n(4)    The Chief Financial Officer shall perform such functions as are directed and assigned\nby the Board or prescribed by rules and regulations including__\n(a)     maintaining the accounts of the NIH;\n(b)     assisting each institute and center in preparation of the annual budget;\n(c)     ensuring the audit of the accounts of the NIH;\n(d)     maintaining the National Health Fund on the directions of the Board;\n(e)     operating the bank accounts of the NIH in a manner delegated and directed by the\nBoard;\n(f)     developing an annual financial plan for the NIH and;\n(g)     acting as secretary to the Finance and Audit Committee of the NIH."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Reporting, dissemination and confidentiality of data",
      "content": "(1) The real time data,\ninformation and reports as produced by each Institute or Center or the NIH shall be reported and\nregularly placed and updated on a public website for wider dissemination and sharing, also in the\nnational language, to keep the public informed.\n(2)    The NIH shall act strictly in accordance with directions of the Federal Government, as\nmay be issued from time to time, for maintaining, dissemination and utilization of Confidential\nNational Data as may be made available to the NIH or obtained by NIH."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Delegation of powers",
      "content": "The Board may, by general or special order in writing, direct\nthat all or any its powers under this Act shall, subject to such conditions and in such circumstances as\nmay be specified in the order, be exercisable also by an Executive Director or any specified member\nor officer of the Board."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Ordinance XXIII of 1969 not to apply to Institute",
      "content": "Nothing contained in the\nIndustrial Relations Ordinance, 1969 (XXIII of 1969), shall apply to or in relation to the Institute or\nany of the officers and employees of the Institute."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Directives from the Federal Government",
      "content": "The Federal Government may from time\nto time issue to the NIH such policies, directives and instructions as it may consider necessary for\ncarrying out the purposes of this Act and NIH and the Board shall be bound to act thereon."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Discoveries and inventions to vest in the NIH",
      "content": "All intellectual property and legal\nrights relating to discoveries and inventions and any improvement in materials, methods, processes,\napparatus or equipment made by any officers or employee of the NIH in the course of their employment\nshall vest in the NIH."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Transfer of existing employees of the National Institute of Health and the Pakistan",
      "content": "Research Council to the NIH.— (1) Notwithstanding anything to the contrary in any contract or\nagreement or in the conditions of service, every person in the service of the National Institute of Health\nand the Pakistan Health Research Council immediately, before the commencement of this Act, shall\nstand transferred to the NIH and become an employee of the NIH on such terms and conditions as may\nbe prescribed by the Board:\nProvided that such terms and conditions shall not be less favorable in financial terms than the\nterms and conditions admissible to them immediately before the commencement of this Act.\n(2)     All civil servants serving in the National Institute of Health or the Pakistan Health\nResearch Council before commencement of this Act may within a period of three months of the\ncommencement of this Act exercise a one-time irrevocable option to become employees of the NIH.\nThe civil servants who opt for such employment, shall be subject to terms and conditions of\nemployment as prescribed by the Board of Governors including but not limited to their service\nstructure, promotion and disciplinary matters. Employees who opt for such employment shall be\nentitled to post-retirement benefits and emoluments for the period of their service as civil servants as\nper existing government laws and rules.\n(3)    A civil servant who does not exercise the option pursuant to sub-section (2) shall remain\na civil servant under the Civil Servants Act, 1973 (LXXI of 1973) and shall be repatriated to the\nadministrative division.\n(4)     A civil servant, who opts to serve the NIH under sub-section (2), shall cease to be a\ncivil servant from the date of their absorption in the service of the NIH and their seniority and other\nmatters vis-à-vis employment with the NIH, shall be determined in the manner, as may be prescribed\nby the Board."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Power to make rules",
      "content": "The Federal Government may, by notification in the official\nGazette, make rules to carry out the purposes of this Act."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Power to make regulations",
      "content": "The Board may make such regulations not inconsistent\nwith the provisions of this Act and the rules for carrying out the purposes of this Act and as it may\nconsider necessary or expedient for the administration and management of the affairs of the NIH."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to any of the\nprovisions of this Act, the Federal Government may make such order, not inconsistent with the\nprovisions of this Act, as may appear to it to be necessary for the purpose of removing the difficulty."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Jurisdiction in dispute resolution",
      "content": "The civil court shall have exclusive jurisdiction\nin respect of any and all disputes, arising out matters of employment and terms and conditions of\nservice, or any act of or contract executed by the NIH."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Repeal and Savings",
      "content": "(1) The National Institute of Health Ordinance, 1980\n(Ordinance XLIII of 1980) shall stand repealed at the commencement of this Act.\n(2)  The Pakistan Health Research Council Act, 2016 (XII of 2016) shall stand repealed at\n(3)    All rules and bye laws of the National Institute of Health in force immediately before\nof the provisions of this Act, continue in force until repealed or altered by the Board.\n(4)    Upon the commencement of this Act, the National Institute of Health and the Pakistan\nHealth Research Council shall stand dissolved and upon such dissolution;\n(a)     all assets, rights, powers, authorities and privileges and all property, movable and\nimmovable, cash and bank balances, reserve funds, investments and all other interests\nand rights in or arising out of such property and all debts, liabilities and obligations of\nwhatever kind of the National Institute of Health and the Pakistan Health Research\nCouncil shall be transferred to and vest in the NIH;\n(b)     all contracts entered into and all matters and things engaged to be done with or for the\nNational Institute of Health and the Pakistan Health Research Council before such\ndissolution shall be deemed to have entered into, or engaged to be done by, with or for\nthe NIH; and\n(c)   all suits and other legal proceedings instituted by or against the National Institute of\nHealth and the Pakistan Health Research Council before such dissolution shall be\ndeemed to be suits and proceedings by or against the NIH and shall be proceeded or\notherwise dealt with accordingly.\n______________\nRGN Date: 13-10-2025"
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Board of Governors of the NIH established under section 6;",
      "source_provision": "sec2"
    },
    {
      "term": "center",
      "definition": "a center established under section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairperson",
      "definition": "the Chairperson of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "Chief Executive Officer",
      "definition": "the chief executive officer of NIH appointed by the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "Chief Financial Officer",
      "definition": "the person appointed under section 22;",
      "source_provision": "sec2"
    },
    {
      "term": "confidential national data",
      "definition": "such data as may be defined as confidential in the national or security interests of Pakistan by the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "Executive Director",
      "definition": "the Executive Director of an institute or center appointed by the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "Institute",
      "definition": "an institute provided for under section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules or regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made by the Board under this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "unit",
      "definition": "a unit established within an Institute or center.",
      "source_provision": "sec2"
    }
  ]
}
