{
  "id": "pk-national-institute-of-oceanography-act-2007",
  "type": "statute",
  "title": "National Institute of Oceanography Act, 2007",
  "title_en": "National Institute of Oceanography Act, 2007",
  "short_name": "NIOOA",
  "status": "in_force",
  "issued_date": "2007-03-02",
  "in_force_date": "2007-03-02",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FsaJ4%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Institute of Oceanography Act, 2007 (III of 2007) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_ (1) This Act may be called the National\nInstitute of Oceanography Act, 2007.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at Once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_ In this Act, unless there is any thing repugnant in the subject or\ncontext,—\n(a)     “Board” means the Board of Governors;\n(b)     “Director General” means the Director General of the Institute;\n(c)     “Executive Committee” means the Executive Committee of the\nInstitute;\n(d)     “Government” means the Federal Government:\n(e)     “Institute” means the Institute of Oceanography;\n(f)     “Maritime Zone” means maritime zone of Pakistan;\n(g)     “Member” means a member of the Board;\n(h)     “prescribed” means prescribed by rules made under this Act;\n(i)     “President” means the President of the Board;\n(j)     “regulations” means regulations made under this Act;\n(k)     “rules” means rules made under this Act; and\n(1)     “Technical Advisory Committee” means the Technical Advisory\nCommittee of the Institute."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Institute",
      "content": "_ (1) As soon as may be after the commencement\nof this Act, the National Institute of Oceanography shall established by the Federal Government\nin accordance with the provisions of the Act.\n(2) The Institute shall be a body corporate by the name of the National Institute of\nOceanography having perpetual succession and a common Seal, with power subject to the\nprovisions of this Act, to acquire and hold property, and shall by the said name sue and be sued.\n(3) The Institute shall be located at Karachi and may establish sub-stations in the coastal\nareas of Pakistan.\n(4) Until the Institute is established under this Act, the institute established under the\nresolution of the Federal Government shall continue to function and while so functioning be\ndeemed to be the institute established under this Act."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Functions of the institute:___ The functions of the Institute shall be",
      "content": "(a)     to undertake mission oriented multi-disciplinary research in physical,\nchemical, biological and geological oceanography in Pakistan's\nmaritime zones;\n(b)     to under take oceanographic surveys at the national, international,\nregional and sub-regional levels;\n(c)     to under take training programmes in various fields of oceanography for\nthe development of indigenous manpower and expertise;\n(d)     to establish a National Oceanographic Data Centre, to serve as a national\nrepository for all oceanographic data or information concerning\nPakistan's maritime areas;\n(e)     to provide necessary advice to the Government and collaborate with\nother national agencies engaged in maritime activities;\n(f)     to coordinate and maintain liaison with the international organizations\nand institutes for arranging training or experts services; procurement of\nspecialized instruments and equipment; transfer of marine technology,\nand development of cooperative research programmes:\n(g)     to hold seminars workshops or symposia at national, international,\nregional and sub-regional level; and\n(h)     any other Work assigned by the Government incidental to the functions."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Management",
      "content": "_ The management of the Institute shall consist of___\n(a)     Board of Governors:\n(b)     Director General; and\n(c)     Executive Committee."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Board of Governors",
      "content": "_ The Board of Governors shall have the general control and\nsuperintendence of the affairs of the Institute and shall exercise all powers and perform all\nfunctions of the Institute."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Composition of the Board of Governors",
      "content": "_ (1) The Board of Governors shall\nconsist of following members, namely:—\n(a)   Minister for Science and Technology                     President\n(b)   Secretary, Scientific and Technological Research        Vice-President\nDivision\nMember\n(c)   Chairman, PCSIR Member\nMember\n(d)   Joint Scientific Adviser (P&C), Ministry of Science\nand Technology\nMember\n(e)   Director General, Geological Survey of Pakistan\nMember\n(f)   Representative from Ministry of Finance not below\nthe rank of Joint Secretary\n(g)   Director General (Petroleum Concessions), Ministry      Member\nof Petroleum and Natural Resources\n(h)   Hydrographer, Pakistan Navy                             Member\nMember\n(i)   Director Centre of Excellence in Marine Biology,\nUniversity of Karachi\nMember\n(j)   Deputy Chief, Maritime Affairs Wing, Ministry of\nDefence\nMember\n(k)   Chief Scientist, National Institute of Oceanography\nMember\n(l)   Director General, Marine Fisheries Department,\nKarachi\nMember\n(m) Director General, Sindh Environment Protection\nAgency, Karachi\nMember\n(n)   Representative of Pakistan Space and Upper\nAtmosphere Research Commission\nMember\n(o)   Representative, Sea Food Industries, Karachi\nMember\n(p)   Representative of Fishermen Cooperative Society,\nKarachi\nMember\n(q)   Director General, National institute of Oceanography\nMember\n(r)   One Member each from National Assembly and\nSenate to be nominated by the Speaker and the\nChairman, respectively.\nMember\n(s)   One representative from the Province of Baluchistan\nto be nominated by the Provincial Government.\n(2) Director General, National Institute of Oceanography shall also act as Secretary of\nthe Board."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Functions and powers of the Board",
      "content": "_ In particular and without prejudice to the\ngenerality of the powers conferred by section 6, the Board shall—\n(a)    approve overall plans, policies and programmes of the Institute in the\ncontext of National Science and Technology Policy;\n(b)    review and approve annual and long-term business plans of the Institute;\n(c)    review and approve research projects proposed by the Technical\nAdvisory Committee;\n(d)    approve the annual development and non-development budget of the\nInstitute;\n(e)    create posts of such officers and servants, and engage such consultants\nor experts, as it may consider necessary for the efficient performance of\nthe functions of the Institute, on such terms and conditions as it may\ndeem fit;\n(f)    recommend to the Government to terminate the contract of the Director\nGeneral before the expiry of his tenure in case of unsatisfactory\nperformance; and\n(g)    make regulations in the light of rules for carrying out activities\nconsidered necessary for achieving efficient functioning of the Institute\nunder this Act;"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Term of office of members",
      "content": "_ (1) Save as hereinafter provided, a member, other\nthan an ex-officio members, shall hold office for a period of three years from the date of his\nnomination and shall be eligible for re-nomination for such further period or periods not\nexceeding three years at any one time as the Federal Government may deem fit.\n(2) A person who becomes, or is nominated to be a member by virtue of his holding an\noffice or appointment shall cease to be a member when he ceases to hold that office or\nappointment.\n(3) A member, other than an ex-office member, may at any time resign his membership\nby writing under his hand addressed to the Federal Government but shall continue to perform\nhis functions until his resignation is accepted.\n(4) A vacancy caused by resignation or any other reason shall be filled by the\nnomination of a person qualified to till such vacancy.\n(5) No act or proceeding of the Board shall be invalid on the ground only of the\nexistence of a vacancy in the Board.\n(6) The Federal Government may increase or decrease the number of Members of the\nBoard of Governors and prescribe the qualifications and mode of appointment of such members\nin such manner as it may prescribe."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Meetings of the Board",
      "content": "_ (1) Save as hereinafter provided the Board shall regulate\nthe procedure for its meetings.\n(2) Meetings of the Board shall be called by the President on such date and at such time\nand place as he may deem fit: Provided that at least two meetings shall be held every year.\n(3) Nine members shall constitute the quorum of a meeting of the Board.\n(4) Each meeting of the Board shall be presided over by the President and, in his\nabsence, by the Vice-President of the Board."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Director General of the Institute",
      "content": "_ (1) The Government in consultation with the\nBoard shall appoint an eminent scientist or engineer having at least ten years relevant\nexperience preferably holding a degree of Ph.D. as the Director General on such terms and\nconditions as may be prescribed.\n(2) The Government, in consultation with the Board of Governors, may extend the\ntenure of the Director General for such period as may be specified by it or convert it into\npermanent appointment."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Powers and functions of the Director General",
      "content": "_ The Director General shall be\nthe Chief Executive of the Institute and shall work under the supervision of the Board and shall\nhave following powers and perform the following functions:—\n(a)    to ensure the efficient functioning of the Institute and to regulate its day\nto day working;\n(b)     to prepare the research plans in consultation with Technical Advisory\nCommittee and to submit them to the Board for approval;\n(c)     to ensure, the preservation of all assets of the Institute including\nintellectual property assets;\n(d)     to promote commercialization on research and development work of the\nInstitute linking it with demand as expressed by end users;\n(e)     to arrange for annual evaluation report of the Institute;\n(f)     to submit the annual report of the Institute to the Government which\nshall lay it before the parliament.\n(g)     to identify the areas of strength and working and formulate remedial\nprogramme;\n(h)     to commission industry's specific studies and identify technical\nproblems and to approve plans for technical scientific input by the\nInstitute;\n(i)     to arrange management courses on regular basis for managerial level of\nthe Institute;\n(j)     subject to the provisions of clause\n(e)     of section 8 to appoint officers and employees of the institute on such\nterms and conditions as may be prescribed; and\n(k)     to delegate to any other officer of the Institute such of his functions,\npowers and duties as he may consider necessary."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Executive Committee",
      "content": "_ (1) The Executive Committee shall assist the Director\nGeneral in running day to day functions of the Institute and be responsible for administrative\nas well as financial matters of the Institute. The Committee shall comprise the following\nmembers, namely:—\n(a)     Director General of the Institute;\n(b)     two most senior Scientific or Technical Officers;\n(c)     Financial Adviser, Ministry of Science and Technology; and\n(d)     officer in-charge of Administration of the Institute, who shall also act as\nits Secretary.\n(2) All decisions of the Executive Committee shall be reported to the Board for\ninformation.\n(3) The Government may increase or decrease the number of members of the Executive\nCommittee and prescribe the qualifications and mode of appointment of such members in such\nmanner as it may prescribe."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Technical Advisory Committee",
      "content": "_(1) There shall be a Technical Advisory\nCommittee of the Institute comprising the following members namely:—\n(a)    Director General, Geological Survey of Pakistan;\n(b)    Director General, Petroleum Concessions, Ministry of Petroleum and\nNatural Resources, Islamabad:\n(c)    Director General, Environmental Protection Authority, Government of\nSindh;\n(d)    Hydographer, Pakistan Navy;\n(e)    Professional Geologist to be nominated by the Government;\n(f)    representative of Karachi Port Trust;\n(g)    representative of Sindh Fisheries Department;\n(h)    representative of Baluchistan Fisheries Department; and\n(i)    representative of Fishermen Cooperative Society, Karachi.\n(2) The Director General of the institute shall be the Chairman of the Technical\nAdvisory Committee.\n(3) The Committee shall—\n(a)    identify and prepare research programmes relevant to the market\ndemand;\n(b)    propose Annual, Five-Year Development Programmes of the Institute;\n(c)    advise and report on any technical matters referred to it by the Board;\nand\n(d)    conduct performance evaluation of the research programme for\nconsideration by the Board.\n(4) The Government may increase or decrease the number of members of the Technical\nAdvisory Committee and prescribe the qualifications and mode of appointment of such\nmembers in such manner as it may prescribe."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Funds:___ The Funds of the Institute shall comprise",
      "content": "(a)     the funds of the Institute which stand transferred to the Institute under\nsection 25;\n(b)     the grants from the Government and the Provincial Governments;\n(c)     the donations and endowments; and\n(d)     the funds generated through sale proceeds, technical services, and\nincome from patents, etc; and research grants."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Appointment's of officers, etc",
      "content": "_ (1) All appointments in the Institute shall be\nmade by the Director General.\n(2) Rules will provide for “two-track” appointments; contractual and permanent.\n(3) Recruitment rules shall provide for conversion of contractual appointments to\npermanent appointments.\n(4) The Board may make regulations for recruitment of its employees and the Director\nGeneral shall act according to those regulations.\n(5) A regular employee of the Institute before the commencement of this Act shall have\n1973) and shall be entitled to all the privileges and facilities of the Government such as pension,\ngratuity, housing and health."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Budget and accounts",
      "content": "_ (1) The Director General of the Institute shall, in respect\nof each financial year, submit for approval of the Board, a statement showing all the\nexpenditures incurred during the year along with estimated receipts and expenditure for each\nfiscal year.\n(2) The Institute shall, by such date and in such form as may be prescribed, submit to\nthe Government for approval of its budget for each financial year showing the estimated\nreceipts and expenditure and the sums which are likely to be required from the Government\nduring the financial year.\n(3) The accounts of the Institute shall be maintained in such form and manner as the\nGovernment may determine in consultation with the Controller General Account.\n(4) The accounts of the Institute shall be audited by the Auditor General of Pakistan."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Delegation of powers",
      "content": "_ The Board may, by general or special order in writing,\ndirect that such of its powers shall, in such circumstances and under such conditions, as may\nbe specified in the order, be exercised, by the Chairman, Executive Committee, or a member\nor officer of the Institute."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Submission of periodical reports, etc",
      "content": "_ The Institute shall submit to the\nGovernment at such time and at such intervals as the Government may specify—\n(a)     such periodical reports and summaries as may be required by the\nGovernment;\n(b)     such periodical returns, accounts, statements and statistics as may be\nrequired by the Government;\n(c)     information and comments asked for by the Government on any specific\npoint;\n(d)     copies of the documents required by the Government; and\n(e)     original documents required by the Government for examination or any\nother purpose."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Directives from the Government",
      "content": "_ (1) In the performance of its functions, the\nInstitute shall be guided on questions of policy by the instructions if any, given to it by the\nGovernment which shall be sole judge as to whether a question is a question of policy, provided\nthat reasons for issuing such a directive are conveyed in writing\n(2) The Government may at any time dissolve and reconstitute the Board, if deemed\nnecessary in the public interest."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Discoveries and inventions to vest in the Institute",
      "content": "_ All rights relating to\ndiscoveries and inventions and any improvements in materials, methods, processes, apparatus\nor equipment made by any officer or employee of the Institute in the course of his employment\nshall vest in the Institute and the researchers as per rules."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Declaration of fidelity and secrecy",
      "content": "_ Every member, adviser, officer or other\nemployee of the Institute shall make such declaration of fidelity and secrecy as may be\nprescribed."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Continuance of certain rules:___ All rules, regulations and bye",
      "content": "laws made by the\nInstitute and in force immediately before the commencement of this Act shall, mutatis\nmutandis, and so far as they are not, inconsistent with any of the provisions of this Act, continue\nin force until repealed or altered by rules or regulations made under this Act."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Winding up",
      "content": "_ No provision of law relating to the winding up of bodies corporate\nshall apply to the Institute and the Institute shall not be wound up except by order of the\nGovernment and in such manner as the Government may direct."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Dissolution of Institute",
      "content": "_Upon the commencement of this Act, the Institute\nformed under the Resolution No. F. 5(10)/82-ST.V/NIO dated 10th May, 1982, of the\nGovernment shall stand dissolved and upon such dissolution—\n(a)     all assets, rights, powers, authorities and privileges and property,\nmovables and immovable, cash and bank balance, reserve funds,\ninvestments and all other interests and rights in, or arising out of such\nproperty and all debts, liabilities and obligations of whatever kind of the\nInstitute subsisting immediately before its dissolution shall stand\ntransferred to and vest in the Institute established under this Act;\n(b)     all officers and other employees of the Institute shall, notwithstanding\nanything contained in any law or in any agreement, deed, document or\nother instrument, stand transferred to the Institute in accordance with the\npresent terms and conditions of the service applicable to them; and no\nofficer or other employee whose services are so transferred shall be\nentitled to any compensation because of such transfer;\n(c)     all debts and obligations incurred or contracts entered into or rights\nacquired and all matters and things engaged to be done by, with or for\nthe Institute formed under the Resolution before its dissolution shall he\ndeemed to have been incurred, entered into, acquired or engaged to be\ndone by, with or for the Institute; and\n(d)     all suits and other legal proceedings instituted by or against the Institute\nformed under the Resolution, before its dissolution shall be deemed to\nbe suits and proceedings by or against the Institute and may be\nproceeded or otherwise dealt with accordingly."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Exemption from taxes",
      "content": "_ Notwithstanding anything contained in the Income Tax\nOrdinance, 2001 (XLIX of 2001 ), Or any other law for the time being in force relating to\nincome tax, the Institute shall not be liable to pay any such tax on its, income, capital profit,\nwealth, gifts or gains."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Ordinance XCI of 2002, not to apply the Institute",
      "content": "_ Nothing contained in the\nIndustrial Relational Ordinance, 2002 (XCI of 2002), shall apply to or in relation to the institute\nor any of the officers, advisers and employees appointed by it."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Removal of difficulties",
      "content": "_ If any difficulty arises in giving effect to any provision\nof this Act; the Government may make such order, not inconsistent with the provision of this\nAct, as may appear to it to be necessary or expedient for this purpose of removing the difficulty."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Power to make rules",
      "content": "_ The Government may, by notification in the official\nGazette, make rules, within six months from the commencement of this Act, to carry out its\npurposes."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Board of Governors;",
      "source_provision": "sec2"
    },
    {
      "term": "Director General",
      "definition": "the Director General of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Executive Committee",
      "definition": "the Executive Committee of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government:",
      "source_provision": "sec2"
    },
    {
      "term": "Institute",
      "definition": "the Institute of Oceanography;",
      "source_provision": "sec2"
    },
    {
      "term": "Maritime Zone",
      "definition": "maritime zone of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "a member of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "President",
      "definition": "the President of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act; and (1) “Technical Advisory Committee” means the Technical Advisory Committee of the Institute.",
      "source_provision": "sec2"
    }
  ]
}
