{
  "id": "pk-national-institute-of-technology-act-2025",
  "type": "statute",
  "title": "National Institute of Technology Act, 2025",
  "title_en": "National Institute of Technology Act, 2025",
  "short_name": "NIOTA",
  "status": "in_force",
  "issued_date": "2025-02-15",
  "in_force_date": "2025-02-15",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tjZw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Institute of Technology Act, 2025 (VI of 2025) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Act shall be called the National Institute of\nTechnology Act, 2025.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,__\n(i)     “Academic Council” means the Academic Council of the Institute;\n(ii)    “Authority” means an Authority of the Institute specified in section 22 or any\nof the Authority of the Institute established as per provisions of this Act;\n(iii)   “Board” means the Board of Governors of the Institute;\n(iv)    “Board of Directors” means the Board of Directors of the Shabbir and Sagheer\nEducational Services (Private) limited;\n(v)     “Chancellor” means the Chancellor of the Institute;\n(vi)    “Commission” means the Higher Education Commission set up under the\nHigher Education Commission Ordinance, 2002 (LIII of 2002);\n(vii)   “College” or “School” means constituent college or school of the Institute;\n(viii) “Controller of Examinations” means the Controller of Examinations of the\nInstitute;\n(ix)    “Dean” means the Dean of a Faculty of the Institute;\n(x)     “Department” means a teaching, research or training department maintained and\nadministered or recognized by the Institute in a prescribed manner;\n(xi)    “Director” means the Head of a Teaching Division of the Institute;\n(xii)   “Faculty means the Faculty of the Institute;\n(xiii) “Government” means the Federal Government;\n(xiv)   “Institute” or “NIT” means the National Institute of Technology established\nunder this Act;\n(xv)    “Institute teacher” means a whole-time teacher appointed and paid by the\nInstitute or recognized by the Institute;\n(xvi)   “prescribed” means prescribed by statutes, regulations and rules made under\nthis Act;\n(xvii) “Principal” means the head of a constituent college or a constituent school of\nthe Institute;\n(xviii) “Professor Emeritus” means retired professor working in a faculty in an\nhonorary capacity;\n(xix)   “Registrar” means the Registrar of the Institute;\n(xx)    “registered graduate” means a graduate of the Institute whose name stands\nentered in the registered maintained for the purpose;\n(xxi)   “Representation Committees” means the Representation committees constituted\nunder this Act;\n(xxii) “Review Panel” means the Review Panel constituted by the Chanceller in\naccordance with the provisions of this Act;\n(xxiii) “Schedule” means a schedule to this Act;\n(xxiv) “Search Committer” means the Search Committee constituted by the Board\nunder this Act;\n(xxv) “sponsoring company” means the Shabbir and Sagheer Educational Services\n(Private) limited registered under section 16 of the Companies Act, 2017 (XIX\nof 2017);\n(xxvi) “statutes”, “regulations” and “rules” means the statutes, regulations and rules\nrespectively made or deemed to have been made under this Act and for the time\nbeing in force;\n(xxvii) “Syndicate” means the Syndicate of the Institute;\n(xxviii) “teachers” include Professors, Associate Professors, Assistant Professors and\nLecturers engaged whole-time by the Institute and such other persons as may\nbe declared by regulations;\n(xxix) “Treasurer” means the Treasurer of the University;\n(xxx) “Pro-Vice-Chancellor” means the Pro-Vice-Chancellor of the Institute; and\n(xxxi) “Vice-Chanceller” means the Vice-Chanceller of the Institute;"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment and incorporation of the Institute",
      "content": "(1) There shall be established an\nInstitute to be called The National Institute of Technology.\n(2) The principal seat of the Institute shall be at Lahore and it may set up any number of\ncampuses, colleges and institutes at other places in Pakistan and abroad with prior approval of the\nPatron and Commission.\n(3) The Institute shall consist of the Patron, Chancellor, Vice-Chancellor, members of the\nBoard of Governors, Deans, Chairmen, Principals and members of the Academic Council and such\nother officers as may be prescribed or any council, committee and any other body as the Authority\nmay establish under this Act.\n(4) The Institute shall be a body corporate having perpetual succession and common seal, with\npower, among others, to acquire, hold, lease, sell and dispose of any property or investment vesting in\nit and shall by the said name sue and be sued.\n(5) Notwithstanding anything contained in any other law for the time being in force, the\nInstitute shall have academic, financial and administrative autonomy, including the power to employ\nofficers, teachers and other employees on such terms and conditions as may be prescribed, subject to\n(6) In particular and without prejudice to the authority granted to the Commission by the law,\nbut subject to the provisions of Articles of 169 and 170 of the Constitution of Islamic Republic of\nPakistan, the Government or an authority or auditor appointed by the Government shall have no power\nto question the policy underlying the allocation of resources approved by the Board of Governors in\nthe annual budget of the Institute.\n(7) The Institute shall be liable to provide facilities to the representatives of the Commission,\nor similar relevant organizations for visitation to enable them to verify that the Institute is maintaining\nappropriate academic standards."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers and functions of the Institute",
      "content": "The Institute shall have the powers and function\nto__\n(i)      provide for education and scholarship in such branches of knowledge as it may\ndeem fit and to make provision for research, service to society and for the\napplication, advancement and dissemination of knowledge in such manner as it\nmay determine;\n(ii)    prescribe courses of studies to be conducted by it and the colleges;\n(iii)   hold examinations and to award and confer degrees, diplomas, certificates and\nother academic distinctions to and on persons who have been admitted to and\nhave passed its examinations under prescribed conditions;\n(iv)    prescribe the terms and conditions of employment of the officers, teachers and\nother employees of the Institute and to lay down terms and conditions that may\nbe different from those applicable to Government servants in general;\n(v)     engage, where necessary, persons on contract of specified duration and to\nspecify the terms of each engagement;\n(vi)    confer honorary degrees or other distinctions on approved persons in the\nprescribed manner;\n(vii)   provide for such instruction for persons not being students of the Institute as it\nmay prescribe and to grant certificates and diplomas to such persons;\n(viii) institute programmes for the exchange of students and teachers between the\nInstitute and other universities, educational institutions and research\norganizations, inside as well as outside Pakistan;\n(ix)    provide career counseling and job search services to students and alumni;\n(x)     maintain linkages with alumni;\n(xi)    develop and implement fund-raising plans;\n(xii)   provide and support the academic development of the faculty of the Institute;\n(xiii) confer degrees on persons who have carried on independent research under\nprescribed conditions;\n(xiv)   accept the examinations passed and the period of study spent by students of the\nInstitute at other universities and places of learning equivalent to such\nexaminations and periods of study in the Institute, as it may prescribe, and to\nwithdraw such acceptance;\n(xv)    co-operate with other universities, public authorities or private organizations,\ninside as well as outside Pakistan, in such manner and for such purposes as it\nmay prescribe;\n(xvi)   institute professorships, associate professorships, assistant professorships and\nlectureships and any other posts and to appoint persons thereto;\n(xvii) create posts for research, extension, administration and other related purposes\nand to appoint persons thereto;\n(xviii) recognize institute teachers selected members of the teaching staff of constituent\ncolleges or educational institutions admitted to the privileges of the Institute or\nsuch other persons sons as it may deem fit.\n(xix)   institute and award financial assistance to students in need, fellowships,\nscholarships, bursaries, medals and prizes under prescribed conditions;\n(xx)    establish teaching departments, schools, colleges, campuses, faculties,\ninstitutes, museums and other centers of learning for the development of\nteaching and research and to make such arrangements for their maintenance,\nmanagement and administration, inside Pakistan as well as outside Pakistan\nunder prescribed conditions;\n(xxi)   provide for residence of the students of the Institute and the colleges, to institute\nand maintain halls of residence and to approve or license hostels and lodging;\n(xxii) maintain order, discipline and security on the campuses of the Institute and the\ncolleges;\n(xxiii) promote the extra-curricular and recreational activities of students and to make\narrangements for promoting their health and general welfare;\n(xxiv) demand and receive such fees and other charges as it may determine;\n(xxv) make provision for research, advisory or consultancy services and with these\nobjects to enter into arrangements with other institutions, public or private\nbodies, commercial and industrial enterprises under prescribed conditions;\n(xxvi) enter into, carry out, vary or cancel contracts;\n(xxvii) receive and manage property transferred and grants, contributions made to the\ninstitute and to invest any fund representing such property, grants, bequests,\ntrusts, gifts, donations, endowments or contributions in such manner as it may\ndeem fit;\n(xxviii) provide for the printing and publication of research and other works; and\n(xxix) do all such other acts and things, whether incidental to the powers aforesaid or\nnot, as may be requisite or expedient to further the objectives of the Institute as\na place of education, learning and research."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Institute open to all classes, creeds, etc",
      "content": "(1) The Institute shall be open to all persons of\neither gender and of whatever religion, race, creed, class, color or domicile and no person shall be\ndenied the privileges of the Institute on the grounds of religion, race, caste, creed, class, color or\ndomicile.\n(2) An increase in any fee or charge that is in excess of ten percent per annum on an annualized\nbasis from the last such increase may not be made except in special circumstances and only with\napproval of the Patron.\n(3) The Institute shall institute financial aid programmes for students in need, to the extent\nconsidered feasible by the Board of Governors subject to the available resources, so as to enable\nadmission and access to the Institute and the various opportunities provided by it to be based on merit\nrather than ability to pay:\nProvided that the Institute may institute self-finance schemes not covering more than ten\npercent of the total number of candidates in any on-campus taught course or research-based programme\nof study."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Teaching at the institute",
      "content": "(1) All recognized teaching in various courses shall be\nconducted by the Institute or the colleges in the prescribed manner and may include lectures, tutorials,\ndiscussions, seminars, demonstrations, distance learning and other methods of instruction as well as\npractical work in the laboratories, hospitals, workshops and other governmental or private\norganizations.\n(2) The authority responsible for organizing recognized teaching shall be as may be prescribed."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Principal officers",
      "content": "The following shall be the principal officers of the Institute, namely:__\n(a)     the Patron;\n(b)     the Chancellor;\n(c)     the Vice-Chancellor;\n(d)     the Pro-Vice-Chancellor;\n(e)     the Deans;\n(f)     the principals of the constituent colleges;\n(g)     the Chairpersons of the teaching departments;\n(h)     the Registrar;\n(i)     the Treasurer;\n(j)     the Controller of Examinations; and\n(k)     such other persons as may be prescribed by statutes or regulations."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. The Patron",
      "content": "(1) The President of the Islamic Republic of Pakistan shall be the Patron of\nthe Institute.\n(2) The Patron shall, when present, preside the Convocation of the Institute. In the absence of\nthe Patron, the Chancellor shall preside over the convocation of the Institute.\n(3) Any proposal to confer an honorary degree shall be subject to confirmation of the Patron."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Visitation",
      "content": "(1) The Patron may, in accordance with the terms and procedures as may be\nprescribed, cause an inspection to be made on his own motion at the request of the Commission in\nrespect of any matter connected with the affairs of the Institute, and shall from time to time, direct any\nperson or persons to inquire into or carry out inspection of__\n(a)     the Institute, its buildings, laboratories and other facilities;\n(b)     any institution, department or postel maintained by the Institute;\n(c)     the adequacy of financial and human resources;\n(d)     the teaching, research, curriculum, examination and other matters of the\nInstitute; and\n(e)     such other matters as the Patron may specify.\n(2) The Patron shall communicate to the Board his views with regard to the result of visitation\nand shall, after ascertaining the views of the Board, advise the Chancellor on the action to be taken by\nhim.\n(3) The Chancellor shall, within such time as may be specified by the Patron, communicate to\nhim such action, if any, as has been taken or may be proposed to be taken upon the result of visitation.\n(4) Where the Board does not, within the time specified, act or take action to the satisfaction\nof the Patron, the Patron may issue such directions as he deems fit and Board shall comply with all\nsuch directions."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. The Chancellor",
      "content": "(1) The Chief Executive of sponsoring company shall be Chancellor of\nthe Institute.\n(2) In absence of the Patron and subject to sub-section (8) of section 23, the Chancellor shall,\nwhen present, preside over the meetings of the Board.\n(3) The members of the Board, except the Vice-Chancellor, shall be appointed by the\nChancellor from amongst the persons recommended by the Representation Committee set up for this\npurpose or the Search Committee established in accordance with this Act and the Statutes, as the case\nmay be, along with those elected.\n(4) If the Chancellor is satisfied that serious irregularity or mismanagement with respect to\naffairs of the Institute has occurred, he may,__\n(a)    as regards proceedings of the Board, direct that specified proceedings be reconsidered\nand appropriate action taken within one month of the direction having been issued:\nProvided that if the Chancellor is satisfied that either no reconsideration has\nbeen carried out or that the reconsideration has failed to address the concern expressed,\nhe may, after calling upon the Board to show cause in writing, appoint a five member\nReview Panel to examine and report to the Chancellor on the functioning of the Board:\nProvided further that the report of the Review Panel shall be submitted within\nsuch time as may be prescribed by the Chancellor. The Review Panel shall be drawn\nfrom persons of eminence in academics and in the fields of law, accountancy, and\nadministration; and\n(b)    as regards proceedings of any Authority or with respect to matters within the\ncompetence of any Authority, other than the Board, direct the Board to exercise powers\nunder section 23."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Removal from the Board",
      "content": "(1) The Chancellor may, upon recommendation of the Review\nPanel, remove any person from membership of the Board on the ground that such person__\n(a)    has been by a competent court of law convicted, declared as of unsound mind; or\n(b)    has become incapacitated to function as member of the Board; or\n(c)    has been convicted by a court of law for an offence involving moral turpitude; or\n(d)    has absented himself from two consecutive meetings without just cause; or\n(e)    has been guilty of misconduct, including use of position for personal advantage of any\nkind or gross inefficiency in performance of functions.\n(2) The Chancellor shall remove any person from membership of the Board on a resolution\ncalling for removal of such person supported by at least three-fourths majority of the membership of\nthe Board:\nProvided that before passing such a resolution the Board shall provide the member concerned\na fair hearing:\nProvided further that the provisions of this section shall not be applicable to the Vice-\nChancellor in his capacity as a member of the Board."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Vice",
      "content": "Chancellor.__(1) There shall be a Vice-Chancelor of the Institute who shall be an\neminent academician or a distinguished administrator and shall be appointed on such terms and\nconditions as may be prescribed.\n(2) The Vice-Chancellor shall be the chief executive officer of the Institute responsible for all\nadministrative and academic functions of the Institute and for ensuring that the provisions of this Act,\nstatutes, regulations and rules are faithfully observed to promote the general efficiency and good order\nof the Institute. The Vice-Chancellor shall have all powers prescribed for this purpose, including\nadministrative control over the officers, teachers, and other employees of the Institute.\n(3) The Vice-Chancellor shall, if present, be entitled to attend any meeting of any Authority or\nbody of the Institute.\n(4) The Vice-Chancellor may, in an emergency that in his opinion requires immediate action\nordinarily not in the competence of the Vice-Chancellor, take such action and forward, within seventy-\ntwo hours, a report of the action taken to the members of the Emergency Committee of the Board, to\nbe set up by Statute. The Emergency Committee may direct such further action as is considered\nappropriate.\n(5) The Vice-Chancellor shall also have powers to__\n(a)     direct teachers, officers, and other employees of the Institute to take up such\nassignments in connection with examination, administration and such other activities\nin the Institute as he may consider necessary for the development of the Institute;\n(b)     sanction by re-appropriation an amount not exceeding an amount prescribed by the\nBoard for an unforeseen item not provided for in the budget and report it to the Board\nat the next meeting;\n(c)     make appointments of such categories of employees of the Institute and in such manner\nas may be prescribed by Statutes;\n(d)     suspend, punish and remove, in accordance with prescribed procedure, from service\nofficers, teachers and other employees of the Institute except those appointed by or with\nthe approval of Board;\n(e)     delegate, subject to such conditions as may be prescribed, any of his powers under this\nAct to an officer or officers of the Institute; and\n(f)     exercise and perform such other powers and functions as may be prescribed.\n(6) The Vice-Chancellor shall preside at the convocation of the Institute in the absence of the\nChancellor.\n(7) The Vice-Chancellor shall present an annual report before the Board within three months\nof the close of the academic year. The annual report shall present such information as regards the\nacademic year under review as may be prescribed, including disclosure of all relevant facts pertaining\nto__\n(a)     academics;\n(b)     research;\n(c)     administration; and\n(d)     finances.\n(8) The Vice-Chancellor’s annual report under sub-section (7) shall be made available, prior to\nits presentation before the Board, to all officers and Institute teachers and shall be published in such\nnumbers as are required to ensure its wide circulation."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Appointment and removal of the Vice",
      "content": "Chancellor.__(1) The Vice-Chancellor shall be\nappointed by the Chancellor based on recommendations made by the Board.\n(2) A Search Committee, for recommendation of persons suitable for appointment as Vice-\nChancellor, shall be constituted by the Board on the date and in the manner prescribed by statutes and\nshall consist of two eminent members of society nominated by the Chancellor, of whom one shall be\nappointed the convener, two members of the Board, two distinguished Institute teachers who are not\nmembers of the Board and one academician of eminence not employed by the Institute. The two\ndistinguished Institute teachers shall be selected by the Board through a process. to be prescribed by\nstatutes that provides for recommendation of suitable names by the Institute Teachers in general. The\nSearch Committee shall remain in existence till such time that the appointment of the next Vice-\nChancellor has been made by the Chancellor.\n(3) The persons recommended by the Search Committee for appointment as Vice-Chancellor\nshall be considered by the Board, and of these a panel of three, in order of priority, shall be\nrecommended by the Board, to the Chancellor:\nProvided that the Chancellor may decline to appoint any of the three persons recommended\nand seek recommendation of a fresh panel. In the event of a fresh recommendation being sought by\nthe Chancellor the Search Committee shall make a proposal to the Board, in the prescribed manner.\n(4) The Vice-Chancellor shall be appointed for a renewable term of four years on terms and\nconditions prescribed by statutes. The term of an incumbent Vice-Chancellor shall be renewed once\nby the Chancellor on receipt of a resolution of the Board, excluding the Vice-Chancellor, in support of\nsuch renewal:\nProvided that the Chancellor may call upon the Board to reconsider such a resolution once.\n(5) The Board, may, pursuant to a resolution in this behalf passed by three-fourths majority of\nits membership, recommend to the Chancellor the removal of the Vice-Chancellor on the ground of\ninefficiency, moral turpitude or physical or mental incapacity or gross misconduct, including misuse\nof position for personal advantage of any kind:\nProvided that the Chancellor may make a reference to the Board, stating the instances of\ninefficiency, moral turpitude or physical or mental incapacity or gross misconduct on the part of the\nVice-Chancellor that have come to his notice. After consideration of the reference the Board, may,\npursuant to a resolution in this behalf passed by two-thirds majority of its membership; recommend to\nthe Chancellor the removal of the Vice-Chancellor:\nProvided further that prior to a resolution for the removal of the Vice-Chancellor being voted\nupon, the Vice-Chancellor shall be given an opportunity of being heard.\n(6) A resolution recommending the removal of the Vice-Chancellor shall be submitted to the\nChancellor forthwith. The Chancellor may accept the recommendation and order removal of the Vice-\nChancellor or return the recommendation to the Board.\n(7) At any time when the office of the Vice-Chancellor is vacant, or the Vice-Chancellor is\nabsent or is unable to perform the functions of his office due to illness or some other cause, the Board,\nshall make such arrangements for the performance of the duties of the Vice-Chancellor as it may deem\nfit."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Pro",
      "content": "Vice-Chancellor.__ (1) The Chancellor may, in consultation with the Vice-Chancellor,\nappoint a Pro-Vice-Chancellor for the main campus or the additional campus, if any, or for both the\nadditional campuses jointly, on such terms and conditions as may be prescribed for a period not\nexceeding three years.\n(2) The Pro-Vice-Chancellor shall, notwithstanding anything contained in this Act, exercise\nsuch powers and perform such functions of the Vice-Chancellor or such other powers and functions,\nin respect of the campus for which he is appointed, as the Chancellor and Vice-Chancellor may\ndelegate to him."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Dean",
      "content": "(1) There shall be a Dean for each Faculty who shall be the Chairman of the Board\nof the Faculty and shall be nominated by the Chancellor from amongst the three senior most teachers\nin the Faculty, on the recommendations of the Vice-Chancellor.\n(2) The Dean shall hold office for three years or for a longer period as may be prescribed.\n(3) The Dean shall present candidates for admission to degree courses, except honorary\ndegrees, in the courses falling within purview of the Faculty.\n(4) The Dean shall exercise such other powers and perform such other duties as may be\nprescribed.\n(5) The Dean shall supervise the academic work of the faculty and report to the Vice-\nChancellor quarterly about the progress of teaching and research in the Faculty.\n(6) The Dean with the approval of the Vice-Chancellor shall lay down procedures for the\nperformance and evaluation of teaching and research staff."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Registrar",
      "content": "(1) There shall be a Registrar of the Institute to be appointed by the Board, on\nrecommendation of the Selection Board, on such terms and conditions as may be prescribed.\n(2) The experience as well as the professional and academic qualifications necessary for\nappointment to the post of the Registrar shall be such as may be prescribed.\n(3) The Registrar shall be a full-time officer of the Institute and shall.__\n(a)     be the administrative head of the secretariat of the Institute and be responsible for the\nprovision of secretariat support to the Authorities of the Institute;\n(b)     be the custodian of the common seal and the academic records of the Institute;\n(c)     maintain a register of registered graduates in the prescribed manner;\n(d)     supervise the process of election, appointment or nomination of members to the various\nauthorities and other bodies in the prescribed manner; and\n(e)     perform such other duties as may be prescribed.\n(4) The term of office of the Registrar shall be a renewable period of three years:\nProvided that the Board, may, on the advice of the Vice-Chancellor, terminate the appointment\nof the Registrar on grounds of inefficiency or misconduct in accordance with prescribed procedure."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Treasurer",
      "content": "(1) There shall be a Treasurer of the Institute to be appointed by the Board,\non recommendation of the Selection Board, on such terms and conditions as may be prescribed.\n(2) The minimum experience and the professional and academic qualifications necessary for\nappointment to the post of the Treasurer shall be such as may be prescribed.\n(3) The Treasurer shall be the chief financial officer of the Institute and shall__\n(a)     manage the assets, liabilities, receipts, expenditures, funds, and investments of the\nInstitute;\n(b)     prepare the annual and revised budget estimates of the Institute and present the same to\nthe Syndicate or a committee thereof for approval and incorporation in the budget to be\npresented to the Board;\n(c)     ensure that the funds of the Institute are expended on the purposes for which they are\nprovided;\n(d)     have the accounts of the Institute audited annually to be available for submission to the\nBoard, within six months of the close of the financial year; and\n(e)     perform such other duties as may be prescribed.\n(4) The term of office of the Treasurer shall be a renewable period of three years:\nProvided that the Board, may, on the advice of the Vice-Chancellor, terminate the appointment\nof the Treasurer on grounds of inefficiency or misconduct in accordance with prescribed procedure."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Controller of Examinations",
      "content": "(1) There shall be a Controller of Examinations, to be\nappointed by the Board, on the recommendation of the Selection Board, on such terms and conditions,\nas may be prescribed.\n(2) The minimum qualifications necessary for appointment to the post of the Controller of\nExaminations shall be such as may be prescribed.\n(3) The Controller of Examinations shall be a full-time officer of the Institute and shall be\nresponsible for all matters connected with the conduct of examinations and perform such other duties\nas may be prescribed.\n(4) The Controller of Examinations shall be appointed for a renewable term of three years:\nProvided that the Board, may, on the advice of the Vice-Chancellor, terminate the appointment\nof the Controller of Examinations on grounds of inefficiency or misconduct in accordance with\nprescribed procedure."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Director, planning and development",
      "content": "(1) There shall be a Director, planning and\ndevelopment of the Institute to be appointed by the Board, on recommendation of the Syndicate for a\nrenewal period of three years on such terms and conditions, as may be prescribed.\n(2) The minimum experience as well as the professional and academic qualifications necessary\nfor appointment to the post of Director Planning and Development shall be prescribed.\n(3) The Director, Planning and Development shall be responsible for all matters connected with\nplanning and development and perform such other duties as may be prescribed.\n(4) The Director, Planning and Development shall__\n(a)    prepare short and long-term plans and development programs to meet vision, goals and\npriorities set by the Institute management and Board;\n(b)    conduct comprehensive review, assessment and analysis of development planning\nprocess (project identification, appraisal, selection, implementation. and monitoring)\nand mechanism;\n(c)    develop a strategy for improving development planning processes and mechanisms\nbased on findings of the situation analysis;\n(d)    provide technical support in developing project proposals and PCs-I, for the Institute;\n(e)    for preparation for the PC-I, PC-II, PC-III, PC-IV, and PC-V;\n(f)    for preparation of cash work and activity plan;\n(g)    for preparation of quarterly expenditure statements;\n(h)    for preparation of monthly and quarterly progress reports;\n(i)    to coordinate with works, purchase, store units and accounts; and\n(j)    to communicate and submit reports, plans and projects to different donors.\n(5) The Board, may on recommendations and advice of Syndicate, terminate the services of\nDirector, Planning and Development on grounds of inefficiency or misconduct in accordance with the\nprescribed procedure."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Director Quality Enhancement Cell (QEC)",
      "content": "(1) There shall be a Director (QEC) of the\nInstitute to be appointed by the Board, on the recommendation of Syndicate for a renewable period of\nthree years on such terms and conditions as may be prescribed.\n(2) The minimum experience as well as the professional and academic qualification necessary\nfor appointment to the post of Director (QEC) shall be such as may be prescribed.\n(3) The Director Quality Enhancement Cell (QEC) shall be responsible to__\n(a)    review the quality standards and the quality of teaching and learning in each subject\narea;\n(b)    review the academic association with other institutions in terms of effective\nmanagement of standards and quality of programs;\n(c)    define clear and explicit standards as points of reference to the review to be carried out.\nIt should also help the employees to know as to what they could expect from candidates;\n(d)    develop qualifications framework by setting out the attributes and abilities that can be\nexpected from the holder of a qualification, i.e. undergraduate and graduate programs;\n(e)    develop program specifications. These are standards set of information clarifying what\nknowledge, understanding, skills and other attributes a student will have developed on\nsuccessfully completing a specific program;\n(f)    develop quality assurance processes and methods of evaluation to affirm that the quality\nof provision and the standard of awards are being maintained and to foster curriculum,\nsubject and staff development together with research and other scholarly activities;\n(g)    ensure that the Institute’s quality assurance procedures are designed to fit in with the\narrangements in place nationally and internationally for maintaining and improving the\nquality of higher education; and\n(h)    developing procedures and processes, monitoring and evaluation systems, and\nstandards for the following, namely:__\n(i)     approval of new program;\n(ii)    annual monitoring and evaluation including program monitoring, faculty\nmonitoring and student perceptions;\n(iii)   departmental review;\n(iv)    student feedback;\n(v)     employer feedback;\n(vi)    quality assurance of undergraduate, graduate and doctoral programs;\n(vii)   institutional assessment and performance evaluation;\n(viii) program specifications; and\n(ix)    qualification framework.\n(4) Director (QEC) shall be member of all statutory bodies and committees of the Institute.\n(5) The Board, may on recommendations and advice of Syndicate, terminate the services of\nDirector (QEC), on grounds of inefficiency or misconduct in accordance with the prescribed\nprocedure."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Director, Research, Innovation and Commercialization (ORIC)",
      "content": "(1) There shall be a\nDirector (ORIC) of the Institute to be appointed by the Board, on the recommendation of the Syndicate\nfor a renewable period of three years on such terms and conditions as may be prescribed.\n(2) The minimum experience as well as the professional and academic qualifications necessary\nfor appointment to the post of Director (ORIC) shall be such as may be prescribed.\n(3) The Director (ORIC) shall__\n(a)    manage and enhance research activities of the Institute, develop research policies and\npriorities, work for fund raising for research, mobilize faculty, business community and\nindustry for research commercialization and serve as an effective advocate for research\nwith the Institute and to its broader community of stakeholders and supporters;\n(b)    supervise all aspects of the operation of the office for research including research\nadministration (budgeting, auditing, accounting, human resources; management and\nmaintenance of facilities and equipment, implementation of research contracts and\nhuman resources);\n(c)    develop programs and activities that will increase funding for research from all public\nand private sources, establish and maintain excellent relationships with donors oversee\nproposals for development and submission;\n(d)    promote development of public-private partnerships in support of Institute research,\nlink the Institute’s research community with the needs and priorities of the corporate\nsector, develop opportunities for applied research and explore opportunities for\ntechnology transfer and commercialization of Institute research including incubators\nand research parks;\n(e)    be responsible to monetize royalty streams from licenses;\n(f)    collaborate with principal liaison for technical marking and licensing on\ncommercialization of the Institute’s intellectual property in coordination with other\nrelevant department and offices; and\n(g)     work in close liaison with the office of research and development, planning and\ndevelopment, and Institute’s technology park.\n(4) The Board, may on recommendations and advice of Syndicate, terminate the services of\nDirector (ORIC) on grounds of inefficiency or misconduct in accordance with the prescribed\nprocedure."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Authorities",
      "content": "(1) The following shall be the Authorities of the Institute established under\nthis Act, namely:__\n(a)     the Board of Governors;\n(b)     the Syndicate; and\n(c)     the Academic Council.\n(2) The following shall be the authorities to be established by statutes namely:__\n(a)     Graduate and Research Management Council;\n(b)     Recruitment, Development, Evaluation and Promotion committees for teachers and\nother staff whether at the level of the department, the Faculty, or the Institute;\n(c)     Career Placement and Internship Committee of each Faculty;\n(d)     Search Committee for the appointment of the Vice-Chancellor;\n(e)     the Representation Committees for appointment to the Board, the Syndicate and the\nAcademic Council;\n(f)     Faculty Council;\n(g)     Departmental Council; and\n(h)     Quality Assurance Committee (QAC).\n(3) The Board, the Syndicate and the Academic Council, may set up such other committees or\nsub-committees, by whatever name described, as are considered desirable through statutes or\nregulations as appropriate. Such committees or sub-committees shall be Authorities of the Institute for"
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Board of Governors",
      "content": "(1) The body responsible for the governance of the Institute shall\nbe described as the Board of Governors and shall consist of the following, namely:__\n(a)     the Chancellor who shall be its Chairperson;\n(b)     the Vice-Chancellor;\n(c)     the Pro-Vice-Chancellor;\n(d)     one member of the Government not below the rank of Additional Secretary from the\nconcerned ministry or any other department relevant to the special focus of the Institute;\n(e)     four persons from society at large, preferably two or at least one female being persons\nof distinction in the fields of administration, management, education, academics, law,\naccountancy, medicine, fine arts, architecture, agriculture, science, technology,\nindustry and engineering such that the appointment of these persons reflects a balance\nacross the various fields;\n(f)     one person from amongst the alumni of the Institute;\n(g)     two persons from the academic community of the country, other than an employee of\nthe Institute, at the level of professor or principal of a college;\n(h)     four Institute teachers, one from each tier i.e., Professor, Associate Professor, Assistant\nProfessor and Lecturer;\n(i)     nominee of the Commission;\n(j)     Vice-Chancellor, National Skills University, Islamabad; and (k) one person nominated\nby the sponsoring body or company.\n(2) The numbers of the members of the Board, specified against clauses (f) to (i) of sub-section\n(1) may be increased by the Board, through Statutes subject to condition that the total membership of\nthe Board, does not exceed twenty-one, with a maximum of five Institute teachers and the increase is\nbalanced, to the extent possible, across the different categories specified in sub-section (1).\n(3) All appointments to the Board, except the Chancellor, shall be made by the Chancellor.\nAppointments of persons specified in clauses (f) and (g) of sub-section (1) shall be made from amongst\na panel of three names for each vacancy recommended by the Representation Committee set up in\nterms of section 30 and in accordance with procedure as may be prescribed:\nProvided that effort shall be made, without compromising on quality or qualification, to give\nfair representation to women on the Board:\nProvided further that as regards the Institute teachers specified in clause (h) of sub-section (1),\nthe Board, shall prescribe a procedure for appointment based on elections that provide for voting by\nthe various categories of Institute teachers:\nProvided also that the Board, may alternatively prescribe that appointment of Institute teachers\nto the Board shall also be in the manner provided by this sub-section for the persons specified in clauses\n(f) to (g) of sub-section (1).\n(4) The members of the Board, other than ex-officio members, shall hold office for a term three\nyears. One-third of the members, other than ex-officio members, of the first Board, to be determined\nby lot, shall retire from office on expiration of one year from the date of appointment by the Chancellor.\nOne half of the remaining members, other than ex-officio members, of the first Board, to be determined\nby lot, shall retire from office on the expiration of two years from the date of appointment and the\nremaining one-half, other than ex-officio members, shall retire from office on the expiration of the third\nyear:\nProvided that no person, other than an ex-officio member, shall serve on the Board, for more\nthan two consecutive terms:\nProvided further that the Institute teachers appointed to the Board, shall not serve for two\nconsecutive terms.\n(5) The Board shall meet at least twice in a calendar year.\n(6) Service on the Board shall be on honorary basis. However, actual expenses may be\nreimbursed as prescribed.\n(7) The Registrar shall be the secretary of the Board.\n(8) Subject to sub-section (2) of section 8 and sub-section (2) of section 10, in the absence of\nthe Chancellor, meetings of the Board, shall be presided over by such member, not being an employee\nof the Institute or the Government, as the Chancellor may, from time to time, nominate. The member\nso nominated shall be the convener of the Board.\n(9) Unless otherwise prescribed by this Act, all decisions of the Board, shall be taken based on\nthe opinion of a majority of the members present. In the event of the members being evenly divided\non any matter the person presiding over the meeting shall have a casting vote.\n(10) The quorum for a meeting of the Board, shall be two-third of its membership, a fraction\nbeing counted as one."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Powers and functions of the Board",
      "content": "(1) The Board, shall have power of general\nsupervision over the Institute and shall hold the Vice-Chancellor and the Authorities accountable for\nall the functions of the Institute. The Boord, shall have all powers of the Institute not expressly vested\nin an Authority or officer by this Act and all other powers not expressly mentioned by this Act that are\nnecessary for the performance of its functions.\n(2) Without prejudice to the generality of the foregoing powers, the Board, shall have the\npowers to__\n(a)     approve the proposed annual plan of work, the annual and revised budget\nestimates, the annual report, and the annual statement of accounts;\n(b)     hold, control and lay down policy for administration of the property, funds and\ninvestments of the Institute, including the approval of the sale and purchase or\nacquisition of immovable property;\n(c)     oversee the quality and relevance of the Institute’s academic programmes and\nto review the academic affairs of the Institute in general;\n(d)    approve the appointment of the Deans, Professors, Associate Professors and\nsuch other senior faculty and senior administrators as may be prescribed;\n(e)    institute schemes, directions and guidelines for the terms and conditions of\nappointment of all officers, teachers and other employees of the Institute;\n(f)    approve strategic plans;\n(g)    approve financial resource development plans of the Institute;\n(h)    to consider the drafts of statutes and regulations proposed by the Syndicate and\nthe Academic Council and deal with them in the manner as provided for in\nsections 27 and 29, as the case may be:\nProvided that the Board, may frame a statute or regulation on its own\ninitiative and approve it after calling for advice of the Syndicate or the\nAcademic Council as the case may be;\n(i)    annul by order in writing the proceedings of any Authority or officer if the Board\nis satisfied that such proceedings are not in accordance with the provisions of\nthis Act, statutes or regulations after calling upon such Authority or officer to\nshow cause why such proceedings should not be annulled;\n(j)    recommend to the Chancellor removal of any member of the Board, in\naccordance with the provisions of this Act;\n(k)    make appointment of members of the Syndicate, other than ex-officio members,\nin accordance with the provisions of this Act;\n(l)    make appointment of members of the Academic Council, other than ex-officio\nmembers, in accordance with the provisions of this Act;\n(m)    appoint emeritus professors on such terms and conditions as may be prescribed;\n(n)    remove any person from the membership of any Authority if such person:\n(i)     has become of unsound mind declared as such by the competent court\nof law; or\n(ii)    has become incapacitated to function as member of such Authority; or\n(iii)   has been convicted by a competent court of law convicted for an offence\ninvolving moral turpitude; and\n(o)    determine the form, provide for the custody and regulate the use of the common\nseal of the Institute.\n(3) The Board may, subject to the provisions of this Act delegate all or any of the powers and\nfunctions of any Authority, officer or employee of this Institute at its main campus, to any Authority,\ncommittee, officer or-employee at its additional campus for the purpose of exercising such powers and\nperforming such functions in relation to such additional campus and for this purpose the Board may\ncreate new posts or positions at the additional campus."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Visitation",
      "content": "The Board may, in accordance with the terms and procedures as may be\nprescribed, cause an inspection to be made in respect of any matter connected with the Institute."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Syndicate",
      "content": "(1) There shall be a Syndicate of the Institute consisting of the following\nnamely:__\n(a)     the Vice-Chancellor who shall be its Chairperson;\n(b)     the Pro-Vice-Chancellor;\n(c)     the Deans of the Faculties of the Institute;\n(d)     three professors from different departments, who are not members of the Board, to be\nelected by the Institute teachers in accordance with procedure to be prescribed by the\nBoard;\n(e)     Principals, Directors or Heads of the constituent colleges;\n(f)     the Registrar;\n(g)     the Director (QEC);\n(h)     the Director (P&D);\n(i)     the Director (ORIC);\n(j)     the Treasurer; and\n(k)     the Controller of Examinations.\n(2) Members of the Syndicate, other than ex-officio members, shall hold office for a term of\nthree years.\n(3) As regards the three professors described in clause (d) of sub-section (1) the Board may, as\nan alternative to elections, prescribe a procedure for proposal of a panel of names by the Representation\nCommittee set up in terms of section 30. Appointment of persons proposed by the Representation\nCommittee may be made by the Board on recommendation of the Vice-Chancellor.\n(4) The quorum for a meeting of the Syndicate shall be one-half of the total number of its\nmembers, a fraction being counted as one.\n(5) The Syndicate shall meet at least once in each quarter of the year."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Powers and duties of the Syndicate",
      "content": "(1) The Syndicate shall be the executive body of\nover affairs and management of the Institute.\n(2) Without prejudice to the generality of the foregoing powers and subject to the provisions\nof this Act, the statutes and directions of the Board, the Syndicate shall have the following powers\nnamely:__\n(a)    to consider the annual report, the annual and revised budget estimates and to submit\nthese to the Board of Governors;\n(b)    to transfer and accept transfer of movable property on behalf of the Institute;\n(c)    to enter into, vary, carry out and cancel contracts on behalf of the Institute;\n(d)    to cause proper books of account to be kept for all sums of money received and\nexpended by the Institute and for the assets and liabilities of the Institute;\n(e)    to invest any money belonging to the Institute including any unapplied income in any\nof the securities described in section 20 of the Trusts Act, 1882 (Act II of 1882) or\nsearch other law for time being in force, or in the purchase of immovable property or\nin such other manner, as it may prescribe, with the like power of varying such\ninvestments;\n(f)    to receive and manage any property transferred and grants, bequests, trusts, gifts,\ndonations, endowments and other contributions made to the Institute;\n(g)    to administer any funds placed at the disposal of the Institute for specified purposes;\n(h)    to provide the buildings, libraries, premises, furniture, apparatus, equipment and other\nmeans required for carrying out the work of the Institute;\n(i)    to establish and maintain halls of residence and hostels or approve or license hostels or\nlodgings for the residence of students;\n(j)    to recommend to the Board admission of educational institutions to the privileges of the\nInstitute and withdraw such privileges;\n(k)    to arrange for the inspection of colleges and the departments;\n(1)    to institute professorships, associate professorships, assistant professorships,\nlectureships and other teaching posts or to suspend or to abolish such posts;\n(m)    to create, suspend or abolish such administrative or other posts as may be necessary;\n(n)    to prescribe the duties of officers, teachers and other employees of the Institute;\n(o)    to report to the Board on matters with respect to which it has been asked to report;\n(p)    to appoint members to various Authorities in accordance with the provisions of the Act;\n(q)    to propose drafts of statutes for submission to the Board;\n(r)    to regulate the conduct and discipline of the students of the Institute;\n(s)    to take actions necessary for the good administration of the Institute in general and to\nthis end exercise such powers as are necessary;\n(t)    to delegate any of its powers to any Authority or officer or a committee; and\n(u)    to perform such other functions as have been assigned to it by the provisions of this Act\nor may be assigned to it by the Statutes."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Academic Council",
      "content": "(1) There shall be an Academic Council of the Institute consisting of\nthe following:__\n(a)    the Vice-Chancellor who shall be its Chairperson;\n(b)    the Pro-Vice-Chancellors;\n(c)    the Deans of Faculties and such Heads of departments, as may be prescribed;\n(d)    five members representing the departments, institutes and the constituent colleges to be\nelected in the manner prescribed by the Board of Governors;\n(e)    two Principals of constituent colleges;\n(f)    five Professors including Emeritus Professors;\n(g)    the Registrar;\n(h)    the Director (QEC);\n(i)    nominee of the Commission;\n(j)    the Controller of Examinations; and\n(k)    the Librarian.\n(2) The Board shall appoint members of the Academic Council, other than the ex-officio and\nthe elected members, on the recommendation of Vice-Chancellor:\nProvided that as regards the five professors and the members representing the departments,\ninstitutes and the constituent colleges, the Board may, as an alternative to elections, prescribe a\nprocedure for proposal of a panel of names by the Representation Committee set up in terms of section"
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Appointment of persons proposed by the Representation Committee may be made by the Board on",
      "content": "recommendation of the Vice-Chancellor.\n(3) Members of the Academic Council shall hold office for three years.\n(4) The Academic Council shall meet at least once in each quarter.\n(5) The quorum for meetings of the Academic Council shall be one-half of the total number of\nmembers, a fraction being counted as one."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Powers and functions of the Academic Council",
      "content": "(1) The Academic Council shall be the\nprincipal academic body of the Institute and shall, subject to the provisions of this Act and the statutes,\nhave the power to lay down proper standards of instruction, research and examinations and to regulate\nand promote the academic life of the Institute and the colleges.\n(2) Without prejudice to the generality of the foregoing powers and subject to the provisions\nof this Act and the Statutes, the Academic Council shall have the power to__\n(a)     approve the policies and procedures pertaining to the quality of academic programmes;\n(b)     approve academic programmes;\n(c)     approve the policies and procedures pertaining to student related functions including\nadmissions, expulsions, punishments, examination and certification;\n(d)     approve the policies and procedures assuring quality of teaching and research;\n(e)     propose to the Syndicate schemes for the constitution and organization of Faculties,\nteaching departments and board of studies;\n(f)     appoint paper setters and examiners for all examinations of the Institute after receiving\npanels of names from the relevant authorities;\n(g)     institute programmes for the continued professional development of Institute Teachers\nat all levels;\n(h)     recognize the examinations of other universities or examining bodies as equivalent to\nthe corresponding examinations of the Institute;\n(i)     regulate the award of studentships, scholarships, exhibitions, medals and prizes;\n(j)     propose regulations for submission to the Board;\n(k)     prepare an annual report on the academic performance of the Institute; and\n(l)     perform such other functions as may be prescribed by regulations."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Appointment of Committees by certain Authorities",
      "content": "(1) The Board, the Syndicate, the\nAcademic Council and other Authorities may, from time to time, appoint such standing, special or\nadvisory committees, as they may deem fit and may place on such committee persons who are not\nmembers of the Authorities appointing the committees.\n(2) The constitution, functions and powers of the Authorities for which no specific provision\nhas been mode in this Act shall be such as may be prescribes by statutes or Regulations.\nSTATUTES, REGULATIONS AND RULES"
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Statutes",
      "content": "(1) Subject to the provisions of this Act, statutes to be published in the official\nGazette, may be made to regulate or prescribe all or any of the following matters, namely:__\n(a)     the contents of and the manner in which the annual report to be presented by the Vice-\nChancellor before the Board shall be prepared;\n(b)     the Institute fees and other charges;\n(c)     the constitution of any pension, insurance, gratuity, provident fund and benevolent fund\nfor Institute employees;\n(d)     the scales of pay and other terms and conditions of service of officers, teachers and\nother Institute employees;\n(e)     the maintenance of the register of registered graduates;\n(f)     admission of educational institutions to the privileges of the Institute and the\nwithdrawal of such privileges;\n(g)     the establishment of faculties, departments, institutes, colleges and other academic\ndivisions;\n(h)     the powers and duties of officers and teachers;\n(i)     conditions under which the Institute may enter into arrangements with other institutions\nor with public bodies for purposes of research and advisory services;\n(j)     conditions for appointment of emeritus Professors and award of honorary degrees;\n(k)     efficiency and discipline of Institute employees;\n(1)     the constitution and procedure to be followed by Representation Committees in\ncarrying out functions in terms of this Act;\n(m)     the constitution and procedure to be followed by the Search Committee for appointment\nof the Vice-Chancellor;\n(n)     constitution, functions and powers of the Authorities of the Institute; and\n(o)     all other matters which by this Act are to be or may be prescribed or regulated by\nstatutes.\n(2) The draft of Statutes shall be proposed by the Syndicate to the Board which may approve\nor pass with such modifications as the Board may think fit or may refer to the Syndicate, as the case\nmay be, for reconsideration of the proposed draft:\nProvided that statutes concerning any of the matters mentioned in clauses (a) and (I) of sub-\nsection (1) shall be initiated and approved by the Board, after seeking views of the Syndicate:\nProvided further that the Board may initiate a statute with respect to any matter in its power or\nwith respect to which a statute may be made in terms of this Act and approve such statute after seeking\nviews of the Syndicate."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Regulations",
      "content": "(1) Subject to the provisions of this Act and the Statues, the Academic\nCouncil may make regulations to be published in the official Gazette for all or any of the following\nmatters namely:__\n(a)     the courses of study for degrees, diplomas and certificates of the Institute;\n(b)     the manner in which the teaching referred to in sub-section (1) of section 6 shall\nbe organized and conducted;\n(c)     the admission and expulsion of students to and from the Institute;\n(d)     the conditions under which students shall be admitted to the courses and the\nexaminations of the Institute and shall become eligible for the award of degrees,\ndiplomas and certificates;\n(e)     the conduct of examinations;\n(f)     conditions under which a person may carry on independent research to entitle\nhim to a degree;\n(g)     the institution of fellowships, scholarships, exhibitions, medals and prizes;\n(h)     the use of the library;\n(i)     the formation of faculties, departments and Board of Studies; and\n(j)     all other matters which by the Act or these statutes are to be or may be prescribed\nby regulations.\n(2) Regulations shall be proposed by the Academic Council and shall be submitted to the Board\nwhich may approve them or withhold approval or refer them back to the Academic Council for\nreconsideration. A Regulation proposed by the Academic Council shall not be effective unless it\nreceives the approval of the Board.\n(3) Regulations regarding or incidental to matters contained in sub-clauses (g) and (i) shall not\nbe submitted to the Board without the prior approval of the Syndicate."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Amendment and repeal of statutes and regulations",
      "content": "The procedure for adding to,\namending or repealing the statutes and the regulations shall be the same as that prescribed respectively\nfor making statutes and regulations."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Rules",
      "content": "(1) The Authorities and the other bodies of the Institute may make rules, to be\npublished in the official Gazette, consistent with the provisions of this Act, statutes or the regulations,\nto regulate any matter relating to affairs of the Institute which has not been provided for by this Act or\nthat is not required to be regulated by statutes or regulations, including rules to regulate the conduct of\nbusiness and the time and place of meetings and related matters.\n(2) Rules shall become effective upon approval by the Syndicate."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Institute Fund",
      "content": "The Institute shall have a fund to which shall be credited its income from\nfees, charges, donations, trusts, bequests, endowments, contributions, grants and all other sources."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Audits and accounts",
      "content": "(1) The accounts of the Institute shall, subject to Articles 169 and\n170 of the Constitution of the Islamic Republic of Pakistan, be maintained in such form and in such\nmanner as may be prescribed.\n(2) The teaching departments, constituent colleges and institutes and all other bodies designated\nas such by the Syndicate in terms of statutes shall be independent cost centers of the Institute with\nauthority vested in the head of each cost centre to sanction expenditure out of the budget allocated to\nit:\nProvided that re-appropriation from one head of expenditure to another may be made by the\nhead of a cost centre in accordance with and to the extent prescribed by statutes.\n(3) All funds generated by a teaching department, constituent college or other unit of the\nInstitute through consultancy, research or other provision of service shall be made available without\nprejudice to the budgetary allocation otherwise made, after deduction of overheads in the manner and\nto the extent prescribed by statutes, to the teaching department, constituent college or other unit for its\ndevelopment. A part of the funds so generated may be shared with the Institute teachers or researchers\nin charge of the consultancy, research or service concerned in the manner and to the extent prescribed\nby statutes.\n(4) No expenditure shall be made from the funds of the Institute, unless a bill for its payments\nhas been issued by the head of the cost centre concerned in accordance with the relevant statutes and\nthe Treasurer has verified that the payment is provided for in the approved budget of the cost centre,\nsubject to the authority to re-appropriate available to the head of the cost centre.\n(5) Subject to the provisions of Articles 169 and 170 of the Constitution of the Islamic Republic\nof Pakistan, provision shall be made for an internal audit of the finances of the Institute.\n(6) Without prejudice to the requirement of audit by an auditor appointed by Government in\naccordance with the provisions of any other law for the time being in force, the annual audited\nstatement of accounts of the Institute shall be prepared in conformity with the generally accepted\naccounting principles (GAAP) by a reputed firm of chartered accountants and signed by the Treasurer.\nThe annual audited statement of accounts so prepared shall be submitted to the relevant Government\nforum.\n(7) The observations, if any, together with such annotations as the Treasurer may make, shall\nbe considered by the Syndicate and shall be placed before the Board within six months of closing of\nthe financial year."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Opportunity to show cause",
      "content": "Except as otherwise provided by law no officer, teacher or\nother employee of the Institute holding a post shall be reduced in rank, or removed or compulsorily\nretired from service for cause arising out of any act or omission on the part of the person concerned\nunless he has been given a reasonable opportunity of showing cause against the action proposed to be\ntaken."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Appeal to the Syndicate and the Board",
      "content": "Where an order is passed punishing any officer\nother than the Vice-Chancellor, teacher or other employee of the Institute or altering or interpreting to\nhis disadvantage the prescribed terms or conditions of his service, he shall, where the order is passed\nby any officer or teacher of the Institute other than the Vice-Chancellor, have the right to appeal to the\nSyndicate against the order, and where the order is passed by the Vice-Chancellor, have the right to\nappeal to the Board."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Service of the Institute",
      "content": "(1) All persons employed by the Institute in accordance with the\nterms and conditions of service prescribed by statutes shall be persons in the service of the Institute.\n(2) An officer, teacher or other employee of the Institute shall retire from service on attainment\nof such age or tenure of service as may be prescribed."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Benefits and insurance",
      "content": "The Institute shall constitute for the benefit of its officers,\nteachers and other employees schemes, as may be prescribed, for the provision of post-employment\nbenefits as well as health and life insurance while in service."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Commencement of term of office of members of Authority",
      "content": "(1) When a member of a\nnewly constituted Authority is elected, appointed, or nominated, his term of office, as fixed under this\nAct, shall commence from such date as may be prescribed.\n(2) Where a member who has accepted any other assignment or for any other similar reason\nremains absent from the Institute for a period of not less than six months, he shall be deemed to have\nresigned and vacated his seat."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Filling of casual vacancies in Authorities",
      "content": "Any casual vacancy among the members of\nany Authority shall be filled, as soon as conveniently may be, in the same manner and by the same\nperson or Authority that had appointed the member whose place has become vacant and the person\nappointed to the vacancy shall be a member of such Authority for the residue of the term for which the\nperson whose place he fills would have been a member."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Flaws in the constitution of Authorities",
      "content": "Where there is a flaw in the constitution of an\nAuthority, as constituted by this Act, the Statutes or the Regulations on account of the abolition of a\nspecified office under Government or because an organization, institution or other body outside the\nInstitute has been dissolved or has ceased to function, or because of some other similar reason, such\nflaw shall be removed in such manner as the Board may direct."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Proceedings of Authorities not invalidated by vacancies",
      "content": "No act, resolution or decision\nof any Authority shall be invalid by reason of any vacancy in the Authority doing, passing, or making\nit or by reason of any want of qualification or invalidity in the election, appointment or nomination of\nany de-facto member of the Authority, whether present or absent."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. First Statutes and Regulations",
      "content": "(1) Notwithstanding anything to the contrary contained\nin this Act, statutes contained in the schedule to this Act shall be deemed to be the first statutes make\nunder this Act until amended or repealed by the Syndicate with approval of the Board under sections\n32 and 33 and shall continue to remain in force until amended or replaced or till such time as new\nstatutes and regulations are made in accordance with the provisions of this Act.\n(2) The Patron shall make the first regulations which shall be deemed to be the regulations\nmade under this Act until amended or repealed by the Academic Council with approval of the Board."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Removal of difficulties",
      "content": "(1) If any question arises as to the interpretation of any of the\nprovisions of the Act, it shall be placed before the Patron and Commission whose decision thereon\nshall be final.\n(2) If any difficulty arises in giving effect to any of the provisions of this Act, the Chancellor\nmay make such order after obtaining the views of the Board, not inconsistent with the provisions of\nthis Act, as may appear to him to be necessary for removing the difficulty.\n(3) Where this Act makes any provision for anything to be done but no provision or no\nsufficient provision has been made as respects the authority by whom, or the time at which, or the\nmanner in which, it shall be done, then it shall be done by such authority, at such time, or in such\nmanner as the Chancellor may direct after obtaining the views of the Board."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Indemnity",
      "content": "No suit or other legal proceedings shall lie against the Government, the\nInstitute or any Authority, officer or employee of the Government or the Institute or any person in\nrespect of anything which is done in good faith under this Act.\nThe Schedule\nThe First Statutes"
    }
  ],
  "definitions": [
    {
      "term": "Academic Council",
      "definition": "the Academic Council of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "an Authority of the Institute specified in section 22 or any of the Authority of the Institute established as per provisions of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of Governors of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Board of Directors",
      "definition": "the Board of Directors of the Shabbir and Sagheer Educational Services (Private) limited;",
      "source_provision": "sec2"
    },
    {
      "term": "Chancellor",
      "definition": "the Chancellor of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the Higher Education Commission set up under the Higher Education Commission Ordinance, 2002 (LIII of 2002);",
      "source_provision": "sec2"
    },
    {
      "term": "Dean",
      "definition": "the Dean of a Faculty of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Department",
      "definition": "a teaching, research or training department maintained and administered or recognized by the Institute in a prescribed manner;",
      "source_provision": "sec2"
    },
    {
      "term": "Director",
      "definition": "the Head of a Teaching Division of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Faculty means the Faculty of the Institute; (xiii) “Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "Institute teacher",
      "definition": "a whole-time teacher appointed and paid by the Institute or recognized by the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by statutes, regulations and rules made under this Act; (xvii) “Principal” means the head of a constituent college or a constituent school of the Institute; (xviii) “Professor Emeritus” means retired professor working in a faculty in an honorary capacity;",
      "source_provision": "sec2"
    },
    {
      "term": "Registrar",
      "definition": "the Registrar of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "registered graduate",
      "definition": "a graduate of the Institute whose name stands entered in the registered maintained for the purpose;",
      "source_provision": "sec2"
    },
    {
      "term": "Representation Committees",
      "definition": "the Representation committees constituted under this Act; (xxii) “Review Panel” means the Review Panel constituted by the Chanceller in accordance with the provisions of this Act; (xxiii) “Schedule” means a schedule to this Act; (xxiv) “Search Committer” means the Search Committee constituted by the Board under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "sponsoring company",
      "definition": "the Shabbir and Sagheer Educational Services (Private) limited registered under section 16 of the Companies Act, 2017 (XIX of 2017); (xxvi) “statutes”, “regulations” and “rules” means the statutes, regulations and rules respectively made or deemed to have been made under this Act and for the time being in force; (xxvii) “Syndicate” means the Syndicate of the Institute; (xxviii) “teachers” include Professors, Associate Professors, Assistant Professors and Lecturers engaged whole-time by the Institute and such other persons as may be declared by regulations; (xxix) “Treasurer” means the Treasurer of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Pro-Vice-Chancellor",
      "definition": "the Pro-Vice-Chancellor of the Institute; and (xxxi) “Vice-Chanceller” means the Vice-Chanceller of the Institute;",
      "source_provision": "sec2"
    }
  ]
}
