{
  "id": "pk-national-investment-unit-trust-ordinance-1965",
  "type": "statute",
  "title": "National Investment (Unit) Trust Ordinance, 1965",
  "title_en": "National Investment (Unit) Trust Ordinance, 1965",
  "short_name": "NITO",
  "status": "in_force",
  "issued_date": "1965-04-09",
  "in_force_date": "1965-04-09",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJ%2BZ-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Investment (Unit) Trust Ordinance, 1965 (VII of 1965) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Power to make rules",
      "content": "ORDINANCE No. VII OF 1965\n[8th April, 1965]\nAN\nto provide for certain matters relating to the National Investment (Unit) Trust\nWHEREAS it is expedient to provide for certain matters relating to the National Investment\n(Unit) Trust and for matters connected therewith;\nAND WHEREAS the National Assembly is not in session and the Acting President is\nsatisfied that circumstances exist which render immediate legislation necessary;\nNOW, THEREFORE, in exercise of the powers conferred by clause (1) of Article 29 of the\nConstitution and of all other powers enabling him in that behalf, the Acting President makes and pro-\nmulgates the following Ordinance:⸻"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Ordinance may be called the National\nInvestment (Unit) Trust Ordinance, 1965.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_(1) In this Ordinance, unless there is anything repugnant in the subject or\ncontext,___\n(a)     “Management Company” means the National Investment Trust Limited, and\nincludes any other company for the time being managing the affairs of the\nTrust;\n(b)     “rules” means rules made under this Ordinance;\n(c)     “Trust” means the National Investment (Unit) Trust constituted under the\nTrust Deed or, if that Trust is reconstituted, the reconstituted trust;\n(d)     “Trustee” means the National Bank of Pakistan, as trustee under the Trust\nDeed and includes its successors, or if the Trust is reconstituted, the trustees of\nthe reconstituted trust;\n(e)     “Trust Deed” means the deed of trust dated the 12th November, 1962,\nconstituting the National Investment (Unit) Trust, made between the National\nInvestment Trust Limited, a limited liability company registered under the\nCompanies Act, 1913 (VII of 1913), with its registered office at Karachi as\nManagement Company of the one part, and the National Bank of Pakistan, a\nbank constituted under the National Bank of Pakistan Ordinance, 1949 (XIX\nof 1949), having its head office at Karachi as Trustee of the other part, and\nincludes any supplemental deeds made in accordance with the aforesaid deed.\n(2) All other expressions defined or used in the Trust Deed but not defined in this Ordinance\nshall have the same sense as is given to them in the Trust Deed."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Units to be transferable movable property",
      "content": "Subject to the rules and the provisions of\nthe Trust Deed, Units shall be deemed to be transferable movable property."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power of 1[Federal Government] to authorize issue of Bearer Certificates",
      "content": "Notwithstanding anything to the contrary contained in any other law for the time being in force, but\nsubject to rules, the 1[Federal Government] may, by notification in the official Gazette, authorise the\nTrust to issue Bearer Certificates in respect of the Units sold, and no Bearer Certificates shall be\nissued by the Trust unless so authorised."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Units to be approved securities",
      "content": "Notwithstanding anything to the contrary contained in\nany law for the time being in force, the Units shall be deemed to be included among the securities\nenumerated in section 20 of the Trust Act, 1882 (II of 1882), and to be approved securities and\napproved investments for the purposes of the Insurance Act, 1938 (IV of 1938) and section 282B (2)\nof the Companies Act, 1913 (VII of 1913)."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Trust Deed to be binding on the holders of Units",
      "content": "Notwithstanding anything to the\ncontrary contained in any other law for the time being in force but subject to section 4 of this\nOrdinance, the provisions of the Trust Deed shall be binding upon every Certificate Holder and his\nheirs, successors and legal representatives as if he were a party to the Trust Deed having full\nknowledge of its contents."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Notice of trust not receivable",
      "content": "No notice of a trust, express, implied or constructive,\nshall be receivable by or on behalf of the Trust:\nProvided that the Management Company or the Trustee may, without creating any liability on\ntheir part, record in their books and comply with such directions of the holders of Units for the\ndistribution of income as they think fit."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Act XVIII of 1891 to apply",
      "content": "The provisions of the Bankers Books Evidence Act, 1891\n(XVIII of 1891), shall apply to the books of the Trust as if it were a bank as defined in section 2 of\nthe Act."
    }
  ],
  "definitions": [
    {
      "term": "Management Company",
      "definition": "the National Investment Trust Limited, and includes any other company for the time being managing the affairs of the Trust;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "Trust",
      "definition": "the National Investment (Unit) Trust constituted under the Trust Deed or, if that Trust is reconstituted, the reconstituted trust;",
      "source_provision": "sec2"
    },
    {
      "term": "Trustee",
      "definition": "the National Bank of Pakistan, as trustee under the Trust Deed and includes its successors, or if the Trust is reconstituted, the trustees of the reconstituted trust;",
      "source_provision": "sec2"
    },
    {
      "term": "Trust Deed",
      "definition": "the deed of trust dated the 12th November, 1962, constituting the National Investment (Unit) Trust, made between the National Investment Trust Limited, a limited liability company registered under the Companies Act, 1913 (VII of 1913), with its registered office at Karachi as Management Company of the one part, and the National Bank of Pakistan, a bank constituted under the National Bank of Pakistan Ordinance, 1949 (XIX of 1949), having its head office at Karachi as Trustee of the other part, and includes any supplemental deeds made in accordance with the aforesaid deed. (2) All other expressions defined or used in the Trust Deed but not defined in this Ordinance shall have the same sense as is given to them in the Trust Deed.",
      "source_provision": "sec2"
    }
  ]
}
