{
  "id": "pk-national-judicial-policy-making-committee-ordinance-2002",
  "type": "statute",
  "title": "National Judicial (Policy Making) Committee Ordinance, 2002",
  "title_en": "National Judicial (Policy Making) Committee Ordinance, 2002",
  "short_name": "NJMCO",
  "status": "in_force",
  "issued_date": "2002-10-08",
  "in_force_date": "2002-10-08",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FtbJc%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Judicial (Policy Making) Committee Ordinance, 2002 (LXXI of 2002) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.⎯(1) This Ordinance may be called the National",
      "content": "Judicial (Policy Making) Committee Ordinance, 2002.⎯\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.⎯ In this Ordinance, unless there is anything repugnant to the subject or",
      "content": "context,⎯\n(a)   “Commission” means the Law and Justice Commission of Pakistan\nestablished under the Law and Justice Commission of Pakistan Ordinance,\n1979 as amended;\n(b)   “Committee” means the National Judicial (Policy Making) Committee\nestablished under section 3;\n(c)   “Chairman” means the Chairman of the Committee; and\n(d)   “Fund” means the fund established under the Law and Justice\nCommission of Pakistan Ordinance, 1979, as amended."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of National Judicial (Policy Making) Committee.⎯ There shall be a",
      "content": "National Judicial (Policy Making) Committee headed by Chief Justice of Pakistan, who shall be the\nChairman of the Committee, and comprising the Chief Justice, Federal Shariat Court and Chief\nJustices of 1[* *] High Courts as its Members."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Functions of the Committee.⎯ The Committee shall coordinate and harmonize judicial",
      "content": "policy within the Court system, and in coordination with the Commission, ensure its implementation.\nThe Committee shall also perform the following functions, namely:⎯\n(a)     improving the capacity and performance of the administration of justice;\n(b)     setting performance standards for judicial officers and persons associated with\nperformance of judicial and quasi judicial functions;\n(c)     improvement in the terms and conditions of service of judicial officers and court staff,\nto ensure skilled and efficient judiciary; and\n(d)     publication of the annual          or periodic      reports    of the Supreme\nCourt, Federal Shariat Court, High Courts and Courts subordinate to High Courts and\nAdministrative Courts and Tribunals."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Constitution of sub",
      "content": "committees.⎯ The Committee may constitute sub-committees\nconsisting of its one or more Members, as it deems fit, and may assign them any matter relevant to\nthe functions of the Committee."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Reports.⎯ The Committee shall publish annual report of its activities and such other",
      "content": "periodic or special reports relating to its functioning as it deems fit. The reports shall be submitted to\nthe President of Pakistan."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Power to make rules. ⎯ The Committee may make rules of procedure for conduct or",
      "content": "its business and discharge of its functions.\n__________\n1\nOmitted by the National Judicial (Policy Making) Committee (Amendment) Act, 2014 (III of 2014) s.2"
    }
  ],
  "definitions": [
    {
      "term": "Commission",
      "definition": "the Law and Justice Commission of Pakistan established under the Law and Justice Commission of Pakistan Ordinance, 1979 as amended;",
      "source_provision": "sec2"
    },
    {
      "term": "Committee",
      "definition": "the National Judicial (Policy Making) Committee established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Committee; and",
      "source_provision": "sec2"
    },
    {
      "term": "Fund",
      "definition": "the fund established under the Law and Justice Commission of Pakistan Ordinance, 1979, as amended.",
      "source_provision": "sec2"
    }
  ]
}
