{
  "id": "pk-national-press-trust-appointment-of-chairman-act-1972",
  "type": "statute",
  "title": "National Press Trust (Appointment of Chairman) Act, 1972",
  "title_en": "National Press Trust (Appointment of Chairman) Act, 1972",
  "short_name": "NPTOC",
  "status": "in_force",
  "issued_date": "1972-09-19",
  "in_force_date": "1972-09-19",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUZWFq-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Press Trust (Appointment of Chairman) Act, 1972 (XIV of 1972) published by The Pakistan Code (Service Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Act may be called the National Press Trust\n(Appointment of Chairman) Act, 1972.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(a)        “National Press Trust” means the Trust of that name referred to in the Trust\nDeed;\n(b)        “Trust Deed” means the Deed made on the 8th day of April, 1964, by which the\nNational Press Trust was declared;\n(c)        “Trust Fund” has the same meaning as in the Trust Deed."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Act to override other laws. The provisions of this Act shall have effect notwithstand ing",
      "content": "anything contained in any other law for the time being in force or in the Trust Deed or in the regulatio ns,\nbye-laws or rules framed thereunder."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Appointment, resignation, etc., of Chairman of the National Press Trust",
      "content": "(1) The\nPresident shall appoint a person of eminence, repute and integrity as the Chairman of the National\nPress Trust, hereinafter referred to as the Chairman.\n(2) The Chairman shall hold office during the pleasure of the President and shall receive such\nremuneration and allowances to be paid from out of the income of the Trust Fund and be subject to\nsuch conditions as may be determined by the President.\n(3) The Chairman may, by writing under his hand addressed to the President, resign his office.\n(4) The person holding office as Chairman immediately before the commencement of this Act\nshall be deemed to have been appointed under sub-section (1) and the provisions of this Act shall apply\nto him accordingly."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. 1 [Omitted]",
      "content": "RGN Date:-22.04.2024\n1\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch., II."
    }
  ],
  "definitions": [
    {
      "term": "National Press Trust",
      "definition": "the Trust of that name referred to in the Trust Deed;",
      "source_provision": "sec2"
    },
    {
      "term": "Trust Deed",
      "definition": "the Deed made on the 8th day of April, 1964, by which the National Press Trust was declared;",
      "source_provision": "sec2"
    }
  ]
}
