{
  "id": "pk-national-rahmatul-lil-aalameen-wa-khatamun-nabiyyin-authority-act-2022",
  "type": "statute",
  "title": "National Rahmatul-Lil-Aalameen Wa Khatamun Nabiyyin Authority Act, 2022",
  "title_en": "National Rahmatul-Lil-Aalameen Wa Khatamun Nabiyyin Authority Act, 2022",
  "short_name": "NRWKN",
  "status": "in_force",
  "issued_date": "2022-07-18",
  "in_force_date": "2022-07-18",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5hmbw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Rahmatul-Lil-Aalameen Wa Khatamun Nabiyyin Authority Act, 2022 (XV of 2022) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act shall be called the National\nRahmatul-Lil-Aalameen Wa Khatamun Nabiyyin Authority Act, 2022.\n(2)     it extends to the whole of Pakistan.\n(3)     It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, until there is anything that is repugnant to the subject or\ncontext,—\n(a)     “Authority” means the National Rahmatul-Lil-Aalameen Wa Khatamun Nabiyyin\nAuthority established under section 3 of the Act;\n(b)     “Advisory Board” means the advisory board established under section 4;\n(c)     “Chairperson” means the Chairperson of the Authority;\n(d)     “Director General” means the Director General of the Authority, who shall be the in-\ncharge of general administration of the Authority;\n(e)     “Government” means the Federal Government;\n(f)     “member” means member of the Authority;\n(g)     “prescribed” means prescribed by rules or regulations made under this Act;\n(h)     “regulations” means the regulations made under this Act;\n(i)     “rules” means the rules made under this Act;\n(j)     “staff” means the staff and officers of the Authority.\n3       Establishment of the Authority.— (1) there shall be established a National Rahmatul-\nLil-Aalameen Wa Khatamun Nabiyyin Authority by the Government, which shall carry out the\npurposes of this Act.\n(2)     The Prime Minister shall be the Patron-in-Chief of the Authority.\n(3)     The Authority shall comprise a Chairperson and eight (08) other members, to be\nappointed by the Prime Minister, on such terms and conditions and in the manner as determined by the\nPatron-in-Chief:\nProvided that two Muslim Members of the National Assembly shall be nominated by the\nSpeaker as Members of the Authority upon whom sub-section (1) of section 6 shall not apply:\nProvided further that one Member shall be from amongst each of the Treasury and the\nOpposition benches."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Advisory Board",
      "content": "(1) A high-level Advisory Board shall be constituted for providing\nadvice and strategic guidance to the Patron-in-Chief to meet the desired objectives of the Authority.\n(2)     The Advisory Board shall consist of ten members having scholarly eminence and\nimpeccable credentials.\n(3)    The members of the Advisory Board shall be appointed by the Prime Minister, on such\nterms and conditions and in the manner as determined by the Patron-in-Chief.\n(4)     The Advisory Board shall meet at least once on quarterly basis."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Chairperson of the Authority",
      "content": "(1) The Chairperson of the Authority shall be\nappointed by the Prime Minister, on such terms and conditions the manner as determined by the Patron-\nin-Chief, and shall be a person of impeccable integrity, eminent scholarship, reputation and\ncompetence who shall be well-versed in Seerat matters and literature, experienced in religious affairs\nand research. Moreover, he should be at least in possession of a degree equivalent to Master in Islamic\nStudies, Islamic Education, Islamic Law, History and Islamic History & Culture or the degree of LLB\n(Shahriah and Law) or Shahadatul Aalmia from religious institution attached with any wafaq or\nequivalent duly recognized by Higher Education Commission (HEC).\n(2)    The Chairperson shall hold office for a period of three years, which may be extendable\nfor such term or terms as may be determined by the Patron-in-Chief.\n(3)     The Chairperson may resign from his office by writing under his hand, addressed to the\nPrime Minister."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Members of the Authority",
      "content": "(1) Subject to sub-section (4), the members of the\nAuthority shall be appointed by the Prime Minister on such terms and conditions and in the manner as\ndetermined by the Patron-in-Chief and shall be persons of impeccable integrity, possessing high\nmorality and scholarly achievements, and being highly well-versed in Seerat matters and literature,\nexperienced in religious affairs, research, administration and having skills to mass communicate an\npropagate the real ethos and essence of the Seerat. Moreover, he should be at least in possession of a\ndegree equivalent to Master in Islamic Studies, Islamic Education, History, Islamic Law and Islamic\nHistory and Culture or the degree of LLB (Shahriah and Law) or Shahadatul Aalmia from any religious\ninstitution attached with any wafaq or an equivalent degree, duly recognized by Higher Education\nCommission (HEC).\n(2)     A member shall hold office for a term of three years, which may be extendable for such\nterm or terms as may be determined by the Patron-in-Chief.\n(3)     The business of the Authority shall be conducted in such manner as may be prescribed.\n(4)     The Authority shall preferably comprise:—\na       one eminent Seerat Scholar;\nb       one eminent person with expertise in media affairs, who is able to use facts, undertake\nresearch and propagate the real essence of the Seerat to the public at large;\nc       one eminent person with abilities to undertake special initiatives through innovative\napproaches;\nd       one eminent person with Research expertise in the subject matter of Seerat and religion;\ne       one eminent person experienced in prescribing curricula;\nf       one eminent person, having expertise expert in international outreach and equipped to\nprovide counter-narrative to misperceptions of Islam and Islamophobia, while\npropagating the real essence and narrative of the Seerat in the international community."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Management",
      "content": "(1) The general direction and administration of the Authority and its\naffairs shall vest in the Chairperson and the Members, which shall exercise all administrative and\nfinancial powers and do all acts and things which may be exercised or done by the Authority.\n(2)     On questions of policy the Government may issue directives, which shall be final and\nbinding on the Authority.\n(3)   If any question arises as to whether any matter is a matter of policy or not, the decision\nof the Government in respect thereof shall be final."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Powers and functions of the Authority",
      "content": "The functions of the Authority shall be—\n(a)     to actualize the concept of Riyasat-e-Madina based upon justice, rule of law and a\nwelfare state through character building of the nation;\n(b)     to identify the social, economic, and political morals and values from the practical life\nof the last Holy Prophet of Allah                           and inculcate them in the\nlife of individuals and the society at large;\n(c)     formulate polices, strategies and interventions to advance and propagate key elements\nof the life of the last Holy Prophet of Allah ,                      including peace,\nempathy, care for others, tolerance, knowledge, progress, wisdom, patience,\ncontentment, ethical behavior, social bearing, environmental protection and other\nprominent aspects from the Seerat;\n(d)     conducting research studies on the Seerat of Prophet Muhammad\nand the Hadith, for guidance of the young generation;\n(e)   to develop educational and learning processes for better personality development of the\nyoung generation on the pattern of the last Holy Prophet of Allah’s\nlife;\n(f)   to review and project international literature and research on Seerat from all over the\nworld and make it accessible, translatable, and relatable to contemporary times;\n(g)   coordinate with provincial education departments to, organize events, conferences,\ndissemination activities in respect of Seerat- un-Nabi                ;\n(h)   to undertake national level consultations with religious scholars, researchers, and\neducation-related entities in all provinces and areas to design strategies to promote\nSeerat-un-Nabi                       ;\n(i)   to undertake assessments of gaps, challenges, and sources of fallacies and\nmisinformation about the way of life that Islam promotes;\n(j)   provide international counter-narrative to various misconceptions against Islam\nprevalent globally;\n(k)   to bring together eminent scholars and work to agree upon key fundamental elements\nof the Seerat for promotion at national level through education;\n(l)   to promote modesty, non-materialistic approach, simple and dignified lifestyle based\non the life and Sunnah of the Holy Prophet                  ;\n(m)   coordinate with the National Curriculum Council to adopt, and continuously update\ncurricula, syllabi and guidelines for effective uptake of lessons from the Seerat, guided\nby research, logic, and scholarship;\n(n)   to build linkages and partnerships on Seerat research with other prominent entities\nworking in this area;\n(o)   to make efforts and coordinate promotion of Seerat study and scholarships;\n(p)   to guide higher education institutions for establishment of Seerat Chairs;\n(q)   to formulate strategies and frameworks for the organization of the Seerat related events\non key occasions related to Holy Prophet’s                          life and Islamic\nhistory;\n(r)   to engage full-time and part-time resources as deemed appropriate, as per the\nrequirement, on such terms and conditions, as may be prescribed by the Authority;\n(s)   bridge diverging gaps between theoretical and practical aspects, in view of\ntechnological advancements of contemporary world, in relation to the Seerat;\n(t)   to visualize, monitor and take notice of the activities of Qadianiyat, Ahmadiyat,\nLahoriat, Jewism and all other such religions, organizations and institutions who are\nagainst Islam and Pakistan and take necessary steps, including the legal procedure as\nprovided in the law, to address and counter the situation created due to their propaganda\nand actions; and\n(u)     guide the National Curriculum Council to include the topics of Seerat-e-Nabi and\nfinality of Prophethood in the Textbooks."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Secretariat of the Authority",
      "content": "(1) The Secretariat of the Authority shall consist of a\nDirector-General, who shall be appointed by the Prime Minister on such terms and conditions and in\nthe manner as determined by the Patron-in-Chief\n(2)    The Director-General shall also act as the Secretary and Principal Accounting Officer\nof the Authority.\n(3)    The Director-General shall be a person of known integrity and man of noble fame,\nhaving experience in the field of administration and management, and shall either be appointed afresh\nor posted by the Prime Minister and shall be authorized to:—\n(a)     carry out administration and day to day affairs of the Authority;\n(b)     execute all orders and directions given by the Chairperson;\n(c)     prepare periodical reports with objectivity, including a report based on Key\nPerformance Indicators (KPIs), for submission to the Prime Minister by the\nChairperson;\n(d)     implement and coordinate the objects of this Act; and\n(e)     perform any other duty, function or work assigned by the Chairperson.\n(4)     In case, the Director-General is absent or unable to perform functions, the Prime\nMinister may appoint an officer of the Authority as an Acting Director-General to temporarily perform\nthe functions of the Director- General.\n(5)    Until the Authority is duly constituted, the Director-General shall, subject to such\ndirections as the Government may give from time to time, exercise the powers and perform the\nfunctions of the Authority.\n(6)     The officers of the Authority shall have such powers and shall perform such functions\nas may be assigned to them by the Director-General."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Committees and sub",
      "content": "committees of the Authority.— (1) The Authority may, for\ncarrying out its functions, constitute such committees and sub-committees as deemed appropriate by\nthe Authority.\n(2)     The membership of committees or sub-committees and conduct of business thereof\nshall be such, as may be prescribed."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Appointment of officers, staff etc. by the Authority",
      "content": "In addition to the appointment\nin the Secretariat under section 9, the Authority may create posts and appoint such directors, officers,\nstaff, experts or consultants on such terms and conditions, as may be prescribed."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Remuneration of officers and staff of the Authority",
      "content": "(1) The Authority shall by\nregulations determine the terms and conditions including salaries, allowances and other benefits for\nofficers and staff, keeping in view the economic condition of the country, compatible with other such\norganizations, including organization in the private sector.\n13       Staff and officers etc., to be public servants.— The Director General, directors,\nofficers, staff, experts and consultants of the Authority shall, when acting or purporting to act in\npursuance of any of the provisions of this Act, be deemed to be public servants within the meaning of\nsection 21 of the Pakistan Penal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Delegation of powers to the Director",
      "content": "General, etc.— The Authority may, by general\nor special order and subject to such conditions as it may deems fit impose, delegate all or any of its\nadministrative powers or functions under this Act, to the Director General, Directors or a member, or\nan officer of the Authority."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Fund of the Authority",
      "content": "The Fund of the Authority shall consist of—\n(a)     grants and budget from the Federal Government;\n(b)     fee collected or revenue generated by the Authority;\n(c)     aid from national and international agencies; and\n(d)     such sums as the Federal Government may allocate to the Authority other than under\nsub-section (a)."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Budget, audit and accounts",
      "content": "(1) The Authority shall cause proper accounts to be\nmaintained as may be prescribed by the Controller General of Accounts in accordance with Articles\n169 and 170 of the Constitution.\n(2)     As soon as practicable, or at least after the end of the financial year, the Authority shall\nprepare a statement of accounts of the Authority for that year which shall include a balance sheet and\nan account of income and expenditure.\n(3)    Within sixty days after the end of each financial year, the annual financial statements\nshall be audited by the Auditor General of Pakistan.\n(4)     The auditor shall make a report to the Authority upon the balance sheet and accounts,\nwhich shall state whether the balance sheet is a full and fair, containing all necessary particulars and\nproperly drawn up so as to exhibit a true and correct view of affairs of the Authority. In case the auditor\nhas called for any explanation or information from the Authority, it shall be stated by the auditor as to\nwhether such explanation or information was provided to the auditor to his satisfaction or not."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Annual report",
      "content": "The Authority shall prepare once every year, in such form and at\nsuch time as may be prescribed, an annual report giving a true and full account of its activities during\nthe previous year and copies thereof shall be forwarded to the Government, which shall lay it before\nthe National Assembly and the Senate."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Protection of actions taken in good faith under this Act",
      "content": "No suit, prosecution or\nother legal proceedings shall lie against the Government or the Authority or any servant thereof or any\nperson acting under the authority of the Government or the Authority for anything which is done in\ngood faith or intended to be done in pursuance of this Act, or rules and regulations made thereunder."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Tax exemptions",
      "content": "The income of the Authority, donations and contribution received\nby the Authority for the purpose of this Act shall be exempt from all taxes, duties, charges or imports\nof any nature levied by Federal, provincial, local governments or authorities or any institution."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Act to override other laws",
      "content": "The provisions of this Act shall have effect,\nnotwithstanding anything contained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Power to make rules",
      "content": "The Federal Government may by notification in the official\nGazette, make rules for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Power to make regulations",
      "content": "The Authority shall make regulations for terms and\nconditions of staff and officers."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to the provisions of\nthis Act, the Federal Government may be notification in the official Gazette, make such order, not\ninconsistent with the provisions of this Act, as may appear to it to be necessary or expedient for the\nremoval of such difficulty."
    }
  ],
  "definitions": [
    {
      "term": "Authority",
      "definition": "the National Rahmatul-Lil-Aalameen Wa Khatamun Nabiyyin Authority established under section 3 of the Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Advisory Board",
      "definition": "the advisory board established under section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairperson",
      "definition": "the Chairperson of the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "Director General",
      "definition": "the Director General of the Authority, who shall be the in- charge of general administration of the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "member of the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules or regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "the regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "the rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "staff",
      "definition": "the staff and officers of the Authority. 3 Establishment of the Authority.— (1) there shall be established a National Rahmatul- Lil-Aalameen Wa Khatamun Nabiyyin Authority by the Government, which shall carry out the purposes of this Act. (2) The Prime Minister shall be the Patron-in-Chief of the Authority. (3) The Authority shall comprise a Chairperson and eight (08) other members, to be appointed by the Prime Minister, on such terms and conditions and in the manner as determined by the Patron-in-Chief: Provided that two Muslim Members of the National Assembly shall be nominated by the Speaker as Members of the Authority upon whom sub-section (1) of section 6 shall not apply: Provided further that one Member shall be from amongst each of the Treasury and the Opposition benches.",
      "source_provision": "sec2"
    }
  ]
}
