{
  "id": "pk-national-school-of-public-policy-ordinance-2002",
  "type": "statute",
  "title": "National School of Public Policy Ordinance, 2002",
  "title_en": "National School of Public Policy Ordinance, 2002",
  "short_name": "NSOPP",
  "status": "in_force",
  "issued_date": "2002-10-25",
  "in_force_date": "2002-10-25",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2JvZ5Zi-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National School of Public Policy Ordinance, 2002 (XCIX of 2002) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the School. (1) The Federal Government, shall by notification in",
      "content": "the official Gazette, establish a School to be called the National School of Public Policy whose\nheadquarter shall be at 1[Islamabad].\n(2) The School shall be a body corporate having perpetual succession and a common seal\nwith power to acquire, hold and dispose of property and shall, by the said name, sue and be sued."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Functions of the School. The functions of the School shall be",
      "content": "(a)          to provide for instruction, tuition, 2[higher education,] training, research,\ndemonstration and service in such branches and disciplines of public\nadministration, public policy, law, economics, finance, management sciences\nand any other relevant discipline as the Board may, from time to time,\ndetermine;\n(b)          to introduce, suspend or abolish any of the disciplines or to establish and\nsupport other facilities for education, training and research;\n(c)          to formulate and prescribe courses of study and training;\n(d)          to determine teaching methods and strategies as well as co-curricular activities\nin order to ensure the most effective educational and other related programmes;\n(e)          to design and organize training courses, workshops and such other activities in\nthe relevant fields;\n2\n[(f) to provide for in-service training to the Federal Government’s officials and such\nofficials of the Provincial Governments, Governments of Azad Jammu and\nKashmir and Gilgit-Baltistan nominated by respective Governments and\nselected by the Establishment Division;]\n(g)          to undertake research, consultancy and advisory services;\n(h)          to prescribe criteria and conditions of admission and examination of students;\n(i)          to admit and examine students and to determine and charge fees and other\ncharges;\n(j)          to develop standards, conduct examinations and to award degrees, diplomas,\ncertificates and other academic distinctions to persons who have been admitted\nto and have passed its examinations under prescribed conditions;\n(k)          to serve as a research institute for the Federal Government on matters of public\npolicy and to advise the Federal Government on such policy matters as are\nreferred to it; and\n(l)          to do such other acts and things, as may be considered necessary in order to\nadvance the objects of the School under this Ordinance.\n1\nSubs. by Act No. XIII of 2010, s. 2 (w.e.f. 7-7-2007).\n2\nIns. and subs. by Act No. XXXI of 2017, s. 3 (w.e.f. 06-05-2017)."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Board of Governors. (1) The general direction and administration of the affairs of",
      "content": "the School shall vest in the Board of Governors.\n(2) The Board shall consist of the following members, namely:\n(a)          The President of Pakistan                         Chairman\n(b)          A Federal Minister to be                          Vice-Chairman\nnominated by the 1[Prime\nMinister] of the Islamic\nRepublic of Pakistan.\n(c)          Secretaries Establishment and\nFinance Division.                                 Members\n(d)               two eminent stake-holders in                 Members\npublic policy from private\nsector to be nominated by the\n2\n[Prime Minister].\n(e)               two distinguished academicians               Members\nincluding one woman to be\nnominated by the 2[Prime\nMinister]; and\n3\n[(ea)         One officer of not less than BPS-\n20 nominated by 2[the Chief\nMinister of each Province]]\n(f)               the Rector                                   Member\n(3) The Rector shall be ex-officio Secretary of the Board.\n3\n[(4) A member, other than an ex-officio member, shall hold office for a term of three years\nand shall be eligible for re-appointment for one more term of three years.]\n(5) A member, other than an ex-officio member, may resign from his office by writing under\nhis hand addressed to the President of Pakistan.\n1\nSubs. by Act No. XIII of 2010, s. 3 (w.e.f. 7-7-2007).\n2\nSubs. by Act No. XXXVII of 2025, s.2\n3\nIns. and subs. by Act No. XXXI of 2017, s. 4 (w.e.f. 06-05-2017)."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Removal from office. (1) A member, other than ex",
      "content": "officio member, shall not be\nremoved from office during the term of his office except on grounds of 1[in-efficiency or]\nmisconduct or physical or mental incapacity.\n1\n[(2) If there are grounds to proceed against a member, including the Rector under sub-section\n(1), the Prime Minister shall order an enquiry into the matter as may be prescribed.]\n1\n[(3) If after inquiry into the matter, the Rector or member, as the case may be, is found guilty\nof in-efficiency or misconduct or found to be incapable of performing the duties of his office by reason\nof physical or mental incapacity, the Prime Minister may remove the Rector or the member from\noffice.]"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Powers and functions of the Board. Without prejudice to the generality of the provisions",
      "content": "of sub-section (1) of section 5, the powers and functions of the Board shall be to\n(a)          appoint officers, consultants, staff and employees 1[as may be prescribed];\n(b)          enter into arrangements or agreements with other universities and institutions;\n1\n[(c) declare, with approval of the Federal Government, any training institution,\nadministered and funded by the Federal Government, as a constituent unit of\nthe School;]\n(d)          receive any property, grants, bequests, trusts, gifts, donations, endowments\nand other contributions;\n(e)          invest any funds, grants, bequests, trusts, gifts, donations, endowments and\nother contributions 1[in accordance with the existing law or, as the case may be,\npolicy of the Federal Government]; and\n(f)          do all such acts and things whether incidental to the aforesaid powers or not\nas may be requisite for the furtherance of the objects and functions of the\nSchool."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Business of the Board. (1) The meetings and business of the Board shall be conducted",
      "content": "in such manner and in accordance with such procedure as may be prescribed and until these matters\nare prescribed, as may be determined by the Board.\n(2) No act or proceedings of the Board shall be invalid by reason only of the existence\nof a vacancy in or defect in the constitution of the Board.\n1\nIns. and subs. by Act No. XXXI of 2017, ss. 5-6 (w.e.f. 06-05-2017)."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. The Rector. 1[(1)The Rector shall be appointed by the Prime Minister on",
      "content": "recommendations of the Board from amongst a panel of at least three persons on such terms and\nconditions as may be prescribed.]\n(2) The Rector shall be the chief executive officer of the School and shall\n1\n[(a)     be appointed for one non-extendable term of four years, provided that the\nRector shall cease to hold office on attaining the age of sixty five years or expiry\nof the term, whichever is earlier;]\n(b)          be a whole time officer of the School 1[* * * * * * *]; and\n(c)          perform such functions and exercise such powers as may be prescribed, or\nas may be assigned or delegated to him by the Board."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Committees. The Board may constitute such committees as it may deem necessary",
      "content": "for carrying out the purposes of this Ordinance.\n1\n[11. Appointments. (1) All appointments in the School shall be made on such terms and\nconditions as may be prescribed.\n(2) The directing staff shall be appointed or, as the case may be, posted 2[* * * *] in\nManagement Pay Scales i.e. MP-I, MP-II or MP-III or such other pay scales as may be prescribed\nthrough rules 2[or regulations]:\nProvided that fifty percent of the directing staff shall be appointed from amongst the persons\nfrom private sector or academia:\n2\n[Provided further that no retired civil servant shall be appointed under the first proviso\nunless he fulfills the required criteria.]]\n2\n[Provided also that where a civil servant is appointed or posted as directing staff, his terms\nand conditions of service, including pay fixation, shall be regulated in accordance with the rules and\nregulations applicable to him.]"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. School Fund. (1) 1[Subject to clause (e) of section 7 there] shall be a Fund to be",
      "content": "known as the ‘School Fund’ which shall vest in the Board and to which shall be credited all sums\nreceived by or on behalf of the School.\n(2) The Fund shall be kept in such custody and shall be regulated and utilized in such manner\nas may be prescribed."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Endowment Fund. (1) The 2[Board] shall create an “Endowment Fund” for",
      "content": "the School.\n(2) The Endowment Fund shall be separate from the School Fund and shall be kept in\nsuch custody and utilized and regulated in such manner as may be prescribed."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Budget, audit and accounts. The budget of the School shall be approved and its",
      "content": "accounts shall be maintained and audited in such manner as may be prescribed.\n1\nSubs. and omitted by Act No. XXXI of 2017, ss. 7-9 (w.e.f. 06-05-2017).\n2\nOmitted, ins., subs. and added by Act No. XXXVII of 2025, ss..3-4."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Annual report. (1) The School shall, not later than the 15 th day of February, in each",
      "content": "year, prepare a report regarding its performance during the preceding year ending on the 31stday\nof December and submit the report to the Federal Government.\n(2) The report shall be prepared in such manner, and shall contain such information, as may be\nprescribed 1[through regulations].\n(3) The Federal Government shall cause a copy of the report to be laid before both the Houses\nof Parliament.\n(4) Notwithstanding anything contained in sub-section (1), the School shall also provide to the\nFederal Government any other report, return, statement, estimate, statistics or such other information,\nas may be required by the Government."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Delegation of powers. The Board, subject to such conditions as it may deem fit to",
      "content": "impose, delegate to any officer, committee or authority any of its powers, duties or functions.\n1\n[16A. Power to make rules. The Federal Government may, by notification in the official\nGazette, make rules to carry out purposes of this Ordinance.]"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Power to make regulations. (1) The Board may, by notification in the official",
      "content": "Gazette, make regulations, for carrying out the purposes of this Ordinance.\n(2) In particular and without prejudice to the foregoing provisions such regulations may\nprovide for\n(a)          conduct of meetings and business by the Board;\n(b)          custody, regulation and utilization of the Endowment Fund;\n(c)          preparation of budget, maintenance of accounts and its audit;\n1\n[(ca) conduct of trainings, evaluation criteria and other matters allied to trainings;]\n(d)          matters relating to the annual report; and\n(e)          any other matter which may be prescribed."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Savings. Upon the commencement of this Ordinance, notwithstanding anything",
      "content": "contained in any other law for the time being in force or in any regulation, resolution, agreement,\ncontract or other instrument_\n1\nIns. by Act No. XXXI of 2017, ss. 10-12 (w.e.f. 06-05-2017).\n(a)          the Pakistan Administrative Staff College, Lahore 1[and] National Institute of\nPublic Administration, Lahore, 1[* * * * * * *] hereinafter referred to as “the\nsaid training organizations” shall stand merged in the school;\n1\n[(aa) the Civil Services Academy and its allied units shall not be constituent units\nofthe School;]\n(b)          all funds, assets and properties, rights and interests, and all books of accounts,\nregisters, records and all other documents of whatever nature relating thereto,\nof the said training organizations shall stand transferred to and vest in the\nSchool;\n(c)          all debts and liabilities incurred, all contracts entered into, and all matters and\nthings engaged to be done by, with or for the said training organizations before\nthe establishment of the School, shall be deemed to have been incurred, entered\ninto or engaged to be done by, with or for, the School;\n(d)          all suits, prosecutions and other legal proceedings instituted by or against the\nsaid training organizations shall be deemed to have been instituted by or against\nthe School and may be continued or proceeded with accordingly.\n(e)          every person serving in connection with the affairs of the said training\norganizations including employees serving on deputation to other organization\nbut excluding persons working in the said training organizations on deputation\nfrom other departments, shall stand transferred to the School and become\nemployees of the School on the same terms and conditions of service which\nwere applicable to him immediately before the commencement of this\nOrdinance until his employment in the School is terminated in accordance with\nhis terms and conditions of service or until regulations containing terms and\nconditions of service made by the Board under section 17 come into effect, and\nas from that date he shall be subject to and governed by the said regulations.\n1[19. Removal of difficulties.      For a period of two years from the coming into force of The\nNational School of Public Policy (Amendment) Ordinance, 2016, if any difficulty arises in giving\neffect to any of its provisions, the Federal Government may give such directions, not inconsistent with\nthe provision of this Act, as it may consider necessary for the removal of such difficulty.]\nRGN Date: 09-12-2025\n1\nSubs., omitted and Ins. by Act No. XXXI of 2017, ss. 13-14 (w.e.f. 06-05-2017).\n82513"
    }
  ],
  "definitions": []
}
