{
  "id": "pk-national-security-council-act-2004",
  "type": "statute",
  "title": "National Security Council Act, 2004",
  "title_en": "National Security Council Act, 2004",
  "short_name": "NSCA",
  "status": "in_force",
  "issued_date": "2004-04-19",
  "in_force_date": "2004-04-19",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Fsb5k%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Security Council Act, 2004 (I of 2004) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.― (1) This Act may be called the National",
      "content": "Security Council Act, 2004.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_ In this Act, unless there is anything repugnant in the subject or context,―\n(a)    “Chairman” means the Chairman of the Council;\n(b)    “Council” means the National Security Council established under section 3;\n(c)    “Government” means the Federal Government or a Provincial Government, as\nthe case may be;\n(d)    “President” means the President of the Islamic Republic of, Pakistan; and\n(e)    “Rules” means the rules made under this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of National Security Council. There shall be established a National",
      "content": "Security Council to serve as a forum for consultation on matters of national security including the\nsovereignty, integrity; defence, security of the State and crisis management."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Composition. The President shall be the Chairman of the Council and its other members",
      "content": "shall be the Prime Minister, the Chairman of the Senate, the Speaker of the National Assembly, the\nLeader of the Opposition in the National Assembly, the Chief Ministers of the Provinces, the\nChairman Joint Chiefs of Staff Committee and the Chiefs of Staff of the Pakistan Army, Pakistan\nNavy and Pakistan Air Force."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Functions of the Council.―(1) The Council shall serve as a forum for consultation to the",
      "content": "President and the Government on matters of national security including the sovereignty, integrity,\ndefence, security of the State and crisis management.\n(2) The Council shall formulate and make recommendations to the President and the\nGovernment in accordance with the consultations in terms of subsection (1).\n(3) Any proposal on an issue deemed to be of national importance which requires\nimplementation, shall be referred by the Council to the National Assembly or the Senate for\nappropriate action."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Meetings",
      "content": "_ (1) The meetings of the Council may be convened by the President either in\nhis discretion or on the advice of the Prime Minister.\n(2) A meeting of the Council may be called notwithstanding a vacancy in the office of one or\nmore members of the Council.\n(3) a meeting of the Council, once called, may not be absence of anyone or more of its\nmembers.\n(4) The Council may invite any person to attend any of its meetings, by special invitation."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. National Security Council Secretariat",
      "content": "_(1) There shall be a Secretary of the Council\nwho shall be appointed by the Chairman on such terms and conditions as may be determined by the\nChairman.\n(2) The Secretary shall be the head of the Secretariat and shall have such other powers and\nfunctions as may be conferred on him by the Rules:\nProvided that till such time that the rules are made the Secretary may, with the approval of\nthe Chairman,―\n(a)     exercise such powers and perform such functions as may be necessary for\ncarrying out the purposes of this Act and the functioning of the Council; and\n(b)     appoint officers and staff to be employed in connection with the functions of\nthe Council and determine their terms and conditions of employment."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Power to make rules. The Council may, by notification in the official Gazette, make rules",
      "content": "for carrying out the purposes of this Act:\nProvided that till such time that the rules are made the Council ma with the approval of the\nChairman, follow such procedure as it may fit."
    }
  ],
  "definitions": [
    {
      "term": "Chairman",
      "definition": "the Chairman of the Council;",
      "source_provision": "sec2"
    },
    {
      "term": "Council",
      "definition": "the National Security Council established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government or a Provincial Government, as the case may be;",
      "source_provision": "sec2"
    },
    {
      "term": "President",
      "definition": "the President of the Islamic Republic of, Pakistan; and",
      "source_provision": "sec2"
    },
    {
      "term": "Rules",
      "definition": "the rules made under this Act.",
      "source_provision": "sec2"
    }
  ]
}
