{
  "id": "pk-national-tariff-commission-act-2015",
  "type": "statute",
  "title": "National Tariff Commission Act, 2015",
  "title_en": "National Tariff Commission Act, 2015",
  "short_name": "NTCA",
  "status": "in_force",
  "issued_date": "2015-09-07",
  "in_force_date": "2015-09-07",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2JwZ5s%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Tariff Commission Act, 2015 (XII of 2015) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the National Tariff\nCommission Act, 2015.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(a)         “Commission” means the National Tariff Commission established under\nsection 3;\n(b)         “Interested party” means any party having interest in the product under\ninvestigation including domestic producers, importers, consumers, exporters,\nforeign producers, trade or business associations of the investigated product or\nsuch other persons or group of persons as the Commission may specifically\nthrough notification in official Gazette;\n(c)         “Member” means a member of the National Tariff Commission and included\nthe Chairman;\n(d)         “prescribed” means prescribed by rules made under this Act;\n(e)         “Repealed Act” mean the National Tariff Commission Act, 1990 (VI of 1990);\n(f)         “Trade Remedy Laws” includes the Anti-Dumping Law, the Countervailing\nDuties Law and the Safeguard Measures Law for the time being in force."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Continuation of National Tariff Commission",
      "content": "The National Tariff Commission\nestablished by the Repealed Act shall be deemed to have been established under this Act,\nnotwithstanding the repeal of the “Repealed Act”, the Commission shall be deemed to have been\nvalidly constituted, subject to section 5, under this Act and shall continue to perform its functions\naccordingly."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Constitution of the Commission",
      "content": "(1) The Commission shall comprise 1[upto seven]\nmembers, appointed by the Federal Government in the prescribed manner. The Federal Government\nshall appoint one of the members to be Chairman of the Commission.\n1\nSubs. by Act No. XII of 2026, s. 2.\n(2) The Commission shall be a body corporate having perpetual succession and a common\nseal. It shall have the authority and duty to exercise the functions assigned to it by or pursuant to this\nAct or any other law for the time being in force, shall have the power and authority to acquire, hold\nand dispose of property, both movable and immovable, in its own name, shall have the power and\nauthority to open a personal ledger account in its own name and may sue and be sued in its own\nname.\n(3) The head office of the Commission shall be at Islamabad and the Commission may\nestablish offices at such places as it may deem necessary.\n(4) No act, proceeding or decision of the Commission shall be invalid by reason only of the\nexistence of a vacancy or defect in the Constitution of the Commission."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Qualification and eligibility of members",
      "content": "(1) All members of the Commission shall be\ncitizens of Pakistan and shall be employed with the Commission on a full-time basis.\n1\n[(2) A member of the Commission shall have at least—\n(a)           A masters or professional degree or qualification from an accredited university\nor institute in the field of law, business, economics, accountancy, tariffs and\ntrade, commerce and trade or a trade related subject and having knowledge of\ntrade remedy laws shall be an advantage; and\n(b)           Fifteen years of professional work experience in the field of law, business,\neconomics, accountancy, harmonized tariffs, commerce and trade, tariffs and\ntrade or other trade related technical field and direct work experience in trade\nremedy laws shall be an advantage.]\n(3) The Federal Government shall select upto two members from the Commission's\nexperienced technical officers provided that they meet the eligibility and qualification requirements\nspecified in sub-sections (1) and (2)."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Disqualification",
      "content": "(1) No person shall be appointed or continue as member or an\nemployee of the Commission if such person;\n(a)         has been convicted of an offence involving moral turpitude;\n(b)         has been or is adjudged insolvent;\n(c)         is incapable of discharging his duties by reasons of physical, physiological or,\nmental unfitness and has been so declared by a duly constituted Medical\nBoard appointed by the Federal Government;\n(d)         fails to disclose any conflict of interest at or within the time provided for such\ndisclosure by or under this Act or contravenes any of the provisions of this\nAct pertaining to unauthorized disclosure of information."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Term of office",
      "content": "(1) The Chairman and members of the Commission shall hold office for\na term of five years. That term shall be extendable by one year unless the Federal Government\ndirects otherwise.\n1\nSubs. by Act No. XII of 2026, s. 3.\n1\n[(2) If the position of the Chairman becomes vacant, the Federal Government shall notify a\nmember as Chairman.]"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Function of the Commission",
      "content": "(1) The functions of the Commission shall be to advise\nthe Federal Government on,—\n(a)         tariff and other trade measures to,—\n(i)    provide assistance to the domestic industry; and\n(ii)   improve the competitiveness of the domestic industry;\n(b)         trade remedy actions being faced by domestic producers and exporters;\n(c)         rationalization of tariff and proposals for tariff reform;\n(d)         removal of tariff anomalies; and\n(e)         any other matter relating to tariff or trade measures that the Federal\nGovernment may refer to the Commission.\n(2) In addition to the functions specified in subsection (1), the Commission shall also perform\nsuch functions with respect to international trade and other matters that may be assigned to it by the\ntrade remedy laws or any other law for the time being in force.\n(3) Where the Federal Government has adopted the recommendations of the Commission in\nwhole or part, the Commission shall periodically review the effect of such recommendations and in\nconsequence of the review may give further recommendations to the Federal Government.\n(4) The Commission shall advise, where possible, the domestic exporters and producers\nfacing trade remedy investigations abroad.\n(5) The Commission shall assist the Federal Government at the World Trade Organization\ndispute settlement body in respect of matters pertaining to the Trade Remedy Laws, WTO Covered\nAgreements and disputes under other trade agreements. The Federal Government may hire the\nservices of a qualified and experienced international trade lawyer or international trade consultant for\nthis purpose on a case-to-case basis.\n(6) The Commission may undertake research to facilitate effective implementation of Trade\nRemedy Laws and tariff rationalisation, in a manner to be prescribed."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Power of Commission to make inquiries on application",
      "content": "(1) In addition to the matters\nfalling within the scope of the Trade Remedy Laws or any other law, the Commission may initiate\ninquiries or investigations under this Act on,—\n(a)         an application that has been submitted by or on behalf of the domestic industry\nin the prescribed form and accompanied by the prescribed fee;\n1\nSubs. by Act No. XII of 2026, s. 4.\n(b)     a reference received by it from the Federal Government; or\n(c)     on its own motion."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Power of Commission to access information",
      "content": "(1)The Commission shall have the\npowers to solicit, gather, obtain, and verify any relevant information for the purposes of its functions\nfrom any Ministry, Division, Federal or Provincial Department, private or public entity or agency.\n(2) Notwithstanding anything contained in this Act or in any other law for the time being in\nforce, any business confidential information received or obtained, directly or indirectly, by the\nCommission pursuant to or in connection with an investigation, inquiry or study shall not be subject\nto disclosure by the Commission to any Ministry, Division, department, agency or instrumentality of\nthe Federal Government or a Provincial Government without the prior permission of the party\nsubmitting such business confidential information.\n(3) The Commission shall take all acts and measures necessary to provide transparent and\nprompt access to information to all parties, in a prescribed manner."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Power of Commission as civil court",
      "content": "The Commission shall have all the powers of a\ncivil court while trying a suit under the Code of Civil Procedure, 1908 (V of 1908), in respect of the\nfollowing matters, namely:—\n(i)     summoning and enforcing the attendance of any person and examining him on\noath; and\n(ii)    requiring the supply of any information and production of any document\nwhich may be useful for the conduct of its inquiry."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power of Commission to make recommendations",
      "content": "(1) While examining a proposal\nfor tariff rationalisation or assistance to the domestic industry or trade measure and making\nrecommendations to the Federal Government, the Commission shall satisfy itself on the points\nthat.—\n(i)     the quality of the product to which such protection or assistance it to be given\nis good and conforms to the standards laid down by the Pakistan Standards\nand Quality Control Authority or, where such standard has not been\nprescribed, it conforms to internationally accepted standards;\n(ii)    the additional cost to the consumer may not be excessive; and\n(iii)   the industry is not likely to need the protection or assistance after a reasonable\nperiod of time.\n(2) Where it has decided to undertake any inquiry or investigation, the Commission shall take\nsuch measures as it deems necessary to ensure that all units engaged in economic activities similar to\nthose being carried on by any industrial undertaking or trading business which has made an\napplication or in respect of which an inquiry or investigation has been undertaken by the\nCommission are informed that such inquiry or investigation has been undertaken."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Timelines for submission of recommendations by Commission",
      "content": "(1) The Commission\nshall complete inquires and investigations under this Act and submit a report to the Federal\nGovernment within a period not exceeding one hundred and twenty days.\n(2) The enquiries and investigations undertaken by the Commission under this Act shall be\ncompleted within the periods as specified in the schedule.\n(3) The Federal Government shall, take a decision on the recommendations of the\nCommission within fifteen days of the issuance of the same."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Delegation of powers of the Commission",
      "content": "(1)The Commission, may delegate any of\nits functions or powers to one or more of its members or one or more of the officers, employees,\nconsultants or agents of the Commission:\nProvided that the Commission may not delegate its power or authority to initiate an\ninvestigation, to make preliminary or final determination, including review, refund and termination\nof investigations in cases governed by Trade remedy Laws or any other law that requires the\nCommission to make such determination:\nProvided further that a delegation under this sub-section may be revoked or modified by the\nCommission at any time and shall otherwise not prevent the Commission from concurrently\nperforming or exercising any function or power so delegated:\nProvided also that the person to whom powers or functions are delegated pursuant to this\nsub-section shall not further delegate such powers or functions.\n(2) The Commission may, by and through, one or more of its members, officers, employees\nor agents, who have been duly designated by the Commission for such purpose, carry out any\ninquiry, investigation or function necessary or appropriate for the proper exercise of the\nCommission’s duties, powers and authority, whether provided under this Act or any other law in any\npart of Pakistan or in any foreign country."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Meeting procedure and quorum",
      "content": "(1) Decisions and determinations of the Commission\nshall be taken by majority vote.\n(2) At least two members, one of whom shall be Chairman, shall constitute a quorum,\nprovided that in case of quorum of two Members, the decision shall be taken by consensus."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Administration and Secretariat of the Commission",
      "content": "(1) The Commission shall have\na Secretariat which shall be headed by a Secretary to the Commission. The Secretary shall be\nappointed by the Commission as prescribed.\n(2) The Secretary to the Commission shall perform functions and duties, including the\nfollowing, namely:—\n(a)    to keep in custody the records and seal of the Commission;\n(b)    to authorize payment of monthly salaries and allowances to the employees of\nthe Commission;\n(c)    to propose budget estimates and revised budget estimates and place the same\nbefore the Commission;\n(d)    to receive applications for investigations on behalf of the Commission; and\n(e)    to perform any other duties that may be assigned to him by the Commission."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Employees of the Commission",
      "content": "(1) The Commission may do all such acts and take all\nsuch steps as are necessary for the performance of the functions of the Commission, including the\nappointment of such officers etc. as it considers necessary for the efficient performance of its\nfunctions, on such terms and conditions as may be prescribed.\n(2) Subject to sub-section (3), the Commission may employ, on market-scale salary,\nconsultants, agents and technical, professional and other advisers including lawyers, economists,\naccountants, bankers, actuaries and other professionals to do any act necessary or appropriate to the\nexercise of the Commission's powers or the performance of its functions as specified in section 8.\n(3) The employees of the Commission and other persons authorized to perform any function\nunder this Act shall be deemed to be a public servant within the meaning of section 21 of the\nPakistan Penal Code, 1860 (XLV of 1860)."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Terms and Conditions of services of the Commission and its Employees",
      "content": "(1) “The\nbenefits of the Commission and of an employee appointed on full-time basis in the Commission\nshall be as prescribed.”\n(2) From the date of appointment, the pension, gratuity, GP fund and other retirement\nbenefits of an employee appointed on full time basis in the Commission shall be the same as Federal\nGovernment employees of the equivalent status, grade and scale.\n(3) Employees appointed on full-time basis shall be provided time-scale promotions. For this\npurpose, the Commission shall make necessary regulations with approval of the Federal\nGovernment.\n(4) All other matters relating to rules, orders, terms and conditions of services of the\nemployees of the Commission shall be dealt with in accordance with the National Tariff Commission\nEmployees' (Service) Rules 1995, as revised from time to time."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Fund of the Commission",
      "content": "The Fund of the Commission shall consist of,—\n(a)    grants from the Federal Government;\n(b)    fee collected by the Commission;\n(c)    aid from international agencies; and\n(d)    such sums as the Federal Government may allocate to the Commission."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Budget, audit and accounts",
      "content": "(1) The Commission shall cause proper accounts to be\nkept as prescribed by the Controller General of Accounts. As soon as practicable, after the end of the\nfinancial year, the Commission shall prepare a statement of accounts of the Commission for that\nyear. This shall include a balance sheet and an account of income and expenditure.\n(1) Within sixty days after the end of each financial year, the annual financial statements\nshall be audited by the Auditor General of Pakistan.\n(2) The auditors shall make a report to the Commission upon the balance sheet and accounts.\nThey shall state whether the balance sheet is a full and fair balance sheet containing all necessary\nparticulars and properly drawn up so as to exhibit a true and correct view of affairs of the\nCommission. In case the Auditors have called for any explanation or information from the\nCommission, it shall be stated by the Auditors as to whether such explanation or information was\nprovided to the auditors to their satisfaction or not."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Representation before the Commission",
      "content": "Any person duly authorized by a party is\nentitled to appear, plead and act on behalf of such party before the Commission."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Penalty for false statement or failure to disclose correct information",
      "content": "(1)Any person\nwho knowingly or willfully furnishes any information or document or book of accounts which he is\nbound to produce under this Act or any Trade Remedy Laws and he has reason to believe to be false\nor incorrect shall be liable to imprisonment for a term which may extend to three years, or a fine not\nexceeding five million rupees, or both.\n(2) Notwithstanding anything contained in the Code of Criminal Procedure, 1898 (V of\n1898), no court other than a court of sessions shall have jurisdiction to try a person charged with an\noffence under subsection(1)."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Duty of members, officers, etc., to maintain secrecy",
      "content": "(1) Except in the performance\nof his duties under this Act or any other Trade Remedy Law, every member, officer, consultant and\nadviser of the Commission shall preserve and aid in preserving secrecy with regard to all matters\nrelating to the financial or other affairs of any undertaking or person that may come to his\nknowledge in the performance of his duties.\n(2) Every such member, officer, consultant or adviser who communicates any such matter,\nexcept when required by law to do so or in the discharge of his duty as such, shall be punishable\nwith imprisonment of either description for a term which may extend to three months, or with fine\nnot exceeding five million rupees, or both.\n(3) Any information referred to in subsection (1), if prejudicial to the National Security or\nDefence, shall be disclosed to the Agency seeking such information, with the approval of the\nCommission."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Disclosure of interest",
      "content": "(1) The following shall apply to all employees serving in any\ncapacity whatsoever in the Commission.\n(2) A person shall be deemed to have an interest in a matter if he has any interest, pecuniary\nor otherwise, in such matter which could reasonably be regarded as giving rise to a conflict between\nhis duty to honestly perform his functions, so that his ability to consider and decide any question\nimpartially or to give any advice without bias, may reasonably be regarded as impaired.\n(3) A person having any interest in any matter to be discussed or decided by the Commission,\nshall prior to discharge of any function or business of the Commission, disclose in writing to the\nSecretary to the Commission, the fact of his interest and the nature thereof.\n(4) Every person shall give written notice to the Secretary to the Commission of all direct or\nindirect pecuniary or other material or personal interests that he has or acquires in a body corporate\ninvolved in a matter at the Commission.\n(5) A disclosure of interest under sub-section (2) shall be made a part of the record of the\nCommission in that particular matter.\n(6) Where there is such disclosure of interest,—\n(a)    such person shall not, save as provided in sub-sections (7) and (8) take part\nnor be present in any investigation, research, deliberation or decision of the\nCommission as the case may be; and\n(b)    such person shall be disregarded for the purpose of constitution of a quorum or\nperformance of a task, as the case may be.\n(7) Any person who fails to disclose his interest as required by this section shall, on proof of\nsuch act, be liable to removal from the Commission.\n(8) It shall be a valid defense for a person charged with the allegation of failure to disclose\nsuch interest under sub-section (7), if such person proves that he was not aware of the facts\nconstituting such allegation and that he exercised due care and diligence in discovering the facts\nwhich he ought reasonably to have known in the circumstances."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Removal",
      "content": "Appointment of any member or employee of the Commission may, at any\ntime, be revoked by order of the Federal Government if it is found that such person stands\ndisqualified on the grounds and in the manner as prescribed."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Powers to make rules",
      "content": "(1)The Commission may, with the prior approval of the Federal\nGovernment, and by notification in the official Gazette, make rules for carrying out the purposes of\nthis Act.\n(2) The Commission shall make regulations for terms and conditions of employment for its\nemployees."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Indemnity",
      "content": "No suit, prosecution or other legal proceeding shall lie against any member\nor any officer or employee of the Commission or any other person in respect of anything which is in\ngood faith done or intended to be done in pursuance of this Act, Any Trade Remedy Laws, any rules\nor orders made thereunder or in respect of the publication by or under the authority of the\nCommission of any report, paper or proceedings."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Repeal",
      "content": "The National Tariff Commission Act, 1990 (VI of 1990) is hereby repealed."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Savings",
      "content": "(1) Notwithstanding the repeal under section 28, nothing in this Act shall\naffect or be deemed to affect anything done, action taken, investigation or proceedings commenced,\norder, rule, regulation, appointment, document, or agreement made, fee directed, resolution passed,\ndirection given, proceedings taken, or instrument executed or issued under or pursuant to the\nRepealed Act and any such thing, action, investigation, proceedings, order, rule, regulation,\nappointment, document, agreement, fee, resolution, direction, proceedings or instrument shall, if in\nforce on the commencement date and not inconsistent with any of the provisions of this Act,\ncontinue in force and have effect as if it had been respectively done, taken, commenced, made,\ndirected, passed, given, executed or issued under this Act.\n(2) Notwithstanding anything contained in any other law, judgment or decision of the Courts,\nall acts, procedures and decisions of the Commission made from September 2013 shall till date be\ndeemed to have been validly made by the Commission."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Act to override other laws",
      "content": "The provisions of this Act shall have effect\nnotwithstanding anything inconsistent therewith contained in any other law for the time being in\nforce.\n[See section 13(2)]\nnamely:—\n(i)     an enquiry or investigation for tariff and non-tariff protection or assistance to\ndomestic industry shall, except in special circumstances, be completed within\na period not exceeding sixty days, and in no case more than one hundred and\ntwenty days after initiation;\n(ii)    an enquiry or investigation for increase or decrease in tariff on the application\nof trading business or importers shall, except in special circumstances, be\ncompleted within a period not exceeding sixty days, and in no case more than\none hundred and twenty days after initiation;\n(iii)   an enquiry or investigation for removal of tariff anomaly shall, except in\nspecial circumstances, be completed within a period no exceeding thirty days,\nand in no case more than one hundred twenty days after initiation;\n(iv)    Any other matter relating to tariffs or tariff policies shall be completed\nexpeditiously but in any event no later than one hundred and twenty days; and\n(v)     an enquiry or investigation initiated on the request of the Federal Government\nor on its own motion depending on the nature thereof shall be completed\nwithin the time periods given in clauses (i), (ii), (iii) and (iv) above:\nProvided that the Federal Government may, in situations constituting an urgency direct the\nCommission to expedite the enquiry or investigation to the extent possible as may be required to\nprotect or assist the domestic industry.\n______________\nRGN Dated: 30-01-2026"
    }
  ],
  "definitions": [
    {
      "term": "Commission",
      "definition": "the National Tariff Commission established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Interested party",
      "definition": "any party having interest in the product under investigation including domestic producers, importers, consumers, exporters, foreign producers, trade or business associations of the investigated product or such other persons or group of persons as the Commission may specifically through notification in official Gazette;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "a member of the National Tariff Commission and included the Chairman;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Trade Remedy Laws",
      "definition": "the Anti-Dumping Law, the Countervailing Duties Law and the Safeguard Measures Law for the time being in force.",
      "source_provision": "sec2"
    }
  ]
}
