{
  "id": "pk-national-university-of-medical-sciences-act-2015",
  "type": "statute",
  "title": "National University of Medical Sciences Act, 2015",
  "title_en": "National University of Medical Sciences Act, 2015",
  "short_name": "NUOMS",
  "status": "in_force",
  "issued_date": "2015-10-28",
  "in_force_date": "2015-10-28",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2JwZ5g%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National University of Medical Sciences Act, 2015 (XVII of 2015) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Act may be called the National University of\nMedical Sciences Act, 2015.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act unless there is anything repugnant in the subject or context,—\n(i)     “Academic Council- means the Academic Council of the University;\n(ii)    “Affiliated College” includes any college, institute, institution, centre or\nhospital affiliated to the University but not maintained or administered\nby it;\n(iii)   “Authority” means any of the Authorities of the University specified or\nset up in terms of section 16;\n(iv)     “Board of Governors” means the Board of Governors of the University;\n(v)     “Campus” means any infrastructure of the university within country or\nabroad;\n(vi)    “Chancellor” means the Chancellor of the University;\n(vii)    “College” means a college constituted or affiliated with the University;\n(viii) “Commission” means the Higher Education Commission set up by the\nHigher Education Commission Act, 2002 (L1II of 2002);\n(ix)    “Constituent College” means an educational college or institute in the\nhealth studies, by whatever name described, maintained and\nadministered by the Armed Forces University including Army Medical\nCollege, Rawalpindi; Armed Forces Postgraduate Medical Institute,\nRawalpindi and such other college or institute or institution designated\nas such by the Board of Governors;\n(x)     “Controller of Examinations” means the chief coordinator of lp\nexaminations of the University;\n(xi)     “Commandant” means administrative head of an institute or hospital;\n(xii)    “Dean” means head of a faculty or academic head of institute under the\nUniversity or the head of an academic body granted the status of a\nFaculty by this Act or by the Statutes or Regulations;\n(xiii) “Department” means a teaching department maintained and\nadministered, or recognized by the University in the manner prescribed;\n(xiv)    “Director” means the head of a department or section established by the\nUniversity established by Statutes or Regulations in terms of the powers\ndelegated by this Act including but not limited to: Director\nAdministration; Director Finance; Director Legal; Director Research\nand Development; Director Academic Coordination; Director\nInternational Affairs; Director Quality Assurance; Director Human\nResource or Director Planning and this post may be upgraded to Director\nGeneral on need basis;\n(xv)     “Director General” means the head of the directorate of Armed Forces\nof Pakistan wherever such post exists or head of an institute or\ndepartment under University with duties as may be prescribed;\n(xvi)     “Faculty” means an administrative and academic unit of the University\nconsisting of one or more departments as may be prescribed;\n(xvii)   “Government” means the Federal Government;\n(xviii) “Institute” means an institute constituted or affiliated with University;\n(xix)    “prescribed” means prescribed by Statutes, Regulations or Rules and\nmade under the Act;\n(xx)     “Principal” means the head of a College or Institute;\n(xxi)    “Pro-Vice Chancellor” means Pro-Vice Chancellor of the University;\n(xxii) “Registrar” means the Registrar of the University;\n(xxiii) “Regulation” means regulations made under this Act;\n(xxiv) “Representation Committees” means the Representation Committees\nconstituted under section 23;\n(xxv) “Search Committee” means the Search Committee set up by the Board\nof Governors under sub-section (2) of section 11;\n(xxvi) “Statutes”, “Regulations” and “Rules” mean respectively the Statutes, the\nRegulations and the Rules made under this Act and for the time being in\nforce;\n(xxvii) “Syndicate” means the Syndicate of the University;\n(xxviii)”Teachers” include Professors, Associate Professors, Assistant\nProfessors, registrars, and Lecturers, Demonstrators engaged\nwhole-time by the University or by a constituent or affiliated college and\nsuch other persons as may be declared to be teachers by Regulations;\n(xxix) “Teaching Hospitals or Institutes” or “University Hospitals or\nInstitutes” means any hospital or institute by whatever name described,\ndesignated by the University for teaching, training and research\npurposes presently including but not limited to Armed Forces Institute\nof Cardiology, Rawalpindi; Armed Forces Institute of Pathology,\nRawalpindi; Armed Forces Institute of Transfusion, Rawalpindi; Armed\nForces Institute of Urology, Rawalpindi; Armed Forces Institute of\nRehabilitation Medicine, Rawalpindi; Armed Forces Bone Marrow\nTransplantation Centre, Rawalpindi; Armed Forces Institute of Urology,\nRawalpindi; Armed Forces Institute of Mental Health, Rawalpindi;\nArmed Forces Institute of Ophthalmology, Rawalpindi; Armed Forces\nInstitute of Radiological Imaging, Rawalpindi; Armed Forces Institute\nof Nutrition, Lahore; Army Medical Corps School and Centre\nAbbottabad; Combined Military Hospital, Rawalpindi; Military\nHospital, Rawalpindi; Combined Military Hospital Lahore; Combined\nMilitary Hospital Peshawar; Combined Military Hospital Kharian;\nCombined Military Hospital Multan; Combined Military Hospital\nMalir; Combined Military Hospital Quetta; Combined Military Hospital\nSialkot; Combined Military Hospital Okara; Combined Military\nHospital Jhelum; Combined Military Hospital Gujranwala; Combined\nMilitary Hospital Mangla; Combined Military Hospital Sargodha;\nCombined Military Hospital Abbottabad; Combined Military Hospital\nMurree; Combined Military Hospital Chunian; Combined Military\nHospital Zhob; Combined Military Hospital Khuzdar; Combined\nMilitary Hospital Loralai; Combined Military Hospital Sibbi; Combined\nMilitary Hospital Dera Ismail Khan; Combined Military Hospital\nMardan; Combined Military Hospital Bahawapur; Combined Military\nHospital Bahalwalnagar; Combined Military Hospital Skardu;\nCombined Military Hospital Gilgit; Combined Military Hospital\nNowshera; Combined Military Hospital Kohat; Combined Military\nHospital Attock; Combined Military Hospital Hyderabad; Combined\nMilitary Hospital Pano Aqil; Combined Military Hospital Bannu;\nCombined Military Hospital Risalpur; Combined Military Hospital\nLandikotal; Combined Military Hospital Rahim Yar Khan; Combined\nMilitary Hospital Mailsi; Combined Military Hospital Chhor; Combined\nMilitary Hospital Dera Nawab Shah; Combined Military Hospital\nBadin; Combined Military Hospital Cherat; Combined Military Hospital\nThal; Combined Military Hospital Tarbela; Combined Military Hospital\nMuzaffarabad; Combined Military Hospital Rawlakot; Combined\nMilitary Hospital Chunian; Army Cardiac Centre Lahore; Hand &\nUpper Limb Surgery Lahore; Heavy Industry Taxil la Hospital; Pakistan\nNaval Hospital; Hafeez, Islamabad; Pakistan Air Force Hospital,\nIslamabad. Shall include any other hospital or institute or institution\ndesignated as such by the Board of Governors. These hospitals or\ninstitutes shall act as University's hubs for academic and research\npurposes and resource centres for continuing professional development\nopportunities;\n(xxx) “University” means the National University of Medical Sciences\nestablished under this Act; and\n(xxxi) “Vice-Chancellor” means the Vice-Chancellor of the University\nappointed under section 10."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment and incorporation of the University",
      "content": "(1) There shall be established a\nUniversity to be called the National University of Medical Sciences consisting of—\n(a)     the Chancellor, the Pro-Chancellor, the Board of Governors, the\nVice-Chancellor, the Pro- Vice Chancellor, the Committee, the Syndicate, the\nAcademic Council, the Principals, the Deans, the Commandants and the\nDirector Generals;\n(b)     the officers and members of such other councils, committees and advisory\nbodies as the Board of Governors may establish or authorize from time to time;\n(c)     the members of the faculties and students of the colleges, institutes, institutions,\ncenters, hospitals; and\n(d)     such other officers and members of the staff as the Board of Governors may\nfrom time to time, specify.\n(2) The University shall be a body corporate by the name of the National University of Medical\nSciences, having perpetual succession and common seal, with power, among others, to acquire, hold\nand dispose of any property and shall by the said name sue and be sued.\n(3) The University shall be competent to acquire and hold property, both movable and\nimmovable, and to lease, sell or otherwise transfer any movable and immovable property which may\nhave become vested in or been acquired by it.\n(4) The principal seat of the University shall be at Islamabad, and it may set up any number of\nCampuses, Colleges, Institutes, Institutions, Centers, Hospitals, etc., at such places in Pakistan as the\nBoard of Governors may determine.\n(5) The University shall have academic, financial and administrative autonomy, including the\npower to employ officers, teachers and other employees on such terms as may be prescribed, subject\nto this Act."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Purposes, powers and functions of the University",
      "content": "(1) The purposes of the University\nshall be the promotion and dissemination of knowledge and technology and to provide for instruction,\ntraining, research, demonstration and service in the health sciences and such related branches of\nlearning as the Board of Governors may deem fit.\n(2) The University shall be a fully autonomous body with autonomy to govern its academic\nand administrative functions in order to achieve its objectives and to,---\n(i)      determine courses of study in various fields of medical sciences and such\nother branches of learning as it may determine;\n(ii)     select and examine students;\n(iii)    award degrees, diplomas, certificates and other academic distinctions;\n(iv)     pursue and coordinate research;\n(v)      affiliate itself or associate with other institutions and establish faculties\nin Pakistan or abroad for better discharge of its function and\nresponsibilities;\n(vi)     grant affiliation to educational institutes or colleges;\n(vii)    establish campuses abroad independently or in collaboration with that\ncountry;\n(viii) decide teaching methods and strategies in order to ensure the most\neffective educational and research programs;\n(ix)     use the financial and other resources allocated to it for the execution of\nits functions;\n(x)      confer in the manner prescribed honorary degrees or other distinctions\non persons approved by the Board of Governors for the purpose;\n(xi)     provide for such instructions for persons not being students of the\nUniversity as it may determine, and to grant certificates and diplomas to\nsuch persons;\n(xii)     confer degrees on persons who have carried on independent research\nunder prescribed conditions;\n(xiii)    accept the examinations passed and the periods of study spent by\nstudents of the University at other universities and places of learning as\nequivalent to such examinations and periods of study in the University\nas it may determine, and to withdraw such acceptance;\n(xiv)     institute  Professorship,   Associate    Professorship,    Assistant\nProfessorships, Research Associateships and other posts, and to make\nappointment thereto;\n(xv)     create posts for teaching, research, extensions, administration and other\nrelated purposes and to appoint persons thereto;\n(xvi)   institute and award fellowships, scholarships, exhibitions, bursaries,\nmedals and prizes under prescribed conditions;\n(xvii) provide and support the academic development of the faculty of the\nUniversity;\n(xviii) establish colleges, institutes, institutions, centres, hospitals, faculties,\nlibraries, laboratories, workshops, museums and other centres of\nlearning for the development of teaching and research and to make such\narrangements for their maintenance, management and administration as\nit may determine;\n(xix)   make provisions for research and advisory services and with these\nobjects to enter into arrangements with other institutions or with public\nbodies within Pakistan and abroad under prescribed conditions;\n(xx)    enter into, carry out, vary or cancel contracts;\n(xxi)    receive and manage property transferred and grants, bequests, trusts,\ngifts, donations, endowments and other contributions made to the\nUniversity and to invest any funds, representing such property, grants,\nbequests, trusts, gifts, donations, endowments or contributions and to\nconvert one kind of property into other, in such manner as it may deem\nfit;\n(xxii) provide support for the printing and publication of research and other\nwork;\n(xxiii) authorize and agree when required by the colleges to the mobility of\nqualified staff among universities, research organizations and the\nGovernment or corporate bodies, provided that the rights and privileges\nof the staff under this arrangement shall be protected;\n(xxiv) institute programmes for the exchange of students and teachers between\nthe University and other universities, educational institutions and\nresearch organizations, inside as well as outside Pakistan;\n(xxv) provide career counselling and job search services to students and\nalumni;\n(xxvi) maintain linkages with alumni;\n(xxvii) develop and implement fund raising plans;\n(xxviii) offer online and virtual courses, and telemedicine services;\n(xxix) veterinary courses as may be prescribed;\n(xxx) use the financial and other resources allocated to it for the execution of\nits functions; and\n(xxxi) do all such other acts and things, whether incidental to the powers\naforesaid or not, as may be requisite in order to further its objects as a\nplace of education, learning and research.\n(3) The principal teaching facilities of the University shall consist of the constituent and\naffiliated institutes, colleges and hospitals and such other institutes, colleges and hospitals as may be\ndetermined by the Board of Governors from time to time.\n(4) The University may enter into agreements, contracts and arrangements with governments,\nnational or international organizations, institutions, hospitals, bodies and individuals for the purpose\nof carrying out its functions and activities.\n(5) The University may do all such other acts and things as may be requisite in order to further\nthe objects of the University.\n(6) The University may, with the approval of the Board of Governors, provide facilities to the\nrepresentatives of the Commission and the Pakistan Medical and Dental Council or such similar\nrelevant organizations for visitation to enable them to verify that appropriate academic standards are\nbeing maintained by the University."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. University to be open to all classes, creeds, etc",
      "content": "(1) The University shall be open to all\npersons of either gender of whatever religion, race, class, creed colour or domicile who qualify for\nadmission to the courses of study offered by the University based on the criteria and policy determined\nby the Board of Governors, and no such person shall be denied the privileges of the University on the\nground only of gender, religion, race, class, creed, colour or domicile.\n(2) The University shall institute financial aid programmes for students in need, to the extent\nconsidered feasible by the Board of Governors given the resources available, so as to enable admission\nand access to the University and the various opportunities provided by it to be based on merit rather\nthan ability to pay."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Officers of the University",
      "content": "The following shall be the principal officers of the University,\nnamely:—\n(a)     the Chancellor;\n(b)     the Pro-Chancellor\n(c)     the Vice­Chancellor;\n(d)     the Pro­Vice­Chancellor;\n(e)     the Principles or Commandants of Constituent Colleges;\n(f)     the Deans;\n(g)     Chairperson of the teaching departments;\n(h)     the Registrar;\n(i)     the Controller of Examination; and\n(j)     such persons as may be prescribed to be an officer by the Board of Governors."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. The Chancellor",
      "content": "(1) The President of Pakistan shall be the ex officio Chancellor of the\nUniversity.\n(2) The Chancellor shall preside the convocations of the University.\n(3) Every proposal to confer an honorary degree shall be subject to confirmation by the\nChancellor.\n(4) If the Chancellor is satisfied, that the proceedings or orders of any authority are not in\naccordance with the provisions of this Act, the statutes, regulations or the rules, he may, after calling\nupon such authority to show cause in writing, annul such proceedings or orders."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. ProChancellor",
      "content": "(1) The Chief of the Army Staff shall be the ex officio Pro-Chancellor\nof the University.\n(2) The Pro-Chancellor shall attend the meetings at which business of the University is\ntransacted.\n(3) The members of the Board of Governors as well as the Vice-Chancellor shall be appointed\nby the Pro-Chancellor from amongst the persons recommended by the Representation Committee set\nup for this purpose or the Search Committee established in accordance with the Act and the Statutes,\nas the case may be, alongwith those elected.\n(4) If the Pro-Chancellor is satisfied that serious irregularity or mis-management with respect\nto the affairs of the University has occurred, he may,—\n(a)      as regards proceedings of the Board of Governors, direct that specified\nproceedings be reconsidered and appropriate action taken within one month of\nthe direction having been issued:\nProvided that if the Pro-Chancellor is satisfied that either no reconsideration has\nbeen carried out or that the reconsideration has failed to address the concern\nexpressed he may, after calling upon the Board of Governors to show cause in\nwriting, appoint a five member Review Panel to examine and report to the\nPro-Chancellor on the functioning of the Board of Governors. The report of the\nReview Panel shall be submitted within such time as the Pro-Chancellor may\nprescribe. The Review Panel shall be drawn from persons of eminence in\nacademics and in the fields of law, accountancy and administration; and\n(b)     as regards proceedings of any Authority or with respect to matters within the\ncompetence of any Authority other than the Board of Governors, direct the\nBoard of Governors to exercise powers under section 17."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Removal from the Board of Governors",
      "content": "(1) The Pro-Chancellor may, upon the\nrecommendation of the Review Panel, remove any person from the membership of the Board of\nGovernors on the ground that such person has,—\n(a)    become of unsound mind;\n(b)     become incapacitated to function as member of the Board of Governors;\n(c)    been convicted by a court of law for an offence involving moral turpitude;\n(d)    absented himself from two consecutive meetings without just cause; or\n(e)    been guilty of misconduct, including use of position for personal advantage of\nany kind, or gross inefficiency in the performance of functions.\n(2) The Pro-Chancellor shall remove any person from the membership of the Board of\nGovernors on a resolution calling for the removal of such person supported by at least three-fourths of\nthe membership of the Board of Governors:\nProvided that before passing such resolution the Board of Governors shall provide the member\nconcerned a fair hearing:\nProvided further that the provisions of this section shall not be applicable to the\nVice-Chancellor in his capacity as a member of the Board of Governors."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. The Vice",
      "content": "Chancellor.—(1) The Vice-Chancellor shall be a notable academician with\nfinest credentials and qualifications in medical sciences preferably PhD or FCPS or equivalent from\nwithin the country or abroad or higher education in clinical and management sciences and shall be\nappointed on such terms and conditions as may be determined by the Board of Governors.\n(2) The Vice-Chancellor shall be the Chief Executive Officer of the University responsible for\noverall administrative and academic functions of the University and for ensuring that the provisions of\nthe Act, Statutes, Regulations and Rules are faithfully observed in order to promote the general\nefficiency and good order of the University. The Vice-Chancellor shall have all powers prescribed for\nthis purpose, including administrative control over the officers, teachers and other employees of the\nUniversity.\n(3) The Vice-Chancellor shall be responsible for implementation of the decisions and policies\nof the Board of Governors and shall have the following powers, namely:—\n(a)    oversee, monitor and supervise all academic activities including examinations\nand applied research to ensure that proper academic standards are maintained;\n(b)     exercise administrative control over the academic and administrative staff\nemployed by the University including their recruitment;\n(c)    submit the plans of work and budget estimates of the University for approval of\nthe Board of Governors;\n(d)    sanction by re-appropriation an amount not exceeding an amount prescribed by\nthe Board of Governors for an unforeseen item not provided for in the budget\nand report it to the Board of Governors at the next meeting;\n(e)    direct the activities connected with execution of programmes for instruction,\ntraining, research, demonstration and service, and authorize expenditure\nprovided for in the budget as approved by the Board of Governors;\n(f)    make appointments of teachers, officers, doctors and members of the staff of\nthe University and other persons on regular basis in accordance with the policies\nand procedures approved by the Board of Governors so as to ensure the highest\nintellectual and moral qualities in the persons appointed;\n(g)    suspend, punish and remove, in accordance with prescribed procedure, from\nservice officers, teachers and other employees of the University except those\nappointed by or with the approval of the Board of Governors;\n(h)    delegate, subject to such conditions as may be prescribed, any of his powers\nunder this Act to an officer or officers of the University;\n(i)    exercise and perform such other powers and functions as may be prescribed;\n(j)    submit to the Board of Governors, in accordance with the rules of procedure\nframed by it, reports on the activities of the University and the execution of the\nplans of works;\n(k)    prepare and revise from time to time statutes and regulations with the approval\nof the Board of Governors for the efficient and effective operations of the\nUniversity; and\n(l)     provide the necessary requisite service to the Board of Governors.\n(3) The Vice-Chancellor shall, if present, be entitled to attend any meeting of any Authority or\nbody of the University.\n(4) The Vice-Chancellor may, in an emergency that in his opinion requires immediate action\nordinarily not in the competence of the Vice-Chancellor, take such action and forward, within\nseventy-two hours, a report of the action taken to the members of the Emergency Committee of the\nBoard of Governors, to be set up by Statute. The Emergency Committee may direct such further action\nas is considered appropriate.\n(5) The Vice-Chanceqor shall present an annual report before the Board of Governors within\nthree months of the close of the academic year. The annual report shall present such information as\nregards the academic year under review as may be prescribed including disclosure of all relevant facts\npertaining to—\n(a)    academics;\n(b)    research;\n(c)    administration; and\n(d)    finances.\n(e)     The Vice-Chancellor's annual report shall be made available, prior to its\npresentation before the Board of Governors, to all officers and University\nteachers and shall be published in such numbers as are required to ensure its\nwide circulation."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Appointment and removal of the Vice",
      "content": "Chancellor.—(1) The Vice- Chancellor shall be\nappointed by the Pro-Chancellor on the recommendations made by the Board of Governors.\n(2) A Search Committee for the recommendation of persons suitable for appointment as Vice-\nChancellor shall be constituted by the Board of Governors on the date and in the manner prescribed\nby the Statutes and shall consist of two eminent academicians nominated by the Pro-Chancellor of\nwhom one shall be appointed as Convener, two members of the Board of Governors and two\ndistinguished University Teachers who are not members of the Board of Governors. The two\ndistinguished University Teachers shall be selected by the Board of Governors through a process, to\nbe prescribed by Board of Governors that provides for the recommendation of suitable names by the\nUniversity Teachers in general. The Search Committee shall remain in existence till such time that the\nappointment of the next Vice-Chancellor has been made by the Pro-Chancellor.\n(3) The persons proposed by the Search Committee for appointment as Vice-Chancellor shall\nbe considered by the Board of Governors and of these a panel of three, in older of Priority, shall be\nrecommended by the Board of Governors to the Pro-Chancellor:\nProvided that the Pro-Chancellor may decline to appoint any of the three persons recommended\nand seek recommendation of a fresh panel. In the event of a fresh recommendation being sought by\nthe Pro-Chancellor the Search Committee shall make a proposal to the Board of Governors in the\nprescribed manner.\n(4) The Vice-Chancellor shall be appointed for a renewable tenure of four years on such terms\nand conditions as prescribed by Statutes. The tenure of an incumbent Vice-Chancellor shall be renewed\nby the Pro-Chancellor on receipt of a resolution of the Board of Governors in support of such renewal:\nProvided that the Pro-Chancellor may call upon the Board of Governors to reconsider such\nresolution once.\n(5) The Board of Governors may, pursuant to a resolution in this behalf passed by three-fourths\nof its membership, recommend to the Pro-Chancellor the removal of the Vice-Chancellor on the\nground of in-efficiency, moral turpitude or physical or mental incapacity or gross misconduct,\nincluding misuse of position for personal advantage of any kind:\nProvided that the Pro-Chancellor may make a reference to the Board of Governors stating the\ninstances of inefficiency, moral turpitude or physical or mental incapacity or gross misconduct on the\npart of the Vice-Chancellor that have come to his notice. After consideration of the reference the Board\nof Governors may, pursuant to a resolution in this behalf passed by two-thirds of its membership,\nrecommend to the Pro-Chancellor the removal of the Vice Chancellor:\nProvided further that prior to a resolution for the removal of the Vice-Chancellor being voted\nupon the Vice-Chancellor shall be given a fair opportunity of being heard.\n(6) A resolution recommending the removal of the Vice-Chancellor shall be submitted to the\nPro- Chancellor forthwith. The Pro-Chancellor may accept the recommendation and order removal of\nthe Vice-Chancellor or return the recommendation to the Board of Governors.\n(7) At any time when the office of the Vice-Chancellor is vacant, or the Vice-Chancellor is\nabsent or is unable to perform the functions of his office due to illness or some other cause, the Board\nof Governors shall make such arrangements for the performance of the duties of the Vice-Chancellor\nas it may deem fit."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Pro Vice",
      "content": "Chancellor.⸻ (1) There shall be a Pro-Vice-Chancellor of the University to be\nappointed by the Board of Governors on the recommendation of the Vice-Chancellor, on such terms\nand conditions as may be prescribed.\n(2) The Pro-Vice-Chancellor shall be an illustrious academician or an administrator with\nprescribed credentials in the healthcare field.\n(3) The Pro-Vice-Chancellor shall serve as deputy to the Vice-Chancellor and assist him in\noverall administrative and academic functions of the University.\n(4) The Pro-Vice-Chancellor shall be full-time officer of the University and assist in implementation\nof the decisions and policies of the Board of Governors and the Vice-Chancellor."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Registrar",
      "content": "(1) There shall be a Registrar of the University to be appointed by the Board\nof Governors on the recommendation of the Vice-Chancellor, on such terms and conditions as may be\nPrescribed.\n(2) The experience as well as the professional and academic qualifications necessary for\nappointment to the post of the Registrar shall be as may be prescribed.\n(3) The Registrar shall be a full-time officer of the University and shall,—\n(a)     be the administrative head of the secretariat of the University and be responsible\nfor the provision of secretariat support to the Authorities of the University;\n(b)     be the custodian of the common seal and the academic records of the University;\n(c)     maintain a register of registered graduates in the prescribed manner;\n(d)     supervise the process of election, appointment or nomination of members to the\nvarious authorities and other bodies in the prescribed manner; and\n(e)     perform such other duties as may be prescribed.\n(4) The term of office of the Registrar shall be a renewable period of three years:\nProvided that the Board of Governors may, on the advice of the Vice-Chancellor, terminate the\nappointment of the Registrar on grounds of inefficiency or misconduct in accordance with prescribed\nprocedure."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Treasurer",
      "content": "(1) There shall be a Treasurer of the University to be, appointed by the Board\nof Governors on the recommendation of the Vice-Chancellor, on such terms and conditions as may be\nprescribed.\n(2) The experience and the professional and academic qualifications necessary for appointment\nto the post of the Treasurer shall be as prescribed.\n(3) The Treasurer shall be the chief financial officer of the- University and shall,—\n(a)     manage the assets, liabilities, receipts, expenditures, funds and investments of\nthe University;\n(b)     prepare the annual and revised budget estimates of the University and present\nthem to the Syndicate or a committee thereof for approval and incorporation in\nthe budget to be presented to the Board of Governors;\n(c)     ensure that the funds of the University are expended on the purposes for which\nthey are provided;\n(d)     have the accounts of the University audited annually so as to be available for\nsubmission to the Board of Governors within six months of the close of the\nfinancial year; and\n(e)     perform such other duties as may be prescribed.\n(4) The term of office of the Treasurer shall be a extendable period of three years:\nProvided that the Board of Governors may, on the advice of the Vice-Chancellor, terminate the\nappointment of the Treasurer on grounds of inefficiency or misconduct in accordance with prescribed\nprocedure."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Controller of Examinations",
      "content": "(1) There shall be a Controller of Examinations, to be\nappointed by the Board of Governors on the recommendation of the Vice-Chancellor, on such terms\nand conditions as may be prescribed.\n(2) The minimum qualifications necessary for appointment to the post of the Controller of\nExaminations shall be as may be prescribed.\n(3) The Controller of Examinations shall be a full-time officer of the University and shall be\nresponsible for all matters connected with the conduct of examinations and perform such other duties\nas may be prescribed.\n(4) The Controller of Examinations shall be appointed for a renewable term of three years:\nProvided that the Board of Governors may, on the advice of the Vice-Chancellor, terminate the\nappointment of the Controller of Examinations on grounds of inefficiency or misconduct in\naccordance with prescribed procedure."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Authorities",
      "content": "(1) The following shall be the Authorities of the University, namely:—\n(a)      the Board of Governors;\n(b)     the Syndicate;\n(c)     the Academic Council;\n(d)     the Board of Studies; and\n(e)     such other authorities as may be constituted by the Board of Governors.\n(2) The Board of Governors, the Syndicate and the Academic Council may set up such other\ncommittees or sub-committees, by whatever name described, as are considered appropriate and\ndesirable through Statutes or Regulations. Such committees or sub-committees shall be Authorities of"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Board of Governors",
      "content": "(1) The governance and control of the affairs of the University,\nand the power to lay down the policies of the University shall vest in a Board of Governors and shall\nconsist of,—\n(a)     Pro-Chancellor who shall be ex-officio chairman of the Board of Governors;\n(b)     Adjutant General, General Headquarters:\n(c)     Surgeon General, Director General Medical Services (Inter Services) Medical\nDirectorate;\n(d)     Vice-Chancellor,\n(e)     Pro­Vice­Chancellor;\n(f)     Secretary Ministry of Health Services, Regulations and Coordination\nGovernment of Pakistan (or a nominee not less than a Joint Secretary);\n(g)     Secretary, Ministry of Finance, Government of Pakistan (or a nominee not less\nthan a Joint Secretary);\n(h)     Secretary Ministry of Defence (or a nominee not less than a Joint Secretary);\n(i)     Chairman, Higher Education Commission (or a nominee not less than a\nExecutive Director or Director General);\n(j)     President, Paidstan Medical and Dental .Council (or a nominee not less than the\nSecretary);\n(k)     Chairperson, Pakistan Medical Research Council;\n(l)     four persons from society at large being persons of distinction in the fields of\nadministration, management, education, academics, law, accountancy,\nmedicine, science and technology such that the appointment of these persons\nreflects a balance across the various fields:\nProvided that the special focus or affiliation of the University, to be declared in the manner\nprescribed, may be reflected in the number of persons of d istinction in an area of expertise relevant to\nthe University who are appointed to the Board of Governors;\n(m)     one person from amongst the alumni of the University;\n(n)      two persons from the academic community of the country, other than\nemployees of the University, at the level of professor or principal of a college;\nand\n(o)     three University Teachers.\n(2) Co-opted Members (on as required basis without voting rights).\n(a)     General Officers of General Headquarters as designated by the Chief of Army\nStaff; and\n(b)     Director General, Joint Staff Headquarters.\n(3) Registrar will be the Secretary of the I3oard of Governors;\n(4) The numbers of the members of the Board of Goverao specified in clauses (I) to (o) of sub-\nsection (1) may be increased by the Governor through Statutes subject to condition that the total\nmembership of the Board of Governors does not exceed twenty one, with a maximum of live\nUniversity feadiers, and the increase is balanced, to the extent possible, across different categories\nspecified in sub-section (1).\n(5) All appointments to, the Board of Governors shall be made by the Chancellor.\n(6) Appointments of persons specified in clauses (I) to (o) of sub-section (I) shall be made from\namongst a panel of three names for each vacancy recommended by the Representation Committee set\nup in terms of section 23 and in accordance with procedure as may be prescribed:\nProvided that effort shall be made, without compromising on quality or qualification, to give\nfair representation to women on the Board of Governors:\nProvided that as regards the University Teachers described in clause (o) of sub-section (1) the\nBoard of Governors shall prescribe a procedure for appointment on the basis of elections that provide\nfor voting by the various categories of University Teachers.\n(7) The Chairman of the Board of Governors may, In consultation with the Board of Governors,\nappoint any other person including a medical scientist or educationist as member of the Board of\nGovernors.\n(8) The existence of a vacancy in, or defect in the constitution of, the Board of Governors, shall\nnot invalidate any act or proceedings of the Board of Governors.\n(9) The Board of Governors may direct any officer, member of faculty or any other person to\nbe in attendance during-all or any of its meeting or any part of the meeting.\n(10) The members of the Board of Governors, other than the Vice-Chano:11or, shall hold\n'office for a term of three years and shall be eligible for reappointment on the expiry of their term' :\nProvided that, in the case of the first Board of Governors constituted under this Act. one-third\nof the members for the time being, other than the Vice Chancellor, to be determined by, lot, shall retire\nfrom office on the expiration of one year from such constitution, one-half of the remaining members,\nto be determined by lot, shall retire from office on the expiration of tWo years from such constitution\nand the-remaining one--half shall retire- frOm office on the expiration of the third year.\n(11) The office of a member of the Board of Governors shall become vacant if he resigns or\nfails to attend three consecutive meetings of the Board without sufficient cause or leave of absence, or\nif his nominatiop is changed by the person nom inai\n(12) A causal vacancy . in the office of a member of the Board shall be filled by a person\nnominated by the person or body who had nominated the member whose vacancy is to be filled.\n(13) The Board of Governors shall exercise and perform the powers and functions hereinafter\nspecified, namely:—\n(a)     to hold, control and administer the property, funds and resources of the\nUniversity and to borrow or raise money for the purposes of the University upon\nsuch security as may be required;\n(b)     to formulate or approve the principles, policies and plans governing the\nactivities and operations of the University so as to ensure that the academic staff\nenjoy academic freedom in their research and educational work;\n(c)     to prepare or have prepared and revised from time to time the statutes, rules and\nregulations for the efficient and effective operation of the University;\n(d)     to review and approve the creation of any standing component of the University,\nsuch as faculties, colleges, programmes, institutes, hospitals, standing\ncommittees and councils and other administrative bodies necessary to assist or\nimprove the working of the University;\n(e)      to approve the plans of work and annual budget of the University submitted by\nthe Director Finance, the budget being based on the budget prepared and\nsubmitted by the University itself and by the constituent or affiliated college or\ninstitute institution centre hospital;\n(f)     to require of, and consider reports submitted by the officers of the University\nrelating to the activities of the University and the execution of the plans of work\nand to direct the Vice-Chancellor to submit reports relating to any matter\nspecified by the Board of Governors;\n(g)     to create such academic or administrative posts as it may consider necessary for\nthe purposes of the University and to approve appointments to such of these\nposts as it may specify, including the posts of deans, directors, professors,\nassociate professors, assistant professors, lecturers and demonstrators;\n(h)     to select and appoint, all administrative and academic staff of the University:\n(i)     to fix the scales of pay, allowances and honoraria for all the staff, both academic\nand administrative, commensurate with their qualification and experience, in\norder to attract the best talent from within and outside Pakistan for the\nUniversity:\n(j)      to undertake responsibility for the financial integrity of the University including\nresponsibility for ensuring effectiveness of its future operations and their\ncontinuity and the preservation of the autonomy of the University;\n(k)      to approve all affiliations and other similar arrangements through which\ncolleges, institutions, hospitals or individuals may become, associated with the\nUniversity from within Pakistan and abroad;\n(l)     to appoint from amongst its members such committees or subcommittees as may\nin the opinion of the Board of Governors lead to its more efficient and effective\noperations; and\n(m)      to take all such initiatives as it may consider necessary or desirable for the\nefficient and effective management and functioning of the University.\n(4) The Board of Governors shall lay down its own rules of procedures and may amend or\nmodify them from time to time.\n(5) The Board of Governors may delegate all or any of its powers and functions to a committee,\nsub-committee or to the Vice-Chancellor.\n(6) The Board of Governors shall not start functioning until the Chairman and the members to\nbe nominated by the Pro-Chancellor have been nominated and no act or proceeding of the Board shall\nbe invalid by reason only of the existence of a vacancy in, or defect in the constitution of, the Board\nof Governors."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Meetings of the Board of Governors, etc",
      "content": "(1) The Board of Governors shall meet at\nleast twice a year for regular or scheduled meetings and may meet at any other time at which a special\nmeeting thereof may be called by the Chairman of the Board of Governors or requisitioned in writing\nby not less than four members of the Board of Governors.\n(2) Not less than ten clear days' notice of a special meeting shall be given to the members of\nthe Board of Governors and the agenda of the meeting shall be restricted to the matters specified in the\nagenda to be annexed to such notice.\n(3) The quorum for a meeting of The Board of Governors shall be one-half of its members, a\nfraction being counted as one.\n(4) The decisions of the Board of Governors shall be expressed in terms of the views of the\nmajority of the members present and voting and, if the members are equally divided, the Chairman\nshall have and exercise a second or casting vote."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Syndieate",
      "content": "-(1) The Syndicate shall comprise the following, namely:—\n(a)     Vice-Chancellor who shall be the Chairman of the Syndicate;\n(b)     Pro-Vice- Chancellor;\n(c)     Deputy Surgeon General, Medical Directorate;\n(d)     Director Genei­als;\n(e)     Nominee from Higher Education Commission not less than Director General;\n(f)     Principals constituent or affiliated colleges;\n(g)     Commandants of institutes or,institutions, centers or hospitals etc., as may be\nrequired;\n(h)     Deans of Faculties of the University;\n(i)     three professors from different departments. who are not members of the Board\nof Governors, to be elected by the University Teachers in accordance with\nprocedure to be prescribed by the Board of Governors;\n(j)     Directors as may be required;\n(k)     Registrar;\n(l)     Treasurer; and\n(m)     Controller of Examination.\n(2) The Board of Governors may include any other person as member of the as it may deem\nappropriate.\n(3) The Principals, Commandants and Deans otherwise not members shall, whenever invited,\nattend the meetings of the Syndicate.\n(4) The Syndicate shall act as an advisory as well as an implementing body for the decisions\nof the Board of Governors on all matters relating to the conduct of examinations, revision and updating\nof course syllabi, quality of education, and duration of all courses including conduct of postgraduate\nclasses in specified disciplines."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Powers and duties of the Syndicate",
      "content": "( 1) The Syndicate shall be the executive body of the\nUniversity and shall, subject to the provisions of the Act and the Statutes, exercise general supervision\never the affairs and management of the University.\n(2) The Syndicate shall have the following powers, namely:—\n(i)     consider the annual report, the annual and revised budget estimates and\nto submit these to the Board of Governors;\n(ii)     recommend allocation of training and research fund to the Colleges,\nInstitutes, institutions, centres, hospitals; -\n(iii)    transfer and accept transfer of movable property on behalf of the\nUniversity ;\n(iv)     enter into, very, carry out and cancel contracts on behalf of the\nUniversity;\n(v)      cause proper books of account to be kept for all sums of money received\nand expended by the University and for the assets and liabilities of the\nUniversity;\n(vi)     invest any money belonging to the University including any unapplied\nincome in any of the securities described in section 20 of the Trusts Act,\n1882 (Hof 1882), or in the purchase of immovable property or in such\nother manner, as it may prescribe, with the like power of varying such\ninvestments;\n(vii)     receive and manage any property transferred, and grants, bequests,\ntrust, gifts, donations, endowments, and other contributions made to the\nUniversity;\n(viii)    administer any funds placed at the disposal of the University for\nspecified purposes;\n(ix)      provide the buildings, libraries, premises, furniture, apparatus,\nequipment and other means required for carrying out the work of the\nUniversity;\n(x)      establish and maintain halls of residence and hostels or approve or\nlicense hostels or lodgings for the residence of students;\n(xi)     recommend to the Board of Governors affiliation or disaffiliation of\ncolleges;\n(xii)     recommend to the Board of Governors admission of educational\ninstitutions to the privileges Of the University and withdraw such\nprivileges;\n(xiii) arrange for the inspection of colleges and the departments;\n(xiv)    institute Professorships, Associate Professorships, Assistant\nProfessorships, Lectureships, and other teaching posts or to suspend or\nto abolish such posts;\n(xv)     create, suspend or abolish such administrative or other posts as may be\nnecessary;\n(xvi)    prescribe the duties of officers, teachers and other employees of the\nUniversity;\n(xvii)    report to the Board of Governors on matters with respect to which it has\nbeen asked to report;\n(xviii) appoint members to various Authorities in accordance with the\nprovisions of the Act;\n(xix)    propose drafts of Statutes for submission to the Board of Governors;\n(xx)     regulate the conduct and discipline of the students of the University;\n(xxi)     take actions necessary for the good administration of the. University in\ngeneral and to this end exercise such powers as are necessary;\n(xxii)   delegate any of its powers to any Authority or officer or a committee;\n(xxiii) perform such other functions as have been assigned to it by the\nprovisions of the Act or may be assigned to it by the Statutes;\n(xxiv) delineate priorities for research;\n(xxv) recommend apportioning of the national research and development\nbudget for the University;\n(xxvi) guide and direct the Board of Studies of each college and institute on\nall matters relating to the academics, including syllabi and duration of\nvarious courses;\n(xxvii) recommend disciplines for all academic studies in the colleges,\ninstitutions, institutes, centres, hospitals and help in creation of\nnecessary infrastructure'for the same;\n(xxviii) help induct highly competent scientific and technical talent into the\nfaculty of each College to enhance the quality of education and research;\n(xxix) recommend such measures which would foster 'and enhance interaction\nand collaboration between the University and the existing national and\ninternational organizations, institutions and research centres and the\nindustrial base;\n(xxx) workout and propose affiliation measures with foreign institutions of\nrepute;\n(xxxi) coordinate with relevant Government Ministries, Universities and\nHigher Education Commission;\n(xxxii) propose statutes to the Board of Governors for approval ; and\n(xxxiii) prepare regulations for approval by the Board of Governors."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Academic Council",
      "content": "(1) There shall be an Academic Council of the University consisting\nof the following, namely:—\n(a)     the Vice-Chancellor who shall be its Chairman;\n(b)     the Deans of Faculties or Commandants and such Heads of departments as may\nbe required;\n(c)     Director General Medicine;\n(d)     Director General Surgery;\n(e)     Director Academics Higher Education Commission;\n(f)     five members representing the departments, institutes, hospitals and the\nconstituent colleges as may be prescribed by the Board of Governors;\n(g)     Principals of the constituent or affiliated colleges;\n(h)     three Professors including Emeritus Professors;\n(i)     the Registrar;\n(j)     the Controller of Examinations; and\n(k)     the Librarian.\n(2) The Board of Governors shall appoint the members of the Academic Council on the\nrecommendation of the Vice-Chancellor:\nProvided that as regards the live professors and=the members representirn2 the departments,\ninstitutes and the constituent colleges the Board of Governors ;may, as an alternative to elections,\nprescribe a procedure for proposal of a panel of names by the Representation Committee set up in\nterms of section 23. Appointment of persons proposed by the Representation Committee may be made\nby the Board of Governors on the recommendation of the Vice-Chancellor.\n(3) The members of the Academic Cotincil shall hold office for three years.\n(4) The Academic Council shall meet at least once in each quarter.\n(5) The quorum for meetings of the Academic Council shall be one-half of the total number of\nmembers, a fraction being counted as one."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Powers and functions of the Academic Council",
      "content": "(1) The Academic Council shall be the\nprincipal academic body of the University and shall, subject to the provisions of the Act and the\nStatutes have the power to lay down proper standards of ihstruction, research and examinations and to\nregulate and promote the academic life of the University and the colleges.\n(2) The Academic Council shall have the power to,—\n(a)    approve the policies and procedures pertaining to the quality of academic\nprogrammes;\n(b)    approve academic programmes;\n(c)    approve the policies and procedures pertaining to student related functions\nincluding admissions, expulsions, punishments, examinations and certification;\n(d)    help the Vice-Chancellor in evaluating, proposing and coordinating research\nand development projects and respective institutes, colleges and hospitals;\n(e)    approve the policies and procedures assuring quality of teaching and research;\n(f)    recommend the policies and procedures for affiliation of othereducational\ninstitutions;\n(g)    propose to the Syndicate schemes for the constitution and organization of\nFaculties, teaching departments and boards of studies;\n(h)    appoint paper setters and examiners for all examinations of the University after\nreceiving panels of names from the relevant authorities;\n(i)    institute programmes for the continued professional development of University\nTeachers at all levels;\n(j)    recognize the examinations of other Universities or examining bodies as\nequivalent to the corresponding examinations of the University;\n(k)     regulate the award of studentships, scholarships, exhibitions, medals and\nprizes;\n(l)    frame Regulations for submission to the Board of Governors;\n(m)    prepare an annual report on the academic performance of the University; and\n(n)    perform such functions as may be prescribed by Regulations."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Representation Committee",
      "content": "(1) There shall be a Representation Committee constituted\nby the Board of Governors through Statute for recommendation of persons for appointment to the\nBoard of Governors in accordance with the provisions of section 17.\n(2) There shall also be a Representation Committee constituted by the Board of Governors\nthrough Statute for the recommendation of persons for appointment to the Syndicate and the Academic\nCouncil in accordance with the provisions of sections 19 and 21.\n(3) Members of the Representation Committee for appointments to the Board of Governors\nshall consist of the following, namely:—\n(a)     three members of the Board of Governors who are not University Teachers;\n(b)     two persons nominated by the University Teachers from amongst themselves in\nthe manner prescribed;\n(c)     one person from the academic community, not employed by the University, at\nthe level of professor or college principal to be nominated by the University\nTeachers in the manner prescribed; and\n(d)     one eminent citizen with experience in administration, philanthropy,\ndevelopment work, law or accountancy to be nominated by the Board of\nGovernors.\n(4) The Representation Committee for appointments to the Syndicate and the Academic\nCouncil shall consist of the following:—\n(a)     two members of the Board of Governors who are not University Teachers; and\n(b)      three persons nominated by the University Teachers from amongst themselves\nin the manner prescribed.\n(c)     The tenure of the Representation Committees shall be three years. No member\nshall serve for more than two consecutive terms.\n(d)     The procedures of the Representation Committees shall be as may be\nprescribed.\n(e)     There may also be such other Representation Committees set up- by any of the\nother Authorities of the University as are considered appropriate for\nrecommending persons for appointment to the various Authorities and other\nbodies of the University."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Board of Studies",
      "content": "(1) There shall be a Board of Studies for each Faculty or constituent\nor affiliated college or institute comprising of following, namely:— .\n(a)     Dean or Commandant who shall be its Chairman;\n(b)     Chairpersons of the Departments;\n(c)     Deputy Dean in case Commandant or Principal is Dean;\n(d)     selected teaching staff; and\n(e)     a representative of the University.\n(2) The Board of Studies shall—\n(a)     implement the decisions of the Board of Governors and the Syndicate on all\nmatters relating to academic standards, examinations and research;\n(b)     ensure feedback of the implemented measures on research and academic\nmatters;\n(c)     workout and report to the Vice-Chancellor details of research funding required;\nand\n(d)     formulate academic proposals to be submitted to the Syndicate or\nVice-Chancellor for consideration or appropriate decision."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Appointment of committees ,by certain Authorities",
      "content": "(1) The Board of Governors, the\nSyndicate, the Academic Council and other Authorities may, from time to time, appoint such standing,\nspecial or advisory committees, as they may deem fit, and may place on such committee persons who\nare not members of the Authorities appointing the Committees.\n(2) The constitution, functions and powers of the Authorities for which no specific provision\nhas been made in this Act shall be such as may be prescribed by Statutes or Regulations."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Academic and administrative staff",
      "content": "(1) The academic and administrative staff of the\nUniversity shall be selected with a view to achieving its stated objectives and the basic criteria for their\nselection shall be the highest standards of competence, integrity and efficiency. .\n(2) The academic staff of the University shall enjoy freedom of expression in their research\nand educational work to achieve the objectives of the University."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. University funds, audit and accounts",
      "content": "(1) The University shall have a Fund to which\nshall be credited all direct donations, trusts, bequests, endowments, grants, proportionate budget from\nthe Government, assistance from international agencies, contributions, shares of fee, and income from\nany other sources .which shall be under the control of the Board of Governors.\n(2)The Affiliated Colleges shall continue to receive their finances from the annual budget from\ntheir respective service headquarters or ministries.\n(3) Capital and recurrent expenditure of the University shall be met from the allocation made\nby the Board of Governors out of the University Fund.\n(4) No contribution, donation or grant which may directly or indirectly involve any immediate\nor subsequent financial liability for the University or which may involve an activity not included in its\nprogrammes shall be accepted without prior approval of the Board of Governors.\n(5) The accounts of the University shall be maintained in such manner as may be determined\nby the Board of Governors and each year within six months of the closing of the financial year of the\nUniversity, the annual audited report shall be prepared in conformity with the Generally Accepted\nAccounting Principles by a Chartered Accountant appointed by the Board of Governors and submitted\nto the Auditor General Pakistan Revenues.\n(6) The accounts, together with the report of the auditor, shall be submitted to the Board of\nGovernors for approval."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Pension, insurance, gratuity, provident fund and benevolent fund",
      "content": "(1) The University\nshall constitute for the benefit of its officers, teachers and other employees in such manner and subject\nto such conditions as may be prescribed such pension, insurance, gratuity, provident fund and\nbenevolent fund and other welfare schemes as it may deem fit.\n(2) Where any provident fund has been constituted under this Act, the provisions of the\nProvident Fund Act, 1925 (XIX of 1925), shall apply to such fund as if it were the Government\nProvident Fund."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Statutes",
      "content": "(1) Subject to the provisions of this Act, Statutes may be made to regulate or\nprescribe all or any of the following matters namely:—\n(a)      creation of the colleges, institutes, hospitals and faculties;\n(b)     service, pension and fringe benefits for University employees and terms and\nconditions- of their service;\n(c)     condition of appointment of Professors Emeritus and award of honorary\ndegrees;\n(d)     efficiency and discipline of the University employees; and\n(e)     all other matters required to be regulated by statutes.\n(2) Draft of the statutes shall be proposed by the Syndicate for approval by the Board of\nGovernors which any approve them or refer them” back for reconsideration.\n(3) No statute shall be valid until it has been approved by the Board of Governors."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Regulations",
      "content": "(1) Subject to the provisions of this Act and the Statutes, the Syndicate\nmay prepare regulations for all or any of the following matters, namely: —\n(a)     scheme of studies and research including the duration of courses, number of\nsubjects or papers for examination;\n(b)     syllabi and courses of study and research programmes leading to degrees,\ndiplomas or certificates;\n(c)     methodology for selection and admission of students;\n(d)     conduct and supervision of examination, appointment of examiners and scrutiny\nand tabulation of results;\n(e)     determination of fees and other charges for admission to various courses;\n(f)     maintenance of disciplines among students and scheme for their welfare;\n(g)     institution of fellowships, scholarships, prizes and medals, honorarium and\nother financial assistance to students and research scholars;\n(h)     conduct of convocations and form of academic costumes; and\n(i)     all other academic matters which are to be or may be prescribed.\n(2) The regulations shall be approved by the Board of Governors on recommendations of the\ncommittee;\n(3) No regulation shall be valid until it has been approved by the Board of Governors."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Indemnity.⸻ No suit, prosecution or other legal proceedings shall lie against the",
      "content": "University or any Authority, officer or employee of the Government or the University or any person\nin respect of anything which is in good faith done or intended to be done under this Act."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Removal of difficulties",
      "content": "(1) If any question arises as to the interpretation of any of the\nprovisions of the Act, it shall be placed before the Board of Governors whose decision thereon will be\nfinal;\n(2) If any difficulty arises in giving effect to any provision of this Act, the Board of Governors\nmay make such order to direction, not inconsistent with the provisions of this Order, as may appear to\nit to be necessary for the purpose of removing such difficulty.\n(3) Where this Act Takes any provision for anything to be done but no provision or no sufficient\nprovision has been made as respects the authority by whom, or the time at which, or the manner in\nwhich it shall be done, then, it shall be done by such authority at such time or in such manner as the\nBoard of Governors may direct"
    }
  ],
  "definitions": [
    {
      "term": "Academic Council- means the Academic Council of the University; (ii) “Affiliated College",
      "definition": "any college, institute, institution, centre or hospital affiliated to the University but not maintained or administered by it;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "any of the Authorities of the University specified or set up in terms of section 16;",
      "source_provision": "sec2"
    },
    {
      "term": "Board of Governors",
      "definition": "the Board of Governors of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Campus",
      "definition": "any infrastructure of the university within country or abroad;",
      "source_provision": "sec2"
    },
    {
      "term": "Chancellor",
      "definition": "the Chancellor of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "College",
      "definition": "a college constituted or affiliated with the University; (viii) “Commission” means the Higher Education Commission set up by the Higher Education Commission Act, 2002 (L1II of 2002);",
      "source_provision": "sec2"
    },
    {
      "term": "Constituent College",
      "definition": "an educational college or institute in the health studies, by whatever name described, maintained and administered by the Armed Forces University including Army Medical College, Rawalpindi; Armed Forces Postgraduate Medical Institute, Rawalpindi and such other college or institute or institution designated as such by the Board of Governors;",
      "source_provision": "sec2"
    },
    {
      "term": "Controller of Examinations",
      "definition": "the chief coordinator of lp examinations of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Commandant",
      "definition": "administrative head of an institute or hospital;",
      "source_provision": "sec2"
    },
    {
      "term": "Dean",
      "definition": "head of a faculty or academic head of institute under the University or the head of an academic body granted the status of a Faculty by this Act or by the Statutes or Regulations; (xiii) “Department” means a teaching department maintained and administered, or recognized by the University in the manner prescribed;",
      "source_provision": "sec2"
    },
    {
      "term": "Director",
      "definition": "the head of a department or section established by the University established by Statutes or Regulations in terms of the powers delegated by this Act including but not limited to: Director Administration; Director Finance; Director Legal; Director Research and Development; Director Academic Coordination; Director International Affairs; Director Quality Assurance; Director Human Resource or Director Planning and this post may be upgraded to Director General on need basis;",
      "source_provision": "sec2"
    },
    {
      "term": "Director General",
      "definition": "the head of the directorate of Armed Forces of Pakistan wherever such post exists or head of an institute or department under University with duties as may be prescribed;",
      "source_provision": "sec2"
    },
    {
      "term": "Faculty",
      "definition": "an administrative and academic unit of the University consisting of one or more departments as may be prescribed; (xvii) “Government” means the Federal Government; (xviii) “Institute” means an institute constituted or affiliated with University;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by Statutes, Regulations or Rules and made under the Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Principal",
      "definition": "the head of a College or Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Pro-Vice Chancellor",
      "definition": "Pro-Vice Chancellor of the University; (xxii) “Registrar” means the Registrar of the University; (xxiii) “Regulation” means regulations made under this Act; (xxiv) “Representation Committees” means the Representation Committees constituted under section 23;",
      "source_provision": "sec2"
    },
    {
      "term": "Search Committee",
      "definition": "the Search Committee set up by the Board of Governors under sub-section (2) of section 11; (xxvi) “Statutes”, “Regulations” and “Rules” mean respectively the Statutes, the Regulations and the Rules made under this Act and for the time being in force; (xxvii) “Syndicate” means the Syndicate of the University; (xxviii)”Teachers” include Professors, Associate Professors, Assistant Professors, registrars, and Lecturers, Demonstrators engaged whole-time by the University or by a constituent or affiliated college and such other persons as may be declared to be teachers by Regulations; (xxix) “Teaching Hospitals or Institutes” or “University Hospitals or Institutes” means any hospital or institute by whatever name described, designated by the University for teaching, training and research purposes presently including but not limited to Armed Forces Institute of Cardiology, Rawalpindi; Armed Forces Institute of Pathology, Rawalpindi; Armed Forces Institute of Transfusion, Rawalpindi; Armed Forces Institute of Urology, Rawalpindi; Armed Forces Institute of Rehabilitation Medicine, Rawalpindi; Armed Forces Bone Marrow Transplantation Centre, Rawalpindi; Armed Forces Institute of Urology, Rawalpindi; Armed Forces Institute of Mental Health, Rawalpindi; Armed Forces Institute of Ophthalmology, Rawalpindi; Armed Forces Institute of Radiological Imaging, Rawalpindi; Armed Forces Institute of Nutrition, Lahore; Army Medical Corps School and Centre Abbottabad; Combined Military Hospital, Rawalpindi; Military Hospital, Rawalpindi; Combined Military Hospital Lahore; Combined Military Hospital Peshawar; Combined Military Hospital Kharian; Combined Military Hospital Multan; Combined Military Hospital Malir; Combined Military Hospital Quetta; Combined Military Hospital Sialkot; Combined Military Hospital Okara; Combined Military Hospital Jhelum; Combined Military Hospital Gujranwala; Combined Military Hospital Mangla; Combined Military Hospital Sargodha; Combined Military Hospital Abbottabad; Combined Military Hospital Murree; Combined Military Hospital Chunian; Combined Military Hospital Zhob; Combined Military Hospital Khuzdar; Combined Military Hospital Loralai; Combined Military Hospital Sibbi; Combined Military Hospital Dera Ismail Khan; Combined Military Hospital Mardan; Combined Military Hospital Bahawapur; Combined Military Hospital Bahalwalnagar; Combined Military Hospital Skardu; Combined Military Hospital Gilgit; Combined Military Hospital Nowshera; Combined Military Hospital Kohat; Combined Military Hospital Attock; Combined Military Hospital Hyderabad; Combined Military Hospital Pano Aqil; Combined Military Hospital Bannu; Combined Military Hospital Risalpur; Combined Military Hospital Landikotal; Combined Military Hospital Rahim Yar Khan; Combined Military Hospital Mailsi; Combined Military Hospital Chhor; Combined Military Hospital Dera Nawab Shah; Combined Military Hospital Badin; Combined Military Hospital Cherat; Combined Military Hospital Thal; Combined Military Hospital Tarbela; Combined Military Hospital Muzaffarabad; Combined Military Hospital Rawlakot; Combined Military Hospital Chunian; Army Cardiac Centre Lahore; Hand & Upper Limb Surgery Lahore; Heavy Industry Taxil la Hospital; Pakistan Naval Hospital; Hafeez, Islamabad; Pakistan Air Force Hospital, Islamabad. Shall include any other hospital or institute or institution designated as such by the Board of Governors. These hospitals or institutes shall act as University's hubs for academic and research purposes and resource centres for continuing professional development opportunities;",
      "source_provision": "sec2"
    },
    {
      "term": "University",
      "definition": "the National University of Medical Sciences established under this Act; and (xxxi) “Vice-Chancellor” means the Vice-Chancellor of the University appointed under section 10.",
      "source_provision": "sec2"
    }
  ]
}
