{
  "id": "pk-national-university-of-science-and-technology-act-nust-1997",
  "type": "statute",
  "title": "National University of Science and Technology Act (NUST) , 1997",
  "title_en": "National University of Science and Technology Act (NUST) , 1997",
  "short_name": "NUOSA",
  "status": "in_force",
  "issued_date": "1997-11-30",
  "in_force_date": "1997-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apqZYw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National University of Science and Technology Act (NUST) , 1997 (XX of 1997) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencements",
      "content": "(1) This Act may be called the National\nUniversity o f Sciences and Technology Act, 1997.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(a)     \"Academic Council\" means the Academic Council constituted under section\n15 ;\n(b)     \"Board\" means the Board of Governor of the University constituted under\nsection 12 ;\n(c)     \"Chancellor\" means the Chancellor of the University ;\n(d)     \"college\" means a college constituted or affiliated with the University ;\n(e)     \"constituent colleges and institutes\" means the Military College of\nEngineering, Risalpur, the Military College Signals Rawalpindi, the College\nof Electrical and Mechanical Engineering Rawalpindi and the National\nInstitute of Transportation and includes any other college or institute\ndesignated as such by the Board ;\n(f)     \"Committee\" means the executive committee of the University constituted\nunder section 14 ;\n(g)     \"Dean or Commandant\" means the head of a College or Institute under the\nUniversity ;\n(h)     \"Director of Examinations and Academics\" means the chief coordinator of\nexaminations, academics and research of the University ;\n(i)     \"Director Finance\" means the Director Finance of the University\n(j)     \"Director General\" means the head of the directorate of armed forces of\nPakistan wherever such post exists or head of an institute or department under\nthe University ;\n(k)     \"institute\" means an institute constituted or affiliated with the University ;\n(l)    \"Patron-in-Chief\" means Patron-in-Chief of the University ;\n(m)    \"prescribed\" means prescribed by regulations ;\n(n)    \"Pro-Chancellor\" means the pro-Chancellor of the University appointed under\nsection 9 ;\n(o)    \"Rector\" means Rector of the University appointed under section 10 ;\n(p)    \"Registrar\" means the Registrar of the University ;\n(q)    \"regulations\" means Regulations made under this Act ;\n(r)    \"University\" means the National University of Sciences and Technology\nestablished under this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment and incorporation of the University",
      "content": "(1) There shall be established a\nUniversity to be called the National University of Sciences and Technology consisting of—\n(a)    the Chancellor, the Pro-Chancellor, the Board, the Rector, the Committee,\nthe Academic Council, the Deans, Commandants and the Director Generals ;\n(b)    the members of such other councils, committees and advisory bodies as the\nBoard may establish or authorise from time to time ;\n(c)    the members of the faculties and students of the colleges and institutes ; and\n(d)    such other officers and members of the staff as may be specified by the\nBoard from time to time.\n(2) The University shall be a body corporate by the name of the National University of\nSciences and Technology, having perpetual succession and a common seal, with power, among\nothers, to acquire, hold and dispose of any property and shall by the said name sue and be sued.\n(3) The principal seat of the University shall be at Islamabad, and it may set up any number\nof colleges and institutes at such places in Pakistan as the Board may determine."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Purposes, powers and functions of the University",
      "content": "(1) The purposes of the University\nshall be the promotion and dissemination of knowledge and technology and to provide for\ninstruction, training, research, demonstration and service in such branches of learning as the Board\nmay deem fit.\n(2) The University shall be a fully autonomous body with freedom to govern its academic and\nadministrative functions in order to achieve its objectives, in general and, in particular, freedom to—\n(a)    determine courses of study in engineering, sciences and technology and such\nother branches of learning as it may determine ;\n(b)    select and examine students ;\n(c)    award degrees, diplomas, certificates and other academic distinctions ;\n(d)    pursue and coordinate research ;\n(e)    affiliate itself or associate with other institutions, and establish faculties\nin Pakistan or abroad for better discharge of its function and responsibilities ;\n(f)    decide teaching methods and strategies in order to ensure the most effective\neducational and research programmes;\n(g)    use the financial and other resources allocated to it for the execution of its\nfunctions ;\n(h)    confer in the manner prescribed honourary degrees or other distinctions\non persons approved by the Board for the purpose ;\n(i)   provide for such instructions for persons not being students of the University as\nit may determine, and to grant certificates and diplomas to such persons ;\n(j)   confer degrees on persons who have carried on independent research under\nprescribed conditions ;\n(k)   accept the examinations passed, and the periods of study spent, by students of\nthe University at other universities and places of learning as equivalent to such\nexaminations and periods of study in the University as it may determine, and to\nwithdraw such acceptance ;\n(l)   institute Professorship, Associate Professorship, Assistant Professorships\nResearch Associationships and other posts, and to make appointment thereto ;\n(m)   create posts for teaching, research, extension, administration and other related\npurposes and to appoint persons thereto ;\n(n)   institute and award fellowships, scholarships, exhibitions, bursaries, medals and\nprizes under prescribed conditions ;\n(o)   establish institutes, faculties, libraries, laboratories, workshops, museums and\nother centres of learning for the development of teaching and research and to\nmake such arrangements for their maintenance, management and\nadministration as it may determine ;\n(p)   make provisions for research and advisory services and with these objects to\nenter into arrangements with other institutions or with public bodies within\nPakistan and abroad under prescribed conditions ;\n(q)   enter into, carry out, very or cancel contracts ;\n(r)   receive and manage property transferred and grants, bequests, trusts, gifts,\ndonations, endowments and other contributions made to it and to invest any\nfunds representing such property, grants, bequests, trusts, gifts, donations,\nendowments or contributions and to convert one kind of property into other, in\nsuch manner as it may deem fit ;\n(s)   provide for the printing and publication of research and other works ;\n(t)   authorise and agree when required by the colleges to the mobility of qualified\nstaff among universities, research organisations and the Government or\ncorporate bodies, provided that the rights and privileges of the staff under this\narrangement shall be protected ; and\n(u)   do all such other acts and things, whether incidental to the powers aforesaid or\nnot, as may be requisite in order to further its objects as a place of education,\nlearning and research.\n(3) The principal teaching facilities of the University shall consist of the constituent colleges\nand institutes and such other colleges and institutes as may be determined by the Board from time to\ntime.\n(4) The colleges and institutes referred to in sub-section (3) that are in existence at the\ncommencement of this Act shall continue to function under their existing administrative and\nfinancial arrangements:\nProvided that the examination and other academic activities, including research shall be\nsubject to coordination and supervision by the University.\n(5) The University may, with the approval of the Board, provide facilities to the\nrepresentatives of the University Grants Commission and the Pakistan Engineering Council or such\nsimilar relevant organisations for visitation to enable them to verify that appropriate academic\nstandards are being maintained by the University."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. University to be open to all classes, creeds, etc. The University shall be open to all",
      "content": "persons of either sex of whatever religion, race, class, creed, colour or domicile who qualify for\nadmission to the courses of study offered by the University based on die criteria and policy\ndetermined by the Board, and no such person shall be denied the privileges of the University on the\nground only of sex, religion,race, class, creed, colour or domicile."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Patron",
      "content": "in-Chief. The President of Pakistan shall be the Patron-in-Chief of the University\nand shall preside over all meetings and convocations of the University, whenever present."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Officers of University. The following shall be officers of the University, namely",
      "content": "(a)     the Chancellor ;\n(b)     the Pro-Chancellor ;\n(c)     the Rector ;\n(d)     the Dean or Commandant ;\n(e)        the Director General of the institutes ;\n(f)        the Registrar ;\n(g)        the Director of Examination and Academics ;\n(h)        the Director Finance ; and\n(i)        such persons as may be prescribed to be an officer by the Board."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. The Chancellor",
      "content": "(1) The Prime Minister of Pakistan shall be the Chancellor of the\nUniversity.\n(2) The Chancellor shall, in the absence of Patron-in-Chief, whenever present, preside over at\n(3) Every proposal to confer an honorary degree shall be subject to confirmation by the\nChancellor.\n(4) If the Chancellor is satisfied that the proceedings or orders of any authority are not in\naccordance with the provisions of this Act, the statutes, regulations or the rules, he may, after calling\nupon such authority to show cause in writing, annual such proceedings or orders."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. The Pro",
      "content": "Chancellor.—(1) The Pro-Chancellor shall be appointed by the Chancellor for\nsuch period and on such terms and conditions as the Chancellor may determine.\n(2) At any time when the office of Chancellor is vacant, or the Chancellor is absent or is\nunable to perform the functions of his office due to any cause, the Pro-Chancellor shall act for him.\n(3) The Pro-Chancellor shall perform such other functions as may be entrusted to him by the\nChancellor."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. The Rector",
      "content": "(1) The Board shall appoint a person having 1[qualifications and\nexperience as prescribed by the Board] necessary to ensure the disciplined educational environment\nvisualised for the University to be the Rector.\n(2) A Rector shall hold office for a term of four years and shall be eligible for reappointment\nfor a similar term or such shorter terms as the Board may decide and his other terms and conditions\nof service shall be such as the Board may determine.\n(3) The Rector shall be the chief executive of the University in all the fields of academics and\nadministrations, and shall have over all responsibility for the direction, organisation, administration\nand programmes of the University in accordance with the guidelines and general policies\nformulated by the Board and for the implementation of the decisions, and policies of the Board ; in\nparticular, he shall without prejudice to the provisions of sub-section (4) of section 4,—\n1\nSubs. by Act No. XXIII of 2016, s.2.\n(a)     oversee, monitor and supervise all academic activities, including examinations\nand applied research to ensure that proper academic standards are maintained ;\n(b)     exercise administrative control over the academic and administrative staff'\nemployed by the University including their recruitment ;\n(c)     submit the plans of work and budget estimates of the University for the\napproval of the Board ;\n(d)     direct the activities connected with execution of programmes for instruction,\ntraining, research, demonstration and service, and authorise expenditure\nprovided for in the budget as approved by the Board ;\n(e)     make appointments of teachers, officers and members of the staff of the\nUniversity and other persons on regular basis in accordance with the policies\nand procedures approved by the Board so as to ensure the highest intellectual\nand moral qualities in the persons appointed ;\n(f)     appoint, subject to approval of the Board, on contract, teachers, officers and\nmembers of the staff of the University and such other persons as may be\nnecessary for a period not exceeding two years ;\n(g)     submit to the Board, in accordance with the rules of procedure framed by it,\nreports on the activities of the University and the execution of the plans of\nworks ;\n(h)     prepare and revise from time to time statutes and regulations with the approval\nof the Board for the efficient and effective operations of the University ; and\n(i)     provide the necessary service to the Board."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Authorities. The following shall be the authorities of the University, namely ;",
      "content": "(a)     the Board of Governors ;\n(b)     the Executive Committee ;\n(c)     the Academic Council ;\n(d)     the Faculty Board of Studies ; and\n(e)     such other authorities as may be constituted by the Board."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. The Board of Governors",
      "content": "(1) The general supervision and control of the affairs of the\nUniversity, and the power to lay down the policies of the University, shall vest in a Board of\nGovernors consisting of—\n(a)     the Chief of the Army Staff, who shall be the ex-officio Chairman of the Board\n;\n(b)     General Officers of General Headquarters as designated by the Chief of the\nArmy Staff ;\n(c)     Director General, Joint Staff Headquarters ;\n(d)     the Rector ;\n(e)     Secretary, Ministry of Defence, Government of Pakistan ;\n(f)     Secretary, Ministry of Education, Government of Pakistan;\n(g)     Secretary, Ministry of Finance, Government of Pakistan ;\n(h)     Secretary, Ministry of Science and Technology, Government of Pakistan ;\n(i)     Chairman, University Grants Commission ; and\n(j)     Chairman, Pakistan Engineering Council.\n(2) Registrar will be the member and Secretary of the Board, but shall not be entitled to vote.\n(3) The chancellor may, in consultation with the Board, appoint any other person, including a\nscientist or educationist, as members of the Board.\n(4) The existence of a vacancy in, or defect in the constitution of, the Board, shall not\ninvalidate any act or proceedings of the Board.\n(5) The Board may direct any officer, member of faculty or any other person to be in\nattendance during all or any of its meetings.\n(6) Without prejudice to the generality of the provisions of sub-section (1), the Board shall\nexercise and perform the powers and functions hereinafter specified, namely :—\n(a)       to hold, control and administer the property, funds and resources of the\nUniversity and to borrow or raise money for the purposes of the University\nupon such security as may be required ;\n(b)     to formulate or approve the principles, policies and plans governing the\nactivities and operations of the University so as to ensure that the academic\nstaff enjoy academic freedom in their research and educational work ;\n(c)     to prepare or have prepared and revised from time to time rules and\nregulations for the efficient and effective operation of the University ;\n(d)     to review and approve the creation of any standing component of the\nUniversity, such as faculties, and councils and other administrative bodies\nnecessary to assist or improve the working of the University ;\n(e)     to approve the plans of work and annual budget of the University submitted by\nthe Director Finance, the budget being based on the budget prepared and\nsubmitted by the constituent or affiliated college or institutes ;\n(f)     to require of, and consider reports submitted by the officers of the University\nrelating to the activities of the University and the execution of the plans of\nwork and to direct the Rector to submit reports relating to any matter specified\nby the Board ;\n(g)     to create such academic or administrative posts as it may consider necessary\nfor the purposes of the University and to approve appointments to such of\nthese posts as it may specify, including the posts of deans, directors,\nprofessors, associate professors, assistant professors, lecturers and\ndemonstrators ;\n(h)     to select and appoint, all administrative and academic staff of the University ;\n(i)     to fix the scales of pay, allowances and honoraria for all the staff, both\nacademic and administrative, commensurate with their qualification and\nexperience, in order to attract the best talent from within and outside Pakistan\nfor the University;\n(j)     to undertake responsibility for the financial integrity of the University,\nincluding responsibility for ensuring effectiveness of its future operations and\ntheir continuity and the preservation of the autonomy of the University ;\n(k)     to approve all affiliations and other similar arrangements through which\ncolleges, institutions or individuals may become associated with the University\nwithin Pakistan and abroad ;\n(l)     to appoint from amongst its members such committees or sub-committees as\nmay in the opinion of the Board lead to its more efficient and effective\noperations ; and\n(m)     to take all such initiative as it may consider necessary or desirable for the\nefficient and effective management and functioning of the University.\n(7) The Board shall lay down its own rules of procedures and may amend or modify them\nfrom time to time.\n(8) The Board may delegate all or any of its powers and functions to a committee,\nsub-committee or to the Rector."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Meetings of the Board, etc",
      "content": "(1) The Board shall meet at least twice during a year for\nregular or scheduled meetings and may meet at any other time at which a special meeting thereof may\nbe called by the chairman of the Board.\n(2) Not less than ten clear days' notice of a special meeting shall be given to the members\nof the Board and the agenda of the meeting shall be restricted to the matters specified in the agenda\nto be annexed to such notice.\n(3) The quorum for a meeting of the Board shall not be less than fifty per cent of its members."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Executive Committee",
      "content": "(1) The Executive Committee shall comprise the following,\nnamely:—\n(a)     the Rector, who shall be the chairman of the Executive Committee ;\n(b)     Director General, Engineers ;\n(c)     Signal Officer-in-Chief ;\n(d)     Director General, Electrical and Mechanical Engineers ;\n(e)     Director General, Military Training ;\n(f)     Director General, National Institute of Transportation ;\n(g)     Director of Examination and Academics ; and\n(h)     the Registrar, who shall be Secretary of the Committee.\n(2) The Board may include Directors Generals Training, Pakistan Navy and Pakistan Air\nForce or any other person as members of the Executive Committee as it may deem appropriate.\n(3) Deans and Commandants shall, unless otherwise intimated, attend the meetings of the\nExecutive Committee.\n(4) The Executive Committee shall deliberate on various aspects related to the functioning of\nthe University and recommend specific measures to the Board for approval and shall, in particular,—\n(a)     delineate priorities for research ;\n(b)     recommend allocation of training and research funds to the Colleges and\nInstitutes ;\n(c)     guide and direct the Academic Council and Faculty Board of Studies of each\ncollege and institute on all matters relating to the academics, including syllabi\nand duration of various courses ;\n(d)     recommend disciplines for all academic studies in the colleges and institutes\nand help in creation of necessary infrastructure or the same ;\n(e)     help induct highly competent scientific and technical talent into the faculty of\neach College to enhance the quality of education and research ;\n(f)     lay down guidelines for proper and efficient conduct of professional\nexamination at the Colleges or Institutes ;\n(g)     recommend such measures which would foster and enhance interaction and\ncollaboration between the University and the existing national and\ninternational organisations, institutions and research centres and the industrial\nbase ;\n(h)     recommend apportioning of the national research and development budget for\nthe University ;\n(i)     workout and propose affiliation measures with foreign institutions of repute ;\n(j)     decide methods and strategies in order to ensure the most effective scientific\nand technological programmes ;\n(k)     coordinate with relevant Government Ministries, Universities and University\nGrants Commission ;\n(l)     propose statutes to the Board for approval ; and\n(m)     prepare regulations for approval by the Board."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Academic Council",
      "content": "(1) The Academic Council shall comprise the following, namely :—\n(a)     the Rector, who shall be the Chairman of the Academic Council ;\n(b)     the Dean or Commandant, Military College of Engineering ;\n(c)     the Dean or Commandant, Military College of Signal ;\n(d)     the Dean or Commandant, College of Electrical and Mechanical Engineering ;\n(e)     Director General, National Institute of Transportation ;\n(f)     the Dean or Commandants of other colleges and institutes affiliated to the\nUniversity ;\n(g)     representatives from relevant Directorates of the armed forces of Pakistan ;\n(h)     Departmental Heads of each colleges, on as required basis ;\n(i)     any other faculty member, on as required basis; and\n(j)     Director of Examination and Academic who shall be the Secretary of the\nCouncil.\n(2) The Academic Council shall act as an advisory as well as an implementing body for the\ndecisions of the Executive Committee on all matters relating to the conduct of examinations, revision\nand updating of course syllabi, quality of education, duration of all courses including conduct of\npostgraduate classes in specified disciplines.\n(3) The Academic Council shall also help the Rector in evaluating proposing and\ncoordinating research and development projects and respective institutes and colleges."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Faculty Board of Studies",
      "content": "(1) The Faculty Board of Studies of each college shall\ncomprise the following, namely :—\n(a)     Dean or Commandant or Director General, who shall be its Chairman ;\n(b)    Deputy Dean or Deputy Commandant or Deputy Director General ;\n(c)    Heads of the Departments and Directors of colleges and institutes ;\n(d)    selected teaching staff ;\n(e)    representatives from relevant Directorates of the armed forces of Pakistan ;\nand\n(f)    a representative of the University.\n(2) The Faculty Board of Studies shall—\n(a)    implement the decisions of the Board, the Executive Committee and the\nAcademic council on all matters relating to academic standards, examinations\nand research ;\n(b)    ensure feedback of the       implemented      measures     on    research   and\nacademic matters to the Rector; and\n(c)    workout, and report to the Rector details of research funding required."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Council of Regents",
      "content": "(1) The University may set-up a Council of Regents consisting of\nsuch members as the Board may determine."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Academic and administrative staff. The academic and administrative staff of the",
      "content": "University shall be selected with a view to achieving its stated objectives and the basic criteria for\ntheir selection shall be the highest standards of competence, integrity and efficiency."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. University funds audit and accounts",
      "content": "(1) The University shall have a Fund to which\nshall be credited all direct donations, trusts, bequests, endowments, grants, proportionate budget\nfrom the Government, assistance from international agencies, contributions, shares of fee, and\nincome from any other sources and which shall be under the control of the Board.\n(2) The colleges and institutes shall receive their finances from the following sources,\nnamely:―\n(a)    annual budget from their respective service headquarters or ministries ;\n(b)    proportionate share of fees, including examinations fee through the University\nbudget ;\n(c)    any grants from the Governments ;\n(d)    any sale of royalties or publications ; and\n(e)    any assistance from the University Fund as decided by the Board.\n(3) Capital and recurrent expenditure of the University shall be met from the allocation made\nby the Board out of the University Fund.\n(4) No contribution, donation or grant which may directly or indirectly involve any\nimmediate or subsequent financial liability for the University, or which may involve an activity not\nincluded in its programmes for the time being, shall be accepted without prior approval of the Board.\n(5) The accounts of the University shall be maintained in such form and manner as may be\ndetermined by the Board and shall be audited each year within six months of the closing of the\nfinancial year of the University by the Military Accountant General or a Chartered Accountant\nappointed by the Board.\n(6) The accounts, together with the report of the auditor thereon, shall be submitted to the\nBoard for approval.\n(7) The auditor's report shall certify that the auditor has complied with the standards of audit\nand certification laid down by the Institute of Chartered Accountants of Pakistan."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Pension, insurance, gratuity Provident fund and benevolent fund",
      "content": "(1) The\nUniversity shall constitute for the benefit of its officers, teachers and other employees in such\nmanner and subject to such conditions as may be prescribed such pension, insurance, gratuity,\nprovident fund and benevolent fund and other welfare schemes as it may deem fit.\n(2) Where any provident fund has been constituted under this Act, the provisions of the\nProvident Fund Act, 1925 (XIX of 1925), shall apply to such fund as if it were the Government\nProvident Fund."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Statutes",
      "content": "(1) Subject to the provisions of this Act, statutes may be made to regulate or\nprescribe all or any of the following matters, namely :—\n(a)    creation of the institutes and faculties ;\n(b)    service, pension and fringe benefits for university employees and terms and\nconditions of their service ;\n(c)    condition of appointment of Professors Emeritus and award of honorary\ndegrees ;\n(d)    efficiency and discipline of the University employees ; and\n(e)    all other matters required to be regulated by statutes.\n(2) Draft of the statutes shall be proposed by the Executive Committee for approval by the\nBoard which may approve them or refer them back for reconsideration.\n(3) No statute shall be valid until it has been approved by the Board /Chancellor."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Regulations",
      "content": "(1) Subject to the provisions of this Act and the statutes, the Committee\nmay make regulations for all or any of the following matters, namely:—\n(a)     scheme of studies and research, including the duration of courses, number of\nsubjects or papers for examination ;\n(b)     syllabi and courses of study and research programmes leading to degrees,\ndiploma's or certificates ;\n(c)     methodology for selection and admission of students ;\n(d)     conduct and supervision of examination, appointment of examiners and\nscrutiny and tabulation of results ;\n(e)     determination of fees and other charges for admission to various courses ;\n(f)     maintenance of disciplines among students and scheme for their welfare ;\n(g)     institution of fellowships, scholarships, prizes and medals, honorarium and\nother financial assistance to students and research scholars ;\n(h)     conduct of convocations and form of academic costumes ; and\n(i)     all other academic matters which are to be or may be prescribed.\n(2)     The regulations shall be approved by the Board on recommendations of the\ncommittee.\n(3)    No regulation shall be valid until it has been approved by the Board."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Rules. The Executive Committee may make rules for implementation of statutes or",
      "content": "regulations where so required under the statutes or regulations or make rules to regulate any matter\nrelating to the affairs of the University which under this Act are not specifically required to be\nprovided for by the statutes or regulations."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Indemnity and bar of jurisdiction",
      "content": "(1) No suit, prosecution or other legal proceedings\nshall lie against any person or authority for anything which is in good faith done or intended to be\ndone under this Act.\n(2) No decision taken, or act or thing done, by the Chancellor, Pro-Chancellor or the Board\nshall be called in question before any court or other authority."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Act to override other laws. This Act shall have effect notwithstanding anything",
      "content": "contained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Removal of difficulties",
      "content": "(1) If any question arises as to the interpretation of any of the\nprovisions of the Act, it shall be placed before the Board whose decision thereon will be final.\n(2) If any difficulty arises in giving effect to any provision of this Act, the Board may make\nsuch order to direction, not inconsistent with the provisions of this Act, as may appear to it to be\nnecessaryfor the purpose of removing such difficulty.\n(3) Where this Act makes any provision for anything to be done but no provision or no\nsufficient provision has been made as respect the authority by whom, or the time at which, or the\nmanner in which, it shall be done, then, it shall be done by such authority, at such time, or in such\nmanner as the Board may direct."
    }
  ],
  "definitions": [
    {
      "term": "Academic Council",
      "definition": "the Academic Council constituted under section 15 ;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of Governor of the University constituted under section 12 ;",
      "source_provision": "sec2"
    },
    {
      "term": "Chancellor",
      "definition": "the Chancellor of the University ;",
      "source_provision": "sec2"
    },
    {
      "term": "college",
      "definition": "a college constituted or affiliated with the University ;",
      "source_provision": "sec2"
    },
    {
      "term": "constituent colleges and institutes",
      "definition": "the Military College of Engineering, Risalpur, the Military College Signals Rawalpindi, the College of Electrical and Mechanical Engineering Rawalpindi and the National Institute of Transportation and includes any other college or institute designated as such by the Board ;",
      "source_provision": "sec2"
    },
    {
      "term": "Committee",
      "definition": "the executive committee of the University constituted under section 14 ;",
      "source_provision": "sec2"
    },
    {
      "term": "Dean or Commandant",
      "definition": "the head of a College or Institute under the University ;",
      "source_provision": "sec2"
    },
    {
      "term": "Director of Examinations and Academics",
      "definition": "the chief coordinator of examinations, academics and research of the University ;",
      "source_provision": "sec2"
    },
    {
      "term": "Director Finance",
      "definition": "the Director Finance of the University",
      "source_provision": "sec2"
    },
    {
      "term": "Director General",
      "definition": "the head of the directorate of armed forces of Pakistan wherever such post exists or head of an institute or department under the University ;",
      "source_provision": "sec2"
    },
    {
      "term": "institute",
      "definition": "an institute constituted or affiliated with the University ;",
      "source_provision": "sec2"
    },
    {
      "term": "Patron-in-Chief",
      "definition": "Patron-in-Chief of the University ;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by regulations ;",
      "source_provision": "sec2"
    },
    {
      "term": "Pro-Chancellor",
      "definition": "the pro-Chancellor of the University appointed under section 9 ;",
      "source_provision": "sec2"
    },
    {
      "term": "Rector",
      "definition": "Rector of the University appointed under section 10 ;",
      "source_provision": "sec2"
    },
    {
      "term": "Registrar",
      "definition": "the Registrar of the University ;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "Regulations made under this Act ;",
      "source_provision": "sec2"
    },
    {
      "term": "University",
      "definition": "the National University of Sciences and Technology established under this Act.",
      "source_provision": "sec2"
    }
  ]
}
