{
  "id": "pk-national-vocational-and-technical-training-commission-navttc-act-2011",
  "type": "statute",
  "title": "National Vocational and Technical Training Commission (NAVTTC) Act, 2011",
  "title_en": "National Vocational and Technical Training Commission (NAVTTC) Act, 2011",
  "short_name": "NVATT",
  "status": "in_force",
  "issued_date": "2011-06-24",
  "in_force_date": "2011-06-24",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apqVaA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Vocational and Technical Training Commission (NAVTTC) Act, 2011 (XV of 2011) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the National\nVocational and Technical Training Commission Act, 2011.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force on and from the 28th February, 2011."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act unless there is anything repugnant in the subject or context,—\n(a)     “Board” means the Board established under section 4;\n(b)     “Chairman” means Chairman of the Board;\n(c)    “Commission” means the National Vocational and Technical Training\nCommission established under section 3;\n(d)     “member” means the member of the Board;\n(e)     “prescribed” means prescribed by rules or regulations made under this Act;\n(f)     “regulations” means regulations made under this Act;\n(g)     “rules” means rules made under this Act; and\n(h)    “technical and vocational training” means training in any professional skill,\ntrade, calling or occupation."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Commission",
      "content": "__ (1) As soon as may be after the commencement of\nthis Act, the Federal Government shall, by notification in the official Gazette, establish a\nCommission to be called the National Vocational and Technical Training Commission.\n(2) The headquarters of the Commission shall be at Islamabad and it may establish regional\noffices at such places as it may decide.\n(3) The Commission shall be a body corporate, having perpetual succession and a common\nseal with powers, subject to the provisions of this Act, to hold and dispose of property, both\nmoveable and immovable, and shall by the said name sue and be sued.\n(4) For the purpose of coordination the Commission shall be administratively attached with\nPrime Minister's Secretariat."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Management",
      "content": "(l) The general direction, all matters of policy and administration of the\nCommission and its affairs shall vest in a Board which may exercise all powers, perform all\nfunctions and do all acts and things which may be exercised, performed or done by the Commission.\n(2) There shall be a Chairman of the Board who shall be appointed by the Federal\nGovernment on such terms and conditions as the Federal Government may determine.\n(3) The Board shall be the apex body and shall consist of the following members, namely:—\n(a)   Chairman of the Commission.                          Chairman\n(b)   Secretary, Ministry of Labour, Manpower and\nMember\nOverseas Pakistanis.\n(c)   Secretary, Ministry of Finance.                          Member\n(d)   Secretary, Ministry of Industries, Production\nMember\nand Special Initiatives.\n(e)   Secretary, Capital Administration and\nMember\nDevelopment Division.\n(f)   Secretary of the concerned provincial\nMember\ndepartment.\n(g)   Executive Director.                                      Member\n(h)   Not less than six members from the private\nsector who have experience in the area of skills         Member\ndevelopment and technical training.\n(4) The Executive Director shall also act as Secretary of the Board.\n(5) The Board may co-opt any person as a member of the Board for a specific purpose and for\na specified period.\n(6) The Federal Government may, by notification in the official Gazette, increase or decrease\nthe number of the members of the Board, from time to time, as it deems fit:\nProvided that the total number of members of the Board shall not exceed twenty.\n(7) The Board in discharge of its functions shall be guided by such directions as the Federal\nGovernment may give to it from time to time.\n(8) A member, other than an ex officio member, may, by writing under his hand addressed to\nthe Federal Government, resign his office.\n(9) The Federal Government may, on the recommendation of the Chairman, remove any\nmember, other than an ex officio member, if he has persistently failed to perform the duties assigned\nto him or he has abused his position.\n(10) The Chairman shall, unless he resigns from office earlier, hold office for a period of\nthree years and shall be eligible for re-employment for such term or terms as the Federal Government\nmay determine, provided that the Chairman shall cease to hold office on attaining the age of sixty-\nfive years or expiry of the term, whichever is earlier.\n(11) A member, other than an ex officio member, shall, unless he resigns from office earlier,\nhold office for a period of three years and shall be eligible for re-appointment for such term or terms\nas the Federal Government may determine, provided that the member shall cease to hold office on\nattaining the age of sixty-five years or the expiry of the term, whichever is earlier."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Meeting of the Board",
      "content": "(1) The meetings of the Board shall be held as and when\nrequired, but once at least in a quarter, at the time and place as the Chairman of the Board may\ndetermine.\n(2) The meetings of the Board shall be conducted in accordance with such procedure as may\nbe specified by the Board.\n(3) Half of the total membership of the Board shall constitute the quorum for the meeting.\n(4) The decisions of the Board shall be taken by the majority of the members present and, in\ncase of a tie, the person presiding over the meeting shall have a casting vote.\n(5) All orders, determinations and decisions of the Board shall be reduced in writing together\nwith a record of the discussions held in the meeting."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Functions of the Commission",
      "content": "The functions of the Commission shall be to—\n(a)    devise and review policies and evolve strategy relating to human resource\ndevelopment with a focus on vocational and technical training and\nemployment in general;\n(b)    prepare for approval of the Board, national training plans, programmes and\nprojects in coordination with stakeholders for the expansion of vocational and\ntechnical training infrastructure in the country;\n(c)    formulate policies for capacity building in the field of vocational and technical\ntraining;\n(d)    develop national occupational skill standards, curricula and trade testing\ncertification systems for all sectors in which vocational and technical training\nis imparted;\n(e)    prescribe conditions under which institutions in the public and private sector\nmay be established and operated;\n(f)   facilitate skill development and employment generation through enhancement\nof public-private partnership;\n(g)   improve quality of training of instructors through skill up-gradation\nprogrammes;\n(h)   regulate affiliation of establishments and institutions offering vocational and\ntechnical training;\n(i)   issue regulations for licensing of Federal establishments and institutions;\n(j)   organize workshops seminars symposia and panel discussions in respect of\nemployment and training issues;\n(k)   establish national and international linkages with organizations of repute to\nmake national programmes credible and promote marketing of manpower;\n(l)   establish an internationally acceptable system of accreditation for vocational\nand technical training;\n(m)   coordinate with the Provincial Governments in the field of vocational and\ntechnical training;\n(n)   review existing laws and regulations on vocational and technical training and\nrecommend appropriate legislation;\n(o)   carry out training needs assessment survey;\n(p)   prepare and maintain a data bank of institutions and establishments imparting\nvocational and technical training and directory of their graduates and their\nplacements;\n(q)   suggest innovative programmes for promotion of vocational and technical\ntraining among females, challenged and neglected sections of society;\n(r)   suggest performance evaluation parameters for vocational and technical\ntraining programmes and conduct performance evaluation of technical and\nvocational institutes;\n(s)   bridge the widening gap between planning and implementation for improving\naccess, delivery and quality of vocational and technical training by applying\nnew instructional and communication technologies;\n(t)   suggest ways and means for effective coordination and linkage between\nvocational and technical training and industry, business and commerce to\nmake vocational and technical training relevant and responsive to market\nneeds;\n(u)   formulate and recommend strategies for pre-service and in-service training of\nvocational and technical training staff; and\n(v)     develop code of conduct for vocational and technical training institutions and\nstaff for meeting quality assurance standards."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Powers of the Commission",
      "content": "The Commission may—\n(a)     take measures, including the allocation of funds, for the establishment of\nscholarships and stipends for students and training of teachers abroad and\nwithin the country;\n(b)     establish an endowment fund for vocational and technical training with\ncontributions from government as well as non-governmental resources;\n(c)     allocate funds for infrastructure development, training of faculty as an\nincentive to improve quality of vocational and technical training;\n(d)     set up such administrative and technical committees, working groups, skill\ndevelopment councils, trade testing boards or other such bodies and entrust\nthem such functions as it may consider necessary;\n(e)     regulate quality control for implementation of skills standards, syllabi, trade\ntesting and certification of vocational and technical training institutions;\n(f)     advise the Federal Government and Provincial Governments on proposals for\ngrant of diplomas and Certificates by vocational and technical training\ninstitutions;\n(g)     determine equivalence and recognition of diplomas, certificates awarded by\ninstitutions within the country and abroad; and\n(h)     approve projects up to a ceiling fixed by the Federal Government for\nDepartmental Development Working Party (DDWP)."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Executive Director of the Commission",
      "content": "(1) There shall be an Executive Director of the\nCommission appointed by the Federal Government on such terms and conditions as it may\ndetermine.\n(2) The Executive Director shall be the head of the Secretariat of the Commission. The\nSecretariat shall act as the executing wing of the Commission and shall be responsible for\nimplementation of all the orders, decisions, directives and policies of the Commission."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Delegation of Power",
      "content": "The Board may delegate all or any of its powers to its Executive\nDirector or any officer of the Commission, as the case may be."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Committee",
      "content": "(1) The Commission may set up as many committees and working groups\nas may be required to effectively perform its functions.\n(2) The composition and functions of a committee and working group shall be such as the\nCommission may determine."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Appointment of officers and staff",
      "content": "(1) The Commission may, subject to general or\nspecial orders, as the Federal Government may give to it from time to time and subject to such rules\nas may be made in this behalf, create posts, appoint such officers, advisers, consultants and\nemployees as it considers necessary for the efficient performance of its functions on such terms and\nconditions as may be prescribed.\n(2) The Commission shall make rules for the recruitment of its employees."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Funds",
      "content": "(l) The Federal Government shall provide funds to the Commission for meeting\nall expenses required for discharging its functions.\n(2) The Federal Government may provide annual grants to the Commission for carrying out\nits functions.\n(3) All receipts of the Commissions from any source whatsoever shall be credited to a fund to\nbe called National Vocational and Technical Training Commission Fund (NAVTTC Fund) and shall\nvest in the Commission with power to manage and operate.\n(4) The mechanism for operation of the Fund shall be prescribed by the Commission with the\nprior approval of the Federal Government."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Submission of reports",
      "content": "The Commission shall submit an annual report to the Federal\nGovernment in respect of its activities or as and when required by the Federal Government."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Audit and accounts",
      "content": "(1) The Commission shall maintain its accounts of receipts and\nexpenditure in such manner as may be prescribed by the Controller General of Accounts.\n(2) The accounts of the Commission shall be audited every year by the Auditor-General of\nPakistan.\n(3) The Commission may also get its accounts audited by a chartered accountants firm to be\nappointed with the approval of the Board."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Employees of the Commission to be public servants",
      "content": "Every employee of the\nCommission and every person acting or purporting to act under this Act and the rules and regulations\nmade thereunder shall be deemed to be a public servant within the meaning of section 21 of the\nPakistan Penal Code, 1860 (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Indemnity",
      "content": "No suit, prosecution or other legal proceedings shall lie against any person\nexercising the powers, or for anything done in good faith or intended to be done, under this Act."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Power to make rules",
      "content": "The Federal Government may make rules for carrying out the\npurposes of this Act."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Power to make regulations",
      "content": "The Commission may, with the approval of the Federal\nGovernment, make regulations, not inconsistent with this Act and the rules, for carrying out the\npurposes of this Act."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Removal of difficulties",
      "content": "lf any difficulty arises in giving effect to any of the provisions\nof this Act, the Federal Government may make such order, not inconsistent with the provisions of\nthis Act, for removing the difficulty."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Act to override other laws",
      "content": "The provisions of this Act shall have overriding effect\nnotwithstanding anything to the contrary contained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Repeal and savings",
      "content": "On the commencement of this Act,—\n(a)        the Cabinet Division's Notification No.4-16/2005-Min-I, dated the 30th\nDecember, 2005, shall stand rescinded;\n(b)        the National Vocational and Technical Education Commission constituted\nunder the aforesaid notification shall stand dissolved and all its assets,\nliabilities, members and staff shall become assets, liabilities, members and\nstaff of the Commission established under this Act; and\n(c)        notwithstanding anything contained herein before, all orders made, actions\ntaken, vesting orders or notifications issued under any of the powers conferred\nor vested under the Cabinet Division's Notification No.4-16/2005-Min-I, dated\nthe 30th December, 2005 shall be deemed always to have been lawfully and\nvalidly made, taken, issued and vested under the provision of this Act.\n1\n[22. Repeal of National Training Ordinance, 1980 (IX of 1980).—(1) On the\ncommencement of National Vocational and Technical Training Commission (Amendment) Act,\n2021, the National Training Ordinance, 1980 (IX of 1980) shall stand repealed.\n(2) On the repeal of the National Training Ordinance, 1980 (IX of 1980) under sub-section\n(1),—\n(a)        The National Training Board shall stand dissolved; and\n(b)        all assets, rights, functions, powers, authorities and privileges and all property,\nmovable and immovable, cash and bank balance, reserve funds, investments\nand all other interests and rights in, or arising out of, such property and all\ndebts, liabilities and obligations of whatever kind of the National Training\nBoard subsisting immediately before its dissolution shall stand transferred to\nand vest in the Commission."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Abolition of National Training Bureau.⸺On the commencement of the National",
      "content": "Vocational and Training Commission (Amendment) Act, 2021, the Manpower Division’s\nNotification No. 1-12(10)/76-Estt. Dated the 28th May, 1977 and all other Notifications and orders\nissued prior or subsequent to it, relating thereto, shall stand rescinded and,⸺\n(a)        all assets, rights, functions, powers, property, movable and immovable, cash\nand bank balance, reserve funds, investments of the Bureau and all other\ninterests and rights in, or arising out of, such property and all debts, liabilities\nand obligations of the Bureau shall stand transferred to and vest in the\nCommission; and\n(b)\nall employees of the Bureau shall, notwithstanding anything contained in any\nlaw, agreement, deed, document or other instruments, stand transferred to the\nCommission in accordance with the terms and conditions of service as\napplicable to them, and no officer or other employee whose services are so\ntransferred shall be entitled to any compensation because of such transfer:\n_________________________________________________________________________________\n1\nAdded section 22 and 23 by Act, XXXVIII of 2021, s. 2\nProvided that such employees shall, within ninety days of the\ncommencement of the National Vocational and Technical Training\nCommission (Amendment) Act, 2021, exercise an irrevocable option either to\ncontinue on the existing terms and conditions as civil servants or to opt to the\nemployment of the Commission.]"
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Board established under section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "Chairman of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the National Vocational and Technical Training Commission established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "the member of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules or regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "technical and vocational training",
      "definition": "training in any professional skill, trade, calling or occupation.",
      "source_provision": "sec2"
    }
  ]
}
