{
  "id": "pk-national-zakat-foundation-merger-in-bait-ul-mal-ordinance-2001",
  "type": "statute",
  "title": "National Zakat Foundation (Merger in Bait-ul-Mal) Ordinance, 2001",
  "title_en": "National Zakat Foundation (Merger in Bait-ul-Mal) Ordinance, 2001",
  "short_name": "NZFIB",
  "status": "in_force",
  "issued_date": "2001-04-05",
  "in_force_date": "2001-04-05",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cp%2BUY2Fw-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of National Zakat Foundation (Merger in Bait-ul-Mal) Ordinance, 2001 (XVIII of 2001) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Transfer etc., of employees of the Foundation",
      "content": "THE NATIONAL ZAKAT FOUNDATION (MERGER IN THE\nBAIT-UL-MAL) ORDINANCE, 2001\nORDINANCE No. XVIII OF 2001\n[6th April, 2001]\nAn Ordinance to provide for merger of the National Zakat Foundation in the Bait-ul-Mal\nWHEREAS it is expedient to merger of the National Zakat Foundation in Bait-ul- Mal, and for\nmatter connected therewith or ancillary thereto;\nAND WHEREAS the National Assembly and the Senate stands suspended in pursuance of the\nProclamation of Emergency of the fourteenth day of October, 1999 and the Provisional Constitution\nOrder No. 1 of 1999.\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of\nOctober, 1999 and the Provisional-Constitution Order No. 1 of 1999, read with the Provisional\nConstitution (Amendment) Order 9 of 1999, and in exercise of all other powers enabling him in that\nbehalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the\nfollowing Ordinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "_(1) This Order tray be called the National Zakat\nFoundation (Merger in the Bait-ul-Mal) Ordinance, 2001.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_In this Ordinance, unless there is anything repugnant in the subject or\n____\ncontext\n(a)     “appointed day” means the 31st day of March, 2001;\n(b)     “Bait-ul-Mal” means the Bait-ul-Mal established under the Pakistan\nBait-ul- Mal Act, 1991 (1 of 1992); and\n(c)     “Foundation” means the National Zakat Foundation established\nvide Notification No.S.R.0.162(1)/82, dated the 18th February, 1982."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Merger of Foundation in the Bait",
      "content": "ul-Mal.___ (1) Notwithstanding anything contained in\nany other law for the time being in force the in the Bait-ul-Mal and assets, properties, movable and\nimmovable, debts, rights and liabilities of whatever kind to which the Foundation, immediately before\nthe appointed day was entitled or subject shall vest in Bait-ul-Mal and become the property, rights and\nliabilities of the Bait-ul-Mal;\n(2) All contracts, bonds, agreements, power of attorneys, grants and all other instruments of\nwhatever kind subsisting, owed or incurred by the Foundation or to which the Foundation may have\nbeen a party or which relate or connected with the Foundation shall remain in force and effect against\nthe Bait-ul-Mal as they were before the appointed day against the Foundation as if instead of\nFoundation the Bait-ul-Mal had been a party thereto.\n(3) All suits, appeals or other legal proceedings of whatever nature by or against or relating to\nthe Foundation which shall be pending on the appointed day in any Court, Tribunal or other\nauthority shall be continued, prosecuted and in force in the same manner and to the same would have\nbeen continued, prosecuted or enforced, by Foundation as if this Ordinance would not have been\npromulgated, against the Bait-ul-Mal and the same shall not abate, be discontinued any way prejudiced\nor affected by the provisions of this Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "appointed day",
      "definition": "the 31st day of March, 2001;",
      "source_provision": "sec2"
    },
    {
      "term": "Bait-ul-Mal",
      "definition": "the Bait-ul-Mal established under the Pakistan Bait-ul- Mal Act, 1991 (1 of 1992); and",
      "source_provision": "sec2"
    },
    {
      "term": "Foundation",
      "definition": "the National Zakat Foundation established vide Notification No.S.R.0.162(1)/82, dated the 18th February, 1982.",
      "source_provision": "sec2"
    }
  ]
}
