{
  "id": "pk-naturalization-act-1926",
  "type": "statute",
  "title": "Naturalization Act, 1926",
  "title_en": "Naturalization Act, 1926",
  "short_name": "Naturalization Act, 1926",
  "status": "in_force",
  "issued_date": "1926-02-19",
  "in_force_date": "1926-02-19",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap6b-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Naturalization Act, 1926 (VII of 1926) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.⸻(1) This Act may be called the 2[*]",
      "content": "Naturalization Act, 1926.\n1\n[(2) It extends to the whole of Pakistan.]\n(3) It shall come into force on such date as the 3[Federal Government] may, by notification in\nthe 4[official Gazette], appoint."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.⸻In this Act, unless there is anything repugnant in the subject or context,⸻",
      "content": "5\n(a)            [*     *                     *                     *                *            *]\n(b)        “certificate of naturalization” means a certificate of naturalization granted\nunder this Act; and\n1\n[(c) “minor” means, notwithstanding anything in the Majority Act, 1875 (IX of\n1875), any person who has not completed his age of twenty-one years.]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Grant of certificate of naturalization",
      "content": "_(1) 4[The 6[Director General, Immigration and\nPassports]] may grant a certificate of naturalization to any person who makes an application in this\nbehalf and satisfies 4[the 6[Director General, Immigration and Passports]]___\n1\nSubs. by Act No. XXIII of 1951, ss. 2, 3 and 4.\n2\nOmitted by the Adaptation of Central Acts and Ordinances Order, 1949 (O. No. 4 of 1949).\n3\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. 4 of 1975), Art. 2 and Table.\n4\nSubs. by the Government of India (Adaptation of Indian Laws) Order, 1937.\n5\nOmitted by Act No. LXI of 1952, s. 2.\n6\nSubs. by Act No. XVI of 2025, s.2.\n(a)       that he is not a minor;\n1\n[(b) that he is neither a citizen of Pakistan nor a subject of any state of which a\ncitizen of Pakistan is prevented by or under any law from becoming a subject\nby naturalisation;]\n2\n[(c)   that he has resided in Pakistan throughout the period of twelve months\nimmediately preceding the date of the application, and has, during the seven\nyears immediately preceding the said period of twelve months, resided in\nPakistan for a period amounting in the aggregate to not less than four years;]\n(d)        that he is of good character;\n(e)       that he has an adequate knowledge of a language which has been declared by\n3\n[the 4[Federal Government]] by notification in the 3[official Gazette], to be\n3\n[one of the principal vernaculars of 6[Pakistan]] ; and\n(f)        that he intends, if the application is granted, to reside in 5[Pakistan] or to enter\nor continue in the service of the 6[State] 7[in Pakistan]:\nProvided that nothing in clause (c) or clause (f) shall apply in the case of a woman who was a\n3\n[citizen of Pakistan] previously to her marriage to a person not a 3[citizen of Pakistan] and whose\nhusband has died or whose marriage has been dissolved.\n(2) Nothing in this section shall be deemed to prevent the grant of a certificate of\nnaturalization to any person to whom a certificate of naturalization has been issued under the Indian\nNaturalization Act, 1852 (XXX of 1852)."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Contents and form of application",
      "content": "_(1) Every application for a certificate of\nnaturalization of shall be in writing and shall state, to the best of the knowledge and belief of the\napplicant,___\n(a)        his age;\n(b)        his place of birth;\n(c)        his place of residence;\n(d)        his profession, trade, or occupation;\n1\nSubs. by Act No. LXI of 1952, s. 3.\n2\nSubs. by Act No. XLIV of 1957, s. 2.\n3\nSubs. by the Government of India (Adaptation of Indian Laws) Order, 1937.\n4\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table.\n5\nSubs. by Act No. XXIII of 1951, s. 5.\n6\nSubs. by the Central Laws (Adaptation) Order, 1961 (P. O. No. 1 of 1961), Art 2 and Sch. (with effect from the 23rd March, 1956).\n7\nSubs. by the Adaptation of Central Acts and Ordinances Order, 1949 (O. No. 4 of 1949), Art. 3 and Sch.\n(e)        full particulars regarding his qualifications in respect of the matters referred to\nin clauses (a) to (f) of sub-section (1) of section 3;\n(f)        whether he has at any time previously applied for the grant of a certificate of\nnaturalization under 1[*    *       *] this Act 2[*     *       *];\n(g)        whether any such application has been rejected;\n(h)        whether any such certificate has been granted to him; and\n(i)        whether any such certificate granted to him has been revoked 3[or whether he\nhas been deprived of his citizenship under the Pakistan Citizenship Act, 1950\n2\n[*      *       *]].\n(2) Every such application shall be signed by the applicant and shall be accompanied by an\naffidavit sworn by him verifying that the statements contained therein are true to the best of his\nknowledge and belief.\n(3) 4[The 5[Director General, Immigration and Passports]] shall satisfy 5[himself] as to the\ntruth of the statements contained in the application, and for this purpose may cause to be made such\nfurther inquiry, if any, and may require such further evidence, if any, either, by affidavit or otherwise\nas 5[he] thinks necessary."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Grant of certificate",
      "content": "_(1) If 4[the 5[Director General, Immigration and Passports]] is\nsatisfied that the applicant is qualified under section 3 for the grant of a certificate of naturalization\nand is otherwise a fit person for the grant of such certificate, 5[he] may grant a certificate reciting the\nqualifications of the applicant for such grant and conferring upon him all the rights, privileges and\ncapacities of naturalization under this Act, except such rights, privileges or capacities, if any, as may\nspecifically be withheld by the certificate.\n(2) Any such certificate may, if the applicant so requests, include the name of any minor child\nof the applicant, not being by birth 2[a citizen of Pakistan] who was born before the date of the\ncertificate and is for the time being resident in 3[Pakistan] and under the control of the applicant; and\nshall grant to any child so included all the rights, privileges and capacities of naturalization under\nthis Act, except such rights, privileges or capacities, if any, as may specifically be withheld by the\ncertificate.\n5\n[(3) An appeal against the orders of Director General, Immigration and Passports under this\nsection shall lie to Secretary of the administrative division and his decision shall be final.]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Oath of allegiance.⸻Every person to whom a certificate of naturalization has been granted shall,",
      "content": "within thirty days, from the date of the grant thereof, take and subscribe the following oath, namely: ___\n“I, A. B., of\ndo hereby swear (or affirm) that I will be faithful and bear true allegiance to 3[the Constitution of Pakistan]”:\n1\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ord. No. XXVII of 1981), s. 3 and Sch. II.\n2\nOmitted and subs. by Act No. LXI of 1952, ss. 4 and 5.\n3\nAdded and subs. by Act No. XXIII of 1951, ss. 6, 7 and 8.\n4\nSubs.by the Government of India (Adaptation of Indian Laws) Order, 1937.\n5\nSubs. by Act No. XVI of 2025, ss.3 and 4.\nProvided that 1[the 2[Secretary of the administrative division]] may extend the time allowed under this\nsection in any case in which 2[he] is satisfied that failure to take and subscribe the oath within that time was\ndue to sufficient cause.\n3\n[7. Effect of grant of certificate and taking of oath.⸻(1) No certificate of naturalisation shall have effect until\nthe person to whom it is granted has taken and subscribed the oath prescribed by section 6, but upon the taking and subs-\ncribing of such oath such person, and any child of any such person who has been included in the certificate under\nsub-section (2) of section 5, shall be deemed to be citizens of Pakistan and be entitled to all the rights,\nprivileges and capacities of a citizen of Pakistan born within Pakistan, except such rights, privileges or\ncapacities, if any, as may have been withheld from them respectively by the certificate, and shall within\nPakistan be subject to all the obligations, duties and liabilities of a citizen of Pakistan ; and the wife of any\nsuch person to whom a certificate of naturalisation is granted after the commencement of the Indian Natura-\nlization (Amendment) Act, 1935, shall, if not already a citizen of Pakistan, in like manner be so deemed and\nbe so entitled and so subject, if within one year, or such longer period as the 2[Secretary of the administrative\ndivision] may in special circumstances allow, from the date of the taking and subscribing of such oath by her\nhusband, she makes to the 2[Secretary of the administrative division] a declaration that she desires to be\ndeemed to be a citizen of Pakistan, and if she is an alien as defined in the Pakistan Citizenship Act, 1951,\nobtains a certificate of domicile under that Act, and takes and subscribes the oath prescribed by section 6 of\nthis Act.\n(2) When the person to whom a certificate of naturalisation has been granted has taken and subscribed\nthe oath prescribed by section 6, any wife thereafter married by, and any child thereafter born to, such person\nshall, if she or he is not a citizen of Pakistan and if such person aforesaid at the date of the marriage or birth,\nas the case may be, retains any rights, privileges or capacities of a citizen of Pakistan under this Act, be\nentitled, subject, in the case of a wife, to her making to the 4[Federal Government] a declaration as provided in\nsub-section (1) and, if necessary, upon obtaining the certificate of domicile and making and subscribing the\noath as further provided in that sub-section, to the same rights, privileges and capacities, and be subject to the\nsame obligations, duties and liabilities, to which such person aforesaid was at that date entitled and subject.]"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Revocation of certificate",
      "content": "_(1) 1[Where the 2[Secretary of the administrative division]] is satisfied\nthat a certificate of naturalization granted under this Act 5[* * *]] was obtained by false representation or fraud\nor by concealment of material circumstances, or that the person to whom the certificate has been granted has\nshown himself by act or speech to be disaffected or disloyal to 6[Pakistan], 1[the 2[Secretary of the\nadministrative division]] shall, by order in writing, revoke the certificate.\n(2) Without prejudice to the foregoing provisions, 1[the 2[Secretary of the administrative division]]\nshall, by order in writing, revoke such a certificate of naturalization as aforesaid in any case in which 2[he] is\nsatisfied that the person to whom the certificate was granted___\n(a)        has, during any war in which 6[Pakistan] is engaged unlawfully traded or\ncommunicated with the enemy, or with a subject of an enemy state, or been\nengaged in, or associated with, any business which is to his knowledge carried\non in such a manner as to assist the enemy in such war; or\n1\nSubs. by the Government of India (Adaptation of Indian Laws) Order, 1937.\n2\nSubs. by Act No. XVI of 2025, ss. 5, 6 and 7.\n3\nSubs. by Act No. LXI of 1952, s. 6.\n4\nSubs. by the Federal Laws Adaptation of Laws Order, 1975(P. O. No. 4 of 1975), Art. 2 and Table.\n5\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ord. No.XXVII of 1981), s. 3 and Sch. II.\n6\nSubs. by Act No. XXIII of 1951, s. 10.\n(b)        has, within five years of the date of the grant of the certificate, been sentenced\nby any Court 1[in Pakistan] 2[*      *      *] to imprisonment for a term of not\nless than twelve months, or to pay a fine of not less than one thousand rupees;\nor\n(c)        was not of good character at the date of the grant of the certificate; or\n3\n[(d)   has since the grant of the certificate been, for a period of not less than seven\nyears, ordinarily resident out of Pakistan otherwise than as a representative of\na citizen of Pakistan, or of a Pakistan firm or company or a Pakistan\ninstitution, or in the service of a Government in Pakistan or in the armed\nforces of Pakistan, and has not maintained substantial connection with\nPakistan; or]\n(e)        remains, according to the law of a state at war with 4[Pakistan], a subject of\nthat state; and that the continuance of the certificate is not conducive to the\npublic good.\n5\n(3)            [*            *             *            *          *           *           *]\n(4) 5 [The 6[Secretary of the administrative division]] may, if 6 [he] thinks fit, before\nmaking an order under this section, refer the case for such inquiry as is hereinafter specified,\nand, in any case to which sub-section (1) or clause (a), clause (c) or clause (e) of sub-section\n(2) applies, 5[the 6[Secretary of the administrative division]] shall by notice given to or sent by\npost to the last known address of, the holder of the certificate, give him an opportunity of\nclaiming that the case be referred for such inquiry, and, if the holder so claims in accordance\nwith the notice, 5[the 6[Secretary of the administrative division]] shall refer the case for inquiry\naccordingly.\n(5) An inquiry under this section shall be held by such person or persons and in such manner\nas 5[the 6[Secretary of the administrative division]] may direct in each case.\n(6) Where a certificate is revoked under this section, the revocation shall have effect from\nsuch date as may be directed by 5[the 6[Secretary of the administrative division]], and thereupon the\ncertificate shall be given up and cancelled; and any person who, without reasonable cause the burden\nof proving which shall lie upon him, fails to give up his certificate within one month from the\naforesaid date, shall be punishable with fine, which may extend to one thousand rupees.\n(7) For the purposes of this section, any person who has acquired any of the rights, privileges\nor capacities of naturalization under sub-section (2) of section 5 or sub-section (2) of section 7 by\nreason of the grant to his parent of a certificate of naturalization, may, after he has attained majority,\nbe deemed to be a person to whom a certificate of naturalization has been granted.\n1\nIns. by the Central Laws Adaptation Order, 1961 (P. O. 1 of 1961), Art. 2 and Sch. (with effect from the 23rd March, 1956).\n2\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ord. No. XXVII of 1981), s. 3 and Sch. II.\n3\nSubs. by Act No. LXI of 1952, s. 7.\n4\nSubs. by Act No. XXIII of 1951, s. 10.\n5\nOmitted and subs. by the Government of India (Adaptation of Indian Laws) Order, 1937.\n6\nSubs. by Act No. XVI of 2025, s.7."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Effect of revocation of certificate",
      "content": "_(1) Where a certificate is revoked under section 8,\nthe former holder thereof shall cease to be deemed to be a 1[citizen of Pakistan].\n(2) On such revocation, 2[the 3[Secretary of the administrative division]] may, by order in\nwriting direct that the wife and minor children (or any of them) of the person whose certificate is\nrevoked shall cease to be deemed to be 1[citizens of Pakistan]; but where no such direction is made,\nthe status of the wife and minor children of the person whose certificate is revoked shall not be\naffected by the revocation:\n1\n[Provided that no such order shall be made in the case of a wife unless by reason of the\nacquisition by her husband of a new nationality she has also acquired that nationality:]\nProvided 4[further] that, in the case of a wife who 1[was, or, if the Pakistan Citizenship Act,\n1951, had been in force at the date of her birth, would have been, by birth a citizen of Pakistan], no\nsuch order as aforesaid shall be made, unless 2[the 3[Secretary of the administrative division]] is\nsatisfied that, if she had held a certificate of naturalization in her own right, the certificate could\nproperly have been revoked under section 8, and the provisions of that section as to referring cases\nfor inquiry shall apply to the making of any such order as they apply to the revocation of a\ncertificate."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Declaration of alienage",
      "content": "_(1) A declaration of alienage in such manner as may be\nprescribed by rules made under this Act may be made,⸻\n(a)        within one year of his attaining majority, by any child who has acquired any of\nthe rights, privileges or capacities of naturalization under sub-section (2) of\nsection 5; or sub-section (2) of section 7; or\n(b)        within six months from the date of the revocation of a certificate under section\n8, or of the death of, or of the dissolution of her marriage with, the holder of\nany such certificate as is therein referred to, by the wife of the person whose\ncertificate has been revoked, or who has died, or whose marriage to her has\nbeen dissolved, as the case may be.\n(2) Where a declaration of alienage has been made in the manner aforesaid, the person\nmaking the same, and the wife of any such person, and any children of any such person who are\nminors and are not by birth 1[citizens of Pakistan], shall cease to be deemed to be 1[citizens of\nPakistan]:\n4\n[Provided that the wife of any such person shall not cease to be deemed to be a 1[citizen of\nPakistan] under this sub-section, unless by reason of the acquisition by her husband of a new\nnationality she has also acquired that nationality.]"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Inquires. Every person making an inquiry under the orders 2[the 3[Director General,",
      "content": "Immigration and Passports]] under sub-section (3) of section 4, and every person appointed to hold\nan inquiry under sub-section (5) of section 8, shall be deemed to be a public servant within the\nmeaning of the 1[Pakistan] Penal Code (XLV of 1860), and shall for the purposes of such inquiry\nhave the same powers as are vested in a Court under the Code of Civil Procedure, 1908 (V of 1908),\n1\nSubs. by Act No. LXI of 1952, ss. 8 and 9.\n2\nSubs. by the Government of India (Adaptation of Indian Laws) Order, 1937.\n3\nSubs. by Act No. XVI of 2025, ss. 8 and 9.\n4\nIns. and added by Act No. I of 1935, ss. 3 and 4.\n5\nSubs. by Act No. XXIII of 1951, s. 11.\nwhen trying a suit, in respect of the following matters :⸻\n(i)        enforcing the attendance of any person and examining him on oath;\n(ii)       compelling the production of documents and material objects; and\n(iii)      issuing commissions for the examination of witnesses; and every such inquiry\nshall be deemed to be a judicial proceeding within the meaning of sections 193\nand 228 of the 1[Pakistan] Penal Code (XLV of 1860)."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Oaths and affidavits",
      "content": "_(1) All oaths and affidavits for the purposes of this Act shall be\nsworn before a Magistrate or such other person as may be appointed in this behalf by 2[the 3[Director\nGeneral, Immigration and Passports]].\n(2) The Magistrate or other person by whom an oath of allegiance is administered under\nsection 6 shall grant to the person making the same a certificate in writing of his having taken and\nsubscribed such oath and of the date of his taking and subscribing the same, and shall forward to\n2\n[the 3[Director General, Immigration and Passports]] the oath so taken and subscribed, together with\na copy of such certificate."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Power to make rules",
      "content": "_(1) 2[The 4[Federal Government]] may, 2[* * *], by notification\nin the 2[official Gazette], make rules, to give effect to the provisions of this Act.\n(2) In particular and without prejudice to the generality of the foregoing powers, such rules\nmay provide for all or any of the following matters, namely:___\n(a)        the form or forms in which certificates of naturalization shall be granted, and\nthe manner in which they shall be recorded;\n(b)        the manner in which declarations of alienage shall be made and recorded.\n(c)        the recording of oaths of allegiance; and\n(d)        the fees which may be imposed for the issue of any certificate, whether of\nnaturalization or otherwise, granted under this Act."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Limitation to the grant of naturalization under this Act.⸻Nothing contained in this",
      "content": "Act shall be deemed to entitle to any of the rights, privileges or capacities of a 5[citizen of Pakistan]\nthe child of any person who is himself so entitled by reason only of the inclusion of his name in a\ncertificate of naturalization under sub-section (2) of section 5 or of the grant of a certificate of\nnaturalization to his parent.\n1\nSubs. by Act No. XXIII of 1951, s. 11.\n2\nSubs. and omitted by the Government of India (Adaptation of Indian Laws) Order, 1937.\n3\nSubs. by Act No. XVI of 2025, s 10.\n4\nSubs. by the Federal Adaptation of Laws Order, 1975(P. O. No. 4 of 1975), Art. 2 and Table.\n5\nSubs. by Act No. LXI of 1952, s. 10.\n1\n14A.          [*                  *                    *                     *                      *                 *      *]\n2\n[14B. Application to certificates granted before Partition.⸻The provisions of this Act\nshall, on or after the fifteenth day of August 1947, continue to apply, as respects 3[* * *] Pakistan, to\ncertificates granted under this Act or under the Indian Naturalisation Act, 1852, before that day by\nthe Local Government or Provincial Government of any Province which or any part of which was\nincluded in the Dominion of India on that day, and any such certificates may after that day be\nrevoked as respects 3[* * *] Pakistan accordingly.]\n4\n[14C. Validation of certain certificates.⸻Any certificate granted under the Indian\nNaturalization Act, 1852, or under this Act before the commencement of the Naturalisation\n(Amendment) Act, 1952, and standing unrevoked as respects Pakistan at the commencement of the\nlast-named Act, shall be deemed to be a certificate of naturalisation under this Act as amended by the\nNaturalisation (Amendment) Act, 1952 (LXI of 1952).]\n15. 5[*               *                     *                     *                     *                    *               *]\n5\n[*     *          *          *          *          *          *]\nDate: 08-07-2025\n94417\n1\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ord. No. XXVII of 1981), s. 3 and Sch. II.\n2\nIns. by the Adaptation of Central Acts and Ordinances Order, 1949 (P. O. 4 of 1949). Art. 2 and Sch.\n3\nOmitted by Act No. XXIII of 1951, s. 13.\n4\nAdded by Act No. LXI of 1952, s. 11.\n5\nRepealed by the Repealing Act, 1927 (XII of 1927) s. 2 and Sch."
    }
  ],
  "definitions": [
    {
      "term": "certificate of naturalization",
      "definition": "a certificate of naturalization granted under this Act; and 1 [(c) “minor” means, notwithstanding anything in the Majority Act, 1875 (IX of 1875), any person who has not completed his age of twenty-one years.]",
      "source_provision": "sec2"
    }
  ]
}
