{
  "id": "pk-naval-armaments-act-1923",
  "type": "statute",
  "title": "Naval Armaments Act, 1923",
  "title_en": "Naval Armaments Act, 1923",
  "short_name": "NAA",
  "status": "in_force",
  "issued_date": "1923-03-04",
  "in_force_date": "1923-03-04",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apyd-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Naval Armaments Act, 1923 (VII of 1923) published by The Pakistan Code (Military Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Act may be called the 3[*] Naval\nArmament Act, 1923.\n1\n[(2) It extends to the whole of Pakistan.]\n(3) It shall come into force on such date as the 4[Federal Government] may, by notification in\n5\nthe [official Gazette], appoint."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_In this Act, unless there is anything repugnant in the subject or context, ___\n(a)        “competent Court” means the High Court or such other Court having unlimited\noriginal civil jurisdiction as the 4[Federal Government] may declare to be\ncompetent Court for the purposes of this Act ;\n(b)        “ship” means any boat, vessel, battery or craft, whether wholly or partly\nconstructed, which is intended to float or is capable of floating, on water, and\nincludes all equipment belonging to any ship ; and\n2\n[(c)   “the Treaty” means the Treaty for the Limitation of Naval Armament and for\nthe Exchange of Information concerning Naval Construction signed in London\non behalf of His Majesty on the twenty-fifth day of March, 1936.]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Restriction on building or equipping vessels of war",
      "content": "_No person shall, except under and\nin accordance with the conditions of a licence granted under this Act, ___\n(a)        build any vessel of war, or alter, arm or equip any ship so as to adapt her for use\nas a vessel of war ; or\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955).\n2\nSubs. by Act No. II of 1937, s. 2.\n3\nOmitted by the Adaptation of Central Acts and Ordinances Order, 1949 (Order No. 4 of 1949) Art. 3 and Sch.\n4\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table.\n5\nSubs. by A. O., 1937.\n(b)       despatch or deliver, or allow to be despatched or delivered, from any place in\n1\n[Pakistan] any ship which has been, either wholly or partly, built, altered,\narmed or equipped as a vessel of war in 2[Pakistan] otherwise than under and in\naccordance with any law for the time being in force 2[* * *]."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Licences",
      "content": "_(1) A licence under this Act for any of the purposes specified in section 3 may\nbe granted by the 3[Federal Government], and shall not be refused unless it appears to the 3[Federal\nGovernment] that such refusal is necessary for the purpose of securing the observance of the\nobligations imposed by the Treaty; and, where a licence is granted subject to conditions, the conditions\nshall be such only as the 3[Federal Government] may think necessary for the purpose aforesaid.\n(2) An application for a licence under this section shall be in such form and shall be\naccompanied by such designs and particulars as the 3[Federal Government] may, by general or special\norder, require.\n4\n[(3) Any person who, in pursuance of a licence granted under sub-section (1) before the\ncommencement of the Indian Naval Armament (Amendment) Act, 1937, (II of 1937) is engaged in,\nbuilding any vessel of war or in altering, arming or equipping any ship so as to adapt her for use as a\nvessel of war, or is about to despatch or deliver, or allow to be dispatched or delivered, from any place\nwithin 1[Pakistan] any ship which has been so built, altered, armed or equipped, either entirely or\npartly, within 1[Pakistan], shall, upon written demand, furnish to tile 3[Federal Government] such\ndesigns and particulars as may be required by the 3[Federal Government] for the purpose of securing\nthe observance of the obligations imposed by the Treaty.]"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Offences against the Act",
      "content": "_(1) If any person contravenes any of the provisions, of section\n3 4[or fails to comply with the provisions of sub-section (3) of section 4], he shall be punishable with\nimprisonment for a term which may extend to two years, or with fine which may extend to one\nthousand rupees, or with both.\n(2) Where an offence punishable under sub-section (1) has been committed by a company or\ncorporation, every director and manager of such company or corporation shall be punishable\nthereunder unless he proves that the act constituting the offence took place without his knowledge and\nconsent.\n(3) Nothing contained in section 517 or section 518 or section 520 of the Code of Criminal\nProcedure, 1898 (V of 1898), shall be deemed to authorise the destruction or confiscation under the\norder of any Criminal Court of any ship which is liable to forfeiture under this Act or of any part of\nsuch ship."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Liability of ships to forfeiture",
      "content": "_Any ship which has been, either wholly or partly, built,\naltered, armed, or equipped as a vessel of war in 1[Pakistan] in contravention of section 3, 2[* * *]\nshall, if found in 1[Pakistan], be liable to forfeiture under this Act.\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955).\n2\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch. II.\n3\nSubs. by Federal Adaptation of Laws Order, 1975 (P. O. No. 1 of 1975), Art. 2 and Table.\n4\nIns. by Act No. II of 1937, ss. 4 and 5."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Seizure, detention and search of ships",
      "content": "_(1) Where a ship is liable to forfeiture under this\nAct, ___\n(a)        any 1[* * *] 2[Executive Magistrate], or\n(b)        any commissioned officer on full pay in the 3[armed forces of Pakistan] 4[* * *]\nor\n(c)        any officer of customs or police-officer not below such rank as may be\ndesignated in this behalf by the 5[Federal Government],\nmay seize such ship and detain it, and, if the ship is found at sea within the territorial waters of\n6\n[Pakistan], may bring it to any convenient port in 6[Pakistan].\n(2) Any officer taking any action under sub-section (1) shall forthwith report the same through\nhis official superiors to the 5[Federal Government].\n(3) The 5[Federal Government] shall, within thirty days of the seizure, either cause the ship to\nbe released or make or cause to be made, in the manner, hereinafter provided, an application for the\nforfeiture thereof, and may make such orders for the temporary disposal of the ship as it thinks suitable."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Procedure in forfeiture of ships",
      "content": "_(1) An application for the forfeiture of a ship under this\nAct may be made by, or under authority from, the 5[Federal Government] to any competent Court\nwithin the local limits of whose jurisdiction the ship is for the time being.\n(2) On receipt of any such application, the Court shall cause notice thereof and of the date fixed\nfor the hearing of the application to be served upon all persons appearing to it to have an interest in the\nship, and may give such directions for the temporary disposal of the ship as it thinks fit.\n(3) For the purpose of disposing of an application under this section, the Court shall have the\nsame powers and follow, as nearly as may be, the same procedure as it respectively has and follows\nfor the purpose of the trial of suits under the Code of Civil Procedure, 1908 (V of 1908), and any order\nmade by the Court under this section shall be deemed to be a decree, and the provisions of the said\nCode in regard to the execution of decrees shall, as far as they are applicable, apply accordingly.\n(4) Where the Court is satisfied that the ship is liable to forfeiture under this Act, it shall pass\nan order forfeiting the ship to 3[Government]:\nProvided that, where any person having an interest in the ship proves to the satisfaction of the\nCourt that he has not abetted, or connived at, or by his negligence facilitated, in any way, a\ncontravention of section 3 in respect of the ship, and such ship has not been built as a vessel of war, it\nmay pass such other order as it thinks fit in respect of the ship or, if it be sold, of the sale proceeds\nthereof:\n1\nOmitted by Adaptation of Central Acts and Ordinances Order, 1949 (Order No. 4 of 1949), Art. 3 and Sch.\n2\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch., II.\n3\nSubs. by the Central Laws (Adaptation) Order, 1961 (P. O No. 1 of 1961), Art. 2 and Sch., for “military, naval or air service of His Majesty” (with effect\nfrom the 23rd March, 1950).\n4\nOmitted by A. O., 1937.\n5\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table.\n6\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955).\nProvided further, that in no case shall any ship which has been altered, armed or equipped as a\nvessel of war be released until it has been restored, to the satisfaction of the 1[Federal Government], to\nsuch condition as not to render it liable to forfeiture under this Act.\n(5) The 1[Federal Government] or any person aggrieved by any order of a Court, other than a\nHigh Court, under this section may, within three months of the date of such order, appeal to the High\nCourt."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Disposal of forfeit",
      "content": "_Where a ship has been forfeited to 2[Government] under section 8, it\nmay be disposed of in such manner as the 1[Federal Government] 3[* * *] directs:\nProvided that, where the ship is sold under this section, due regard shall be had to the\nobligations imposed by the Treaty."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Special proof of relevant facts",
      "content": "_If, in any trial, appeal or other proceeding under the\nforegoing provisions of this Act, any question arises as to whether a ship is a vessel of war or whether\nany alteration, arming or equipping of a ship is such as to adapt it for use as a vessel of war, the question\nshall be referred to and determined by the 1[Federal Government], whose decision shall be final and\nshall not be questioned in any Court."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Penalties for proceeding to sea after seizure",
      "content": "_(1) Where a ship which has been seized\nor detained under section 7 or section 8 and has not been released by competent authority under this\nAct proceeds to sea the master of the ship shall be punishable with fine which may extend to one\nthousand rupees, and the owner and any person who sends the ship to sea shall be likewise so\npunishable unless such owner or person proves that the offence was committed without his knowledge\nand consent.\n(2) Where any ship so proceeding to sea takes to sea, when on board thereof in the execution\nof his duty, any officer empowered by this Act to seize and detain the ship, the owner and master shall\nfurther each be liable, on the order of the Court trying an offence punishable under sub-section (1), to\npay all the expenses of and incidental to such officer being taken to sea, and shall further be punishable\nwith fine which may extend to one hundred rupees for every day until such officer returns or until such\ntime as would enable him after leaving the ship to return to the port from which he was taken.\n(3) Any expenses ordered to be paid under sub-section (2) may be recovered in the manner\nprovided in the Code of Criminal Procedure, 1898 (V of 1898), for the recovery of a fine."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to enter dockyards, etc",
      "content": "_(1) Any person empowered by this Act to seize and\ndetain any ship may, at any reasonable time by day or night, enter any dockyard, shipyard or other\nplace and make inquiries respecting any ship which he has reason to believe is liable to forfeiture under\nthis Act, and may search such ship with a view to ascertaining whether the provisions of this Act have\nbeen or are being duly observed in respect thereof, and every person in charge of or employed in such\nplace shall on request be bound to give the person so empowered all reasonable facilities for such entry\nand search and for making such inquiries.\n(2) The provisions of sections 101, 102 and 103 of the Code of Criminal Procedure, 1898 (V\nof 1898), shall apply in the case of all searches made under this section.\n1\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table.\n2\nSubs. by the Central Laws (Adaptation) Order, 1949 (P. O. No. 1 of 1961), Art. 2, for “His Majesty” (with effect from the 23rd March, 1956).\n3\nOmitted by A. O., 1937."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Courts by which and conditions subject to which offences may be tried",
      "content": "_No Court\ninferior to that of a 1[* * *] Magistrate of the first class shall proceed to the trial of any offence\npunishable under this Act, and no Court shall proceed to the trial of any such offence except on\ncomplaint made by, or under authority from, the 2[Federal Government]."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Indemnity",
      "content": "_No prosecution, suit or other legal proceeding shall lie against any person for\nanything in good faith done or intended to be done under this Act.\n_______\n3\n[Repealed]\n___________\nDate: 08-10-2024\n1\nOmitted by the Adaptation of Central Acts and Ordinances Order, 1949 (Order No. 4 of 1949), Art. 3 and Sch.\n2\nSubs. by Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table.\n3\nRep. by Act No. II of 1937, s. 6."
    }
  ],
  "definitions": [
    {
      "term": "competent Court",
      "definition": "the High Court or such other Court having unlimited original civil jurisdiction as the 4[Federal Government] may declare to be competent Court for the purposes of this Act ;",
      "source_provision": "sec2"
    },
    {
      "term": "ship",
      "definition": "any boat, vessel, battery or craft, whether wholly or partly constructed, which is intended to float or is capable of floating, on water, and includes all equipment belonging to any ship ; and 2 [(c) “the Treaty” means the Treaty for the Limitation of Naval Armament and for the Exchange of Information concerning Naval Construction signed in London on behalf of His Majesty on the twenty-fifth day of March, 1936.]",
      "source_provision": "sec2"
    }
  ]
}
