{
  "id": "pk-naya-pakistan-housing-and-development-authority-act-nphda-2020",
  "type": "statute",
  "title": "Naya Pakistan Housing and Development Authority Act (NPHDA), 2020",
  "title_en": "Naya Pakistan Housing and Development Authority Act (NPHDA), 2020",
  "short_name": "NPHAD",
  "status": "in_force",
  "issued_date": "2021-01-14",
  "in_force_date": "2021-01-14",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NpZ5s%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Naya Pakistan Housing and Development Authority Act (NPHDA), 2020 (V of 2020) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Re",
      "content": "development schemes.— (1) The Authority may undertake re-development\n(including renewal, re-construction, or upgradation) of whole or a part of a scheme.\n(2) The provisions of this Act for development of a scheme shall, with necessary changes,\napply to re-development under sub-section (1)."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Registrar",
      "content": "(1) The Authority may appoint one or more Registrars of titles for a\nspecified area or part thereof on the terms and conditions as may be prescribed in the regulations.\n(2) In the course of performance of his duties under this Act, the Registrar may exercise the\npowers of a civil court under the Code of Civil Procedure, 1908 (as enforced in the Province or\nterritory of the relevant Registrar) for summoning any person, document, enforcing attendance of\nany person or compulsory production of any document or taking statement on oath."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Record of titles",
      "content": "(1) The Authority may, in the prescribed manner, maintain the\nrecords of titles itself or outsource the same in the specified; area or part thereof, to a central\ndepository company or any other similar entity.\n(2) The Authority may link the record of titles in the specified area with the record of the\nNational Database and Registration Authority on mutually agreed terms and conditions.\n(3)  The Authority shall maintain computerized record of titles which maybe exhibited on\nthe website of the Authority, in the prescribed manner."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Registration of Properties",
      "content": "(1) Notwithstanding anything contained in any other law,\nthe Authority, as prescribed, may enter into arrangements to effect registration and transfer of\nproperties and maintain records in relation to any property or part thereof falling in a scheme, with\nProvincial Governments, and where applicable, Local Governments or other bodies.\n(2) The certificate of title issued by the Registrar shall be deemed to constitute a title\ndocument of the relevant immovable property.\n(3) The Registrar shall maintain, accurately and completely the current facts about each\nimmovable property including certificate of title, leasehold rights, mortgage, an easement, a right\nof occupation or any other right or interest which shall be available online on the website of the\nAuthority with geo-tagged system, insuch manner as may be prescribed.\n(4)   The Registrar may issue certified copies of certificates of title in the prescribed\nmanner."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. House finance for a scheme",
      "content": "(1) Where house finance has been provided by a\nfinancial institution for immovable property in a scheme pursuant to an arrangement between the\nAuthority and the financial institution, all disputes between the financial institution and the relevant\nborrowers in the scheme shall, notwithstandinganything contained in any other law, be adjudicated\nupon by the Adjudicator. The process and requirements for lodging and adjudication of a claim before\nthe Adjudicatorshall be prescribed through regulations.\n(2) Any party aggrieved of the final judgment of the Adjudicator under sub-section (1)\nmay, within thirty days of the final judgment, file an appeal before the Appellate Tribunal. The\nprocess and requirements for lodging and adjudication of an appeal before the Appellate Tribunal\nshall be prescribed through regulations.\n(3)  An appeal to the Supreme Court from a final judgment or order of the Appellate\nTribunal shall lie only if the Supreme Court grants leave to appeal."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Process for Mortgage and Auction",
      "content": "Where house finance for immovable\nproperty in a scheme is or is proposed to be secured through mortgageof such immovable property,\nthe manner, method and procedure for creation and registration of such mortgage, determination\nof liability, valuation of mortgaged property, fixation of reserve price, auction, bidding and sale of\nmortgaged immovableproperty shall be as prescribed."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Common property",
      "content": "(1) The common property/common areas in a scheme\n(including common areas in buildings) shall remain vested in the Federal Government. The\nAuthority shall control, manage and deal with all such common property/common areas for and on\nbehalf of the Federal Government, for the purposesof this Act.\n(2) The Authority may delegate and regulate the management of the common\nproperty/common areas in a scheme in the prescribed manner. Without prejudice to the generality\nof the foregoing, such prescription may provide for the establishment (including incorporation),\ncomposition, regulation, operations, powers and functions and dissolution of management\nassociations by whatever name called.\nTAXES, FEES AND CHARGES"
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Authority to be exempt from taxation",
      "content": "(1) Notwithstanding anything contained\nin any other law, for a period of five years starting from the date of notification under sub-section\n(1) of section 4, the Authority shall be exempt from income tax.\n(2) The Federal Government through a notification in the official Gazette may extend the\nexemption mentioned in sub-section (1) of this section to such extent and on such terms and\nconditions, as it may deem fit."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Authority to collect property tax",
      "content": "The Authority or, if authorized by the\nAuthority, management association shall collect property tax, if any, and the Authority shall enter\ninto an arrangement with the concerned government for sharing of proceeds of the property tax\ncollected from a scheme."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Authority to levy fee and charges",
      "content": "The Authority shall fix fees or charges for\nrendering of any service in a scheme including registration fee, water rate, sanitation fee, solid\nwaste management fee, development or re-development charge and maintenance fee or any other\nfees, dues and charges."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Additional charge or surcharge",
      "content": "If a person fails to pay a tax, fee or charge to\nthe Authority, the Authority may in the prescribed manner, but subject to the terms of arrangement\nwith the concerned government, levy and collect additional charge and surcharge for non-payment\nof dues within the specified time.\nOFFENCES, ENFORCEMENT AND ADJUDICATION"
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Penalty",
      "content": "(1) If a person contravenes any provision of this Act, or any rules or\nregulations made under this Act, he shall, if no other penalty is provided for such contravention, be\npunishable with imprisonment for a term which may extend to one year or with fine which may\nextend to two hundred thousand rupees or with both.\n(2) The magistrate competent to try an offence under sub-section (1) may try the offence\nin a summary manner in accordance with the provisions of sections 260 to 265 of the Code of\nCriminal Procedure, 1898 (V of 1898)."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Offences and cognizance",
      "content": "(1) If a person commits an offence specified in—\n(a) Part-A of the Schedule, such person shall be liable to imprisonment for a term\nwhich may extend to seven years or fine which may extend to five hundred\nthousand rupees or with both and where an accused was directed by the\nAuthority for immediate discontinuance of the offence, the court may impose a\nfurther fine which may extend to fifty thousand rupees for every day for the\nperiod the accused has persisted in the offence from the date of its commission;\nand\n(b) Part-B of Second Schedule, he shall be liable to imprisonment for a term which\nmay extend to three years or fine which may extend to one hundred thousand\nrupees or with both and where an accused was directed by the Authority for\nimmediate discontinuance of the offence, the court may impose a further fine\nwhich may extend to ten thousandrupees for every day for the period the accused\nhas persisted in the offence from the date of its commission.\n(2) An offence punishable under sub-section (1) shall be cognizable on a complaint in\nwriting of an employee authorized by the Authority to the officer inchargeof the police station."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Offences to be cognizable and bailable",
      "content": "Notwithstanding anythingcontained in the\nCode of Criminal Procedure, 1898 (Act V of 1898), offences under this Act shall be bailable and\ncognizable by the magistrate first class on the complaintof an employee authorized by the Authority."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Offences by companies",
      "content": "(1) Where an offence under this Act has been committed\nby a company, every person who at the time of commission of offence was in charge of and was\nresponsible for the conduct of its activities shall be deemed to be guilty of the offence and shall\nbe liable to be proceeded against under this Act.\n(2) Nothing contained in this section shall render any such person liable if it is proved that\nthe offence was committed without the person’s knowledge or that such person exercised due care\nto prevent the commission of the offence."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Administrative penalties",
      "content": "(1) An Adjudicator may, in the prescribed manner, issue\ndirections to any person for compliance with any provision of this Act, the rules or regulations within\nthe time and in the manner specified in such directions.\n(2) If a person fails to comply with any direction of the Adjudicator withinsuch time as may\nbe specified in such direction or where violation is declared as grave under the regulations, the\nAdjudicator may pass one or more of the followingorders, namely:—\n(a) direct the delinquent person to pay a fine as administrative penalty which may\nextend to one hundred thousand Rupees and in case the failure continues, with\nan additional fine which may extend to five thousand Rupees for every day\nduring which such failure continues after the direction to pay fine for the first\nsuch failure is passed;\n(b) direct initiation of prosecution against the delinquent person for the offence\nunder section 33;\n(c) seal (for a specified or unspecified period) the immovable property where\nviolation of this Act, rules or regulations has taken place;\n(d) direct the relevant employee of the Authority, a civic or utility agencyto stop or\ndiscontinue the provision of municipal or utility services to the immovable\nproperty in occupation of the delinquent person till such time as the violation\ncontinues;\n(e) direct removal or construction of any structure by the Authority;\n(f) direct the enforcement inspector to dispossess an unauthorized occupant from\nan immovable property and hand over peaceful possession of the property to\nthe person entitled to the possession of the property; and\n(g) direct cancellation of lease or allotment of the delinquent person and resumption\nof possession of the immovable property by the Authority.\n(3) The Adjudicator shall take cognizance of a case on the report of an enforcement\ninspector or an employee authorized by the Authority which shall containdocumentary evidence of the\nviolation and identification of the delinquent person.\n(4) The Adjudicator shall not pass any final direction or order without issuing a\nshow-cause notice in writing and affording an opportunity of hearing to the delinquent person, in the\nprescribed manner."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Administrative penalty and offence",
      "content": "(1) A person, on whom an administrative\npenalty is imposed under section 36, shall not be prosecuted for an offence in respect of the same\nincident that gave rise to imposition of the administrative penalty unless the Adjudicator directs\nprosecution of the person.\n(2) A person charged with an offence may also be subject to an administrative penalty in\nrespect of the same incident that gave rise to the charge of the offence."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Enforcement inspectors",
      "content": "(1) The Authority shall devise and implement\nenforcement plans regarding the observance of this Act, rules and regulations.\n(2) The Authority shall designate enforcement inspectors for the implementation of the\nenforcement plans in such manner as may be prescribed under the regulations.\n(3) The enforcement inspectors shall exercise such powers, in such manner and to such\nextent as is provided in this Act or as may be prescribed in the rules orregulations.\n(4) The Authority may, for discharge of its functions under this Act, seek assistance and\nsupport from law enforcement agencies and other public bodies who shall provide all such\nassistance and support."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Power to enter",
      "content": "(1) Subject to any rules or regulations, an enforcement inspector\nmay, whenever it is necessary for purposes of this Act and at all reasonable times, enter upon any\nimmovable property and—\n(a) make inspection, survey, measurement, valuation or enquiry;\n(b) take levels;\n(c) dig or bore into sub-soil;\n(d) set out boundaries and intended lines of work;\n(e) mark such levels, boundaries and lines by placing marks and cuttingtrenches;\n(f) take electronic or other evidence; and\n(g) do such other acts or things as may be prescribed.\n(2) An enforcement inspector shall not enter any immovable property except;\n(a) with the consent of the occupant and with prior written notice specifyingdate and\ntime of inspection; or\n(b) when directed by a court or Adjudicator; or\n(c) without notice to prevent any disaster in an emergency."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Ejectment of unauthorized occupants",
      "content": "(1) Subject to an opportunity of\nhearing, the Chairman, enforcement inspector or any other authorized officer of the Authority may\nsummarily eject any person in unauthorized occupation of any immovable property under the\nmanagement or control of the Authority and may for such ejectment use such force as may be\nnecessary.\n(2) Subject to an opportunity of hearing, the Chairman enforcement inspector or any\nother authorized officer of the Authority, on his own motion or on the application of the lawful\noccupier of an immovable property, summarily eject any person in unauthorized occupation of such\nimmovable property in a scheme and may, for such ejectment, use such force as may be necessary.\n(3) Nothing contained in sub-sections (1) and (2) shall prohibit the Chairman,\nenforcement inspector or any other authorized officer of the Authority to proceed against such\nperson on commission of an offence, as provided in the Act."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Adjudicator",
      "content": "(1) The Authority shall appoint one or more Adjudicatorsfor a specified\narea and if the Authority appoints more than one Adjudicators for aspecified area, it shall specify\njurisdiction of each Adjudicator. The qualifications and terms and conditions of appointment as\nAdjudicator shall be prescribed through regulations.\n(2) The Adjudicator shall hear and decide a case referred to him by the Chairman, Registrar\nor an enforcement inspector under this Act, rules or regulations."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Inquiry and decision",
      "content": "(1) The Adjudicator may—\n(a)      conduct an inquiry in any case;\n(b)      while inquiring into a case, exercise powers of a civil court under the Code of\nCivil Procedure 1908 (Act V of 1908) in respect of the followingmatters:\n(i)    summon and enforce attendance of a person, compel a person to give oral\nor written evidence on oath and to produce a document or any other\nmaterial;\n(ii)    receive evidence on affidavit;\n(iii)   requisition information from any office; and\n(iv)    issue summons for witnesses or documents.\n(2) The Adjudicator shall execute his decisions as if he is a civil court under the Code of\nCivil Procedure, 1908 (Act V of 1908) or may direct an enforcement inspector to execute the\ndecision in the manner mentioned in the direction.\n(3) During the course of any proceedings before him, and before passing a final order, the\nAdjudicator may pass such interlocutory orders as he may consider appropriate in the\ncircumstances."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Review",
      "content": "If no appeal is filed under section 45 against any decision of the\nAdjudicator, the Adjudicator may, at any time, review his decision to correct any error or on proof\nof any other sufficient cause justifying review of the decision."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Recovery of dues",
      "content": "(1) If a person fails to pay any amount due to the Authority or\na mortgagor fails to repay house finance in accordance with Section 25, the Adjudicator shall,\non a reference from an authorized employee of the Authority or the financial institution, as\napplicable, recover the amount due from the person or mortgagor as arrears of land revenue under\n(2) In exercise of powers under this section, the Adjudicator shall exercise any power of\ncollector under the Land Revenue Act, 1967 (XVII of 1967)."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Appeals",
      "content": "(1) A person aggrieved from any final direction, decision or order of an\nAdjudicator may, within thirty days from the date of communication of the same, file an appeal\nbefore an Appellate Tribunal of the Authority.\n(2)  The Appellate Tribunal shall be constituted and shall discharge its functions in the\nprescribed manner.\n(3)  An appeal to the Supreme Court from a final judgment or order of the Appellate\nTribunal shall lie only if the Supreme Court grants leave to appeal."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Bar of jurisdiction",
      "content": "Notwithstanding anything provided in any otherlaw for the time\nbeing in force, but save as expressly provided in this Act—\n(a) no court or other authority whatsoever shall have jurisdiction to entertain, or to\nadjudicate upon, any matter which the Authority, the Chairman, the Registrar or a\nAdjudicator, enforcement inspector or any other person is empowered by or under\nthis Act, or the rules or regulations framed thereunder, to dispose of or to determine;\n(b) the validity of anything done or an order passed by the Authority, the Chairman, the\nRegistrar or a Adjudicator, enforcement inspector or any other person empowered by\nor under this Act, or the rules or regulations framed thereunder, shall not be called in\nquestion in any manner whatever before or by any court or other authority\nwhatsoever; and\n(c) no court or other authority whatsoever shall be competent to grant any injunction or\npass any other order in relation to any proceedings under this Act or any rules or\nregulations framed thereunder before the Authority, the Chairman, the Registrar or a\nAdjudicator, enforcement inspector or any other person empowered by or under this\nAct, or therules or regulations framed thereunder."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Fund",
      "content": "(1) The Authority shall establish a fund to be known as Naya Pakistan\nHousing and Development Authority Fund to be administered and controlled by the Authority.\n(2)   The Fund shall consist of—\n(a) funds, loans or grants provided by the Federal Government or a Provincial\nGovernment;\n(b) grants and loans negotiated and raised or otherwise obtained by the Authority;\n(c) fee, charges, rentals, tolls, fines and other moneys received or collected by the\nAuthority;\n(d) income from the lease or sale of the property;\n(e) funds from, bonds, sukuk and other forms of finances obtained on the basis of\nparticipation term certificate (PLC), musharika certificates, term finance\ncertificates (TFC) or any other financial or debt instruments or securities\nissued by the authority; and\n(f) all other sums received by the authority.\n(3)  The fine imposed or the fee charged under this Act, the rules or regulations shall, on\nreceipt or recovery, be deposited in and shall form part of Naya Pakistan Housing and\nDevelopment Authority Fund.\n(4) The Authority shall meet all its expenses from the Fund and shall exercise prudence\nin its expenditures from the Fund."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Bank accounts",
      "content": "The Authority may open and maintain its bank accounts at such\nscheduled banks as may be prescribed and until so prescribed, as the Chairman may determine."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Budget and accounts",
      "content": "(1) The Chairman shall cause to be preparedthe budget of the\nAuthority for each financial year commencing on first day of Julyof a year and ending on thirtieth\nday of June of the succeeding year.\nThe Chairman shall approve the budget at least forty-five days prior to the\n(2)\ncommencement of a financial year.\n(3)   The accounts of the Authority shall be maintained in such manner as may be\nprescribed."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Audit",
      "content": "(1) The Chairman shall appoint a firm of chartered accountants, which is\nplaced in category ‘A’ by State Bank of Pakistan, for the annual audit of the accounts of the\nAuthority.\n(2) The auditors appointed under sub-section (2) shall submit the audit report to the\nChairman and the Chairman shall cause the same to be placed before the Policy Board for\napproval."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Duty to assist the Authority",
      "content": "(1) The Authority may in the performance of its\nfunctions seek assistance of any office, authority or agency working under the Federal\nGovernment, a Provincial Government or a local government.\n(2)   The office, authority or agency shall comply with the direction of theAuthority under\nsub-section (1) unless, for reasons to be recorded in writing and within thirty days of\nthe direction, an officer not below the rank of head of the office,\n(3)   authority or agency requests the Authority to place the matter before the Chairman\nwhose decision, on such matter, shall be final."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Authentication of instruments of Authority",
      "content": "All orders, decisions and other\ninstruments of the Authority shall be authenticated by the signature of the Chairman or any other\nemployee of the Authority authorized by the Chairman."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Annual report",
      "content": "(1) The Authority shall, within three months of the end of a\nfinancial year, submit to the Patron art annual report.\n(2)   The Annual report under sub-section (1) shall consist of.—\n(a)   the statement of accounts and audit reports of the Authority;\n(b)   a comprehensive statement of the work and activities of the Authority during\nthe preceding financial year and its proposed projects; and\n(c)   such other matters as may be prescribed or as the Authority may consider\nappropriate."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Public servants",
      "content": "The Chairman, a member, Adjudicator, enforcement inspector,\nRegistrar and an employee, expert or consultant of the Authority shall when acting or purporting\nto act in pursuance of any of the provisions of this Act, be deemed to be public servants within the\nmeaning of section 21 of the Pakistan Penal Code, 1860 (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Immunity",
      "content": "No suit, prosecution or any other legal proceedings shall lie against the\nChairman, a member, Adjudicator, enforcement inspector, Registrar or an employee, expert or\nconsultant of the Authority, in respect of anything done orintended to be done in good faith under\nthis Act."
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. Act to prevail over other laws",
      "content": "(1) In the event of any conflict or inconsistency\nbetween the provisions of this Act and the provisions of any other law,the provisions of this Act shall,\nprevail to the extent of such conflict or inconsistency.\n(2) If an instrument is required to be registered under this Act as also under any other law,"
    },
    {
      "provision_ref": "sec57",
      "section": "57",
      "title": "Section 57. Rules",
      "content": "The Patron may, on the recommendation of the Authority and by\nnotification in the official Gazette, make rules for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec58",
      "section": "58",
      "title": "Section 58. Regulations",
      "content": "Subject to this Act and any rules prescribed hereunder, the Authority\nmay, by notification in the official Gazette and publication on its website, make regulations, to give\neffect to the provisions of this Act."
    },
    {
      "provision_ref": "sec59",
      "section": "59",
      "title": "Section 59. Removal of Difficulties",
      "content": "If any difficulty arises in giving effect to any provision\nof this Act, the Authority may, at any time, make such order, not inconsistent with provisions of\nthis Act and any rules made hereunder, as may appear to it to be necessary for the purpose of\nremoving the difficulty."
    },
    {
      "provision_ref": "sec60",
      "section": "60",
      "title": "Section 60. Savings",
      "content": "Notwithstanding the provisions of this Act, all actions taken and decisions\nmade by the Government for providing housing and real estate development and other activities\nrelated to land and construction through the Naya Pakistan Housing and Development Authority\ntill the enactment of this Act shall continue and be deemed to have been validly made under the\nprovisions of this Act.\n[see section 33]\nPart-A"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Discharging any dangerous chemical, inflammable, hazardous or offensive article in any",
      "content": "drain, or sewer, public water-course or land ina scheme in such manner as causes or is likely\nto cause danger to persons passing by or living or working in the neighbourhood, or risk or\ninjury to property or causing harm to the environment."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Failure of industrial or commercial concerns or such property holders to provide adequate",
      "content": "and safe disposal of affluent or prevention of their mixing up with the water supply or\nsewerage system.\nPart-B"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Wilfully obstructing any officer or servant of the Authority or any person authorized to",
      "content": "exercise powers conferred under this Act."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Failure to deliver back possession of property to the Authority on expiration or cancellation",
      "content": "of lease or allotment or exemption of immovable property."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Doing an act without license, approval or permission when the doing of such act requires a",
      "content": "license or permission under any of the provisions of the Act, the rules or regulations\nhereunder."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Violation of the master plan, building plan or sanctioned site developmentscheme including the",
      "content": "plans and schemes sanctioned under the repealed enactments, allotting, selling or using the\nland for the purpose other than the approved layout plan."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Erection or re",
      "content": "erection of any structure which is not approved or authorized by the\nAuthority."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Changing or converting into any other use any portion of a commercial or residential building",
      "content": "or area specified or earmarked for public parkingor amenities."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Establishing any parking stand on any property or on any open spaceand public park or land",
      "content": "managed, maintained or controlled by the Authority."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Establishing temporary shops or running any restaurant or vending stalls for eatables,",
      "content": "wooden khokas or any sort of commercial activityon any road, street, footpath, public place,\nover a drain, or any other property managed, maintained or controlled by the Authority."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Obstructing or tampering with any road, street, drain or sewer pipe orpavement or tampering",
      "content": "with any main pipe, meter or any apparatus or appliance for the supply of water or sewerage\nsystem or laying out adrain or altering any drain in a street or road."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Willfully causing damage, or allowing damage to be caused to any property managed,",
      "content": "maintained or controlled by the Authority, or which is intended to be managed, maintained or\ncontrolled by the Authority, or unlawfully converting it to his own or any other person’s use."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Refusal or willfully neglecting to provide any officer or servant of the Authority with the",
      "content": "means necessary for entering into any premises forthe purpose of collecting any information\nor making an examination or enquiry in relation to any matter under the Act, rules or\nregulations."
    }
  ],
  "definitions": []
}
