{
  "id": "pk-net-work-analyser-study-centre-transfer-to-wapd-ordinance-1983",
  "type": "statute",
  "title": "Net work Analyser Study Centre (Transfer to WAPD) Ordinance, 1983",
  "title_en": "Net work Analyser Study Centre (Transfer to WAPD) Ordinance, 1983",
  "short_name": "NWASC",
  "status": "in_force",
  "issued_date": "1989-01-07",
  "in_force_date": "1989-01-07",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpia-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Net work Analyser Study Centre (Transfer to WAPD) Ordinance, 1983 (I of 1983) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Transfer of existing civil servants of the Centre to the Authority",
      "content": "THE NETWORK ANALYSER STUDY CENTRE (TRANSFER TO\nWAPDA) ORDINANCE, 1983\nORDINANCE No. I OF 1983\n[8th January, 1983]\nAn Ordinance to provide for transfer of the Network Analyser Study Centre, Lahore, to the\nPakistan Water and Power Development Authority.\nWHEREAS it is expedient to provide for the transfer of the Network Analyser Study Centre,\nLahore to the Pakistan Water and Power Development Authority, and for matters connected\ntherewith or ancillary thereto;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, and in\nexercise of all powers enabling him in that behalf, the President is pleased to make and promulgate\nthe following Ordinance: __"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Ordinance may be called the Network\nAnalyzer Study Center (Transfer to WAPDA) Ordinance, 1983.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context,",
      "content": "−\n(a)     “appointed day” means the eighteenth day of July, 1981 ;\n(b)     “Authority” means the Pakistan Water and Power Development Authority;\nand\n(c)     “Centre” means the Network Analyser Study Center, office of the Chief\nEngineering Adviser, Lahore."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Transfer of the Centre to the Authority. The Centre shall stand transferred to the Author",
      "content": "ity on and from the appointed day on the following terms and conditions, namely: __\n(a)     the Authority shall pay to the Federal Government cost of network analyzer,\nair-conditioning and other items of equipment determined on the basis of their\noriginal book value minus depreciation at the rate of 3.3 per cent per annum\nfrom the date of commissioning;\n(b)     the ownership of land and buildings shall continue to be retained by the\nFederal Government and no rent shall be charged from the Authority on this\naccount, but the government may construct office building for the Office of\nPakistan Commissioner for Indus Waters at the vacant premises of the center\nas and when considered necessary; and\n(c)    the Authority, if required, shall promptly carry out studies at the Center for the\nFederal Government free of cost."
    }
  ],
  "definitions": [
    {
      "term": "appointed day",
      "definition": "the eighteenth day of July, 1981 ;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "the Pakistan Water and Power Development Authority; and",
      "source_provision": "sec2"
    },
    {
      "term": "Centre",
      "definition": "the Network Analyser Study Center, office of the Chief Engineering Adviser, Lahore.",
      "source_provision": "sec2"
    }
  ]
}
