{
  "id": "pk-new-energy-vehicles-adoption-levy-act-2025",
  "type": "statute",
  "title": "New Energy Vehicles Adoption Levy Act, 2025",
  "title_en": "New Energy Vehicles Adoption Levy Act, 2025",
  "short_name": "NEVAL",
  "status": "in_force",
  "issued_date": "2025-06-26",
  "in_force_date": "2025-06-26",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tlag%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of New Energy Vehicles Adoption Levy Act, 2025 (XIX of 2025) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act shall be called the New Energy\nVehicles Adoption Levy Act, 2025.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context.__\n(a)        “bus” includes a motor vehicle designed or adapted to carry more than ten\npassengers at a time, in addition to the driver, whether for hire or otherwise, and\nincludes a van, mini-bus and coaster;\n(b)        “division concerned” means the division to which business of this Act stands\nallocated;\n(c)        “internal combustion engine motor vehicle” means a motor vehicle powered\nwholly or partially by fossil fuels including petrol, diesel, compressed natural\ngas or liquefied petroleum gas;\n(d)        “levy” means the new energy vehicle adoption levy imposed and collected\nunder this Act;\n(e)        “manufacturer” means a person carrying out the business of assembly,\nmanufacture, fabrication or production of motor vehicles in Pakistan;\n(f)        “motor vehicle” means a vehicle propelled mechanically, electrically or other\nzero emission based technology either partially or completely, adapted for use\n1\nEnacted vide section 13 of the Finance Act, 2025 (Act No. XIX of 2025).\nupon roads and includes motorcycles, rickshaws, cars, vans, SUVs, Jeeps,\nsedans, suburban vehicles, buses, loaders, and trucks;\n(g)     new energy motor vehicle’ means a motor vehicle that is powered__\n(i)     exclusively by an electric motor run on a rechargeable battery; or\n(ii)    by both an electric motor run on a rechargeable battery and an internal\ncombustion engine, capable of achieving a range of no less than fifty\nkilometers under normal conditions exclusively running on electric\nmotor by a single battery charge; or\n(iii)   hydrogen fuel cells or any other technology that produces zero tailpipe\nemission; and\n(h)     “truck” means a motor vehicle designed or adapted primarily for the carriage of\ngoods or materials, having a payload capacity exceeding fifteen hundred\nkilograms and includes a rigid or articulated truck, loader, delivery van, pickup\nand any other vehicle equipped with a goods-carrying body or container."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. New energy vehicle levy.__ (1) Subject to the provision of sub",
      "content": "section (3), there stand\nimposed a levy to be collected and paid to the Federal Government by__\n(a)     every manufacturer on every internal combustion engine motor vehicle\nmanufactured or, as the case may be, assembled and supplied by him; and\n(b)     every person on every internal combustion engine motor vehicle imported by\nhim into Pakistan.\n(2) The levy shall be paid at a rate and by such persons as is mentioned in the First Schedule.\n(3) The Federal Government may, from time to time, revise the rate or otherwise add or remove\na category of internal combustion engine mentioned at the First Schedule.\n(4) The levy shall not apply to any motor vehicle of the following categories, namely:__\n(a)     a new energy vehicle;\n(b)     an internal combustion engine motor vehicle manufactured or imported\nexclusively for export purposes under an order of the Federal Government;\n(c)     an internal combustion engine motor vehicle owned by a diplomatic mission or\nconsulate, and an international organization enjoying privileges under the\nDiplomatic and Consular Privileges Ordinance, 1972 (Ordinance IX of 1972);\nand\n(d)     any other internal combustion engine motor vehicle or category of internal\ncombustion engine motor vehicle that the Federal Government may, by a\nnotification in the official Gazette, exempt from application of the levy with or\nwithout any and conditions."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Collection and refund etc. of levy",
      "content": "(1) Unless otherwise specified in the rules prescribed\nunder this Act, the levy shall be imposed and collected__\n(a)     in respect of an internal combustion engine motor vehicle imported in Pakistan,\nin the same manner as an import duty payable under the Customs Act, 1969 (IV\nof 1969) is collected; and\n(b)     in respect of an internal combustion engine motor vehicle manufactured or\nassembled in Pakistan, in the same manner as a sales tax leviable under the Sales\nTax Act, 1990 (V of 1990) is collected.\n(2) The provisions of the Customs Act, 1969 (IV of 1969), or, as the case may be, of the Sales\nTax Act, 1990 shall, in so far as may be practicable, apply to the imposition, collection, recovery and\nrefund of the levy."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Use of levy",
      "content": "All proceeds from the levy shall be used for promoting the adoption of new\nenergy vehicles and matters ancillary thereto as determined by the Federal Government from time to\ntime."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to make rules",
      "content": "The Federal Government may, by notification in the official Gazette,\nmake rules for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Removal of difficulties",
      "content": "If a difficulty arises in giving effect to any of the provisions of\nthis Act, the Federal Government may make an order, not inconsistent with the provisions of this Act,\nfor the purpose of removing the difficulty.\n___________\nRGN Date: 04-07-2025"
    }
  ],
  "definitions": [
    {
      "term": "bus",
      "definition": "a motor vehicle designed or adapted to carry more than ten passengers at a time, in addition to the driver, whether for hire or otherwise, and includes a van, mini-bus and coaster;",
      "source_provision": "sec2"
    },
    {
      "term": "division concerned",
      "definition": "the division to which business of this Act stands allocated;",
      "source_provision": "sec2"
    },
    {
      "term": "internal combustion engine motor vehicle",
      "definition": "a motor vehicle powered wholly or partially by fossil fuels including petrol, diesel, compressed natural gas or liquefied petroleum gas;",
      "source_provision": "sec2"
    },
    {
      "term": "levy",
      "definition": "the new energy vehicle adoption levy imposed and collected under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "manufacturer",
      "definition": "a person carrying out the business of assembly, manufacture, fabrication or production of motor vehicles in Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "motor vehicle",
      "definition": "a vehicle propelled mechanically, electrically or other zero emission based technology either partially or completely, adapted for use 1 Enacted vide section 13 of the Finance Act, 2025 (Act No. XIX of 2025). upon roads and includes motorcycles, rickshaws, cars, vans, SUVs, Jeeps, sedans, suburban vehicles, buses, loaders, and trucks; (g) new energy motor vehicle’ means a motor vehicle that is powered__ (i) exclusively by an electric motor run on a rechargeable battery; or (ii) by both an electric motor run on a rechargeable battery and an internal combustion engine, capable of achieving a range of no less than fifty kilometers under normal conditions exclusively running on electric motor by a single battery charge; or (iii) hydrogen fuel cells or any other technology that produces zero tailpipe emission; and",
      "source_provision": "sec2"
    },
    {
      "term": "truck",
      "definition": "a motor vehicle designed or adapted primarily for the carriage of goods or materials, having a payload capacity exceeding fifteen hundred kilograms and includes a rigid or articulated truck, loader, delivery van, pickup and any other vehicle equipped with a goods-carrying body or container.",
      "source_provision": "sec2"
    }
  ]
}
