{
  "id": "pk-newspaper-employees-conditions-of-service-act-1973",
  "type": "statute",
  "title": "Newspaper Employees (Conditions of Service) Act, 1973",
  "title_en": "Newspaper Employees (Conditions of Service) Act, 1973",
  "short_name": "NEOSA",
  "status": "in_force",
  "issued_date": "1973-08-10",
  "in_force_date": "1973-08-10",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUZWJp-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Newspaper Employees (Conditions of Service) Act, 1973 (LVIII of 1973) published by The Pakistan Code (Labour Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.―(1) This Act may be called the",
      "content": "Newspaper Employees (Conditions of Service) Act 1973.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or",
      "content": "context,\n(a)         “Board” means the Wage Board constituted under section 9;\n(b)         “Commission” means the National Industrial Relations Commission\nconstituted under section 22A of the Ordinance;\n(c)         “newspaper” means any printed periodical work containing public news or\ncomments on public news and includes such other class of printed periodical\nwork as may, from time to time, be notified in this behalf by the Federal\nGovernment in the official Gazette;\n(d)         “newspaper employee” means any person employed to do any work in, or in\nrelation to, any newspaper establishment and Includes;—\n(i)        a whole-time journalist, including an editor, a leader writer, news\neditor, feature writer, reporter, correspondent, copy tester, cartoonist,\nnews- photographer, caligraphist and proof-reader; and\n(ii)       a whole-time non journalist, including a manager, clerk, stenotypist,\nprinting engineer, linotype operator, composer, type-setter, photo\nstudio attendant, printing worker, an accountant and an office peon;\n1\nFor Statement of Objects and Reasons, see Gaz. of P., 1973, Ext., Pt. III, p. 1332.\n(e)        “newspaper establishment” means an establishment under the control of any\nperson or body of persons whether incorporated or not, for the production,\nprinting or publication of one or more newspapers or for conducting any\nnews agency or syndicate ;\n(f)        “Ordinance” means the Industrial Relations Ordinance, 1969(XXI of 1969);\n(g)        “prescribed” means prescribed by rules made under this Act ;\n1\n[(gg) “Tribunal” means a Tribunal constituted under section 12A;]\n(h)        “wages” means wages as defined in the Payment of Wages Act, 1936 (IV of\n1936) and includes any gratuity or other payment declared as wages by the\nBoard; and\n(i)        all words and expressions used but not defined in this Act and defined in the\nOrdinance shall have the meanings respectively assigned to them in the\nOrdinance."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Order of appointment, etc. A newspaper establishment employing a newspaper",
      "content": "employee shall, at the time of his appointment, transfer or promotion, furnish to him an order\nin writing showing the terms and conditions of his service."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Termination of employment. The services of a newspaper employee shall not be",
      "content": "terminated by a newspaper establishment without good cause shown, through a notice, in writing, of\nsuch termination—\n(a)        of one month, if the total period of continuous service of the newspaper\nemployee with the newspaper establishment is not less than three months but\nless than two years ;\n(b)        of two months, it the total period of such service is not less than two years but\nless than three years; and\n(c)        of three months, if the total period of such service is not less than three years ;\nProvided that, if the order of appointment of the newspaper employee provides notice of a\nlonger period, notice shall be given in accordance with the terms of such order:\nProvided further that the services of a newspaper employee may be terminated at any time on\npayment of wages in lieu of the requisite notice."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Provident Fund.―(1) Every newspaper establishment shall constitute, for the benefit",
      "content": "of its newspaper employees, a Provident Fund in such manner as may be prescribed.\n1\nNew clause (gg) ins. by the Newspaper Employees (Conditions of Service) (Amdt.) Act, 1975 (56 of 1975), s. 2.\n(2) The Provident Fund shall be held and administered by a Board of Trustees consisting of\nan equal number of representatives of the newspaper establishment constituting the Fund and of the\nnewspaper employees employed in it, chosen and appointed in such manner as may be prescribed.\n(3) Every newspaper employee shall, after the completion of the first two years of his service\nwith any newspaper establishment, subscribe to the Provident Fund, every month, a sum not less\nthan 6-1/4 per cent and not more than 10 per cent of his monthly wages, and the employer in relation\nto that establishment shall contribute to it an equal amount.\n(4) During the first three months of his service, the newspaper employee may or may not, at\nhis option, subscribe to the Provident Fund and, if he so subscribe, the employer in relation to the\nnewspaper establishment shall subscribe to it an equal amount.\n(5) A newspaper establishment shall be deemed to be a public Institution for the purposes of"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Hours of work. Subject to the Factories Act, 1934 (XXV of 1934), and any rules that",
      "content": "may be made, or deemed to have been made under this Act, no newspaper employee shall be\nrequired to work in any newspaper establishment for more than forty-two hours in a week, exclusive\nof the time for meals.\nExplanation.―For the purposes of this section, ‘week’ means a period of seven days\nbeginning at mid-night on Saturday."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Leave. Without prejudice to such holidays as may be prescribed, every newspaper",
      "content": "employee shall be entitled to―\n(a)        earned leave on full wages, for not less than one eleventh of the period spent\non duty;\n(b)        leave on medical certificate on one-half of the wages, for not less\nthan one-eighteenth of the period of service subject to a minimum period of\nten days in a calendar year ; and\n(c)        Fifteen day’s casual leave of absence with wages in a calendar year."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Medical care.―(1) A newspaper employee shall be entitled, together with his dependents,",
      "content": "to medical care at the cost of the newspaper establishment in, or in relation to, which he is employed.\n(2) Medical care shall, subject to rules made under this Act, include―\n(a)        treatment by a medical practitioner registered under the 1[Medical and Dental\nCouncil Ordinance, 1962 (XXXII of 1962)], both at the clinic of such practi-\ntioner and at the residence of the newspaper employee;\n(b)        treatment by specialists in hospitals and by such specialists as may be\navailable outside hospitals ;\n1\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and Sch., II.\n(c)    essential pharmaceutical supplies as prescribed by a medical practitioner\nunder clause (a) or by a specialist under clause (b) ; and\n(d)    hospitalization, where necessary.\n(3) The manner in which and the scale on which medical care shall be supplied shall be such\nas may be prescribed.\nExplanation.―For the purpose of this section, “dependents” means the spouse, widowed\nmother and legitimate sons and daughters, including step-sons and step-daughters, of a newspaper\nemployee, residing with and wholly dependent upon him."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Wage Board.―(1) The Federal Government may, whenever it so considers",
      "content": "necessary, by notification in the official Gazette, constitute a Wage Board for fixing rates of wages\nin respect of newspaper employees in accordance with the provisions of this Act.\n(2) The Board shall consist of a Chairman appointed by the Federal Government, who\nshall be a person who has been or is, or is qualified to be a Judge of a High Court, and as many\nmembers to advise the Chairman as may be appointed by the Federal Government, so, however, that\none half of the members shall be persons representing the newspaper employees and the other half\nthe employers in relation to newspaper establishments.\n(3) The Board shall give its decision within a period of one hundred and eighty days from\nthe day of its constitution."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Fixations of wages.―(1) In fixing rates of wages in respect of newspaper",
      "content": "employees, the Board may take into consideration the cost of living, the prevalent rates of wages of\ncomparable employments, the circumstances relating to the newspaper industry in different regions\nof the country, and any other circumstances which to the Board may seem relevant.\n(2) The Board may fix rates of wages for time work and for piece work.\n(3) The decision of the Board fixing rates of wages shall be communicated as soon as\npracticable to the Federal Government."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Publication of the decision of the Board.―(1) The decision of the Board shall, within",
      "content": "a period of one month from the date of its receipt by the Federal Government, be published in\nsuch manner as may be prescribed.\n(2) The decision of the Board published under subsection (1) shall come into operation on\nsuch date as may be specified in the decision, and where no date is so specified, it shall come into\noperation on the date of its publication, and shall remain in force until it is modified or varied by a\nlater decision of the Board published in the manner provided in sub- section (1)."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Decision of Board to be deemed to be an award of the Commission.―A decision",
      "content": "of the Board published under section 11 shall be deemed to be an award of the Full Bench of the\nCommission and, subject to the provisions of this Act, all the provisions of the Ordinance applicable\nto such award, including the provisions of sections 51 and 55 thereof, so for as may be and with the\nnecessary modifications, shall apply to the decision of the Board.\nExplanation.―For the avoidance of doubt, i t is hereby declared that the decision of the\nSecond Wage Board for Working Journalists published in the Extraordinary issue of the Gazette of West\nPakistan, dated the 7th January, 1970, shall be deemed to have been published as required by the\nOrdinance.\n1\n[12A. Tribunal.―(1) The Federal Government may, by notification in the official Gazette,\nconstitute a Tribunal consisting of one or more members to implement the decision of the Board\nunder section 11.\n(2) The Chairman and members of the Tribunal shall be appointed by the Federal\nGovernment on such terms and conditions as it may determine.\n(3) Where the Tribunal consists of one member only, that member, and, where the Tribunal\nconsists of more members than one, the member designated by the Federal Government, shall be\nthe Chairman of the Tribunal.\n(4) The Chairman of the Tribunal shall be a person who has been, or is, or is\nqualified to be, a Judge of a High Court.\n(5) The qualifications for appointment as a member of the Tribunal shall be determined by\nthe Federal Government.]"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Powers of the 2[Tribunal].―(1) Notwithstanding anything contained in section 64 of",
      "content": "the Ordinance, the 3[Tribunal] shall have power―\n(a)        to try an offence punishable under section 55 of the Ordinance, if the\noffence relates to failure to implement any decision of the Board;\n(b)        of its own motion, or on the application of a party, to withdraw from\nany Court (except the Supreme Court or a High Court) any\napplication, proceeding or appeal relating to such an offence and dispose of\nit; and\n(c)        refer any such application, proceeding or appeal to any such competent\nCourt for disposal.\n(2) Any Court to which any application, proceeding or appeal is referred under clause\n(c) of subsection (1) shall enquire into it and dispose of the case as if the application or appeal\nhad originally been made to it or, as the case may be, the proceeding had originally commenced\nbefore it.\n1\nSubs. by the Newspaper Employees (Conditions of Service) (Amdt.) Act, 1976 (78 of 1976), s. 2, for s. 12A, which was previously ins. by the\nNewspaper Employees (Conditions of Service) (Amdt.) Act, 1975 (56 of 1975), s. 3.\n2\nSubs. by Act 78 of 1976, s. 3, for “Commission”.\n3\nSubs. by Act 56 of 1975, s. 4, for “Commission”.\n1\n(3) For the trial of an offence referred to in sub-section (1), the [Tribunal] shall follow the\nsame procedure and exercise the same powers as 2[the Commission] follows and exercises for the\ntrial of an offence under the Ordinance, and the provisions of the Ordinance other than the\nprovisions of sub-section (9) of section 22A, thereof, shall so far as may be and with the necessary\nmodifications, apply to such trial.\n3 4\n[ [(4)] The Tribunal shall have the power to issue a direction which a Labour Court has\nunder sub-section (1) of section 51 of the Ordinance.].\n5\n[(5) Subject to any rules of procedure which may be prescribed, the Tribunal may, for the\npurpose of determining the category of a newspaper establishment or the grade of a newspaper\nemployee or otherwise holding an inquiry for the purpose of implementing the decision of the\nBoard, exercise the same powers and follow the same procedure, so far as may be and with the\nnecessary modifications, as the Commission may exercise or follow for the purpose of adjudicating\nan industrial dispute under the Ordinance.\n(6) The Tribunal may require a newspaper establishment to file a declaration in such form\nand give such information as the Tribunal may determine or require.].\n6\n[13A. Appeal from sentence of Tribunal. Any person convicted and sentenced by the\nTribunal under section 55 of the Ordinance to imprisonment for any period not less than six months\nmay, with the leave of the Supreme Court, prefer an appeal to that Court.]\n[13B. Benches of the Tribunal, etc.― (1) The Chairman of the Tribunal shall\n7\nexercise general superintendence over its affairs.\n(2) Where the Tribunal consist of more members than one,―\n(a)       the Chairman shall constitute as many benches of the Tribunal consisting\nof one or more members of the Tribunal as he may deem fit; and\n(b)       if any member of the Tribunal who constitutes a bench, or is a member\nof a bench, is absent from, or otherwise unable to attend, any sitting of a\nbench, the Chairman of the Tribunal may take over the case himself, or\ntransfer it to another bench, for disposal; and the Chairman, or, as the case\nmay be, the other bench, may continue the proceedings from the stage they\nhad reached.].\n1\nSubs. by the Newspaper Employees (Conditions of Service) (Amdt.) Act, 1975 (56 of 1975), s. 4, for “Commission”.\n2\nSubs. ibid., for “it”.\n3\nNew sub-section (3A) added ibid., s. 4.\n4\nRe-numbered as sub-section (4) and shall be deemed to have been so re-numbered on the twenty-first day of July, 1975 by the Newspaper\nEmployees (Conditions of Service) (Amdt.) Act, 1976 (78 of 1976), s. 3.\n5\nNew sub-sections (5) and (6) added and shall be deemed always to have been so added on the twenty-first day of July, 1975, ibid.\n6\nNew S. 13A ins. by Act 56 of 1975, s. 5.\n7\nNew S. 13B added by Act 78 of 1976, s. 4."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Powers and procedure of the Board. Subject to any rules of procedure which may be",
      "content": "prescribed, the Board may, for the purpose of fixing rates of wages, exercise the same powers\nand follow the same procedure, so far as may be and with the necessary modifications, as the\nCommission may exercise or follow for the purpose of adjudicating an industrial dispute under the\nOrdinance."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Decision of the Board to be binding on all employers. The decision of the Board",
      "content": "shall be binding on all employers in relation to newspaper establishments, and every newspaper\nemployee shall be entitled to be paid wages at a rate which shall, in no case, be less than the rate of\nwages fixed by the Board."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Powers of Board to fix interim rates of wages.―(1) Notwithstanding anything",
      "content": "contained in this Act, where the Board is of the opinion that it is necessary so to do, it may, by\nnotification in the official Gazette, fix interim rates of wages in respect of newspaper employees.\n(2) Any interim rate of wages so fixed shall be binding on all employers in relation to\nnewspaper establishments, and every newspaper employee shall be entitled to be paid wages at a\nrate which shall, in no case, be less than the interim rate of wages fixed under sub- section (1).\n(3) Any interim rate of wages fixed under subsection (1) shall remain in force until the\ndecision of the Board comes into operation under sub-section (2) of section 11.\n1\n[16A. Additional power of Board and Tribunal. The Board and the Tribunal shall have\nthe same power to punish their respective contempts as the Commission has under section 22C of\nthe Ordinance."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. W. P. Ordinance VI of 1968 to apply to newspaper establishment. The provisions of",
      "content": "(W.P. Ord. No. V of 1968), as in force for the time being, other than those contained in Standing\nOrder 2 and clauses (1) and (2) of Standing Order 12 thereof, shall, subject to the other provisions\nof this Act, apply to every newspaper establishment wherein ten or more newspaper employees are\nemployed or were employed on any day of the twelve months preceding the coming into force of\nthis Act as if such newspaper establishment were an industrial establishment to which the aforesaid\nOrdinance has been applied by a notification under clause (c) of sub-section (4) of section 1 thereof,\nand as if a newspaper employee were a workman within the meaning of that Ordinance [:]2\n3\n[Provided that the provisions of this section shall not apply to a person who is employed as\nthe editor of a newspaper].\nExplanation.―For the avoidance of doubt, it is hereby declared that provisions of Standing\nOrders 10B and 11, clauses (6) and (8) of Standing Order 12 and Standing Order 15 of the aforesaid\nOrdinance shall apply only to a newspaper establishment which fulfils the conditions laid down\ntherein.\n1\nNew S. 16A added by the Newspaper Employees (Conditions of Service) (Amdt.) Act, 1976 (78 of 1976), s. 5.\n2\nSubs. ibid., s. 6, for full-stop.\n3\nProviso added ibid."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Ordinance XXIII of 1969 to apply to newspaper employees. Subject to the other",
      "content": "provisions of 1[this Act] the provisions of the Ordinance shall apply to, or in relation to,\nnewspaper employees, as they apply to, or in relation to, workmen within the meaning of the\nOrdinance :\nProvided that nothing in this section applies to a newspaper employee\n(i)        who is employed mainly in a managerial or administrative capacity 2[or is\nthe editor of a newspaper,] or\n(ii)       who, being employed in a supervisory capacity, performs, either because of\nthe nature of duties attached to his office or by reason of the powers vested\nin him functions mainly of a managerial nature."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Effect of laws and agreements inconsistent with this Act.―(1) The provisions of this",
      "content": "Act shall have effect notwithstanding anything inconsistence therewith contained in any other law or\nin the terms of any award, agreement or contract of service, whether made before or alter the coming\ninto force of this Act:\nProvided that, subject to the provisions of section 73 of the West Pakistan\nEmployees’ Social Security Ordinance, 1965 (W.P. Ord. No. X of 1965), where under any such\naward, agreement, contract of service or otherwise, a newspaper employee is entitled to benefits in\nrespect of any matter which are more favourable to him than those to which he would be entitled\nunder this Act, the newspaper employee shall continue to be entitled to the more favourable benefits\nin respect of that matter notwithstanding that ho receives benefits in respect of other matters under\nthis Act.\n(2) Nothing contained in this Act shall be construed to preclude any newspaper employee\nfrom entering into an agreement with an employer for granting him rights or privileges in respect of\nany matter which are more favourable to him than those to which he would be entitled under this\nAct."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Inspectors.―(1) The Federal Government may, by notification in the official Gazette,",
      "content": "appoint such persons as it thinks fit to be Inspectors for the purposes of this Act within such local\nlimits as it may assign to them respectively.\n(2) An Inspector shall perform within the local limits assigned to him such functions in\nrelation to the implementation of the decision of the Board published under section 11 as may be\nprescribed.\n(3) An Inspector may\n(a)        at all reasonable hours enter on the premises of any newspaper establishment\nand make such examination of any register or document relating to the\nimplementation of the decision of the Board published under section 11 and\ntake on the spot or otherwise evidence of any person relevant to such\nimplementation as he may deem necessary ;\n1\nSubs by newspaper employees (conditions of service) Act, 1976 (Act 78 of 1976)., s. 7, for “this Ordinance”.\n2\nIns. ibid.,\n(b)        exercise such other powers of inspection as he may deem necessary for\ncarrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Offences and penalties.―(1) Whoever contravenes the provisions of section 6 shall be",
      "content": "punishable with fine which may extend to two thousand rupees.\n(2) Whoever contravenes any of the provisions of this Act or any rule made, or deemed to\nhave been made, thereunder shall, if no other penalty is elsewhere provided by or under this Act for\nsuch contravention, be punishable with fine which may extend to one thousand rupees.\n(3) Where the person guilty of an offence under this Act is a company or other body\ncorporate, every director, manager, secretary and other officer thereof shall, unless he proves that the\noffence was committed without his knowledge or that he exercised all due diligence to prevent its\ncommission also be guilty of the same offence and liable to the same punishment.\n(4) No Court shall take cognizance of an offence under this Act unless the complaint thereof\nis made within six months of the date on which the offence is alleged to have been committed.\n1\n[21A. Chairman, etc., to be public servants. The Chairman of the Board and the Chairman\nand members of the Tribunal shall be deemed to be public servants within the meaning of\nsection 21 of the Pakistan Penal Code (Act XLV of 1860)]."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Indemnity. No suit, prosecution or other legal proceedings shall lie against any person or",
      "content": "authority for anything which is in good faith done or intended to be done in pursuance of this Act or\nany rule made, or deemed to have been made, thereunder."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Power to make rules.―(1) The Federal Government may, by notification in the official",
      "content": "Gazette, make rules for carrying out the purposes of this Act.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules\nmay provide for all or any of the following matters, namely:―\n(a)        hours of work of newspaper employees ;\n(b)        holidays, earned leave, leave on medical certificate, casual leave or any\nother kind of leave admissible to newspaper employees;\n(c)        the constitution of Provident Fund;\n(d)        the constitution of Board of Trustees for the administration of Provident\nFund;\n(e)        the procedure for regulating the management and administration of Provident\nFund and the conditions subject to which such Fund shall operate;\n(f )       the procedure to be followed by the Board in fixing rates of wages;\n1\nNew S. 21A added by the Newspaper Employees (Conditions of Service) (Amdt.) Act, 1976 (78 of 1976)., s. 8.\n(g)        the manner in which the decision of the Board may be published; 1*\n2\n[(gg) the procedure to be followed by the Tribunal in determining the categories of\nnewspaper establishments or grades of newspaper employees or holding an\ninquiry for the purpose of implementing the decision of the Board; and].\n(h) any other matter which is to be or may be prescribed.\n3\n[23A. Continuation of powers. The powers conferred by this Act on the Federal\nGovernment shall, as from the fourteenth day of August, 1973, continue to be exercised by the\nFederal Government.]"
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Repeal and savings.―(1) The Working Journalists (Conditions of Service) Ordinance,",
      "content": "1960, (XVI of 1960), is hereby repealed.\n(2) Notwithstanding the repeal of the said Ordinance, and without prejudice to the provisions\nof section 24 of the General Clauses Act, 1897 (X of 1897), anything done, appointment made,\nnotification, order or rule issued, form prescribed proceedings commenced, or action taken under\nthat Ordinance shall, so far as it is not inconsistent with the provisions of this Act, continue in\nforce and be deemed to have been made, issued or taken under the provisions of this Act.\n_____________\nLast Uploaded on 22.11.2023\n1\nThe word “and” omitted by the Newspaper Employees (Conditions of Service) (Amdt.) Act, 1976 (78 of 1976), s. 9.\n2\nNew Cl. (gg) ins. ibid.,\n3\nNew S. 23A ins. and shall be deemed to have been so ins. on the 14th day of August, 1973, by the Labour Laws (Amdt.) Act, 1975 (11 of 1975), s. 2\nand Sch.,"
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Wage Board constituted under section 9;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the National Industrial Relations Commission constituted under section 22A of the Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "newspaper",
      "definition": "any printed periodical work containing public news or comments on public news and includes such other class of printed periodical work as may, from time to time, be notified in this behalf by the Federal Government in the official Gazette;",
      "source_provision": "sec2"
    },
    {
      "term": "newspaper employee",
      "definition": "any person employed to do any work in, or in relation to, any newspaper establishment and Includes;— (i) a whole-time journalist, including an editor, a leader writer, news editor, feature writer, reporter, correspondent, copy tester, cartoonist, news- photographer, caligraphist and proof-reader; and (ii) a whole-time non journalist, including a manager, clerk, stenotypist, printing engineer, linotype operator, composer, type-setter, photo studio attendant, printing worker, an accountant and an office peon; 1 For Statement of Objects and Reasons, see Gaz. of P., 1973, Ext., Pt. III, p. 1332.",
      "source_provision": "sec2"
    },
    {
      "term": "newspaper establishment",
      "definition": "an establishment under the control of any person or body of persons whether incorporated or not, for the production, printing or publication of one or more newspapers or for conducting any news agency or syndicate ;",
      "source_provision": "sec2"
    },
    {
      "term": "Ordinance",
      "definition": "the Industrial Relations Ordinance, 1969(XXI of 1969);",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act ; 1 [(gg) “Tribunal” means a Tribunal constituted under section 12A;]",
      "source_provision": "sec2"
    },
    {
      "term": "wages",
      "definition": "wages as defined in the Payment of Wages Act, 1936 (IV of 1936) and includes any gratuity or other payment declared as wages by the Board; and (i) all words and expressions used but not defined in this Act and defined in the Ordinance shall have the meanings respectively assigned to them in the Ordinance.",
      "source_provision": "sec2"
    }
  ]
}
