{
  "id": "pk-non-performing-assets-and-rehabilitation-of-industrial-undertaking-legal-proceed",
  "type": "statute",
  "title": "Non-Performing Assets and Rehabilitation of Industrial Undertaking (Legal Proceedings) Ordinance, 2000",
  "title_en": "Non-Performing Assets and Rehabilitation of Industrial Undertaking (Legal Proceedings) Ordinance, 2000",
  "short_name": "NAARO",
  "status": "in_force",
  "issued_date": "2000-11-16",
  "in_force_date": "2000-11-16",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FobZk%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Non-Performing Assets and Rehabilitation of Industrial Undertaking (Legal Proceedings) Ordinance, 2000 (LVIII of 2000) published by The Pakistan Code (Banking/Financial Laws).",
  "provisions": [
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Removal of difficulties",
      "content": "INDUSTRIAL UNDERTAKINGS (LEGAL PROCEEDINGS) ORDINANCE,\n2000\nORDINANCE No. LVIII of 2000\n[17th November, 2000]\nAn Ordinance to provide for expeditious legal remedies for matters relating to non-performing\nassets and recovery of the outstanding amounts payable to banks and financial institutions to make\nthem attractive for privatization and to promote the revitalization of nation’s economy and\nrehabilitation and restructuring of industrial undertakings\nWHEREAS it is expedient in the public interest to provide for expeditious legal remedies in\nthe matters relating to non-performing assets and recovery of the outstanding amounts payable to the\nbanks and the financial institutions to make them attractive for privatization and to promote national\neconomy by making provisions for restructuring, rehabilitation, management, sale, transfer and\nrealization of non-performing assets and loans and for matters connected therewith or ancillary thereto;\nAND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the\nProclamation of Emergency of the fourteenth day of October, 1999 and the Provisional Constitution\nOrder No. 1 of 1999;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of\nOctober, 1999, and the Provisional Constitution Order No. 1 of 1999, as well as the Provisional\nConstitution (Amendment) Order, 1999 (Order No. 9 of 1999), and in exercise of all powers enabling\nhim in that behalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate\nthe following Ordinance:___\nl. Short Title, extent and commencement:___ (1) This Ordinance may be called the Non-\nperforming Assets and Rehabilitation of Industrial Undertakings (Legal Proceedings) Ordinance,"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_ (1) In this Ordinance, unless there is anything repugnant in the subject or\ncontext,—\n(a)     “chief Executive” means the Chief Executive officer of the Corporation\nappointed under the CIRC Ordinance;\n(b)       “CIRC Ordinance” means the Corporate and Industrial Restructuring\nCorporation Ordinance, 2000 (L of 2000).\n(c)       “Corporation” means the Corporate Industrial Restructuring Corporation\nestablished under the CIRC Ordinance;\n(d)       “industrial undertaking” means any undertaking pertaining or relating to non-\nperforming asset of a financial institution;\n(e)       “financial asset” means any short, medium or long term interest and non-interest\nbearing loan, finance advance, lease, installment, term finance certificate,\nparticipation term certificate, musharaka, modaraba, profit and loss sharing\nagreement, redeemable capital, guarantee or contractual right to receive\npayment of money in respect of sums advanced or committed to an obligor by\na financial institution including collateral pertaining thereto;\n1\n[(f) “financial institution” means any bank or other financial institution operating in\nPakistan wherein the Federal Government hold any equity, as specified in the\nSchedule;]\n(g)       “non-performing asset” means any financial asset-\n(a)       which is held as an asset on the books of a financial institution;\n(b)       with respect to which the obligor has been in arrears on any payment obligation\nfor a period more than three hundred and sixty-five days, including-\n(i)     collateral with respect to any financial asset; and\n(ii)    a whole or partial right or interest of a financial institution in any\nfinancial asset, that otherwise constitutes a non-performing asset\nincluding a financial asset with respect to which the financial institution\nhas an ongoing funding obligation; and\n(c)       with respect to which the obligor’s outstanding payment obligation to any\nfinancial institution exceeds thirty million rupees:\nProvided that the Federal Government may, by notification in the official Gazette, alter, reduce\nor increase the said amount as and when it deems fit;\n(h)       “obligor” means any individual, proprietorship concern, company or other body\ncorporate, trust, partnership or other entity that has, with respect to a non-\nperforming asset, a contractual or legal obligation or duty to make payment,\neffect performance, provide security, or collateral with respect to any financial\nasset whether as principal, surety, guarantor or otherwise and whether such\nobligation is primary, secondary, matured or contingent; and\n(i)     registered interest” means any right or interest in a non-performing asset duly\nregistered under the Companies Ordinance, or its predecessor statue or under\n1984 any other law for the time being in force;\n(j)     “rules” means the rules made under this Ordinance; and\n(k)     “Schedule” means the Schedule annexed to the CIRC Ordinance.\n(2) All other terms and expressions used but not defined in this Ordinance shall have the\nmeanings assigned to them in the CIRC Ordinance."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Ordinance to override other laws",
      "content": "_ The provisions of this Ordinance shall have effect\nnotwithstanding anything contained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Jurisdiction of High Court",
      "content": "_ (1) Notwithstanding anything contained in any other law for\nits territorial jurisdiction shall exercise exclusive civil and criminal jurisdiction:\n(a)     to adjudicate and decide all claims, legal proceedings, cases for recovery of non-\nperforming asset, outstanding amount against obligor and matters related to,\narising from or in connection with the CIRC Ordinance, and coming within the\npurview and operation of the provisions of CIRC Ordinance and whether\npending on the commencement of this Ordinance or transferred to the High\nCourt in pursuance of section 6 or which may be filed hereafter under this\nOrdinance; and\n(b)     to try offences punishable under this Ordinance or the CIRC Ordinance.\n(2) It is hereby declared for removal of doubt that subject to the provisions of this Ordinance,\nand save as herein provided, a High Court and any other Court of Tribunal shall continue to exercise\njurisdiction as before under the Code of Civil Procedure, 1908, (IV of 1908) the Banking Companies\n(Recovery of Loans, Advances, Credits and Finances) Act, 1997, (XV of 1997) the Companies\nOrdinance, 1984, (XLVII of 1984) the Code of Criminal Procedure, 1898, the Offences in Respect of\nBanks (Special Courts) Ordinance, 1984(IX of 1984) and any other law for the time being in force, in\nall suits, cases and legal proceedings whether civil or criminal, applications and appeals to which the\nprovisions of CIRC Ordinance and this Ordinance do not apply.\nExplanation.—The “High Court” within the meaning of subsection (2) shall also include the\n“High Court” as referred to in section 2 of the Banking Companies (Recovery of Loans, Advances,\nCredits and Finance) Act 1997. (XV of 1997)\n(3) For the purposes of this Ordinance there shall be one or more Benches in the High Court\nconsisting of one or more Judges to be constituted by the Chief Justice to adjudicate the cases under\nthis Ordinance.\n(4) The Chief Justice of a High Court may for the purposes of this Ordinance suo moto or on\nan application of any party to the proceedings before it or for any other sufficient reason assign one or\nmore cases covered under sub-sections (1) and (2) to any Bench of High Court constituted under sub-\nsection (3) for trial where the subject matter of the claim or controversy is the same or the parties are\nsubstantially the same or where common question of law and fact are involved in relation to a non-\nperforming assets or where there is substantially common evidence relating thereto if the ends of\njustice so require.\n(5) The cases under this Ordinance shall ordinarily be lead at the principal seat of the concerned\nHigh Court:\nProvided that the Chief Justice may for sufficient cause order a case to be heard at any\npermanent Branch of a High Court if in his opinion the same is necessary for convenience of the Parties\nand ends of Justice."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Procedure and Power of High Court",
      "content": "_ Subject to the provisions of this Ordinance, the\nHigh Hour under this Ordinance shall—\n(i)     in exercise of its civil jurisdiction,—\n(a)     follow the procedure, as nearly as possible, as provided in the Code of Civil\nProcedure, 1908: (Act V of 1908)\nProvided that the High Court may, in its discretion, having regard to the facts of the case, follow\nthe summary procedure, as nearly as possible, provided for in Order XXXVII in the First Schedule to\nthe said Code; and\n(b)     have all the powers, including passing of decree and its execution, as vested in\nthe Civil Court under the Code of Civil Procedure, 1908; (Act V of 1908) and\n(ii)    in exercise of its criminal jurisdiction follow the procedure and exercise\nthe powers vested in it by or under the Code of Criminal Procedure, 1898\n(Act V of 1998) or the Offences in Respect of Banks (Special Courts)\nOrdinance, 1984 (Act IX of 1984)or any other law for the time being in\nforce.\n(iii)   in exercise of its banking jurisdiction, shall follow the procedure and\nhave all the powers including passing of decree and its execution as\nvested in a Banking Court under the Banking Companies (Recovery of\nLoans, Advances, Credits and Finances) Act, 1997 (Act of 1997) subject\nto such limitations and defence as provided under the said law, and\n(iv)    in exercise of its company jurisdiction, follow the procedure and have\nall the powers vested in a High Court under the Companies Ordinance,\n1984 (Act XLVII of 1984) subject to such defence as is available under\nthe said law."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Transfer of Pending proceedings and institution of new cases",
      "content": "_ (1) All such legal\nproceedings, suits, applications and cases pertaining to the obligor in relation to the non-performing\nassets and the collateral related thereto in which the Corporation has acquired all rights, title, interests,\nbenefits and privileges of a financial under the CIRC Ordinance after approval duly granted by the\nBoard of Directors constituted thereunder and after such cases are approved by the Board as coming\nwithin the purview and operation of the provisions of CIRC Ordinance and due compliance thereof,\nincluding (a) proceedings following the filing of an arbitration award, (b) applications under sub-\nsection (2) of section 12 of Code of Civil Procedure, 1908 (Act V of 1908) or any suits, applications,\nincluding execution applications, legal proceedings or appeals thereunder, and (c) proceedings for the\nexecution of a decree within the jurisdiction of any Court including those, pending in any Banking\nCourt constituted under the Banking Companies (Recovery of Loans, Advances, Credits and Finances\nAct, 1997, (Act XV of 1997) or any other Court, Tribunal or a High Court, and (b) any winding up\nproceedings irrespective of the appointment of liquidator, shall stand transferred or be deemed to be\ntransferred to the High Court having jurisdiction under this Ordinance in the manner herein provided.\n(2) On transfer of proceedings under sub-section (1), the High Court shall require the\nattendance of the parties and the liquidators or the court auctioneer or the receiver, as the case may be.\n(3) The High Court shall subject to the provisions of this Ordinance, proceed in respect of\nproceedings transferred to it under sub-section (1) from the stage which the proceedings had reached\nimmediately prior to the transfer and shall not be bound to recall and re-hear any witness and may act\non the evidence already recorded before the Court or Tribunal from which the proceedings were\ntransferred.\n(4) The Corporation shall with the permission of the High Court submit to it the particulars and\naccounts required at the time of transfer or institution of the cases under this Ordinance shall be\nprovided to the Corporation, on its request, by the concerned financial institution.\n(5) Notwithstanding the provisions of the Companies Ordinance, 1984 (Act XLVII of 1984) or\nany other law for the time being in force, in cases transferred to the High Court under sub-section (I)\nin which a liquidator or a court auctioneer or a receiver has already been appointed, the Corporation\nmay apply to the High Court for replacing the existing liquidator or a court auctioneer or a receiver, as\nthe case may be, in respect of the non-performing asset or undertaking thereof and the High Court shall\nthereupon appoint the Chief Executive of the Corporation or his nominee in place of the liquidator or\na court auctioneer or a receiver, as the case may be, to carry out all acts and exercise all powers of the\nliquidator or a court auctioneer or a receiver as it may deem fit, and accordingly the outgoing liquidator\nor a court auctioneer or a receiver, as the case may be, shall be under obligation to hand over possession\nand custody of the entire property and industrial undertaking in his possession and control along with\nthe entire record to the Chief Executive or his nominee:\nProvided that High Court may allow the existing liquidator to function as co-liquidator having\nregard to the progress of the work done by him for reasons to be recorded:\nProvided further that after the commencement of this Ordinance, the High Court may appoint\nthe Chief Executive or his nominee as a liquidator or an auctioneer or a receiver, as the case may be,\nin all cases instituted under this Ordinance:\nProvided further that the provisions of this sub-section shall not apply where an Official\nAssignee has already been appointed to act in any case in respect of the non-performing asset or\nindustrial undertaking by a High Court whose rules provide for the appointment of such Official\nAssignee:\nProvided further that where the rules of a High Court provide for the appointment of an Official\nAssignee, the Corporation may apply to such High Court for the appointment of Chief Executive of\nthe Corporation or his nominee as co-liquidator in appropriate cases and the High Court in such cases\nmay pass such order as it deems fit having regard to the facts and circumstances of the cases.\n(6) In the cases instituted under this Ordinance, the Chief Executive or his nominee shall be\nappointed as a liquidator or a court auctioneer or a receiver, as the case may be. On being appointed\nas such by the High Court under sub-section (5) or under this sub-section, the liquidator or the court\nauctioneer or the receiver, as the case may be, shall be responsible to render account, perform all\nfunctions and attend to all matters in accordance with the provisions of the Companies Ordinance,\n1984 (XLVIII of 1984) and the rules and orders of the High Court or in any other manner the High\nCourt deems fit."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Institution of suits etc, by the Corporation",
      "content": "_ The Corporation may institute, file, conduct\nand defend any suit or legal proceeding or appeal under, and in accordance with, the provisions of this\nOrdinance and the High Court shall conclude such suit or legal proceeding within a period of ninety\ndays."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Trial of Cases",
      "content": "_ (1) Subject to the provisions of this Ordinance, all suits, cases, legal\nproceedings including execution proceedings and all other applications and appeals relating to\nrecovery of outstanding amounts by or against a financial institution in respect of a non-performing\nasset and an obligor pending in any court or tribunal on the commencement of this Ordinance under\nany law including the Code of Civil Procedure, 1908, (Act V of 1908) Banking Companies (Recovery\nof Loans, Advances, Credits and Finances) Act. 1997 (Act XV of 1997) and Companies Ordinance,\n1984 (Act XLVII of 1908) and transferred to the High Court in pursuance of section 6 shall be decided\nand disposed of by the High Court in accordance with the provisions of the respective law under which\nthe same were filed or instituted:\nProvided that in cases where the obligor has filed any suit, application, legal proceeding or\nappeal against a financial institution which has also filed a legal proceeding against the obligor, any\nparty to such proceeding may apply to Chief Justice of the High Court with a prayer for consolidation\nof such proceedings under this Ordinance before the same Bench to avoid conflict of judicial decisions\nand multiplicity of proceedings.\n(2) Subject to the provisions of this Ordinance, the Corporation may institute and file any suit,\ncase or legal proceedings, including execution proceedings, before the High Court having jurisdiction\nhereunder in accordance with the procedure provided under the Banking Companies (Recovery of\nLoans, Advances, Credits and Finances) Act. 1997 (Act XV of 1997) the Companies Ordinance, 1984\n(Act XLVII of 1984) or the Offences in Respect of Banks (Special Courts) Ordinance, 1984 (Act IX\nof 1984) and the High Court shall have the power to deal with such cases in accordance with the\nprovisions of such legislations.\n(3) In case any obligor intends to file any suit, application or legal proceedings against the\nCorporation, he may file such suit, application or legal proceedings in accordance with the. provisions\nof the Banking Companies (Recovery of Loans, Advances, Credits and Finances) Act. 1997 (Act XV\nof 1997) or any other relevant law.\n(4) Subject to sub-section (3), any right available to a banking company or the borrower under\n1997) or the Companies Ordinance, 1984 (Act XLVII of 1984) or the Offences in Respect of Banks\n(Special Courts) Ordinance, 1984 (Act IX of 1984) shall be available to the Corporation or the obligor,\nas the case may be, under this Ordinance.\n(5) It is hereby declared for removal of doubt that the cases to be instituted and filed hereunder\nshall only be in relation to the non-performing assets and the collateral related thereto in which the\nCorporation has acquired all rights, title, interest, benefits and privileges of a financial institution under"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Procedure of Verification Committee to apply to proceedings not transferred or",
      "content": "instituted under this Ordinance:___ (l) In all cases and Legal proceedings, for recovery of non-\nperforming assets and matters relating thereto, or arising therefrom, which are pending in any court or\ntribunal, or filed hereafter, under the Code of Civil Procedure, 1908, (Act v of 1908) the Banking\nCompanies (Recovery of Loans, Advances. Credits and Finances) Act, 1997 (Act XV of 1908) and the\nCompanies Ordinance, 1984, (Act XLVII of 1984) where there is a bona fide dispute relating to\nliability of the obligor in respect of the non-performing assets or cases relating thereto,, including cases\nof fraud, mis-representation, or breach of any provision of law, rules, regulation and the circulars of\nthe State Bank, regarding the calculation, existence and repayment of a financial obligation or\noutstanding loan, mark up or interest claimed against an obligor and also including cases under section\n12(2) Code of Civil Procedure, 1908(Act V of 1908) section 305 of the Companies Ordinance, 1984\n(Act XLVII of 1984) for winding up, such court or tribunal, as the case may be may while adjudicating,\nmake correct calculation to determine the existence and repayment of such financial institution as\ndefined in CIRC Ordinance, and follow the provisions of sections 10 and 11 of the said Ordinance\nwhich shall mutatis mutandis apply to all such cases and legal proceedings, as nearly as possible, and\nsuch court or tribunal is empowered to take all such measures or steps and pass such orders and issue\nsuch directions including the constitution of the Verification Committee, as it may deem lit in the ends\nof justice having regard to facts of the case, keeping in view the provisions of sections 10 and 11 of\nCIRC Ordinance.\n(2) For removal of doubt, it is hereby declared that the provisions of sub-section (1). shall not\napply to cases of non-performing assets of a financial institution in Which the Corporation has acquired\nall rights and interests and are transferred or instituted under this Ordinance after compliance with the\nC.I.R.C. Ordinance."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Execution of decree, and sale of assets of the obligor",
      "content": "_ (1) Subject to provisions\ncontained in this Ordinance or any other law for the time being in force, the High Court may on the\nwritten application of decree holder, forthwith order execution of the decree in the manner provided\nherein.\n(2) On the passing of the order for the execution of the decree under sub-section (1), the decree\nholder shall give an opportunity to the judgement-debtor to satisfy the decree in cash within a period\nof thirty days.\n(3) In the event the judgement-debtor fails to pay in cash as provided in sub-section (2), the\ntitle of the collateral together with transfer of valid title shall, after passing of the order of the High\nCourt confirming the transfer of title, vest in the Corporation, and such order of confirmation shall\nconstitute and confer sufficient power and authority for the Corporation to sell or cause or arrange for\nthe sale of the collateral together with transfer of valid title by the Corporation.\n(4) Where the judgement debtor or any person claiming through the judgement debtor or any\nperson acting on his behalf does not voluntarily hand over vacant physical possession of the mortgaged\nproperty or the possession of the collateral once vested in the Corporation, the High Court, on the\napplication of the Corporation, or the purchaser may order that the Corporation or, as the case may be,\nthe purchaser, be put in physical possession of the collateral including the mortgaged property after\nevicting or taking possession from such person in any manner deemed fit by the High Court.\n(5) The sale of the collateral or any part thereof by the Corporation pursuant to sub-section (3)\nshall be either by public auction or inviting sealed tenders subject to the orders of confirmation by the\nHigh Court.\n(6) Where the Corporation wishes to sell a collateral property by inviting sealed tenders, it shall\ninvite offers through advertisements in one English and one Urdu newspaper which are circulated\nwidely in the city in which the property is situated or located giving not less than thirty days time after\npublication of advertisement for submitting offers. The sealed tenders shall be opened in the presence\nof the tenderers or their representatives or such of them as attend.\n(7) Where the collateral property has been sold by the Corporation under sub-section (6), the\nCorporation shall present a proper account of the proceeds to the Court within fifteen days from the\ndate of the realization of the proceeds."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Sale of Assets in Winding up Proceedings by the High Court",
      "content": "_ (1) In respect of cases\ntransferred to the High Court in which new liquidator has been appointed or an Official Assignee is\nalready appointed with or without co-liquidator, and in respect of the new cases instituted hereunder\nunder the Companies Ordinance 1984, (Act XLVII of 1984) the Court shall on the written application\nof the liquidator or the Official Assignee, or co-liquidator, as the case may be, forthwith order the sale\nof the collateral. On the passing of the said order by the Court, the liquidator or the co-liquidator or the\nOfficial Assignee, as the case may be, shall advertise in one English and one Urdu newspaper which\nis circulated widely in the city in which the collateral is situated or located for the sale of the collateral\nwithin a period of thirty days subject to the order of confirmation by the High Court.\n(2) In the event the collateral is not sold pursuant to the advertisement, the title of the collateral\ntogether with transfer of valid title, shall, after passing of the order of the High Court confirming the\ntransfer of title, vest in the Corporation and such order of confirmation shall constitute and confer\nsufficient power and authority on the Corporation to sell or cause or arrange for the sale of the collateral\ntogether with transfer of valid title.\n(3) After the sale of the collateral as aforesaid, the obligor shall stand wound up by the Court\nand the liquidator or liquidators or the Official Assignee, as the case may be, in accordance with the\nprovisions of the Companies Ordinance, 1984 (Act XLVII of 1984) subject to the claims of creditors,\nshareholders and payment to those entitled under the law. including the Companies Ordinance, 1984\n(Act XLVII of 1984)."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Outstanding liability and entitlement of obligor",
      "content": "_ (1) In case the decretal amount is not\nsatisfied after the sale of the collateral or industrial undertaking, the obligor shall remain liable for the\namount remained unsatisfied under the decree.\n(2) In case the amount received from the sale of the collateral is in excess of the decretal\namount, such excess shall be returned to the obligor after deducting necessary expenses and subject to\nany restriction imposed under any other law for the time being in force."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Inter Creditor matters",
      "content": "_ Nothing contained herein shall affect the rights and interests of\nother creditors. Without prejudice to such rights, with respect to any non-performing asset which\nrepresent a partial right or interest, including an interest in a syndicated finance or loan facility in any\nfinancial asset, any individual entity irrespective of it being a financial institution or not, having a\npartial right or interest in the same shall be entitled to apply to the Corporation for appropriate relief\nand the Corporation shall compensate the non-financial institution having an interest in the syndicated\nfinance or loan facility proportionate to their registered interest in the net proceeds realised from the\nsale, lease or other disposition of any collateral in respect of the non-performing asset subject to the\nconfirmation of the High Court"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Provisions relating to certain offences:___ (1) Whoever",
      "content": "(a)     dishonestly commits a breach of the terms of a letter of hypothecation, trust\nreceipt or any other documents or instruments executed by him whereby\npossession of the property offered as scrutiny for the finance or loan pertaining\nto the non-performing assets or any obligation is not with the Corporation but\nis retained by or entrusted to him for the purposes of dealing with it in the normal\ncourse of business subject to the terms of the letter of hypothecation or trust\nreceipt or other instrument or document or for the purpose of effecting the sale\nand depositing the sale proceeds with the Corporation; or\n(b)     makes fraudulent misrepresentation or commits a breach of any commitment or\nrepresentation made to the Corporation with regard to furnishing of security in\nfavour of the Corporation on the basis of which the financial institution was\ninduced into granting a finance or loan pertaining to the non-performing assets,\nas the case may be; or\n(c)     subsequent to the creation of a mortgage as a collateral, dishonestly parts with\nthe possession of the mortgaged property whether by creation of a lease or\notherwise contrary to the terms thereof without the written permission of the\nCorporation;\nshall, without prejudice to any other action which may be taken against him under this\nOrdinance or any other law for the time being in force, be punishable with imprisonment of either\ndescription for a term which may extend to one year or fine equal in value to the property or security\nor cheque, as the case may be, or with both and may be ordered by the High Court trying the offence\nto also deliver up, refund or pay within a time to be fixed by the High Court, the property or the value\nof the property or security or cheque so dealt with.\n(2) Whoever knowingly made a statement which was false in material respects in an application\nfor finance or loan pertaining to the non-performing assets and obtained finance or loan pertaining to\nthe non-performing assets on the basis thereof, or applied the amount of the finance or loan pertaining\nto the non-performing assets towards a purpose other than that for which the finance or loan pertaining\nto the non-performing assets was obtained by him, or furnished a false statement of stock in violation\nof the terms of the agreement with the Corporation, shall be guilty of an offence punishable with\nimprisonment of either description for a term which may extend to one year, or with fine, or with both.\n(3) Whoever resists or obstructs, either by himself or on behalf of the judgement debtor,\nthrough the use of force, the execution of a decree in respect of non-performing assets, shall be\npunishable with imprisonment which may extend to one year, or with fine, or with both.\n(4) Whoever dishonestly issues a cheque in respect of non-performing assets, which is\ndishonoured, shall be punishable with imprisonment which may extend to one year, or with fine or\nwith both, unless he can establish, for which the burden of proof shall rest on him, that he had made\narrangements with his bank to ensure that the cheque would be honoured and that the bank was at fault\nin not honouring the cheque.\n(5) Where the person guilty of an offence under this Ordinance is a company or other body\ncorporate, the chief executive by whatever name called, and any director or officer involved shall be\ndeemed to be guilty of the offence and shall be liable to be proceeded against and be punished\naccordingly.\n(6) All offences under this Ordinance shall be bailable, non-cognizable and compoundable."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Transfer of Non",
      "content": "performing assets:___ Subject to provisions contained in this Ordinance\nor any other law for the time being in force or in any contract between the financial institution and the\nobligor, on the issuance of the transfer letter by the Corporation to the concerned financial institution\nunder the CIRC Ordinance or the rules framed thereunder, all rights, title, interest, benefits and\nprivileges of a financial institution in the non-performing assets and the collateral related thereto shall,\nwithout the necessity or any further action or instrument, be deemed vested, transferred, assigned, sold\nand conveyed by the financial institution to the Corporation free of any encumbrance or claim save for\nany registered interest outstanding as at the date of the transfer letter:\nProvided that any pre-existing funding commitment or obligation by a financial institution to\nan obligor being a corporation or other body corporate whose project is functional shall, in addition to\nthe security therefore, continue to subsist in the financial institution including all defences pertaining\nthereto"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Cognizance of offences",
      "content": "_ The High Court may, sua moto or on a complaint filed by the\nCorporation or by a person authorised by it in writing, take cognizance of any offence under this\nOrdinance or CIRC Ordinance and try the same as provided in this Ordinance."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Non",
      "content": "functioning assets:___ Notwithstanding anything contained in this Ordinance or any\nother law for the time being in force, where a non-performing asset or an industrial undertaking is\nclosed and non-functioning for the last two years or more, the High Court, keeping in view the facts\nand circumstances of each case and the purposes of this Ordinance, may order on the application of\nthe Corporation, its immediate sale or transfer or lease or for change of management through public\nbid on such terms and in such manner as the High Court may deem fit.\nExplanation:___ For the purposes of the above period of closure it would be deemed to be\nsufficient for the purpose of this Ordinance that the non-periforming asset or the industrial undertaking\nremained closed for a total period of eighteen months out of twenty-four months."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Appeal",
      "content": "_ (1) Any person aggrieved by a decree, or an order including an order refusing\nto set aside a decree, or an order permitting or preventing the sale of property, or a sentence passed by\na High Court may, within thirty days of such order, decree or sentence, prefer an appeal to the larger\nBench of the High Court, within whose jurisdiction the order, Judgment, decree or sentence is passed:\nProvided that the admission of the appeal shall not perse operate as a stay, and nor shall any\nstay be granted therein unless the appellant deposits in cash with the High Court an amount equivalent\nto the amount due, or, at the discretion of the High Court, furnishes security equal in value to such\namount; and in the event of a stay being granted for a part of the decretal amount only the requirement\nfor a deposit in cash or furnishing of security shall stand reduced accordingly:\nProvided further that where the claim of the decree-holder is based on the default of the\ndefendant in payment of agreed installments, the deposit shall be made or, as the case may be, the\nsecurity furnished to the extent of the amount of installments in default.\n(2) The High Court shall at the stage of admitting an appeal, or at any time thereafter either suo\nmoto, or on the application of the decree holder, decide by means of a reasoned order whether the\nappeal is to be admitted in part or in whole depending on the facts and circumstances of the case.\n(3) An appeal under sub-section (1) shall be heard by a bench of not less than two Judges and,\nin case the appeal is admitted, it shall be decided within ninety days from the date of admission.\n(4) An appeal may be preferred under this section from a decree passed ex parte.\n(5) No appeal, review or revision shall lie against any interlocutory order of the High Court.\n(6) Any person aggrieved by a final order, judgment, decree or sentence passed under the\nappeal before a bench of not less than two Judges may, within thirty days of such order, judgment,\ndecree or sentence prefer an appeal to the Supreme Court."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Progressive application",
      "content": "_ The CIRC Ordinance and this Ordinance shall be progressively\napplied to financial institutions."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Rules",
      "content": "_ The Federal Government may, by notification in the Rules, official Gazette, make\nrules for carrying out the purposes of this Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "chief Executive",
      "definition": "the Chief Executive officer of the Corporation appointed under the CIRC Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "CIRC Ordinance",
      "definition": "the Corporate and Industrial Restructuring Corporation Ordinance, 2000 (L of 2000).",
      "source_provision": "sec2"
    },
    {
      "term": "Corporation",
      "definition": "the Corporate Industrial Restructuring Corporation established under the CIRC Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "industrial undertaking",
      "definition": "any undertaking pertaining or relating to non- performing asset of a financial institution;",
      "source_provision": "sec2"
    },
    {
      "term": "financial asset",
      "definition": "any short, medium or long term interest and non-interest bearing loan, finance advance, lease, installment, term finance certificate, participation term certificate, musharaka, modaraba, profit and loss sharing agreement, redeemable capital, guarantee or contractual right to receive payment of money in respect of sums advanced or committed to an obligor by a financial institution including collateral pertaining thereto; 1 [(f) “financial institution” means any bank or other financial institution operating in Pakistan wherein the Federal Government hold any equity, as specified in the Schedule;]",
      "source_provision": "sec2"
    },
    {
      "term": "non-performing asset",
      "definition": "any financial asset- (a) which is held as an asset on the books of a financial institution; (b) with respect to which the obligor has been in arrears on any payment obligation for a period more than three hundred and sixty-five days, including- (i) collateral with respect to any financial asset; and (ii) a whole or partial right or interest of a financial institution in any financial asset, that otherwise constitutes a non-performing asset including a financial asset with respect to which the financial institution has an ongoing funding obligation; and (c) with respect to which the obligor’s outstanding payment obligation to any financial institution exceeds thirty million rupees: Provided that the Federal Government may, by notification in the official Gazette, alter, reduce or increase the said amount as and when it deems fit;",
      "source_provision": "sec2"
    },
    {
      "term": "obligor",
      "definition": "any individual, proprietorship concern, company or other body corporate, trust, partnership or other entity that has, with respect to a non- performing asset, a contractual or legal obligation or duty to make payment, effect performance, provide security, or collateral with respect to any financial asset whether as principal, surety, guarantor or otherwise and whether such obligation is primary, secondary, matured or contingent; and (i) registered interest” means any right or interest in a non-performing asset duly registered under the Companies Ordinance, or its predecessor statue or under 1984 any other law for the time being in force;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "the rules made under this Ordinance; and",
      "source_provision": "sec2"
    },
    {
      "term": "Schedule",
      "definition": "the Schedule annexed to the CIRC Ordinance. (2) All other terms and expressions used but not defined in this Ordinance shall have the meanings assigned to them in the CIRC Ordinance.",
      "source_provision": "sec2"
    }
  ]
}
