{
  "id": "pk-pemra-2002",
  "type": "statute",
  "title": "Pakistan Electronic Media Regulatory Authority Ordinance (PEMRA), 2002",
  "title_en": "Pakistan Electronic Media Regulatory Authority Ordinance (PEMRA), 2002",
  "short_name": "PEMRA 2002",
  "status": "in_force",
  "issued_date": "2002-03-10",
  "in_force_date": "2002-03-10",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FrbZ8%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Electronic Media Regulatory Authority Ordinance (PEMRA), 2002 (XIII of 2002) published by The Pakistan Code.",
  "provisions": [
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Removal of difficulties",
      "content": "ORDINANCE, 2002.\nORDINANCE NO. XIII OF 2002\n[1st March, 2002]\nAN\nto regulate 1 [electronic] media in Pakistan\nWHEREAS it is expedient to provide for the development of 1[electronic] media in order to⸺\n(i)         improve the standards of information, education and entertainment;\n2\n[(ii)   enlarge the choice available to the people of Pakistan in the media for authentic\nnews, current affairs, religious knowledge, tolerance,art,culture, science, technology,\neconomic and energy development, social sector concerns, music, sports, drama,\nchildren content and other subjects of public and national interest;]\n(iii)       facilitate the devolution of responsibility and power to the grass-roots by improving\nthe access of the people to mass media at the local and community level; 2 [*]\n(iv)    ensure accountability, transparency and good governance by optimizing the free flow\nof information;\n2\n[(v) ensure timely payment of salary to the electronic media employees working with the\nlicensee of the Authority; and]\n2\n[(vi) ensure fair, transparent, and independent rating to broadcasters for their TV\nchannels.]\nAND WHEREAS, the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of Proclamation of Emergency of the fourteenth day of\nOctober, 1999 and the Provisional Constitution Order No.1 of 1999 read with the Provisional\nConstitution (Amendment) Order No. 9 of 1999, and in exercise of all powers enabling him in\nthat behalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate\nthe following Ordinance:⸺"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Ordinance shall be called the\nPakistan Electronic Media Regulatory Authority Ordinance, 2002.\n(2) It extends to the whole of 3[Islamic Republic of] Pakistan.\n(3) It shall come into force at once.\n1\nSubs. by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007 (Act II of 2007), s.2, for “broadcast”.\n2\nSubs. omitted and added by Act LXI of 2023, s.2.\n3\nIns. by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007 (Act II of 2007), s. 3."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.⸺ In this Ordinance, unless there is anything repugnant in the subject or",
      "content": "context,⸺\n(a)         “advertisement” means a set of visual and audio messages for the projection of a\nproduct, service, or idea with the object of propagating sale, purchase or hire\nof the product, service or idea for creating other related effects;\n(b)         “Authority” means the Pakistan Electronic Media Regulatory Authority (PEMRA)\nestablished under section 3;\n1\n[(c) “broadcast media” means such media which originate and propagate broadcast and\npre- recorded signals by terrestrial means or through satellite for radio or\ntelevision and includes teleporting, provision of access to broadcast signals\nby channel providers and such other forms of broadcast media as the Authority\nmay, with the approval of the Federal Government, by notification in the official\nGazette, specify;]\n1\n[(ca) “broadcast station” means physical, technical and software infrastructure for the\noperation of radio or television and also includes satellite uplinking from ground,\nrepeaters and all such other accessories;]\n(d)          “broadcaster” means a person engaged in broadcast media 1 [except broadcast\njournalists not actively involved in the operation, ownership, management or\ncontrol of the broadcast media];\n1\n[(da) “Cable TV” means reception of broadcast and prerecorded signals from\ndifferent channels and their distribution to subscribers through a set of closed\ntransmission paths;]\n(e)          “Chairman” means the Chairman of the Authority;\n1\n[(ea) “Chairperson” means the head of a Council of Complaint;]\n(f)          “channel” means the set of frequencies that a broadcast station occupies for\nbroadcasting;\n1\n[(fa)    “channel provider” means a vendor who represents local or foreign channels\nand provides access of their signal to a distribution service;]\n(g)          “company” a company as defined in the Companies 2[Act, 2017 (XIX of 2017)];\n(h)           “copyright” means copyright as defined in the Copyright Ordinance, 1962\n(XXXIV of 1962);\n2\n[(ha) “disinformation” means verifiably false, misleading, manipulated, created or\nfabricated information which is disseminated or shared with the intention to cause\nharm to the reputation of or to harass any person for political, personal, or financial\ninterest or gains without making an effort to get other person's point of view or not\n1\nSubs. and Ins. by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007 (Act II of 2007), s. 4.\n2\nSubs. and Ins. by Act LXI of 2023, s.3.\ngiving it proper coverage and space but does not include misinformation;]\n1 2\n[ [(haa)]“distribution service” means a service which receives broadcast and\npre-recorded signals from different channels and distributes them to subscribers\nthrough cable, wireless or satellite options and includes Cable TV, LMDS, MMDS,\nDTH and such other similar technologies;\n(hb)        “DTH” means Direct to Home distribution of audiovisual signals received via\nsatellite to small dish antennas across the foot-print of the satellite to subscribers;\n(hc)        “electronic media” includes the broadcast media and distribution services;]\n2\n[(hd) “electronic media employee” shall mean and include a person working as an\nemployee with the licensee of the Authority;]\n(i)         “foreign company” means a company or body corporate organized, and\nregistered under the laws of a foreign government;\n(j)         “frequency” means the frequency of the electromagnetic wave number measured\nin Hertz per second and used for transmission;\n(k)         “FAB” means the Frequency Allocation Board established under section 42 of the\nPakistan Telecommunication (Reorganization) Act, 1996 (XVII of 1996);\n1\n[(ka) “illegal operation” means the broadcast or transmission or distribution of, or\nprovision of access to, programmes or advertisements in the form of channels\nwithout having a valid licence from the Authority;\n(kb)        “LMDS” means local multipoint distribution service to transmit audio-visual\nsignals through wireless devices, on a higher frequency range for the provision of\ncable television service;]\n(l)         “media enterprise” means an enterprise concerned with the publication of a\nprinted newspaper or 3[a broadcast media or distribution service];\n2\n[(la)   “misinformation” means verifiable false content or information that is\nunintentionally disseminated or shared;]\n1 2\n[ [(laa)] “MMDS” means multi-channel multi-point distribution service to transmit\naudio-visual signals through wireless devices, to multiple subscribers, after\nreceiving such signals from other channels of communication;]\n1\n[(m)    “licence” means a licence issued by the Authority to establish and operate a\nbroadcast media or distribution service;]\n(n)         “licensee” means a person to whom the Authority has issued a licence;\n1\n[(na) “newspaper” means a newspaper as defined by the Press, Newspapers, News\nAgencies and Books Registration Ordinance, 2002(XCVIII of 2002);]\n1\nIns., and subs. by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007 (Act II of 2007), s. 4.\n2\nRe-numbered and Ins. by Act LXI of 2023, s.3.\n3\nSubs. by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007 (Act II of 2007), s. 4, for “Journal, a radio or television broadcast\nstation or cinema theatre”.\n(o)        “member” means a member of the Authority;\n(p)        “national broadcaster” means the Pakistan Broadcasting Corporation, the\nPakistan Television Corporation and the Shalimar Recording and Broadcasting\nCompany;\n(q)        “PTA” means the Pakistan Telecommunication Authority established under\nthe Pakistan Telecommunication (Reorganisation) Act, 1996 (XVII of 1996);\n(r)        “person” includes an individual, partnership, association, company, trust or 1[.\ncorporation or public body] ;\n(s)        “prescribed” means prescribed by the rules 2 [or regulations] made by the\nAuthority;\n(t)        “programme” means the systematic broadcasting of visual or sound images\nby a broadcast station but does not include an advertisement; 2 [*]\n2\n[(ta) “regulations” means the regulations made under this Ordinance;]\n(u)        “rules” means the rules made under this Ordinance 2 [;]\n1\n[(ua) “severe violation” means a violation of this Ordinance or violation of Article\n19 of the Constitution of the Islamic Republic of Pakistan;]\n2\n[(v)   “teleport” means a facility with installed equipment used or required in the\nprocess of uplinking or downlinking of audio-visual programmes and signals\nbetween an earth station and a satellite; 1[*]\n1\n[(va) “timely payment of dues” means the payment of dues when made to the\nelectronic media employee within two months; and]\n(w)        “uplinking” Means transmission of audio-video signal from ground transmission\nfacility to a satellite in order to transmit any programme within or outside\nPakistan.]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Authority.⸺ (1) As soon as may be, after the commencement of",
      "content": "this Ordinance, the Federal Government shall, by notification in the official Gazette, establish an\nauthority to be known as the Pakistan Electronic Media Regulatory Authority (PEMRA) for\ncarrying out the purposes of this Ordinance.\n(2) The Authority shall be a body corporate having perpetual succession and a common\nseal with powers subject to the provision of this Ordinance to hold and dispose of property by\nthe said name, sue and be sued.\n(3) The principal office of the Authority shall be at Islamabad and it may set up offices\nat such place or places in the country as it may deem appropriate.\n1\nSubs., Ins. and Omitted by Act LXI of 2023, s.3.\n2\nIns., omitted and subs. by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007 (Act II of 2007), s. 4.\n(4) No act or proceeding of the Authority shall be invalid by reason only of the existence of\na vacancy in, or defect in the constitution of, the Authority.\n1\n[4. Functions of the Authority.⸺ (1) The Authority shall be responsible for regulating\nthe establishment and operation of all broadcast media and distribution services in Pakistan\nestablished for the purpose of international, national, provincial, district, local or special\ntarget audiences.\n(2) The Authority shall regulate the distribution of foreign and local TV and radio channels\nin Pakistan.\n(3) The Authority may, by notification in the official Gazette, make regulations and\nalso issue determinations for carrying out the purposes of this Ordinance.]\n2\n[(4) The Authority by registering rating companies shall ensure that a fair, transparent,\nand independent forums shall issue rating to the licensees.]"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power of the Federal Government to issue directives",
      "content": "The Federal Government may,\nas and when it considers necessary, issue directives to the Authority on matters of policy, and\nsuch directives shall be binding on the Authority, and if a question arises whether any matter is\na matter of policy or not, the decision of the Federal Government shall be final."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Members of Authority.⸺ (1) The Authority shall consist of a Chairman and 1 [twelve]",
      "content": "members to be appointed by the President of Pakistan.\n(2) The Chairman of the Authority shall be an eminent professional of known integrity and\ncompetence having substantial experience in media, business, management, finance, economics\nor law.\n2[(2A) The division to which business of this Ordinance stands allocated shall recommend\na panel of five candidates fulfilling the conditions of sub-section (2) and send it to a parliamentary\ncommittee consisting of four members two from the National Assembly and two from the Senate\nto be nominated by the Speaker of the National Assembly and the Chairman of the Senate\nrespectively out of which one shall be from the treasury benches and one from the opposition\nin each House and the parliamentary committee shall consider the panel and recommend one\ncandidate for appointment by the President under sub-section (1) and where the parliamentary\ncommittee fails to recommend within thirty days of receipt of the panel any person, the division\nconcerned shall forward the panel to the Prime Minister who shall recommend to the President\nthe candidate eminently suited to be appointed as Chairman by the President:\nProvided that at any time when the National Assembly stands dissolve, all members of\nthe parliamentary committee shall be from the Senate nominated by the Chairman Senate.]\n(3) Out of 1[twelve] members one shall be appointed by the Federal Government on full time\nbasis and five shall be eminent citizens chosen to ensure representation of all provinces with\nexpertise in one or more of the following fields: media, law, human rights, and social service. Of\nthe five members from the general public, two members shall be women.\n1\nSubs. by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007 (Act II of 2007), ss. 5-6.\n2\nAdded and Ins. by Act LXI of 2023, ss.3A-4.\n(4) Secretary, Ministry of Information and 1[Broadcasting, Secretary, Interior Division,\nChairman, Pakistan Telecommunication Authority and Chairman, Central Board of Revenue] shall\nbe the ex-officio members.\n2\n[(4A). The remaining two members shall, by the division to which business of this\nOrdinance stands allocated, be appointed on need basis on recommendation of the Chairman\nand they shall be non-voting honorary members, one from broadcasters and one from Pakistan\nFederal Union of Journalists (PFUJ).]\n(5) The members, 1 [* * * * * * *] shall receive such fee and expenses for each meeting as\nmay be prescribed.\n1\n[(6) A member, other than an ex officio member, shall be deemed to have vacated his office\nif he absents himself for three consecutive meetings of the Authority without the leave of the\nAuthority.]"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Tenure of members.⸺ (1) The Chairman and members, other than ex",
      "content": "officio members,\nunless earlier removed for misconduct or physical or mental incapacity, shall hold office for a\nperiod of four years and shall be eligible for re-appointment for a similar term or as the\nFederal Government may determine:\nProvided that the Chairman and a member shall retire on attaining the age of sixty-five years.\nExplanation.⸺ For the purposes of this section the expression “misconduct” means\nconviction for any offence involving moral turpitude and includes conduct prejudicial to good\norder or unbecoming of a gentleman.\n(2) The Chairman or a member may, by writing under his hand, resign his office."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Meetings of the Authority, etc",
      "content": "(1) The Chairman or, in his absence, the\nmember elected by the members for the purpose, shall preside at a meeting of the Authority.\n(2) One-third of the total members shall constitute a quorum for meetings of the\nAuthority requiring a decision by the Authority.\n(3) The members shall have reasonable notice of the time and place of the meeting and\nthe matters on which a decision by the Authority shall be taken in such meeting.\n2\n[(3A) Meetings of the Authority may also take place through modern devices including but\nnot limited to video link.]\n(4) The decisions of the Authority shall be taken by the majority of its members present, and\nin case of a tie, the member presiding a meeting shall have a casting vote.\n(5) All orders, determinations and decisions of the Authority shall be taken in writing 2[* *\n*].\n1\nSubs., omitted and added by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007 (Act II of 2007), s. 6.\n2\nSubs., Ins. and omitted by Act LXI of 2023, s.4"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Remuneration, of Chairman and members",
      "content": "(1)The Chairman and members shall be\npaid such emoluments as the President of Pakistan may determine and shall not be varied to their\ndisadvantage during their term of office."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Chairman and members not to engage themselves in certain business, etc",
      "content": "(1) The\nChairman shall not, during his term of office, engage himself in any other service, business, vocation\nor employment, or enter into the employment of, or accept any advisory or consultancy\nrelationship with any person or entity engaged in applying for a licence from the Authority or\noperating a broadcast station established within the purview of the Authority or in providing\nservices or products to the Authority on any of the projects, schemes, proposals or plans undertaken,\nexecuted or supervised by the Authority or any related undertaking of such aforesaid person or\nentity.\n(2) The members shall not have any direct or indirect financial interest, or have any connection\nwith any such person, entity or related undertaking as mentioned in sub-section (1) of this section\nassociated in any way with the licensee of a broadcast station for so long as they are members and\nhold office."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Officers, employees, etc",
      "content": "To carry out the purposes of this Ordinance, the Authority may,\nfrom time to time, appoint members of its staff, experts, consultants, advisers and other officers and\nemployees on such terms and conditions as 1 [may be prescribed by regulations]."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Officers, etc. deemed to be public servants",
      "content": "The Chairman, members, members of\nits staff, other officers and employees of the Authority shall be deemed to be public servants\nwithin the meaning of section 21 of the Pakistan Penal Code (Act XLV of 1860).\n1[13. Delegation.__ The Authority may delegate to the Chairman or a member or officer of the\nAuthority, any of its powers, responsibilities or functions under this Ordinance as it may by regulations\nprescribe:\nProvided that the delegation of such power shall not include the power to grant, revoke or\ncancel a broadcast media or distribution service licence except cable TV:\nProvided further that to the extent of suspension of broadcast media licence, the Authority may\ndelegate its power to Chairman and two members of the Authority.]"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Fund.⸺ (1) There shall be established a fund to be known as “PEMRA Fund” which",
      "content": "shall vest in the Authority and shall be utilized by the Authority to meet charges in connection with\nits functions including payment of salaries and other remunerations to the Chairman, members,\n2\n[employees], experts and consultants of the Authority.\n(2) The Fund shall consist of.⸺\n(i)        seed money by the Federal Government;\n1\nSubs. by Act LXI of 2023, ss.6-7\n2\nSubs. by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007 (Act II of 2007), s.8, for servants.\n(ii)      fees for issuance 1 [and renewal] of licences for establishing and operating\nbroadcast or CTV stations;\n(iii)     loans obtained with the special or general sanction of the Federal Government;\n(iv)      foreign aid obtained with sanction of and on such terms and conditions as may\nbe approved by the Federal Government; and\n(v)       all other sums received by the Authority from any other source.\n(3) The Authority may open and operate one or more accounts in local, or foreign currency,\nin any scheduled bank.\n1\n[(4) The Authority may invest its funds in such investments as it may, from time to time,\ndetermine.]"
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Budget",
      "content": "The Authority shall, in respect of each financial year, prepare its own budget\nand submit it to the Federal Government three months before the commencement of every financial\nyear for information."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Accounts and Audit.⸺ (1) The Authority shall maintain complete and accurate books",
      "content": "of accounts of its actual expenses and receipts in such form as the Federal Government may, in\nconsultation with the Auditor General of Pakistan, determine.\n(2) The Authority shall cause to be carried out audit of its accounts by one or more auditors\nwho are chartered accountants within the meaning of the Chartered Accountants Ordinance, 1961\n(X of 1961).\n(3) Notwithstanding the audit provided in sub-section (2) the Auditor-General shall have the\npower to audit or cause to be audited the accounts of the Authority."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Annual report",
      "content": "The Authority shall compile and submit an annual report on its\noperations and accounts for each financial year to the President of Pakistan and shall also\narrange for its publication and circulation to the media and the public.\n2\n[18. Categories of licences.⸺ (1) The Authority shall issue licences for broadcast media\nand distribution service in the following categories, namely:⸺\ni.        international and national scale stations;\nii.       provincial scale broadcast;\niii.      local area community based radio and TV broadcast;\niv.       specific and specialized subjects;\nv.        distribution services; and\n1\nIns. and Added by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007 (Act II of 2007), s. 8.\n2\nSubs. ibid., s.9, for “section 18”.\nvi.        uplinking facilities including teleporting and DSNG.\n(2) The Authority may further sub-categorize the categories specified in sub-section (1) as\nit may deem fit.]"
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Licence to broadcast or operate.⸺ 1[(1) The Authority shall have exclusive right to",
      "content": "issue licences for the establishment and operation of all broadcast media and distribution services,\nprovided that this exclusive right shall be used by the Authority in conformity with the principles\nof fairness and equity applied to all potential applicants for licences whose eligibility shall be based\non prescribed criteria notified in advance and that this shall be done through an open, transparent\nbidding process:\nProvided that the bidding shall be held if the number of applications exceeds the number of\nlicences to be issued by the Authority.]\n(2) No person shall engage in 1 [any broadcast media or distribution service] except after\nobtaining a licence issued under this Ordinance.\n(3) Every licence shall be subject to such terms and conditions as may be prescribed.\n1\n[(4) The Authority shall have the power to determine number of licences to be issued in\neach category or sub-category and charge fees at such rates as the Authority may fix from time to\ntime for the grant of a licence and for its annual renewal.]\n1\n[(5) The Authority shall devise a Code of Conduct for programmes and advertisements for\ncompliance by the licensees.]"
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Terms and conditions of licence",
      "content": "A 1[person] who is issued a licence under this\nOrdinance shall⸺\n1\n(a)         [ensure preservation of] the sovereignty, security and integrity of the Islamic\nRepublic of Pakistan;\n1\n(b)         [ensure preservation of] the national, cultural, social and religious values and\nthe principles of public policy as enshrined in the Constitution of the Islamic\nRepublic of Pakistan;\n1\n[(c)   ensure that all programmes and advertisements do not contain or encourage\nviolence, terrorism, racial, ethnic or religious discrimination, sectarianism,\nextremism, militancy, hatred, pornography, obscenity, vulgarity or other\nmaterial offensive to commonly accepted standards of decency;]\n(d)        comply with rules made under this Ordinance;\n1\nSubs. and added by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007 (Act II of 2007), ss. 10-11.\n(e)        broadcast 1[, if permissible under the terms of its licence,] programmes in the\npublic interest specified by the Federal Government or the Authority in the\nmanner indicated by the Government or, as the case may be, the Authority,\nprovided that the duration of such mandatory programmes do not exceed ten\npercent of the total duration of broadcast or operation by a station in twenty-\nfour hours except if, by its own volition, a station chooses to broadcast 1 [* *]\nsuch content for a longer duration; 2[and such content will be in addition to\npreamble, and the licensee will also submit an annual compliance report to this\neffect or as and when required by the Authority;]\n(f)        comply with the codes of programmes and advertisements approved by the\nAuthority 1[and appoint an in-house monitoring committee, under intimation\nto the Authority, to ensure compliance of the Code];\n(g)        not broadcast or distribute any programme or advertisement in violation of\ncopyright or other property right;\n1\n[(h)   obtain NOC from Authority before import of any transmitting apparatus for\nbroadcasting, distribution or teleporting operation;]\n(i)        not sell, transfer or assign any of the rights conferred by the licence without\nprior written permission of the Authority 2[;]\n2\n[(j)   not air disinformation;\n(k)        ensure that during a regular programme a continuous break for advertising shall\nnot exceed five minutes and duration between two such successive breaks shall\nnot be less than ten minutes; and\n(l)        ensure that the content of the channel available on electronic media, including\nlogo and name, etc. shall not vary, alter, substitute, tempered on digital media\nor any other similar forum.]\n2[20A. Obligation of licensee to pay electronic media employees’ dues timely.— The\nlicensee of the Authority shall ensure timely payment of dues not later than two months to the\nelectronic media employees working with it."
    },
    {
      "provision_ref": "sec20b",
      "section": "20B",
      "title": "Section 20B. Government advertisements",
      "content": "A licensee of the Authority shall comply with all\ndecisions and orders of the Authority and the Council of Complaints for payment of outstanding\ndues to its employees. In case of non-compliance by the licensee, the Authority or, as the case may be,\nthe Council of Complaints shall write to the division or department of the Federal Government or, as\nthe case may be, the Provincial Government to which stands allocated the business in this behalf to\nstop release of TV or radio commercials to the licensee till the payment of pending dues to its\nemployees.]\n1\nSubs., omitted and Added by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007 (Act II of 2007), s.11.\n2\nAdded, subs. and ins. by Act LXI of 2023, ss.8-9.\n1\n[21. Consultation with the Provinces.⸺ (1) The Authority shall, except where applications\nfor the issuance of a licence relates to Islamabad Capital Territory, invite the comments of the Government\nof the Province concerned, with regard to the proposed location of the Radio, TV or MMDS station\nfor which the application has been made, and if the concerned Provincial Government has any reservation\nto the issuance of the licence, the Authority shall invite the representative of the Provincial Government\nand consider its viewpoint before taking a decision on the issuance of a licence:\nProvided that where the Provincial Government objects to the issuance of a particular licence,\nthe applicant shall be provided an opportunity to be present at the meeting of the Authority and given\nan opportunity of being heard with regard to the observations made by the Provincial Government.\n(2) Where the signal of a radio, TV or MMDS station has the potential to cover an area\noutside the limits of the Province in which the unit is proposed to be located, the Authority shall invite\none or more representatives from the concerned Provincial Governments to express their viewpoint, if\nany, on the inter-Provincial dimensions of the signal.]"
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Duration for consideration of the application for a licence",
      "content": "The Authority shall take\ndecision on the application for a licence within one hundred days from the receipt of the\napplication."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Exclusion of monopolies.⸺ (1) No person shall be entitled to the benefit of any",
      "content": "monopoly or exclusivity in the matter of broadcasting or the establishment and operation of\nbroadcast 2[media or distribution service] or in the supply to, or purchase from, a national\nbroadcaster of air time, programmes or advertising material and all existing agreements and\ncontracts to the extent of conferring a monopoly or containing an exclusivity clause are, to\nthe extent of exclusivity, hereby declared to be inoperative and of no legal effect.\n3\n[(2) In granting a licence, the Authority shall ensure that open and fair competition is\nfacilitated in the operation of more than one media enterprise in any given unit of area or\nsubject and that undue concentration of media ownership is not created in any city, town or area\nand the country as a whole:\nProvided that if a licensee owns, controls or operates more than one media enterprise, he\nshall not indulge in any practice which may impede fare competition and provision of level\nplaying field.]"
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Licence, application, issuance, refusal and validity.⸺ 4[(1) Any person desirous of",
      "content": "obtaining a licence for establishment and operation of broadcast media or a distribution service\nshall apply to the Authority in such manner and form as may be prescribed.]\n(2) The Authority shall process each application in accordance with prescribed criteria\nand shall hold public hearings in the respective provincial capitals of each Province, or as the case\nmay be, Islamabad, before granting or refusing the licence.\n(3) Each application shall be accompanied by such fee as the Authority may prescribe.\n1\nSubs. by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007 (Act II of 2007), s.12, “for section 21”.\n2\nSubs. ibid., s.13, for “or CTV stations”.\n3\nSubs. ibid., for “sub-section (2).\n4\nSubs. ibid., s.14, for “sub-section (1)”.\n1\n[(4) A licence of broadcast media shall be valid for a period of twenty years and distribution\nservice licence shall be valid for a period not exceeding ten years from the issuance date subject to\npayment of annual fee, including late payment fee if any as may be prescribed from time to time but\nshall not include annual gross advertisement revenue in any form whatsoever.]\n1\n[(4A) Licence renewal fee shall be fifty percent of applicable fee of last bid price of the same\ncategory but shall not include annual gross advertisement revenue in any form whatsoever.]\n(5) The Authority may renew a licence on such terms and conditions as may be prescribed,\nand in case of refusal to renew a licence reasons shall be recorded in writing."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Certain persons not be granted licence.__ A licence shall not be granted to",
      "content": "(a)        a person who is not a citizen of Pakistan or resident in Pakistan;\n(b)        a foreign company organized under the laws of any foreign government; 2 [*]\n(c)        a company the majority of whose shares are owned or controlled by foreign\nnationals or companies whose management or control is vested in foreign\nnationals or companies 3 [; or]\n4\n[(d)   any person funded or sponsored by a foreign government or organization.]\n1[26.Councils of Complaints.⸺ (1) The Federal Government shall, by notification in the\nofficial Gazette, establish Councils of Complaints for general public, bodies, etc. and for grievance of\nthe electronic media employees regarding their wages, salaries, dues, etc. at Islamabad, the Provincial\ncapitals and also at such other places as the Federal Government may determine.\n(2) Each Council shall receive and review complaints made by persons or organizations\nfrom general public against any aspects of programmes broadcast or distributed by a station established\nthrough a licence issued by the Authority and render opinions on such complaints.\n(3) Each Council shall receive and review complaints made by the electronic media employees\nto the extent of the following matters only, namely:—\n(a)        payment of minimum wages policy; and (b) timely payment of their salaries,\nand the Council shall render opinions and recommendations on such complaints\nto the Authority for appropriate decision or order.\n(4) Each Council shall consist of a Chairperson and five members being citizens of eminence,\nhaving relevant experience and qualification as may be prescribed, from general public at least two of\nwhom shall be women.\n1\nSubs. and Ins. by Act LXI of 2023, ss.10-11.\n2\nOmitted by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007 (Act II of 2007), s.15.\n3\nSubs. ibid., for “full-stop”.\n4\nNew clause (d) added ibid.\n(5) The Chairperson or members, unless earlier removed for misconduct or physical or mental\nincapacity, shall hold office for a term of two years and shall be eligible for re-appointment for a\nsimilar term as the Federal Government may determine:\nProvided that the Chairperson or a member may, by writing under his hand addressed to the\nChairman, resign from his office:\nProvided further that the Chairperson and members shall hold honorary positions.\nExplanation.— For the purposes of this section, the expression “misconduct” means\nconviction for any offence involving moral turpitude and includes conduct prejudicial to good order,\npolitical influence or involvement, or unbecoming of a gentleman, or absence from three or more\nsuccessive meetings of the Council.\n(6) For the purpose of exercising jurisdiction under sub-section (3) for grievances of the\nelectronic media employees, in each Council, two non-voting honorary members shall be appointed\nby the division to which business of this Ordinance stands allocated, one from broadcasters and one\nfrom electronic media employees, who shall serve to that extent only.\n(7) The Councils shall have the powers to summon the complainant, aggrieved person and the\nlicensee against whom a complaint has been made and call for his or its explanation regarding any\nmatter relating to its operation.\n(8) The functions and operation of the Councils shall be such as may be prescribed.\n(9) The Councils may recommend to the Authority for imposition of a fine of not less than two\nhundred thousand rupees and not more than one million rupees against any individual person. The\nCouncils may also recommend to the Authority appropriate action of censure, fine up to two million\nrupees in respect of a licensee. In case a licensee repeats violation, the Council may recommend the\nsuspension of the licence or prohibition on broadcasting or rebroadcasting or distributing any\nprogramme or advertisement against a broadcast media, broadcast station or distribution service\noperator or person for violation of the provisions of this Ordinance, rules and regulations made\nthereunder or any terms and conditions of licence and code of conduct for programme content and\nadvertisements as may be prescribed.\n(10) The Authority or the Chairman may refer any matter to the Council for appropriate\nrecommendations.\n(11) The Council shall verify the content of disinformation on the basis of documentary\nevidence and make appropriate recommendations to the Authority within a period of thirty days:\nProvided that not more than two adjournments shall be entertained by the Council upon an\nadvance application by the licensee or the complainant or any aggrieved person. In case of non-\nappearance by either party or non-filing of application for adjournment, the Council shall proceed with\nthe matter on the basis of available material and record.\n(12) Each Council shall compile and submit the annual report of licensee regarding the\ncompliance of Code of Conduct to the Authority.]\n1\n[27. Prohibition of broadcast media or distribution service operation.__ The Authority shall\nby order in writing, giving reasons therefore, prohibit any broadcast media or distribution service operator\n2\n[or person] from⸺\n(a)        broadcasting or re-broadcasting or distributing any programme or advertisement 2[or\nexpression by any person] if it is of the opinion that such particular programme or\nadvertisement 2[or expression by any person] is against the ideology of Pakistan or\nis likely to create hatred among the people or is prejudicial to the maintenance of\nlaw and order or is likely to disturb public peace and tranquility or endangers\nnational security or is pronographic, obscene or vulgar or is offensive to the\ncommonly accepted standards of decency; or\n(b)        engaging in any practice or act which amounts to abuse of media power by way\nof harming the legitimate interests of another licensee or willfully causing damage to\nany other person 2[:]]\n2\n[Provided that the Authority after prohibiting the programme or\nadvertisement or expression by any person under clause (a) may refer the matter to\nthe Council of Complaints for appropriate recommendations. The Council, after\nhearing the concerned licensee or person, as the case may be, may recommend within\nthirty days to the Authority to take appropriate action as empowered under this\nOrdinance.]"
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Suspension of 3[broadcast media or distribution service] operation",
      "content": "A 4[broadcast media or\ndistribution service] operator shall not cease or suspend broadcasting except on account of force majeure\nor with the prior Approval of the Authority."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Power to authorize inspection",
      "content": "(1) The Authority may authorize any of its officers or its\nnominees to enter the premises of a 5[broadcast media or distribution service] operator for purposes\nof inspection 6[* * * *].\n(2) A broadcast 7 [media station or distribution service premises] shall, at all reasonable times, be open\nto inspection by an authorized officer under sub-section (1) and the licensee shall provide such officer with\nevery assistance and facility in performing his duties.\n(3) The authorized officer shall, within forty-eight hours of the inspection, submit his inspection report\nto the Authority.\n8\n[(4) The Authority may authorize any of its officers to undertake investigation, in the manner it may\nprescribe, in any matter with regard to its functions and to seek any specific information, from any person,\nwhich the Authority may deem useful in order to enable it to determine and dispose of such matter.\n(5) The Authority or as the case may be the Chairman after issuing a show cause notice to a broadcast\nmedia or distribution service may seize its broadcast or distribution service equipment, or seal the premises,\nwhich is being used in contravention of the provisions of this Ordinance or the rules made thereunder or any\nother law:\n1\nSubs. by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007(Act II of 2007), s.17, for “section 27”.\n2\nIns., sub. and added by Act LXI of 2023, s.12.\n3\nSubs. by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007(II of 2007), s.18, for “broadcasting or CTV”.\n4\nSubs. ibid., for “broadcaster or”.\n5\nSubs. ibid., s.19, for “broadcaster or a CTV”.\n6\nCertain words omitted ibid.\n7\nSubs. ibid., for “or CTV station”.\n8\nNew sub-sections (4), (5) and (6) added ibid.\nProvided that the equipment shall be returned to the holder of a valid licence after imposing\non him such penalty as the Authority may determine.\n(6) 1 [ * *                 *          *          *         *          *]\n1[29A. Imposition of fine.— The Authority or, as the case may be, the Chairman, after the\nlicensee has been given reasonable opportunity to show cause, impose fine up to one million rupees\non a licensee who contravenes any of the provisions of this Ordinance or the rules or regulations or the\ncode of conduct or the terms and conditions of the licence:\nProvided that in case of severe violations, the Authority may impose a fine up to ten million\nrupees on the licensee."
    },
    {
      "provision_ref": "sec29b",
      "section": "29B",
      "title": "Section 29B. Dues to be recovered as arrears of land revenue",
      "content": "All dues including outstanding\nlicence fee, annual renewal fee or any other charges including fine as imposed by the Authority shall\nbe recoverable as arrears of land revenue.]\n2\n[30. Power to vary conditions, suspend or revoke the licence.⸺(1) The Authority may\nrevoke or suspend the licence of a broadcast media or distribution service by an order in\nwriting on one or more of the following grounds, namely:⸺\n(a)        the licensee has failed to pay the license fee, annual renewal fee or any other\ncharges including fine, if any;\n(b)        the licensee has contravened any provision of this Ordinance or rules or\nregulations made thereunder:\nProvided that in the case of revocation of a licence of a broadcast media\nan opinion to this effect shall also be obtained from the Council of Complaints;\n(c)        the licensee has failed to comply with any condition of the licence; and\n(d)        where the licensee is a company, and its shareholders have transferred a\nmajority of the shares in the issued or paid up capital of the company or if\ncontrol of the company is otherwise transferred to persons not being the\noriginal shareholders of the company at the time of grant of licence, without\nwritten permission of the Authority.\n(2) The Authority may vary any of the terms and conditions of the licence where it deems\nthat such variation is in the public interest.\n(3) Except for reason of necessity in the public interest a licence shall not be varied, suspended\nor revoked under sub-section (1) or sub-section (2) unless the licensee has been given reasonable\nnotice to show cause and a personal hearing.]\n1\nOmitted and Subs. by Act LXI of 2023, ss.13-14.\n2\nSubs. by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007(Act II of 2007), s.21 for “section 30”.\n1\n[30A. Appeals.__ Any person aggrieved by any decision or order of the Chairman or the Authority\nmay, within thirty days of the receipt therof, prefer an appeal to the High Court within whose territorial\njurisdiction the proceedings were initiated and the decision or order has been passed.]\n1\n[30B. Jurisdiction of courts barred.— Jurisdictions of civil courts are barred. Save as otherwise\nprovided by this Act, no court or other Authority shall have jurisdiction to question the legality of anything\ndone or any action taken under this Ordinance, by or at the instance of the Authority.]\n2\n[31. Uplinking Facilities.⸺ (1) No person shall carry out uplinking without a valid Teleport\nor Satellite TV licence from the Authority;\n(2) The Authority may, subject to fulfillment of such conditions, as may be prescribed, issue\npermission in writing to any party to carry out temporary uplinking from a ground transmission facility to\na satellite in order to transmit any programme within or outside Pakistan.]"
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Power to grant exemptions",
      "content": "The Authority may grant exemptions from any provisions\nof this Ordinance, where the Authority is of the view that such exemption serves the public interest and\nthe exemptions so granted shall be supported by recording the reasons for granting such exemptions\nin writing provided that the grant of exemptions shall be based on guidelines and criteria identified in\nthe Rules and that such exemptions shall be made in conformity with the principles of equality and\nequity as enshrined in the Constitution."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Offences and penalties.⸺ (1) Any 3 [ broadcast media or distribution service] operator or",
      "content": "person who violates or abets the violation of any of the provisions of the Ordinance shall be guilty of an\noffence punishable with a fine which may extend to 4[ten million] rupees.\n(2) When such 3[broadcast media or distribution service] operator or person repeats the violation\nor abetment, such person shall be guilty of an offence punishable with imprisonment for a term which may\nextend to three years, or with fine, or with both.\n(3) Where the violation, or abetment of the violation of any provision of this Ordinance is\nmade by a person who does not hold a licence, such violation shall be punishable with imprisonment\nfor a term which may extend to four years, or with fine, or with both 5[, in addition to the\nconfiscation of the equipment used in the commission of the act.]\n6\n[(4) Whosoever damages, removes, tampers with or commits theft of any equipment of a\nbroadcast media or distribution service station licensed by the Authority, including transmitting\nor broadcasting apparatus, receivers, boosters, converters, distributors, antennae, wires, decoders, set-\ntop boxes or multiplexers shall be guilty of an offence punishable with imprisonment which may extend\nto three years, or with fine, or both.]\n7\n[33A. Officers of Federal, Provincial and Local Governments to assist Authority. __ The\nofficers of Federal Government, Provincial Governments and Local Governments including the Capital\nTerritory Police and the Provincial Police shall assist the Authority and its officers in the discharge\nof their functions under the provisions of this Ordinance and the rules and regulations made thereunder.\n1\nSubs. and Ins. by Act LXI of 2023, ss.15-16\n2\nSubs. by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007(Act II of 2007), s.23, for “section 31”.\n3\nSubs. ibid., s.24, for “broadcoaster or CTV”.\n4\nSubs. ibid., for “one million”.\n5\nAdded ibid.\n6\nNew sub-section (4) added ibid.\n7\nNew sections 33A and 33B ins. ibid., s.25."
    },
    {
      "provision_ref": "sec33b",
      "section": "33B",
      "title": "Section 33B. Warrants for search.⸺ (1) Where on information furnished by the Authority, the",
      "content": "Court has reason to believe that any unlicensed broadcast media or distribution service is being\nowned, controlled or operated or its equipment is being kept or concealed, it may issue a search\nwarrant and the person to whom such search warrant is directed, may enter the premises where\nsuch unlicensed broadcast media or distribution service is being owned, controlled, operated or\nprovided or its equipment is being kept or concealed, or carry out search and inspection thereof and\nseize all or any equipment therein.\n(2) Any equipment of a broadcast media station seized under sub-section (1) having no ostensible\nowner shall vest in the Authority.]"
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Cases to be initiated on complaint",
      "content": "No court shall take cognizance of any offence\nunder 1[sub-section (1) or (2) of section 33 of] this Ordinance except on a complaint in\nwriting by the Authority or any officer authorized by it.\n1\n[34A. Offences to be compoundable and cognizable.__ The offences under sub-sections (3)\nand (4) of section 33 of this Ordinance shall be compoundable and cognizable.]"
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Cognizance of offences etc.⸺ (1) No court inferior to that of a Magistrate of the first class",
      "content": "shall try an offence punishable under this Ordinance.\n(2) Notwithstanding anything contained in section 32 of the Code of Criminal Procedure,\n1898 (Act V of 1898), it shall be lawful for any Magistrate of the first class to pass any sentence\nauthorized by this Ordinance even if such sentence exceeds his powers under the said section 32."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Offences by companies.⸺ (1) Where any offence under this Ordinance has been",
      "content": "committed by a person who at the time the offence was committed was in charge of and was responsible\nto the company for the conduct of the business of the company as well as the company itself shall be\ndeemed to be guilty of the offence and shall be liable to be proceeded against and punished accordingly.\n(2) Where the person guilty of an offence under this Ordinance, is a company, corporation or\nfirm, every director, partner and employee of the company, corporation or firm shall, unless he\nproves that offence was committed without his knowledge, or consent, shall be guilty of the offence\nand shall be liable to be proceeded against and punished accordingly."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Ordinance overrides other laws.⸺ (1) The provisions of this Ordinance shall have effect",
      "content": "notwithstanding anything to the contrary contained in any other law for the time being in force,\nor any contract, agreement or any other instrument whatsoever:\nProvided that⸺\n2\n[(a)   the national broadcasters and state-owned enterprises shall continue to be\nregulated by the relevant laws; and]\n1\nIns. by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007(Act II of 2007), ss. 26-27.\n2\nSubs. by Act LXI of 2023, s.17.\n(b)      other existing private broadcasters or CTV operators who had been granted\nrespective monopolies in multi-modal distribution system, cable TV and in FM\nradio shall henceforth be regulated by this Ordinance except in respects where\nspecific exemptions are granted by the Authority."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Indemnity",
      "content": "No suit, prosecution or other legal proceeding shall lie against the Federal\nGovernment or any Provincial Government or local authority or any other person exercising any\npower or performing any function under this Ordinance or for anything which is in good faith done or\npurporting or intended to be done under this Ordinance or any rule made thereunder."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Power to make rules.⸺ (1) The Authority may, with the approval of the Government, by",
      "content": "notification in the official Gazette, make rules to carry out the purposes of this Ordinance.\n(2) In particular, and without prejudice to the generality of the fore-going power, such rules\nmay be provided for all or any of the following matters, namely:⸺\n(a)      to prescribe the forms for the licences for working, installing, operating, or\ndealing in transmission broadcast or distribution apparatus and the manner in\nwhich applications for the licences shall be granted;\n(b)      to prescribe the terms and conditions of the licence including fee to be charged\nin connection with the issuance of licences and related matters, 1 [*]\n1\n[(c)     to prescribe standards and measures for the establishment of broadcast media\nstations, installation of broadcasting, distribution service or teleporting\nequipment, transmitters, receivers, boosters, converters, distributors and\ncommon antennae;\n(d)      to prescribe terms and conditions for the broadcast media or distribution service\noperators who own, control or operate more than one media enterprise; and\n(e)      to define the circumstances constituting undue concentration of media\nownership and abuse of powers and anti-competitive practices by media\ncompanies.]\n2[39A. Power to make regulations.— The Authority may, by notification in the official\nGazette, make regulations not inconsistent with the provision of this Ordinance and the rules for\ncarrying out the purposes of this Ordinance in respect of its internal matters or as such required by\nany provision of this Ordinance.]"
    }
  ],
  "definitions": [
    {
      "term": "advertisement",
      "definition": "a set of visual and audio messages for the projection of a product, service, or idea with the object of propagating sale, purchase or hire of the product, service or idea for creating other related effects;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "the Pakistan Electronic Media Regulatory Authority (PEMRA) established under section 3; 1 [(c) “broadcast media” means such media which originate and propagate broadcast and pre- recorded signals by terrestrial means or through satellite for radio or television and includes teleporting, provision of access to broadcast signals by channel providers and such other forms of broadcast media as the Authority may, with the approval of the Federal Government, by notification in the official Gazette, specify;] 1 [(ca) “broadcast station” means physical, technical and software infrastructure for the operation of radio or television and also includes satellite uplinking from ground, repeaters and all such other accessories;]",
      "source_provision": "sec2"
    },
    {
      "term": "broadcaster",
      "definition": "a person engaged in broadcast media 1 [except broadcast journalists not actively involved in the operation, ownership, management or control of the broadcast media]; 1 [(da) “Cable TV” means reception of broadcast and prerecorded signals from different channels and their distribution to subscribers through a set of closed transmission paths;]",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Authority; 1 [(ea) “Chairperson” means the head of a Council of Complaint;]",
      "source_provision": "sec2"
    },
    {
      "term": "channel",
      "definition": "the set of frequencies that a broadcast station occupies for broadcasting; 1 [(fa) “channel provider” means a vendor who represents local or foreign channels and provides access of their signal to a distribution service;]",
      "source_provision": "sec2"
    },
    {
      "term": "copyright",
      "definition": "copyright as defined in the Copyright Ordinance, 1962 (XXXIV of 1962); 2 [(ha) “disinformation” means verifiably false, misleading, manipulated, created or fabricated information which is disseminated or shared with the intention to cause harm to the reputation of or to harass any person for political, personal, or financial interest or gains without making an effort to get other person's point of view or not 1 Subs. and Ins. by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007 (Act II of 2007), s. 4. 2 Subs. and Ins. by Act LXI of 2023, s.3. giving it proper coverage and space but does not include misinformation;] 1 2 [ [(haa)]“distribution service” means a service which receives broadcast and pre-recorded signals from different channels and distributes them to subscribers through cable, wireless or satellite options and includes Cable TV, LMDS, MMDS, DTH and such other similar technologies;",
      "source_provision": "sec2"
    },
    {
      "term": "DTH",
      "definition": "Direct to Home distribution of audiovisual signals received via satellite to small dish antennas across the foot-print of the satellite to subscribers;",
      "source_provision": "sec2"
    },
    {
      "term": "electronic media",
      "definition": "the broadcast media and distribution services;] 2 [(hd) “electronic media employee” shall mean and include a person working as an employee with the licensee of the Authority;]",
      "source_provision": "sec2"
    },
    {
      "term": "foreign company",
      "definition": "a company or body corporate organized, and registered under the laws of a foreign government;",
      "source_provision": "sec2"
    },
    {
      "term": "frequency",
      "definition": "the frequency of the electromagnetic wave number measured in Hertz per second and used for transmission;",
      "source_provision": "sec2"
    },
    {
      "term": "FAB",
      "definition": "the Frequency Allocation Board established under section 42 of the Pakistan Telecommunication (Reorganization) Act, 1996 (XVII of 1996); 1 [(ka) “illegal operation” means the broadcast or transmission or distribution of, or provision of access to, programmes or advertisements in the form of channels without having a valid licence from the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "LMDS",
      "definition": "local multipoint distribution service to transmit audio-visual signals through wireless devices, on a higher frequency range for the provision of cable television service;]",
      "source_provision": "sec2"
    },
    {
      "term": "media enterprise",
      "definition": "an enterprise concerned with the publication of a printed newspaper or 3[a broadcast media or distribution service]; 2 [(la) “misinformation” means verifiable false content or information that is unintentionally disseminated or shared;] 1 2 [ [(laa)] “MMDS” means multi-channel multi-point distribution service to transmit audio-visual signals through wireless devices, to multiple subscribers, after receiving such signals from other channels of communication;] 1 [(m) “licence” means a licence issued by the Authority to establish and operate a broadcast media or distribution service;]",
      "source_provision": "sec2"
    },
    {
      "term": "licensee",
      "definition": "a person to whom the Authority has issued a licence; 1 [(na) “newspaper” means a newspaper as defined by the Press, Newspapers, News Agencies and Books Registration Ordinance, 2002(XCVIII of 2002);] 1 Ins., and subs. by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007 (Act II of 2007), s. 4. 2 Re-numbered and Ins. by Act LXI of 2023, s.3. 3 Subs. by the Pakistan Electronic Media Regulatory Authority (Amdt.) Act, 2007 (Act II of 2007), s. 4, for “Journal, a radio or television broadcast station or cinema theatre”.",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "national broadcaster",
      "definition": "the Pakistan Broadcasting Corporation, the Pakistan Television Corporation and the Shalimar Recording and Broadcasting Company;",
      "source_provision": "sec2"
    },
    {
      "term": "PTA",
      "definition": "the Pakistan Telecommunication Authority established under the Pakistan Telecommunication (Reorganisation) Act, 1996 (XVII of 1996);",
      "source_provision": "sec2"
    },
    {
      "term": "person",
      "definition": "an individual, partnership, association, company, trust or 1[. corporation or public body] ;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by the rules 2 [or regulations] made by the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "programme",
      "definition": "the systematic broadcasting of visual or sound images by a broadcast station but does not include an advertisement; 2 [*] 2 [(ta) “regulations” means the regulations made under this Ordinance;]",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "the rules made under this Ordinance 2 [;] 1 [(ua) “severe violation” means a violation of this Ordinance or violation of Article 19 of the Constitution of the Islamic Republic of Pakistan;] 2 [(v) “teleport” means a facility with installed equipment used or required in the process of uplinking or downlinking of audio-visual programmes and signals between an earth station and a satellite; 1[*] 1 [(va) “timely payment of dues” means the payment of dues when made to the electronic media employee within two months; and]",
      "source_provision": "sec2"
    },
    {
      "term": "uplinking",
      "definition": "transmission of audio-video signal from ground transmission facility to a satellite in order to transmit any programme within or outside Pakistan.]",
      "source_provision": "sec2"
    }
  ]
}
