{
  "id": "pk-notaries-ordinance-1961",
  "type": "statute",
  "title": "Notaries Ordinance, 1961",
  "title_en": "Notaries Ordinance, 1961",
  "short_name": "Notaries Ordinance, 1961",
  "status": "in_force",
  "issued_date": "1961-06-13",
  "in_force_date": "1961-06-13",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJyb-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Notaries Ordinance, 1961 (XIX of 1961) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Saving of Act XXVI of 1881",
      "content": "ORDINANCE NO. XIX OF 1961\n[14th June, 1961]\nAn Ordinance to provide for and to regulate the profession of notaries in Pakistan\nWHEREAS it is expedient to provide for and to regulate the profession of notaries in Pakistan;\nNOW, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958,\nand in exercise of all powers enabling him in that behalf the President is pleased to make and\npromulgate the following Ordinance:"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.―(1) This Ordinance may be called the Notaries",
      "content": "Ordinance, 1961.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force on such date 1as the 2 [Provincial Government] may, by notification\nin the official Gazette, appoint."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless the context otherwise requires,―",
      "content": "(a)        “instrument” includes every document by which any right or liability is, or\npurports to be, created, transferred, modified, limited, extended, suspended,\nextinguished or recorded;\n3\n[(b)   “Legal practitioner” means a legal practitioner as defined in the Legal\nPractitioners and Bar Councils Act, 1973 (XXV of 1973);]\n(c)         “notary” means a person appointed as such under this Ordinance:\n4\n*          *          *         *          *          *          *\n(d)        “prescribed” means prescribed by rules made under this Ordinance;\n(e)        “Register” means a Register of Notaries to be maintained under section 4.\n5\n(3). Power to appoint notaries. The * * * Provincial Government, for the whole or any part\nof the Province may, appoint as notaries any legal practitioners or other persons who possesssuch\nqualifications as may be prescribed."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Registers",
      "content": "(1) The 6* * * Provincial Government shall maintain, in such form as may be\nprescribed, a Register of the notaries appointed by that Government and entitled to Practice as such\nunder this Ordinance.\n1\nThis Ordinance has been brought into force in the Province of West Pakistan except the Tribal Areas with effect from the 5th January,\n1966, see Gazette of West Pakistan, 1966, Ext., p. 33h.\n2\nSubs. by A.O., 1964, Art. 2 and Sch., for “Central Government”.\n3\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), S 3 and Sch., II.\n4\nProviso omitted ibid.\n5\nThe words “Central Government” for the whole or any part of Pakistan, and the “omitted by A.O., 1964, Art. 2 and Sch.\n6\nThe words “Central Government and the” omitted ibid.\n(2) Every such Register shall include the following particulars about the notary whose name\nis entered therein, namely:\n(a)       his full name, date of birth, residential and professional address;\n(b)        the date on which his name is entered in the Register;\n(c)       his qualification; and\n(d)       any other particulars which may be prescribed."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Entry of names in the Register and issue or renewal of certificates of practice. Every",
      "content": "notary who intends to practise as such shall, on payment to the 1 [Provincial Government] of the\nprescribed fee, if any, be entitled―\n(a)       to have his name entered in the Register maintained by that Government\nunder section 4, and\n(b)       to a certificate authorizing him to practise for a period of three years from\nthe date on which the certificate is issued to him.\n2\n[(2) Every such notary who wishes to continue to practise after the expiry of the period of\nthree years referred to in clause (b) of sub-section (1) shall, at such time before expiry of the said\nperiod as may be prescribed, submit to the Provincial Government an application for renewal of his\ncertificate of practice accompanied by the prescribed fee.\n(3) On receipt of an application under sub-section (2) from a notary, the Provincial Government\nmay, if, after such inquiry as it may deem fit, it is satisfied that the conduct of the notary during the\npreceding three years has been unobjectionable, renew the certificate of practice for a period of three\nyears.\n(4) A person who has been in practice as a notary for a continuous period of six years shall not\nbeappointed as a notary unless a period of not less than three years has elapsed since the expiry of the\nperiod for which his certificate of practice was renewed.]\n3"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Annual publication of lists of notaries. The * * * Provincial Government shall, not later",
      "content": "than the end of January each year, publish in the official Gazette a list of notaries appointed by that\nGovernment and in practice at the beginning of that year together with such details pertaining to them\nas may be prescribed."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Functions of notaries.― (1) A notary may do all or any of the following acts by virtue of",
      "content": "his office, namely:\n(a)       verify, authenticate, certify or attest the execution of any instrument;\n1\nSubs. ibid., for “Government appointing him”.\n2\nSubs. by the Notaries (Amdt.) Ordinance, 1984 (51 of 1984), s. 2, for sub-section (2), which was previously amended by A.O., 1964, Art.\n2 and Sch.\n3\nThe words “Central Government and every\" omitted by A.O., 1964, Art 2. and Schedule.\n(b)        present any promissory note, hundi or bill of exchange for acceptance or\npayment or demand better security;\n(c)        note or protest the dishonour by non-acceptance or non-payment of any\npromissory note, hundi or bill of exchange or protest for better security or\nprepare acts of honour under the Negotiable Instruments Act, 1881 (XXVI of\n1881), or serve notice of such note or protest;\n(d)        note and draw up ship’s protest, boat’s protest or protest relating to demurrage\nand other commercial matters;\n(e)        administer oath to, or take affidavit from, any person;\n(f)        prepare bottomry and respondantia bonds, charter parties and other mercantile\ndocuments;\n(g)        prepare, attest or authenticate any instrument intended to take effect in any\ncountry or place outside Pakistan in such form and language as may conform to\nthe law of the place where such deed is intended to operate;\n(h)        translate, and verify the translation of, any document from one language into\nanother;\n(i)        any other act which may be prescribed.\n(2) No act specified in subsection (1) shall be deemed to be a notarial act except when it is done\nby a notary under his signature and official seal."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Bar of practice without certificate.―(1) Subject to the provisions of this section, no person",
      "content": "shall practise as a notary or do any notarial act under the official seal of a notary unless he holds a\ncertificate of practice in force issued to him under section 5:\nProvided that nothing in this sub-section shall apply to the presentation of any promissory note,\nhundi or bill of exchange for acceptance or payment by the clerk of a notary acting on behalf of such\nnotary.\n1\n*     *          *          *          *         *\n2"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Removal of names from Register. The [Provincial Government] may, by order, remove",
      "content": "from the Register maintained by it under section 4 the name of the notary if he\n(a)        makes a request to that effect; or\n(b)         has not paid any prescribed fee required to be paid by him; or\n(c)        is an undischarged insolvent; or\n(d)        has been found, upon inquiry in the prescribed manner, to be guilty of such\nprofessional orother misconduct as, in the opinion of the Government, renders\nhim unfit to practise as a notary.\n1Sub-section (2) omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and Sch., II.\n2Subs. by A.O., 1964, Art. 2 and Sch., for “Government appointing any notary”."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Construction of references to notaries public in other laws. Subject to the provisions of",
      "content": "section 16, any reference to a notary public in any other law shall be construed as a reference to a\nnotary entitled to practise under this Ordinance."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Penalty for falsely representing to be a notary, etc. Any person who―",
      "content": "(a)        falsely represents that he is a notary without being appointed as such, or\n(b)        practises as a notary or does any notarial act in contravention of section 9, shall\nbe punishable with imprisonment for a term which may extend to three months,\nor with fine, or with both."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Cognizance of offence.―(1) No court shall take cognizance of any offence committed by",
      "content": "a notary in the exercise or purported exercise of his functions under this Ordinance save upon\ncomplaint in writing made by an officer authorized by the 1* * * Provincial Government by general or\nspecial order in this behalf.\n(2) No magistrate other than a magistrate of the first class shall try an offence punishable under\nthis Ordinance."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Reciprocal arrangements for recognition of notarial acts done by foreign notaries. If",
      "content": "2\nthe [Federal Government] is satisfied that by the law or practice of any country or place outside\nPakistan, the notarial acts done by notaries within Pakistan are recognised for all or any limited\npurposes in that country or place, the 2[Federal Government] may, by notification in the official\nGazette, declare that the notarial acts lawfully done by notaries within such country or place shall be\nrecognised within Pakistan for all purposes or, as the case may be, for such limited purposes as may\nbe specified in the notification."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Power to make rules.―(1) The 1 [Provincial Government] may, by notification in the",
      "content": "official Gazette, make rules to carry out the purposes of this Ordinance.\n(2) In particular, and without prejudice to the generality of the foregoing power, such rules may\nprovide for all or any of the following matters, namely:\n(a)         the qualifications of a notary, the form and manner in which applications for\nappointment as a notary may be made and the disposal of such applicants;\n(b)         the certificates, testimonials or proofs as to character, integrity, ability and\ncompetence which any person applying for appointment as a notary may be\nrequired to furnish;\n(c)         the fees payable for appointment as a notary and for the issue and renewal of a\ncertificate of practice, and exemption, whether wholly or in part, from such fees\nin specified classes of cases;\n(d)         the fees payable to a notary for doing any notarial act;\n1Subs. by A.O., 1964, Art. 2 and Sch., for “Central Government”.\n(e)    the form of Registers and the particulars to be entered therein;\n(f)    the form and design of the seal of a notary;\n(g)    the manner in which inquiries into allegations or professional or other\nmisconduct of notaries may be made;\n(h)    the acts which a notary may do in addition to those specified in section 8 and\nthe manner in which a notary may perform his functions."
    }
  ],
  "definitions": [
    {
      "term": "instrument",
      "definition": "every document by which any right or liability is, or purports to be, created, transferred, modified, limited, extended, suspended, extinguished or recorded; 3 [(b) “Legal practitioner” means a legal practitioner as defined in the Legal Practitioners and Bar Councils Act, 1973 (XXV of 1973);]",
      "source_provision": "sec2"
    },
    {
      "term": "notary",
      "definition": "a person appointed as such under this Ordinance: 4 * * * * * * *",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "Register",
      "definition": "a Register of Notaries to be maintained under section 4. 5 (3). Power to appoint notaries. The * * * Provincial Government, for the whole or any part of the Province may, appoint as notaries any legal practitioners or other persons who possesssuch qualifications as may be prescribed.",
      "source_provision": "sec2"
    }
  ]
}
