{
  "id": "pk-oath-act-1873",
  "type": "statute",
  "title": "Oath Act, 1873",
  "title_en": "Oath Act, 1873",
  "short_name": "Oath Act, 1873",
  "status": "in_force",
  "issued_date": "1873-04-07",
  "in_force_date": "1873-04-07",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bJc%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Oath Act, 1873 (X of 1873) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. [Repeal of enactments.] Rep. by the Repealing Act, 1873 (XII of 1873)",
      "content": "5[3.\nSaving of certain oaths and affirmations. Nothing herein contained applies to\nproceedings before Courts Martial, or to oaths, affirmations or declarations prescribed by or under\nany law 6[or] President’ warrants 7* for the time being in force.]\nII.___AUTHORITY TO ADMINISTER OATHS AND AFFIRMATIONS"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Authority to administer oaths and affirmations",
      "content": "The following Courts and persons are\nauthorized to administer, by themselves or by an officer empowered by them in this behalf, oaths and\naffirmations in discharge of the duties or in exercise of the powers imposed or conferred upon them\nrespectively by law:__\n(a) all Courts and persons having by law or consent of parties authority to receive\nevidence;\n8\n[(b) the Commanding Officer of any military, naval or air force station or ship occupied by\nthe Armed Forces of Pakistan, provided that the oath or affirmation is administered within the limits\nof the station or on the ship.]\n1\nFor the Statement of Objects and Reasons, see Gazette of India, 1873, Pt. V, p. 17 ; for Proceedings in Council, see ibid., 1872, Supplement, p. 889;\nibid., 1873, Supplement, pp. 3, 233, 235 to 246, 281,395, and 410 ; ibid., 1873, Extra Supplement, pp. 1 to 8.\nThis Act has been declared to be in force in Balochistan by the British Balochistan Laws Regulation, 1913 (2 of 1913), s. 3.\nThis Act has been extended to the Leased Areas of Balochistan, see the Leased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950); and applied in the\nFederated Areas of Balochistan, see Gazette of India, 1937, Part I, page 1499.\n2\nThe word” Indian” omitted by A. O., 1949, Sch.\n3\nPara.2 of section 1, as amended by A. O., 1937, A. O.,1949 and the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 4 and III Sch.,\nhas been subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th         Oct, 1955).\n4\n5\n1961, Art. 2 and Sch. (with effect from the 23rdMarch, 1956). to read as above.\n6\nIns. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981). s.3 and IInd Sch.\n7\nThe word “or” omitted ibid.\n8\nClause (b) as amended by Act 35 of 1934, s. 2 and Sch,. Act 10 of 1927, s. 2 and Sch. I and A. O., 1961. Art. 2 (w.e.f. 14-10-1955), has been subs. by\nProvided—\n(1)       that the oath or affirmation be administered within the limits of the station, and\n(2)       that the oath or affirmation be such as a Justice of the Peace is competent to\nadminister in 1[Pakistan].\nIII.___PERSONS BY WHOM OATHS OR AFFIRMATIONS MUST BE MADE"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Oaths or affirmations to be made by. Oaths or affirmations shall be made by the",
      "content": "following persons:—\n(a)      witnesses; all witnesses, that is to say, all persons who may law fully be\nexamined, or give, or be required to give, evidence by or before any Court or\nperson having by law or consent of parties authority to examine such persons\nor to receive evidence; [and]2\n(b)      interpreters; interpreters of questions put to, and evidence given by,\nwitnesses [ : ]3\n4\n*       *           *          *           *           *          *\nJurors. 5[Provided that where the witness is a child under twelve years of age, and the Court\nor person having authority to examine such witness is of opinion that, though he understands the\nduty of speaking the truth, he does not understand the nature of an oath or affirmation, the foregoing\nprovisions of this section and the provisions of section 6 shall not apply to such witness, but in any\nsuch case the absence of an oath or affirmation shall not render inadmissible any evidence given by\nsuch witness nor affect the obligation of the witness to state the truth.]\nNothing herein contained shall render it lawful to administer, in a criminal proceeding, an\noath or affirmation to the accused person, 6[unless he is examined as a witness for the defence,] or\nnecessary to administer to the official interpreter of any Court, after he has entered on the execution\nof the duties of his office, an oath or affirmation that he will faithfully discharge those duties.\n7[6. Oath by a Muslim or by a non-Muslim who has no abjection.—(1) Where the witness\nor interpreter is a Muslim, he shall make an oath.\n(2) Where the witness or interpreter is not a Muslim, he shall make an oath or, if he has an\nobjection to making an oath, an affirmation.]\nIV.___FORMS OF OATHS AND AFFIRMATIONS"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Forms of oaths and affirmations. All oaths and affirmations made under section 5 shall",
      "content": "be administered according to such forms as the High Court may from of time to time prescribe.\n1\nSubs. by the Central Laws (Statute Reform) Ordinance. 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “the\nProvinces and the Capital of the Federation” which had been subs. by A. O., 1949, Arts. 3(2) and 4, for “British India”.\n2\nThe word “and” added by Ordinance 27 of 1981 s. 3 and IInd Sch.\n3\nSubs. ibid., for “; and”\n4\nClause (c) omitted ibid.,\n5\nProvisions ins. by ibid Indian Oaths (Arndt.) Act, 1939 (39 of 1939).\n6\nIns. by Ord. 27 of 1981, s. 3 and 2nd Sch.\n7\nSubs. ibid, for the original section 6.\nAnd until any such forms are prescribed by the High Court, such oaths and affirmations shall\nbe administere1 according to the forms now in use.\n1\n*        *           *          *           *           *           *"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Power of Court to tender certain oaths. If any party to, or witness in, any judicial",
      "content": "proceeding offers to give evidence on oath or solemn affirmation in any form common amongst, or\nheld binding by, persons of the race or persuasion to which he belongs, and not repugnant to justice\nor decency, and not purporting to affect any third person, the Court may, if it thinks fit,\nnotwithstanding anything herein before contained, tender such oath or affirmation to him."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Court may ask party or witness whether he will make oath proposed by opposite",
      "content": "party. If any party to any judicial proceeding offers to be bound by any such oath or solemn\naffirmation as is mentioned in section 8, if such oath or affirmation is made by the other party to, or\nby any witness in, such proceeding, the Court may, if it thinks fit, ask such party or witness, or cause\nhim to be asked, whether or not he will make the oath or affirmation:\nProvided that no party or witness shall be compelled to attend personally in Court solely for\nthe purpose of answering such question."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Administration of oath if accepted. If such party or witness agrees to make such oath or",
      "content": "affirmation, the Court may proceed to administer it, or, if it is of such a nature that it may be more\nconveniently made out of Court, the Court may issue a commission to any person to administer it,\nand authorize him to take the evidence of the person to be sworn or affirmed and return it to the\nCourt."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Evidence conclusive as against person offering to be bound. The evidence so given",
      "content": "shall, as against the person who offered to be bound as aforesaid, be conclusive proof of the matter\nstated."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Procedure in case of refusal to make oath. If the party or witness refuses to make the",
      "content": "oath or solemn affirmation referred to in section 8, he shall not be compelled to make it, but the\nCourt shall record, as part of the proceedings, the nature of the oath or affirmation proposed, the facts\nthat he was asked whether he would make it, and that he refused it, together with any reason which\nhe may assign for his refusal."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Proceedings and evidence not invalidated by omission of oath or irregularity. No",
      "content": "omission to take any oath or make any affirmation, no substitution of anyone for any other of them,\nand no irregularity whatever, in the form in which anyone of them is administered, shall invalidate\nany proceeding or render inadmissible any evidence whatever, in or in respect of which such\nomission, substitution or irregularity took place, or shall affect the obligation of a witness to state the\ntruth."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Persons giving evidence bound to state the truth. Every person giving evidence on any",
      "content": "subject before any Court or person hereby authorized to administer oaths and affirmations shall be\nbound to state the truth on such subject2.\n1\n2\nCf. the Pakistan Penal Code (Act 45 of 1860), s. 191."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Official oaths abolished. Subject to the provisions of sections 3 and 5, no person",
      "content": "appointed to any office shall, before entering on the execution of the duties of his office, be required\nto make any oath, or to make or subscribe any affirmation or declaration whatever.\nSCHEDULE. [Rep. by the Repealing Act, 1873 (XII of 1873).]\n__________\nDate: 16-09-2024"
    }
  ],
  "definitions": []
}
