{
  "id": "pk-obstructions-in-fairways-act-1881",
  "type": "statute",
  "title": "Obstructions in Fairways Act, 1881",
  "title_en": "Obstructions in Fairways Act, 1881",
  "short_name": "OIFA",
  "status": "in_force",
  "issued_date": "1881-03-14",
  "in_force_date": "1881-03-14",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpY%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Obstructions in Fairways Act, 1881 (XVI of 1881) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title. This Act may be called the Obstructions in Fairways Act 1881;",
      "content": "3\n*      *           *         *            *          *          *\nBut nothing herein contained shall apply to vessels 4[belonging to, or hired by a contract made\non behalf of, the 5[Government]]."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Federal Government empowered to remove or destroy obstruction in fairway",
      "content": "Whenever, in any fairway leading to any port in 2[Pakistan], any vessel is sunk, stranded or abandoned,\nor any fishing-stake, timber of other thing is placed or left, 6[the 7[Federal Government]] may, if in its\nopinion such thing is, or is likely to become, an obstruction or danger to navigation,-\n(a)        cause such thing or any part thereof to be removed; or\nif such thing is of such a description or so situate that, 9[in the opinion of the\n(b)\n7\n[Federal Government]], it is not worth removing, cause the same or any part\nthereof to be destroyed."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Federal Government entitled to expenses incurred in removing obstruction. Whenever",
      "content": "anything is removed under section 2, 10[the 7[Federal Government]] shall be entitled to receive a\nreasonable sum, having regard to all the circumstances of the case, for the expenses incurred in\nrespect of such removal.\nDispute concerning such expenses. Any dispute arising concerning the amount due under this\nsection, in respect of anything so removed, shall be decided by the District Magistrate 8* * * having\njurisdiction at the place where such thing is, upon application to him for that purpose by either of the\ndisputing parties; and such decision shall be final.\n1\nFor the Statement of Objects and Reasons, see Gazette of India, 1881, Pt. V., p.3 ; for Proceedings in Council, see ibid.,1881, Supplement, pp. 19 and"
    },
    {
      "provision_ref": "sec3a",
      "section": "3A",
      "title": "Section 3A. The Act has been extended to the whole of Pakistan by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect",
      "content": "from the 14th October, 1955). .\n2\nSubs. by Ord. 21 of 1960, s. 3 and 2nd Sch. (with effect from tbe 14th October, 1955), for” the Provinces and the Capital of the Federation” which had\nbeen subs. by A. O., 1949, Arts. 3(2) and 4, for “British India”.\n3\nThe words “and it shall come into force at once” rep. by the Repealing and Amending Act, 1914 (10 of 1914).\n4\nSubs. by A. O., 1937, for “belonging to Her Majesty or hired by Her Majesty or by the Secretary of State for India in Council” .\n5\nSubs. by A.O., 1961, Art. 2, for” Crown” (with effect from the 23rd March, 1956).\n6\nSubs. by A. O.,1937, for “the L. G., of the part of British India in which such port is situate”.\n7\nSubs. by F. A. O., 1975, Art. 2 and Table, for “Central Government”.\n8\nThe words “or Presidency Magistrate” omitted by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960) s. 3 and 2nd Sch. (with effect from\nthe 14th October, 1955).\n9\nSubs. by A. O., 1937, for “in he opinion of the L. G”.\n10\nSubs. ibid., for “the Govt.”."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Notice of removal to be given by Federal Government. The 1[Federal Government] shall,",
      "content": "whenever anything is removed under section 2, publish in the 2[official Gazette] a notification\ncontaining a description of such thing, and the time at which and the place from which the same was\nso removed."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Things removed may, in certain cases, be sold. If, after publishing such notification, such",
      "content": "thing is unclaimed, or if the person claiming the same fails to pay the amount due for the said expenses\nand any customs-duties or other charges properly incurred by the 1[Federal Government] in respect\nthereof,\nthe 1[Federal Government] may sell such thing by public auction, if it is of a perishable nature,\nforthwith, and, if it is not of a perishable nature, at any time not less than six months after publishing\nsuch notification as aforesaid."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Proceeds how applied. On realizing the proceeds of such sale, the amount due for expenses",
      "content": "and charges as aforesaid, together with the expenses of the sale, shall be deducted therefrom, and the\nsurplus (if any) shall be paid to the owner of the thing sold, or, if no such person appear and claim such\nsurplus, shall be held in deposit for payment, without interest, to any person thereafter establishing his\nright to the same:\nProvided that he makes the claim within one year from the date of the sale."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. “Vessel” to include tackle, cargo, etc. For the purposes of this Act, the term “vessel” shall",
      "content": "be deemed to include also every article or thing or collection of things being or forming part of the\ntackle, equipment, cargo, stores or ballast of a vessel; and any proceeds arising from the sale of a\nvessel, and of the cargo thereof, or of any other property recovered therefrom, shall be regarded as a\ncommon fund."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Power to make rules to regulate and prohibit the placing of obstructions in fairways",
      "content": "The [Federal Government] may, from time to time, by notification in the 4[official Gazette], make\n3\nrules to regulate or prohibit, in any fairway leading to a port in 5[Pakistan], the placing of fishing-\nstakes, the casting or throwing of ballast, rubbish or any other thing likely to give rise to a bank or\nshoal, or the doing of any other act which will in 6[its] opinion, cause, or be likely to cause, obstruction\nor danger to navigation."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Penalty for breach of such rules. Whoever is guilty of any act or omission in contravention",
      "content": "of the rules made under section 8 may be tried for such offence in any district7* * * in which he is\nfound, and shall be punished with imprisonment for a term which may extend to six months, or with\nfine which may extend to five hundred rupees, or with both.\n1\nSubs. by F. A.O., 1975, Art. 2 and Table, for “Central Government” which was subs. by A. O., 1937 for “L.G.”.\n2\nSubs. by A. O., 1937, for “Local official Gazette”.\n3\nSubs. by F. A. O., 1975, Art. 2 and Table, for “Central. Government” which was subs. by A.O. 1937, for “G.G. in C”.\n4\nSubs. by A.O., 1937 for “Gazette of India”.\n5\nSubs. by Ord. 21 of 1960, s. 3 and 2nd Sch. (with effect from tbe 14th October, 1955), for “the Provinces and the Capital of the Federation” which had\nbeen subs. by A. O., 1949, Arts. 3(2) and 4, for “British India”.\n6\nSubs. by A. O.,1937, for “his”.\n7\nThe words “or Presidency-town” omitted by A. O., 1949. Sch."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Compensation payable in certain cases for damage caused under this Act. Whenever",
      "content": "the maintenance or creation of an obstruction in any fairway has become lawful by long usage or\notherwise, and such obstruction is removed or destroyed under section 2, or its creation is regulated or\nprohibited under section 8, any person having a right to maintain or create such obstruction shall be\nentitled to receive from the 1[Federal Government] reasonable compensation for any damage caused\nto him by such removal, destruction, regulation or prohibition.\nEvery dispute arising concerning the right to such compensation, or the amount thereof, shall\nbe determined according to the law for the time being in force relating to like disputes in the case of\nland needed for public purposes2 and not otherwise ; and for the purposes of such law the fairway from\nor in which such obstruction was removed or destroyed, or in which its creation was regulated or\nprohibited, shall be deemed to be a part of the 3* * * district in which the port to which such fairway\nleads is situated."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Certain action of the Government previous to passing of this Act be deemed to have",
      "content": "been taken hereunder. Whenever any obstruction in a fairway leading to a port in 4[Pakistan] has\nbeen removed or destroyed, or whenever the creation of any such obstruction has been regulated or\nprohibited, by an order of the 1[Federal Government] or a 5[Provincial Government], previous to the\npassing of this Act, such removal, destruction, regulation or prohibition shall be deemed to have been\neffected under this Act."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Saving of other powers possessed by Federal Government. Nothing herein contained",
      "content": "shall be deemed to prevent the exercise by 6[the 1[Federal Government]] of any other powers possessed\nby it in this behalf.\n7[13. Application to fairways in inland waterways. All references in this Act to the 1[Federal\nGovernment] shall, in relation to fairways in inland waterways, be construed as references to the\nProvincial Government concerned.]\n__________\nDate: 16-09-2024\n1\nSubs. by F. A. O., 1975, Art. 2 and Table, for “Central Government” which was subs. by A. O., 1937, for “Secretary of State for India in Council”.\n2\nSee, the Land Acquisition Act, 1894 (1 of 1894).\n3\nThe words “Presidency-town or” omitted by A. O., 1949, Sch.\n4\nSubs. by Ord. 21 of 1960, s. 3 and 2nd Sch. (with effect from tbe 14th October, 1955), for “the Provinces and the Capital of the Federation” which had\nbeen subs. by A. O., 1949, Arts. 3(2) and 4, for “British India”.\n5\nSubs. by A. O.,1937, for “L.G.”.\n6\nSubs. by A. O.,1937, for “the Govt.”."
    }
  ],
  "definitions": []
}
