{
  "id": "pk-off-the-grid-captive-power-plants-levy-act-2025",
  "type": "statute",
  "title": "Off the Grid (Captive Power Plants) Levy Act, 2025",
  "title_en": "Off the Grid (Captive Power Plants) Levy Act, 2025",
  "short_name": "OTGPP",
  "status": "in_force",
  "issued_date": "2025-05-29",
  "in_force_date": "2025-05-29",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tlaA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Off the Grid (Captive Power Plants) Levy Act, 2025 (XIV of 2025) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act shall be called as the off the Grid\n(Captive Power Plants) Levy Act, 2025.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,__\n(a)     “agent” means an entity specified in the Schedule;\n(b)     “bulk-power consumer” means a consumer as defined in section 2 of the\nRegulation of Generation, Transmission and Distribution of Electric Power Act,\n1997 (Act No. XL of 1997);\n(c)     “captive power plant” means an industrial undertaking or unit carrying out the\nactivity of power production (with or without cogeneration) for self-\nconsumption or for sale of surplus power to a distribution company or a bulk-\npower consumer;\n(d)     “distribution company” means a distribution company as defined in section 2 of\nthe Regulation of Generation, Transmission and Distribution of Electric Power\nAct, 1997 (Act No. XL of 1997);\n(e)     “levy” means an off the grid levy chargeable from natural gas or RLNG based\ncaptive power plants under section 3 of this Act;\n(f)     “LNG” means liquefied natural gas;\n(g)     “natural gas” means hydrocarbons or mixture of hydrocarbons and other gases\nwhich at sixty degrees fahrenheit and atmospheric pressure are in the gaseous\nstate (including gas from gas wells, gas produced with crude oil and residue gas\nand products resulting from the processing of gas) consisting primarily of\nmethane, together with any other substance produced with such hydrocarbons;\n(h)     “NEPRA” means the National Electric Power Regulatory Authority established\nunder section 3 of the Regulation of Generation, Transmission and Distribution\nof Electric Power Act, 1997;\n(i)     “prescribed” means prescribed by rules;\n(J)     “RLNG” means re-gasified LNG;\n(k)     “rules” means rules made under this Act;\n(1)     “Schedule” means a Schedule to this Act; and\n(m)     “self-power generation cost” means the power generation cost of the captive\npower plant at the Oil and Gas Regulatory Authority’s (OGRA) notified tariff."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Imposition and collection of levy",
      "content": "(1) Subject to section 4, every captive power plant shall\npay to the Federal Government a levy on consumption of natural gas or RLNG, over and above the\nsale price notified under section 8 and section 43B of the Oil and Gas Regulatory Authority Ordinance,\n2002 (XVII of 2002), at such rate as notified by the Federal Government in the official Gazette, from\ntime to time.\n(2) The agent shall be responsible for billing of levy to captive power plants, its collection and\nonward payment to the Federal Government in the manner as may be prescribed."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Calculation of rate of levy.__ Before notifying the levy under sub",
      "content": "section (1) of section 3,\nthe divisions concerned under the Rules of Business, 1973 shall calculate the rate of levy by taking\ninto account the difference of power tariff of industrial B3 category, notified by NEPRA, and the self-\npower generation cost of the captive power plant at the gas tariff notified by OGRA:\nProvided that the rate of levy shall be increased by five percent immediately and further\nincreased to ten percent by July, 2025, fifteen percent by February, 2026 and twenty percent by August,"
    },
    {
      "provision_ref": "sec2026",
      "section": "2026",
      "title": "Section 2026. 5. Utilization of levy",
      "content": "(1) The levy shall be utilized by the Federal Government for reduction\nof power generation tariff for all consumer categories of the power sector.\n(2) An annual report in respect of the utilization of the levy shall be laid before both the Houses\nof Majlis-e-Shoora (Parliament) after three months from the end of each fiscal year."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Consequences for non",
      "content": "payment of levy.__ (1) If the amount of levy is not paid within the\nspecified time by the captive power plant, the same shall be recoverable under sub-section (2) and in\ncase of persistent default in payment, the agent shall terminate the gas supplies to the defaulted captive\npower plant.\n(2) The amount of levy due but not paid within the time allowed shall be recoverable under the\nprovisions of the Public Finance Management Act, 2019."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Allowance to be made for levy for purposes of income tax",
      "content": "The levy paid by a captive\npower plant shall be an expenditure for which allowance is to be made under the Income Tax\nOrdinance, 2001 (XLIX of 2001) in computing its profits or gains."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Power to make rules",
      "content": "(1) The Federal Government may, by notification in the official\nGazette, make rules to carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Power to amend the Schedule",
      "content": "The Federal Government may, by notification in the\nofficial Gazette, make such amendments in the Schedule as it deems fit."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to the provisions of this\nAct, the President may make an order, not inconsistent with the provisions of this Act, to remove the\ndifficulty.\n[See Section 2(a)]"
    }
  ],
  "definitions": [
    {
      "term": "agent",
      "definition": "an entity specified in the Schedule;",
      "source_provision": "sec2"
    },
    {
      "term": "bulk-power consumer",
      "definition": "a consumer as defined in section 2 of the Regulation of Generation, Transmission and Distribution of Electric Power Act, 1997 (Act No. XL of 1997);",
      "source_provision": "sec2"
    },
    {
      "term": "captive power plant",
      "definition": "an industrial undertaking or unit carrying out the activity of power production (with or without cogeneration) for self- consumption or for sale of surplus power to a distribution company or a bulk- power consumer;",
      "source_provision": "sec2"
    },
    {
      "term": "distribution company",
      "definition": "a distribution company as defined in section 2 of the Regulation of Generation, Transmission and Distribution of Electric Power Act, 1997 (Act No. XL of 1997);",
      "source_provision": "sec2"
    },
    {
      "term": "levy",
      "definition": "an off the grid levy chargeable from natural gas or RLNG based captive power plants under section 3 of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "LNG",
      "definition": "liquefied natural gas;",
      "source_provision": "sec2"
    },
    {
      "term": "natural gas",
      "definition": "hydrocarbons or mixture of hydrocarbons and other gases which at sixty degrees fahrenheit and atmospheric pressure are in the gaseous state (including gas from gas wells, gas produced with crude oil and residue gas and products resulting from the processing of gas) consisting primarily of methane, together with any other substance produced with such hydrocarbons;",
      "source_provision": "sec2"
    },
    {
      "term": "NEPRA",
      "definition": "the National Electric Power Regulatory Authority established under section 3 of the Regulation of Generation, Transmission and Distribution of Electric Power Act, 1997;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules;",
      "source_provision": "sec2"
    },
    {
      "term": "RLNG",
      "definition": "re-gasified LNG;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act; (1) “Schedule” means a Schedule to this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "self-power generation cost",
      "definition": "the power generation cost of the captive power plant at the Oil and Gas Regulatory Authority’s (OGRA) notified tariff.",
      "source_provision": "sec2"
    }
  ]
}
