{
  "id": "pk-offences-against-property-enforcement-of-hudood-ordinance-1979",
  "type": "statute",
  "title": "Offences Against Property (Enforcement of Hudood) Ordinance, 1979",
  "title_en": "Offences Against Property (Enforcement of Hudood) Ordinance, 1979",
  "short_name": "OAPOH",
  "status": "in_force",
  "issued_date": "1979-02-09",
  "in_force_date": "1979-02-09",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cZyd-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Offences Against Property (Enforcement of Hudood) Ordinance, 1979 (VI of 1979) published by The Pakistan Code (Criminal Laws).",
  "provisions": [
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Saving",
      "content": "THE OFFENCES AGAINST PROPERTY (ENFORCEMENT OF HUDOOD)\nORDINANCE, 1979\n1\nORDINANCE NO. VI OF 1979\n[10th February, 1979]\nAn Ordinance to bring in conformity with the injunctions of Islam the law relating to certain offences\nagainst property.\nWHEREAS it is necessary to modify the existing law relating to certain offences against\nproperty, so as to bring it in conformity with the injunctions of Islam as set out in the Holy Quran\nand Sunnah;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE in pursuance of the Proclamation of the fifth day of July, 1977, read\nwith the Laws (Continuance in Force) Order, 1977 (C.M.L.A. Order No. 1 of 1977), and in exercise\nof all powers enabling him in that behalf, the President is pleased to make and promulgate the\nfollowing Ordinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Ordinance may be called the Offences\nagainst Property (Enforcement of Hudood) Ordinance, 1979.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force on the twelfth day of Rabi-ul-Awwal, 1399 Hijri, that is, the tenth\nday of February, 1979."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definition",
      "content": "In this Ordinance, unless there is anything repugnant in the subject or\ncontext,—\n(a)        “adult” means a person who has attained the age of eighteen years or puberty:\n(b)        “authorised medical officer” means a medical officer, howsoever designated,\nauthorised by Government;\n(c)        “Hadd” means punishment ordained by the Holy Quran or Sunnah;\n(d)        “Hirz” means an arrangement made for the custody of property;\nExplanation 1. Property placed in a house, whether its door is closed or not, or in an almirah\nor a box or other container or in the custody of a person, whether he is paid for such custody or not is\nsaid to be in hirz.\n1\nThis Ordinance has been applied to the Provincially Administered Tribal Areas of Baluchistan, by Baluchistan Govt. Notification No. S.O. (TA)-3\n(46)/79, dated 29-4-1979, see Baluchistan Gazette, 1979, Ext. (Issue No. 58, dated 14-6-1979).\nThis Ordinance has been applied to the Federally Administered Tribal Areas, by S.R.O. No. 362 (l)/79, dated 23-4-1979, see Gaz. of P., 4979, Ext., Pt.\nII, p. 632.\nThis Ordinance has also been applied to the Provincially Administered Tribal Areas of the N.W.F.P. by Notification No. 127-HD (T.A. HI)/79-H, dated\nthe 26th May, 1979, see Gaz. of N.W.F.P. Ext. 1979, p. 1101.\nExplanation 2. If a single family is living in a house, the entire house will constitute a single\nhirz, but if two or more families are living in one house severally, the portion in the occupation of\neach family will constitute separate hirz.\n(e)     “Imprisonment for life” means imprisonment till death;\n(f)     “ nisab “ means the ‘nisab’ as laid down in section 6;\n(g)     “tazir” means any punishment other than hadd; and all other terms and\nexpressions not defined in this Ordinance shall have the same meaning as in\nProcedure, 1898 (Act V of 1898)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Ordinance to override other laws. The provisions of this Ordinance shall have effect",
      "content": "notwithstanding anything contained in any other for the time being in force."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Theft liable to hadd. Whoever, being an adult, surreptitiously commits, from any hirz,",
      "content": "theft of property of the value of the nisab or more not being stolen property, knowing that it is or is\nlikely to be of the value of the nisab or more is, subject to the provisions of this Ordinance, said to\ncommit theft liable to hadd.\nExplanation 1. In this section “stolen property” does not include property which has been\ncriminally misappropriated or in respect of which criminal breach of trust has been committed.\nExplanation 2. In this section, “surreptitiously” means that the person committing the theft\ncommits such theft believing that the victim of theft does not know of his action. For surreptitious\nremoval of property it is necessary that, if it is day-time, which includes one hour before sunrise and\ntwo hours after sunset, surreption should continue till the completion of the offence and, if it is night,\nsubreption need not continue after commencement of the offence."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Nisab",
      "content": "The nisab for theft liable to hadd is four decimal four five seven (4.457) grams of\ngold, or other property of equivalent value, at the time of theft.\nExplanation.— If theft is committed from the same hirz in more than one transaction, or from\nmore than one hirz and the value of the stolen property in each case is less than the nisab, it is not\ntheft liable to hadd even if the value of the property involved in all cases adds up to, or exceeds, the\nnisab.\nIllustrations\n(a)     A enters a house occupied by a single family and removes from various rooms\nproperty the value of which adds up to, or exceed the nisab. Such theft is\nliable to hadd even though the value of the property removed from any of the\nrooms does not amount to the nisab. If the house is occupied by more than one\nfamily and the value of the property removed from the hirz of any one family\nis less than the nisab, then the theft is not liable to hadd even though the value\nof the properties removed adds up to, or exceeds, the nisab.\n(b)     A enters a house several times and removes from the house on each occasion\nproperty the value of which does not amount to the nisab. Such theft is not\nliable to hadd even though the value or the properties removed adds up to, or\nexceeds, the nisab."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Proof of theft liable to hadd. The proof of theft liable to hadd shall be in one of the",
      "content": "following forms namely:\n(a)        the accused pleads guilty of the commission of theft liable to hadd; and\n(b)        at least two Muslim adult male witnesses, other than the victim of the theft,\nabout whom the Court is satisfied, having regard to the requirements of\ntazkiyah-al-shuhood, that they are truthful persons and abstain from major sins\n(kabair), give evidence as eye-witnesses of the occurrence:\nProvided that, if the accused is a non-Muslim, the eye-witnesses may be non-Muslim:\nProvided further that the statement of the victim of theft or the person authorised by him shall\nbe recorded before the statements of the eye-witnesses are recorded.\nExplanation.—In this section, tazkiyah-al-shuhood means the mode of inquiry adopted by a\nCourt to satisfy itself as to the credibility of a witness."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Commission of theft liable to hadd by more than one person. Where theft liable to hadd",
      "content": "is committed by more than one person and the aggregate value of the stolen property is such that, if\nthe property is divided equally amongst such of them as have entered the hirz each one of them gets\na share which amounts to, or exceeds the nisab the hadd shall be imposed on all of them who have\nentered the Hirz, whether or not each one of them has moved the stolen property of any part thereof."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Punishment of theft liable to hadd",
      "content": "(1) Whoever commits theft liable to hadd for the\nfirst time shall be punished with amputation of his right hand from the joint of the wrist.\n(2) Whoever commits theft liable to hadd for the second time shall be punished with\namputation of his left foot up to the ankle.\n(3) Whoever commits theft liable to hadd for the third time, or any time subsequent thereto,\nshall be punished with imprisonment for life.\n(4) Punishment under sub-section (1) or sub-section (2) shall not be executed unless it is\nconfirmed by the Court to which an appeal from the order of conviction lies, and until the\npunishment is confirmed and executed the convict shall be dealt with in the same manner as if\nsentenced to simple imprisonment.\n(5) In the case of a person sentenced to imprisonment for life under sub-section (3), if the\n1\n[Appellate Court] is satisfied that he is sincerely penitent, he may be set at liberty on such terms and\nconditions as the Court may deem fit to impose.\n(6) Amputation shall be carried out by an authorised medical officer.\n(7) If, at the time of the execution of hadd the authorised medical officer is of the opinion that\nthe amputation of hand or foot may cause the death of the convict, the execution of hadd shall be\npostponed until such time as the apprehension of death cases.\n1\nSubs, by the Offences Against Property (Enforcement of Hudood) (Amdt.) Ordinance, 1980 (19 of 1980), s. 2, for “High Court”."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Cases in which Hadd shall not be imposed. Hadd shall not be imposed in the following",
      "content": "cases, namely:\n(a)    when the offender and victim of the theft are related to each other as-\n(i)     spouses;\n(ii)    ascendants, paternal or maternal;\n(iii)   descendants, paternal or maternal;\n(iv)    brothers or sisters of father or mother; or\n(v)     brothers or sisters or their children;\n(b)    when a guest has committed theft from the house of his host;\n(c)    when a servant or employee has committed theft from the hirz of his master or\nemployer to which he is allowed access;\n(d)    when the stolen property is wild grass, fish, bird, dog, pig, intoxicant, musical\ninstrument or perishable foodstuffs for the preservation of which provision\ndoes not exist;\n(e)    when the offender has a share in the stolen property the value of which, after\ndeduction of his share, is less than the nisab;\n(f)    when a creditor steals his debtor’s property the value of which after deduction\nof the amount due to him, is less than the nisab;\n(g)    when the offender has committed theft under ikrah or iztrar:\nExplanation.— In this clause,-\n(i)     “Ikrah” means putting any person in fear of injury to the person,\nproperty or honour of that or any other person; and\n(ii)    “iztrar” means a situation in which a person is in apprehension of\ndeath due to extreme hunger or thirst.\n(h)   when the offender, before his apprehension, has, on account of repentance,\nreturned the stolen property to the victim and surrenders himself to the\nauthority concerned."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Case in which Hadd shall not be enforced",
      "content": "(1) Hadd shall not be enforced in the\nfollowing cases, namely:-\n(a)    when theft is proved only by the confession of the convict, but he retracts his\nconfession before the execution of hadd;\n(b)    when theft is proved by testimony, but before the execution of hadd, any\nwitness resiles from his testimony so as to reduce the number of eye-witnesses\nto less than two;\n(c)     when, before the execution of hadd the victim withdraws his allegation of\ntheft or states that the convict had made a false confession or that any of the\neye-witnesses have deposed falsely, and the number of eye-witnesses is\nthereby reduced to less than two; and\n(d)     when the left hand or the left thumb or at least two fingers of the left hand or\nthe right foot of the offender are either missing of entirely unserviceable.\n(2) In the case mentioned in clause (a) of sub-section (1) the Court may order retrial.\n(3) In a case mentioned in clause (b), or clause (c), or clause (d) of sub-section (1), the Court\nmay award tazir on the basis of the evidence on record."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Return of stolen property",
      "content": "(1) If the stolen property is found in the original or in an\nidentifiable form, or in a form into or for which it may have been converted or exchanged, it shall be\ncaused to be returned to the victim, whether it is in the possession of, or has been recovered from the\noffender or any other person.\n(2) If the stolen property is lost or consumed while in the offender’s possession and the hadd,\nis enforced against him, the offender shall not be required to pay compensation."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Theft liable to tazir. Whoever commits theft which is not liable to hadd or for which",
      "content": "proof in either of the forms mentioned in section 7 is not available, or for which hadd may not be\nimposed or enforced under this Ordinance, shall be liable to tazir."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Punishment for theft liable to tazir. Whoever commits theft liable to tazir shall be",
      "content": "awarded the punishment provided for the offence of theft in the Pakistan Penal Code (Act XLV of\n1860)."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Definition of haraabah. When any one or more persons, whether equipped with arms or",
      "content": "not, make show of force for the purpose of taking away the property of another and attack him or\ncause wrongful restraint or put him in fear of death or hurt, such person or persons, are said to\ncommit haraabah."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Punishment for haraabah",
      "content": "(1) Whoever, being an adult, is guilty of haraabah in the\ncourse of which neither any murder has been committed nor any-property has been taken away shall\nbe punished with whipping not exceeding thirty stripes and with rigorous imprisonment until the\nCourt is satisfied of his being sincerely penitent:\nProvided that the sentence of imprisonment shall in no case be less than three years.\n(2) Whoever, being an adult, is guilty of haraabah in the course of which no property has\nbeen taken away but hurt has been caused to any person shall, in addition to the punishment provided\nfor in sub-section (1), be punished for causing such hurt in accordance with such other law as may\nfor the time being be applicable.\n(3) Whoever, being an adult, is guilty of haraabah in the course of which no murder has\nbeen committed but property the value of which amounts to, or exceeds, the nisab has been taken\naway shall be punished with amputation of his right hand from the wrist and of his left foot from the\nankle:\nProvided that, when the offence of haraabah has been committed conjointly by more than\none person, the punishment of amputation shall be imposed only if the value of share of each one of\nthem is not less than the nisab;\nProvided further that, if the left hand or the right foot of the offender is missing or is entirely\nunserviceable, the punishment of amputation of the other hand or foot, as the case may, shall not be\nimposed, and the offender shall be punished with rigorous imprisonment for a term which may\nextend to fourteen years and with whipping not exceeding thirty stripes.\n(4) Whoever, being an adult, is guilty of haraabah in the course of which he commits\nmurder shall tie punished with death imposed as hadd.\n(5) Punishment under sub-section (3), except that under the second proviso thereto, or under\nsub-section (4), shall not be executed unless it is confirmed by the Court to which an appeal from the\norder of conviction lies, and if the punishment be of amputation, until it is confirmed and executed,\nthe convict shall be dealt within the same manner as if sentenced to simple imprisonment.\n(6) The provisions of sub-section (6) and sub-section (7) of section 9 shall apply to the\nexecution of the punishment of amputation under this section."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Cases in which punishment of amputation or death for haraabah shall not be",
      "content": "imposed or enforced. The punishment of amputation or death shall not be imposed or enforced for\nthe offence of haraabah in cases in which hadd may not be imposed for theft liable to hadd and the\nprovisions of section 10 and section 11 shall apply mutatis mutandis to such cases."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Return of property taken away during haraabah. The provisions of section 12 shall",
      "content": "apply, mutatis mutandis for return of the property taken away during haraabah so however, that sub-\nsection (2) of the said section shall have effect as if, for the word “Hadd” therein, the words\n“punishment of amputation or death” were substituted."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Punishment for haraabah liable to tazir. Whoever commits haraabah which is not",
      "content": "liable to the punishment provided for in section 17, or for which proof in either of the forms\nmentioned in section 7 is not available, or for which punishment of amputation or death may not be\nimposed or enforced under this Ordinance, shall be awarded, the punishment provided in the\nPakistan Penal Code (Act XLV of 1860) for the offence of dacoity, robbery or extortion, as the case\nmay be."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Punishment for rassagiri or patharidari",
      "content": "(1) Whoever extends patronage, protection\nor assistance in any form to, or harbours, any person or group of persons engaged in the theft of\ncattle, on the understanding that he shall receive one or more of the cattle in respect of which the\noffence is committed, or a share in the proceeds thereof, is said to commit “rassagiri” or\n“patharidari”.\n(2) Whoever commits “rassagiri” or “patharidari” shall be punished with rigorous\nimprisonment for a term which may extend to fourteen years, or with whipping not exceeding\nseventy stripes, and with confiscation of all his immovable property and with fine."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Punishment for attempts to commit offence punishable by this Ordinance. Whoever",
      "content": "attempts to commit an offence punishable under this Ordinance, or to cause such an offence to be\ncommitted, and in such attempt does any act towards the commission of the offence, shall, where no\nexpress provision is made by this Ordinance for the punishment of such attempt, be punished with\nimprisonment of either description for a term which may extend to ten years.\nIllustrations\n(a)        A makes an attempt to steal some jewels by breaking open a box, and finds\nafter so opening the box that there is no jewel in it. He has done an act towards\nthe commission of theft, and therefore, is guilty under this section.\n(b)        A makes an attempt to pick the pocket of Z by thrusting his hand into Z’s\npocket. A fails in the attempt in consequence of Z’s having nothing in his\npocket A is guilty under this section."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Application of certain provisions of Pakistan Penal Code (Act XLV of 1860). (1)",
      "content": "Unless otherwise expressly provided in this Ordinance, the provisions of sections 34 to 38 of Chapter\nII, section 71 and section 72 of Chapter III and section 149 of Chapter VIII of the Pakistan Penal\nCode, (Act XLV of 1860), shall apply, mutatis mutandis in respect of offences under this Ordinance.\n(2) Whoever is guilty of the abetment of and offence liable to hadd under this Ordinance shall\nbe liable to the punishment provided for such offence as tazir."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Application of Code of Criminal Procedure, 1898",
      "content": "(1) The provisions of the Code of\nCriminal Procedure, 1898 (Act V of 1898), shall apply, mutatis mutandis, in respect of cases under\nthis Ordinance:\nProvided that, if it appears in evidence that the offender has committed a different offence\nunder any other law, he may, if the Court is competent to try that offence and to award punishment\ntherefore, be convicted and punished for that offence [:]1\n2\n[Provided further that an offence punishable under section 9 or section 17 shall be triable by\na Court of Session and not by a Magistrate authorised under section 30 of the said Code and an\nappeal from an order under either of the said sections, 3[or from an order under any provision of this\nOrdinance which impose a sentence of imprisonment for a term exceeding two years,] shall lie to the\nFederal Shariat Court;\nProvided further that a trial by a Court of Session under this Ordinance shall ordinarily be\nheld at the headquarters of the Tehsil in which the offence is alleged to have been committed.]\n(2) The provisions of the Code of Criminal Procedure, 1898 (Act V of 1898), relating to the\nconfirmation of the sentence of death, shall apply, matatis mutandis, to confirmation of sentences\nunder this Ordinance.\n(3) The provisions of sub-section (3) of section 391 or section 393 of the Code of Criminal\nProcedure, 1898 (Act V of 1898), shall not apply in respect of the punishment of whipping awarded\nunder this Ordinance.\n1\nSubs, by the Offences Against Property (Enforcement of Hudood) (Amdt.) Ordinance. 1980 (19 of 1980) s. 3, for full stop.\n2\nAdded ibid.,\n3\nIns. by the Offences Against Property (Enforcement of Hudood) (Amdt.) Ordinance, 1982 (2 of 1982), s. 2.\n(4) The provisions of Chapter XXIX of the Code of Criminal Procedure, 1898 (Act V of\n1898), shall not apply in respect of punishments awarded under section 9 or section 17 of this\nOrdinance."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Presiding Officer of Court be a Muslim. The Presiding Officer of the Court by which a",
      "content": "case is tried, or an appeal is heard, under this Ordinance shall be a Muslim:\nProvided that, if the accused is a non-Muslim, the Presiding Officer may be a non-Muslim."
    }
  ],
  "definitions": [
    {
      "term": "adult",
      "definition": "a person who has attained the age of eighteen years or puberty:",
      "source_provision": "sec2"
    },
    {
      "term": "authorised medical officer",
      "definition": "a medical officer, howsoever designated, authorised by Government;",
      "source_provision": "sec2"
    },
    {
      "term": "Hadd",
      "definition": "punishment ordained by the Holy Quran or Sunnah;",
      "source_provision": "sec2"
    },
    {
      "term": "Hirz",
      "definition": "an arrangement made for the custody of property; Explanation 1. Property placed in a house, whether its door is closed or not, or in an almirah or a box or other container or in the custody of a person, whether he is paid for such custody or not is said to be in hirz. 1 This Ordinance has been applied to the Provincially Administered Tribal Areas of Baluchistan, by Baluchistan Govt. Notification No. S.O. (TA)-3 (46)/79, dated 29-4-1979, see Baluchistan Gazette, 1979, Ext. (Issue No. 58, dated 14-6-1979). This Ordinance has been applied to the Federally Administered Tribal Areas, by S.R.O. No. 362 (l)/79, dated 23-4-1979, see Gaz. of P., 4979, Ext., Pt. II, p. 632. This Ordinance has also been applied to the Provincially Administered Tribal Areas of the N.W.F.P. by Notification No. 127-HD (T.A. HI)/79-H, dated the 26th May, 1979, see Gaz. of N.W.F.P. Ext. 1979, p. 1101. Explanation 2. If a single family is living in a house, the entire house will constitute a single hirz, but if two or more families are living in one house severally, the portion in the occupation of each family will constitute separate hirz.",
      "source_provision": "sec2"
    },
    {
      "term": "Imprisonment for life",
      "definition": "imprisonment till death;",
      "source_provision": "sec2"
    },
    {
      "term": "nisab “ means the ‘nisab’ as laid down in section 6; (g) “tazir",
      "definition": "any punishment other than hadd; and all other terms and expressions not defined in this Ordinance shall have the same meaning as in Procedure, 1898 (Act V of 1898).",
      "source_provision": "sec2"
    }
  ]
}
