{
  "id": "pk-offences-in-respect-of-banks-special-courts-ordinance-1984",
  "type": "statute",
  "title": "Offences in Respect of Banks (Special Courts) Ordinance, 1984",
  "title_en": "Offences in Respect of Banks (Special Courts) Ordinance, 1984",
  "short_name": "OIROB",
  "status": "in_force",
  "issued_date": "1984-02-22",
  "in_force_date": "1984-02-22",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bp2Z-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Offences in Respect of Banks (Special Courts) Ordinance, 1984 (IX of 1984) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Ordinance to override other laws",
      "content": "FIRST SCHEDULE.\nSECOND SCHEDULE.\nTHE OFFENCES IN RESPECT OF BANKS (SPECIAL COURTS)\nORDINANCE, 1984\nORDINANCE No. IX OF 1984\n[23rd February, 1984]\nAn Ordinance to provide for speedy trial of certain offences committed in respect of banks and for\nmatters connected therewith or incidental thereto.\nWHEREAS it is expedient to provide for speedy trial of certain offences committed in respect of\nbanks and for matters connected therewith or incidental thereto ;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary to\ntake immediate action ;\nNOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, and in\nexercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the\nfollowing Ordinance :"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Ordinance may be called the Offences in",
      "content": "Respect of Banks (Special Courts) Ordinance, 1984.\n(2) It extends to the whole of Pakistan and also applies to the business of a bank transacted\noutside Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context,",
      "content": "(a)     “bank” has the same meaning as in the Banks (Nationalization) Act, 1974 (XIX of\n1974), and includes\n(i)     a scheduled bank as defined in the State Bank of Pakistan Act, 1956\n(XXXIII of 1956) ;\n(ii)    the Pakistan Industrial Credit and Investment Corporation, the Investment\nCorporation of Pakistan, the National Development Finance Corporation,\nthe Bankers Equity Limited and the National Investment Trust ;\n(iii)   a Government Savings Bank to which the Government Savings Bank Act,\n1873 (V of 1873), applies ; and\n(iv)    such other company, institution or body as the Federal Government may,\nby notification in the official Gazette, declare to be a bank for the purposes\nof this Ordinance ;\n(b)        “Code” means the Code of Criminal Procedure, 1898 (Act V of 1898) ;\n(c)        “relative” in relation to a person, means\n(i)        spouse of the person ;\n(ii)       brother or sister of the person ;\n(iii)      brother or sister of the spouse of the person ;\n(iv)       any lineal ascendant or descendant of the person ;\n(v)        any lineal ascendant or descendant of the spouse of the person ;\n(vi)       spouse of person referred to in sub-clause (ii), (iii), (iv) or (v) ; or\n(vii)      any lineal ascendant of a person referred to in sub-clause (ii) or (iii) ;\n(d)        “scheduled offence” means an offence specified in the First Schedule and alleged\nto have been committed in respect, or in connection with the business, of a bank ;\nand\n(e)        “Special Court” means a Special Court constituted under section 3.\n1\n[3. Establishment of Special Courts. (1) The Federal Government may, by notification in\nthe Official Gazette, establish as many Special Courts as it considers necessary to try scheduled offences\nand appoint a Judge for each of such Courts, and where it establishes more Special Courts than one, it\nshall specify in the notification the territorial limits within which each of the Special Courts shall\nexercise jurisdiction under this Ordinance.\n(2) A Judge of a Special Court shall be appointed by the Federal Government after consultation\nwith the chief Justice of the High court of the Province in which the Special Court is established and no\nperson shall be appointed a Judge of a Special Court unless he has been a Judge of High Court or is, or\nhas been, a Sessions Judge.\n(3) A Judge of a Special Court, not being a Sessions Judge, shall be appointed for a term of three\nyears from the date on which he enters upon his office.\n(4) The salary, allowances and other terms and conditions of service of a person appointed as a\nJudge of a Special Court shall be such as may be determined by the Federal Government.\n(5) A Special Court shall hold its sittings at such places within its territorial limits as may be\ndetermined by the Federal Government.\n(6) A person, not being a Sessions Judge, appointed as a Judge of the Special Court, may, by\nnotice in writing under his hand, addressed to the Federal Government, resign from his office.\n1\nSubs. by the Offences in Respect of Banks (Special Courts) (Amdt.) Act, 1997 (XVI of 1997), s. 2.\n(7) A person appointed as a Judge of the Special Court may be removed from his office in\nconsultation with the Chief Justice of the High Court.]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Scheduled offence to be tried by Special Court. (1) Notwithstanding anything contained in",
      "content": "the Code, the scheduled offences shall be triable exclusively by a Special Court.\n(2) The Federal Government may, from time to time, by notification in the official Gazette,\ninclude in the First Schedule such other offences as it deems necessary or expedient.\n(3) All cases relating to a scheduled offence pending in any court other than a Special Court\nimmediately before the commencement of this Ordinance shall, on such commencement, stand\ntransferred to the Special Court having jurisdiction over such cases.\n(4) Whenever an offence is included in the First Schedule under sub-section (2), all cases relating\nto that offence pending in any court other than a Special Court immediately before such inclusion shall\nstand transferred to the Special Court having jurisdiction over such cases.\n(5) In respect of cases transferred to a Special Court by virtue of sub-section (3) or sub-section\n(4), the Special Court shall not, by reason of the said transfer, be bound to recall and rehear any witness\nwho has given evidence in the case before transfer and may act on the evidence already recorded by or\nproduced before the court which tried the case before the transfer.\n(6) If, in the course of a trial before a Special Court, the court is of opinion that any of the\noffences which the accused is alleged to have committed is not a scheduled offence, the Court shall\nrecord such opinion and try the accused only for such offence if any, as is a scheduled offence.\n(7) In cases transferred to a Special Court by virtue of sub-section (3) or sub-section (4), any bail\ngranted to an accused person by the court which tried the case before the transfer shall stand cancelled."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Procedure of a Special Court. (1) A Special Court may take cognizance of any scheduled",
      "content": "offence upon receiving a complaint of the facts which constitute such offence or upon a report in writing\nof such facts made by any police officer.\n(2) A Special Court shall not adjourn any trial for any purpose unless such adjournment is, in its\nopinion, necessary in the interests of justice.\n(3) A Special Court shall not, merely by reason of a change in its composition, be bound to recall\nand rehear any witness who has given evidence and may act on the evidence already recorded by or\nproduced before it.\n(4) A Special Court may try an accused person in his absence if, in its opinion,\n(a)     such absence is deliberate and brought about with a view to impeding the course\nof Justice, or\n(b)     the behaviour of the accused in court has been such as to impede the course of\njustice and the Special Court has on that account ordered his removal from the\ncourt.\n(5) An accused person who is tried in his absence under sub-section (4) shall be deemed not to\nhave admitted commission of the offence stated to have been committed by him.\n(6) An accused person shall not be released on bail by a Special Court, or by any other court, if\nthere appear reasonable grounds for believing that he has been guilty of a scheduled offence ; nor shall\nan accused person be so released unless the prosecution has been given notice to show cause why he\nshould not be so released.\n(7) Where an accused person is released on bail, the amount of bail shall be fixed having regard\nto the gravity of the charge against such person and, where the charge specifies any amount in respect of\nwhich the offence is alleged to have been committed, shall not be less than 1[*] the said amount.\n(8) A Special Court shall, in all matters with respect to which no procedure has been prescribed\nby this Ordinance, follow the procedure prescribed by the Code for the trial of cases by Magistrates."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Powers of Special Court. (1) Subject to sub",
      "content": "section (2) and sub-section (3), a Special Court\nmay pass any sentence authorised by law and shall have all the powers conferred by the Code on a court\nof session exercising original jurisdiction.\n(2) For the purposes of this Ordinance, the provisions of the Pakistan Penal Code (Act XLV of\n1860), specified in the Second Schedule shall have effect subject to the modifications specified therein.\n(3) Where a Special Court passes a sentence of fine, whether in addition to any other punishment\nor not, the amount of such fine shall be fixed by it having regard to the gravity of the offence for which\nthe accused person is convicted and, where the Special Court finds the offence to have been committed\nin respect of a specified amount, shall not be less than twice the said amount.\n(4) Where a Special Court passes a sentence of fine, the Court shall order the whole or any part\nof the fine recovered to be applied in the payment to the bank in respect of which the offence was\ncommitted of compensation for the loss caused to it by the offence."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Transfer of property void. (1) After a Special Court has taken cognizance of a scheduled",
      "content": "offence alleged to have been committed by an accused person, such person or any relative of such\nperson or other person on his behalf shall not, without the previous permission in writing of the Special\nCourt, transfer, or create a charge on, any movable or immovable property owned by him or in his\npossession, while proceedings are pending before the Special Court ; and any transfer of, or creation of a\ncharge on, such property without such permission shall be void.\n(2) Any person who transfers, or creates a charge on, any property in contravention of sub-\nsection (1) shall be punishable with rigorous imprisonment for a term which may extend to three years\nand shall also be liable to fine."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Accused not to depart from Pakistan or be employed by any person. (1) After a Special",
      "content": "Court has taken cognizance of a scheduled offence alleged to have been committed by an accused\nperson,\n1\nOmitted by the Offences in Respect of Banks (Special Courts) (Amdt.) Act, 1997 (XVI of 1997), s. 3.\n(a)        such person shall not, without the permission of the Special Court, depart from\nPakistan until the case has been finally decided by the Special Court ; and\n(b)        no person shall, until the case has been finally decided by the Special Court,\nemploy or engage such person without the permission of the Special Court for any\nservice for the rendering of which any remuneration is payable.\n(2) Whoever contravenes the provisions of sub-section (1) shall be punishable with rigorous\nimprisonment for a term which may extend to three years, and shall also be liable to fine."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Burden of proof. In any trial under this Ordinance, the fact that the accused person, or any of",
      "content": "his relatives or any other person on his behalf, is in possession, for which the accused person cannot\nsatisfactorily account, of pecuniary resources or property disproportionate to his known sources of\nincome may be proved and on such proof the Special Court shall presume, unless the contrary is proved,\nthat the accused person is guilty of a scheduled offence ; and his conviction therefor shall not be invalid\nby reason only that it is based solely on such presumption."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Appeals from sentences passed by Special Court, etc. (1) A person sentenced by a",
      "content": "Special Court shall have a right of appeal to the High Court within whose jurisdiction the sentence has\nbeen passed, but save as aforesaid and notwithstanding the provisions of the Code or of any other law\nfor the time being in force or of anything having the force of law by whatsoever authority made or done,\nno court shall have authority to revise such sentence, or to transfer any case from a Special Court or to\nmake any order under section 426 or section 491 or section 498 of the Code, or have any jurisdiction of\nany kind in respect of any proceedings of a Special Court.\n(2) An appeal under sub-section (1) shall be preferred to the High Court within thirty days of the\npassing of the sentence and shall be heard and decided by a Bench of not less than two Judges of the\nHigh Court.\n(3) Chapter XXIX of the Code shall apply to the suspension, remission and commutation of\nsentences passed by a Special Court.\n1\n[10A. Appeal in case of Acquittal. If an order of acquittal is passed by the Special Court in\nany case, the High Court may, on an application made with in the thirty days by an aggrieved party in\nthis behalf, grant special leave to appeal from the order of acquittal, whereupon the aggrieved party may\npresent such an appeal to the High Court.]"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Indemnity. No suit, prosecution or other legal proceeding shall lie against any person in",
      "content": "respect of anything which is in good faith done or intended to be done under this Ordinance."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. 468 For the words “may extend to” the words “shall not",
      "content": "be less than four years nor more than” shall be\nsubstituted."
    }
  ],
  "definitions": [
    {
      "term": "Code",
      "definition": "the Code of Criminal Procedure, 1898 (Act V of 1898) ;",
      "source_provision": "sec2"
    },
    {
      "term": "scheduled offence",
      "definition": "an offence specified in the First Schedule and alleged to have been committed in respect, or in connection with the business, of a bank ; and",
      "source_provision": "sec2"
    },
    {
      "term": "Special Court",
      "definition": "a Special Court constituted under section 3. 1 [3. Establishment of Special Courts. (1) The Federal Government may, by notification in the Official Gazette, establish as many Special Courts as it considers necessary to try scheduled offences and appoint a Judge for each of such Courts, and where it establishes more Special Courts than one, it shall specify in the notification the territorial limits within which each of the Special Courts shall exercise jurisdiction under this Ordinance. (2) A Judge of a Special Court shall be appointed by the Federal Government after consultation with the chief Justice of the High court of the Province in which the Special Court is established and no person shall be appointed a Judge of a Special Court unless he has been a Judge of High Court or is, or has been, a Sessions Judge. (3) A Judge of a Special Court, not being a Sessions Judge, shall be appointed for a term of three years from the date on which he enters upon his office. (4) The salary, allowances and other terms and conditions of service of a person appointed as a Judge of a Special Court shall be such as may be determined by the Federal Government. (5) A Special Court shall hold its sittings at such places within its territorial limits as may be determined by the Federal Government. (6) A person, not being a Sessions Judge, appointed as a Judge of the Special Court, may, by notice in writing under his hand, addressed to the Federal Government, resign from his office. 1 Subs. by the Offences in Respect of Banks (Special Courts) (Amdt.) Act, 1997 (XVI of 1997), s. 2. (7) A person appointed as a Judge of the Special Court may be removed from his office in consultation with the Chief Justice of the High Court.]",
      "source_provision": "sec2"
    }
  ]
}
