{
  "id": "pk-pakistan-army-and-air-force-reserves-act-1950",
  "type": "statute",
  "title": "Pakistan (Army and Air Force) Reserves Act, 1950",
  "title_en": "Pakistan (Army and Air Force) Reserves Act, 1950",
  "short_name": "PAAFR",
  "status": "in_force",
  "issued_date": "1950-04-18",
  "in_force_date": "1950-04-18",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap%2BWZQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan (Army and Air Force) Reserves Act, 1950 (XLVII of 1950) published by The Pakistan Code (Military Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "_This Act may be called the Pakistan (Army and Air\nForce) Reserves Act, 1950."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_In this Act, unless there is anything repugnant in the subject or context,___\n“prescribed” means prescribed by rules made under this Act;\n“Reserves” means the Reserves of the Pakistan Army or of the 1[*] Pakistan Air Force;\n“reservist” means a member of the Reserves."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Divisions of Reserve Forces",
      "content": "_(1) The Reserves shall consist of the categories specified in\n(2) The 2[Federal Government] may, by notification in the official Gazette, add to, amend or\nvary the Schedule to this Act."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Liability of reservists to military or air force law. An Army reservist shall be subject to",
      "content": "3\n[* * *] 4[the Pakistan Army Act, 1952 (XXXIX of 1952),] and the rules and regulations made\nthereunder and an Air Force reservist shall be subject to 3[* * *] 4[the Pakistan Air Force Act, 1953\n(VI of 1953),] and the rules and regulations made thereunder, in such manner and to such extent as\nmay be prescribed."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Extent of liability for service. A reservist shall be liable to serve without the limits of",
      "content": "Pakistan as well as within those limits."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to make rules",
      "content": "_(1) The 2[Federal Government] may make rules to carry out the\npurposes of this Act.\n1\nOmitted by The Central Laws (Adaptation) Order, 1961 ((P. O. No. 1 of 1961), Art. 2 and Sch.\n2\nSubs. by The Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. 2 and Table.\n3\nOmitted by the Federal Laws (Revisions and Declaration) Ordinance, 1981 (Order No. XXVII of 1981), s. 3, and 2nd Schedule.\n4\nIns. by the Central Law (Statute Reform) Ordinance, 1961 (XXI of 1960), s. 3 and 2nd Sch.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules\n___\nmay\n(a)        provide for the constitution of, and the appointment or transfer of any person as\na reservist to, the reserves;\n(b)        prescribe the service obligations to which reservists shall be liable;\n(c)        prescribe periodical training for any category of reservists;\n(d)        provide for and regulate the pay and allowances of reservists;\n(e)        prescribe the authorities by whom and the conditions subject to which the\nservices of reservists may be terminated;\n(f)        provide for and regulate the gratuities or compensation, if any, to be paid to\nreservists or any category of reservists, or to any dependents of reservists; and\n(g)        provide for any other matter which under this Act is to be or may be prescribed.\n(3) All rules made under this Act shall be published in the Official Gazette and on such\npublication shall have effect as if enacted in this Act."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power to make regulations. In the case of Army reservists, the 1[Chief of the Army Staff],",
      "content": "and in the case of Air Force reservists, the 1[Chief of the Air Staff] may make regulations not\ninconsistent with this Act and rules made thereunder, providing generally for all details connected with\nthe training, clothing, equipment and leave of reservists.\n8. 2[* *            *          *          *          *          *]\n9. 3[* *            *          *          *          *          *]\nA.___ The Pakistan Army___\n(i)        the Pakistan Army Regular Reserve of Officers,\n(ii)       The Pakistan Army Regular Reserve of Junior Commissioned Officers,\n(iii)      The Pakistan Army Supplementary Reserve of Officers,\n(iv)       The Pakistan Army Supplementary Reserve of Junior Commissioned Officers\nand Other Ranks,\n(v)        The Regular Reserves of Other Ranks.\n1\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch.\n2\nOmitted by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s.3 and 2nd Sch.\n3\nRep. by the Repealing and Amending Ordinance, 1965 (X of 1965), s. 2 and 1st Sch.\nB.___ The 1[*] Pakistan Air Force___\n(i)        The Pakistan Air Force Regular Reserve,\n(ii)       The Pakistan Air Force volunteer Reserve.\n___________\n4788                                                                                               Date: 29-01-2025\n1\nOmitted by The Central Adaptation Order of Laws, 1961 (P. O. No. 1 of 1961), Art. 2 and Sch."
    }
  ],
  "definitions": []
}
