{
  "id": "pk-pakistan-academy-of-letters-act-2013",
  "type": "statute",
  "title": "Pakistan Academy of Letters' Act, 2013",
  "title_en": "Pakistan Academy of Letters' Act, 2013",
  "short_name": "PAOLA",
  "status": "in_force",
  "issued_date": "2013-02-21",
  "in_force_date": "2013-02-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pq-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Academy of Letters' Act, 2013 (IV of 2013) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Bill may be called the Pakistan\nAcademy of Letters’ Act, 2013.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(a)        “Academy” means the Pakistan Academy of Letters;\n(b)        “Board” means the Board of Governors of the Academy;\n(c)        “Chairman of the Board” means Chairman of the Board;\n(d)          “Chairman of the Academy” means the Chairman of the Academy who shall\nbe its chief executive;\n(e)        “Director-General” means the Director-General of the Academy;\n(f)          “employees” means an employee in the whole time employment of the\nAcademy;\n(g)        “Member” means a member of the Board;\n(h)        “prescribed” means prescribed by rules;\n(i)        “rules” means the rules made under this Act; 1[*]\n(j)        “regulations” means the regulations made under this Act 1[; and]\n1\n[(k)   “secretary” means secretary of the division concerned.]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Academy",
      "content": "(1) The Pakistan Academy of Letters as reconstituted in\naccordance with the provisions of this Act shall be a body corporate having perpetual succession and\ncommon seal and power to acquire, hold and dispose of property.\n(2) The Academy shall be an autonomous body.\n(3) The main office of the Academy shall be at Islamabad and the Academy may set-up its\nregional offices at such place or places as it may deem appropriate.\n1\nOmitted, subs. and added by Act, XXXIX of 2021, s. 2."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Board of Governors",
      "content": "(1) The 1[division concerned] shall, by notification in the official\nGazette, constitute a Board of Governors of the Academy consisting the following, namely:—\n(a)           Chairman, Pakistan Academy of Letters, Islamabad.               Chairman\n1\n[(b)      joint secretary of the division concerned]                      Ex-officio Member\n(c)           One representative, not below the rank of Joint Secretary,      Ex-officio Member\nof Ministry of Finance.\n(d)           representative of Higher Education Commission (HEC)              Member\n(Not below the rank of a BS-20 officer).\n(e)           one representative of each of the provinces                Ex-officio Members\n(to be nominated by the Provincial Government concerned).\n(f)           two representatives of the areas not forming part of any         Ex-officio Members\nProvince (to be nominated by name by the Minister\nconcerned) one from Islamabad Capital Territory and one\nfrom 1[Azad Jammu and Kashmir and Gilgit-Baltistan]\nby rotation)\n(g)           a man of letters of English language to be nominated by the      Member\nMinister Concerned.\n(h)           a man of letters of Urdu language to be nominated by the         Member\nMinister concerned.\n(i)           one man of letters of each of at least six regional languages    Member\nto be nominated by the Minister concerned.\n(j)           Director-General, Pakistan Academy of Letters.                    Member\n(2)           The Director-General shall also act as Secretary of the Board.\n(3) The term of Members of Board of Governors except ex-officio Members, shall be three\nyears and the Members shall be eligible for reappointment for such term, or terms as the Government\nmay determine but shall cease to hold office on attaining the age of sixty-five years or the expiry of\nthe term, whichever is earlier.\n1\nSubs. by the Act, XXXIX of 2021, s. 3."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Functions and powers of the Board",
      "content": "(l) The Board shall be responsible for setting of\nobjectives and policy guidelines of the Academy with the powers and functions provided in section"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. (2) The general direction and administration of the Academy and its affairs shall vest in the",
      "content": "Board which shall exercise all powers, perform all functions and do all acts and things which may be\nexercised, performed or done by the Academy under this Act.\n(3) In particular and without prejudice to the generality of the foregoing powers, the Board\nshall,—\n(a)     promote a modern system for the promotion of Pakistani languages, literature\nand welfare of the writers’ community in the country;\n(b)     approve policies, plans and programmes of the Academy; and\n(c)     formulate procedures and necessary framework for utilization of funds\ngenerated or acquired through services, donations or grants, etc."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Delegation of powers",
      "content": "_ The Board may, by general or special orders in writing subject to\nsuch limitations, restrictions or conditions, delegate all or any of its powers and functions to the\nChairman of the Academy or Director-General of the Academy."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Meeting of the Board",
      "content": "(1) Save as hereinafter provided, the Board shall regulate the\nprocedure for its meetings.\n(2) The meetings of the Board shall be convened by and under the directions of the Chairman\nof the Board:\nProvided that the 1[Division concerned] may direct convening of a meeting of the Board at\nany time on any matter requiring a decision by the Board.\n(3) The meeting of the Board shall be held at least twice a year.\n(4) A simple majority of the total membership shall constitute the quorum for a meeting of\nthe Board.\n(5) The decision of the Board shall be made by simple majority of the members present and\nvoting"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Chairman of the Academy",
      "content": "(1) The Chairman of the Academy shall be an eminent\nprofessional of known integrity, reputation, competence and expertise in the field of Pakistani\nlanguages and literature.\n(2) The Chairman of the Academy shall be appointed by the 2[Prime Minister or a person\nauthorized by him] on such terms and conditions as it may be deem appropriate and shall hold the\noffice for a period of three years.\n(3) The Chairman of the Academy shall be the chief executive of the Academy. He shall\ndirectly oversee the Director-General in the performance of his duties and responsibilities under this\nAct, shall guide and direct him, as deemed necessary and shall liaise and consult with the\nGovernment, on behalf of the Board, for carrying out the purposes of this Act.\n(4) The Chairman of the Academy may resign his office by writing under his hand addressed\n1\nto the [Prime Minister or a person authorized by him]."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Privileges and perquisites of the Chairman of the Academy",
      "content": "__ The Chairman of the\nAcademy shall be entitled to such privileges and perquisites as may be prescribed by rules.\n1\nSubs. by the Act, XXXIX of 2021, s. 4.\n2\nSubs. by the Act, XXXIX of 2021, s. 5."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Director",
      "content": "General of the Academy.___ (1) There shall be a Director-General who shall be\nappointed by the 1[Prime Minister or a person authorized by him] on such terms and conditions as\nmay be prescribed.\n(2) The Director-General shall comply with such directions that the 1[division concerned] or\nthe Board may give from time to time.\n(3) The Director-General shall be entitled to such remuneration and privileges as may be\nprescribed."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Committees of the Academy",
      "content": "The Academy may, for carrying out its functions,\nconstitute such committees as may be considered appropriate.\n(2) The membership of a committee and conduct of business thereof shall be such as may be\nprescribed by regulations."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Appointment of employees, experts, etc., by the Academy",
      "content": "(1) The Academy may,\nwith the prior approval of the 1[division concerned], create posts and may appoint such employees,\nexperts and consultants, as may be required for the function of the Academy on such terms and\nconditions as may be prescribed under regulations.\n(2) The Academy, with the approval of the Board, shall devise procedures for the\nappointment of its employees, experts and consultants.\n(3) The Academy, with the approval of the Board, shall determine the terms and conditions of\nservice of its employees, experts and consultants and shall also be competent to take disciplinary\naction against them."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Employees, experts, etc., to be public servants",
      "content": "(1) The Chairman of the Academy,\nDirector-General, employees, experts, consultants of the Academy shall, when acting on purporting\nto Act in pursuance of any of the provisions of this Act, be deemed to be public servants within the\nmeaning of section 21 of the Pakistan Penal Code, 1860 (Act XLV of 1860).\n(2) The regular employees of the Academy working immediately before commencement of\nthis Act shall be offered an option whether they or any one desire to continue to serve as civil\nservants or to opt to become employee of the Academy. The employees shall convey their option\nwithin six months of commencement of this Act. Option once exercised shall final and irrevocable."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Pakistan Academy of Letters Fund",
      "content": "(1) There shall be created a fund to be known as\nPakistan Academy of Letters Fund which shall vest in the Academy and shall be utilized by the\nAcademy to meet charges in connection with its functions under this Act including the payment of\nsalaries and other remuneration to the Chairman of the Academy, Director General, employees,\nexperts and consultants of the Academy.\n(2) The Pakistan Academy of Letters Fund shall be financed from the following sources,\nnamely:—\n(a)       grants and loans made by the Federal Government or a Provincial\nGovernment;\n(b)       loans, aid and donations from the national or international agencies; and\n(c)       revenue earned from the levy of various charges or fees, etc.\n(3) The Pakistan Academy of Letters Fund shall be kept in one or more accounts maintained\nby the Academy, in local or foreign currency, in any branch of the National Bank of Pakistan and\nshall be operated in accordance with the directions of the Board."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Budget",
      "content": "(1) The Academy shall, in respect of each financial year submit for approval of\nthe Federal Government, on such date as may be prescribed, a statement of the estimated receipts and\nexpenditure, including requirements of foreign exchange for the next financial year for provision of\nannual funds for approval by the Federal Government. Head-wise budget will be approved by the\nBoard.\n1\nSubs. by the Act, XXXIX of 2021, s. 8.\n(2) The 1[secretary of the division concerned] shall be the Principal Accounting Officer of the\nAcademy.\n(3) The Director-General shall be the Chief Accounting Officer of the Academy."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Audit and accounts",
      "content": "(1) The accounts of the Academy shall be maintained in the\nmanner prescribed by the Controller General of Accounts.\n(2). The Auditor-General of Pakistan shall conduct audit of the accounts of the Academy.\n(3) A copy of the audit report shall be submitted to the Board along with the comments of the\nAcademy.\n(4) The Board may issue directions to the Academy for the rectification of any item objected\nto by the Auditor-General of Pakistan and the Academy shall comply with such directions."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Submission of yearly reports and returns",
      "content": "Within three months of the conclusion of\neach financial year, the Academy shall submit an annual report to the 2[division concerned] in\nrespect of the activities of the Academy including the status of its existing programmes, projects and\nfurther plans formulated in furtherance of its aims and objectives."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Power to make rules",
      "content": "_ The 3[division concerned in consultation with the establishment\nand finance divisions and all other concerned ministries and divisions] may, by notification in the\nofficial Gazette, make rules for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Power to make regulations",
      "content": "The Academy may, by notification in the official Gazette,\nmake regulations, not inconsistent with provisions of this Act or the rules, for exercising its powers\nand carrying out its functions under this Act."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Indemnity",
      "content": "_ No suit, prosecution or other legal proceedings shall lie against the Federal\nGovernment or the Academy or any person acting under the Federal Government or the Academy for\nanything which is in good faith done or intended to be done in pursuance of this Act or any rules or\nregulation made there under."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Authorities to aid the Academy",
      "content": "All languages or literary or welfare authorities in the\nFederation and the Provinces shall render such assistance to the Academy, as may be necessary, for\nthe promotion of Pakistani languages, literature and welfare of writers community in the country."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to any of the provisions\nof this Act, the Federal Government may, for the purpose of removing such difficulty, make such\norder, not inconsistent with the provisions of this Act, as it may consider expedient and any such\norder shall be deemed to be, and given effect to, as a part of the provisions of this Act."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Repeal and savings",
      "content": "(1) The Ministry of Education’s Resolution No. 8-18/75/Cb, dated\nthe 7th July, 1976, hereinafter referred to as the repealed Resolution, is hereby repealed.\n1\nSubs. by the Act, XXXIX of 2021, s. 9\n2\nSubs. by the Act, XXXIX of 2021, s. 10\n3\nSubs. by the Act, XXXIX of 2021, s. 11\n(2) Upon the commencement of this Act,____\n(a)    all funds, properties, rights and interests of whatsoever kind issued, used,\nenjoyed, possessed, owned or vested in the Pakistan Academy of Letters in\nexistence immediately before such commencement and all liabilities legally\nsubsisting against the said Academy shall pass to the Academy as established\nunder this Act;\n(b)    everything done, action taken, obligations or liabilities incurred, rights and\nassets acquired persons appointed or authorized jurisdiction or powers\nconferred, endowments, bequests, funds or trusts created, donations or grants\nmade, orders issued under any of the provisions of the Acts, rules or\nregulations, applicable to the said Academy, shall remain in force and be\ncontinued and, having regard to the various matters which by this Act have to\nbe regulated or prescribed by rules or regulations, be deemed to have been\nrespectively done, taken, incurred, acquired, appointed, authorized, conferred,\ncreated, made, or issued under this Act and reference in any document to any\nof the provision of the said Acts or the rules or regulations made thereunder\nshall, so far as may be, be deemed to be reference to the corresponding\nprovisions of this Act or the rules or regulations made or deemed to have been\nmade thereunder; and\n(c)    any rules or regulations made under the repealed resolution shall, in so far as\nthey are not inconsistent with the provisions of this Act or the rules and\nregulations made under this Act having regard to the various matters which by\nthis Act have to be regulated or prescribed by rules or regulations respectively\nshall continue to be in force, until they are repealed, replaced, rescinded or\nmodified in accordance with the provisions of this Act.\n(d)    Notwithstanding anything contained in any law, contract or agreement or in\nthe terms and conditions of service, every person, other than employees of\nother Departments and members of regularly constituted Service Groups\nposted on deputation or employed in the Academy and serving in or under it\nimmediately before the commencement of this Act shall cease to be civil\nservants and stand transferred to and become employees of the Academy on\nsuch terms and conditions as may be prescribed:\nProvided the terms or conditions of the persons so transferred shall not\nbe less favourable than those applicable to them before the commencement of\nthis Act.\n(e)    Notwithstanding anything contained in any other law for the time being in\nforce, no person who has been transferred to the Academy shall be entitled to\nany compensation on account of such transfer.\n_________________"
    }
  ],
  "definitions": [
    {
      "term": "Academy",
      "definition": "the Pakistan Academy of Letters;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of Governors of the Academy;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman of the Board",
      "definition": "Chairman of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman of the Academy",
      "definition": "the Chairman of the Academy who shall be its chief executive;",
      "source_provision": "sec2"
    },
    {
      "term": "Director-General",
      "definition": "the Director-General of the Academy;",
      "source_provision": "sec2"
    },
    {
      "term": "employees",
      "definition": "an employee in the whole time employment of the Academy;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "a member of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "the rules made under this Act; 1[*]",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "the regulations made under this Act 1[; and] 1 [(k) “secretary” means secretary of the division concerned.]",
      "source_provision": "sec2"
    }
  ]
}
