{
  "id": "pk-pakistan-agricultural-research-council-ordinance-1981",
  "type": "statute",
  "title": "Pakistan Agricultural Research Council Ordinance, 1981",
  "title_en": "Pakistan Agricultural Research Council Ordinance, 1981",
  "short_name": "PARCO",
  "status": "in_force",
  "issued_date": "1981-12-28",
  "in_force_date": "1981-12-28",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bZ6a-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Agricultural Research Council Ordinance, 1981 (XXXVIII of 1981) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Removal of difficulties",
      "content": "ORDINANCE, 1981\nORDINANCE No. XXXVIII OF 1981\n[29th December, 1981]\nAn Ordinance to provide for constituting and re-organizing the Pakistan Agricultural\nResearch Council.\nWHEREAS it is expedient to provide for constituting and re-organising the Pakistan\nAgricultural Research Council and for matters connected therewith or ancillary thereto ;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action ;\nNOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, read\nwith the Provisional Constitution Order, 1981 (C.M.L.A. Order No. 1 of 1981), and in exercise of all\npowers enabling him in that behalf the President is pleased to make and promulgate the following\nOrdinance :—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.",
      "content": "_ (1) This Ordinance may be called the Pakistan\nAgricultural Research Council Ordinance, 1981.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or",
      "content": "context___\n(a)     “agriculture” means crops, livestock including poultry, fisheries, forestry,\nrange management, soil science, socio-economic institutional and engineering\naspects connected therewith and such other activities and subjects as the\nFederal Government may, by notification in the official Gazette, declare to be\nagriculture within the meaning of this clause ;\n(b)     “Board” means the Board of Governors of the Council ;\n(c)     “Chairman” means the Chairman of the Council ;\n(d)     “Council” means the Pakistan Agricultural Research Council established\nunder section 3 ;\n(e)     “Executive Committee” means the Executive Committee of the Board.\n(f)     “Prescribed” means prescribed by rules or regulations;\n(g)     “President” means the President of the Board ;\n(h)     “research establishment” includes agricultural experiment stations, field\nstations, institutes, centres, sub-centres, laboratories and other units of the\nCouncil howsoever designated ;\n(i)     “regulations” means regulations made under this Ordinance ; and\n(j)     “rules” means rules made under this Ordinance.\n_______"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Council.",
      "content": "_ (1) There shall be established a Council to be called the\nPakistan Agricultural Research Council.\n(2) The Council shall be a body corporate having perpetual succession and a common seal\nwith powers, subject to the provision of this Ordinance, to acquire, hold and dispose of property,\nboth movable and immovable, and shall by the said name sue and be sued.\n(3) Unless the Federal Government, by notification in the official Gazette, otherwise directs,\nthe headquarters of the Council shall be at Islamabad.\n(4) The Council may from time to time establish regional offices, local offices, sub-offices\nand research establishments at such places as it may deem fit.\n______"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Functions and powers of the Council. The functions of the Council shall be",
      "content": "_\n(a)     to undertake, aid, promote and coordinate agricultural research ;\n(b)     to arrange the expeditious utilization of the research results ;\n(c)     to establish research establishments mainly to fill in the gaps in existing\nprogramme of agricultural research ;\n(d)     to arrange the training of high-level scientific manpower in agricultural\nsciences ;\n(e)     to generate, acquire and disseminate information relating to agricultural ;\n(f)     to establish and maintain a reference and research library ; and\n(g)     to perform any other functions related to the matters aforesaid."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Directions from the Government. In discharging its functions, the Council shall be bound",
      "content": "by such directives and orders, if any, as may be given to it on any questions of policy by the Federal\nGovernment which shall be the sole judge as to whether a question is a question of policy.\n_______"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Board of Governors",
      "content": "_(1) The overall control, direction and superintendence of the\naffairs of the Council shall vest in a Board of Governors consisting of the following members,\nnamely: ___\n(i)     the President ;\n(ii)    the Chairman ;\n(iii)   not more than five whole-time members ; and\n(iv)    such other members as the Federal Government may appoint on the\nrecommendations of the Chairman from time to time.\n(2) The appointment of the Chairman and other members shall be made by notification in the\nofficial Gazette."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Executive Committee",
      "content": "_(1) There shall be an Executive Committee consisting of the\nChairman and the whole-time members of the Board.\n(2) Subject to the provisions of this Ordinance and the rules and regulations and the general\nor special directions of the Board, the Executive Committee shall be the principal administrative\nbody of the Council responsible for executing all policies and discharging all functions of the\nCouncil under this Ordinance.\n(3) Notwithstanding anything contained in sub-section (2), the Executive Committee shall—\n(i)     undertake regular review of the evaluation of the accomplishments and\nprogress of the research projects and the programmes of the research\norganizations ; and\n(ii)    exercise control over the research activities of the Council."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Chairman.",
      "content": "_(1) The Chairman shall be the chief executive of the Council.\n(2) The President of Pakistan shall appoint an eminent scientist connected with agriculture to\nbe the Chairman on such terms and conditions as he may determine.\n(3) The Chairman shall hold office during the pleasure of the President of Pakistan.\n(4) The Chairman shall have such powers and perform such functions as are assigned to him\nby or under this Ordinance.\n(5) The Chairman may, from time to time, for the purpose of ensuring efficient functioning of\nthe Council and facilitating its day to day functions, delegate to members, officers and employees of\nthe Council such of his functions, powers or duties as may be considered necessary by him."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Whole",
      "content": "time members. The whole-time members shall be appointed by the President of\nPakistan for a period of three years and shall perform such functions and exercise such powers as are\nassigned to them by or under this Ordinance and shall be eligible for re-appointment."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Term of office of non",
      "content": "official members. ___ (1) The members of the Board who are not\nofficials of the Federal Government, hereinafter referred to as non-official members, shall, unless\notherwise directed by the Federal Government, hold office for a term of three year and shall be\neligible for re-appointment.\n(2) A non-official member may, by writing under his hand addressed to the Federal\nGovernment, resign his office.\n(3) A casual vacancy in the office of a non-official member shall be filled by the appointment\nof another member for the residue of the term of his predecessor."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Meetings.",
      "content": "_ (1) The meetings of the Board shall be held at least twice a year and shall be\npresided over by the President or, in his absence, by a member nominated by him for the purpose.\n(2) Subject to the provisions of sub-section (1), the meetings of the Board and of the\nExecutive Committee or of other committees shall be held at such times and at such places and in\nsuch manner as may be prescribed by regulations:\nProvided that, until regulations are made in this behalf, such meetings shall be convened by\nthe Chairman.\n(3) Unless otherwise prescribed, one-third of the total members in the case of the Board and\none-half of the total members in the case of the Executive Committee shall form a quorum at any\nmeeting of the Board or the Executive Committee, as the case may be:\nProvided that no quorum shall be necessary for an adjourned meeting."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Delegation of Powers by the Board. The Board may from time to time delegate to the",
      "content": "Executive Committee such of its functions and powers as it may consider necessary:\nProvided that the Executive committee may, in an emergency which in its opinion requires\nimmediate action, take such action as it considers necessary and shall report it for approval to the\nBoard in the next meeting."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Validity of Proceedings. No act, proceeding, decision or order of the Council, Board or",
      "content": "Executive Committee shall be invalid by reason only of the existence of a vacancy in, or any defect\nin the constitution of the Council, Board or Executive Committee."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Appointment of officers, etc.",
      "content": "_ (1) The Council may appoint such officers and staff as\nit may consider necessary for the efficient performance of its functions on such terms and conditions\nas may be prescribed.\n(2) The Council may engage on contract experts and consultants for a period not exceeding\ntwo years at a time on such terms and conditions as it may determine and subject to such directions\nas the Board may from time to time give in this behalf.\n(3) Notwithstanding anything contained in any contract or agreement or in the conditions of\nservice, every person serving in or under the Agricultural Research Council constituted under the\nAgricultural Produce Cess Act, 1940 (XXVII of 1940) immediately before the commencement of\nthis Ordinance, including persons on deputation to other organizations or abroad, shall stand\ntransferred to the Council and become an employee, of the Council on the same terms and\nconditions, including remuneration, tenure of service, rights and privileges as to pension and gratuity\nand other matters, as were applicable to him immediately before the commencement of this\nOrdinance, until his employment in the Council is terminated in accordance with his conditions of\nservice or his terms and conditions are altered by regulations, which shall not be less favourable than\nthose by which he was governed immediately before his transfer to the Council."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Transfer of existing civil servants to the Council",
      "content": "_(1) Notwithstanding anything,\ncontained in any law, contract or agreement or in the conditions of service, every civil servant\nemployed in the Attached Department portion of the Directorate-General of the Pakistan Agricultural\nResearch Council and serving in or under the Council immediately before the commencement of this\nOrdinance, including persons on deputation to other organizations or abroad, shall, save as\nhereinafter provide, cease to be a civil servant and stand transferred to, and become an employee of,\nthe Council on the same terms and conditions, including remuneration, tenure of service, rights and\nprivileges as to pension and gratuity and other matters, as were applicable to him immediately before\naccordance with his conditions of service or his terms and-conditions are altered by regulations,\nwhich shall not be less favourable than those by which he was governed immediately before his\ntransfer to the Council.\n(2) Any person referred to in sub-section (1) who is on deputation with the Attached\nDepartment portion of the Directorate-General of the Pakistan Agricultural Research Council shall\ncontinue in the employment of the Council on deputation in accordance with the terms of his\ndeputation.\n(3) Any person referred to in sub-section (1) may, within three months from the\ncommencement of this Ordinance, opt not to be transferred to the service of the Council and the\noption so exercised shall be final.\n(4) An employee who opts under sub-section (3) not to be transferred to the service of the\nCouncil may, as far as possible, be provided a suitable posting elsewhere by the Federal Govern-\nment.\n(5) If an employee does not accept the appointment offered to him under sub-section (4),\nwithin the time allowed to him, or if it is not possible for the Federal Government to provide a\nsuitable posting to him under that sub-section, his service shall stand terminated on the date on which\nhe declines the offer or the time allowed to him expires or, as the case may be, on which the Federal\nGovernment informs him that it is not possible to provide a suitable posting to him, and he shall be\nentitled to be paid by the Federal Government compensation equivalent to three months’\nremuneration.\nExplanation. ___ The compensation payable to an employee under this sub-section shall be in\naddition to and not in derogation of his rights as to pension, gratuity, provident fund money or other\nbenefits to which he may be entitled under his conditions of service.\n(6) The termination of service of an employee under sub-section (5) shall be deemed to be\ndischarge from service owing to abolition of a permanent post for the purpose of admissibility of\ncompensation pension.\n(7) The Federal Government shall pay pension charges and gratuity in respect of, and\nprovident fund accumulations of, each employee transferred to the Council under sub-section (1), in\nsuch manner and to such extent as may be prescribed by rules.\n(8) No person referred to in sub-section (1) who stands transferred to the Council shall,\nnotwithstanding anything contained in any law for the time being in force, be entitled to any\ncompensation because of his transfer.\n______"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Grants, etc.",
      "content": "_ The Federal Government may, from time to time, place annual grants at\nthe disposal of the Council for the smooth discharge of its functions and the efficient conduct of its\naffairs."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Funds.",
      "content": "_ (1) There shall be constituted for the Council a fund to which shall be credited\nall the sums received by the Council and out of which shall be defrayed all the expenditure incurred\nby the Council.\n(2) The funds of the Council shall consist of____\n(a)     grants made by the Federal Government and the Provincial Governments ;\n(b)     grants, donations, endowments, contributions, aid and assistance given by\nother organisations ;\n(c)     foreign aid and loans obtained or raised with the approval of the Federal\nGovernment ; and\n(d)     receipts from other sources."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Budget and accounts",
      "content": "_(1) The Council shall, in respect of each financial year, submit\nfor the approval of the Federal Government, by such date and in such form as may be prescribed by\nrules, a statement showing the estimated receipts and expenditure and the sums which are likely to be\nrequired from the Federal Government during the financial year.\n(2) The Council may open accounts in any scheduled bank in Pakistan.\n(3) The accounts of the Council shall be maintained in such form and manner as the Federal\nGovernment may determine in consultation with the Auditor-General of Pakistan.\n(4) The accounts of the Council shall be audit by one or more auditors who are chartered\naccountants within the meaning of the Chartered Accountants Ordinance, 1961 (X of 1961) and are\nappointed by the Federal Government in consultation with the Auditor-General of Pakistan on such\nremuneration, to be paid by the Council, as the Federal Government may fix."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Exemption from taxes. Notwithstanding anything contained in the Business Profits Tax",
      "content": "Act, 1947 (XXI of 1947), the Gift-tax Act, 1963 (XIV of 1963) the Wealth-tax Act, 1963 (XV of\n1963), the Income Tax Ordinance, 1979 (XXXI of 1979) or any other law for the time being in force\nrelating to income-tax, super-tax, wealth-tax, gift-tax, capital gains tax or business profits tax, the\nCouncil shall not be liable to pay any such tax on its income, capital, profits, wealth, gifts or gains."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Investment of funds. Subject to such instructions as the Federal Government may, from",
      "content": "time to time, issue, the Council may invest its funds, in any security of the Federal Government or a\nProvincial Government or in any of the securities enumerated in section 20 of the Trusts Act, 1882."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Borrowing Power. The Council may, with the previous sanction of the Federal",
      "content": "Government, and on such terms and conditions as may be approved by the Federal Government,\nborrow in Pakistan currency or foreign currency."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Financial Assistance to Council. The Council may, with the approval of the Federal",
      "content": "Government, accept financial or any other assistance and grants of any kind in furtherance of its\nobjects and in order to discharge its functions."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Annual report. The Council shall furnish to the Federal Government, as soon as possible",
      "content": "after the end of each financial year, but not later than the last day of December next following, a\nreport on the conduct of its affairs for that year, and shall publish the same alongwith a Summary of\nthe accounts for that year.\n_______"
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Power to make rules",
      "content": "_(1) The Federal Government may, by notification in the official\nGazette, make rules for carrying out the purposes of this Ordinance.\n(2) In particular and without prejudice to the generality of the foregoing provision, such rules\nmay provide for___\n(i)     the functions and powers of the Chairman ;\n(ii)    the appointment and terms and conditions of service of the whole-time\nmembers of the Council, including disciplinary matters ; and\n(iii)    the conditions under which the Council may enter into arrangements with\nother institutions and individual organisations, whether public, private or\nautonomous bodies."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Power to make regulations.",
      "content": "_ (1) The Council may, with the previous sanction of the\nFederal Government, by notification in the official Gazette, make regulations not inconsistent with\nthis Ordinance and the rules providing for all matters for which provision is necessary or expedient\nfor the purpose of giving effect to the provisions of this Ordinance and the efficient conduct of the\naffairs of the Council.\n(2) In particular and without prejudice to the generality of the foregoing provision, the\nregulations may provide for—\n(i)      the appointment of the officers and employees of the Council ;\n(ii)     the terms and conditions of service of the officers and employees of the\nCouncil including pension and disciplinary matters ;\n(iii)    the conduct of business at the meetings of the Board and the Executive\nCommittee ;\n(iv)     the duties, functions and conduct of the officers and employees of the Council\n;\n(v)      preparation of annual estimates of income and expenditure and supplementary\nestimates ;\n(vi)     the forms of returns and statements for various purposes ;\n(vii)    the constitution of benevolent fund, group insurance, gratuity, provident fund\nand welfare fund for the Council employees ;\n(viii)   the manner in which payments are to be made by or on behalf of the Council\nand the officers by whom orders for making deposits or investments or for\nwithdrawals or any other disposal of the income or funds of the Council shall\nbe authenticated, made or signed ; and\n(ix)     the custody and use of common seal of the Council."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Officers, staff, etc. deemed to be public servants. Every official member of the Council",
      "content": "or Board and every officer and employee of the Council shall be deemed to be a public servant\nwithin the meaning of section 21 of the Pakistan Penal Code (Act XLVof 1860)."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Ordinance XXIII of 1969 not to apply to Council. Nothing contained in the Industrial",
      "content": "Relations Ordinance, 1969 (XXIII of 1969), shall apply to or in relation to the Council or its\nestablishments or any of the officers or employees of the Council."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Indemnity of Council, etc.",
      "content": "_(1) No suit, prosecution or other legal proceedings shall lie\nagainst the Council or any member or any other officer or staff of the Council for anything in good\nfaith done or intended or purported to be done under this Ordinance or rule, regulation or order made\nthereunder.\n(2) The Council shall not be responsible for any misfeasance, malfeasance or non-feasance of\nany officer or employee, for the time being of the Council."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Notice of suit Against Council, etc.",
      "content": "_ (1) 1[A suit may] be instituted against the Council\nor any member or any person associated with the Council or against any officer or employee of the\nCouncil or against any person acting under the direction or authority of the Council, the Chairman or\nof any officer or employee of the Council in respect of any act purporting to be done under this\nOrdinance or the rules or regulations 2[after] the expiration of 3[two months] from the delivery of a\nwritten notice at the head office of the Council or the place of abode of such member, officer,\nemployee or person stating the cause of action, the name and address of the intending plaintiff and\nthe nature of the relief sought.\n(2) In every such suit the plaint shall contain a statement that such notice has been so\ndelivered.\n4\n[(2A) Where any such suit is instituted without delivering or leaving such notice as aforesaid\nor before the expiration of the said period of two months, or where the plaint does not contain a\nstatement that such notice has been so delivered, or left, the plaintiff shall not be entitled to any costs\nif settlement as regards the subject-matter of the suit is reached or the Council or the member,\nofficer, employee or person concedes the plaintiff's claim, within the period of two months from the\ndate of the institution of the suit:\nProvided that, in a suit instituted without such notice, the Court shall allow not less than three\nmonths to the Council to submit its written statement.]\n(3) Notwithstanding anything contained; in the Limitation Act, 1908 (IX of 1908), no such\nsuit as is described in sub-section (1) shall, unless it is a suit for the recovery of immovable property\nor for a declaration of title thereto, commence otherwise than within six months next after the accrual\nof the cause of action."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Certain claims for compensation to be barred. No person shall have any right, whether",
      "content": "in contract, tort or otherwise, to any compensation for any loss incurred by reason of the operation of\nany of the provisions of this Ordinance or by reason of the compliance by any other organisation\nwith any policy guidelines or directions given to it under this Ordinance or under any rules or\nregulations."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Winding",
      "content": "up. No provision of law relating to the winding up of bodies corporate shall\napply to the Council and the Council shall not be wound up except by the orders of the Federal\nGovernment in such manner as the Federal Government may direct.\n1\nSubs. by the Pakistan Agricultural Research Council (Amdt.) Ordinance, 1985 (10 of 1985), s.2, for “No. suit shall”.\n2\nSubs. ibid., for “Until”.\n3\nSubs. ibid., for “one month”.\n4\nIns. ibid.,"
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Savings. Upon the commencement of this Ordinance,",
      "content": "_\n(a)    all funds, properties, rights and interests of whatsoever kind issued, used,\nenjoyed, possessed, owned or vested in the Agricultural Research Council in\nexistence immediately before such commencement and all liabilities legally\nsubsisting against the said Council shall pass to the Council as established\nunder this Ordinance ;\n(b)    everything done, action taken, obligations or liabilities incurred, rights and\nassets acquired, persons appointed or authorised, jurisdiction or powers\nconferred, endowments, bequests, funds or trusts created, donations or grants\nmade, orders issued under any of the provisions of the Acts, rules or\nregulations, applicable to the said Council, shall remain in force and be\ncontinued and, having regard to the various matters which by this Ordinance\nhave to be regulated or prescribed by rules or regulations, be deemed to have\nbeen respectively done, taken, incurred, acquired, appointed, authorised,\nconferred, created, made, or issued under this Ordinance and reference in any\ndocument to any of the provisions of the said Acts or the rules or regulations\nmade thereunder shall, so far as may be, be deemed to be reference to the\ncorresponding provisions of this Ordinance or the rules or regulations made or\ndeemed to have been made thereunder ; and\n(c)    any rules or regulations made under the said Acts shall, in so far as they are\nnot inconsistent with the provisions of this Ordinance or the rules and regula-\ntions made under this Ordinance having regard to the various matters which by\nthis Ordinance have to be regulated or prescribed by rules or regulations\nrespectively shall continue to be in force, until they are repealed, replaced,\nrescinded or modified in accordance with the provisions of this Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "agriculture",
      "definition": "crops, livestock including poultry, fisheries, forestry, range management, soil science, socio-economic institutional and engineering aspects connected therewith and such other activities and subjects as the Federal Government may, by notification in the official Gazette, declare to be agriculture within the meaning of this clause ;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of Governors of the Council ;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Council ;",
      "source_provision": "sec2"
    },
    {
      "term": "Council",
      "definition": "the Pakistan Agricultural Research Council established under section 3 ;",
      "source_provision": "sec2"
    },
    {
      "term": "Executive Committee",
      "definition": "the Executive Committee of the Board.",
      "source_provision": "sec2"
    },
    {
      "term": "Prescribed",
      "definition": "prescribed by rules or regulations;",
      "source_provision": "sec2"
    },
    {
      "term": "President",
      "definition": "the President of the Board ;",
      "source_provision": "sec2"
    },
    {
      "term": "research establishment",
      "definition": "agricultural experiment stations, field stations, institutes, centres, sub-centres, laboratories and other units of the Council howsoever designated ;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Ordinance ; and",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Ordinance. _______",
      "source_provision": "sec2"
    }
  ]
}
