{
  "id": "pk-pakistan-air-safety-investigation-act-2023",
  "type": "statute",
  "title": "Pakistan Air Safety Investigation Act, 2023",
  "title_en": "Pakistan Air Safety Investigation Act, 2023",
  "short_name": "PASIA",
  "status": "in_force",
  "issued_date": "2023-08-06",
  "in_force_date": "2023-08-06",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pnaQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Air Safety Investigation Act, 2023 (L of 2023) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, application and commencement",
      "content": "(1) This Act shall be called the\nPakistan Air Safety Investigation Act, 2023.\n(2) It shall extend to the whole of Pakistan and also apply to—\n(a)     a citizen of Pakistan wherever he may be;\n(b)     an aircraft registered in Pakistan wherever it may be;\n(c)     an aircraft registered outside Pakistan but for the time being in or over Pakistan;\n(d)     a person on an aircraft mentioned at clauses (b) and (c); and\n(e)     an aircraft operated by a person who is not a citizen of Pakistan but has his\nprincipal place of business or residence in Pakistan.\n(3) Nothing in this Act shall apply to an aircraft or persons on board an aircraft that is used for\na military purpose unless the Federal Government, by an order, directs that all or any provisions of\nthis Act shall apply to such aircraft and persons generally or in a particular case.\n(4) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(a)     “accident” means an occurrence associated with the operation of an aircraft\nwhich in the case of a manned aircraft, takes place between the time any person\nboards the aircraft with the intention of flight until such time as all such\npersons have disembarked; and in the case of an unmanned aircraft, takes place\nbetween the time the aircraft is ready to move with the purpose of flight until\nsuch time as it comes to rest at the end of the flight and the primary\npropulsion system is shutdown, that leads to―\n(i)     fatal or serious injury to a person as a result of his being in the aircraft,\nor direct contact with any part of the aircraft, including parts which\nhave become detached from it, or direct exposure to jet blast, except\nwhen the injuries are from natural causes, self-inflicted or inflicted by\nother persons, or when the injuries are to stowaways hiding outside the\nareas normally available to the passengers and crew;\n(ii)    damage to the aircraft or structural failure which adversely affects the\nstructural strength, performance or flight characteristics of the aircraft,\nand would normally require major repair or replacement of the affected\ncomponent, except for failure of engine or damage, when the damage is\nlimited to a single engine, (including its cowlings or accessories), to\npropellers, wing tips, antennas, probes, vanes, tires, brakes, wheels,\nfairings, panels, landing gear doors, windscreens, the aircraft skin (such\nas small dents or puncture holes), or for minor damages to main rotor\nblades, tail rotor blades, landing gear, and those resulting from hail or\nbird strike (including holes in the radome); or\n(iii)   the aircraft going missing or is completely inaccessible;\n(b)   “accredited representative” means a person designated by a State, on the basis\nof his or her qualifications, for the purpose of participating in an investigation\nconducted by another State and where the State has established an accident\ninvekigation authority, the designated accredited representative, would\nnormally be from that authority;\n(c)   “Act” means the Pakistan Air Safety Investigations Act, 2023;\n(d)   “advisor” means a person appointed by a State, on the basis of his or her\nqualifications, for the purpose of assisting its accredited representative in an\ninvestigation;\n(e)   “aircraft” means a machine that can derive support in the atmosphere\nfrom the reactions of the air other than the reactions of the air against the surface\nof the earth;\n(f)   “Authority” means the Pakistan Civil Aviation Authority established\nunder the Pakistan Civil Aviation Ordinance, 1982 (Ordinance XXX of 1982);\n(g)   “Aviation undertaking” means an entity, person or organization that is\naffected or benefitted by the carrying out of any function or duty or exercise of\nany power by the Bureau;\n(h)   “Bureau” means the Bureau of Aircraft Accident investigation established under\nsection 3;\n(i)   “Convention” means the Convention of International Civil Aviation\ndone at Chicago on seventh day of December, 1944 and any other international\nconvention or treaty on air safety and aircraft accidents to which Pakistan is\na signatory;\n(j)    “Director” means the Director of the Bureau;\n(k)    “Federal Investigation Agency” means the Federal Investigation\nAgency established under the Federal Investigation Agency Act,\n1974 (Act VIII of 1974);\n(l)    “incident” means an occurrence, other than an accident, associated with the\noperation of an aircraft which affects or could affect the safety of operation;\n(m)    “information” includes a recording, material or document;\n(n)    “investigation” means an investigation under this Act for the purpose of\nprevention of aircraft accidents, serious incidents and incidents and includes\nmeasures to preserve, gather and analyse evidence and information, drawing\nof conclusion, including the determination of causes and contributing factors\nand, where appropriate, the making of safety recommendation;\n(o)    “investigator” means an employee of the Bureau or any other person\nhaving reasonable familiarity, experience and skills in air safety and accident\ninvestigations;\n(p)    “Minister” means the Minister for Aviation;\n(q)    “operator” means a person, organization or enterprise engaged in or offering to\nengage in operation of an aircraft;\n(r)    “rules” mean rules made under this Act;\n(s)    “Secretary” means the Secretary to the Federal Government, Aviation Division;\n(t)    “serious incident” means an incident involving circumstances indicating that\nthere was a high probability of an accident and associated with the operation of\nan aircraft which in the case of a manned aircraft, takes place between the time\nany person boards the aircraft with the intention of flight until such time as all\nsuch persons have disembarked, or in the case of an unmanned aircraft, takes\nplace between the time the aircraft is ready to move with the purpose of flight\nuntil such time as it comes to rest at the end of the flight and the primary\npropulsion system is shut down; and\n(u)    “State” means a State signatory to the Convention other than Pakistan."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Bureau of Aircraft Safety Investigations",
      "content": "(1) As soon as may be, but not later than six\nmonths of the coming into force of this Act, the Federal Government shall, by notification in the\nofficial Gazette, establish the Bureau of Aircraft Safety Investigations with its headquarters at such\nplace as may be mentioned in the notification.\n(2) The Bureau shall comprise of the Director, who shall be the head of the Bureau, and such\nnumber of investigators, officers, experts, servants and other persons, as the Federal Government\nmay, from time to time, deem fit.\n(3) The Director, investigators, officers, experts, servants and other persons in the\nemployment of the Bureau shall be appointed in the manner prescribed by the rules.\n(4) The Bureau shall, among other things, discharge the following functions, namely —\n(a)    preliminary inquiries and investigations under this Act;\n(b)    identification of safety deficiencies as evidenced by aircraft accidents, serious\nincidents and incidents;\n(c)    making recommendations to eliminate or reduce any such deficiency;\n(d)    to advise on and support implementation of any such recommendation;\n(e)    air safety studies to prepare and disseminate safety recommendation; to\nestablish and maintain an accurate record of accidents, serious incidents and\nincidents for reference;\n(g)    to affect any obligation of Pakistan in relation to air safety and accidents\ninvestigations under the Convention; and\n(h)    any other matter connected with or ancillary to the above."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. The Director, his duties, powers and functions",
      "content": "(1) The Director shall be appointed by\nthe Prime Minister in the manner prescribed by the rules for a usual term of three years from the date\nof assumption of office.\n(2) The Director may, be notice in writing, resign from his office and such resignation\nshall take effect from the date of its acceptance by the Prime Minister.\n(3) The Prime Minister may, after giving the Director a reasonable opportunity of being\nheard, remove him from office if he―\n(a)    has, in the opinion of the Prime Minister, failed to discharge, or has become\nincapable of discharging, his duties effectively under this act;\n(b)    has been convicted of an offence involving moral turpitude; or\n(c)    is knowingly involved in conflict of interest situation in terms of\nSection 11.\n(4) The Director shall receive such salary and allowances and be subject to such\nconditions of service as may be determined by the Prime Minister.\n(5) The Director shall—\n(a)    administer the Bureau for due discharge of its functions;\n(b)    ensure that investigations under this Act are independent, fair, effective and\nconcluded in the most expeditious manner;\n(c)    advise the Minister and Secretary on air safety and accidents and other matters\nrelated to or ancillary to this Act; and\n(d)    carry out such other functions and duties as are imposed upon him under this\nAct, the rules or the Standing Orders.\n(6) Subject to the provisions of this Act, the rules and the Standing Orders, the Director\nmay exercise such powers and take such measures are necessary for carrying out the purpose of\nthe Act.\n(7) In the absence or inability of the Director to perform his functions, the Secretary may\nappoint a senior officer of the Bureau to discharge the functions and exercise the powers of the\nDirector during his absence or inability."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Powers of the investigators",
      "content": "(1) For the purposes of an investigation under this Act, an\ninvestigator shall have the powers to—\n(a)    regulate, prohibit and control access to the scene of an accident, serious\nincident or incident;\n(b)    have access site of the accident, serious incident and incident and examine the\naircraft involved, its parts, contents and component, the wreckage, any remains\nand marks resulting from the accident, serious incident or incident, any parts,\ncomponents, wreckage or remains removed from the site;\n(c)    preserve the aircraft, its parts, contents, components, wreckage, remains and\nmarks mentioned at clause (b) by any means including photograthic means, and\nwhere in view of the investigator, it is necessary to do so, remove any of the\nparts, component, wreckage or remain for safe custody or further examination;\n(d)    require the attendance of any person, by summons under his hand, whom he\nthinks fit to call before him and examine for such purpose and to require answers\nor returns to any inquiries he thinks fit to make;\n(e)    require any such person to make and to sign a declaration regarding the true\nnature of the statements made by him;\n(f)    have access to all books, notes, records, photographs, papers and other\ndocuments, recordings and transcripts or other information, articles and other\nevidence which he considers necessary for the investigation, and where\nrequired ask for and enforce the production of the same by a person who\nis in or is reasonably expected to be in their possession; and\n(g)     where he considers it necessary, retain any such book, note, record, photograph,\npapers, document, recording, transcript, information, article or evidence until\nthe completion of investigation.\n(2) Where in the opinion of the Director such an action is necessary, he may authorize an\ninvestigator in writing to, after presenting the authorization to owner or occupier, enter, inspect and\nsearch any land or premises, building, dwelling or an aircraft and take in his possession any book, note,\nrecord, photograph, paper and other document, recording, transcript or other information and article in\nrelation to the investigation.\n(3) Where, an investigator considers it necessary that —\n(a)     medical examination of a person directly or indirectly involved in the operation\nof an aircraft is relevant to the investigation, he may, by a notice under his hand,\nrequire that person to submit to medical examination;\n(b)     performance of an autopsy on the body of a deceased person, or the carrying\nout of other medical examination of any human remain, is relevant to the\ninvestigation, he may cause such autopsy or medical examination to be\nperformed and, for that purpose, by notice under his hand, require the person\nhaving custody of the body of the deceased person or other human remains,\nto permit the performance of that autopsy or that medical examination; and\n(c)     a test, including a test to destroy, is required on the aircraft involved in\nan accident, serious incident or incident, or its components, contents or parts,\nwreckage or any book, note, record, photograph, papers and other document,\nrecording, transcript, information or other article received under sub-section (1)\nor seized under sub-section (2), he may cause that test to be conducted; and to\ninvestigation, such test shall be conducted in the presence of the owner or any\nperson who appears, on reasonable grounds, to be in lawful possession of it\nor otherwise entitled to such presence."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Notification of accident or incident",
      "content": "(1) Where an accident, serious incident or\nincident occurs, it shall be the duty of the following to send a notice of such occurrence to the Director\nwith minimum delay and through the most suitable and quickest Means available, but in no case later\nthan twenty-four hours—\n(a)     the pilot in-command of the aircraft and in case he is killed or incapacitated,\nthe senior most member of the aircraft crew, or the owner, operator, hirer or\nother person on whose behalf he was in- command of the aircraft;\n(b)     the relevant airport operator;\n(c)     the officer-in-command of the relevant air traffic control unit and the watch\nsupervisory officer of air traffic control; and\n(d)     any other person specified for this purpose under the rules.\n(2) The notice under sub-section (1) shall contain such information and be served to such\npersons other than the Director as may be specified in the rules.\n(3) Immediately upon receipt of the notice, the Director shall notify the facts of the accident,\nserious incident, or incident to the Secretary and such other States and entities as is required under the\nConvention."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Preliminary inquiry",
      "content": "(1) The Director may authorise any person including an officer of\nthe Bureau to conduct a preliminary inquiry into an accident, serious incident or incident and submit\nto him preliminary report to assess the classification of the occurrence and the extent of and expertise\nneeded for the investigation.\n(2) The person authorised to conduct preliminary inquiry shall have all the powers of an\ninvestigator under this Act."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Institution and public notice of an investigation",
      "content": "(1) Subject to other provisions of this\nact, the Director shall investigate the following accidents and serious incidents involving an aircraft —\n(a)     in a location in or over territory of Pakistan; and\n(b)     registered in Pakistan in a location not being the territory of any\nState.\n(2) The Director shall investigate incidents that or repetitive or impose a risk to air safety and\nmay also investigate such other incidents which in which view require investigation in interest of\nimproving air safety.\n(3) Where the Director does not initiate an investigation into an accident, serious incident\nor incident within such period as may be specified in rules, the Secretary may, where he considers it\nappropriate to do so, requires the Director to initiative the investigation.\n(4) Where the Director considers it appropriate to do so, he may delegate the whole or\nany part of tne investigation to a State or any other entity constituted for investigations for the propose\nof this Act, under the Convention by mutual arrangement and consent.\n(5) An investigation under this Act shall be conducted by two or more investigators of whom\none should be the investigator in charge.\n(6) Unless otherwise directed by the Director, every investigation shall be held in private.\n(7) Immediately after the institution of an investigation into an accident or serious incident,\nthe Director shall, through a public notice, inform that the investigation is being held and any person\nwho may desire to make a representation or to produce any information or evidence concerning the\ncircumstances or cause of the accident or, as the case may be, serious incident, may do so in writing\nwithin the time specified in the notice.\n(8) In the like manner, where he considers it necessary to do so, the Director may solicit\ninformation or evidence through a public notice after the institution of an investigation into an accident."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Objective of investigations by the Bureau",
      "content": "(1) The sole objective of and investigation\nunder this Act shall be the prevention of accidents, serious incidents and incidents and not to apportion\nblame or liability.\n(2) An investigation under this Act shall not refrain from fully reporting the causes or\ncontributing factors of an accident, serious incident or incident merely because any fault or liability\nmight be inferred from it.\n(3) An investigation under this Act shall be separate from and shall not affect any other\nproceeding to apportion blame or liability for an accident, serious incident or incident."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Investigations by the Bureau to take precedence",
      "content": "(1) No investigation shall be\ninstituted into an accident, serious incident or incident for the purpose of making findings as to the\ncauses and contributing factors if —\n(a)     that accident, serious incident or incident is being or has been investigated\nby the Bureau under this Act; or\n(b)     the agency carrying out the investigation has been informed that aircraft\naccident, serious incident or incident is proposed to be investigated by the\nBureau under this Act.\n(2) Nothing in sub-section (1) shall prevent—\n(a)     In investigation into an accident, serious incident or incident for a purpose other\nthan that of making findings as to its causes and contributing factors; and\n(b)     an investigation on any matter that is related to an accident, serious incident or\nincident which is not being investigated by the Bureau.\n(3) An investigation by the Bureau into an accident, serious incident or incident under this Act\nshall take precedence over any other investigation into the accident, serious incident or incident and\nthe agency conducting the investigation shall take all reasonable measures to avoid obstruction or\ninterference with the investigation of the Bureau."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Duty to avoid conflict of interest",
      "content": "(1) For so long as he holds office and for a period\nof two years thereafter, the Director and every investigator, officer, expert, servant and other\nperson employed in the Bureau shall not —\n(a)     Own, or be a shareholder, director, partner or an employee of any aviation\nundertaking or business;\n(b)     have any direct or indirect pecuniary or other benefit, share or interest in\nor be engaged in an aviation undertaking or business; and\n(c)     receive any direct or indirect pecuniary or other benefit, share or interest in the\nmanufacture or distribution of aircraft or aircraft equipment or components.\n(2) Before commencing with an investigation, every investigator shall tender to the Director\na written certificate under his hand that he has not held, or holds, or will not acquire any share or\npecuniary or other interest in any business, contract, or any other transaction which is likely to affect\nprejudicially the discharge by him of his function as investigator.\n(3) Whenever it comes to the notice of an investigator that in relation to any matter under\ninvestigation, he has professionally acted on behalf of any person having any share or interest in that\nmatter, or any of his immediate relatives, or his employer or employee would receive or have a\nreasonable expectation of receiving, a direct or indirect pecuniary or other benefit, share or interest or\nwould suffer or have a reasonable expectation of suffering, a direct or indirect pecuniary or some other\ndetriment, he shall immediately inform the Director and abstain from taking part in the investigation."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Participation in the investigation by other interested States",
      "content": "(1) A State interested\nin the investigation of an accident, serious incident or incident, may appoint an accredited\nrepresentative and one or more advisors or experts to assist him.\n(2) In the like manner, in the case of an accident, serious incident or incident to an aircraft\nregistered in Pakistan in or over the territory of another State, the Secretary may, with the approyal of\nthe Minister, appoint an accredited representative and one or more advisors or experts to participate in\nthe investigation and intimate it to such State."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Protection of the aircraft and other evidence",
      "content": "(1) The aircraft, or any of its parts,\ncontents, components, wreckage, any marks, and remains resulting from an accident, serious incident\nor incident, located or found in the territory of Pakistan shall not be removed or otherwise interfered\nwith, except by a person under the authority of the Director.\n(2) Notwithstanding the provisions of sub-section (1), the aircraft or any of its parts, contents\nand component, wreckage, any marks or remains resulting from the accident, serious incident or\nincident may be removed or interfered with so far as may be necessary —\n(a)     by persons authorised to conduct search and rescue operations for the purpose\nof extricating persons or animals dead or alive, or preventing the destruction of\nthe aircraft and its contents by fire or other cause or of preventing any damage\nor obstruction to the public or to air navigation or to other transport;\n(b)     by persons authorized to conduct search and rescue operations for bringing it\nor them to a place of safety; and\n(c)     for removal of luggage, goods, mail and other similar things from the aircraft\nunder the supervision of a person authorized by the Bureau.\n(3) The Director may, for the purposes of any preliminary inquiry and investigation under this\nAct, authorise an investigator or direct any other person to take measures for —\n(a)     documentation, protection and preservation by photographic or other means,\nof any evidence which might be removed, effaced, lost or destroyed;\n(b)     maintaining safe custody of the aircraft, its parts, contents, components,\nwreckage, any marks and remains;\n(c)     safeguarding against further damage to the aircraft, its parts, contents,\ncomponents, wreckage, any marks and remains;\n(d)     limiting the access to the aircraft, its parts, contents, components, wreckage,\nany marks and remains by unauthorized persons, or to prevent it from pilferage\nand further deterioration; and\n(e)     for the preservation of the aircraft, its parts, contents, components, wreckage,\nany marks and remains for such period as may be necessary for the purposes of\nan investigation.\n(4) The owner, operator, pilot in-command or members of the aircraft crew and every other\nperson who is in the custody of the aircraft, or any of its parts, content, component, wreckage, mark\nor remain or any information, book, note, record, photograph, papers or other document, recording or\ntranscripts, that may reasonably be expected to be required in relation to an investigation under this\nAct shall take .all reasonable steps for its safe keeping and to prevent it from pilferage and deterioration\n(5) Nothing in this section shall be construed to prohibit saving of human life or treatment\nof injured by the best available person at the site of the accident pending the arrival of an investigator,\nor a person authorized by the Director under sub-section (1) or an authorized person mentioned at sub-\nsection (2).\n(6) Where the aircraft, or any of its parts, contents, components, wreckage, any marks, remains\nand other evidence resulting from an accident, serious incident or incident are to be removed or\ninterfered with pursuant to the provisions of sub-section (2) or sub-section (5), the person directing,\nsupervising or arranging the removal or interference shall, to the extent possible in the\ncircumstances, and prior to such removal or interference, record the location, layout and condition of\nthe aircraft, its parts, contents, components, wreckage, any marks and remains and any other evidence\nby the best possible means available."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Release of the aircraft and other evidence when no longer required",
      "content": "(1) The Director\nshall release the aircraft, or any one or more of its parts, contents, components, wreckage, marks and\nremains as well as any other information or evidence that has been taken into his custody by an\ninvestigator or any restriction as to its removal or interference with, or safe keeping have been imposed\nunder section 13 as soon as it is no longer required for the investigation.\n(2) While releasing the aircraft, or any one or more of its parts, contents, component or\nwreckage, the Director may, through a written notice, require the owner, operator or any other person\nhaving lawful claim over it, to have it removed within such reasonable period as may be given in the\nnotice.\n(3) Where the owner, operator or the other person having lawful claim over it, fails without\nreasonable cause to remove the aircraft, or any one or more of its parts, contents, components or\nwreckage, within the period given in the notice, the Director may cause the aircraft, part, content,\ncomponent or wreckage to be auctioned or otherwise disposed of at the expense of the owner, operator\nor other person and deposit proceeds thereof to the Federal Government."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Investigation reports and their publication",
      "content": "(1) The Director may, from time to time,\nprovide an interim statement on the progress and findings of an investigation to the Minister and\nthe Secretary and to every agency or person who has a direct interest in the findings of the\ninvestigation as and when requested by the agency or person.\n(2) As soon as an investigation is complete, the Director shall cause to be prepared a draft final\nreport describing the proceedings in general, any safety deficiencies identified, recommendations\nmade in the interest of air safety and any other relevant findings.\n(3) The Director shall submit the draft final report to the Minister and the Secretary and also\ncause it to be sent to every agency or person who has a direct interest in the findings of the\ninvestigation.\n(4) Thereafter, the Director shall give every agency and person having a direct interest in the\nfindings of the investigation a reasonable opportunity not exceeding forty-five days to make any\nrepresentation or observation on the draft final report.\n(5) No person shall communicate or use the draft final report or permit its communication or\nuse for any purpose, other than the taking of remedial measures and if required preparation of any\nrepresentation or observation.\n(6) The Director shall, after considering the representations and observations, if any received\nby him —\n(a)     adopt the draft final report as final report and share it with the Minister,\nSecretary, and every agency and person having a direct interest in the findings\nof the investigation and also publish it for general information; or\n(b)     reconsider the finding and recommendations of the draft final report where\nin his view new material facts have been brought before him and thereafter share\nit in the manner given under clause (a) above."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Immediate notification of findings requiring urgent action",
      "content": "Without any prejudice to\nthe provisions of section 15, the Director shall, at any time during an investigation, notify forthwith\nin writing, to the Minister, Secretary and every other agency and person who, in his opinion, has a\ndirect interest in its findings and recommendations, whether interim or final, any matter, finding\nor recommendation that in his opinion requires an urgent action."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Duty to respond to findings of investigation",
      "content": "(1) The agency or person responsible\nfor taking a remedial action on the finding or recommendation of an investigation, shall\nwithin such period after being notified of the finding or recommendation as may be determined by the\nDirector, which shall in no case exceed ninety days, inform the Director in writing—\n(a)     of any remedial action taken or which will be taken by the agency or person;\n(b)     reason as to why a remedial action cannot be taken by the agency or person\nwithin the time given by the Director;\n(c)     reason as to why remedial action to be taken by the agency or person is\ndifferent from the action that was recommended; or\n(d)     reason as to why no remedial action shall be taken by the agency or person.\n(2) Where the Director is of the view that a remedial action taken, or the different remedial\naction proposed to be taken does not meet the safety requirements or the reasons for not taking\nany remedial action given by the agency or person are unsatisfactory, he may inform the Secretary in\nwriting who shall then inform the Minister.\n(3) Where the Director is satisfied with the reasons, he may allow additional period for\ntaking action or a taking of the different remedial action."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Obligation not to disclose certain records",
      "content": "(1) The following information and records\nshall not be disclosed for any purpose other than those relating to an investigation except when the\nSecretary determines that their disclosure outweighs the adverse impact it may have on that\ninvestigation or any future investigations —\n(a)     cockpit airborne image recordings and any part or transcripts from such\nrecordings;\n(b)     cockpit voice recordings and transcripts from such recordings;\n(c)     recordings and transcripts of recordings from air traffic control;\n(d)     all statements made to an investigator or other person in the course of an\ninvestigation under this Act;\n(e)     all communications between persons having been involved in the operation of\nthe aircraft;\n(f)     medical or private information of persons involved in the accident, serious\nincident or incident;\n(g)     analysis of information and opinion expressed, including flight recorder\ninformation made by an investigator and accredited representative in relation to\nthe accident, serious incident or incident; and\n(h)     a draft final report.\n(2) Any information or record referred to in sub-section (1) may be included in the final\nreport of an investigation or its appendices, or in any other report only when it is relevant to the analysis\nof the accident, serious incident or incident and parts of the information and records not relevant\nto the analysis shall not be included in such report.\n(3) The final report of an investigation shall not disclose the names of the persons involved in\nthe accident, serious incident or incident."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Reopening of an investigation",
      "content": "Where it appears to the Secretary that any new\nand material evidence has become available after completion of the investigation, he may, with the\napproval of the Minister, direct the Director to re-open the investigation."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Incident reporting systems",
      "content": "(1) The Director shall, through a Standing Order, establish\na mandatory incident reporting system to collect information on actual or potential safety deficiencies\nand require all related persons mentioned in that order to notify all accidents, serious incidents and\nincidents to the Bureau by most suitable and quickest means but in any case not later than twenty-four\nhours.\n(2) In the like manner, the Director shall, through a Standing Order, establish a voluntary\nincident reporting system to facilitate collection of information on actual or potential safety\ndeficiencies that may not be captured by the mandatory incident reporting system.\n(3) The voluntary incident reporting system shall be non-punitive and afford protection to the\nsources of the information."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Obstructing or impeding proceedings",
      "content": "Any person, who interferes with, obstructs\nor impedes the proceedings of an inquiry or investigation, or the exercise of any power or duty\nconferred to or imposed upon an investigator or other person under this Act shall, on conviction, be\npunished with imprisonment which may extend to six months, or a fine not exceeding five hundred\nthousand rupees, or with both."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Withholding, altering or giving false information or evidence",
      "content": "Any person who\nknowingly withholds, hides, alters or damages any information or other evidence relating to an\ninvestigation under this Act or provides any false or misleading information or evidence to an\ninvestigator or other person holding an inquiry or investigation under this Act shall, on conviction, be\npunished with imprisonment which may extend to three years, or a fine not exceeding one million\nrupees, or with both."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Failure to comply with summons or requisition",
      "content": "Any person, who without reasonable\nexcuse, when called upon to do so by an investigator or other person holding an inquiry or investigation\nunder this Act, fails or refuses to appear before him or give a statement, or provide or make available\nany information, book, note, record, photograph, papers or other document, recording and transcripts,\nany part, content or component of an aircraft or its wreckage, of to make available the body of a\ndeceased person or other human remains available for autopsy, shall, on conviction, be punished\nwith imprisonment which may extend to three months, or a fine not exceeding on fifty thousand rupees,\nor with both."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Failure to report a accident or incident",
      "content": "Any person responsible to report an\naccident, serious incident or incident under mandatory reporting system established under section 20,\nwho, without a reasonable excuse, fails to report an accident, serious incident or incident after it has\ncome to his knowledge, shall, on conviction, be punished with imprisonment which may extend to\nthree months or a fine which may extent to fifty thousand rupees, or with both."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Failure to preserve evidence",
      "content": "(1) Any person who holds an information, book, note,\nrecord, photograph, papers or other document, recording and transcripts, any part, content or\ncomponent of an aircraft or its wreckage, or a deceased person or other human remains or any\nother evidence that may reasonably be expected to be required in relation to an investigation under\nthis Act, neglects or fails to take reasonable steps for keeping it safe and to prevent it from pilferage\nand further deterioration, shall on conviction, be punished with imprisonment which may extend to six\nmonths or a fine which may extent to five hundred thousand rupees, or with both.\n(2) Any person who removes or interferes with the damaged aircraft, or any of it part, content\nand component, the wreckage, any remains and marks resulting from the accident, serious incident or\nincident in contravention of the provisions of section 13, shall on conviction, be punished with\nimprisonment which may extend to three months or a fine which may extent to one hundred thousand\nrupees, or with both."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Unauthorized disclosure of information",
      "content": "Any person who, without the prior written\nconsent of the Director causes or permits any information collected or report prepared by the\nBureau or any part of it to be disclosed to any other person, body or organisation before it is made\npublicly available by the Director, shall, on conviction be punished with imprisonment which may\nextend to three months or a fine which may extent to one hundred thousand mpees; or with both."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Offences by bodies corporate",
      "content": "(1) Where a body corporate is guilty of an offence under\nthis Act and that offence is proved to have been committed with consent or connivance of, or to be\nattributable to any neglect on part of, any director, manager, secretary or other similar officer of\nbody corporate or any person who was purporting to act in any such capacity he, as well as the\nbody corporate, shall be guilty of an offence and shall be liable to be proceeded against and punished\naccordingly.\n(2) Where the affairs of a body corporate are managed by its members, sub-section (1) shall\napply in relation to the acts and defaults of member in connection with his functions of management\nas if he were a director of the body corporate."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Cognizance of offences",
      "content": "No court shall take cognizance of an offence under this Act\nexcept upon a complaint in writing by the Director or an officer of the Bureau authorized by him for\nthis purpose."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Offences to be bailable",
      "content": "All offences under this Act shall be bailable."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Summary trial for certain offences",
      "content": "The Magistrate of the first class shall, on the written\ncomplaint of the Director, or an officer of the Bureau authorized by him for this purpose, try an\noffence under section 21, 23, 24 and 26 and may impose any amount of fine under this Act in\naccordance with the provisions of Chapter XXII of the Code of Criminal Procedure, 1898 (V of 1898)."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Compounding of offences",
      "content": "(1) Subject to sub-section (2), the Director or an officer of\ndeposit of administrative penalty which shall not be less than fifty thousand rupees.\n(2) An offence under this Act shall not be compoundable if the accused has previously been\nconvicted under this Act or his previous offence has been compounded by the Director or the officer\nof the Bureau authorized by the Director."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Transfer of services of existing employees",
      "content": "(1) On the commencement of this Act, the\nFederal Government shall, by notification in the official Gazette, determine the date, mode and manner\nin which any officer, expert, servant or any other person or category of officers, experts, servants or\npersons who immediately before the commencement of this Act have been in the service of the\nAuthority in relation to the functions, duties and affairs of the Bureau under this Act, shall be\ntransferred to the Bureau, on the same terms and conditions as were applicable to them, unless modified\nor amended under the provisions of this Act:\n(2) The pay and allowances to which such an investigator, officer, expert, servant or person\nis entitled to for service in the Bureau shall not be less favorable than those to which he was entitled\nimmediately before such transfer.\n(3) The service of an officer, expert, servant or other person transferred to the Bureau under\nsub-section (1) shall be taken for all purposes to have been continuous with the service of the officer,\nexpert, servant or person, immediately before the date of transfer, as an employee of the Authority.\n(4) Notwithstanding any provision of law, no officer, servant, expert or person transferred to\nthe service of the Bureau under sub-section (1) shall be entitled to receive any payment or other benefit\nmerely because he stopped being an employee of the Authority as a result of this section or of any\nother provision of this Act, or on account of the abolition of his office in the Authority."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Transfer of certain properties and assets",
      "content": "On the commencement of this Act, the Federal\nGovernment shall, by notification in the official Gazette, determine the date, mode and manner in\nwhich such assets, including lands, buildings, machinery, apparatus, equipment and sums of money,\nand all other rights and interests arising out of such assets that are related to the functions, duties and\naffairs of the Bureau under this Act as were immediately before that day vested in the Authority, shall,\nwithout any conveyance or assignment, be transferred to and vest in the Bureau free of any cost and\nall liabilities in respect of the said assets shall be the liability of the Bureau."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Air Safety Fund",
      "content": "(l) There shall be a fund to be called the Air Safety Fund.\n(2)   The Fund shall be derived from the following sources, namely—\n(a)     money transferred to the Fund from the accounts of the Authority in terms of\nsection 32;\n(b)     any grant received from the Federal Government,\n(c)     any aid, assistance or grant received from any national or international\nagency;\n(d)     money levied on aircrafts navigating over the territories of Pakistan or landing\nat an airport in Pakistan at such rate as the Federal Government may, from time\nto time, determine; and\n(e)     interest on invested cash balance of the Fund.\n(3) The Federal Government may, by a notification in the official Gazette, direct that the levy\nunder sub-section (2) shall be charged, collected and transferred to the Fund by any agency or authority\nother than the Bureau.\n(4) The sums credited to the Fund shall—\n(a)     not lapse with the expiry of a financial year; and\n(b)     be spent for no purpose other than meeting the cost of investigation,\nundertaking studies, training or other measure in the interest of the air safety or\nother objects of this Act."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Periodical and annual reports",
      "content": "(1) The Director shall keep the Secretary generally\ninformed of the working of the Bureau and submit to him reports on matters relating to functions of\nthe Bureau at such intervals and in such form as he may direct.\n(2) The Director shall, as soon as practicable after the close of every calendar year, but not\nlater than the last Friday of the immediately following January, submit to the Minister a report on the\nstate of air safety, progress of investigations, extent of compliance with safety recommendations and\nactivities undertaken by the Bureau in general during that year."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Federal Investigation Agency and local police to assist",
      "content": "(1) On written request of the\nDirector or the investigator for the purpose of this Act, the officer of the Federal Investigation Agency,\nAirport Security Force or of the police of the respective district to whom this request is directed, shall\nwithout unreasonable delay, render such assistance.\n(2) If for any reasonable cause, such officer is unable to provide the requested assistance,\nhe shall forthwith bring the matter to the notice of his supervisory officer, and where such supervisory\nofficer is also unable to provide such support, he shall inform the Director or, as the case may be, the\ninvestigator making the request.\n(3) Where the officer of the Federal Investigation Agency, Airport Security Force or of\nthe police of the respective district fails to provide assistance despite request, or where he is not\nsatisfied with the reason for the inability to provide assistance, the Director may inform the Secretary."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Indemnity",
      "content": "No suit, prosecution or other legal proceedings shall lie against the Minister,\nSecretary, Bureau, Director, investigator, officer, expert, servant or other person employed with the\nBureau in respect of anything, done o intended to be done in good faith under this Act or under any\nrule or Standing Order or for any damage sustained by anything belonging to or under the control of\nthe Bureau."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Power of Federal Government to make rules",
      "content": "(1) The Federal Government may, by\nnotification in the official Gazette, make rules for giving effect to one or more provisions of this Act\nor to carry out the purpose of this Act in general.\n(2) in particular, and without prejudice to the generality of the provisions of sub-\nsection (1), such rules may provide for all or any of the following matters, namely —\n(a)     the procedure and manner of notification of an accident, serious incident and\nincident, including notification to a State;\n(b)     the notification of an accident, serious incident and incident to the International\nCivil Aviation Organisation and a State for participation in the investigation;\n(c)     the preservation, collection and custody of evidence;\n(d)     the manner of investigation in general;\n(e)     the procedure for summoning of persons and production of evidence and\nother information;\n(f)     the format of the report of preliminary inquiry, draft investigation report and\ninvestigation report;\n(g)     the consolidation and follow-up of safety recommendations;\n(h)     the manner in which the Fund shall be managed including provisions\nin relation to keeping of its account, authorization for expenditure and charging,\ncollection and transfer of levy; and\n(i)     any other matter subsidiary or incidental to the investigation of aircraft\naccidents, serious incident and incidents."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Standing Orders",
      "content": "The Director may, with the approval of the Minister, make Standing\nOrders, not inconsistent with this Act and the rules, to provide for any matter and for which provision\nis necessary or expedient for carrying out the purpose of this Act."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Act to override other laws",
      "content": "The provisions of this Act shall have effect notwithstanding\nanything contrary contained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Exclusion of the jurisdiction of courts",
      "content": "Notwithstanding anything contained in\nany other law for the time being in force, any proceedings pending before or order of the Minister,\nSecretary, Director, investigator or any other person under this Act shall be final and shall not be\ncalled in question in any suit, application or other judicial proceedings and a court shall not assume\njurisdiction or grant an injunction in respect of any action taken or intended to be taken by the Minister,\nSecretary, Director or investigator or any other person under this Act."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to any of the provision of\nthis Act, the Federal Government may make such order, not inconsistent with the provisions of this\nAct, as may appear to it to be necessary for the purpose of removing the difficulty."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Repeal and savings",
      "content": "(1) On the commencement of this Act, section 7 of the Civil\nAviation Ordinance, 1960 (Ordinance XXXII of 1960) and the rules made thereunder in relation to the\nsubject matter of this Act shall stand repealed.\n(2)   Notwithstanding such repeal —\n(a)     anything done or any action taken or purported to have been done or taken\nunder the aforesaid Act or rules so repealed shall, in so far as it is not\ninconsistent with the provisions of this Act, be deemed to have been done or\ntaken under the corresponding provisions of this Act, and\n(b)   any matter that is in the course of being investigated, or that has been\ninvestigated by the Authority, but on which a report has not been made when\nthis Act comes into force shall, on the coming into force of this Act, be taken\nup and continued by the Bureau, as if it were, or had been an investigation under\nthis Act.\n____________\nLast Uploaded on 19.09.2023"
    }
  ],
  "definitions": [
    {
      "term": "accident",
      "definition": "an occurrence associated with the operation of an aircraft which in the case of a manned aircraft, takes place between the time any person boards the aircraft with the intention of flight until such time as all such persons have disembarked; and in the case of an unmanned aircraft, takes place between the time the aircraft is ready to move with the purpose of flight until such time as it comes to rest at the end of the flight and the primary propulsion system is shutdown, that leads to― (i) fatal or serious injury to a person as a result of his being in the aircraft, or direct contact with any part of the aircraft, including parts which have become detached from it, or direct exposure to jet blast, except when the injuries are from natural causes, self-inflicted or inflicted by other persons, or when the injuries are to stowaways hiding outside the areas normally available to the passengers and crew; (ii) damage to the aircraft or structural failure which adversely affects the structural strength, performance or flight characteristics of the aircraft, and would normally require major repair or replacement of the affected component, except for failure of engine or damage, when the damage is limited to a single engine, (including its cowlings or accessories), to propellers, wing tips, antennas, probes, vanes, tires, brakes, wheels, fairings, panels, landing gear doors, windscreens, the aircraft skin (such as small dents or puncture holes), or for minor damages to main rotor blades, tail rotor blades, landing gear, and those resulting from hail or bird strike (including holes in the radome); or (iii) the aircraft going missing or is completely inaccessible;",
      "source_provision": "sec2"
    },
    {
      "term": "accredited representative",
      "definition": "a person designated by a State, on the basis of his or her qualifications, for the purpose of participating in an investigation conducted by another State and where the State has established an accident invekigation authority, the designated accredited representative, would normally be from that authority;",
      "source_provision": "sec2"
    },
    {
      "term": "Act",
      "definition": "the Pakistan Air Safety Investigations Act, 2023;",
      "source_provision": "sec2"
    },
    {
      "term": "advisor",
      "definition": "a person appointed by a State, on the basis of his or her qualifications, for the purpose of assisting its accredited representative in an investigation;",
      "source_provision": "sec2"
    },
    {
      "term": "aircraft",
      "definition": "a machine that can derive support in the atmosphere from the reactions of the air other than the reactions of the air against the surface of the earth;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "the Pakistan Civil Aviation Authority established under the Pakistan Civil Aviation Ordinance, 1982 (Ordinance XXX of 1982);",
      "source_provision": "sec2"
    },
    {
      "term": "Aviation undertaking",
      "definition": "an entity, person or organization that is affected or benefitted by the carrying out of any function or duty or exercise of any power by the Bureau;",
      "source_provision": "sec2"
    },
    {
      "term": "Bureau",
      "definition": "the Bureau of Aircraft Accident investigation established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Convention",
      "definition": "the Convention of International Civil Aviation done at Chicago on seventh day of December, 1944 and any other international convention or treaty on air safety and aircraft accidents to which Pakistan is a signatory;",
      "source_provision": "sec2"
    },
    {
      "term": "Director",
      "definition": "the Director of the Bureau;",
      "source_provision": "sec2"
    },
    {
      "term": "Federal Investigation Agency",
      "definition": "the Federal Investigation Agency established under the Federal Investigation Agency Act, 1974 (Act VIII of 1974);",
      "source_provision": "sec2"
    },
    {
      "term": "incident",
      "definition": "an occurrence, other than an accident, associated with the operation of an aircraft which affects or could affect the safety of operation;",
      "source_provision": "sec2"
    },
    {
      "term": "information",
      "definition": "a recording, material or document;",
      "source_provision": "sec2"
    },
    {
      "term": "investigation",
      "definition": "an investigation under this Act for the purpose of prevention of aircraft accidents, serious incidents and incidents and includes measures to preserve, gather and analyse evidence and information, drawing of conclusion, including the determination of causes and contributing factors and, where appropriate, the making of safety recommendation;",
      "source_provision": "sec2"
    },
    {
      "term": "investigator",
      "definition": "an employee of the Bureau or any other person having reasonable familiarity, experience and skills in air safety and accident investigations;",
      "source_provision": "sec2"
    },
    {
      "term": "Minister",
      "definition": "the Minister for Aviation;",
      "source_provision": "sec2"
    },
    {
      "term": "operator",
      "definition": "a person, organization or enterprise engaged in or offering to engage in operation of an aircraft;",
      "source_provision": "sec2"
    },
    {
      "term": "Secretary",
      "definition": "the Secretary to the Federal Government, Aviation Division;",
      "source_provision": "sec2"
    },
    {
      "term": "serious incident",
      "definition": "an incident involving circumstances indicating that there was a high probability of an accident and associated with the operation of an aircraft which in the case of a manned aircraft, takes place between the time any person boards the aircraft with the intention of flight until such time as all such persons have disembarked, or in the case of an unmanned aircraft, takes place between the time the aircraft is ready to move with the purpose of flight until such time as it comes to rest at the end of the flight and the primary propulsion system is shut down; and",
      "source_provision": "sec2"
    },
    {
      "term": "State",
      "definition": "a State signatory to the Convention other than Pakistan.",
      "source_provision": "sec2"
    }
  ]
}
