{
  "id": "pk-pakistan-animal-quarantine-import-and-export-of-animals-and-animal-products-ordi",
  "type": "statute",
  "title": "Pakistan Animal Quarantine (Import and Export of Animals and Animal Products) Ordinance, 1979",
  "title_en": "Pakistan Animal Quarantine (Import and Export of Animals and Animal Products) Ordinance, 1979",
  "short_name": "PAQAE",
  "status": "in_force",
  "issued_date": "1979-09-16",
  "in_force_date": "1979-09-16",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cpeW-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Animal Quarantine (Import and Export of Animals and Animal Products) Ordinance, 1979 (XLIX of 1979) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Power to make rules",
      "content": "THE PAKISTAN ANIMAL QUARANTINE (IMPORT AND EXPORT OF\nANIMALS AND ANIMAL PRODUCTS) ORDINANCE, 1979.\nORDINANCE No. XLIX OF 1979\n[17th September, 1979]\nAn Ordinance to regulate the import, export and quarantine of animals and animal products\nWHEREAS it is expedient to regulate the import, export and quarantine of animals and\nanimal products in order to prevent the introduction or spread of diseases and to provide for matters\nconnected therewith or incidental thereto;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, read\nwith the Laws (Continuance in Force) Order, 1977 (C. M. L. A. Order No. 1 of 1977), and in exercise\nof all powers enabling him in that behalf, the President is pleased to make and promulgate the\nfollowing Ordinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Ordinance may be called the Pakistan\nAnimal Quarantine (Import and Export of Animals and Animal Products) Ordinance, 1979.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or",
      "content": "context,—\n(a)     “animal” includes all kinds of—\n(i)     birds;\n(ii)    cold-blooded creatures;\n(iii)   creatures by means of which any disease may be carried or transmitted;\n(iv)    crustacean;\n(v)     fish;\n(vi)    four-footed beasts which are not mammals;\n(vii)   mammals, except man; and\n(viii) reptiles;\n(b)     “animal product” means anything originating or made, whether in whole or in\npart, from an animal or from a carcass and includes blood, bones, casings,\ndairy products, eggs, fat, feedstuffs of animal origin, fish products, hair, hides,\nhorns, hooves, hormones and their biological preparations, offals, seed\nmaterials for research purposes, semen, skins, tendons, viscera, wool and any\nother substance of animal origin which may be specified by the Federal\nGovernment by notification in the official Gazette;\n(c)     “carcase” means the carcass of an animal and includes any part or portion\nthereof;\n(d)     “diseased” means suffering from or carrying any infectious or contagious\ndisease or such disease as may be declared by the Federal Government from\ntime to time by notification in the official Gazette;\n(e)     “fodder” means hay, roughage, concentrate or any other substance used for\nfeeding animals;\n(f)     “health certificate” means a certificate issued by a Quarantine Officer in\nrespect of the health status of animals and animal products;\n(g)     “import” and “export” respectively means bringing into or taking out of\nPakistan by sea, land or air;\n(h)     “litter” means any substance used as bedding for animals or for holding or\ncontaining animals in the process of transportation;\n(i)     “prescribed” means prescribed by rules;\n(j)     “points of entry” and “points of exit” mean the Islamabad Airport, Karachi\nAirport, Karachi Harbour, Lahore Airport, Peshawar Airport, Quetta Airport,\nthe Chaman, Kuh-i-tuftan, Turkham, Khokhrapar and Lahore land routes and\ninclude any other authorised land, sea or air route declared by the Federal\nGovernment from time to time by notification in the official Gazette;\n(k)     “quarantine” means a site or premises provided or approved by the Federal\nGovernment for the isolation and examination of animals and animal products\nintended for import or export;\n(l)     “Quarantine Officer” means any veterinarian duly authorised by the Federal\nGovernment to exercise and perform the powers and functions of Quarantine\nOfficer under this Ordinance; and\n(m)     “rules” means rules made under this Ordinance."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Power to regulate and prohibit import and export of animals and animal products",
      "content": "(1) The Federal Government may, by notification in the official Gazette, prohibit, restrict or\notherwise regulate, subject to such conditions as it may think fit to impose, the import or export of\nany animal or class of animals or animal products likely to introduce diseases to any other animal,\nanimal product or man.\n(2) A notification under this section may specify any animal or class of animals or animal\nproducts either generally or in any particular manner, whether with reference to the country of origin,\nor the route by which imported or otherwise.\n(3) Any condition imposed under this section may require__\n(a)    the examination, inspection and detention in quarantine by the Quarantine\nOfficer of the animals or animal products brought in or to be taken out ;\n(b)    the obtaining of health certificate ;\n(c)    the treatment or detention, confiscation and destruction of diseased animals or\nanimal products ; and\n(d)    that any animal or class of animals or animal products shall not be imported or\nexported except by a specified agency of the Federal Government."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Operation of notification under section 3. A notification under section 3 shall operate as",
      "content": "if it had been issued under section 16 of the Customs Act, 1969 (IV of 1969), and the officers of\ncustoms shall have the same powers in respect of any animal or animal product in respect of which\nsuch a notification has been issued as they have for the time being in respect of any article the\nimportation or exportation of which is prohibited or restricted under the said Act, and all the\nprovisions of that Act shall have effect accordingly."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Control of animals and animal products in quarantine. All animals and animal",
      "content": "products detained in quarantine shall be under the control of the Quarantine Officer and shall be dealt\nwith in the prescribed manner."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Powers, duties and functions of Quarantine Officer. Subject to the provisions of this",
      "content": "Ordinance, the Quarantine Officer shall have the power to—\n(a)    inspect animals and animal products ;\n(b)    detain in and release from quarantine and determine the length of the\nquarantine period ;\n(c)    order the carrying out of the prescribed tests ;\n(d)    issue health certificate ;\n(e)    order destruction of such animals or animal products as may, after such\nexamination and tests as may be prescribed, be found to be diseased ;\n(f)    order disposal of clothing, dung, fittings, fodder, harness or litter that may\nhave been in contact with, or pertaining to, diseased animals and animal\nproducts ;\n(g)    require proper disinfection of any premises or aircraft or railway wagon or\ncarriage or vessel or vehicle of any description used for carrying animals and\nanimal products ;\n(h)       approve conditions to be observed in export quarantine ;\n(i)       prohibit export of animals considered unfit to travel ;\n(j)       prohibit voyages of vessels carrying animals during adverse weather;\n(k)       inspect and issue certificates in respect of animals and animal products in\ntransit ;\n(l)       deport any animal or animal product, at the expenses of the person importing\nsuch animal or animal product, the import of which is prohibited by the\nFederal Government ; and\n(m)       carry out such functions as are necessary for the successful operation and\nmanagement of quarantine stations."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Cognizance of offence. No Court shall take cognizance of any offence under this",
      "content": "Ordinance, except upon complaint in writing made by an officer authorised by the Federal\nGovernment in this behalf."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Penalties",
      "content": "(1) Whoever contravenes or attempts to contravene any of the provisions of\nthis Ordinance or the rules or any notification issued thereunder, shall, without prejudice to any\npenalty to which he may be liable under the provisions of the Customs Act, 1969 (IV of 1969), as\napplied by section 4, be punishable with imprisonment for a term which may extend to three years,\nor with fine which may extend to five thousand rupees, or with both.\n(2) Any import of animals or animal products not accompanied by a valid import licence and\nthe prescribed health certificate shall, if found free from infectious or contagious disease, be disposed\nof by the Federal Government in such manner as may be prescribed."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Appointment of officers and members of staff. The Federal Government may appoint",
      "content": "such number of officers and members of staff as it may deem fit for carrying out the purposes of this\nOrdinance."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Revision",
      "content": "(1) Any person aggrieved by an order passed by the Quarantine Officer under\nthis Ordinance may apply for revision to the Federal Government within thirty days from the date of\nissue of such order, and the decision of the Federal Government shall be final 1[:]\n1\n[Provided that no order on such revision shall be passed unless the applicant has been given\nan opportunity of being heard].\n(2) The Federal Government may, on the receipt of an application under sub-section (1), stay\nthe operation of the order of the Quarantine Officer till the disposal of the application."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Indemnity. No suit, prosecution or other legal proceedings shall lie against the Federal",
      "content": "Government or the Quarantine Officer or any other person for anything in good faith done or\nintended to be done under this Ordinance, or the rules.\n1\nSubs. and ins. by the Pakistan Animal Quarantine (Import and Export of Animals and Animal Products) (Amdt.) Act, 1985 (5 of 1985), s. 2."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Exemption. The Federal Government may, by notification in the official Gazette, exempt",
      "content": "any animal or animal product from the operation of all or any of the provisions of this Ordinance,\nsubject to such conditions, if any, as may be specified in the notification."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Delegation of powers. The Federal Government may, by notification in the official",
      "content": "Gazette, delegate to a Provincial Government, or to any officer or authority of such Government, any\nof its powers under this Ordinance."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. [Repeal.] Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981",
      "content": "(XXVII of 1981), s. 3 and II sch.\n_________\n1\nFor such rules see S.R.O. 1007(I)/80, dated 20-8-1980, Gaz. of P., 1980, Extra., Pt. II, pp. 1766-79."
    }
  ],
  "definitions": [
    {
      "term": "animal",
      "definition": "all kinds of— (i) birds; (ii) cold-blooded creatures; (iii) creatures by means of which any disease may be carried or transmitted; (iv) crustacean; (v) fish; (vi) four-footed beasts which are not mammals; (vii) mammals, except man; and (viii) reptiles;",
      "source_provision": "sec2"
    },
    {
      "term": "animal product",
      "definition": "anything originating or made, whether in whole or in part, from an animal or from a carcass and includes blood, bones, casings, dairy products, eggs, fat, feedstuffs of animal origin, fish products, hair, hides, horns, hooves, hormones and their biological preparations, offals, seed materials for research purposes, semen, skins, tendons, viscera, wool and any other substance of animal origin which may be specified by the Federal Government by notification in the official Gazette;",
      "source_provision": "sec2"
    },
    {
      "term": "carcase",
      "definition": "the carcass of an animal and includes any part or portion thereof;",
      "source_provision": "sec2"
    },
    {
      "term": "diseased",
      "definition": "suffering from or carrying any infectious or contagious disease or such disease as may be declared by the Federal Government from time to time by notification in the official Gazette;",
      "source_provision": "sec2"
    },
    {
      "term": "fodder",
      "definition": "hay, roughage, concentrate or any other substance used for feeding animals;",
      "source_provision": "sec2"
    },
    {
      "term": "health certificate",
      "definition": "a certificate issued by a Quarantine Officer in respect of the health status of animals and animal products;",
      "source_provision": "sec2"
    },
    {
      "term": "litter",
      "definition": "any substance used as bedding for animals or for holding or containing animals in the process of transportation;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules;",
      "source_provision": "sec2"
    },
    {
      "term": "quarantine",
      "definition": "a site or premises provided or approved by the Federal Government for the isolation and examination of animals and animal products intended for import or export;",
      "source_provision": "sec2"
    },
    {
      "term": "Quarantine Officer",
      "definition": "any veterinarian duly authorised by the Federal Government to exercise and perform the powers and functions of Quarantine Officer under this Ordinance; and",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Ordinance.",
      "source_provision": "sec2"
    }
  ]
}
