{
  "id": "pk-pakistan-armed-forces-nursing-service-act-1952",
  "type": "statute",
  "title": "Pakistan Armed Forces Nursing Service Act, 1952",
  "title_en": "Pakistan Armed Forces Nursing Service Act, 1952",
  "short_name": "PAFNS",
  "status": "in_force",
  "issued_date": "1952-05-04",
  "in_force_date": "1952-05-04",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FobQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Armed Forces Nursing Service Act, 1952 (XXXVI of 1952) published by The Pakistan Code (Military Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, application and commencement",
      "content": "(1) This Act may be called the 2[Pakistan\nArmed Forces Nursing Service] Act, 1952.\n(2) It applies to the members of the 2[Pakistan Armed Forces Nursing Service] wherever they\nmay be.\n(3) It shall come into force at once and shall be deemed to have taken effect on the tenth day\nof May, 1951."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(a)         “prescribed” means prescribed by rules made under this Act;\n(b)         “regulations” means regulations made under this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Constitution of 2[Pakistan Armed Forces Nursing Service]. There shall be raised and",
      "content": "maintained, in the manner hereinafter provided, as part of the Armed Forces of Pakistan, 3[a force]\nwhich shall be designated the 2[Pakistan Armed Forces Nursing Service].\n3\n[4. Liability for service of members of the Pakistan Armed Forces Nursing Service. The\nmembers of the Pakistan Armed Forces Nursing Service shall be liable for service with the force or\npersons subject to the Pakistan Army Act, 1952 (XXXIX of 1952), the Pakistan Air Force Act, 1953\n(VI of 1953) or the Pakistan Navy Ordinance, 1961 (XXXV of 1961).]\n1\nThe Act has been applied to Baluchistan with effect on and from the 6th May, 1952, see Gaz. of P., 1952, Pt. I, p. 110; and extended to the Leased Areas\nof Baluchistan, by the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950).\nIt has been applied also in the Federated Areas of Baluchistan, see Gaz. of P., 1953, Pt. I, p. 152.\nIt has been extended to the Baluchistan States Union by the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G. G. O. 4 of 1953).\nThis Act has been and shall be deemed to have been brought into force in Gwadur with effect from the 8th September, 1958 by the Gwadur (Application\nof Central Laws) Ordinance, 1960 (XXXVII of 1960), s. 2.\nThis Act has been and shall be deemed to have been so extended to the whole of Pakistan on the 14th October, 1955 by the Central Laws (Statute Reform)\nOrdinance, 1960 (XXI of 1960), s. 3 and 2nd Sch.\n2\nSubs. by Act No. XXXIX (w. e. f. 10th May, 1951), s. 2.\n3\nSubs. by Act No. V of 1963, ss. 2-3."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Members to be of commissioned rank",
      "content": "All members of the 1[Pakistan Armed Forces\nNursing Service] shall be of commissioned rank and shall be appointed as officers of the 1[Pakistan\nArmed Forces Nursing Service] by the 2[Federal Government], by notification in the official Gazette."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Eligibility for appointment",
      "content": "(1) Any female citizen 3[* * *] shall be eligible for\nappointment as an officer in the 1[Pakistan Armed Forces Nursing Service] and, if she satisfies the\nprescribed conditions, may be appointed thereto in the manner laid down in section 5 of this Act:\nProvided that a woman who is not a citizen of Pakistan but who otherwise fulfils the conditions\nlaid down by, or under this section for a citizen of Pakistan, may, with the consent of the 2[Federal\nGovernment], signified in writing, be appointed as an officer in the 1[Pakistan Armed Forces Nursing\nService].\n(2) Every person so appointed shall be subject to this Act and to the rules and regulations made\nthereunder.\n1\n[7. The 2[Federal Government], or any authority empowered by the 2[Federal Government]\nin this behalf, may 3[dismiss, remove, release, or cause of retirement of,] any officer from the Pakistan\nArmed Forces Nursing Service.]\n1\n[8. Subject to the provisions of this Act, an officer of the Pakistan Armed Forces Nursing\nService shall be bound to undergo such training and in such manner and to perform such duties in\nconnection with the forces and persons subject to any of the enactments referred to in section 4 as may\nbe laid down by regulations.]\n3\n[9. Application of the Pakistan Army Act, 1952, the Pakistan Air Force Act, 1953, and\nService.__ (1) The provisions of the Pakistan Army Act, 1952 (XXXIX of 1952), shall, to such extent\nand subject to such adaptations and modifications as may be prescribed, apply to officers of the\nPakistan Armed Forces Nursing Service, who may be serving with forces and persons subject to that\nAct as those provisions apply to officers of the Pakistan Army.\n(2) The provisions of the Pakistan Air Force Act, 1953 (VI of 1953), shall, to such extent and\nsubject to such adaptations and modifications as may be prescribed, apply to officers of the Pakistan\nArmed Forces Nursing Service, who may be serving with forces and persons subject to that Act as\nthose provisions apply to officers of the Pakistan Air Force.\n(3) The provisions of the Pakistan Navy Ordinance, 1961 (XXXVI of 1961), shall, to such extent\nand subject to such adaptations and modifications as may be prescribed, apply to officers of the\nPakistan Armed Forces Nursing Service, who may be serving with forces and persons subject to that\nOrdinance as those provisions apply to officers of the Pakistan Navy.]"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Power to make rules",
      "content": "(1) The 2[Federal Government] may, by notification in the official\nGazette, make rules to carry out the purposes of this Act.\n1\nSubs. by Act No. (XXXIX of 1953, ss. 2, 4 and 5.\n2\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table.\n3\nOmitted and subs. by Act No. V of 1963, ss. 4-6.\n(2) In particular and without prejudice to the generality of the foregoing power, rules may be\nmade under this section,__\n(a)        providing for the medical examination of persons offering themselves for\nappointment in the 1[Pakistan Armed Forces Nursing Service]; and\n(b)        providing for any matter which under this Act is to be or may be prescribed.\n11.Power to make regulations. 2[Any officer or authority empowered in this behalf by the\n3\n[Federal Government]] may make regulations not inconsistent with this Act and rules made\nthereunder, providing for all matters to be laid down by regulations and generally for all details\nconnected with the organization, pay, allowances, duties, discipline, training, clothing, equipment and\nleave of members of the 1[Pakistan Armed Forces Nursing Service].\n4p7200wsp\nRGN Date: 17-06-2025\n1\nSubs. by Act No. XXXIX of 1953, s. 2.\n2\nSubs. by Act No. VIII of 1965, s. 2.\n3\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table."
    }
  ],
  "definitions": [
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Act.",
      "source_provision": "sec2"
    }
  ]
}
