{
  "id": "pk-pakistan-arms-ordinance-1965",
  "type": "statute",
  "title": "Pakistan Arms Ordinance, 1965",
  "title_en": "Pakistan Arms Ordinance, 1965",
  "short_name": "PAO",
  "status": "in_force",
  "issued_date": "1965-06-07",
  "in_force_date": "1965-06-07",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NpapZl-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Arms Ordinance, 1965 (XX of 1965) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Penalty for breach of Sections 4, 5, 8 to 11: whoever commits any of the following",
      "content": "offences, namely:-—\n(a)    sells, or keeps, offers or exposes for sale, any arms, ammunition or military stores,\nor under takes the repairs of any arms in contravention of the provisions of\nSection 4 ;\n(b)   fails to give notice of the sale of arms and ammunition and of the purchaser's\nname and address as required by Section 4 ;\n(c)   transports any arms, ammunition or military stores in contravention of a\nregulation or prohibition issued under Section 5 ;\n(d)   goes armed in contravention of the provisions section 8;\n(e)   has in his possession or under his control any arms, ammunition or military stores\nin contravention of the provisions of section 9;\n(f)   fails to deposit arms, ammunition or military stores as required by section 10;\n(g)   intentionally makes any false entry in a record of account which by a rule made\nunder clause (d) of section 11 he is required to keep; 1[*]\n(h)   intentionally fails to exhibits anything which by a rule made under clause (f) of\nsection 11 he is required to exhibit; 2[or]\n1The word “or” del. By Act No. LXXX of 1976 .\n2Add. ibid.\n1\n[(i)    keeps, carries or displays any arms in contravention of an order issued under\nsection 11-B; ]\nshall be punished with imprisonment for a term which may extend to 2[seven years], or with fine, or with\nboth:\n3\n[Provided that the punishment for an offence committed in respect of any \n(a)     cannon, grenade, bomb or rocket; or\n(b)     light or heavy automatic weapon, rifle of 303 bore or over , musket 410 bore or\nover or pistole or revolver of 441 bore or over, or ammunition which can be fired\nfrom such weapon, rifle, musket, pistol or revolver,\nshall be imprisonment for a term which is not less than three years.]"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Certain breaches of Sections 4, 5, 9 and 21: Whoever",
      "content": "4\n(a)      [*          *       *       *      *     *     *]\n(b)    on any search being made under Section 21, conceals or attempts to conceal any\narms, ammunition or military stores,\nshall be punished with imprisonment for a term which may extend to seven years, or with fine, or with\nboth :\n5\n[Provided that the punishment for an offence committed of any—\n(a)     cannon, grenade, bomb or rocket; or\n(b)     light or heavy automatic weapon, rifle of .303 bore or over, musket of .410 bore\nor over or pistol or revolver of .441 bore or over or ammunition which can be\nfired from such weapon, rifle, musket, pistol or revolver,\nshall be imprisonment for a term which is not less than two years.]\n6\n[14-A Certain offences triable by Magistrates: (1) Notwithstanding anything contained in\nSection 14 shall, unless it has been committed in respect of any of the arms, ammunition or military\nstores referred to in the proviso to the said Section 13, be triable by a Magistrate of the First Class.\n(2) All cases relating to offences triable by a magistrate of the first class under sub-section (1)\nand pending in a Court of Sessions immediately before the commencement 7 of the Pakistan Arms\n(Amendment) Ordinance, 1976 (XXI of 1976), in which the charge had not been framed shall, on such\ncommencement, stand transferred to the Court of the magistrate of the first class having jurisdiction\nover such cases.]\n1Add. By Act No. LXXX of 1976 .\n2Sub. By Act No. LII of 1973, for “three years”.\n3The original proviso which was omitted by W.P. Act XI of 1967 was re-inserted by Act No. LII of 1973.\n4Del. By Act No. LII of 1973.\n5Sub. By Act No. LXXX of 1976.\n6Add. by Act No. L of 1976.\n7It came into being w.e.f. 25 th May, 1976."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Breach of licence: Whoever, in violation of a condition subject to which a licence has been",
      "content": "granted, does or omits to do any act shall, when the doing or omitting to do such act is not punishable\nunder Sec. 13 or Section 14, be punished with fine which may extend to five hundred rupees."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Knowingly purchasing arms, etc., from unlicensed persons: Whoever",
      "content": "(a)      knowingly purchases any arms, ammunition or military stores from any person\nnot licenced or authorized under sub-section (2) of section 4 to sell the same; or\n(b)      delivers any arms, ammunition or military stores into the possession of any person\nwithout previously ascertaining that such person is legally authorized to possess\nthe same,\nShall be punished with imprisonment for a term which may extend to three years or with fine, or with\nboth:\n1\n[Provided that the punishment for an offence committed in respect of any –\n(a)      canon, grenade, bomb or rocket; or\n(b)      light or heavy automatic weapon, rifle of .303 bore or over, musket of .410 bore\nor over a pistol or revolver of .441 bore or over, or ammunition which can be fired\nfrom such weapon, rifle, musket, pistol or revolver,\nShall be imprisonment for a term which is not less than one year.]"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Penalty for breach of rules: Any person violating any provision of any rule made under",
      "content": "this Ordinance for the violation of which no penalty is provided by this Ordinance, shall be punished\nwith fine which may extend to two hundred rupees."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Penalty for failure to give information under Section 23: Any person who in the",
      "content": "absence of reasonable excuse, the burden of proving which shall lie upon such person, fails to give\ninformation to the nearest police officer or magistrate in respect of any offence under sub-section (1) or\nsub-section (2) of section 23 of which he becomes aware or which he has reason to suspect, shall be\npunished with imprisonment for a term which may extend to six months, or with fine which may\nextend to Rs. 500 or with both."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Penalty for refusing or neglecting to produce arms: Any person refusing or neglecting",
      "content": "to produce any arms when so required under section 26 shall be punished with imprisonment for a term\nwhich may extend to one month or with fine which may extend to two hundred rupees, or with both.\n1Sub. By Act No. LXXX of 1976."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Power to confiscate: When any person is convicted of any offence punishable under this",
      "content": "Ordinance, committed by him in respect of any arms, ammunition or military stores, it shall be in the\ndiscretion of the committing Court or magistrate further to direct that the whole or any portion of such\narms, ammunition or military stores, and any vessel, vehicle or any other type of transport used to\nconvey the same, and any type of package or container in which the same may have been concealed,\ntogether with the other contents of such package or container shall be confiscated :\nProvided that where such conviction is in respect of an offence punishable under this Ordinance\nwith imprisonment for not less than twelve months, the Court or the magistrate convicting such person\nshall direct that the whole or any portion of such arms, ammunition or military stores shall be\nconfiscated."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Search and seizure by magistrate: Whenever any magistrate or an officer incharge of a",
      "content": "police station has reason to believe that any person residing within the local limits of his jurisdiction-\n(a)    has in his possession any arms, ammunition or military stores for any unlawful\npurpose ; or\n(b)    that such person cannot be left in the possession of any such arms, ammunition or\nmilitary stores without danger to the public peace;\nsuch magistrate or such police officer having first recorded the grounds of his belief, may cause a\nsearch to be made of the house or premises occupied by such person or in which such magistrate or\nsuch police officer has reason to believe such arms, ammunition or military stores are or is to be found,\nand may seize and detain the same, although covered by licence or exemption, in safe custody for such\ntime as he thinks necessary."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Seizure end detention by Government: Government may at any time order or cause to",
      "content": "be seized any arms, ammunition or military stores in the possession of any person, notwithstanding that\nsuch person is lawfully entitled to possess the same, and may detain the same for such time as it thinks\nnecessary for the public safety."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Information be given regarding offences: (1) Every person aware of the commission of",
      "content": "any offence punishable under this Ordinance shall in the absence or reasonable excuse, the burden of\nproving which shall lie upon such person, give information of the same to the nearest police officer or\nmagistrate.\n(2) Every person employed upon any railway or by any public carrier shall, in the absence of\nreasonable excuse, the burden of proving which shall lie upon such person, give information to the\nnearest police officer or magistrate regarding any package or container in transit which he may have\nreason to suspect contains arms, ammunition or military stores in respect of which an offence against\nthis Ordinance has been or is being committed."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Searches in the case of offences how conducted: When a search is to be made for any",
      "content": "of the purposes of this Ordinance, such search shall be made under the provisions of the Code of\nCriminal Procedure 1898 (Act V of 1898)."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Operation of other laws not barred: Nothing in this Ordinance shall be deemed to",
      "content": "prevent any person from being prosecuted under any other law for any act or omission which constitutes\nan offence against this Ordinance or the rules or from being liable under such other law to any higher\npunishment or penalty than that provided by this Ordinance:\nProvided that no person shall be punished twice for the same offence."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Power to take census of arms",
      "content": "_(1) Government may, from time to time, by\nnotification in the official Gazette, direct a census to be taken of any arms in any area, and empower any\nperson by name or in virtue of his office or take such census.\n(2) On the issue of any such notification, all persons possessing any such arms in such area shall\nfurnish to the person so empowered such information as he may require in reference thereto, and shall\nproduce such arms to him if he so requires."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Power to exempt: 1[Federal Government] may, from time to time, by notification in the",
      "content": "official Gazette, or in exceptional circumstances by a written order, exempt any person by name or in\nvirtue of his office, or any class of persons, or exclude any description of arms, ammunition or military\nstores, or withdraw any part of the Province from the operation of any prohibition or direction contained\nin this Ordinance."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Notice and limitation of proceedings: No suit, prosecution or other proceeding shall lie",
      "content": "against any person for anything which is in good faith done or intended to be done in pursuance of this\nOrdinance."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Repeal: The Arms Act 1878 (XI of 1878), as in force in the Province of West Pakistan,",
      "content": "together with all enactments amending or modifying the same, except the provisions thereof relating to\nmanufacture (including conversion), export or import of arms, ammunition and military stores, is hereby\nrepealed.\n1Subs. by Act No. XXXVIII of 1975, for “Government”.\n_______"
    }
  ],
  "definitions": []
}
