{
  "id": "pk-pakistan-atomic-energy-commission-ordinance-paec-1965",
  "type": "statute",
  "title": "Pakistan Atomic Energy Commission Ordinance (PAEC), 1965",
  "title_en": "Pakistan Atomic Energy Commission Ordinance (PAEC), 1965",
  "short_name": "PAECO",
  "status": "in_force",
  "issued_date": "1965-05-28",
  "in_force_date": "1965-05-28",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJ%2Bb-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Atomic Energy Commission Ordinance (PAEC), 1965 (XVII of 1965) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Dissolution of Pakistan Atomic Energy Council, etc",
      "content": "1ORDINANCE No. XVII OF 1965.\n[29th May, 1965]\nAn Ordinance to provide for the establishment of an Atomic Energy Commission.\nWHEREAS it is expedient to provide for the establishment of an Atomic Energy Commission\nfor the promotion of the peaceful uses of atomic energy in Pakistan, the discharge of international\nobligations connected therewith, the execution of development projects involving nuclear power\nstations an matters incidental thereto;\nAND WHEREAS the National Assembly is not in session and the President is satisfied that\ncircumstances exist which render immediate legislation necessary;\nNOW, THEREFORE, in exercise of the powers conferred by clause (1) of Article 29 of the\nConstitution and of all other powers enabling him in that behalf, the President is pleased to make and\npromulgate the following Ordinance :―"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Ordinance may be called the Pakistan",
      "content": "Atomic Energy Commission Ordinance, 1965.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or",
      "content": "context,—\n(1) “Atomic energy” means the energy or ionizing radiations released in any process which\ninvolves transformation of, or reaction between atomic nuclear and includes energy liberated as a result\nof the fission of special nuclear material of fusion or atomic unclei :\n(2)           “ Chairman “ means the Chairman of the Commission ;\n(3)           “Commission “ means the Pakistan Atomic Energy Commission established or deemed\nto be established under section 3 ;\n(4)           “ prescribed “ means prescribed by rules made under this Ordinance ;\n(5)           “special nuclear material” means plutonium – 239. Uranium - 235, or uranium - 233 or\nany other material which the Commission determines to be capable of releasing energy\nthrough fission.\n1\nApproved by the National Assembly on 21st July, 1965, see Gaz. of P., 1965, Ext., p. 596."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Commission. (1) As soon as may be after the commencement of",
      "content": "this Ordinance, the 1[Federal Government] shall establish, in accordance with the provisions of this\nOrdinance, a Commission to be called the Pakistan Atomic Energy Commission.\n(2) The Commission shall be a body corporate by the name of the Pakistan Atomic Energy\nCommission, having perpetual succession and a common seal, with power, subject to the provisions\nof Ordinance, to acquire and hold property, both movable and immovable, and shall by the said name\nsue and be sued.\n(3) The headquarters of the Commission shall be at Islamabad.\n2\n*      *                    *                          *                    *                     *              *\n3\n[3A Employment under Commission to be employment under Federal Government. Every\nemployment under the commission shall, for the purposes of the Pakistan Essential Services\n(Maintenance) Act, 1952 (LIII of 1952), be deemed to be employment under the Federal Government\nand the said Act shall have effect accordingly."
    },
    {
      "provision_ref": "sec3b",
      "section": "3B",
      "title": "Section 3B. 4[Act IV of 2008 not to apply to Commission]. Nothing contained in the Industrial",
      "content": "Relations 4[Act 2008 (Act IV of 2008)] shall apply to or in relation to the Commission or any of the\nofficers, advisers and employees appointed by it].\n1\nSub. by the Pakistan Atomic Energy commission (Amdt.) Act, 1974 (16 of 1974), s. 2. for “Central Government”.\n2\nSub-section (4) omitted by the Federal Laws (Revision and Declaration) ordinance, 1981 (27 of 1981) s. 3 and Sch. II.\n3\nAdded by Act 16 of 1974 s. 3,\n4\nSub. by the Pakistan Atomic Energy commission (Amdt.) Act. 2010 (21 of 2010), s. 2."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Composition of the Commission. (1) The Commission shall consist of the following",
      "content": "members1 to be appointed by the 2[Federal Government], namely :\nFull-time members\n(a)           a Chairman ;\n3\n** *\n(b)            a Finance member, being representative of the Ministry of Finance,\nGovernment of Pakistan; and\n4              5\n[(c)       [Seven] technical members of whom one may be a Member for\nAdministration ; and]\n5* * *\n4\n[(d)       *                  *                   *                    *                     *     *\n(e)            *          *       *                   *                    *                     *     *\n(f)            *          *       *                   *                    *                     *     *\n(2) The Chairman 3* * * and other members of the Commission 3* * * * shall be appointed\n7\nby the [Federal Government].\n(3) The Chairman shall be the chief executive officer of the Commission, and 3* * * the other\nmembers, except the Finance member, shall perform such functions as the Commission may assign to\nthem from time to time.\n(4) The Finance member shall exercise such powers and discharge such duties as may be\nprescribed.\n5\n[(5) Notwithstanding the composition of the Board prescribed in subsection (1), the Federal\nGovernment may increase or decrease the number of members of the Commission and prescribe the\nqualifications and mode of appointment in such manner as it may deem appropriate.]"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Term of office of members etc. (1) Save as hereinafter provided, a member of the",
      "content": "Commission 3* * * * * shall hold office for a period of three years from the date of his appointment\nand shall be eligible for re-appointment for such further period or periods, not exceeding three years\nat any one time, as the 6[Federal Government] may deem fit.\n(2) Where a person is appointed to be a member of the Commission by virtue of his holding an\noffice or appointment he shall cease to be such member when he ceases to hold that office or\nappointment.\n1\nMembers of the Commission have been appointed vide S.R.O. 661 (K)/65, see Gaz. of P., 1965, Pt. I, p. 569.\n2\nSubs. by the Pakistan Atomic Energy Commission (Amdt.) Act, 1974 (16 of 1974) s. 2. for “Central Government”.\n3\nOmitted by Ord. 12 of 2001, ss 2&3.\n4\nSubs. by Act. 16 of 1974 s. 4 for clause “c”.\n5\nSubs.omitted and add by the Pakistan Atomic Energy Commission (Amdt.) Act, 2010 (21 of 2010) s.3.\n7\nSubs. Ibid., s. 2 for “Central Government”.\n(3) A person appointed to be a member of the Commission may at any time resign his office\nby letter addressed to the Chairman:\nProvided that no resignation shall take effect until it has been accepted by the 1[Federal\nGovernment].\n(4) A vacancy caused by resignation or any other reason shall be filled by the appointment of\na person qualified to fill such vacancy.\n(5) The 1[Federal Government] may at any time terminate the appointment of the Chairman\n2\n* * *or any other member of the Commission 2* * * without assigning any reason.\n(6) No act or proceeding of the Commission shall be invalid merely on the ground of the\nexistence of a vacancy in, or defect in the constitution of, the Commission."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Functions of the Commission. (1) The functions of the Commission shall be to do all",
      "content": "acts and things, including research work, necessary for the promotion of the peaceful uses of atomic\nenergy in the fields of agriculture, medicine and industry and for the execution of development projects\ninvolving nuclear power stations and the generation of electric power thereat.\n(2) The Commission may, on behalf of the 3[Federal Government] or, with the approval of the\n3\n[Federal Government], on behalf of a Provincial Government perform such other functions relating\nto the peaceful uses of atomic energy, and on such terms and conditions, as may be agreed upon\nbetween the Commission and such Government.\n4\n[(2A) Notwithstanding anything contained in the regulation of Mines and Oil-fields andMineral\nDevelopment (Government Control) Act, the powers of the Federal Government under that Act (XXIV\nof 1948), shall, in relation to mines of nuclear substances and development of such substances be\nexercisable by the Commission.\nExplanation. In this sub-section, “nuclear substance” means any substance or material which\nthe Commission determines as being a substance or material which is or may be used for the production\nof or use in, atomic energy or for research into matters connected therewith, and includes all substances\nobtained or obtainable from the soil by underground or surface working which are radioactive.]\n(3) In the performance of its functions, the Commission shall be guided on questions of policy\nby the instructions, if any, given to it by the 1[Federal Government] which shall be the sole judge as to\nwhether a question is a question of policy.\n1\nSubs. by the Pakistan Atomic Energy Commission (Amdt.) Act, 1974 (16 of 1974), s. 2 for “Central Government,”.\n2\nOmitted by Ord. 12 of 2001, s. 3.\n3\nSubs. by Act (16 of 1974), s. 2, for Central Government.\n4\nIns ibid., s. 5.\n(4) The Commission shall, in order to carry out any functions under sub-section (1) or sub-\nsection (2),\n(a)        prepare and submit for the approval of the 1[Federal Government] proposals,\nschemes or projects in such form as may be indicated by the 1[Federal\nGovernment] or, where the functions are to be performed on behalf of a\nProvincial Government, by that Government ; and\n(b)        proceed to give effect to a proposal, scheme or project as approved by the\n1\n[Federal Government]."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Meetings of the Commission, etc. (1) Save as hereinafter provided, the Commission",
      "content": "shall regulate the procedure for its meetings.\n(2) Meetings of the Commission shall be called by the Chairman on such date and at such time\nand place as may be specified by him:\nProvided that\n(i)    not less than four meetings shall be held every year, and\n(ii)       at least eight days' notice shall be given to the members specifying the date,\ntime and place of the meeting.\n(3) The annual report and the accounts of the Commission for every financial year shall be\nsubmitted at a meeting of the Commission to be held within six months of the close of that year for\nadoption and record subject to such reservations as the Commission may make.\n(4) To constitute a quorum at a meeting of the Commission, not less than four members,\nincluding the Chairman, shall be present.\n(5) All meetings of the Commission shall be presided over by the Chairman, and, in the\nabsence of the Chairman, 2* * * * * * * by a member of the Commission authorised in writing bythe\nChairman ; and in the absence of such authorization or of the member so authorized, by a member\nelected for the purpose by the members present.\n(6) Subject to such rules as the 1[Federal Government] may make regarding matters having\nfinancial implications, all questions at a meeting of the Commission shall be decided by a majority of\nthe members present and voting, and in case of equality of votes, the person presiding shall have and\nexercise a second or casting vote.\n(7) Any business which it may be necessary for the Commission to transact may be transacted\nby circulation among all its members, and any proposal so circulated and approved by a majority of\nthe members shall be as effectual and binding as if such proposal had been passed at a regular meeting\nof the Commission.\n1\nSubs. by the Pakistan Atomic energy commission (Amdt.) Act, 1974 (16 of 1974), s. 2, for “Central Government”.\n2\nOmitted and Subs. by Ord. 12 of 2001, s. 5.\n1[7A. Standing bodies and committees. The commission may from time to time appoint such\nstanding bodies or committees from amongst its members as it may consider necessary to assist it in\nthe performance of its functions and to discharge such of its functions as it may assign to them.]\n2\n*     *          *          *          *          *          *\n2\n*     *          *          *          *          *          *"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Funds of the Commission. (1) The funds of the Commission shall comprise―",
      "content": "(a)       funds of the Pakistan Atomic Energy Council which stand transferred to the\nCommission under section 23 ;\n(b)       grants from the 3[Federal] and Provincial Governments;\n(c)       donations and endowments ;\n(d)       income from investments and royalties ; and\n(e)       receipts of the Commission from such other sources as may be approved by\nthe Commission.\n(2) The Commission may open a deposit account with the State Bank of Pakistan or with any\nAgency of the State Bank other than a Government Treasury or, with the approval of the 4[Federal\nGovernment], with any other bank.\n(3) The accounts of the Commission shall be audited by the 5[Auditor-General] of Pakistan,\nand shall be maintained, and presented for audit, in such form and manner as may be prescribed."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Budget. The Commission shall, by such date in each year as may be prescribed, submit",
      "content": "to the 4[Federal Government] for approval, a budget in the prescribed form for each financial year\nshowing the estimated receipts and expenditure and the sums which are likely to be required from the\n4\n[Federal Government] during that financial year."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Delegation of powers. The Commission may, by general or special order in writing, direct",
      "content": "that such of its powers shall, in such circumstances and under such conditions, if any, as may be\nspecified in the order be exercisable also by the Chairman 6[the Deputy Chairman], or by such member\nor officer of the Commission as may be so specified."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Appointment of officers, etc. (1) The Commission may, subject to the provisions of",
      "content": "sub-section (2) and such general or special orders as the 4[Federal Government] may give it from time\nto time, appoint such officers, advisers and employees as it considers necessary for the efficient\nperformance of its functions on such terms and conditions as it may deem fit.\n(2) The 4[Federal Government] may direct the Commission to dispense with the services of\nany officer, adviser or employee and when so directed the Commission shall dispense with his services.\n1\nIns. ibid., by the Pakistan Atomic Energy Commission (Amdt.) Act, 1974 (16 of 1974), s. 6\n2\nOmitted by the Pakistan Atomic Energy Commission (Amdt.) Act, 2010 (21 of 2010) s.4.\n3\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central”.\n4\nSubs. by the Pakistan Atomic Energy Commission (Amdt.) Act, 1974 (16 of 1974), s. 2, for “Central Government”.\n5\nSubs. by Act 16 of 1974, s. 2, for “Comptroller and Auditor General”.\n6\nIns. by the Pakistan Atomic Energy Commission (Amdt.) Ordinance, 1979 (65 of 1979), s. 5."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Co",
      "content": "operation with international organizations, etc. The Commission may, subject to the\nprior approval of the 1[Federal Government], co-operate with any foreign national authority or\ninternational organization in respect of the peaceful uses of atomic energy pursuant to the express\nterms and conditions of any programme or agreement for co-operation to which such authority or\norganization is a party or pursuant to any other international arrangement made before or after the\ncommencement of this Ordinance."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Submission of periodical reports, etc. The Commission shall submit to the 1[Federal",
      "content": "Government] at such time and at such intervals as the 1[Federal Government] may specify—\n(a)       such periodical reports and summaries as may be required by the 1[Federal\nGovernment];\n(b)        annual reports on the Head-office and the different research centres, power\nstations and projects ;\n(c)        such periodical returns, accounts statements and statistics as may be required\nby the 1[Federal Government] ;\n(d)        information and comments asked for by the 1[Federal Government] on any\nspecific point;\n(e)        copies of the documents required by the 1[Federal Government] ; and\n(f)        original documents required by the 1[Federal Government] for examination or\nany other purpose."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Directives from the 1[Federal Government]. The 1[Federal Government] may, from time",
      "content": "to time, issue to the Commission such directives and orders as it may consider necessary for carrying\nout the purposes of this Ordinance and the Commission shall follow and carry out such directives and\norders."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Discoveries and inventions to vest in the Commission. All rights relating to discoveries",
      "content": "and inventions and any improvement in materials, methods, processes, apparatus or equipment made\nby any officer or employee of the Commission in the course of his employment shall vest in the\nCommission."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Declaration of fidelity and secrecy. Every member, adviser, officer or other employee of",
      "content": "the Commission shall make such declaration of fidelity and secrecy as may be prescribed."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Power to make rules. The 1[Federal Government] may, by notification in the official",
      "content": "Gazette, make rule to carry out the purposes of this Ordinance.\n1\nSubs. by the Pakistan Atomic Energy Commission (Amdt.) Act, 1974 (16 of 1974), s. 2, for “Central Government”."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Power to make regulations. The Commission may, with the previous sanction of the",
      "content": "1\n[Federal Government], make such regulations, not inconsistent with this Ordinance or the rules made\nthereunder, as may, in its opinion, be necessary or expedient for the achievement of its aims and\nobjects and for the performance of its functions."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Continuance of certain rules, etc. All rules, regulations, and bye",
      "content": "laws of the Pakistan\nAtomic Energy Council registered under the Societies Registration Act, 1860 (XXI of 1860), and in\nforce immediately before the commencement of this Ordinance, shall, mutatis mutandis, and so far\nas they are not inconsistent with any of the provisions of this Ordinance continue in force until repealed\nor altered by rules or regulations, made under this Ordinance."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Winding up. No provision of law relating to the winding up of bodies corporate shall apply",
      "content": "to the Commission, and the Commission shall not be wound up except by order of the 1[Federal\nGovernment], and in such manner as the 1[Federal Government] may direct."
    }
  ],
  "definitions": []
}
