{
  "id": "pk-pakistan-bait-ul-maal-act-1991",
  "type": "statute",
  "title": "Pakistan Bait-ul-Maal Act, 1991",
  "title_en": "Pakistan Bait-ul-Maal Act, 1991",
  "short_name": "PBA",
  "status": "in_force",
  "issued_date": "1992-01-05",
  "in_force_date": "1992-01-05",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5dj-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Bait-ul-Maal Act, 1991 (I of 1992) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Act may be called the Pakistan\nBait-ul-Mal Act, 1991.\n(2) It shall extend to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "_\n(a)         “Bait-ul-Mal” means the welfare fund to be called Bait-ul-Mal, established\nunder section 3;\n(b)         “Board” means the 2[Bait-ul-Mal Board] constituted under section 5 for the\nadministration of the Bait-ul-Mal;\n(c)         2\n[Chairperson (Ameen)] means the Chairman (Ameen) of the Board;\n2[(ca)      “employee” means an officer, servant, expert, consultant or adviser\nappointed under section 15;\n(cb)        “Managing Director” means the Managing Director of the Board;]\n(d)         “Member” means a member of the Board; and\n(e)         “Prescribed” means prescribed by rules made under this Act.\n_________\n1\nThe Pakistan Bait-ul-Mal Act 1991 (I of 1992) shall apply to the Federally Administered Tribal Areas, Vide S.R.O. No. 608 (I)/94, dt. 13-6-94\n2\nSubs. and ins. by Ord. 90 of 2002, ss. 2 & 3."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of Bait",
      "content": "ul-Mal.___(1)The Federal Government shall establish a fund to be\nknown as Bait-ul-Mal.\n(2) The Bait-ul-Mal shall be financed from the following sources, namely:___\n(a)    transfer of receipts from tax levied for this purpose;\n(b)    grants from the Federal Government, Provincial Government, local\nauthorities, national organizations and international agencies;\n(c)    voluntary donations, including sadqat and atiyyat by individuals, societies,\nbodies, institutions or organizations; and\n(d)    sale of property of the Bait-ul-Mal, whether movable or immovable, and\nincome from such property, investments and other assets.\n(3) In determining the tax liability of an assessee for an assessment year under the Income\nTax Ordinance, 1979 (XXXI of 1979), his taxable income shall be reduced by the amount paid by\nhim as donation under clause (c) of sub-section (2)."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Administration of Bait",
      "content": "ul-Mal. The Bait-ul-Mal shall be administered by the Board and\nthe moneys in the Bait-ul-Mal shall be utilized for the following purposes namely:___\n(a)    to provide financial assistance to destitute and needy widows, orphans, invalid,\ninfirm and other needy persons;\n(b)    for rendering help for rehabilitation of persons specified in clause (a) in\nvarious professions or vocations ;\n(c)    to provide assistance to the children of the persons specified in clause (a)\nfor educational pursuits ;\n(d)    to provide residential accommodation and necessary facilities to the persons\nspecified in clause (a);\n(e)    to provide for free medical treatment for indigent sick persons and to set up\nfree hospitals, poor houses and rehabilitation centers and to give financial aid\nto charitable institutions, including industrial homes and other educational\ninstitutions established specially for the poor and needy ;\n(f)    to provide stipends to educated youth during their training before their\nemployment in jobs;\n(g)    to provide stipends and financial assistance to brilliant but poor students who\ncannot afford to acquire higher technical or medical education abroad for lack\nof money ;\n(h)         to sponsor and promote self-employment scheme; 1[*]\n1\n[(i)    to provide for rehabilitation services and to establish rehabilitation centres for\nthe rehabilitation of disabled children; and]\n1\n[(j)]   any other purpose approved by the Board having regard to the aims and objects\nof the Bait-ul-Mal.\n__________\n2[CHAPTER III"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Constitution of the Bait",
      "content": "ul-Mal Board.___(1) The Federal Government shall, by\nnotification in the official Gazette, constitute a Bait-ul-Mal Board for administration of the\nBait-ul-Mal.\n(2) The Board shall consist of___\n3\n[(i)    Secretary, Government of Pakistan, of the controlling Ministry or Division,\nunder the Rules of Business, 1973, who shall be its ex-officio Chairperson;]\n(ii)        Managing Director, Bait-ul-Mal;\n(iii)       at least five non-official Members to be appointed by the Federal Government\none each from the Provinces and one to represent Islamabad Capital Territory,\nNorthern Areas or Azad Jammu and Kashmir:\nProvided that at least one of the non-official Members shall be a woman;\n3\n[(iv) a representative of the Ministry of Religious Affairs and Inerfaith Harmony;]\n3\n[(v)    a representative of the National Database Registration Authority; and]\n(vi)        a representative of the Federal Ministry of Finance."
    },
    {
      "provision_ref": "sec5a",
      "section": "5A",
      "title": "Section 5A. Functions of the Bait",
      "content": "ul-Mal Board. The Board shall perform the following\nfunctions, namely,___\n(a)     Policy formulation;\n(b)         Planning, including consideration and approval of annual plan of work and\nbudget;\n1\nOmitted, ins. and re-numbered. by Act, (XVII of 2018), s.2.\n2\nSubs. by Ord. 90 of 02, ss. 4 and 5.\n3\nSubs. by Act XIX of 2016, s.2.\n(c)     consideration of audit statement of accounts;\n(d)     to receive progress reports;\n(e)     to ensure implementation of approved plan, programmes, budget and ensure\ntransparent and accountable administration;\n(f)     co-ordination with poverty alleviation programmes of the Government in\npublic and private sectors; and\n(g)     any other functions as may be prescribed.\n__________"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Selection criteria for non",
      "content": "official Members. The non-official Members shall be appointed\nfrom amongst the ulema, social workers, jurists, elected representatives and persons well-versed in\nIslamic law and jurisprudence and the persons who enjoy good reputation for their honesty, integrity\nand devotion to Islamic ideology and who genuinely believe in, and practice, moral values as enjoined\nby the injunctions of Islam as laid down in the Holy Quran and Sunnah."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Terms and conditions of office of non",
      "content": "official Members. ___(1) The non-official\nMembers shall hold office during the pleasure of the Federal Government.\n(2) The non-official Members shall not draw any salary, but shall be entitled to such facilities\nand privileges as may be prescribed from time to time.\n(3) Subject to sub-section (4), a non-official Member may, by writing under his hand\naddressed to the Federal Government through the Chairman, resign his office.\n(4) The resignation tendered by a non-official Member shall not take effect until accepted by\nthe Federal Government."
    },
    {
      "provision_ref": "sec7a",
      "section": "7A",
      "title": "Section 7A. Acting Chairperson (Ameen). At any time when the office of Chairperson (Ameen) is",
      "content": "vacant the senior most member in age shall, for a period not exceeding sixty days temporarily\nperform the functions of the Chairperson (Ameen).]\n_________\nOATH OF OFFICE BY CHAIRMAN, MEMBERS"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Oath of office, etc.",
      "content": "_(1) Before entering upon office, the Chairman (Ameen) and a\nnon-official Member of Board shall take and sign an oath in the form appended to this Act.\n(2) Every officer and servant of the Board shall be required to take an oath in the form\nto be prescribed by the Board.\n(3) The written and signed oaths shall be placed on the personal files of the officers and\nservants maintained in this behalf.\n__________\n1[CHAPTER VI"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Appointment and powers of the Managing Director",
      "content": "_(1) There shall be a Managing\nDirector of the Board who shall be appointed by the Federal Government.\n(2) The Managing Director shall exercise all administrative and financial powers of the\nBait-ul-Mal under this Act:\nProvided that every appointment made or administrative or financial powers exercised by\nthe Managing Director shall be reported to the Board, without unnecessary delay, for its information.]\n___________"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Incorporation of Bait",
      "content": "ul-Mal. The Bait-ul-Mal shall be a body corporate, shall be\nentitled to acquire and hold property, shall have perpetual succession and a common seal and shall\nbe the said name sue and be sued."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Administrative control over the Board. The Board shall be under the direct",
      "content": "administrative control of 2[controlling Ministry or Division under the Rules of Business, 1973].\n.\n_________"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Conduct of Business of the Board",
      "content": "_(1) The Board shall have the powers to conduct\nits business and regulate its proceedings as may be prescribed by it, from time to time.\n1Subs. by Ord. 90 of 02. ss. 6 & 7.\n2Subs. by Act XIX of 2016, s.3.\n(2) For the smooth conduct of its business, the Board may appoint such provincial, Divisional,\nDistrict or other special Committees or sub-committees consisting of such members as may be\nprescribed by it, from time to time."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Meeting of the Board",
      "content": "_(1) The Board shall meet at such time and place and in\nsuch manner as may be prescribed by regulations:\nProvided that until regulations are made in this behalf, such meetings shall be convened by\nthe Chairman (Ameen).\n(2) The Chairman (Ameen) and five members, or in his absence, not less than six Members\nshall be present to constitute a quorum at a meeting of the Board:\nProvided that if a meeting of the Board is not held for want of the required quorum, it will be\npostponed to a subsequent date and the postponed meeting may be held without the required quorum,\nbut written notice to this effect shall be sent to all Members of the Board.\n(3) During the absence abroad or on leave of the Chairman (Ameen) he may nominate a\nMember convene and preside over the meetings of the Board to dispose of urgent business.\n________"
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Employment of officers and servants. The Board may, as the case may be, employ such",
      "content": "officers and servants or appoint such experts, consultants or advisers, from time to time as it may\nconsider necessary for the performance of its functions, on such terms and conditions as it may deem\nfit."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Recruitment and terms and conditions of service and disciplinary powers. The Board",
      "content": "shall prescribe the procedure for appointment and terms and conditions of service for its officers and\nservants, and shall be competent to take disciplinary action against them.\n________"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Maintenance of Accounts. The Board shall maintain complete and accurate books of",
      "content": "accounts in connection with the discharge of its responsibilities and those delegated by it to its officers\nand staff, as may be prescribed."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Audit.___(1) The Accounts of Bait",
      "content": "ul-Mal shall be audited every year by the Auditor\nGeneral of Pakistan in such manner as may be prescribed by the Federal Government.\n(2) A copy of the Audit Report shall be sent to the Board for comments and remedial action."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Annual Statement of Accounts. In the month of January each year, the Board shall",
      "content": "submit to the Federal Government, for approval, a statement of estimated receipts and expenditures\nin respect of the next financial year."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Submission of Annual Reports and Statements etc. Annual Report",
      "content": "_(1) As soon\nas possible, the Board shall submit to the Federal Government, after the end of every financial year\nbut before the last day of September next following, a report on the conduct of its affairs during the\nyear.\n(2) A copy of the report referred to in sub-section (1) together with a copy of the audit report\nreferred to in section 18 shall be placed by the Federal Government before the National Assembly.\n(3) The Federal Government may call upon the Board to supply any information or statements\npertaining to its responsibilities under this Act, and the Board shall comply with such requirements,\nwithout unnecessary delay.\n________"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Immunity",
      "content": "_(1) The Chairman (Ameen), Members/ officers, and servants of the Board\nshall, when acting or purporting to Act, in pursuance of any of the provisions of this Act, be deemed\nto be public servants within the meaning of section 21 of the Pakistan Penal Code."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Delegation. After the Board has been constituted, it may, by general or special order,",
      "content": "delegate to the Chairman, Member or an officer of the Board, any of its powers, duties or functions,\nunder this Act, subject to such conditions as it may think fit to impose."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Regulations. The Board may, with the approval of the Federal Government, make",
      "content": "regulations not inconsistent with rules for conduct of its business and its meetings.\n___________\nFORM\n(See section 8)\n(In the name of Allah, the most Beneficent and most Merciful)\nI, _____________________________, do solemnly swear that I shall bear true faith and\nallegiance to Pakistan:\nThat as Chairman (Ameen)/Member of the Board of Management of Bait-ul-Mal, I will\ndischarge my duties and perform my functions honestly, faithfully and to the best of my ability, in\naccordance with the laws of the Islamic Republic of Pakistan, and without fear or favour, affection\nor ill­will;\nThat I will allow no personal interest to influence my official conduct or my official decisions.\nThat I shall do my best to discharge my responsibilities in the best interest of Pakistan, with\na view to carrying out the aims and objects for which the Bait-ul-Mal has been set up.\nThat I will not directly or indirectly communicate or reveal to any person any matter which\nwill come to my notice for consideration as Chairman (Ameen) /Member of the Board of\nManagement of the Bait-ul-Mal.\nMay Allah Almighty help and guide me (A’meen).\n______________\n(Signature)\n__________"
    }
  ],
  "definitions": [
    {
      "term": "Bait-ul-Mal",
      "definition": "the welfare fund to be called Bait-ul-Mal, established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the 2[Bait-ul-Mal Board] constituted under section 5 for the administration of the Bait-ul-Mal; (c) 2 [Chairperson (Ameen)] means the Chairman (Ameen) of the Board; 2[(ca) “employee” means an officer, servant, expert, consultant or adviser appointed under section 15;",
      "source_provision": "sec2"
    },
    {
      "term": "Managing Director",
      "definition": "the Managing Director of the Board;]",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "a member of the Board; and",
      "source_provision": "sec2"
    },
    {
      "term": "Prescribed",
      "definition": "prescribed by rules made under this Act. _________ 1 The Pakistan Bait-ul-Mal Act 1991 (I of 1992) shall apply to the Federally Administered Tribal Areas, Vide S.R.O. No. 608 (I)/94, dt. 13-6-94 2 Subs. and ins. by Ord. 90 of 2002, ss. 2 & 3.",
      "source_provision": "sec2"
    }
  ]
}
