{
  "id": "pk-pakistan-banking-prevention-of-default-and-evasion-of-labilities-ordinance-1947",
  "type": "statute",
  "title": "Pakistan Banking (Prevention of Default and Evasion of labilities) Ordinance, 1947",
  "title_en": "Pakistan Banking (Prevention of Default and Evasion of labilities) Ordinance, 1947",
  "short_name": "PBODA",
  "status": "in_force",
  "issued_date": "1947-12-14",
  "in_force_date": "1947-12-14",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-a5aUag%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Banking (Prevention of Default and Evasion of labilities) Ordinance, 1947 (V of 1947) published by The Pakistan Code (Banking/Financial Laws).",
  "provisions": [
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Powers to make rules",
      "content": "THE PAKISTAN BANKING (PREVENTION OF DEFAULT AND EVASION\nOF LIABILITIES) ORDINANCE, 1947\n1\nORDINANCE NO. V OF 1947\n[15th December, 1947]\nAN\nto provide for prevention of loss to people in Pakistan from the withholding of payments of cheques\nand delivery of things held in safe custody by banks acting under directions issued by a Government\nor authority outside Pakistan.\nWHEREAS an emergency has arisen which requires measures to be taken to prevent banking\nconcerns in Pakistan from making default in meeting their commitments and liabilities under external\npressure.\nNow, THEREFORE, in exercise of the powers conferred by section 42 of the Government of\nIndia Act, 1935, as adapted by the Pakistan (Provisional Constitution) Order 1947, the Governor-\nGeneral of Pakistan is pleased to make and promulgate the following Ordinance:___"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Ordinance may be called the Pakistan\nBanking (Prevention of Default and Evasion of Liabilities) Ordinance, 1947.\n2\n[(2) It extends to the whole of Pakistan.]\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance",
      "content": "_\n(a)        “Bank” means 3[the Imperial Bank of India and] any banking company as\ndefined in section 277F of the Indian Companies Act, 1913 (VII of 1913) and\nincludes any branch of a bank.\n(b)        “Manager” includes the term Agent or Sub-Agent and any other officer having\ncharge of any branch or agency of any bank in Pakistan.\n4\n(c)            [Federal Government] means the Government of Pakistan.\n1\nThe Ordinance has been applied to Baluchistan with effect from the 15th day of December, 1947, see Gaz. of P., 1952, Pt. I, p.154; and extended to the\nLeased Areas of Baluchistan, by the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950).\nIt has been applied also in the Federated Areas of Baluchistan, see Gaz. of P., 1953, Pt. 1, p. 152.\nIt has also been extended to__\n(i) the State of Bahawalpur, see the Bahawalpur (Extension of Laws) (Second) Order, 1952 (G. G. O. 5 of 1952) ;\n(ii) the Baluchistan States Union, by the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G. G. O. 4 of 1953); and\n(iii) the Khairpur State, see the Khairpur (Federal Laws) (Extension) Order, 1953 (G. G. O. 5 of 1953).\nThe Ordinance has been and shall be deemed to have been brought into force in Gwadur with effect from the 8th September, 1958, by the Gwadur\n(Application of Central Laws) Ordinance, 1960 (37 of 1960), s. 2.\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch., (with effect from the 14th October, 1955).\n3\nIns. by the Pakistan Banking (Prevention of Default and Evasion of Liabilities) (Amdt.), Ordinance, 1947 (6 of 1947), s. 2.\n4\nSubs. by F.A.O., 1975, Art. 2 and Table."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. No Bank to Stop payment of cheques or delivery of deposits under instructions from",
      "content": "any Government authority outside Pakistan. No Bank operating in Pakistan shall act on the\ninstructions of a Government or authority other than the Government of Pakistan issued to it direct or\nthrough its Head Office outside Pakistan, in regard to stopping of payment of cheques, delivery of\nsecurities or things held in safe custody, or in regard to any other banking business in Pakistan, without\nobtaining the prior approval in writing of an officer appointed by the 1[Federal Government] in this\nbehalf."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Procedure for demanding explanations and search",
      "content": "_(1) On receiving a complaint that a\nBank is wrongfully withholding the payment of a cheque or the delivery of anything held in deposit or\nsafe custody, the 1[Federal Government] may by order require the Bank to explain the grounds on\nwhich it has withheld or delayed payment of the cheque or delivery of the thing held in deposit or safe\ncustody and to furnish by a date to be specified a true statement of all the assets at the credit of or held\nin safe custody on behalf of the person concerned.\n(2) If the Bank refuses or fails to comply with an order made under sub-section (1) of this\nSection by the date specified or if the 1[Federal Government] is not satisfied with the correctness or\ncompleteness of the statement submitted thereunder, the 1[Federal Government] may authorise any\nofficer of the 1[Federal Government] or of a Provincial Government to inspect the books, accounts and\nother documents of the Bank and to conduct a search of its vaults, coffers and premises which the\nofficer may consider necessary to inspect or search in order to obtain the information required or to\nverify the statement furnished.\n(3) An officer authorised in this behalf may enter any premises at any time and if necessary\nbreak open any door or lock for the purpose of carrying out the order made under this section."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Order to prohibit removal of assets outside Pakistan. While ordering a Bank to furnish a",
      "content": "statement under Section 4, the 1[Federal Government] may order the Bank not to remove out of 2* * *\nPakistan any thing held in safe custody on behalf of the person referred to in sub-section (1) of section\n4 or any documents related thereto."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Seizure of assets",
      "content": "_(1) If the 1[Federal Government] after considering such explanation as\n(2) and (3) of Section 4 and such further enquiry as it may deem necessary, is satisfied that the Bank\nhas wrongfully withheld payment of a cheque wholly or partially or the delivery of anything held in\ndeposit or safe custody, the 1[Federal Government] may order the Bank to make payment of the cheque\nto such extent as in the opinion of the 1[Federal Government] payment has been wrongfully withheld,\nor make delivery of the thing held in deposit or safe custody as the case may be, by a specified date to\nthe person named in the order.\n(2) If the Bank fails to comply with the order made under sub-section (1) the 1[Federal\nGovernment] may as the case may be order___\n(a)        the seizing of the thing held in safe custody and its transfer to the person named\nin the order,\n1\nSubs. by F.A.O., 1975, Art. 2 and Table.\n2\nOmitted by A.O., 1961, Art. 2 and Sch., (with effect from the 23rd March, 1956.\n(b)        the seizing of assets of the Bank sufficient to cover the amount of the Bank’s\nliability as determined under sub-section (1) and the transfer to the person\nnamed in the order under sub-section (1) of such part of these assets or so much\nof their value on realization as will discharge the Bank’s liability to him.\n(3) If after discharging the liability of the Bank referred to in sub-section (2) above there is a\nsurplus it shall be returned to the Bank after deducting such incidental expenses as may have been\nincurred by the 2[Federal Government]."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Service of Orders under Section 4, 5 or 6. An order under Sections 4, 5 or 6 may be served",
      "content": "on the Manager by delivery at the office of the Bank. If service of the order is refused or any attempt\nis made to avoid it, the order may be affixed on the premises of the Bank in the presence of two\nwitnesses and the order shall then be deemed to have been duly served."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Penalties. If the Manager of a Bank",
      "content": "(a)        fails to comply with an order to furnish a statement under Section 4 or if he\nfurnishes a statement which he knows to be false in any material particular; or\n(b)        refuses to allow, or fails to afford, reasonable facilities to an Officer authorised\nunder Section 4; or\n(c)        having been served with or having knowledge or information of an order under\nSection 5 conceals, removes or allows to be removed out of 1* * * Pakistan in\ncontravention of that order anything held in deposit or safe custody; or\n(d)        fails to make payment or effect delivery by the specified date in compliance\nwith an order issued under Section 6 ;\nhe shall be punishable with imprisonment which may extend to three years or with fine or with both."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Withdrawal or amendment of orders under Sections 5 and 6. On sufficient cause being",
      "content": "shown the 2[Federal Government] may withdraw or amend all or any of the orders made under Sections\n5 and 6 of this Ordinance."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Bar of legal proceedings. No suit, prosecution or other legal proceedings shall lie against",
      "content": "any person or against the 2[Federal Government] for anything done or in good faith intended to be done\nunder this Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "Bank",
      "definition": "3[the Imperial Bank of India and] any banking company as defined in section 277F of the Indian Companies Act, 1913 (VII of 1913) and includes any branch of a bank.",
      "source_provision": "sec2"
    },
    {
      "term": "Manager",
      "definition": "the term Agent or Sub-Agent and any other officer having charge of any branch or agency of any bank in Pakistan. 4 (c) [Federal Government] means the Government of Pakistan. 1 The Ordinance has been applied to Baluchistan with effect from the 15th day of December, 1947, see Gaz. of P., 1952, Pt. I, p.154; and extended to the Leased Areas of Baluchistan, by the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950). It has been applied also in the Federated Areas of Baluchistan, see Gaz. of P., 1953, Pt. 1, p. 152. It has also been extended to__ (i) the State of Bahawalpur, see the Bahawalpur (Extension of Laws) (Second) Order, 1952 (G. G. O. 5 of 1952) ; (ii) the Baluchistan States Union, by the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G. G. O. 4 of 1953); and (iii) the Khairpur State, see the Khairpur (Federal Laws) (Extension) Order, 1953 (G. G. O. 5 of 1953). The Ordinance has been and shall be deemed to have been brought into force in Gwadur with effect from the 8th September, 1958, by the Gwadur (Application of Central Laws) Ordinance, 1960 (37 of 1960), s. 2. 2 Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch., (with effect from the 14th October, 1955). 3 Ins. by the Pakistan Banking (Prevention of Default and Evasion of Liabilities) (Amdt.), Ordinance, 1947 (6 of 1947), s. 2. 4 Subs. by F.A.O., 1975, Art. 2 and Table.",
      "source_provision": "sec2"
    }
  ]
}
