{
  "id": "pk-pakistan-banking-and-finance-services-commission-act-1992",
  "type": "statute",
  "title": "Pakistan Banking and Finance Services Commission Act, 1992",
  "title_en": "Pakistan Banking and Finance Services Commission Act, 1992",
  "short_name": "PBAFS",
  "status": "in_force",
  "issued_date": "1992-11-30",
  "in_force_date": "1992-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apmZag%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Banking and Finance Services Commission Act, 1992 (XIII of 1992) published by The Pakistan Code (Banking/Financial Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Act may be called the Pakistan Banking and\nFinance Services Commission Act, 1992.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(a)   “Commission” means the Pakistan Banking and Finance Services Commission\nestablished under section 3;\n(b) “financial institution” means an institution referred to in the Schedule;\n(c) “Member” means a member of the Commission;\n(d) “recruitment” means initial appointment otherwise than by promotion or transfer;\n(e) “rules” means rules made under section 14; and\n(f) “schedule” means the schedule to this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Commission",
      "content": "There shall be established for the purposes of this\nAct a Commission to be called the Pakistan Banking and Finance Services Commission and\nconsisting of a Chairman and not more than four members appointed by the Federal Government."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Salary, Allowances and privileges",
      "content": "The Chairman and the Members shall be entitled to\nsuch salary, allowances, and privileges as the Federal Government may determine from time to time."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Term of office",
      "content": "The Chairman and Members shall hold office for such term as may be\ndetermined by the Federal Government."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Resignation and filling of vacancies",
      "content": "(1) The Chairman or a member may, by writing\nunder his hand addressed to the Federal Government, resign his office.\n(2) Any vacancy occurring in the membership of the Commission due to death, resignation or\nremoval shall be filled by the appointment of another person by the Federal Government."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Functions of the Commission",
      "content": "The functions of the Commission shall be—\n(a)    to conduct open competitive examinations for recruitment to Grade III or\nhigher posts in the financial institutions;\n(b)    to conduct interviews and tests for recruitment to posts in grades higher than\nGrade III, except where such recruitment is excluded from the purview of the\nCommission by the Federal Government;\n(c)    to conduct tests for promotion of existing employees from lower cadres to\nGrade III and above, if so, required by a financial institution; and\n(d)    to advise the Federal Government on matters relating to qualifications for, and\nmethods of recruitment to, posts in Grade II or higher grades in the financial\ninstitutions, if so required by the Federal Government."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Recruitment to posts in financial Institutions",
      "content": "(1) Recruitment to all posts in Grade III\nor higher grades in a financial institution shall be made on the advice of the Commission:\nProvided that the Commission may, on the direction of the Federal Government, advise any\nfinancial institution for recruitment in any post or grade.\n(2) The Commission may exempt any professional or class of professionals, like engineers,\nlawyers and chartered accountants, from appearing in any written test or examination conducted by\nthe Commission.\n(3) A financial institution shall not disregard, or act contrary to the advice of the Commission\nwithout the prior approval of the Federal Government and where the Federal Government grants such\napproval it shall record its reasons for doing so."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Funds of the Commission",
      "content": "(1) There shall be constituted for the Commission a fund to\nwhich shall be credited all sums received under sub- section (2) and out of which shall be defrayed\nall expenditure incurred by the Commission, including expenditure on the emoluments of the\nChairman and members and the officers, employees, experts and consultants of the Commission.\n(2) Every financial institution shall make to the Commission such payments to defray its\nexpenses as the Commission may, with the approval of the Federal Government, demand."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Appointment of officers, employees, etc",
      "content": "For the efficient performance of its\nfunctions, the Commission may appoint its officers, employees experts, and consultants, on such\nterms and conditions as may be prescribed."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Report of the Commission",
      "content": "The Commission will submit to the President annually a\nreport on the work done by the Commission."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to amend Schedule",
      "content": "The Federal Government may, keeping in view the\npurposes of this Act, by notification in the official Gazette, amend the Schedule so as to add any\nentry thereto or omit or modify any entry therein."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Act to override other laws",
      "content": "The provisions of this Act shall have effect\nnotwithstanding anything contained in any other law, or in any instrument, deed or other document\nrelating to a financial institution."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Power to make rules",
      "content": "(1) The Commission may, with the approval of the Federal\nGovernment, by notification in the official Gazette, make rules for carrying out the purposes of this\nAct.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules\nmay provide for the appointment of officers, employees, experts and consultants and for the payment\nof travelling allowance and daily allowance to the Chairman, Members, officers and employees and\nother persons engaged by the Commission, in respect of journeys performed in connection with the\nfunctions assigned to them.\n___________\n1\n*     *           *          *          *          *           *"
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Agricultural Development Bank of Pakistan",
      "content": "3\n[21. Regional Development Finance Corporation."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. First Women Bank Limited.]",
      "content": "1\nEntry 1 omitted by S.R.O.No. 197(1)/95, dt.26-2-95\n2\nEntry 10 to 12 omitted by Finance Division’s Notification No.F-12(5) Banking III/91-774,dt.29-5-95, See Gaz. of Pak.Ext., Pt.III, dt. 3-8-95,\np.576.\n3\nAdded by Finance Division’s Notification No. F-9 (40) Banking III/88, dt. 26-9-93,see Gaz. of Pak., Ext., Pt.III."
    }
  ],
  "definitions": [
    {
      "term": "Commission",
      "definition": "the Pakistan Banking and Finance Services Commission established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "financial institution",
      "definition": "an institution referred to in the Schedule;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "a member of the Commission;",
      "source_provision": "sec2"
    },
    {
      "term": "recruitment",
      "definition": "initial appointment otherwise than by promotion or transfer;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under section 14; and",
      "source_provision": "sec2"
    },
    {
      "term": "schedule",
      "definition": "the schedule to this Act.",
      "source_provision": "sec2"
    }
  ]
}
