{
  "id": "pk-pakistan-broadcasting-corporation-act-1973",
  "type": "statute",
  "title": "Pakistan Broadcasting Corporation Act, 1973",
  "title_en": "Pakistan Broadcasting Corporation Act, 1973",
  "short_name": "PBCA",
  "status": "in_force",
  "issued_date": "1973-02-08",
  "in_force_date": "1973-02-08",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2ho-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Broadcasting Corporation Act, 1973 (XXXII of 1973) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Pakistan\nBroadcasting Corporation Act, 1973.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once and shall be deemed to have taken effect on the twentieth\nday of December, 1972."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(a)        “Board” means the Board of Directors of the Corporation;\n(b)        “Chairman” means the Chairman of the Board;\n(c)        “Corporation” means the Pakistan Broadcasting Corporation established under\nsection 3;\n1\n[ca    “division concerned” means the division to which business of the Corporation\nstands allocated;]\n2\n[(d)   “Member” means a Member of the Board;]\n(e)        “regulation” means a regulation made under this Act;\n(f)        “rule” means a rule made under this Act;\n1\n[(fa) “secretary” shall have the same meaning as assigned thereto in the Rules of\nBusiness, 1973;\n(fb)       “SOE Act” means the State-Owned Enterprises (Ġovernance and Operations)\nAct, 2023 (VII of 2023); and]\n(g)        “station” means any production, receiving, or transmitting unit, fixed or\nmobile.\n1\nIns. and added by Act No. VI of 2024, s. 2.\n2\nSubs. by Ord. No. XCIV of 2002, s.2."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the corporation",
      "content": "(1) As from the commencement of this Act, there\nshall be established a Corporation to be called the Pakistan Broadcasting Corporation.\n(2) The Corporation shall be a body corporate by the name of the Pakistan Broadcasting\nCorporation, having perpetual succession and a common seal, with power to hold and dispose of\nproperty, and shall by the said name sue and be sued.\n1\n[3A. Application of Act VII of 2023.—(1) The provisions of the State-Owned Enterprises\n(Governance and Operations) Act, 2023 (VII of 2023) shall apply to the Pakistan Broadcasting\nCorporation which shall be deemed to be a state-owned enterprises for the purposes of the said Act.\n(2) Where any inconsistency arises in a provision of the said Act and a provision of this Act\nfor the purpose of governance of the corporation as a state-owned enterprise, the provisions of the\nsaid Act shall prevail.]\n1\n[4. Board.—(1) The general direction and the administration of the Corporation shall vest in\na Board consisting of__\nS.                                              Membership                   Status\nNo.\n(1)                                                 (2)                         (3)\nA person to be appointed by the Federal Government from"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Additional Secretary Finance or in his absence his nominee not Member",
      "content": "below the rank of an officer in BPS-20 or equivalent\nDirector General, Inter-Services Public Relations (ISPR) or in"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. his absence his nominee not below the rank of an officer in BPS",
      "content": "Member\n20 or equivalent\nManaging Director, Pakistan Television Corporation or in his"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Director General cum",
      "content": "Secretary\nA representative of the Interior Division not below the rank of an"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Member",
      "content": "officer in BPS-20 or equivalent\nNine eminent independent members to be appointed by the Federal\nGovernment including not less than one from each province,"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Islamabad Capital Territory, Gilgit",
      "content": "Baltistan and Azad Jammu and Members\nKashmir\n1\nIns. and subs. by Act No. VI of 2024, ss. 2A-3.\n(2) The members, other than ex-officio members, shall hold office for a term of three years\nand shall be eligible for re-appointment but in no case for more than two consecutive terms and they\nmay, by writing under their hand addressed to the Federal Government by giving a notice of not less\nthan one month, resign their offices:\nProvided that the resignation shall not take effect until it has been accepted by the Federal\nGovernment.\n(3) In particular and without prejudice to the generality of the provisions of sub-section (1),\nthe Board shall have full powers with regard to―\n(a)         the preparation of the annual revenue budget of the Corporation and approval\nof the budget and expenditure not included in its annual budget for capital and\ndevelopment expenditure;\n(b)          the formulation and implementation of all programs and policies; and\n(c)         the making of plans for infrastructural and technological development within\nthe country and for promotion of the Corporation's interests, abroad.]"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. (1) The functions of the Corporation shall be",
      "content": "(a)        to provide broadcasting services for general reception in all parts of Pakistan\nand the territorial water thereof and on board ships and aircrafts (such services\nbeing hereafter referred to as Home Services) and in other countries and places\n(such services being hereafter referred to as External Services) for the\npurposes of disseminating information, education and entertainment through\nprogrammes which maintain a proper balance in their subject-matter and a\nhigh general standard of quality and morality;\n(b)        to broadcast such programmes as may promote Islamic ideology, national\nunity and principles of democracy, freedom, equality, tolerance and social\njustice as enunciated by Islam, discourage parochial, racial, tribal, sectarian,\nlinguistic and provincial prejudices and reflect the urges and aspirations of\nthe people of Pakistan;\n(c)        to broadcast in the Home Services such special programmes as the 1[Board]\nmay, from time to time, direct;\n(d)        to broadcast programmes in the External Services to such countries and in\nsuch languages and at such times as the 1[Board] may, from time to time,\ndirect;\n(e)        to bring to public awareness the whole range of significant activity and to\npresent news or events in as factual, accurate and impartial a manner as\npossible;\n(f)        to carry out instructions of the Federal Government with regard to general\npattern or policies in respect of programmes, announcements and news to be\nput out on the air from time to time;\n(g)        to hold the existing, and to construct or acquire and establish or install\nadditional, stations and apparatus;\n(h)        to hold the existing, and to construct or acquire additional, equipment and\napparatus for telephony in Pakistan for purposes of broadcasting;\n(i)        to compile, prepare, print, publish, issue, circulate and distribute, with or\nwithout charge, such papers, magazines, periodicals, books, circulars and\nother such matter as may be conducive to any of the functions of the\nCorporation; and\n(j)        to collect news and information in any part of the world in any manner that\nmay be deemed fit.\n1\nSubs. by Ord. No. XCIV of 2002, s. 8.\n(2) In the discharge of its functions the Corporation shall be guided on questions of policy by\nthe instructions, if any, given to it from time to time by the Federal Government which shall be the\nsole judge as to whether a question is a question of policy.\n_________"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Employment of officers and staff",
      "content": "The Board may, from time to time, employ such\npersons as it may consider necessary for the performance of its functions on such terms and\nconditions as it may prescribe by regulations."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Transfer of Radio Pakistan servants to the Corporation",
      "content": "(1) Notwithstanding\nanything to the contrary in any contract or agreement or in the conditions of service, the Federal\nGovernment may, subject to the provisions of sub-sections (2) and (3), transfer persons in the service\nof Pakistan and serving in connection with the affairs of the department of the Government of\nPakistan headed by the Director-General, Radio Pakistan, hereinafter referred to as Radio Pakistan,\nimmediately before the commencement of this Act, including persons on deputation to other\norganisations in Pakistan or abroad, to the Corporation on the same terms and conditions to which\nthey were entitled immediately before such commencement.\n1\n[(1A) The persons transferred to the Corporation under sub-section (1) shall cease to be civil\nservants in the service of Pakistan and become employees of the corporation from the date of its\nestablishment under section 3, on the same terms and conditions to which they were entitled\nimmediately before such transfer.\n(1B) Notwithstanding any judgement of any Court or tribunal, including the Supreme Court,\nany law, contract, agreement or the conditions of service, all actions taken, powers exercised, orders\nor instructions issued, by the Corporation in respect of terms and conditions of employees referred to\nin sub-section (1A) after their transfer to the Corporation till the coming into force of the Pakistan\nBroadcasting Corporation (Amendment) Act, 1996 (IV of 1996), shall be deemed to have been\nvalidly taken, exercised or issued by the Corporation.]\n(2) Notwithstanding anything in sub-section (1), only such members of the Information\nService of Pakistan serving Radio Pakistan immediately before the commencement of this Act shall\nbe transferred to the Corporation as opt for service in the Corporation.\n(3) The persons transferred to the Corporation under sub-section (2) shall, on such transfer,\ncease to be members of the Information Service of Pakistan.\n(4) The terms and conditions of service of the members of the Information service of Pakistan\ntransferred to the corporation under sub-section (2) shall not be altered by the Corporation to their\ndisadvantage.\n1\nIns. by Act No. IV of 1996, s. 2 and shall be deemed always to have so been inserted.\n(5) No person in the service of Pakistan who is transferred to the Corporation under sub-\nsection (1) shall, notwithstanding anything contained in any law for the time being in force, be\nentitled to any compensation because of such transfer.\n__________"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Sources of income",
      "content": "The sources of income of the Corporation shall be—\n(a)        grants-in-aid made by the Federal Government for approved projects of the\nCorporation;\n(b)        moneys paid by the Federal Government for the expenditure incurred by the\nCorporation on the External Services and other services performed by the\nCorporation at the instance and on behalf of that Government;\n(c)        such annual subsidy as the Federal Government may grant;\n(d)        licence fee as the Federal Government may fix in respect of licences issued\nunder section 4 of the Wireless Telegraphy Act, 1933 (XVII of 1933), to\npossess wireless telegraphy apparatus;\n(e)        income derived from sale of programmes and broadcast time for\nadvertisement; and\n(f)        income from other sources."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Budget for capital and development expenditure",
      "content": "Before the commencement of\neach financial year, the Corporation shall submit to the 1[Board] for its approval a budget for\nthe capital and development expenditure proposed to be incurred by the Corporation during the\nfinancial year and shall no incur any expenditure of the nature of capital and development\nexpenditure which is not provided for in the budget as approved by the 1[Board]."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Borrowing power",
      "content": "The Corporation may, with the previous sanction of the Federal\nGovernment, and on such terms and conditions as may be approved by the Government, borrow in\nPakistan currency or foreign currency."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Audit and accounts",
      "content": "1[(1) The accounts of the Corporation shall be maintained and\naudited in accordance with the provisions of Articles 169 and 170 of the Constitution of the Islamic\nRepublic of Pakistan.]\n(2) Copies of the audit report shall be sent to the Board and the report shall also be available\nfor public inspection.\n(3) The statement of audited accounts of the Corporation together with a report of the Board\nthereon shall be furnished to the 1[secretary finance division through the secretary of the division\nconcerned] by the Corporation within six months of the close of every financial year.\n(4) The 1 [secretary finance division through the secretary of the division concerned] may at\nany time issue directions to the Corporation to rectify and audit objection and the Corporation shall\ncomply with every such direction.\n1\nSubs. by Act No. VI of 2024, ss. 7-8."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Reports",
      "content": "(1) The Corporation shall submit to the Federal Government at such time,\nafter the end of every financial year, in such form and in such manner as may be prescribed by rules,\na report on the conduct of its affairs for that year.\n(2) The Federal Government shall cause the report to be laid the National Assembly."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Transfer of assets and liabilities of Radio Pakistan",
      "content": "All assets and liabilities of the\nFederal Government in relation to Radio Pakistan subsisting immediately before the commencement\nof this Act shall, unless the Federal Government, by notification in the official Gazette, otherwise\ndirects, vest in the Corporation as from such commencement."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Liquidation of Corporation",
      "content": "No provision of law relating to the winding up of\ncompanies shall apply to the Corporation and the Corporation shall not be wound up save by an\norder of the Federal Government and in such manner as the Federal Government may direct."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Power to make rules",
      "content": "The Federal Government may make rules for carrying out the\npurposes of this Act."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Power to make regulations",
      "content": "2[(1)] The Board may, with the previous sanction of the\nFederal Government, make regulations to provide for all matters not required to be provided for by\nrules and for which provision is necessary or expedient for carrying out the purposes of this Act.\n2\n[(2) The regulations made under this section on the first occasion, other than those having\nfinancial implications, may be made so as to have effect from the date of the establishment of the\nCorporation.]\n3\n[22A. Removal of difficulties.—If any difficulty arises in giving effect to any of the\nprovisions of this Act, the Federal Government may make such order, not inconsistent with the\nprovisions of this Act, as may appear to be necessary for the purpose of removing the difficulty.]"
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. 4[Omitted]",
      "content": "____________\nRGN Date: 23-08-2024\n1\nOmitted by Act No. IV of 1999, s. 23.\n2\nRe-numbered and added by Ord. No. XXXIII of 1979, s. 2.\n3\nIns. by Act No. VI of 2024, s. 9.\n4\nOmitted by Ord. No. XXVII of 1981, s. 3 Sch. II."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Board of Directors of the Corporation;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "Corporation",
      "definition": "the Pakistan Broadcasting Corporation established under section 3; 1 [ca “division concerned” means the division to which business of the Corporation stands allocated;] 2 [(d) “Member” means a Member of the Board;]",
      "source_provision": "sec2"
    },
    {
      "term": "regulation",
      "definition": "a regulation made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "rule",
      "definition": "a rule made under this Act; 1 [(fa) “secretary” shall have the same meaning as assigned thereto in the Rules of Business, 1973;",
      "source_provision": "sec2"
    },
    {
      "term": "SOE Act",
      "definition": "the State-Owned Enterprises (Ġovernance and Operations) Act, 2023 (VII of 2023); and]",
      "source_provision": "sec2"
    },
    {
      "term": "station",
      "definition": "any production, receiving, or transmitting unit, fixed or mobile. 1 Ins. and added by Act No. VI of 2024, s. 2. 2 Subs. by Ord. No. XCIV of 2002, s.2.",
      "source_provision": "sec2"
    }
  ]
}
