{
  "id": "pk-pakistan-coast-guards-act-1973",
  "type": "statute",
  "title": "Pakistan Coast Guards Act, 1973",
  "title_en": "Pakistan Coast Guards Act, 1973",
  "short_name": "PCGA",
  "status": "in_force",
  "issued_date": "1973-02-03",
  "in_force_date": "1973-02-03",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2hp-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Coast Guards Act, 1973 (XVIII of 1973) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, application and commencement",
      "content": "(1) This Act may be called the Pakistan\nCoast Guards Act, 1973.\n(2) It shall apply to all members of the Pakistan Coast Guards wherever they may be serving.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Interpretation",
      "content": "In this Act, unless there is anything repugnant in the subject or\ncontext,—\n(i)      “ Coastal area ” means the area specified in the First Schedule;\n(ii)     “ Commandant ” means a person appointed under section 4 to be a\nCommandant of a Unit of the Force ;\n(iii)    “ Custody ” means the arrest and confinement of a person as prescribed ;\n(iv)     “ Deputy Director General ” means the Deputy Director General, Pakistan\nCoast Guards, appointed under section 4 ;\n(V)      “ Director General ” means the Director General, Pakistan Coast Guards,\nappointed under section 4 ;\n(vi)     “ Force ” means the Pakistan Coast Guards constituted under section 3 or any\nof the individual forces comprising it, as the context may require ;\n(vii)    “ Junior Commissioned Officer ” means a person commissioned, gazetted or\nin pay as a Junior Commissioned Officer in the Force ;\n(viii) “ Member of the Force ” means a person, other than a person appointed under\nsection 4, who is appointed to the Force and has signed a recruiting roll set out\nin the Second Schedule and the affirmation in the form set out in the Third\nSchedule ;\n(ix)    “ Officer ” means a person, other than a junior commissioned officer, who is\ncommissioned, gazetted or in pay as an officer of any of the Defence Services\nof Pakistan or of the Force ;\n(x)    “ Prescribed ” means prescribed by rules made under this Act; and\n(xi)   “ Superior Officer ”, in relation to any member of the force, means a higher\nappointment, or any non-commissioned officer, junior commissioned officer\nand an officer of a higher class, a higher grade in the same class, or holding a\nhigher appointment which may place him in a superior position in relation to\nothers according to usage of the Force."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Powers to constitute and maintain the force and its functions",
      "content": "The Federal\nGovernment may constitute and maintain a Force to be called the Pakistan Coast Guards for\nperforming the following functions, namely :—\n(a)    prevention of smuggling ;\n(b)    prevention of illegal immigration to and migration from the country ;\n(c)    stopping enemy agents or saboteurs from infiltrating into the country along\nthe coastal areas ; and\n(d)    supplementing defence in war."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Appointment of officers of Force",
      "content": "The Federal Government may, by notification in the\nofficial Gazette, appoint any member of any of the Defence Services of Pakistan to be—\n(a)    Director General ;\n(b)    Deputy Director General ;\n(c)    Commandant ; and\n(d)    any other Commissioned Officer of any of the Defence Services of Pakistan\nwith any other designation."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Appointment of subordinate and ministerial staff",
      "content": "(1) The Director General or a\nperson authorised by the Federal Government in this behalf may appoint junior commissioned\nofficers, subordinate and ministerial staff and other members of the Force and determine the duties\nto be performed by such officers, staff and other members.\n(2) Appointments under sub-section (1) shall be made by direct recruitment or promotion or\nfrom personnel on deputation from any of the Defence Services of Pakistan, the Civil Armed Forces,\nor any other Department of Government in such manner as may be prescribed.\nExplanation.—In this sub-section, “ Civil Armed Forces ” means such forces as the Federal\nGovernment may, by notification in the official Gazette, specify.\n(3) Before a person is appointed under sub-section (1), the statement contained in the\nrecruiting roll and affirmation set out respectively in the second and third Schedule shall, in the\npresence of a Commandant, or other officer appointed under section 4, at any convenient place be\nread out and, if necessary, explained to him who shall, in acknowledgement of the statement having\nbeen so read tut to him, put his signature to it.\n(4) When the affirmation set out in the Third Schedule is read out, it shall be repeated by the\nperson making affirmation before he signs it."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Superintendence, command, control and administration of the Force",
      "content": "Subject to the\nsuperintendence and control of the Federal Government, the Force shall be commanded and\nadministered by the Director General in accordance with the provisions of this Act and the rules\nmade thereunder and such orders and instructions as may be made or issued by the Federal\nGovernment from time to time."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Pay, pension, etc., of officers and members",
      "content": "The officer and members of the Force\nshall receive such pay, pension and other remuneration, and shall enjoy such leave and other\nprivileges as may be prescribed from time to time."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Members to be subject to Pakistan Army Act, 1952",
      "content": "(1) Every officer and member of\n1952), hereinafter referred to as the Act, as officers, junior commissioned officers and persons\nenrolled under the Act according as they are respectively officers, junior commissioned officers and\nother members of the Force.\n(2) The Director General shall, in respect of all officers and members of the Force, have all\nmartial.\n(3) Subject to sub-section (2), the Federal Government may, by general or special order,\ndirect by what authority any jurisdiction, powers or duties incidental to the operation of the\nprovisions of the Act shall be exercised or performed in respect of the Force."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Consequence of sentence of imprisonment",
      "content": "A member of the Force who is sentenced\nto a term of imprisonment for a term which is not less than ninety days shall be deemed to have been\ndismissed from the Force."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Suspension",
      "content": "Any officer or junior commissioned officer shall be competent to suspend\nin the prescribed manner a member of the Force working under him for any mis-conduct, remissness\nor negligence in the discharge of his duties."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Place of imprisonment",
      "content": "If a member of the Force sentenced under the Act to\nimprisonment for a term not exceeding one month is also dismissed from service, he shall be\nimprisoned in the nearest prison or such other prison as the Federal Government may, by general or\nspecial order, direct, but if he is not so dismissed, he may be confined in a quarterguard or such other\nplace as the Director General may consider suitable."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Capture of deserters",
      "content": "(1) Whenever any person subject to this Act deserts, his\nCommandant shall give written information of the desertion to such civil authorities as in his opinion\nmay be able to afford assistance towards the capture of the deserter and such authorities shall\nthereupon take steps for the apprehension of the said deserter in like manner as if he were a person\nfor whose apprehension a warrant had been issued by a Magistrate, and shall deliver the deserter,\nwhen apprehended, into the custody of the Force.\n(2) Any police officer may arrest without warrant any person whom he reasonably believes to\nbe subject to this Act and a deserter or absentee without leave and bring him without delay before\nthe nearest Magistrate, to be dealt with according to law."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Appeal and revision",
      "content": "(1) In all cases decided by the Deputy Director General, of the\nCommandant or any other officer, a person aggrieved may, within thirty days of the order, appeal to\nthe officer higher than the one awarding the punishment.\n(2) A person aggrieved by an order of the Director General awarding any punishment may,\nwithin thirty days of the order, apply to the Federal Government for a revision."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Powers of the officers of the Force",
      "content": "(1) The officers and members of the Force shall\nperform such functions of officers of customs as may be entrusted to them and exercise such powers\nunder the Customs Act, 1969 (IV of 1969), as may be delegated to them under section 6 of that Act\nfor the purposes of prevention of smuggling along the coastal areas of the Provinces of Sind and\nBaluchistan, excepting the limits of the various ports in those areas.\n(2) In addition to the powers conferred under sub-section (1), the officers and junior\ncommissioned officers of the Force shall exercise all the powers conferred on the officer in charge of\na police station under the Police Act, 1861 (V of 1861), and under the Code of Criminal Procedure,\n1898 (Act V of 1898)."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Disposal of goods seized by members of the Force",
      "content": "All goods seized by any officer or\nmember of the Force shall be dealt with in accordance with the provisions of section 169 of the\nCustoms Act, 1969 (IV of 1969), and an officer nominated by the Director General, shall be\nassociated at the time of their final disposal by an appropriate Customs authority under that Act."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Placing of Force under command of Chief of Staff, Pakistan Army",
      "content": "(1) The Federal\nGovernment may at any time, by order in writing, place the entire Force or any part of it under the\ncommand of the Chief of Staff of the Pakistan Army for employment within the overall operational\nplan of the Pakistan Army.\n(2) Notwithstanding an order under sub-section (1), the Force shall continue to be subject to"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Indemnity",
      "content": "No suit, prosecution or other legal proceeding shall lie against any person\nfor anything which is in good faith done or intended to be done under this Act or any rules or\nregulations made thereunder."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Power to make rules and regulations",
      "content": "(1) The Federal Government may, by\nnotification in the official Gazette, make rules—\n(a)    regulating the functions and powers of persons appointed under section 4;\n(b)        regulating the classes and grades of, and the remuneration to be paid to,\nofficers and members of the Force and their conditions of service; and\n(c)        generally for the purpose of carrying into effect the provisions of this Act.\n(2) The Director General may, by notification in the official Gazette published with the prior\napproval in writing of the Federal Government, make regulations consistent with this Act and the\nrules for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. 1[Omitted]",
      "content": "[See section 2 (i)]\nSouthern strip of the Province of Baluchistan along and astride the existing road emanating\nfrom the Pak-Iran border connecting the towns of MAN-TURBAT—HOSHAB—BAZDAR—\nBELA—UTHAL to HUB RIVER (BUNDMURAD) and also the southern area of the Province of\nSind along and astride the line and road from HUB RIVER (BUNDMURAD)—GADAP—SARI\nSING—THANO BULAKHAN—BANO—MIRPUR BATARO—JATTI to the Arabian Sea but\nexcluding the limits of any port in those areas.\n[See section 2 (viii)]\n(RECRUITING ROLL)\nAfter you have served in the Pakistan Coast Guards for such period as has been fixed under\ndischarge through the officer to whom you may be subordinate, to the Commandant, and you will be\ngranted your discharge after three months from the date of your application, unless your discharge\nwould cause the vacancies in that unit of the Coast Guards to exceed one tenth of the sanctioned\nstrength, in which case you shall be bound to remain until this objection is waived or removed. But\nwhen on active duty, you shall have no claim to a discharge, and you shall be bound to remain to do\nyour duty until the necessity for retaining you in the Coast Guards ceases, when you may make your\napplication in the manner mentioned above.\nSIGNED in acknowledgement of the above having been read out to me. I have understood\nthe purport of what has been read out.\nPerson Enrolled.\nDate………….....\nSIGNED in my presence after I had ascertained that the recruit understood the purport of\nwhat he signed.\nCommandant or other Enrolling Officer.\n1\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ordinance No. XXVII of 1981), s. 3 and Sch., II.\n[See section 2 (viii)]\n(FORM OF AFFIRMATION)\nI,....................................................................., solemnly affirm in the presence of Almighty\nGod that I will be faithful and bear true allegiance to the Government of Pakistan and that I will, as\nin duty bound, honestly and faithfully serve in the Pakistan Coast Guards and go wherever I may be\nordered by air, land or sea, and that I will observe and obey all commands of any officer set over me\neven to the peril of my life.\nSIGNED in acknowledgement of the above having been read.\nSIGNED in my presence after I had ascertained that the person understood the purport of\nwhat he signed.\nCommandant or other Enrolling Officer.\nRoman Urdu Translation of Affirmation\n“Main........................Khuda-i-Taala ko hazir-o-nazir jankar Khulus ke sath iqrar karta hun\nkih Pakistan ki Hukumat ka sidq-i-dil se wafadar aur itaatguzar rahunga aur apna farz samjhunga\nkih Pakistan Coast Guards men imandari aur wafadari ke sath khidmat baja laun. Bharti hone ki\nsharait ke mutabiq khushki, hava ya samundar ke raste jahan bhi jane ka hukam milega jaunga aur\njise mera afsar muqarrar kia jaega uske tamam ahkam ki tamil aur itaat karunga, khuwah us men\nmujhe jan ka khatra kiun na ho”.\n______________\nRGN Date: 08-10-2024"
    }
  ],
  "definitions": []
}
