{
  "id": "pk-pakistan-coinage-act-1906",
  "type": "statute",
  "title": "Pakistan Coinage Act,1906",
  "title_en": "Pakistan Coinage Act,1906",
  "short_name": "PCA",
  "status": "in_force",
  "issued_date": "1906-03-01",
  "in_force_date": "1906-03-01",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaZ-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Coinage Act,1906 (III of 1906) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "_\n(a)      “deface”, with its grammatical variations and cognate expressions, includes\nclipping, filing, stamping or such other alteration of the surface or shape of a\ncoin as is readily distinguishable from the effects of reasonable wear ;\n(b)      “the Mint” includes the Mints now existing and any which may hereafter be\nestablished ;\n(c)      “prescribed” includes prescribed by a rule made under this Act ;\n(d)      “remedy” means variation from the standard weight and fineness ; and\n(e)      “standard weight” means the weight prescribed for any coin."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Power to establish and abolish Mints. The 3[ Federal Government] may, by notification",
      "content": "in the [ official Gazette ], ___\n4\n(a)     establish a Mint at any place at which a Mint does not for the time being exist; and\n(b)     abolish any Mint, whether now existing or hereafter established.\n5\n[   *           *          ]\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1905, Part. V, p. 32; for Report of the Select Committee, see ibid., 1906, Part. V, p. 9;\nand for Proceedings in Council, see ibid., 1905, Part VI, p. 142 ; ibid., 1906, Part VI, p. 28.\nThis Act has been declared to be in force in—\n(1) Upper Tanawal, an excluded area in N.W.F.P., by N.W.F.P. Regulation I of 1941;\nIt has been extended to the Leased Areas of Baluchistan, see the Leased Areas(Laws) Order, 1950 (G.G.O. 3 of 1950) ; and applied in the Federated\nAreas of Baluchistan, see Gazette of India, 1937, Pt. I, p. 1499.\nIt has also been extended to the Baluchistan States Union, see the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G.G.O. 4 of\n1953), as amended by the Baluchistan States Union (Federal Laws) (Extension) (Second Amdt.) Order, 1953 (G.G.O. 19 of 1953).\nIt has also been extended to the Khairpur State, see G.G.O. 5 of 1953, as amended by G.G.O. 24 of 1953.\nIt has also been extended to the State of Bahawalpur by the Bahawalpur (Extension of Federal Laws) Order, 1953 (G.G.O. 11 of 1953), as amended\nby the Bahawalpur (Extension of Federal Laws) (Amdt.) Order, 1953 (G.G.O. 21 of 1953).\nIt has also been extended to the Baluchistan by Baluchistan Laws Reg. II of 1913, s. 3.\nThe Act has been and shall be deemed to have been brought into force in Gawadur with effect from the 8th September, 1958 by the Gawadur (Appli-\ncation of Central Laws) Ordinance, 1960 (37 of 1960), s. 2.\n2\nSubs. by the Pakistan (Monetary System and Reserve Bank) Order, 1947 (G.G.O. 21 of 1947), Art. 10, for the original section 1.\n3\nSubs. by the Pakistan Coinage (Amdt.) Act, 1975 (23 of 1975), s. 2, for “Central Government”, which bad been subs. by A. O., 1937, for “G. G. in\nC\"\n4\nSubs. by A. O., 1937, for “Gazette” of India”.\n5\nThe Heading “Silver Coinage” omitted by the Indian Coinage (Amdt) Act, 1947 (28 of 1947), S.2.\n4 and 5. [Silver Coins. Standard weight and fineness.] Rep. by the Indian Coinage (Amendment) Act,\n1947 (28 of 1947), s. 2.\n1\n[ COINAGE"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Denominations, dimensions, designs and composition of coins. Coins may be coined",
      "content": "at the Mint 2[, or at a mint outside Pakistan,] for issue under the authority of the 3[Federal Govern-\nment], of such denominations 6[nor less then one rupee] 4[* *        *] of such dimensions and\ndesigns, and of such metals or of mixed metals of such composition as the 3[Federal Government]\nmay, by 5[notification in the official Gazette, determine.]\n7\n[7. Standard weight and remedy. The standard weight of the coins of any denomination\ncoined under the provisions of section 6, and the remedy allowed in the making of such coins shall\nbe such as may be prescribed in this behalf by the 9[Federal Government.]]\n7\n[8 and 9.[*         *              *              *             *               *              *]\n9\n[*    * *]\n10 to 12. [Power to direct coining and to prescribe dimensions and designs.\nDemonetization of sovereign and half sovereign. Silver coin when a legal tender.] Rep. by the Indian\nCoinage (Amendment) Act, 1947 (XXVIII of 1947).\n10[13. Coins when a legal tender. ___(1) The coins issued under the authority of section 6\nshall be legal tender in payment or on account for any sum:\nProvided that the coin has not been defaced and has not lost weight so as to be less\nthan such weight as may be prescribed in its case.\n(2) All the gold or silver coins issued under the Act on or after the 1st day of January, 1976,\nshall continue as before to be legal tender in payment or on account for any sum:\nProvided that the coin has not been defaced and has not lost more than one-fortieth of\nweight as specified below:—\n(a) in case of gold,―\n(i)          33.437 grams in the case of three thousand rupee coin issued in 1976 to\ncommemorate the conservation of Astor Markhor;\n(ii)         9 grams in the case of one thousand rupee coin issued in 1977 to\ncommemorate the Islamic Summit Conference;\n(iii)        4.5 grams in the case of five hundred rupee coin issued in 1976 to celebrate the\n100th birth anniversary of Quaid e Azam Muhammad Ali Jinnah; and\n1\nS. 6 and the heading above it, subs. Indian Coinage (Amdt) Act, 1947 (28 of 1947, s. 3, for the original heading and s. 6, as subsequently\namended.\n2\nIns. by Act 23 of 1975, s. 3.\n3\nSubs. ibid., s. 2, for “Central Government” .\n4\nThe words “not higher than one rupee” omitted ibid., s. 3.\n5\nFor instances of such notifications, see Gaz. of P., 1960, Ext., pp 1253 1355, ibid. 1963, Ext., pp 89-90 and ibid., 1964, Ext., pp. 141-144.\n6\nIns by Act X of 2013, s.2.\n7\nSubs. by the Indian Coinage (Amdt.) Ordinance, 1942 (4 of 1942). s. 2, for sections 7,8 and 9. For instances of notification under section 7,\nsee Gaz. of P., 1952, Pt, I., pp. 212-213, ibid., 1960, Ext., p. 1353, ibid., 1963, Ext., p. 91, and ibid., 1964, Ext., p. 142.\n8\nSubs.by the Pakistan Coinage (Amdt.) Act, 1975 (23 of 1975), s. 2, for “Central Government”.\n9\nThe heading “Dimensions and Designs of Coins”. was omitted by the Indian Coinage (Amdt,) Act, 1947 (28 of 1947), s. 4.\n10\nSubs. by Act No. X of 2013, s. 3.\n(iv)     3.64 grams in the case of five hundred rupee coin issued in 1977 to\ncelebrate the 100th birth anniversary of Allama Iqbal; and\n(b) in case of silver,⎯\n(i)        28.28 grams in case of one hundred rupee coin issued in 1976 to\ncommemorate conservation of Western Trogopan;\n(ii)       20.44 grams in the case of one hundred rupee coin issued in 1976 to\ncelebrate the 100th birth anniversary of Quaid e Azam Muhammad Ali\nJinnah;\n(iii)      20.44 grams in the case of one hundred rupee coin issued in 1977 to\ncommemorate the Islamic Summit Conference;\n(iv)       20.40 grams in the case of one hundred rupee coin issued in 1977 to\ncelebrate the 100th birth anniversary of Allama Iqbal; and\n(v)        35 grams in the case of one hundred fifty rupee coin issued in 1976 to\ncommemorate the conservation of Gharial Crocodile.]\n1\n14.[*             *                 *                     *                      *                     *                     *]"
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. [Coin made under former Acts.] Rep. by the Indian Coinage (Amendment) Act, 1947",
      "content": "(XXVIII of 1947).\n2\n[15A. Power to call in coin. Notwithstanding anything contained in 3[section 13,] the 4[\nFederal Government] may, by 5notification in the 6[ official Gazette ], call in, with effect from such\ndate as may be specified in the notification, any coin, of whatever date or denomination, referred to\nin 7[ that section] 8[* * *] and on and from the date so specified such coin shall cease to be a legal\ntender 9[ save to such extent as may be specified in the notification ].\n10\n[* * * * * * *]\n[15AA. Decimal coinage.__ State Bank of Pakistan shall exchange coins of paisa 1, 2,\n11\n5,10,25 and 50, already issued by the Federal Government, till such date as notified by the State\nBank of Pakistan; thereafter, these coins shall cease to be legal tender.]\n11\n[15B *                      *                 *                     *                      *          *                     *]\n______________________________________________________________________________\n1\nBy the Indian Coinage (Amdt.) Ordinance, 1942 (4 of 1942), section 14 and the original section 13 were together substituted by a single\nsection 13 which has again been subs. by the Indian Coinage (Amdt.) Act, 1947 (28 of 1947), s. 5.\n2\nS. 15A ins. by the Indian Coinage (Amdt.) Act, 1924 (10 of 1924), s. 3.\n3\nSubs. by Act 28 of 1947, s. 7, for “section 12, section 13, or section 15”.\n4\nSubs. by the Pakistan Coinage (Amdt.) Act, 1975 (23 of 1975), s. 2, for “Central Government”, which had been subs. by A. O., 1937, for\n“G.G. in C.” .\n5\nFor instance of notifications, see Gaz. of P., 1963, Pt. I., p. 234, ibid., 1964, Pt. I., p. 340.\n6\nSubs. by A. O., 1937, for “Gazette of India”.\n7\nSubs. by Act 28 of 1947, s. 7,for “any of those sections” .\n8\nThe words “other than the rupee and half-rupee referred to in sub-section (1) of section 12” , omitted by the Indian Coinage (Second\nAmdt.) Ordinance, 1940 (12 of 1940), s. 2.\n9\nSubs. ibid., for the words “save at a Government currency office”.\n10\nProviso Omitted, ibid.\n11\nIns & Omitted by Act X of 2013, ss 4 & 5.\nDIMINISHED, DEFACED AND COUNTERFEIT l[*] COINS"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Procedure in regard to coin cut under section 16 (a). A person cutting or breaking coin",
      "content": "under the provisions of clause (a) of section 16 shall observe the following procedure, namely:—\n(a)      if the coin has been diminished in weight so as to be more than such percentage\nbelow standard weight as may be prescribed as the limit of reasonable wear, but not\nmore than such further percentage as may be prescribed in this behalf, he shall\neither return the pieces to the person tendering the coin, or, if such person so\nrequests, shall receive and pay for the coin at such rates as may be prescribed in this\nbehalf; and\n(b)      if the coin has been diminished in weight so as to be more than such further\npercentage below standard weight so prescribed as aforesaid, he shall return the\npieces to the person tendering the coin, who shall bear the loss caused by such\ncutting or breaking."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Procedure in regard to coin cut under section 16 (b). A person cutting or breaking coin",
      "content": "under the provisions of clause (b) of section 16 shall observe the following procedure, namely:―\n(a)      if such person has reason to believe that the coin has been fraudulently defaced, he\nshall return the pieces to the person tendering the coin, who shall bear the loss\ncaused by such cutting or breaking;\n(b)      if such person has not reason to believe that the coin has been fraudulently defaced,\nhe shall receive and pay for the coin at its nominal value.\nExplanation.—For the purposes of this section a coin which there is reason to believe has been\ndefaced by sweating shall be deemed to have been fraudulently defaced."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Procedure in regard to coin which is liable to be cut under both clause (a) and clause",
      "content": "(b) of section 16. If a coin is liable to be cut or broken under the provisions of both clause (a) and clause\n(b) of section 16, the person cutting or breaking the coin shall deal with it,___\n______________________________________________________________________________\n1\nThe word “SILVER” omitted by the Indian Coinage (Amdt.) Act, 1919 (21 of 1919), s. 6.\n2\nSubs. by the Pakistan Coinage (Amdt.) Act, 1975 (23 of 1975), s.2, for “Central Government”, which had been subs. by A. O., 1937, for “G.G.\nin C.” .\n3\nThe words “or by the L. G.” omitted by A. O., 1937.\n(a)   if he has reason to believe that the coin has been fraudulently defaced, under clause\n(a) of section 18, and\n(b)   in other cases, under section 17."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Power to certain persons to cut counterfeit or fraudulently defaced coin and",
      "content": "procedure in regard to coin so cut. Where any 1[* * *] coin purporting to be coined or issued under the\nauthority of the 2[Federal Government] is tendered to any person authorised by the 2[Federal\nGovernment] 3[* * *] to act under this section, and such person has reason to believe that the coin is\ncounterfeit 4[or has been fraudulently defaced ], he shall by himself or another cut or break the coin, and\nmay at his discretion either return the pieces to the tenderer, who shall bear the loss caused by such\ncutting or breaking, or 5[ in the case of silver coin] receive and pay for the coin according to the value of\nthe silver bullion contained in it."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Power to make rules",
      "content": "(1) The 2[ Federal Government] may make 6rules to carry out the\npurposes and objects of this Act.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules\nmay___\n7\n[*            *                    *                     *                     *                     *                *]\n(b)        provide for the guidance of persons authorised to cut or break coin under sections 16 and"
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Bar of suits. No suit or other proceeding shall lie against any person in respect of anything",
      "content": "in good faith done, or intended to be done, under or in pursuance of the provisions of this Act."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Saving of making of other coins at Mints. Nothing in this Act shall be deemed to prohibit",
      "content": "or restrict the making at the Mint of coins intended for issue as money by the Government of any\nterritories beyond the limits of 1[Pakistan]."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. [Saving of copper coins.] Rep. by the Indian Coinage (Amendment) Act, 1947 (XXVIII of",
      "content": "1947), s. 10.\n______\nTHE SCHEDULE.—[Enactments repealed.] Rep. by the Repealing and Amending Act, 1914 (X\nof 1914 ), Schedule II.\n______\n______________________________________________________________________________\n1\nThe original words “British India” have successively been amended by A. O., 1949, Arts. 3(2) and 4, A. O., 1964. Art. 2 and Sch. and the\nRepealing and Amending Ordinance, 1965 (10 of 1965), s. 3 and 2nd Sch., to read above."
    }
  ],
  "definitions": [
    {
      "term": "the Mint",
      "definition": "the Mints now existing and any which may hereafter be established ;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by a rule made under this Act ;",
      "source_provision": "sec2"
    },
    {
      "term": "remedy",
      "definition": "variation from the standard weight and fineness ; and",
      "source_provision": "sec2"
    },
    {
      "term": "standard weight",
      "definition": "the weight prescribed for any coin.",
      "source_provision": "sec2"
    }
  ]
}
