{
  "id": "pk-pakistan-college-of-physicians-and-surgeons-ordinance-i962",
  "type": "statute",
  "title": "Pakistan College of Physicians and Surgeons Ordinance, I962",
  "title_en": "Pakistan College of Physicians and Surgeons Ordinance, I962",
  "short_name": "PCOPA",
  "status": "in_force",
  "issued_date": "1962-05-18",
  "in_force_date": "1962-05-18",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJ6V-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan College of Physicians and Surgeons Ordinance, I962 (XX of 1962) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Power to make rules",
      "content": "ORDINANCE, 1962\nORDINANCE NO. XX OF 1962\n[19th May, 1962]\nAn Ordinance to establish a College of Physicians and Surgeons in Pakistan.\nWHEREAS it is expedient to establish a College of Physicians and Surgeons in Pakistan for\nmaintaining high principles of medical profession, promoting specialists medical practice, arranging\npost-graduate medical training, and for matters ancillary thereto;\nNOW, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958,\nand in exercise of all powers enabling him in that behalf, the President is pleased to make and\npromulgate the following Ordinance: ___"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Ordinance may be called the Pakistan\nCollege of Physicians and Surgeons Ordinance, 1962.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_In this Ordinance, unless there is anything repugnant in the subject or\ncontext, ___\n(a)        “College” means the Pakistan College of Physicians and Surgeons established\nunder section 3;\n(b)        “Council” means the Council of the College constituted under section 6;\n(c)        “Fellow” means a Fellow of the College;\n(d)        “prescribed” means prescribed by rules made under section 19."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the College",
      "content": "_(1) As soon as may be after the commencement of this\nOrdinance, there shall be established a College, to be called the Pakistan College of Physicians and\nSurgeons.\n(2) The College shall be a body corporate, having perpetual succession and a common seal,\nwith power to acquire, hold and dispose of property, both movable and immovable, and shall, by the\nsaid name, sue and be sued."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Fellows of the College",
      "content": "_The College shall consist of the following persons who shall be\ncalled the Fellows of the College, namely: ___\n(a)        persons, who have post-graduate medical qualifications with experience in\nteaching, research or public health administration, or who have attained\neminence in any branch of medical science or public health administration, to\nbe appointed as Fellows by the 1[Federal Government] when the College is\nfirst established under section 3;\n1\nSubs. by F.A.O., 1975, Art. 2 and Table.\n(b)        persons elected as Fellows under clause (g) of sub-section (2) of section 9; and\n(c)        persons who have passed the Fellowship examination and are admitted as\nFellows by the Council."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Functions of the College",
      "content": "_The following shall be the functions of the College, namely: ___\n(1) to promote specialist practice of medicine, surgery, gynaecology and obstetrics and such\nother specialities by securing improvement of teaching and training in hospitals and hospital\nmethods;\n(2) to arrange post-graduate medical, surgical and other specialists training;\n(3) to hold and conduct examinations for grant of diplomas and admission to the Fellowship\nof the College;\n(4) to provide for research;\n(5) to bring together the physicians, surgeons and other specialists of Pakistan periodically for\nscientific discussions and practical demonstrations of various subjects; and\n(6) to do all acts and things as it may consider necessary to carry out the purposes of this\nOrdinance."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. The Council",
      "content": "_(1) There shall be constituted a Council of the College consisting of twenty\nmembers elected, in the prescribed manner, by the Fellows from amongst themselves:\nProvided that the first Council shall consist of twenty members appointed from amongst the\nFellows as follows: ___\n(a)        eight members appointed by the 1[Federal Government];\n(b)        six members appointed by the Government of East Pakistan; and\n(c)        six members appointed by the Government of West Pakistan.\n(2) A member of the Council shall, subject to his continuance as a Fellow, hold office for a\nperiod of four years and shall be eligible for a re-election and in the case of the first members, for\nelection.\n(3) A casual vacancy in the office of the members of the Council shall be filled by\nappointment or election according as the member whose vacancy is being filled was appointed or\nelected and the person so appointed or elected shall hold office for the unexpired period of the term\nof his predecessor."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Election of Office",
      "content": "bearers.___(1) The members of the Council shall elect, in the prescribed\nmanner, from amongst themselves a President, two Vice-Presidents and a Treasurer:\nProvided that the first President shall be appointed by the 1[Federal Government] from\namongst the members of the Council.\n1\nSubs. by F.A.O., 1975, Art. 2 and Table.\n(2) The President, Vice-President and the Treasurer shall hold office for a period of one year\nbut each shall continue in office after the expiry of his term until his successor is elected and shall be\neligible for re-election and in the case of the first President, for election.\n(3) Any dispute relating to the election under sub-section (1) shall be referred to the 1[Federal\nGovernment] whose decision thereon shall be final."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Secretary",
      "content": "_(1) The Council shall appoint a Secretary on such terms and conditions as it\nmay think fit.\n(2) The Secretary may attend and take part in the proceedings of the Council but shall not be\nentitled to vote."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Powers of the Council",
      "content": "_(1) The general direction and administration of the affairs of the\nCollege shall vest in the Council which may exercise all such powers and do all such acts and things\nas may be exercised or done by the College.\n(2) In particular and without prejudice to the generality of the foregoing power, the Council\nmay___\n(a)    lay down the powers and functions of the officers of the College;\n(b)    hold examinations for the grant of Diplomas and admission to Fellowship of\nthe College;\n(c)    appoint Boards of Examiners to conduct examination in different subjects;\n(d)    appoint Committees of the Council and lay down the powers and functions of\nsuch Committees;\n(e)    appoint auditors and other officers and employees of the College;\n(f)    admit as Fellows the persons who have passed Fellowship examination and\nsigned the prescribed pledge;\n(g)    elect as Fellows, in the prescribed manner, from amongst the distinguished\nmedical graduates of not less than twenty years standing subject to the rules:\nProvided that, except during the first two years, not more than two persons shall be elected as\nFellows, in any one year;\n(h)    admit, subject to rules made in this behalf, distinguished persons as honorary\nFellows of the College:\nProvided that no physician or surgeon practising in Pakistan shall be admitted as an honorary\nFellow;\n(i)    lay down fees, subscription and other charges for Fellowship, admission to\nexamination and for such other matter as it may think fit; and\n(j)    do all such acts and things as may be necessary for the performance of the\nfunctions of the College."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Expulsion of Fellows",
      "content": "_(1) Where the Council is of the opinion that a Fellow is guilty of\nmisconduct or of any conduct derogatory to the dignity of a Fellow and the interest of the College\nrequires his expulsion from the Fellowship of the College, the Council may expel such Fellow by a\nresolution at a meeting specially called for the purpose passed by not less than two-thirds of the total\nnumber of members of the Council.\n(2) The Council may also expel a Fellow for any other reason by a resolution at a meeting\ncalled for the purpose passed unanimously by all the members of the Council.\n(3) The notice of every meeting called under sub-section (1) or sub-section (2) shall be given\nto the Fellow who is proposed to be expelled together with a statement of charges against him and\nevery such Fellow shall be entitled to submit an explanation of his conduct in writing and also to\nattend the meeting of the Council and show cause against his expulsion."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. The Executive Committee",
      "content": "_(1) There shall be an Executive Committee of the Council\nconsisting of the President, the Vice-President, the Treasurer, the Secretary and two members elected\nby the members of the Council from amongst themselves.\n(2) The Executive Committee shall exercise and perform such powers and functions of the\nCouncil in the management and conduct of the affairs of the College as may be entrusted to it by\nresolution of the Council or as the President may, in the case of emergency, require the Executive\nCommittee to exercise and perform."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Funds",
      "content": "_(1) All receipts of the College from any source whatever shall constitute the\nCollege Fund which shall be applied, subject to any rules made in this behalf, by the Council to meet\nall expenditure for the administration and management of the affairs of the College.\n(2) The Council shall make disbursment of College Funds by cheques signed by the Treasurer\nand the Secretary or by one member of the Executive Committee and the Secretary or by any two\nmembers of the Executive Committee."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Common Seal",
      "content": "_The common seal of the College shall be deposited at the office of the\nCouncil and shall not be used except by the authority of the Executive Committee and in the\npresence of two members of the Executive Committee and the Secretary each of whom shall append\nhis signature to the documents on which the common seal is affixed."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Accounts and audit",
      "content": "_The Council shall maintain in the prescribed manner the accounts\nof all receipt and expenditure of the College and such account shall be audited annually by such\nauditors as may be appointed by it in this behalf."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Budget and Annual Report",
      "content": "_(1) The Council shall, before the close of every financial\nyear, prepare an annual report of the working of the Council and a statement of the estimate of the\nreceipts and expenditure of the College for the next succeeding financial year, and present at the\nAnnual Meeting of the College the report and the statement which may be discussed at the meeting.\n(2) After the close of the Annual Meeting of the College, the Council shall approve the\nestimate of receipts and expenditure, with or without modification."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Meeting of the College",
      "content": "_(1) The Council shall, before the close of every financial year,\ncall at such time and place as it may think fit the annual meeting of the College___\n(a)     to receive and consider the annual report presented by the Council;\n(b)     to receive and discuss the statement of the estimate of receipt and expenditure\nof the College for the next succeeding financial year; and\n(c)     to transact such other business as the Council and the Fellows may think fit.\n(2) The Council may also from time to time call general meetings of the Fellows for the\npurposes of providing information or for discussion of matters concerning the welfare of the College\nand the Fellows and such other matters within the scope of the objects of the College as the Council\nmay think fit to present at such general meeting."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. The President, etc., of the Council to be public servant",
      "content": "_The President and other\nmembers of the Council, and every officer and servant of the College acting or purporting to act\nunder this Ordinance, shall be deemed to be public servants within the meaning of section 21 of the\nPakistan Penal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Bar to suits, etc",
      "content": "_No suit, prosecution of other legal proceedings shall lie against the\nCollege, Council or any person for anything which is in good faith done or intended to be done under\nthis Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "College",
      "definition": "the Pakistan College of Physicians and Surgeons established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Council",
      "definition": "the Council of the College constituted under section 6;",
      "source_provision": "sec2"
    },
    {
      "term": "Fellow",
      "definition": "a Fellow of the College;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under section 19.",
      "source_provision": "sec2"
    }
  ]
}
