{
  "id": "pk-pakistan-commissions-of-inquiry-act-1956-repeal-by-act-ix-of-2017-s-19",
  "type": "statute",
  "title": "Pakistan Commissions of Inquiry Act, 1956(Repeal by act iX of 2017 s.19)",
  "title_en": "Pakistan Commissions of Inquiry Act, 1956(Repeal by act iX of 2017 s.19)",
  "short_name": "PCOIA",
  "status": "repealed",
  "issued_date": "1956-04-10",
  "in_force_date": "1956-04-10",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap%2Baaw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Commissions of Inquiry Act, 1956(Repeal by act iX of 2017 s.19) (VI of 1956) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Act may be called the Pakistan\nCommissions of Inquiry Act, 1956.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "_\n(a) “Commission” means a Commission of Inquiry appointed or deemed to have been\nappointed under section 3 ; and\n(b) “ prescribed” means prescribed by rules made under section 12."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Appointment of Commission",
      "content": "_(1) The 2[Federal Government] may, if it is of opinion that it\nis necessary so to do, by notification3 in the official Gazette, appoint a Commission of Inquiry for the\npurpose of making an inquiry into any definite matter of public importance and performing such\nfunctions and within such time as may be specified in the notification, and the Commission so\nappointed shall make the inquiry and perform the functions accordingly.\n1 For Statement of Objects and Reasons, see Gaz. of P., dated the 4th April, 1956, Ext., p. 537.\nThe provisions of sections 2, 4,5,8,9,10 and 12 of this Act have been applied to Committee set up by Order no. 1/7/59­SB, dated the 15th May, 1959 (Gaz. of P., 1959, Ext., pp. 795­796),\nsee Gaz. of P., 1959, Ext., p. 832.\n2 Subs. by the Pakistan Commissions of Inquiry (Amdt.) Act, 1975 (24 of 1975), s. 2. for “Central Government”.\n3 For such notifn., see Gaz. of P., 1956, Ext., p. 1995.\n* Rep. by IX of 2017, s. 19(1), Act shall continue in force for purposes of clause (3) of Article 155 of the Constitution of the Islamic Republic of Pakistan.\n(2) The Commission may consist of one or more members appointed by the 1[Federal\nGovernment], and where the Commission consists of more than one member, one of them may be\nappointed as the President thereof."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers of Commission. The Commission shall have the powers of a Civil Court, while trying a",
      "content": "suit under the Code of Civil Procedure, 1908, in respect of the following matters, namely :___\n(a) summoning and enforcing the attendance of any person and examining him on oath;\n(b) requiring the discovery and production of any documents ;\n(c) receiving evidence on affidavits ;\n(d) issuing commissions for the examination of witnesses or documents."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Additional powers of Commission",
      "content": "_(1) Where the 1[Federal Government] is of opinion\nthat, having regard to the nature of the inquiry to be made and other circumstances of the case, all or\nany of the provisions of sub­section (2) or sub­section (3) or sub­section (4) 2[or sub­section (4A)] or\nsub­section (5) or sub­section (6) should be made applicable to a Commission, the 1[Federal\nGovernment] may, by notification in the official Gazette, direct that all or such of the said provisions\nas may be specified in the notification shall apply to that Commission and on the issue of such a\nnotification, the said provisions shall apply accordingly.\n(2) The Commission shall have power to require any person, subject to any privilege which may\nbe claimed by that person under any law for the time being in force, to furnish information on such\npoints or matters as, in the opinion of the Commission, may be useful for, or relevant to, the\nsubject matter of the inquiry.\n1 Subs. by the Pakistan Commissions of Inquiry (Amdt.) Act, 1975 (24 of 1975), s. 2, for “Central Government”.\n2 Ins. ibid., s. 3.\n(3) The President or any officer, not below the rank of a gazetted officer, specially authorised in\nthis behalf by the President may enter any building or place where the Commission has reason to\nbelieve that any books of account or other documents relating to the subject matter of the inquiry\nmay be found, and may seize any such books of account or documents or take extracts or copies\ntherefrom, subject to the provisions of section 102 and section 103 of the Code of Criminal\nProcedure, 1898 (Act V of 1898), in so far as they may be applicable.\n(4) The Commission shall be deemed to be a Civil Court and when any offence as is described in\nsection 175, section 178, section 179, section 180 or section 228 of the Pakistan Penal Code (XLV of\n1860), is committed in the view or presence of the Commission, the Commission may, after recording\nCriminal Procedure, 1898 ( Act V of 1998), forward the case to a magistrate having jurisdiction to try\nthe same and the magistrate to whom any such case is forwarded shall proceed to hear the complaint\nagainst the accused as if the case had been forwarded to him under section 482 of the Code of\nCriminal Procedure, 1898.\n1[4A. Where a Commission consists of, or the President thereof is Judge of the Supreme Court or\na High Court, the Commission shall have the same power as the High Court has to punish any person\nwho ____\n(a) abuses, interfers with or obstructs the process of the Commission in any way or disobeys\nany order of the Commission ;\n(b) Scandalizes the Commission or otherwise does anything which tends to bring the\nCommission or a member of the Commission in relation to his office into hatred, ridicule\nor contempt ;\n1 Ins. by the Pakistan Commissions of Inquiry (Amdt.) Act 1975, (24 of 1975), s. 3.\n(c) does anything which tends to prejudice the determination of a matter pending before the\nCommission ; or\n(d) does any other thing which, by any other law, constitutes contempt of court;\nProvided that fair comment made in good faith and in the Public interest on the working of the\nCommission or on its final report after the completion of the enquiry shall not constitute contempt of\nthe Commission.\n(4B) The exercise of the power conferred on a Commission by sub­section (4A) shall be regulated\nby rules made by the Supreme Court.]\n(5) Any proceeding before the Commission shall be deemed to be a judicial proceeding within the\nmeaning of sections 193 and 228 of the Pakistan Penal Code (XLV of 1860).\n(6) The Commission shall have the powers of a civil court, while trying a suit under the Code of\nCivil Procedure, 1908 (V of 1908), in respect of requisitioning any public record or copy thereof from\nany court or office."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Statements made by persons to the Commission. No statement made by a person in the",
      "content": "course of giving evidence before the Commission shall subject him to, or be used against him in, any\ncivil or criminal proceeding except a prosecution for giving false evidence by such statement :\nProvided that the statement___\n(a) is made in reply to a question which he is required by the Commission to answer; or\n(b) is relevant to the subject matter of inquiry."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Commission to cease to exist when to notified. The 1[Federal Government] may, if it is of",
      "content": "opinion that the continued existence of a Commission is unnecessary, by notification in the official\nGazette,\n1 Subs. by the Pakistan Commissions of Inquiry (Amdt.) Act, 1975 (24 of 1975), s. 2, for “Central Government”.\ndeclare that the Commission shall case to exist from such date as may be specified in this behalf in\nsuch notification, and thereupon, the Commission shall cease to exist."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Procedure to be followed by the Commission. The Commission shall subject to any rules that",
      "content": "may be made in this behalf, have power to regulate it's own procedure (including the fixing of places\nand times of its sittings and deciding whether to sit in public or in private) and may act\nnotwithstanding the temporary absence of any member or the existence of a vacancy among its\nmembers."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Protection of action taken in good faith. No suit or other legal proceedings shall lie against",
      "content": "the 1[Federal Government], the Commission or any member thereof, or any person acting under the\ndirection either of the 1[Federal Government] or of the Commission in respect of anything which is in\ngood faith done or intended to be done in pursuance of this Act or of any rules or orders made\nthereunder or in respect of the publication, by or under the authority of the 1[Federal Government] or\nthe Commission, of any report, paper or proceedings."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Members, etc., to be public servants. Every member of the Commission and every officer",
      "content": "appointed or authorised by the Commission to exercise functions under this Act shall be deemed to be\na public servant within the meaning of section 21 of the Pakistan Penal Code (XLV of 1860).\n2[10A.___(1) The 1[Federal Government] may, by notification in the official Gazette and subject\nto such conditions or restriction, if any, as may be mentioned in the notification, confer upon the\nCommission the power to order a police investigation into any matter coming before it.\n1 Subs. by the Pakistan Commissions of Inquiry (Amdt.) Act, 1975 (24 of 1975), s. 2,for “Central Government”.\n2 Section 10A ins. by the Pakistan Commissions of Inquiry (Amdt.) Ordinance, 1959 (38 of 1959), s. 2.\n(2) In conducting an investigation ordered under sub­section (1) the police shall exercise the\npowers conferred on the police in respect of a cognizable case by Chapter XIV of the Code of\nCriminal Procedure, 1898.]"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Act to apply to other inquiring authorities in certain cases. Where any authority (by",
      "content": "whatever name called), other than a Commission appointed under section 3, has been or is set up\nunder any resolution or order of the 1[Federal Government] for the purpose of making an inquiry into\nany definite matter of public importance and the 1[Federal Government] is of opinion that all or any\nof the provisions of this Act should be made applicable to that authority, the 1[Federal Government]\nmay, by notification in the official Gazette, direct that the said provisions of this Act shall apply to\nthat authority, and on the issue of such notification, that authority shall be deemed to be a\nCommission appointed under section 3 for the purpose of this Act."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to make rules. The 1[Federal Government] may, by notification in the official",
      "content": "Gazette, make rules to carry out the purposes of this Act."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. [Repeal of Ordinance XXIV of 1955.] Omitted by the Federal Laws (Revision and",
      "content": "Declaration) Ordinance, 1981 (27 of 1981), s. 3 and II Sch.]\n________________________\n1 Subs. by the Pakistan Commissions of Inquiry (Amdt.) Act, 1975 (24 of 1975), s, 2 for “Central Government”."
    }
  ],
  "definitions": [
    {
      "term": "Commission",
      "definition": "a Commission of Inquiry appointed or deemed to have been appointed under section 3 ; and",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under section 12.",
      "source_provision": "sec2"
    }
  ]
}
