{
  "id": "pk-pakistan-commissions-of-inquiry-act-2017",
  "type": "statute",
  "title": "Pakistan Commissions of Inquiry Act, 2017",
  "title_en": "Pakistan Commissions of Inquiry Act, 2017",
  "short_name": "PCOIA",
  "status": "in_force",
  "issued_date": "2017-03-28",
  "in_force_date": "2017-03-28",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2JwaJY%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Commissions of Inquiry Act, 2017 (IX of 2017) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, application, extent and commencement",
      "content": "(1) This Act may be\ncalled the Pakistan Commissions of Inquiry Act, 2017.\n(2) It shall apply to all Commissions of Inquiry constituted by the FederalGovernment.\n(3) It extends to the whole of Pakistan.\n(4) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or\ncontext,—\n(a)   \"Commission\" means a Commission of Inquiry appointed under section 3;\n(b)   \"Chairperson\" means the Chairperson of the Commission;\n(c)    \"CrPC\" means the Code of Criminal Procedure, 1898 (Act V of 1898);\n(d)    \"PPC\" means the Pakistan Penal Code, (Act XLV of 1860); and .\n(e)    \"rules\" means rules made under this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Constitution of Commission of Inquiry",
      "content": "(1) Whenever it is expedient to\nconduct an inquiryinto any definite matter of public importance, the Federal Government may,\nby notification in the official Gazette, constitute a Commission of Inquiry in accordance with\nthe provisions of this Act:\nExplanation.—\"matter of public importance\" includes a matter of general interest or\ndirect or vital concern to the public.\n(2)   The Federal Government shall, by Notification in the official Gazette, appoint\nthe members of the Commission and where more than one member are so appointed, the\nFederal Government shall designate one of the members to be the Chairman of the\nCommission.\n(3)   The Commission shall conduct the inquiry and perform its functions in\naccordance with the Terms of Reference specified in the notification.\n(4)   The Commission shall have all the powers vested in it under this Act.\n(5)    The Federal Government shall specify the time period within which such inquiry\nshall be concluded:\nProvided that the Federal Government may, on the request of the Chairman of the\nCommission,for reasons to be recorded, extend the time so specified.\n(6)   The Commission shall cease to exist on the conclusion of the inquiry conducted\nby it and submission of Final Report in respect thereof to the Federal Government."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers under the Code of Civil Procedure, 1908",
      "content": "(1) The Commission shall\nhave the powers of a civil court under the Code of Civil Procedure, 1908 (Act V of 1908) for\n(2)     Notwithstanding the generality of the powers given under sub-section (I), the\nCommission shall have the following powers, namely:—\n(a) summoning and enforcing the attendance of any person and examining him\non oath;\n(b) requiring the discovery and production of any documents;\n(c) receiving evidence on affidavits;\n(d) issuing commissions for the examination of witnesses or documents; and\n(e) requisitioning any public record or copy thereof from any court or office.\n(3) The Commission shall also have the power to require any person or authority,\nsubject to any privilege which may be claimed by that person or authority under any law for\nthe time being in force,to furnish information or documents on such points or matters as, in the\nopinion of the commission, may be useful for, or relevant to, the subject-matter of the inquiry."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Powers to forward case to magistrate. When any offence as is described in section",
      "content": "175, section 178, section 179, section 180 or section 228 of the PPC is committed in the view\nor presence of the Commission, the Commission may, after recording the facts constituting the\noffence and the statement of the accused as provided for in the CrPC, forward the case to a\nmagistrate having jurisdiction to try the same, who shall proceed to hear the complaint against\nthe accused as if the case had been forwarded to him under section 482 of the CrPC."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Powers of entry, search etc. The Chairman or any officer, not below the rank of an",
      "content": "officer of BS-18, specially authorised in this behalf by the Chairman,—\n(a) may enter any building or place where the Commission has reason to believe that\nany books of account or other documents relating to the subject matter of the\ninquiry may be found; and\n(b) may seize any such books of account or documents or take extracts or copies\ntherefrom, subject to the provisions of section 102 and section 103 of the CrPC,\nin so far as they may be applicable."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power to order police investigation. The Commission shall, for the purposes of this",
      "content": "Act, have the power to order a police investigation into any matter coming before it."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Power to punish for contempt",
      "content": "(1) The Commission shall have the same powers\nas that of a High Court to punish any person who—\n(a) abuses, interferes with or obstructs the process of the Commission in any way or\ndisobeys any order of the Commission;\n(b) scandalizes the Commission or otherwise does anything which tends to bring the\nCommission or a member of the Commission in relation to his office into hatred,\nridicule or contempt;\n(c) does anything which tends to prejudice the determination of a matter pending\nbefore the Commission; or\n(d) does any other thing which, by any other law, for the time being in force\nconstitutes contempt of court:\nProvided that fair comments made in good faith and in the public interest on the\nworking of the Commission or on its Final Report after the completion of the\nenquiry shall not constitute contempt of the Commission:\nProvided further that if the Chairperson of the Commission is a Judge of the\nSupreme Court the Commission shall have the powers of Supreme Court for the\npurposes of this sub-section.\nExplanation.—For the purposes of this sub-section, \"Judge\" includes the Chief\nJustice.\n(2) Exercise of the powers conferred on a Commission by this section shall be regulated\nby rules made by the Supreme Court."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Power to receive information. A person shall have the right to provide any",
      "content": "information or document, relating to a matter before the Commission, and the Commission may\nconsider such information or document."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Additional powers of the Commission. In case the specific nature of the inquiry so",
      "content": "requires, the Federal Government may, by notification in the official Gazette, confer the\nfollowing additional powers on the Commission for the purposes of this Act, namely:—\n(a) all the powers of a criminal court under the CrPC;\n(b) power to constitute special teams, consisting of officers from the executive\nauthorities and experts in specific fields, for the purposes of assisting the\nCommission in conducting an inquiry. The special teams shall have such powers\nas may be prescribed;\n(c) powers to constitute an international team and seek international cooperation\nfrom foreign countries or agencies to get information, documents, evidence and\nrecord or issue letters and interrogatories in accordance with applicable\ninternational instruments;\n(d) powers to issue, in accordance with the provisions of Order XXVI of the Code\nof Civil Procedure, 1908 (Act V of 1908), a Letter Rogatory or Letter of Request\nto the competent judicial authority in another country seeking its assistance in\nexamination and recording evidence of a witness residing within the jurisdiction\nof such authority; and\n(e) such other powers as are deemed necessary for conducting the inquiry."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Judicial proceedings. Any proceeding before the Commission shall be deemed to",
      "content": "be a judicial proceeding within the meaning of sections 193 and 228 of P PC."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Members etc., to be public servant. Every member of the Commission and every",
      "content": "officer appointed or authorised by the Commission to exercise functions under this Act shall\nbe deemed to be a public servant within the meaning of section 21 of PPC."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Executive authorities to act in aid of Commission",
      "content": "(1) It shall be the duty of all\nexecutive authorities in the Federation and the Provinces to act in aid of the Commission in the\ndischarge of its functions and to comply with any of its directions.\n(2) The Federal Government shall provide all necessary funds and facilities to enable"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Procedure of the Commission",
      "content": "(1) The Commission shall have the power to\nregulate its own procedure.\n(2) The Commission shall fix the places and times of its sittings and decide whether its\nproceedings shall be open or in camera.\n(3) The Commission shall act notwithstanding the temporary absence of any member\nor the existence of a vacancy among its members."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Report to be public. The Final Report or an interim report of the Commission shall",
      "content": "be made public:\nProvided that Final Report of the Commission shall be made public within thirty\ndays of the submission of the report to the Federal Government:\nProvided further that the Commission may, in the public interest, recommend to\nthe Federal Government that all or any part of the Final Report or an interim report may not\nbe made public."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Statements made by persons before the Commission. No statement made by a",
      "content": "person in the course of giving evidence before the Commission shall, except in accordance\nwith law, subject him to, or be used against him in, any civil or criminal proceeding except a\nprosecution for giving false evidence by such statement:\nProvided that the statement—\n(a) Is made in reply to a question which he is required by the Commission to answer;\nor\n(b) is relevant to the subject matter of inquiry."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Protection of action taken in good faith. No suit or other legal proceedings shall",
      "content": "lie against the Federal Government, the Commission or any member thereof, or any person\nacting under the direction either of the Federal Government or of the Commission in respect\nof anything which is in good faith done or intended to be done in pursuance of this Act or of\nany rules or orders made thereunder or in respect of the publication, by or under the authority\nof the Federal Government, or the Commission, of any report, paper or proceedings."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Power to make rules. The Federal Government may, by notification in the official",
      "content": "Gazette, make rules to carry out the purposes of this Act."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Repeal",
      "content": "(1) The Pakistan Commissions of Inquiry Act, 1956 (VI of1956) is hereby\nrepealed.\n(2) Notwithstanding the provisions of sub-section (1), the Pakistan Commissions of\nInquiry Act, 1956 (VI of 1956) shall continue in force for purposes of clause (3) of Article 155\nof the Constitution of the Islamic Republic of Pakistan."
    }
  ],
  "definitions": [
    {
      "term": "Commission",
      "definition": "a Commission of Inquiry appointed under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairperson",
      "definition": "the Chairperson of the Commission;",
      "source_provision": "sec2"
    },
    {
      "term": "CrPC",
      "definition": "the Code of Criminal Procedure, 1898 (Act V of 1898);",
      "source_provision": "sec2"
    },
    {
      "term": "PPC",
      "definition": "the Pakistan Penal Code, (Act XLV of 1860); and .",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act.",
      "source_provision": "sec2"
    }
  ]
}
