{
  "id": "pk-pakistan-council-for-science-and-technology-act-2017",
  "type": "statute",
  "title": "Pakistan Council for Science and Technology Act, 2017",
  "title_en": "Pakistan Council for Science and Technology Act, 2017",
  "short_name": "PCFSA",
  "status": "in_force",
  "issued_date": "2017-04-25",
  "in_force_date": "2017-04-25",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5lqbA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Council for Science and Technology Act, 2017 (XIV of 2017) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.― (1) This Act may be called the Pakistan",
      "content": "Council for Science and Technology Act, 2017.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,\n(a)     “Board” means the Board of Governors of the Council;\n(b)     “Chairperson” means head of the Council;\n(c)      “Council” means Pakistan Council for Science and Technology;\n(d)     “Executive Committee” means Executive Committee of the Board constituted\nunder section 11;\n(e)     “expert committee” means an expert committee of the Council constituted\nunder section 14;\n(f)     “member” means a member of the Board;\n(g)     “prescribed” means prescribed by regulations made under this Act;\n(h)     “President” means President of the Board;\n(i)     “regulations” means regulations made under this Act;\n(j)     “Resolution” means the Resolution notified vide Notification No. 3(5)/\n82-NSC, dated the I6th June, 1987 for constitution of the devised council\ndissolved under section 22; and\n(k)     “Vice-President” means Vice-President of the Board."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Council.― (1) On commencement of this Act, there shall stand",
      "content": "established a Council to be called as Pakistan Council for Science and Technology in accordance\nwith the provisions of the Act.\n(2) The Council shall be a body corporate having perpetual succession and a common seal,\nwith power, subject to the provisions of this Act, to acquire, sell and hold property, and shall by the\nsaid name sue and be sued through Chairperson.\n(3) The headquarters of the Council shall be at Islamabad and the Council may establish\nregional or sub-offices as required."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Functions of the Council",
      "content": "The Council shall―\n(a)    advise the Federal Government on all matters relating to the development of\nscience and technology in Pakistan;\n(b)    undertake policy research, organize study groups or task forces, formulate\npolicy proposals; monitoring and evaluation of science, technology and\ninnovation policy for achieving targets for the overall development of science\nand technology in the country;\n(c)    identify priority areas for research and development keeping in view futuristic\ndevelopments of science and technology;\n(d)    constitute expert committees in various disciplines for preparation of reports\non policies and issues of national importance in respect of science and\ntechnology;\n(e)    collect, update statistics and maintain database on science and technology\npotentials of the country;\n(f)    take measures for effective collaboration among academia, research and\ndevelopment organizations and industry for development of indigenous\nproducts or technologies;\n(g)    evaluation of national research and development activities including output of\nindividuals and institutions and to grant research productivity awards or\nincentives thereof; ·\n(h)    promote collaboration among national and international organizations for\ncapacity-building and other policy initiatives in the field of science and\ntechnology and to enter into memoranda of understanding, contracts etc., in\naccordance with the Rules of Business, 1973;\n(i)    participate in national science and technology planning and development\nactivities and providing advice on selection of projects;\n(j)    act as Secretariat of the National Commission for Science and Technology\n(NCST); and\n(k)    perform any other functions as may be assigned to it by the\nFederalGovernment."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Management",
      "content": "The management of the Council shall comprise―\n(a)    Board of Governors;\n(b)    Executive Committee; and\n(c)    Chairperson,"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Board of Governors",
      "content": "The general control and superintendence of the affairs of the\nCouncil shall vest in the Board."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Composition of the Board of Governors",
      "content": "(1) The Board of Governors shall consist of\nthe following, namely:\n(a)   Minister for Science and Technology                            President\n(b)   Secretary, Science and Technology Division                   Vice-President\n(c)   Secretary, Planning and Development Division                    Member\nor his nominee not below the rank of Additional\nSecretary\n(d)   Secretary, Finance Division or his nominee not below the        Member\nrank of Additional Secretary\n(e)   Executive Director, Higher Education Commission                 Member\n(f)   Secretary of the Division controlling subject                   Member\nmatter of education and training or his nominee not\nbelow the rank of Additional Secretary\n(g)   President, Pakistan Academy of Sciences or his nominee          Member\n(h)   Chairman, Pakistan Engineering Council                          Member\n(i)   Chairman, Pakistan Council of Scientific and Industrial         Member\nResearch\n(j)   Chairman, Pakistan Science Foundation                           Member\n(k)   Representatives of Provincial Governments not below the        Members\nrank of Provincial Secretary\n(l)   Five eminent Scientists from academia, one each from           Members\nfour provinces and federal capital to be nominated by the\nBoard\n(m) Two eminent industrialists to be nominated by the                Members\nFederal Government\n(n)   President, Federation of Pakistan Chamber of Commerce          Members\nand Industries, Islamabad\n(o)   dealing officer not below the rank of Joint Secretary of        Member\nthe Division controlling the subject matter of science and\ntechnology\n(p)   Two Parliamentarians, one each from Senate and                   Members\nNational Assembly, preferably with scientific knowledge\nand background\n(q)   Chairperson, Pakistan Council for Science and                     Member\nTechnology\n(2) The Chairperson shall act as Secretary of the Board.\n(3) The Federal Government may, by notification in the official Gazette, increase or decrease\nthe number of members of the Board.\n(4) The Board may co-opt any other professional or expert."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Functions and powers of the Board",
      "content": "(1) The Board shall—\n(a)    review and approve annual, long-term plans, policies and programmes\nof the Council;\n(b)    approve the annual development and non-development budget of the\nCouncil;\n(c)    create or abolish posts of such officers and staff and engage such consultants\nor experts as it may consider necessary for efficient performance of the\nfunctions of the Council, on such terms and conditions as may be prescribed;\n(d)    make regulations for the efficient conduct of the affairs of the Council;\nand\n(e)    recommend to the Government to terminate the tenure of the Chairperson\nbefore its expiry in case of unsatisfactory performance.\n(2) The Board may, by general or special order in writing, direct that such of its powers shall,\nin such circumstances and under such conditions, if any, as may be specified in the order, be\nexercised, by the Executive Committee, Chairperson or an officer of the Council."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Term of office of members",
      "content": "(1) Save as hereinafter provided, a member, other than an\nex officio member, shall hold office for a period of three years from the date of his nomination and\nshall be eligible for re-nomination for a further period not exceeding another term.\n(2) A person who becomes, or is nominated to be, a member by virtue of his holding an office\nor appointment shall cease to be a member when he ceases to hold that office or appointment.\n(3) A member, other than an ex officio member, may at any time resign his membership by\nwriting under his hand addressed to the Federal Government.\n(4) A vacancy caused by resignation or any other reason shall be filled by nomination of a\nperson qualified to fill such vacancy.\n(5) No act or proceeding of the Board shall be invalid merely on the ground of existence of a\nvacancy in constitution of the Board."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Meetings of the Board",
      "content": "(1) Save as hereinafter provided, the Board shall regulate the\nprocedure for its meetings.\n(2) Meetings of the Board shall be called and presided by its President or in his absence by\nthe Vice-President on such date, time and place as deemed fit provided that at least two meetings\nshall be held in a year.\n(3) At least ten members shall constitute the quorum for a meeting of the Board."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Executive Committee of the Board",
      "content": "(1)Notwithstanding anything contained in this\nAct, the Executive Committee shall take decisions on behalf of the Board subject to ratification by\nthe Board at its meeting immediately following the meeting of the Executive Committee unless\notherwise authorized by the Board.\n(2) The Executive Committee shall comprise the following members, namely:—\n(a)          Chairperson of the Council                     Chairperson\n(b)          one member to be nominated by                    Member\nthe Board\n(c)          dealing officer not below the                    Member\nrank of Joint Secretary of the\nDivision controlling subject\nmatter     of    science   and\ntechnology\n(d)          Secretary of the Council                         Member\n(3) The Secretary of the Council shall act as the Secretary of the Executive Committee.\n(4) Subject to the provisions of this Act and regulations made in this behalf and such general\nor special directions as may, from time to time, be given by the Board, the Executive Committee\nshall deal with any matter as authorized by the Board."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Chairperson of the Council",
      "content": "The Chairperson shall be an eminent scientist or engineer\nholding a Ph.D degree with sufficient relevant experience to be appointed by the Prime Minister on\nrecommendations of the Federal Government for a term of three years extendable for another term\non such terms and conditions as may be prescribed."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Powers and functions of the Chairperson",
      "content": "The Chairperson, who shall be the Chief\nExecutive Officer of the Council, shall work under the general policy guidelines of the Board and\nhave such powers, functions and duties as may be conferred or vested in him by or under this Act,\nincluding—\n(a) formulation of research policies, plans and their submission to the Board for\napproval;\n(b) protection of all assets of the Council including intellectual property assets;\n(c) preparation of annual report of the Council for submission to the Federal\nGovernment;\n(d) for the purpose of ensuring efficient functioning of the Council and to facilitate its\nday-to-day functions, delegation to the Secretary or other officers of the Council,\nsuch of his powers or duties as he may consider necessary from time to time; and\n(e) appointment of such officers and employees subject to the provisions of relevant\nregulations, as may be necessary for efficient performance of functions of the\nCouncil on such terms and conditions as may be prescribed."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Expert committees",
      "content": "(1) The Council may constitute expert committees, in important\nscientific, technological and engineering disciplines to review current status and suggest policy\nmeasures for their future development.\n(2) The expert committees shall have such powers and perform such functions as may be\nassigned by the Council."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Fund of the Council",
      "content": "There shall be a Fund of the Council to be called the PCST Fund\nto which shall be credited—\n(a)    funds of the devised council being dissolved under section 22, which shall\nstand transferred to the Council;\n(b)    grants from the Governments;\n(c)    donations and endowments;\n(d)    funds generated through its own resources; and\n(e)    research grants."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Budget and accounts",
      "content": "(1) The Chairperson shall, in respect of each financial year,\nsubmit for the approval of the Board, a statement showing all the expenditures incurred during the\nyear alongwith estimated receipts and expenditures for the next financial year.\n(2) The Council shall, by such date and in such form as may be prescribed, submit to the\nFederal Government for approval of its budget for each financial year showing the estimated receipts\nand expenditures and the sums which are likely to be required from the Federal Government during\nthe financial year.\n(3) The accounts of the Council shall be maintained in such form and manner as determined\nby the Federal Government.\n(4) The accounts of the Council shall be audited by the Auditor-General of Pakistan."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Appointment of officers, staff, etc",
      "content": "(1) The Council may, from time to time, appoint\nsuch officers and staff as it may consider necessary for the efficient performance of its functions, on\nsuch terms and conditions as may be prescribed.\n(2) The Council may engage experts or consultants on such terms and conditions as may be\nprescribed."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Submission of reports. etc",
      "content": "The Council shall submit to the Federal Government at\nsuch time and at such intervals, as the Federal Government may specify,—\n(a)    annual report on working of the Council;\n(b)    such periodical reports and summaries as may be required by the Federal\nGovernment;\n(c)    such periodical returns, accounts, statements and statistics as may be required\nby the Federal Government;\n(d)    information and comments asked for by the Federal Government on any\nspecific point;\n(e)    copies of the documents required by the Federal Government; and\n(f)    original documents required by the Federal Government for examination\nor any other purpose."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Directives from the Federal Government",
      "content": "The Federal Government may, from time\nto time, issue to the Council such directives and orders in writing, as it may consider necessary for\ncarrying out the purpose of this Act and the Council shall be bound to follow and carry out such\ndirectives and orders."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Declaration of fidelity and secrecy",
      "content": "Every member, expert, officer or other employee\nof the Council shall make such declaration of fidelity and secrecy as may be prescribed."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Continuance of certain rules, etc",
      "content": "All rules, regulations and byelaws related to the\nCouncil and in force immediately before the commencement of this Act shall, mutatis mutandis and\nso far as they are not inconsistent with any of the provisions of this Act, apply and continue in force\nuntil repealed or amended or altered."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Repeal and Savings",
      "content": "(1) The Ministry of Science and Technology's Resolution notified\nvide No. 3(5)/82-NSC, dated the 16th June, 1987 is hereby repealed and the Pakistan Council of\nScience and Technology, hereinafter referred to as the devised council, reconstituted there under\nshall stand dissolved.\n(2) Upon dissolution of the devised council under sub-section (1),—\n(a)    all assets, rights, powers, authorities, privileges and property, movable and\nimmovable, cash and bank balance, reserve funds, investments and all other\ninterests and rights in, liabilities and obligations of whatever kind of the\ndevised council subsisting immediately before its dissolution shall stand\ntransferred to and vest in the Council;\n(b)    all officers and other employees of the devised council shall, notwithstanding\nanything contained in any law, agreement, deed, document or other\ninstrument, stand transferred to the Council on the exercise of one-time\nirrevocable option to either remain a civil servant under the Civil Servants\nAct, 1973 (LXX1 of 1973) and shall be entitled to all the privileges and\nfacilities of the Federal Government such as pension, gratuity, housing, health,\netc. or to become an employee of ,the Council, in accordance with their\nexisting terms and condition of the service applicable to them and no officer\nor other employee whose services are so transferred shall be entitled to any\ncompensation because of such transfer;\n(c)     all debts and obligations incurred or contracts entered into or rights acquired\nand all matters and things engaged to be done by, with or for the devised\ncouncil before its dissolution shall be deemed to have been incurred, entered\ninto, acquired or engaged to be done by, with or for the Council;\n(d)     all suits and other legal proceedings instituted by or against the devised\ncouncil, before its dissolution, shall be deemed to be suits and proceedings by\nor against the Council and may be proceeded or otherwise dealt with\naccordingly; and\n(e)     all actions done by the devised council before the commencement of\nthis Act shall be deemed to be done under this Act."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Exemption from taxes",
      "content": "Notwithstanding anything contained in the Income Tax\nOrdinance, 2001 (XLIX of 2001) or any other law for the time being in force relating to income tax,\nthe Council shall not be liable to pay any such tax on its income, capital, profit, wealth, gifts or gains\nand any movable and immovable property."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Power to make regulations",
      "content": "The Board may, by notification in the official Gazette,\nmake regulations, not inconsistent with the provisions of this Act, for carrying out the purposes of\nthis Act."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to any provision of this\nAct, the Federal Government may make such order, not inconsistent with the provisions of this Act,\nas may appear to it to be necessary or expedient for the purpose of removal of such difficulty:\nProvided that such power shall not be exercised after expiry of two years from the\ncommencement of this Act.\n____________________"
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Board of Governors of the Council;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairperson",
      "definition": "head of the Council;",
      "source_provision": "sec2"
    },
    {
      "term": "Council",
      "definition": "Pakistan Council for Science and Technology;",
      "source_provision": "sec2"
    },
    {
      "term": "Executive Committee",
      "definition": "Executive Committee of the Board constituted under section 11;",
      "source_provision": "sec2"
    },
    {
      "term": "expert committee",
      "definition": "an expert committee of the Council constituted under section 14;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "President",
      "definition": "President of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Resolution",
      "definition": "the Resolution notified vide Notification No. 3(5)/ 82-NSC, dated the I6th June, 1987 for constitution of the devised council dissolved under section 22; and",
      "source_provision": "sec2"
    },
    {
      "term": "Vice-President",
      "definition": "Vice-President of the Board.",
      "source_provision": "sec2"
    }
  ]
}
