{
  "id": "pk-pakistan-council-of-architects-and-town-planners-ordinance-1983",
  "type": "statute",
  "title": "Pakistan Council of Architects and Town Planners Ordinance, 1983",
  "title_en": "Pakistan Council of Architects and Town Planners Ordinance, 1983",
  "short_name": "PCOAA",
  "status": "in_force",
  "issued_date": "1983-03-06",
  "in_force_date": "1983-03-06",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpmY-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Council of Architects and Town Planners Ordinance, 1983 (IX of 1983) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Chairman and Vice Chairman. (1) The Council shall have a Chairman who shall be an",
      "content": "architect of not less than fifteen years' experience and two Vice Chairmen, one being an architect and\nthe other a town planner of not less than fifteen years' experience, to be elected by the members from\namongst themselves in the prescribed manner.\n(2) Notwithstanding anything contained in sub-section (1), for a period of 2[two years] from\nnominated by the Federal Government under clauses (i) and (ii) of sub-section (5) of section 3.\n(3) The Chairman and Vice Chairmen shall, subject to sub-section (2), hold office for a term\nof two years.\n(4) No person shall be qualified to be elected as, or to be, Chairman or Vice Chairman for more\nthan two consecutive terms."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Annual general meeting of the Council. (l) An annual general meeting of the Council shall",
      "content": "be held at the headquarters of the Council at such time as may be appointed by the Executive\nCommittee.\n1\nSubs. by the Pakistan Council of Architects and Town Planners (Amdt.) Ordinance, 1984 (41 of 1984), s. 2, for “one year”.\n2\nSubs. ibid., s. 3, for “one year”.\n(2) The following business may be transacted at the annual general meeting, namely:—\n(a)     presentation of annual report;\n(b)     presentation of audited accounts;\n(c)     presentation of annual budget;\n(d)     appointment of auditors; and\n(e)     such other business as may be placed before the meeting by the Executive\nCommittee or as the meeting may decide."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Extraordinary general meeting of the Council",
      "content": "(1) An extraordinary general meeting of\nthe Council shall be called by the Chairman at the headquarters of the Council\n(a)     within fourteen days of the receipt by him of a requisition signed by not less\nthan fifty members and stating the business proposed to be transacted at the\nmeeting; or\n(b)     at any time, if the holding of such meeting for the consideration of any urgent\nmatter is in his opinion necessary.\n(2) At a meeting called in pursuance of clause (a) of sub-section (1), no business other than the\nbusiness stated in the requisition referred to in that clause shall be transacted."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. General provisions relating to meetings of the Council.(1) An annual or extraordinary",
      "content": "general meeting of the Council shall be held and conducted in accordance with the bye-laws.\n(2) To constitute a quorum at an annual or extraordinary general meeting of the Council, the\npresence of not less than fifty members shall be necessary:\nProvided that, in respect of the Council constituted under sub-section (5) of section 3 this sub-\nsection shall have effect as if for the word “fifty” therein the word “five” were substituted.\n(3) All decisions of the Council at an annual or extraordinary general meeting shall be taken\nby majority of the members present and voting."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Function of the Council. The following shall be the function of council, namely",
      "content": "(a)     maintenance of two Registers, one for persons qualified to practise as architects\nand the other for persons qualified to practise as town planners, and two lists,\none for persons eligible to practise as unregistered architects and the other for\npersons eligible to practise as unregistered town planners;\n(b)     recognition of architectural and town planning qualifications for the purpose of\nregistration of architects and town planners;\n(c)     removal of names, from the Register and restoration to the Register of names\nwhich have been removed;\n(d)     laying down of standards of conduct for the members;\n(e)     safeguarding the interests of the members;\n(f)     assisting the Government and national institutions in identification and solution\nof national problems relating to architecture and town planning;\n(g)     promotion of reforms in the architectural and town planning professions;\n(h)     management of the funds and properties of the Council;\n(i)     promotion of architectural and town planning education and review of courses\nof studies in consultation with the Universities and recognised institutions and\nadvising the Government in the matter of architectural and town planning\neducation;\n(j)     levy and collection of fees from applicants for registration or temporary licences\nand from members ;\n(k)     exercise of such disciplinary powers over the members and servants of the\nCouncil as may be prescribed;\n(l)     formation of such committees as may be prescribed;\n(m)     making recommendation to the Government for recognition of a professional\narchitectural institute and a professional town planning institute to conduct\nexaminations and prepare such other functions as the Council may deem\nnecessary; and\n(n)     performance of all other functions connected with, or ancillary or incidental to,\nthe aforesaid functions."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Executive Committee",
      "content": "(1) There shall be an Executive Committee of the Council for the\nmanagement of the affairs of the Council and for performing the functions assigned to the Council by\nor under this Ordinance.\n(2) The Executive Committee shall be composed of the following persons, namely:\n(a)     the Chairman and Vice Chairmen of the Council who shall also be the Chairman\nand Vice­ Chairmen respectively of the Executive Committee;\n(b)     the Registrar;\n(c)     ten members, six being architects and four being town planners elected\nrespectively by architects and town planners; and\n(d)     two members, one being an architect and the other a town planner, to be\nnominated by architectural and town planning institutions in Pakistan.\n(3) Notwithstanding anything contained in sub-section (2), for a period of 1[two years] from\nnominated by the Federal Government under sub-section (5) of section 3.\n(4) The members of the Executive Committee, other than the Registrar, shall, subject to sub-\nsection (3), hold office for a term of two years and shall not hold office for more than two consecutive\nterms.\n(5) No person shall be qualified to be elected as, or to be, a member of the Executive Committee\nif he does not possess five years' experience and is registered after the thirtieth day of June of the year\nin which the election is to be held or, as the case may be, nomination is to be made.\n(6) The election of members of the Executive Committee under sub-section (2) shall be held\nso as to conclude not less than fifteen days before the term of the outgoing members is due to expire."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Recognition of architectural and town planning qualifications granted by institutions",
      "content": "in Pakistan.—(1) The architectural and town planning qualifications granted by the institutions in\nPakistan which are included in the First Schedule shall be the recognised qualifications for the purposes\nof this Ordinance.\n(2) Any architectural or town planning institution in Pakistan which grants an architectural or\ntown planning qualification not included in the First Schedule may apply to the Council to have such\nqualification recognised and the Council may, by notification in the official Gazette, amend the First\nSchedule so as to include such qualification therein."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Recognition of architectural and town planning qualifications granted by institutions",
      "content": "abroad.—(1) The architectural and town planning qualifications granted by institutions outside\nPakistan which are included in the Second Schedule shall be recognised qualifications for the purposes\nof this Ordinance.\n(2) Any architectural or town planning qualification granted by an institution outside Pakistan\nnot included in the Second Schedule may be recognised by the Council, and Council may, by\nnotification in the official Gazette, amend the Second Schedule so as to include such qualification\ntherein."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Grant of temporary licences",
      "content": "(1) The Executive Committee may grant to any person\ndomiciled outside Pakistan who does not hold any recognised architectural or town planning\nqualifications but who holds an equivalent diploma or degree in architecture or town planning from an\ninstitution recognised by the Council and who is a corporate member of an architectural or town\nplanning body, society, institute or association recognised by the Council, a temporary licence for a\nspecific project to work as an associate of an architect or town planner, who shall sign and seal the\nplans and specifications for the project.\n(2) Any person to whom a temporary license has been granted shall, during the period for which\n1\nSubs. by the Pakistan Council of Architects and Town Planners (Amdt.) Ordinance, 1984 (41 of 1984), s. 4, for “one year”."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Power to require information as to courses of study and examination. Every institution",
      "content": "in Pakistan which grants a recognised architectural or town planning qualification shall furnish such\ninformation as the Council may, from time to time, require as to the courses of study and examination\nto be undergone in order to obtain such qualification."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Inspection of examination",
      "content": "(1) The Council shall appoint such number of inspectors as\nit may deem requisite to attend at any or all of the examinations held by the institutions in Pakistan\nand the recognised professional architectural institutes and the recognised professional town planning\ninstitutes for the purpose of granting architectural or town planning qualifications which are recognised\narchitectural and town planning qualifications or in respect of which recognition has been sought.\n(2) Inspectors appointed under sub-section (1) shall not interfere with the conduct of any\nexamination but they shall report to the Council on the sufficiency of the examination which they\nattend and on the courses of study and facilities for teaching provided by the institution in question at\ndifferent stages in respect of such examination, and on any other matter in regard to which the Council\nmay require them to report."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Withdrawal of recognition. When, upon report by an inspector, it appears to the Council",
      "content": "that the courses of study and examination to be gone through in any institution in Pakistan in order to\nobtain a recognised architectural or town planning qualification or the standards of proficiency\nrequired from candidates in any examination held for the purpose of granting such qualification are\nnot such as to secure to persons holding such qualification the knowledge and skill requisite for the\nefficient practice of architecture or town planning, the Council shall forward the report to the institution\nconcerned with an intimation of the period within which it may submit its explanation to the Council.\n(2) On receipt of the explanation or, where no explanation is submitted within the specified\nperiod, on the expiry of that period, the Council, after making such further inquiry, if any, as it may\nthink fit, may, by notification in the official Gazette, direct that an entry shall be made in the First\nSchedule against the architectural or, as the case may be, town planning qualification to which the\nexplanation relates declaring that it shall be a recognised architectural or town planning qualification\nonly when granted before a specified date 1[:]\n2\n[Provided that, before issuing a direction as aforesaid, the Council shall give the institution\nconcerned an opportunity of being heard.]"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Maintenance of Register, etc",
      "content": "(1) The Council shall maintain in the prescribed manner—\n(a)        two separate Registers in which shall be entered the names and other particulars\nof persons possessing recognised architectural qualifications or, as the case may\nbe, town planning qualifications whose applications for registration as architects\nor town planners are from time to time granted by the Council; and\n1\nSubs. by the Pakistan Council of Architects and Town Planners (Amdt.) Ordinance, 1984 (41 of 1984), s. 5, for full-stop.\n2\nProviso added ibid.\n(b)    two separate Lists, hereinafter referred to as the Lists, in which shall be entered\nthe names and other particulars of persons not possessing any of the aforesaid\nqualifications who were licensed as architects or, as the case may be, town\nplanners by any public sector agency before the date appointed under\nsub-section (1) of section 28 and who are declared by the Executive Committee,\nafter carrying out proper scrutiny by way of examination or otherwise, to be\neligible to practise as unregistered architects or unregistered town planners, as\nthe case may be.\n(2) Every application for registration under this Ordinance, or for the inclusion of name in\neither of the Lists, shall be made to the Council in the prescribed form and be accompanied by the\nprescribed fee.\n(3) Every person whose name is entered in a Register or in either of the Lists shall be entitled\nto receive a certificate of registration or, as the case may be, a certificate of entry of name in the List,\nunder the hand of the Registrar.\n(4) A certificate issued under sub-section (3) shall, subject to the provisions of this Ordinance,\nremain in force until the thirty-first day of December of the year in which it is issued and shall thereafter\nbe renewable annually upon payment of the prescribed fee."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Registration",
      "content": "(1) Every application for registration shall be considered by an Enrolment\nCommittee consisting of the Chairman and Vice-Chairmen and three other members, being architects\nor town planners of not less than ten years' standing, nominated by the Executive Committee.\n(2)The Enrolment Committee may either permit or refuse to permit the registration of any\nperson:\nProvided that the Enrolment Committee shall not refuse permission for registration unless-\n(a)    the applicant has been convicted of any such offence as implies in its opinion\ndefect of character; or\n(b)    it has reason to believe that the applicant has been guilty of infamous conduct\nin any professional respect; or\n(c)    the applicant is unfit to practise on any other ground, including mental ill\nhealth."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Appeal against refusal to permit registration. Any person aggrieved by an order under",
      "content": "sub- section (2) of section 17 refusing to permit the registration of his name in the Register may, within\nthirty days of the communication of the order, prefer an appeal to the Executive Committee.\n(2) Upon the receipt of an appeal under sub-section (1), the Executive Committee may, after\nholding such inquiry as it may consider necessary and giving the appellant an opportunity of being\nheard in person or through an advocate, pass such order as it may deem fit."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Revision of register",
      "content": "(1) the registrar shall remove form the register the name of any\narchitect or town planner—\n(a)     who has died ; or\n(b)     who has failed to have his certificate of registration renewed within one year of\nthe date of its expirty ; or\n(c)     whose name has been directed under sub section (7) of section 22 to be removed\nfrom the register.\n(2) The Registrar shall restore to the Register the name of any architect or town planner whose\nname has been removed from the Register under clause (b) of sub-section (1) if such architect or town\nplanner applies for such restoration and pays the prescribed fee.\n(3) The Council may, in its discretion, after the expiry of not less than one year following the\nremoval from the Register of the name of any architect or town planner, grant registration to such\narchitect or town planner if he applies for registration."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Complaints against architects or town planners",
      "content": "(1) If at any time a complaint is made\nto the Council by any person as to the work or conduct of any architect or town planner, the Executive\nCommittee may refer the matter for inquiry and report to an inquiry committee appointed by it.\n(2) If, upon the receipt of such report, the Executive Committee considers that a prima facie\ncase for the removal from the Register of the name of the architect or town planner to whom the\ncomplaint relates has been established, the Executive Committee may refer the case to a Tribunal."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Tribunals of Inquiry",
      "content": "(1) For holding inquiries into the professional conduct of\narchitects and town planners, the Executive Committee may constitute as many Tribunals of Inquiry\nas it may consider necessary.\n(2) A Tribunal shall consist of three members appointed by the Executive Committee.\n(3) The Executive Committee shall appoint one of the members of the Tribunal to be the\nChairman thereof."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Procedure in inquiries, etc",
      "content": "(1) In inquiries relating to the professional conduct of an\narchitect or town planner, the Tribunal shall, except as hereinafter provided, follow such procedure as\nmay be prescribed.\n(2) The Tribunal shall fix a date for the hearing of the case and shall cause notice of the day so\nfixed to be given to the complainant and the architect or town planner concerned, hereafter in this\nsection referred to as the respondent, and shall afford to the complainant and the respondent an\nopportunity of leading evidence, if any, and of being heard before recommendations are made in the\ncase.\n(3) The Chairman of the Tribunal may empower a member of the Tribunal to consider and\ndecide preliminary issues and to record evidence.\n(4) On completion of the inquiry, the Tribunal may recommend to Executive Committee—\n(a)     dismissal of the complaint ; or\n(b)     imposition of any of the following penalties on the respondent, namely :—\n(i)     reprimand ;\n(ii)    removal of name from the Register for a period not exceeding twelve\n(iii)   months ; removal of name from the Register altogether ; or’\n(c)     prosecution of the respondent for the offence constituted by his conduct.\n(2) The Tribunal may make such recommendation to the Executive Committee as to the cost\nof the proceedings before it as it may deem fit, and, where the Tribunal is of the opinion that a\ncomplaint made against a respondent is false and vexatious, it may, in addition and without prejudice\nto any other remedy available to the respondent, recommend imposition upon the complainant of costs\nnot exceeding a sum of ten thousand rupees and payment to the respondent of the whole or any part of\nthe costs recovered from the complainant.\n(3) In any case in which it has recommended the imposition of any penalty on, or the\nprosecution of, the respondent, the Tribunal may also recommend that an amount not exceeding twice\nthe amount of the fee received by the respondent from the complainant may be recovered from the\nrespondent and paid to the complainant as compensation.\n(4) The Executive Committee shall meet to consider the recommendations of the Tribunal\nwithin a period of six weeks from the date of receipt thereof and pass such orders as it may deem fit.\n(5) Any order of the Executive Committee as to the costs of the proceedings before the Tribunal\nor as to the recovery of any amount from a complainant or a respondent shall be executable as if it\nwere a decree of a civil court.\n(6) When any architect or town planner is reprimanded under this Ordinance, a record of the\npunishment shall be entered against his name in the Register."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Review",
      "content": "(1) The Executive Committee may, within thirty days of its order under\nsub-section (7) of section 22, either of its own motion or on application made to it in that behalf, review\nand, while so reviewing, modify, reverse or confirm the order.\n(2) An order shall not be modified or reversed unless reasonable notice has been given to the\nparties affected thereby to appear and be heard. ."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Powers of the Tribunal",
      "content": "(1) For the purpose of any such inquiry as aforesaid, a Tribunal\nshall have the same powers as are vested in a Court under the Code of Civil Procedure, 1908 (Act V\nof 1908), in respect of the following matters, namely:—\n(a)     enforcing the attendance of any person;\n(b)     compelling the production of documents; and\n(c)     issuing commissions for the examination of witnesses.\n(2) Every such inquiry shall be deemed to be a judicial proceeding within the meaning of\nsections 193 and 228 of the Pakistan Penal Code (Act XLV of 1860), and a Tribunal shall be deemed\nto be a civil court for the purposes of section 480 and 482 of the Code of Criminal Procedure, 1898\n(Act V of 1898).\n(3) For the purposes of enforcing the attendance of any person or of compelling the production\nof documents or issuing commissions,—\n(a)     the jurisdiction of a Tribunal shall extend to the whole of Pakistan; and\n(b)     a Tribunal may send to any civil court having jurisdiction in the place where the\nTribunal is sitting any summons or other process for the attendance of a witness\nor the production of documents required by the Tribunal, or any commission\nwhich it desires to issue, and the civil court shall serve such process or issue\nsuch commission, as the case may be, and may enforce any such process as if it\nwere a process for attendance or production before itself.\n(4) Proceedings before a Tribunal in any such inquiry shall be deemed to be civil proceedings\nfor the purposes of section 132 of the Evidence Act, 1872 (1 of 1872), and the provisions of that section\nshall apply accordingly."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Fund of the Council, accounts and audit",
      "content": "(1) All sums received by the Council as fees,\ngrants, donations or subscription shall form part of a fund which shall be managed, administered and\nutilised in such manner as may be prescribed.\n(2) The Executive Committee shall cause to be maintained such books of account and other\nbooks in such form and manner as may be prescribed.\n(3) The accounts of the Council shall be audited before the thirtieth day of November each year\nby an auditor appointed by the Council who is a chartered accountant within the meaning of the\nChartered Accountants Ordinance, 1961 ( X of 1961)."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Bye",
      "content": "laws of the council.— (1) the council may make bye-laws for carrying out the\npurposes of this ordinance.\n(2) In particular and without prejudice to the generality of the foregoing power, such bye-laws\nmay provide for all or any of the following matters, namely:—\n(a)     the summoning and holding of meetings of the Council and Executive\nCommittee, the time and places where such meetings are to be held, the conduct\nof business and the number of members necessary to constitute a quorum at a\nmeeting of the Executive Committee\n(b)     the powers and duties of the Chairman and Vice­Chairmen;\n(c)     the terms of office and powers and duties of the Registrar and other officers and\nservants of the Council;\n(d)     the appointment, powers, duties and procedure of inspectors;\n(e)        the procedure for maintenance and publication of the Register, the fees to be\ncharged under this Ordinance and establishment of sub-offices or branches of\nthe Council;\n(f)        the management of the property of the Council and the maintenance and audit\nof its accounts;\n(g)        the procedure at any inquiry held under section 22; and\n(h)        any other matter which is to be or may be prescribed.\n(3) The first Council shall make the bye-laws within 1[two years] of its assuming office and\nshall also frame a Code of Professional Conduct for architects and town planners.\n(4) The Code of Professional Conduct framed under sub-section (3) may be amended, modified\nor repealed by the Council."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Proof of membership, etc. For the purposes of any action or proceeding under this",
      "content": "Ordinance, a certificate of the Registrar certifying under the seal of the Council that, on a specified\ndate, the name of a person was or was not borne on the Register shall be proof of its contents and of\nthe authenticity of his signature, until the contrary is proved."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Penalties and procedure",
      "content": "(1) After such date as the Federal Government may, after\nconsultation with the Council, by notification in the official Gazette, appoint in this behalf, whoever\nundertakes any professional architectural or town planning work shall, if his name is not for the time\nbeing borne on the Register or on either of the Lists, be punishable with fine which may extend to five\nthousand rupees, and in the case of a continuing offence, with a further fine which may extend to two\nhundred rupees for every day after the first day during which the offence continues.\n(2) Whoever wilfully procures or attempts to procure himself to be registered under this\nOrdinance as an architect or town planner, or to have his name entered in either of the Lists, by making\nor producing or causing to be made or produced any false or fraudulent representation or declaration,\neither orally or in writing, and any person who assists him therein, shall be punishable with fine which\nmay extend to five hundred rupees\n(3) Whoever falsely pretends to be registered under this Ordinance or to have his name borne\non either of the Lists, or not being registered under this Ordinance or having his name borne on either\nof the Lists, uses with his name any words or letters representing that he is so registered or his name\nis so borne, irrespective of whether any person is actually deceived by such pretence or representation\nor not, shall be punishable with fine which may extend to five hundred rupees.\n(4) No person undertaking any professional, architectural or town planning work shall, unless\nhe is registered under this Ordinance or his name is borne on either of the Lists, be entitled to recover\nbefore any court or other authority any sum of money for service rendered in such work.\n1\nSubs. by the Pakistan Council of Architects and Town Planners (Amdt.) Ordinance, 1984 (41 of 1984), s. 6, for “six months”.\n(5) No court shall take cognizance of any offence punishable under this Ordinance save on a\ncomplaint made by, or under the authority of, the Council.\n(6) No court inferior to that of a Magistrate of the first class shall try any offence punishable\nunder this Ordinance."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Infringement of Code of Professional Conduct. Any infringement of the Code of",
      "content": "Professional Conduct framed under sub-section (3) of section 26 shall make a registered person liable\nto have his name removed from the Register."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Certain provisions to apply to unregistered architects and town planners. The",
      "content": "provisions of sections 19, 20, 21, 22, 23 and 24, sub-section (3) of section 26, and sections 27, 28 and\n29 shall mutatis mutandis apply to unregistered architects and unregistered town planners whose names\nare borne on the Lists."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Power to exempt. The Federal Government may, either on the recommendation of the",
      "content": "Council or of its own motion, by notification in the official Gazette, exempt any person or class of\npersons, or any architectural or town planning works or class of such works, from the operation of the\nprovisions of section 28, subject to such conditions, if any, as may be specified in the notification."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Commission of Inquiry",
      "content": "(1) Whenever it is made to appear to the Federal Government\nthat the Council is not complying with any of the provisions of this Ordinance, the Federal Government\nmay refer the particulars of the complaint to a Commission of inquiry consisting of—\n(a)     a person who is, or has been, or is qualified to be, a Judge of a High Court, to\nbe appointed by the Federal Government;\n(b)     an architect or town planner, to be nominated by the Federal Government; and\n(c)     an architect or town planner, to be nominated by the Council.\n(2) The Commission shall proceed to inquire and report to the Federal Government as to the\ntruth of the matters charged in the complaint; and, in case of any charge of default or of improper\naction being found by the Commission to have been established, the Commission shall recommend\nremedies, if any, which are in its opinion necessary.\n(3) The Federal Government may require the Council to adopt the remedies so recommended\nwithin such time as, having regard to the report of the Commission, it may think fit; and, if the Council\nfails to comply with any requirement, the Federal Government may amend the bye-laws or make such\nprovision or order or take such other steps as it may deem necessary to give effect the recommendations\nof the Commission.\n(4) The Commission shall have power to administer oaths, to enforce the attendance of\nwitnesses and the production of documents, and shall have all such other necessary powers for the\npurpose of any inquiry conducted by it as are exercised by a Civil Court under the Code of Civil\nProcedure, 1908 (Act V of 1908).\n[See sections 2 (a) and (n) and 10]\nGRANTED BY INSTITUTIONS IN PAKISTAN.\nName of Institution                               Recognized Architectural and\nTown Planning Qualifications"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. National College of Arts Lahore .. (1) National Diploma in Architecture",
      "content": "(Five-Year Diploma).\n(2) 3 Year Diploma in Architecture\n(Discontinued in 1960)."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. J.J. School of Architecture, Bombay, India. Diploma in",
      "content": "Architecture (Diploma\nAwarded up to 31st\nDecember, 1980)."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Delhi Polytechnic, New Delhi, India. Diploma in",
      "content": "Architecture (Diploma\nAwarded. up to 31st\nDecember, 1980)."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Government College of Fine Arts, Hyderabad, India. Diploma in",
      "content": "Architecture (Diploma\nAwarded up to 31st\nDecember, 1980)."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. State Board of T echnical Education and Training Hyderabad, Diploma in",
      "content": "India.                                                            Architecture (Diploma\nAwarded up to 31st\nDecember, 1980).\nPART II. – TOWN PLANNING"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Graduate School of Ekistics. Athens, Master of Science in Eiskistics",
      "content": "Technological Institute, Athens, Greece."
    }
  ],
  "definitions": []
}
