{
  "id": "pk-pakistan-council-of-research-in-water-resources-act-2007",
  "type": "statute",
  "title": "Pakistan Council of Research in Water Resources Act, 2007",
  "title_en": "Pakistan Council of Research in Water Resources Act, 2007",
  "short_name": "PCORI",
  "status": "in_force",
  "issued_date": "2007-11-30",
  "in_force_date": "2007-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FsaJ8%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Council of Research in Water Resources Act, 2007 (I of 2007) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Act may be called the Pakistan Council of",
      "content": "Research in Water Resources Act, 2007.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context, —\n(a)     “Board” means the Board of Governors of the Council;\n(b)     “Chairman” means the Chairman of the Council;\n(c)     “Council” means the Pakistan Council of Research in Water Resources;\n(d)     “Executive Committee” means the Executive Committee of the Council;\n(e)     “Member” means a member of the Board;\n(f)     “prescribed” means prescribed by rules;\n(g)     “President” means the President of the Board;\n(h)     “regulations” means regulations made under this Act;\n(i)     “rules” means rules made under this Act;\n(j)     “Secretary” means Secretary of the Council;\n(k)     “Technical Advisory Committee” means the Technical Advisory Committee of\nthe Council; and\n(l)        “water resources” means various fields of hydraulics and hydrology, namely,\nwater supply, irrigation, drainage and reclamation, flood control, inland\nnavigation and related problems prevalent in Pakistan."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Council",
      "content": "(1) As soon as may be after the commencement of this\nAct, the Pakistan Council of Research in Water Resources shall be * established by the Federal\nGovernment in accordance with the provisions of the Act.\n(2) The Council shall be a body corporate by the name of the Pakistan Council of Research in\nWater Resources having perpetual succession and a common seal, with powers, subject to the\nprovisions of this Act, to acquire and hold property and shall by the said name sue and be sued.\n(3) The headquarter of the Council shall be at Islamabad.\n(4) Until the Council is established under this Act, notwithstanding its dissolution by section\n25, it shall continue to function and while so functioning be deemed to be the Council established\nunder this Act."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Functions of the Pakistan Council of Research in Water Resources. The functions of the",
      "content": "Council shall be to—\n(a)        conduct, organize, coordinate and promote research on all aspects of water\nresources including irrigation, drainage, reclamation, navigation, drinking\nwater, industrial water, and sewerage management and to set up national\nresearch centers wherever necessary;\n(b)        design, develop and evaluate water conservation technologies for irrigation,\ndrinking and industrial water;\n(c)        initiate national water quality monitoring programme including urban and rural\nareas of Pakistan and develop technologies for providing safe drinking water to\nthe public;\n(d)        conduct and coordinate research on desertification, drought and flood\nmitigation;\n(e)        develop and maintain national water resources database for use by the planning,\nimplementing agencies and public; or advise the government and submit policy\nrecommendations regarding water quality, development, management,\nconservation and utilization of water resources;\n(f)        advise the government and submit policy recommendations regarding water\nquality, development, management, conservation and utilization of water\nresources;\n*For establishment of Pakistan Council of Research in Water Resources Please see S.R.O 44(K.E.)/2007 dated 28-06-2007.\n(g)    publish scientific papers, reports and periodicals, as well as to arrange seminars,\nworkshops and conferences on water related issues;\n(h)    establish liaison with other related national and international research and\ndevelopment organizations, universities and non-government organizations;\n(i)    undertake contractual research, provide consultancy services and collaborate\nwith other organizations in the public and private sector;\n(j)    provide financial and technical support to universities and research institutions\nfor collaborative research projects and fellowships;\n(k)    design and develop water related technologies and items of utility for various\nusers according to market demand and undertake design and development\nprojects on contract;\n(l)    undertake human resources development through training in skills related to the\nspecialized functions of the Council; and\n(m)    commercialize its research and development results from sale of products,\npatents and services as well as collaboration with other organizations."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Management. The management of the Council shall consist of",
      "content": "(a)    Board of Governors;\n(b)    Chairman; and\n(c)    Executive Committee."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Board of Governors. The overall control, direction and superintendence of the affairs of the",
      "content": "Council shall vest in a Board of Governors which may exercise all powers, perform all functions and\ndo all acts and things which may be exercised, performed or done by the Council."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Composition of the Board of Governors",
      "content": "(1) The Board of Governors shall consist of\nfollowing, namely:—\n(a)    Minister for Science and                     President\nTechnology\n(b)    Secretary, Scientific and                    Vice- President\nTechnological Research\nDivision\n(c)    Representative    from                       Member\nMinistry Finance, not\nbelow the rank of Joint\nSecretary\n(d)     Representative        from                Member\nMinistry of Science and\nTechnology not below the\nrank of Joint Secretary\n(e)     Chief       Engineering                   Member\nAdvisor, Ministry of\nWater and Power\nMember\n(f)     Four representatives to be\nnominated by Provincial\nGovernments from the\nWater Sector Member\nMember\n(g)     Four Representatives of\nthe Farmers, one each to\nbe nominated by the\nrespective    Provincial\nGovernments\n(h)     Representative of Water                  Member\nIndustry to be Nominated\nby Federation of Pakistan\nChamber of Commerce\nand Industries\n(i)     Chairman of the Council                  Member\n(j)     One Member each from                     Member\nthe National Assembly\nand     Senate   to   be\nnominated by the Speaker\nand Chairman Senate\nrespectively. Member\n(2) The Chairman of the Council shall act as Secretary of the Board."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Functions and powers of the Board. In particular and without prejudice to the generality",
      "content": "of the powers conferred by section 6, the Board shall__\n(a)    approve overall plans, policies and programmes of the Council;\n(b)    review and approve annual and long­term business plans of the Council;\n(c)    review and approve research projects proposed by the Technical Advisory\nCommittee;\n(d)    approve the annual development and non­development budget of the Council;\n(e)    create posts of such officers and servants and engage such consultants or\nexperts, as it may consider necessary for the efficient performance of the\nfunctions of the Council, on such terms and conditions as it may deem fit;\n(f)    recommend to the Government to terminate the contract of the Chairman before\nthe expiry of his tenure in case of unsatisfactory performance; and\n(g)    make regulations in the light of rules for carrying out activities considered\nnecessary for achieving efficient functioning of the Council under this Act."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Term of office of members",
      "content": "(1) Save as hereinafter provided, a member, other than an ex-\nofficio member, shall hold office for a period of three years from the date of his nomination.\n(2) A person who becomes, or is nominated to be, a member by virtue of his holding an office\nor appointment shall cease to be a member when he ceases to hold that office or appointment.\n(3) A member, other than an ex-officio member, may at any time resign his office by writing\nunder his hand addressed to the Government but shall continue to perform his functions until his\nresignation has been accepted.\n(4) A vacancy caused by resignation or any other reason shall be filled by the nomination of a\nperson qualified to fill such vacancy.\n(5) No act or proceeding of the Board shall be invalid on the ground only of the existence of a\nvacancy in the Board.\n(6) The Federal Government may increase or decrease the number of members of the Board of\nGovernors and prescribe the qualifications and mode of appointment of such members in such manner\nas it may prescribe."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Meetings of the Board",
      "content": "(1) Save as hereinafter provided, the Board shall regulate the\nprocedure for its meetings.\n(2) Meetings of the Board shall be called by its President on such date and at such time and\nplace as he may deem fit:\nProvided that not less than two meetings shall be held in a year.\n(3) Eight members shall constitute the quorum for a meeting of the Board.\n(4) Each meeting of the Board shall be presided over by the President and, in his absence, by\nthe Vice-president of the Board."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Chairman of the Council. The Chairman shall be an eminent scientist or engineer having",
      "content": "at least 15 years experience in the relevant field and shall be appointed by the Federal Government on\nthe recommendation of Board of Governors for a term of three years on such terms and conditions as\nmay be determined. The Government, on the recommendation of Board of Governors, may extend the\ntenure of the Chairman for another term or terms as it may deem fit, or convert it into permanent\nappointment."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Powers and functions of the Chairman. The Chairman, who shall be the chief executive",
      "content": "of the Council, shall work under the general policy guideline of the Board and have such powers,\nfunctions and duties as may be conferred on, or vested in, him by or under his Act.\nThe Chairman:—\n(a)    may, from time to time, for the purpose of ensuring efficient functioning of the\nCouncil and to facilitate its day to day functions, delegate to the Secretary or\nother officers of the Council, such of his functions, powers or ditties as he may\nconsider necessary;\n(b)    shall in consultation with the Technical Advisory Committee formulate\nbusiness and research plans and submit to the Board for approval;\n(c)    shall ensure the protection of all assets of the Council including intellectual\nproperty assets;\n(d)    shall promote commercialization of research and development work of the\nCouncil linking it with the market demand;\n(e)    arrange for annual performance evaluation of the Council;\n(f)    prepare the annual report of the Council for submission to the Federal\nGovernment which shall place it before the Parliament;\n(g)    identify areas of strength and weakness and formulate remedial programs;\n(h     commission industry specific studies to identify technical problems and to\napprove plans for technical scientific input by the Council towards their\nsolution;\n(i)    arrange management courses on a regular basis for managerial levels of the\nCouncil; and\n(j)    may subject to the provisions clause (e) of section 8, appoint such officers and\nemployees as may be necessary for the efficient performance of the functions\nof the Council on such terms and conditions as may be prescribed under the\nrules."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Executive Committee",
      "content": "(1) The Executive Committee shall assist the Chairman in the\nrunning the day to day functions of the Council and be responsible for administrative as well as\nfinancial matters of the Council. The Committee shall comprise the following members, namely:—\n(a)    Chairman of the Council;\n(b)    two most senior scientific or technical officers;\n(c)    Financial Adviser Ministry of Science and Technology; and\n(d)    Secretary of the Council who shall also act as its Secretary.\n(2) All decisions of the Executive Committee shall be reported to the Board for information\nand approval.\n(3) The Federal Government may increase or decrease the number of members of the Executive\nCommittee and prescribe the qualifications and mode of appointment of such members in such manner\nas it may prescribe."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Technical Advisory Committee",
      "content": "(1) The Board shall appoint a Technical Advisory\nCommittee comprising such number of members and for such terms as it may deem fit.\n(2) The Head of the Technical Advisory Committee will be nominated from amongst the non-\nofficial members of the Board.\n(3) Non-official Members of Advisory Committee shall be nominated from amongst the\nfollowing:—\n(a)    progressive farmers;\n(b)    water related industry; and\n(c)    Experts from the public and private sector.\n(4) Chairman of the Council or his representative shall be a member of the Technical Advisory\nCommittee.\n(5) The Federal Government may increase or decrease the number of members of the Technical\ndvisory Committee and prescribe the qualifications and mode of appointment of such members in such\nmanner as it may prescribe.\n(6) The Committee shall—\n(a)    identify and prepare research programmes and projects relevant to the market\ndemand;\n(b)    propose Annual, Five Year Development Programmes of the Council;\n(c)    advise and report on any technical matters referred to it by the Board; and\n(d)    conduct performance evaluation of the research programme for consideration\nby the Board."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Funds of the Council. The Funds of the Council shall comprise",
      "content": "(a)    funds of the Council which stand transferred to the Council under section 25;\n(b)    grants from the Federal Government and the Provincial Governments;\n(c)    donations and endowments;\n(d)         funds generated through sale proceeds, technical services, and income from\npatents; and\n(e)         research grants.\n1[16.\nAppointments.—(1) The Council may appoint such employees as it may consider\nnecessary for the efficient performance of its functions on such terms and conditions as may be\nprescribed.\n(2) All appointments and promotions in the Council shall be in accordance with the service\nrules and regulations of the Council.\n(3)The Council may engage experts, advisers and consultants on contract on such terms and\nconditions as it may determine.]"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Budget and accounts",
      "content": "(1) The Chairman shall, in respect of each financial year, submit\nfor the approval of the Board, a statement showing all the expenditures incurred during the year along\nwith estimated receipts and expenditures for the next financial year.\n(2) The Council shall, by such date and in such from as may be prescribed by rules, submit to\nthe Federal Government for approval its budget for each financial year showing the estimated receipts\nand expenditure and the sums which are likely to be required from the Federal Government during the\nfinancial year.\n(3) The accounts of the Council shall be maintained in such form and manner as the Federal\nGovernment may determine in consultation with the Controller General of Pakistan.\n(4) The accounts of the Council shall be audited by the Auditor General of Pakistan."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Delegation of powers. The Board may, by general or special order in writing, direct that",
      "content": "such of its powers shall, in such circumstances and under such conditions, if any, as may be specified\nin the order, be exercised by the Chairman Executive Committee, or a member or officer of the\nCouncil."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Submission of periodical reports, etc. The Council shall submit to the Federal",
      "content": "Government at such time and at such intervals as the Federal Government may specify—\n(a)         annual report on the working of the Council;\n(b)         such periodical reports and summaries as may be required by the Federal\nGovernment;\n(c)         such periodical returns, accounts, statements and statistics as may be required\nby the Federal Government;\n1\nSubs. by Act XIV of 2023, s.2.\n(d)     information and comments asked for by the Federal Government on any specific\npoint;\n(e)     copies of the documents required by the Federal Government; and\n(f)     original documents required by the Federal Government for examination or any\nother purpose."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Directives from the Federal Government. (1) In the performance or its functions, the",
      "content": "Council shall be guided on questions of policy by the instructions, if any, given to it by the Federal\nGovernment which shall be sole judge as to whether a question is a question of policy, provided that\nreasons for issuing such a directive are conveyed in writing.\n(2) The Federal Government may dissolve and reconstitute the Board, if deemed necessary in\npublic interest."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Discoveries and inventions to vest in the Council. All rights relating to discoveries and",
      "content": "inventions and any improvements in materials, methods, processes, apparatus or equipment made by\nany officer or employee of the Council in the course of his employment shall vest in the Council and\nthe researchers as per rules."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Declaration of fidelity and secrecy. Every member, adviser, officer or other employee",
      "content": "of the Council shall make such declaration of fidelity and secrecy as may be prescribed."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Continuance of certain rules. All rules, regulations and bye",
      "content": "laws made by the Council\nand in force immediately before the commencement of this Act shall apply mutadtis mutandis, and so\nfar as they are not inconsistent with any of the provisions of this Act, continue in force until repealed\nor altered by rules or regulations made under this Act."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Winding up. No provision of law relating to the winding up of bodies corporate shall apply",
      "content": "to the Council and the Council shall not be wound up except by order of the Federal Government and\nin such manner as the Federal Government may direct."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Dissolution of Council. Upon the commencement of this Act, the Council formed under",
      "content": "the Resolution shall stand dissolved and upon such dissolution:\n(a)     all assets, rights, powers, authorities and privileges and property, movable and\nimmovable, cash and bank balance, reserve funds, investments and all Other\ninterests and rights in, or arising out of such property and all debts, liabilities\nand obligations of whatever kind of the Council subsisting immediately before\nits dissolution shall stand transferred to and vest in the Council;\n(b)     all officers and other employees of the Council shall; notwithstanding anything\ncontained in any law or in any agreement, deed, document or other instrument,\nstand transferred to the Council in accordance with the present terms and\nconditions of the service applicable to them; and no officer or other employee\nwhose services are so transferred shall be entitled to any compensation because\nof such transfer;\n(c)    a regular employee of the Council before the commencement of this Act shall\nhave the option to remain civil servant under the Civil servants Act, 1973 (LXXI\nof 1973); and shall be entitled to all the privileges and facilities of the Federal\nGovernment such as pension, gratuity, housing and health.\n(d)    all debts and obligations incurred or contracts entered into or rights acquired\nand all matters and things engaged to be done by, with or for the Council formed\nunder the Resolution before its dissolution shall be deemed to have been\nincurred, entered into, acquired or engaged to be done by, with or for the\nCouncil; and\n(e)    all suits and other legal proceedings instituted by or against the Council formed\nunder the Resolution, before its dissolution shall be deemed to be suits and\nproceedings by or against the Council and may be proceeded or otherwise dealt\nwith accordingly."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Exemption from taxes. Notwithstanding anything contained in the Income Tax Ordinance,",
      "content": "2001 (XLIX of 2001) or any other law for the time being in force relating to income tax, the Council\nshall not be liable to pay any such tax on its income, capital profit, wealth, gifts or gains."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Ordinance XCI of 2002, not to apply to the Council. Nothing contained in the Industrial",
      "content": "Relations Ordinance, 2002 (XCI of 2002), shall apply to or in relation to the Council or any of the\nofficers, advisers and employees appointed by it."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Power to make Rules. The Federal Government may, by notification in the official",
      "content": "Gazette, within six months of the commencement of this Act; make rules to carry out its purposes."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Removal of difficulties. If any difficulty arises in giving effect to any provision of this",
      "content": "Act, the Federal Government may make such order not inconsistent with the provisions of this Act, as\nmay appear to it to be necessary or expedient for the purpose of removing the difficulty:\nProvided that no such power shall be exercised after the expiry of two years from the\ncommencement of this Act.\n___________"
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Board of Governors of the Council;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Council;",
      "source_provision": "sec2"
    },
    {
      "term": "Council",
      "definition": "the Pakistan Council of Research in Water Resources;",
      "source_provision": "sec2"
    },
    {
      "term": "Executive Committee",
      "definition": "the Executive Committee of the Council;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "a member of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules;",
      "source_provision": "sec2"
    },
    {
      "term": "President",
      "definition": "the President of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Secretary",
      "definition": "Secretary of the Council;",
      "source_provision": "sec2"
    },
    {
      "term": "Technical Advisory Committee",
      "definition": "the Technical Advisory Committee of the Council; and",
      "source_provision": "sec2"
    },
    {
      "term": "water resources",
      "definition": "various fields of hydraulics and hydrology, namely, water supply, irrigation, drainage and reclamation, flood control, inland navigation and related problems prevalent in Pakistan.",
      "source_provision": "sec2"
    }
  ]
}
