{
  "id": "pk-pakistan-council-of-scientific-and-industrial-research-act-1973",
  "type": "statute",
  "title": "Pakistan Council of Scientific and Industrial Research Act, 1973",
  "title_en": "Pakistan Council of Scientific and Industrial Research Act, 1973",
  "short_name": "PCOSA",
  "status": "in_force",
  "issued_date": "1973-02-08",
  "in_force_date": "1973-02-08",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUZWFv-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Council of Scientific and Industrial Research Act, 1973 (XXX of 1973) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Pakistan\nCouncil of Scientific and Industrial Research Act, 1973.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or",
      "content": "context,—\n(a) “Chairman” means the Chairman of the Council;\n(b)      “Council” means the Pakistan Council of Scientific and Industrial Research\nestablished under section 3;\n(c) “Director”, in relation to an Institute, means the Director of the institute ;\n(d) “Governing Body” means the Governing Body of the Council;\n(e)      “institute” means an institute set up by the Council; (f)    “member” means a\nmember of the Council;\n(g) “prescribed” means prescribed by rules made under this Act; and\n(h)      “registered Council” means the Pakistan Council of Scientific and Industrial\nResearch registered under the Societies Registration Act, 1860 (XXI of\n1860).\n1\nFor Statement of Objects and Reasons, see Gaz. of P.. 1973 Ext.. PL II. p. 278."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Council",
      "content": "(1) As soon as may be after the commencement of this\nAct, the Federal Government shall establish, in accordance with the provisions of this Act, a Council\nto be called the Pakistan Council of Scientific and Industrial Research.\n(2) The Council shall be a body corporate by the name of the Pakistan Council of Scientific\nand Industrial Research having perpetual succession and a common seal, with power, subject to the\nprovisions of this Act, to hold and dispose of property, and shall by the said name sue and be sued.\n(3) the headquarters of the Council shall be at Islamabad.\n1\n*                 *                     *                      *                     *              *   *\n2\n[3A. Ordinance XXIII of 1969 not to apply to Council. Nothing contained in the\nIndustrial Relations Ordinance, 1969 (XXIII of 1969) shall apply to or in relation to the Council or\nany of the officers, advisers and employees appointed by it.]\nCOMPOSITION AND FUNCTIONS OF THE COUNCIL, ETC."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Composition of the Council",
      "content": "(1) The Council shall consist of the following twenty\none members, namely:—\n(a)        a Chairman to be appointed by the Federal Government;\n(b)        a Finance Member, being a representative of the Ministry of Finance;\n(c)        two whole-time Science members, of whom at least one shall be an engineer\nor a technologist, to be nominated by the Federal Government;\n(d)        four officers serving under the Federal Government, to be nominated by that\nGovernment;\n(e)        Director of Industries in each Province, ex-officio;\n(f)        three Directors of the institutes, to be nominated by the Federal Government\nso, however, that a Director shall not be nominated for another term until the\nother Directors have been members ;\n(g)        six representatives of industries in the private and public sectors, to be\nnominated by the Federal Government.\n1\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and Sen., II.\n2\nAdded by the Pakistan Council of Scientific and Industrial Research (Amdt.) Ordinance, 1984 (42 of 1984), s. 2.\n(2) The Chairman shall be the chief executive officer of the Council and the other members,\nexcept the Finance Member, shall perform such functions as the Council may assign to each of them\nfrom time to time.\n(3) The Finance Member shall exercise such powers and perform such functions as may be\nprescribed."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Term of office of members, etc",
      "content": "(1) Save as hereinafter provided, a members, other\nthan an ex-officio member, shall hold office for a period of three years from the date of his\nnomination and shall be eligible for re-nomination for such further period or periods, not exceeding\nthree years at any one time, as the Federal Government may deem fit.\n(2) A person who becomes, or is nominated to be, a member by virtue of his holding an\noffice or appointment shall cease to be a member when he ceases to hold that office or appointment.\n(3) A member, other than an ex-officio member, may at any time resign his membership by\nwriting under his hand addressed to the Federal Government but shall continue to perform his\nfunctions until his resignation has been accepted.\n(4) A vacancy caused by resignation or any other reason shall be filled by the\nnomination of a person qualified to fill such vacancy.\n(5) The Federal Government may at any time terminate the appointment of the Chairman or\nany other member without assigning any cause.\n(6) No act or proceeding of the Council shall be invalid on the ground only of the existence\nof a vacancy in, or defect in the constitution of, the Council."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Functions of the Council. The functions of the Council shall be",
      "content": "(a)     to set up and manage technological research institutes exclusively for certain\nselected industries and such laboratories and centres as may be required for the\npromotion of the overall technological development of the country;\n(b)     to coordinate and review the work of the institutes, laboratories and centres;\n(c)     to manage the existing research units of the registered Council pending their\nabsorption in the institutes, laboratories and centres to be set up by the\nCouncil; and\n(d)      to undertake such special scientific and technological surveys and\ninvestigations as may be referred to it by the Federal Government from time to\ntime."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Meetings of the Council, etc",
      "content": "(1) Save as hereinafter provided, the Council shall\nregulate the procedure for its meetings.\n(2) Meetings of the Council shall be called by its Chairman on such date and at such time\nand place as he may deem fit:\nProvided that not less than two meetings shall be held in a year.\n(3) Ten members shall constitute the quorum for a meeting of the Council.\n(4) Each meeting of the Council shall be presided over by the Chairman and, in his absence,\nby a member elected for the purpose by the members present."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Governing Body",
      "content": "(1) There shall be a Governing Body consisting of the following\nmembers, namely:—\n(a)    the Chairman;\n(b)    the Finance Member; and\n(c)    the two whole-time Science members.\n(2) The Governing Body shall be the executive organ of the Council and shall, subject\nto the superintendence and control of the Council, perform all functions of the Council and shall be\nguided by such general or special instructions as may from time to time be given to it by the Council."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Board of Management of institutes",
      "content": "(1) Each Institute shall be managed by a Board of\nManagement consisting of seven to eleven members, depending on the size of the institute\nconcerned, of whom not less than two and not more than four shall be the representatives of the\nindustries concerned in the private and public sectors.\n(2) The Director shall be the Chairman of the Board of Management of the institute and shall\nbe directly responsible for the day to day working of the institute to the Board of Management and,\nthrough it, to the Governing Body.\n(3) Members of the Board of Management, including the Director, shall be appointed by the\nCouncil for a term of three years and shall be eligible for re-appointment for such further period or\nperiods, not exceeding three years at any one time, as the Council may deem fit."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Funds of the Council",
      "content": "(1) The funds of the Council shall comprise—\n(a)    funds of the registered Council which stand transferred to the Council under\nsection 22;\n(b)    grants from the Federal Government and the Provincial Governments;\n(c)    donations and endowments; and\n(d)    income and receipts from such other sources as may be approved by the\nFederal Government.\n(2) The Council may open a deposit account with the State Bank of Pakistan or with any\nagency of the State Bank other than Government Treasury or, with the approval of the Federal\nGovernment, with any other bank.\n(3) The accounts of the Council shall be audited by the Auditor-General of Pakistan, and shall\nbe maintained and Presented for audit in such form and manner as may be prescribed."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Budget. The Council shall, by such date and in such form as may be prescribed, submit",
      "content": "to the Federal Government for approval its budget for each financial year showing the estimated\nreceipts and expenditure and the sums which are likely to be required from the Federal Government\nduring that financial year."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Appointment of officers, etc",
      "content": "(1) The Council may, subject to the provisions of sub-\nsection (2) and such general or special orders as the Federal Government may give from time to\ntime, appoint such officer advisers and employee as it considers necessary for the efficient\nperformance of its functions on such terms and conditions as it may deem fit.\n(2) The Federal Government may direct the Council to terminate the services of any officer,\nadviser, or employee and the Council shall be bound to comply with any such direction."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Delegation of powers. The Council may, by general or special order in writing, direct",
      "content": "that such of its powers shall, in such circumstances and under such conditions, if any, as may be\nspecified in the order, be exercisable also by the Governing Body, the Board of Management of an\nInstitute, or a member or officer of the Council."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Submission of periodical reports, etc. The Council shall submit to the Federal",
      "content": "Government at such time and at such intervals as the Federal Government may specify:—\n(a)     annual report on the working of the Council and of each Institute, laboratory\nand centre established by the Council:\n(b)     such periodical reports and summaries as may be required by the Federal\nGovernment;\n(c)     such periodical returns, accounts, statements and statistics as may be required\nby the Federal Government;\n(d)     information and comments asked for by the Federal Government on any\nspecific point;\n(e)     copies of the documents required by the Federal Government; and\n(f)     original documents required by the Federal Government for examination of\nany other purpose."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Directives from the Federal Government. The Federal Government may, from time to",
      "content": "time, issue to the Council such directives and orders as it may consider necessary for carrying out"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Discoveries and inventions to vest in the Council. All rights relating to discoveries and",
      "content": "inventions and any improvements in materials, methods, processes, apparatus or equipment\nmade by any officer or employee of the Council in the course of this employment shall vest in the\nCouncil"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Declaration of fidelity and secrecy. Every member, adviser, officer or other employee",
      "content": "of the Council shall make such declaration of fidelity and secrecy as may be prescribed."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Power to make rules. The Federal Government may, by notification in the official",
      "content": "Gazette, make rules for carrying but the purposes of this Act."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Power to make regulations. The Council may, with the previous sanction of the Federal",
      "content": "Government, make such regulations, not inconsistent with this Act or the rules made thereunder, as\nmay, in its opinion, be necessary or expedient for the achievement of its aims and objects or for the\nperformance of its functions."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Continuance of certain rules. All rules, regulations and bye",
      "content": "laws made by the\nregistered Council and in force immediately before the commencement of this Act shall, mutatis\nmutandis, and so far as they are not inconsistent with any of the provisions of this Act, continue in\nforce until repealed or altered by rules or regulations made under this Act."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Winding up. No provision of law relating to the winding up of bodies .corporate shall",
      "content": "apply to the Council and the Council shall not be wound up except by order of the Federal\nGovernment and in such manner as the Federal Government may direct."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Dissolution of registered Council",
      "content": "(1) Upon the commencement of this Act, the\nregistered Council shall, notwithstanding anything contained in the Societies Registration\nAct, 1860 (XXI of 1860), stand dissolved, and upon such dissolution—\n(a)     all assets, rights, powers, authorities and privileges and all property, movable\nand immovable, cash and bank balance, reserve funds, investments and all\nother interests and rights in, or arising out of, such property and all debts,\nliabilities and obligations of whatever kind of the registered Council\nsubsisting immediately before its dissolution shall stand transferred to and\nvest in the Council;\n(b)     all officers and other employees of the registered Council shall,\nnotwithstanding anything contained in any law or in any agreement, deed,\ndocument or other instrument, stand transferred to the Council and shall be\ndeemed to have been appointed or engaged, by the Council in accordance\nwith the terms and conditions of service applicable to them; and no officer or\nother employee whose services are so transferred shall be entitled to any\ncompensation because of such transfer;\n(c)    all debts and obligations incurred or contracts entered into or rights acquired\nand all matters and things engaged to be done by, with or for the registered\nCouncil before its dissolution shall be deemed to have been incurred, entered\ninto, acquired or engaged to be done by, with or for the Council; and\n(d)   all suits and other legal proceedings instituted by or against the registered\nCouncil before its dissolution shall be deemed to be suits and proceedings or\nagainst the Council and may be proceeded or otherwise dealt with accordingly.\n(2) The Federal Government may, for the purpose of removing any difficulty in relation to\nthe transfer and other matters specified in sub-section (1), make such order as it considers expedient\nand any such order shall be deemed to be, and given effect to, as a part of the provisions of this\nAct."
    }
  ],
  "definitions": [
    {
      "term": "Chairman",
      "definition": "the Chairman of the Council;",
      "source_provision": "sec2"
    },
    {
      "term": "Council",
      "definition": "the Pakistan Council of Scientific and Industrial Research established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Governing Body",
      "definition": "the Governing Body of the Council;",
      "source_provision": "sec2"
    },
    {
      "term": "institute",
      "definition": "an institute set up by the Council; (f) “member” means a member of the Council;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "registered Council",
      "definition": "the Pakistan Council of Scientific and Industrial Research registered under the Societies Registration Act, 1860 (XXI of 1860). 1 For Statement of Objects and Reasons, see Gaz. of P.. 1973 Ext.. PL II. p. 278.",
      "source_provision": "sec2"
    }
  ]
}
