{
  "id": "pk-pakistan-criminal-law-amendment-act-1958",
  "type": "statute",
  "title": "Pakistan Criminal Law Amendment Act, 1958",
  "title_en": "Pakistan Criminal Law Amendment Act, 1958",
  "short_name": "PCLAA",
  "status": "in_force",
  "issued_date": "1958-09-22",
  "in_force_date": "1958-09-22",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5ppbw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Criminal Law Amendment Act, 1958 (XL of 1958) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "__(1) This Act may be called the Pakistan\nCriminal Law Amendment Act, 1958.\n(2) It extends to the whole of Pakistan and applies to all citizens of Pakistan and public\nservants wherever they may be.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the abject or context,",
      "content": "__\n(a)        “appropriate Government” means in relation to a person serving in connection\nwith the affairs of the 2[Federation], a Railway employee and any other person\nemployed by the 3[Federal Government] or 4[by a corporation or other body or\norganization 5[set up, controlled or administered by, or under the authority of]\nthe 3[Federal Government]], the 3[Federal Government] and in other cases the\nProvincial Government concerned;\n(b)        “public servant” means a public servant as defined in section 21 of the\nPakistan Penal Code (Act XLV of 1860) 6[and includes an employee of any\ncorporation or other body or organization 5[set up, controlled or administered\nby, or under the authority of the 3[Federal Government]] ;\n(c)        “Special Judge” means a Special Judge appointed under sub-section (1) of\nsection 3."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Appointment of Special Judges",
      "content": "_ (1) The appropriate Government shall, by notification\nin the Official Gazette, appoint as many Special Judges as may be necessary to try and punish\noffences specified in the Schedule.\n1\nFor Statement of Objects and Reasons, see Gaz. of P., 1958, Ext. pp. 245-246.\n2\nSubs. by F.A.O., 1975, Art. 2 and Table.\n3\nSubs. by the Pakistan Criminal Law Amendment Act (Amdt.) Act, 1974 (Act No IV of 1975), s. 2.\n4\nSubs. by the Anti-Corruption Laws (Amdt.), Act, 1965 (Act No. XII of 1965), s. 3 and Sch.\n5\nSubs. by the Prevention of Corruption Laws (Amdt.) Act, 1977 (Act No XIII of 1977), s. 2 and Sch.\n6\nAdded by the Anti Corruption Laws (Amdt.) Act, 1965 (Act No. XII of 1965), s. 3 and Sch.\n(2) No person shall be appointed a Special Judge unless he___\n1\n[(a)   is, or is qualified to be, a Judge of a High Court; or]\n2\n[(b)   is or has been a Sessions Judge or an Additional Sessions Judge or an\nAssistant Sessions Judge or 3[Magistrate of the first class] and has not retired\nfrom Government service or at any time been removed or dismissed from such\nservice :\nProvided that no Assistant Sessions Judge shall be appointed as Special Judge\nunless he has been an Assistant Sessions Judge for not less than three years.\nProvided further that no 3[Magistrate of the first class] shall be appointed a\nSpecial Judge unless he has exercised either the powers of a magistrate 1st\nclass for not less than 10 years or powers under section 30 of Criminal\nProcedure Code for not less than 3 years]."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Jurisdiction of Special Judges and cognizance of cases by them",
      "content": "_(1) A Special Judge\nshall have jurisdiction within such territorial limits as may be fixed by the appropriate Government\nby notification in the official Gazette and may take cognizance of any offence committed or deemed\nto have been committed within such limits and triable under this Act upon receiving a complaint of\nfacts which constitute such offence or upon a report in writing of such facts made by any police\nofficer.\n(2) Where two or more Special Judges have jurisdiction, wholly or partly in the same\nterritorial limits, the appropriate Government shall, by notification in the official Gazette, declare one\nof them to be the senior special Judge for that area.\n(3) An offence shall be tried by the Special Judge within the territorial limits of whose\njurisdiction it was committed or deemed to have been committed, or where there are more Special\nJudges than one having jurisdiction within the same territorial limits, by such one of them as may be\nspecified in this behalf by the Senior Special Judge:\nProvided that the Senior Special Judge may, by order in writing, transfer, at any stage of the\ntrial, any case from the court of one Special Judge to the court of another Special Judge having\njurisdiction within the same territorial limits.\n(4) when an offence triable under this Act is committed outside Pakistan, it shall, for the\npurposes of this Act, be deemed to have been committed within the territorial limits of the\njurisdiction of the Special Judge in which the person committing the offence is found."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Offences to be tried by Special Judges",
      "content": "__(1) Notwithstanding anything contained in the\nCode of Criminal Procedure, 1898 (Act V of 1898), or in any other law, the offences specified in the\nSchedule shall be triable exclusively by a special Judge.\n(2) The appropriate Government may, from time to time, by notification in the Official\nGazette, include in the Schedule such other offences as it deems necessary or expedient.\n1\nSubs. by the Pakistan Criminal Law Amendment Act, (Amdt.) Act, 1974 (Act No. IV of 1975), s. 3.\n2\nSubs. by the Anti-Corruption Laws (Amdt.) Act, 1965 (Act No. XII of 1965), s. 3 and Sch.\n3\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ordinance No. XXVII of 1981), s. 3 and II Sch.\n(3) All cases relating to the offences specified in the Schedule and pending in any court other\nthan the court of a Special Judge immediately before the commencement of the Criminal Law\nAmendment Act, 1953 (XXXVI of 1953), or this Act shall, on such commencement, stand\ntransferred to the court of the Special Judge having jurisdiction over such cases.\n(4) Whenever an offence is included in the Schedule by a notification of the appropriate\nGovernment made under sub-section 1[(2)], all cases relating to that offence pending in any court\nother than the court of a Special Judge immediately before such notification shall stand transferred to\nthe court of the Special Judge having jurisdiction over such cases.\n(5) In respect of cases transferred to a Special Judge under the proviso to sub-section 1[(3)] of\nsection 4 or by virtue of sub-section (3) or sub-section (4) of this section, such Judge shall not, by\nreason of the said transfer, be bound to recall and rehear any witness who has given evidence in the\ncase before transfer and may act on the evidence already recorded by or produced before the court\nwhich tried the case before the transfer.\n(6) For the purpose of trial before a Special Judge, the provisions of Chapter XVIII of the\nCode of Criminal Procedure, 1898 (Act V of 1898), shall not be applicable, but a Special Judge may,\nin any case where he deems it necessary, order an investigation by any police officer in whose\njurisdiction the offence was wholly or partly committed.\n(7) When trying an offence under this Act a Special Judge may also charge with and try\nother offences not so triable with which the accused may, under the provisions of the Code of\nCriminal Procedure, 1898 (Act V of 1898), relating to the joinder of charges, be charged at the same\ntrial."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Procedure in trial of cases and powers of Special Judges",
      "content": "_ (1) The provisions of the\nCode of Criminal Procedure, 1898 (Act V of 1898), except those of Chapter XXXVIII of that Code,\nshall, in so far as they are not inconsistent with this Act, apply to the proceedings of the court of a\nSpecial Judge and for the purposes of the said provisions, the court of a Special Judge shall be\ndeemed to be a court of Session trying cases without the aid of assessors or jury, and a person\nconducting prosecution before the court of a Special Judge shall be deemed to be a Public\nProsecutor.\n(2) Notwithstanding anything contained in the Code of Criminal Procedure, 1898 (Act V of\n1898), in the case of any offence punishable under 1[sections 161 to 165, section 165-A, sections 406\nto 409, section 420, sections 465 to 468] or section 477A of the Pakistan Penal Code, (Act XLV of\n1860), or under section 5 of the Prevention of Corruption Act, 1947 (II of 1947), at any stage of\ninvestigation or enquiry, a District Magistrate or Sub-Divisional Magistrate or 2[an executive\nMagistrate especially empowered by the Provincial Government in the this behalf], and at any stage\nof trial the Special Judge, with a view to obtaining the evidence of any person supposed to have been\ndirectly or indirectly concerned in or privy to the offence, may for reasons to be recorded in writing\ntender pardon to such person on condition of his making a full and true disclosure of the whole of the\ncircumstances within his knowledge relative to the offence and to every other person concerned,\nwhether as principal or abettor, in the commission thereof and any pardon so tendered shall, for the\npurpose of sections 339 and 339A of the Code of Criminal Procedure, 1898 (Act V of 1898), be\ndeemed to have been tendered under section 337, or, as the case may be, under section 338 of that\nCode:\n1\nSubs. by the Anti-Corruption Laws (Amdt.) Act, 1965 (Act No. XII of 1965), s. 3 and Sch.\n2\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ordinance No. XXVII of 1981), s. 3 and II Sch.\nProvided that in every case where a person has accepted a pardon deemed to have been\ntendered under section 337, the Magistrate shall, without making any further enquiry, send the case\nfor trial to the court of the Special Judge having jurisdiction over such case.\n(3) The provisions of Chapter XX of the Code of Criminal Procedure, 1898 (Act V of 1898),\nshall apply to trial of cases under this Act in so far as they are not inconsistent with the provisions of\nthis Act.\n(4) Notwithstanding anything contained in this Act, the Special Judge may convict the\naccused of any offence which from the facts admitted or proved he appears to have committed.\n(5) Notwithstanding anything contained in the Code of Criminal Procedure, 1898 (Act V of\n1898), or in any other law, previous sanction of the appropriate Government shall be required for the\nprosecution of a public servant for an offence under this Act and such sanction shall be sufficient for\nthe prosecution of a public servant for an offence triable under this Act :\nProvided that in cases where the complaint or report referred to in sub-section (1) of section 4\nis not accompanied by such sanction, the Special Judge shall, immediately on receipt of the\ncomplaint or report, address, by letter, the appropriate Government in the matter, and if the required\nsanction is neither received nor refused within sixty days of the receipt of the letter by the\nappropriate Government, such sanction shall be deemed to have been duly accorded:\nProvided further that no such sanction shall be required in respect of a case transferred under\nthe proviso to sub-section 1[(3)] of section 4 or by virtue of sub-section (3) or sub-section (4) of\nsection 5, if such sanction in respect thereof has been duly accorded or deemed to have been so\naccorded before the case is so transferred.\nExplanation.____ For the purpose of this sub-section, “appropriate Government” shall mean\nthe Government which at the time of the commission of the offence was the appropriate\nGovernment.\n(6) The 2[Federal Government] in cases sent up by the 3[Federal Investigation Agency] for\ntrial, and in all other cases, the Provincial Government, or an officer authorised in this behalf by the\n4\n[Federal] or the Provincial Government, as the case may be, shall, by general or special order,\nappoint one or more persons to conduct prosecution before any Special Judge.\n(7) The previous statements of witnesses to be examined for the prosecution at the trial shall\nbe supplied to the accused at least one week before the commencement of the trial."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Special rules of evidence",
      "content": "_ (1) When any person is charged before a Special Judge with\nan offence triable under this Act, the fact that such person or any other person through him or on his\nbehalf, is in possession, for which he cannot satisfactorily account, of pecuniary resources, or\nproperty disproportionate to his known sources of income, or that such person has, on or about the\ntime of offence with which he is charged, obtained an accretion to his pecuniary resources or\nproperty for which he cannot satisfactorily account, may be proved, and may be taken into\nconsideration by the Special Judge as a relevant fact in deciding whether he is guilty of the particular\noffence with which he is charged.\n1\nSubs. by the Anti-Corruption Laws (Amdt.) Act, 1965 (Act No. XII of 1965), s. 3 and Sch.\n2\nubs. by the Pakistan Criminal Law Amendment Act (Amdt.) Act, 1974 (Act No. IV of 1975), s. 2.\n3\nSubs. by the Federal Laws (Revision and Declaration), Ordinance, 1981 (Ordinance No. XXVII of 1981), s. 3 and II Sch.\n4\nSubs. by F.A.O., 1975, Art. 2 and Table.\n(2) Where in any trial before a Special Judge of an offence punishable under sections 161 to\n165 of the Pakistan Penal Code (Act XLV of 1860), it is proved that an accused person has accepted\nor obtained, or has agreed to accept or attempted to obtain, for himself or for any other person, any\ngratification (other than legal remuneration) or any valuable thing, or any pecuniary advantage from\na person or the agent of a person, for any favour shown or promised to be shown by the accused\nperson, it shall be presumed, unless the contrary is proved, that he accepted or obtained, or agreed to\naccept or attempted to obtain, that gratification, or that valuable thing, or pecuniary advantage to\nhimself or some other person, as the case may be, as a motive or reward such as is mentioned in\nsections 161, 162 and 163 of the Pakistan Penal Code (Act XLV of 1860), or, as the case may be,\nwithout consideration, or for a consideration which he knows to be inadequate.\n(3) Where in any trial of an offence punishable under section 165A of the Pakistan Penal\nCode (Act XLV of 1860), it is proved that any gratification (other than legal remuneration) or any\nvaluable thing has been given or offered to be given or attempted to be given by an accused person, it\nshall be presumed unless the contrary is proved that he gave or offered to give or attempted to give\nthe gratification or valuable thing, as the case may be, as a motive or reward such as is mentioned in\nsection 161 of the said Code or, as the case may be, without consideration or for a consideration\nwhich he knew to be inadequate.\n(4) Notwithstanding anything contained in sub-sections (2) and (3), the court may decline to\ndraw the presumption referred to in either of the said sub-sections if the gratification or thing\naforesaid is, in its opinion, so trivial that no inference of corruption may fairly be drawn."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Bar on trial de novo. A Special Judge, unless he otherwise decides, shall not be bound to",
      "content": "recall or rehear any witness, whose evidence has already been recorded, or to re-open proceedings\nalready held, but may act on the evidence already produced or recorded and continue the trial from\nthe stage which the case has reached."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Punishment of offences. When any person charged before a Special Judge with an offence",
      "content": "triable under this Act is found guilty of the offence, the Special Judge shall, notwithstanding\nanything contained in any other law, whether or not he imposes a sentence of imprisonment, impose\na sentence of fine which shall not be less than the gain found to have been derived by the accused by\nthe commission of the offence."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Appeal, revision and transfer of cases",
      "content": "_(1) An appeal from the judgment of a Special\nJudge shall lie to the highest court having appellate jurisdiction in the territorial limits in which the\noffence is tried by the Special Judge, and the same court shall also have powers of revision.\n(2) Notwithstanding the provisions of section 417 of the Code of Criminal Procedure, 1898\n(Act V of 1898), in any case tried by a Special Judge appointed by the 1[Federal Government] under\nsection 3, in which such Special Judge has passed an order of acquittal, the 1[Federal Government]\nmay direct the Public Prosecutor to present an appeal to such court as aforesaid.\n(3) The aforesaid court shall have authority to transfer any case from the court of a Special\nJudge to the court of another Special Judge:\n1\nSubs. by the Pakistan Criminal Law Amendment Act (Amdt.) Act, 1974 (Act No. IV of 1975), s. 2.\nProvided that notwithstanding anything contained in section 526 of the Code of Criminal\nProcedure, 1898 (Act V of 1898), the Special Judge from whose court a transfer is desired, shall not\nbe bound to adjourn the case, but if he rejects a request for adjournment, he shall record his reasons\nfor doing so.\n(4) No prosecution under this Act against any person either generally or in respect of any one\nor more of the offences for which he is being tried shall be withdrawn except under the orders in\nwriting of the appropriate Government."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Bail and imprisonment",
      "content": "(1) Notwithstanding anything contained in the Second\nSchedule to the Code of Criminal Procedure, 1898 (Act V of 1898), or any other law for the time\nbeing in force, offences triable by a Special Judge under this Act shall be deemed to be non-bailable.\n(2) Any offence triable under this Act which is punishable with simple imprisonment shall be\ndeemed to be punishable with imprisonment of either description."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to make rules",
      "content": "(1) The appropriate Government may frame rules to carry out the\npurposes of this Act.\n(2) In particular, and without prejudice to the generality of the foregoing powers, such rules\nmay provide for any of the following matters, namely :___\n(a)        authorization of persons to exercise the power to sanction prosecution on\nbehalf of the appropriate Government in respect of various grades of public\nservants ;\n(b)        the emoluments of the Special Judges, and their appointment ;\n(c)        territorial limits of the jurisdiction of Special Judges and the place and time of\nsitting of the courts presided over by the Special Judges;\n(d)       the summoning of witnesses and compelling the production of documents and\nthe penalty for disobeying, or evading the same, in addition to or substitution\nof the provisions of the code of Criminal Procedure, 1898 (Act V of 1898);\n(e)        matters incidental to the above."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Military, naval and air force law not to be affected. Nothing in this Act shall affect the",
      "content": "jurisdiction exercised by, or the procedure applicable to, any court or other authority under any\nmilitary, naval, or air force law."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. [Omitted]",
      "content": "1\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ordinance No. XXVII of 1981), s. 3 and II Sch.\n(See section 5)\n(a)   Offences punishable under sections 161 to 166, 168, 217 and 218 of the\nPakistan Penal Code (Act XLV of 1860), and as attempts, abetments and\nconspiracies in relation thereto or connected therewith.\n(b)   Offences punishable under sections 403 to 409, 417 to 420, 465 to 468, 471\nand 477A of the Pakistan Penal Code (Act XLV of 1860), and as attempts,\nabetments and conspiracies in relation thereto or connected therewith, when\ncommitted by any public servant as such or by any person acting jointly with\nor abetting or attempting to abet or acting in conspiracy with any public\nservant as such.\n(c)   Offences punishable under the Prevention of Corruption Act, 1947 (II of\n1947), and as attempts, abetments and conspiracies in relation thereto or\nconnected therewith.\n___________\nRGN Date: 27-09-2024"
    }
  ],
  "definitions": [
    {
      "term": "appropriate Government",
      "definition": "in relation to a person serving in connection with the affairs of the 2[Federation], a Railway employee and any other person employed by the 3[Federal Government] or 4[by a corporation or other body or organization 5[set up, controlled or administered by, or under the authority of] the 3[Federal Government]], the 3[Federal Government] and in other cases the Provincial Government concerned;",
      "source_provision": "sec2"
    },
    {
      "term": "public servant",
      "definition": "a public servant as defined in section 21 of the Pakistan Penal Code (Act XLV of 1860) 6[and includes an employee of any corporation or other body or organization 5[set up, controlled or administered by, or under the authority of the 3[Federal Government]] ;",
      "source_provision": "sec2"
    },
    {
      "term": "Special Judge",
      "definition": "a Special Judge appointed under sub-section (1) of section 3.",
      "source_provision": "sec2"
    }
  ]
}
