{
  "id": "pk-pakistan-currency-act-1950",
  "type": "statute",
  "title": "Pakistan Currency Act, 1950",
  "title_en": "Pakistan Currency Act, 1950",
  "short_name": "PCA",
  "status": "in_force",
  "issued_date": "1950-04-10",
  "in_force_date": "1950-04-10",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap%2BVaw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Currency Act, 1950 (XXIX of 1950) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Act may be called the Pakistan Currency",
      "content": "Act, 1950.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once and shall be deemed to have taken effect from the date from\nwhich the Pakistan Currency Ordinance, 1948 (XIII of 1948)2, came into force."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Interpretation. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "_\n“Pakistan one-rupee note” means a one-rupee note issued by the Government of Pakistan 3[* *\n*].\n3\n[3. Power to issue one-rupee notes. Notwithstanding anything contained in any law for the\ntime being in force, the Federal Government may issue Pakistan one-rupee notes and any such note\nshall be current in Pakistan in the same manner and to the same extent and as fully as the rupee coin\ncalled the Government rupee issued under the provisions of the Pakistan Coinage Act (XIII of 1906),\nand shall be legal tender in Pakistan for the payment of any amount until such time as they are called\nin by the Federal Government]."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Punishment for counterfeiting, etc., one rupee notes. The provisions of sections 489A,",
      "content": "489B, 489C and 489D of the Pakistan Penal Code (XLV of 1860) shall apply in respect of notes issued\nunder this Act as they apply in respect of currency notes and bank notes."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. 3[Omitted]",
      "content": "___________\nRGN Date: 18-09-2024\n1\nThe Act has been___\n(i) applied to Baluchistan, see Gaz. of P.,1952, Pt. 1, p. 154;\n(ii) applied in the Federated Areas of Baluchistan, see Gaz. of P., 1953, Pt. 1, p. 152;\n(iii) extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950);\n(iv) extended to the Baluchistan States Union, see the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G. G. O. 4 of 1953);\n(v) extended to the State of Bahawalpur, see the Bahawalpur (Federal Laws) (Extension) Order, 1952 (G. G. O. 11 of 1952) ; and\n(vi) extended to the Khairpur State, see the Khairpur (Federal Laws) (Extension) Order, 1953 (G. G. O. 5 of 1953).\nThis Act has been and shall be deemed to have been brought into force in Gwadur with effect from the 8th September, 1958, by the Gwadur (Application\nof Central Laws) Ordinance, 1960 (Ordinance No. XXXVII of 1960), s. 2.\nThe Act, Rules, Notifns. and orders made under it, have been applied to the Tribal Areas or to the parts of those areas to which they have not been already\napplied, see the Tribal Areas (Application of Acts) Reg., 1965, Gaz. of P,,1965, Ext., pp. 1016-1018.\n2\nRep. by this Act.\n3\nOmitted and subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ordinance No. XXVII of 1981), s. 3 and 2nd Sch."
    }
  ],
  "definitions": []
}
