{
  "id": "pk-pakistan-girl-guides-association-ordinance-1960",
  "type": "statute",
  "title": "Pakistan Girl Guides Association Ordinance, 1960",
  "title_en": "Pakistan Girl Guides Association Ordinance, 1960",
  "short_name": "PGGAO",
  "status": "in_force",
  "issued_date": "1960-11-21",
  "in_force_date": "1960-11-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-a5acZA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Girl Guides Association Ordinance, 1960 (XLIV of 1960) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. [Omitted]",
      "content": "ORDINANCE No. XLIV OF 1960\n[2nd November, 1960]\nAN\nto incorporate the Pakistan Girl Guides Association and to provide for certain matters connected\ntherewith\nWHEREAS it is expedient to incorporate the Pakistan Girl Guides Association and to provide\nfor certain matters connected therewith.\nNow, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958,\nand in exercise of all powers enabling him in that behalf, the President is pleased to make and pro-\nmulgate the following Ordinance: "
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.  (1) This Ordinance may be called the Pakistan",
      "content": "Girl Guides Association Ordinance, 1960.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force on such dates1 as the 2[Federal Government] may, by notification\nin the official Gazette, appoint."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Incorporation of Association.Notwithstanding anything in the Societies Registration",
      "content": "Act, 1860 (XXI of 1860) or in any other law, the Pakistan Girl Guides Association, for the time\nbeing registered thereunder, shall, on the commencement of this Ordinance, cease to be so registered,\nand shall be deemed to be a body corporate by the name of the Pakistan Girl Guides Association\n(hereafter in this Ordinance referred to as the Association), having perpetual succession and a\ncommon seal, with power, subject to the rules made or deemed to have been made under section 3, to\nacquire, hold and dispose of property, movable or immovable, for the purposes of the Association,\nand shall by the said name sue and be sued."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Constitution, powers and functions of Association.The Constitution, powers and",
      "content": "functions of the Association shall, notwithstanding anything in the Companies Act, 1913 (III of\n1913), be such as may be prescribed by rules to be made by the Association, with the previous\napproval in writing of the 2[Federal Government], and until such rules are made, the rules of the\nPakistan Girl Guides Association registered under the Societies Registration Act, 1860 (XXI of\n1860) and in force immediately before the commencement of this Ordinance, shall continue in force\nand be deemed to have been made under this section."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Exclusive right to titles uniforms, badges, etc. The Association shall have the sole and",
      "content": "exclusive right to have and to use all emblems, badges, uniforms and decorations, descriptive or\ndesignating marks and titles, now or heretofore used by the Association, and also the title “Girl\nGuides” or (saving the title of any unit of the Armed Forces of Pakistan or any Forces attached to or\nserving with such Forces), any title containing the word “Guides” or any grammatical variation\nthereof, and shall also have the sole and exclusive right to manufacture, have or use any emblem,\nbadge, decoration, uniform, descriptive or designating mark or title hereafter adopted by the\nAssociation for carrying out its objects.\n1\nEnforced on 8th December, 1960, see S. R. O. 45 (R), Gazette of Pakistan 1960, Extraordinary Page No. 1826 a.\n2\nSubs. by Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Article 2 and Table."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Penalty, etc.(1) Whoever contravenes any provision of section 4 shall be punishable",
      "content": "with fine.\n(2) If such contravention is committed by a company, association or body of individuals,\nevery member thereof who is knowingly a party to the contravention shall be deemed to be guilty of\nsuch contravention."
    }
  ],
  "definitions": []
}
