{
  "id": "pk-pakistan-halal-authority-act-2016",
  "type": "statute",
  "title": "Pakistan Halal Authority Act, 2016",
  "title_en": "Pakistan Halal Authority Act, 2016",
  "short_name": "PHAA",
  "status": "in_force",
  "issued_date": "2016-02-29",
  "in_force_date": "2016-02-29",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2JwZpc%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Halal Authority Act, 2016 (VIII of 2016) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Pakistan Halal\nAuthority Act, 2016.\n(2) It extends to—\n(a) the whole of Pakistan, for purposes of imports and exports, trade and commerce with foreign\ncountries and inter-provincial trade and commerce in all such articles and processes which are\ndescribed or represented as being Halal; and\n(b) Islamabad Capital Territory, for all other purposes envisaged under this Act.\n(3) It shall come into force at once except sections 17, 18, 19 and 20 which shall come into\nforce in whole or in part, on such date or dates as the Federal Government may, by notification in the\nofficial Gazette, direct."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context, —\n(a)     “Accredited Halal Certification Body” means a firm or company which has\nbeen certified by the National Accreditation Body as being competent and\nauthorized to carry out Halal Certification;\n(b)     “article” means any substance, artificial or natural, or partly artificial or partly\nnatural, whether partly or wholly processed or manufactured product, and any\nservice or financial product offered to the public;\n(c)     “Authority” means the Pakistan Halal Authority established under section 3;\n(d)     “Board” means the Board of Governors constituted under section 5;\n(e)     “chairperson” means the chairperson of the Board of Governors;\n(f)     “Director General” means the Director General of the Authority;\n(g)     “Government” means the Federal Government;\n(h)    “Halal” means anything permitted by the laws of Islam;\n(i)    “Halal Certificate” means the certificate issued by an Accredited Halal\nCertification Body to the effect that an article or process is in conformity with\nthe Halal Standard pertaining thereto, and authorizing use of the Halal logo in\nrespect thereof;\n(j)    “Halal Certification” means the entire process of conformity assessment\nincluding audit, inspection, testing, and evaluation to establish that an article or\nprocess is in conformity with the Halal Standard, resulting in issue of a Halal\nCertificate;\n(k)    “Halal logo” means the logo approved by the Authority for a Halal article or\nprocess signifying that the same is in conformity with the Halal Standard\npertaining thereto;\n(l)    “Halal Standard” means the Pakistan Halal Standard for an article or process\nnotified by the National Standards Body;\n(m)    “member” means a member of the Board of Governors;\n(n)    “National Accreditation Body” means the Pakistan National Accreditation\nCouncil or such other body as may be notified for the purpose by the\nGovernment;\n(o)    “National Standards Body” means the Pakistan Standards and Quality Control\nAuthority or such other body as may be notified for the purpose by the\nGovernment;\n(p)    “OIC Guidelines” means the guidelines, specified in Schedule - I, issued by the\nOrganization of the Islamic Cooperation from time to time relating to Halal food\nand other articles or processes;\n(q)    “prescribed” means prescribed by rules or regulations;\n(r)    “process” means a series of steps for the production, manufacture or\ndevelopment of any article or system;\n(s)     “regulations” means regulations made under this Act; and\n(t)    “rules” means rules made under this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Authority",
      "content": "(1) The Government may, by notification in the official\nGazette, establish the Pakistan Halal Authority for carrying out the purposes of this Act.\n(2) The Authority shall be a body corporate having perpetual succession and a common seal,\nwith powers, subject to the provisions of this Act, to acquire and hold property, both movable and\nimmovable, and shall by the said name sue and be sued.\n(3) The headquarters of the Authority shall be at Islamabad and it may, with the prior approval\nof the Government, set up offices at other places as, when and where required."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Management",
      "content": "(1) The general direction and administration of the Authority and its affairs\nshall vest in the Board, which may exercise all powers and do all acts and things which may be\nexercised or done by the Authority.\n(2) The Board shall, in the discharge of its functions, be guided on questions of policy by such\ndirections as the Government may give from time to time.\n(3) If any question arises as to whether any matter is a matter of policy or not, the decision of\nthe Government in respect thereof shall be final."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Composition of the Board of Governors",
      "content": "The Board of Governors shall consist of the\nfollowing members, namely: —\n(a) Minister for Science and Technology                                Chairperson\n(b) Two Members of the Parliament. One each from National               Members\nAssembly and Senate\n(c) Secretary, Ministry of Commerce                                      Member\n(d) Secretary, Ministry of Finance                                       Member\n(e) Secretary, Ministry of Industries and Production                     Member\n(f) Secretary, Ministry of Interior                                      Member\n(g) Secretary, Ministry of National Food Security and Research           Member\n(h) Secretary, Ministry of Religious Affairs                             Member\n(i) Secretary, Ministry of Science and Technology                        Member\n(j) Chief Secretaries of the Provincial Governments Azad Jamu            Member\n& Kashmir and Gilgit-Baltistan\n(k) Director General, Pakistan Standards and Quality Control             Member\nAuthority\n(l) Director General, Pakistan National Accreditation Council            Member\n(m) President, Federation of Pakistan Chambers of Commerce               Member\nand Industry\n(n) Chairman, Islamic Chamber of Commerce and Industry                   Member\n(Pakistan Representative)\n(o) Three well-reputed Shariah Scholars to be nominated by               Member\nMinistry of Religious Affairs, including one from the Council\nof Islamic Ideology.\n(p) One representative to be nominated by the Rector,                    Member\nInternational Islamic University, Islamabad\n(q) Food Technologist nominated by Pakistan Agriculture                  Member\nResearch Council\n(r) Director-General, Pakistan Halal Authority                      Member/ Secretary\n(2) In case of non-availability of the Minister for Science and Technology for any reason, the\nGovernment may designate any other Minister as Chairperson.\n(3) The Authority may, with the prior approval of the Government, co-opt any other person as\nmember.\n(4) No act or proceeding of the Board shall be invalid merely on the ground of the existence of\nany vacancy, or any defect, in the constitution of the Board."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Terms of office of members",
      "content": "(1) A member, other than an ex-officio member, shall hold\noffice for a period of three years from the date of entering upon the office, but may be re-nominated\nfor a second, and final, term of three years.\n(2) A person who is or is nominated to be, a member by virtue of his holding an office shall\ncease to be a member when he ceases to hold that office.\n(3) A member other than an ex-officio member, may at any time resign his office by writing\nunder his hand addressed to the Chairman."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Removal of members",
      "content": "(1) The Government may remove from office a member, other\nthan an ex-officio member, if he—\n(a)    has been adjudged an un­discharged insolvent; or\n(b)    has been convicted of an offence which involves moral turpitude; or\n(c)    has become physically or mentally incapable of acting as a member; or\n(d)    has abused his position and rendered his continuance in the office prejudicial to\npublic interest.\n(2) A member shall not be removed from office unless he has been afforded a reasonable\nopportunity of being heard."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Constitution of the Executive Committee",
      "content": "(1) The Government may constitute an\nExecutive Committee for carrying out day-to-day matters of the Authority and for exercising such\npowers and doing such acts and things as may be delegated to it by the Board.\n(2) The executive committee under sub-section (1) shall consist of the following members, namely:—\n(a) Secretary, Ministry of Science and Technology;                     Convener\n(b) Director General of the Authority;                                 Member\n(c) A representative of Ministry of Interior; and                      Member\n(d) Four members nominated by the Board, one of whom shall be a        Members\nShariah Scholar and one a Food Technologist."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Director General",
      "content": "(1) There shall be a Director General of the Authority who shall be\nthe chief executive of the Authority and shall be appointed by the Government.\n(2) The Director General shall discharge such duties and perform such functions as are assigned\nto him by the Board, or by the Government.\n(3) Until the Board is duly constituted, the Director General shall, subject to such directions as\nthe Government may give from time to time, exercise the powers, and perform the functions of the\nBoard.\n(4) The officers of the Authority shall have such powers and shall perform such functions as\nmay be assigned to them by the Director General."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Powers and functions of the Authority",
      "content": "(1) Powers and functions of the Authority\nshall be to—\n(a)     develop and implement strategies, plans and programmes for promotion of\nimports and exports, trade and commerce with foreign countries and\ninter­provincial trade and commerce in Halal articles and processes;\n(b)     recommend the Halal Standards developed for articles and processes, to be\nnotified in the official Gazette by the Federal Government for adoption and\nnotification by the National Standards Body:\nIn this context, the Authority may consider the OIC Guidelines in\nschedule-I, relating to Halal food and other articles or processes, as modified by\nthe Organization of the Islamic Cooperation from time to time, as a reference\npoint;\n(c)      recommend mechanism for the Accreditation of Halal Certification Bodies and\nadoption of Halal Certification systems;\n(d)     develop policies, plans and programmes for ensuring compliance of Halal\narticles and processes with the Halal Standards;\n(e)     develop and authorize use of Halal logo for Halal articles and processes;\n(f)     may operate as a certification body after obtaining due accreditation from the\nNational Accreditation Body;\n(g)     levy fees for issue or renewal of the Halal certificate and / or authorizing the\nuse of Halal Logo;\n(h)     maintain a register of all persons, firms and companies authorized to use the\nHalal logo;\n(i)     inspect and test Halal products and processes for their quality, specification and\ncharacteristics with relation to the Halal standards, for purposes of imports and\nexports, trade and commerce with foreign countries and inter-provincial trade\nand commerce;\n(j)     prohibit production, storage and sale in the Islamabad Capital Territory of such\nHalal products as do not conform to the Halal standards;\n(k)    arrange and conduct public awareness campaigns in relation to the Halal sector\nin general and to Halal products and processes in particular;\n(l)    secure international recognition of the Halal logo to build confidence in the\nHalal Certification system and Pakistani Halal products abroad;\n(m)    co-ordinate with national and international organizations for strengthening the\nHalal sector;\n(n)    promote and encourage establishment of libraries and laboratories for the\npurpose of developing the Halal sector;\n(o)    collect and circulate statistical and other information relating to the Halal sector;\nand\n(p)    any other function assigned by the Government for development of the Halal\nsector and promotion of Halal products and processes for purposes of the Act.\n(2) In exercising its powers and performing its functions, the Authority shall follow such\nprocedure as may be prescribed."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Meetings",
      "content": "Meetings of the Board and the Executive Committee shall be in accordance\nwith such procedure as may be prescribed."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Authentication of orders and other instruments of the Authority",
      "content": "All orders,\ndecisions and other instruments issued by the Authority shall be authenticated only by the signatures\nof such officer or officers as are authorized by the Authority in this behalf."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Disclosure of ingredients, etc",
      "content": "The Halal Standard for a food or non-food article or\nproduct shall require that the ingredients, dates of manufacture and expiry and complete name and\naddress of its manufacturer, exporter or supplier be clearly mentioned on the box, wrapper or other\npackaging in which it is contained, or on the label, tag or sticker affixed to it."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Prohibition of improper use of Halal logo",
      "content": "No person shall use, in relation to any\narticle, product or process or in the title of any patent or in any trademark or design, the Halal logo\nexcept under the terms of a Halal Certificate, issued under this Act."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Prohibition of use of certain name, mark or logo",
      "content": "No person shall without the previous\npermission of the Authority and subject to such conditions as it may impose, use in any manner\nwhatsoever, any name, mark or logo which may resemble the name, mark or logo of the Authority or\ncontain the Authority's recognized expressions relating to Halal standards or any abbreviation of such\nexpressions."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Prohibition of registration in certain cases",
      "content": "(1) Notwithstanding anything contained\nin any law for the time being in force, no registering body shall register any company, firm or any\nbody of persons or a trademark or design or grant a patent in respect of an article which bears a title\ncontaining any name or mark or logo in contravention of the provisions of sections 14 or 15.\n(2) Where any question arises before a registering authority whether the use of any name or\nmark or logo is in contravention of the provisions of sections 14 or 15 the registering authority may\nrefer the question to the Government, whose decision thereon shall be final."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Export of Halal articles and processes",
      "content": "No article or process shall be exported from\nPakistan. with the description or representation of being a Halal article or process unless it bears the\nHalal logo of the Authority, having been affixed after the requisite certification by a duly accredited\nHalal certification body."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Import of Halal articles and processes",
      "content": "No article or process shall be imported into\nPakistan with the description of being a Halal article or process unless it has been certified as such by\nan Accredited Halal Certification Body in Pakistan or the exporting country, recognized by the\nNational Accreditation Body."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Marketing of Halal products",
      "content": "No food or non-food product shall be marketed or offered\nfor sale with the description or representation of being a Halal article or product within the Islamabad\nCapital Territory unless it bears the Halal logo of the Authority or is certified to be Halal by a duly\naccredited Halal certification body."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Penalty for improper use of Authority name, mark or logo",
      "content": "(1) Any person who\ncontravenes the provisions of sections 14, 15, 16, 17, 18 or 19 shall be punishable with imprisonment\nof either description for a term which may extend to three years, or with a fine up to one million rupees\nbut not less than one hundred thousand rupees, or with both.\n(2) A Court convicting a person under this section may direct that any articles in respect of\nwhich the contravention was made shall be forfeited to the Government."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Inspectors",
      "content": "(1) The Authority may appoint Inspectors, in accordance with such\nprocedure as may be prescribed, for the purpose of enforcement of this Act or rules or regulations\nmade there under in the Islamabad Capital Territory.\n(2) Subject to any rules made under this Act, an Inspector appointed under sub-section (1) shall\nbe empowered to—\n(a)     inspect any operation carried on in connection with any article or product or\naction or process in relation to Halal Certification;\n(b)     take samples of any article, or of any material or substances used in any article\nor process, in relation to which Halal logo has been used;\n(c)     seize and detain for such time as may be necessary any article in respect of\nwhich he believes any provision of this Act has been contravened; and\n(d)      stop, search or seize any transport vehicle in which he believes on reasonable\nground that any article subject to the provisions of this Act, is being transported\nthereon does not conform to Halal standards and certification.\n(3) Every Inspector shall be issued by the Authority a certificate of appointment which shall\nbe produced by the Inspector on demand.\n(4) Any person who obstructs or impedes performance of duties of an Inspector or any other\nauthorized officer shall be guilty of an offence punishable under section 22.\n(5) Any article seized under this Act may, at the option of the Inspector, be kept or stored in\nthe premises where it was seized or may at the direction of the Inspector be removed to any other place\nor appropriately disposed of, in case it is a perishable item.\n(6) The Inspector shall release any article seized by him under this Act when he is satisfied that\nall the requirements of the Act with the respect thereto have been complied with.\n(7) son who, without the authority of an Inspector, removes, alters, or interferes in any way\nwith any article seized under this Act, shall be guilty of an offence punishable under section 22.\n(8) Any person who knowingly makes any false or misleading statements either verbally or in\nwriting to any inspector engaged in carrying out his duties under this Act shall be guilty of an offence\npunishable under section 22.\n(9) Any person aggrieved by the actions of an Inspector / officer may file a representation to\nthe DG of Authority, who shall decide the same after giving such person an opportunity of being heard."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Penalty for other contraventions",
      "content": "Whoever contravenes any of the provisions of this\nAct other than sections 14, 15, 16, 17, 18 or 19, or any rule made or notification issued thereunder\nshall, be punishable with imprisonment of either description for a term which may extend to six\nmonths, or with a fine upto five hundred thousand rupees but not less than fifty thousand rupees, or\nwith both."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Cognizance of offences by courts",
      "content": "(1) No court inferior to that of a Judicial Magistrate,\nfirst class shall try any offence punishable under this Act.\n(2) All offences under this Act shall be bailable and compoundable."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Appeals",
      "content": "(1) Any person aggrieved by an order passed by the Authority including a\ndecision of the Director General under sub-section (9) of section 21 may prefer an appeal to the Court\nof Session within thirty days of the date of the order.\n(2) The appeal shall be presented in such form and manner and within such time as may be\nprescribed.\n(3) The Court of Session shall, in dealing with appeals under this section, follow such procedure\nas is specified in the Code of Criminal Procedure, 1898 (Act V of 1898)."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Appointment of officers, staff, etc., by the Authority",
      "content": "(1) The Authority may create\nposts and appoint such officers, staff, experts or consultants, in accordance with Government policy,\non such terms and conditions as may be prescribed:\nProvided that appointment to the posts in Basic Pay Scale 20 or above shall not be made except\nwith the previous approval in writing of the Government.\n(2) Subject to sub-section (1), the Director General may, in cases of urgency, appoint such\nofficers, staff, experts or consultants and on such terms and conditions as may be recommended by a\nselection committee, constituted under the rules:\nProvided that every appointment made under this sub-section shall be reported to the Board,\nwithout unreasonable delay, for approval."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Members and officers etc. to be public servants",
      "content": "The Director General, members,\nofficers, staff, experts and consultants of the Authority shall, when acting or purporting to act in\npursuance of any of the provisions of this Act, be deemed to be public servants within the meaning of\nsection 21 of the Pakistan Penal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Delegation of powers to the Director General etc",
      "content": "(1) The Authority may, by general\nor special order and subject to such conditions as it may think fit to impose, delegate to the Director\nGeneral or a member, or an officer of the Authority, all or any of its powers or functions under this\nAct.\n(2) The Government may, by notification in the official Gazette, delegate all or any of the\nAuthority's powers under this Act and the rules and regulations made thereunder to any other agency\nor department of the Government or to a provincial government with the consent of such government."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Pakistan Halal Authority Fund",
      "content": "(1) There shall be created a fund to be known as the\nPakistan Halal Authority Fund which shall vest in the Authority and shall be utilized by the Authority\nto meet charges in connection with its functions under this Act including the payment of salaries and\nother remuneration to the Director General, members, officers, staff, experts and consultants of the\nAuthority.\n(2) The Pakistan Halal Authority Fund shall be financed from the following sources:—\n(a)    grants made or loans advanced by the Government or Provincial Governments;\n(b)    loans, aid and donations received from foreign governments, national or\ninternational agencies and non­governmental organizations; and\n(c)    contributions from private organizations and other persons.\n(3) All sums payable to the Authority may be recovered as arrears of land revenue."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Budget",
      "content": "The Authority shall, in respect of each financial year, submit for approval of the\nGovernment, on such date as may be prescribed, a statement of the estimated receipts and expenditure,\nincluding requirements of foreign exchange for the next financial year."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Audit and accounts",
      "content": "(1) The accounts of the Authority shall be audited every year by\nthe Auditor General of Pakistan in such manner as may be prescribed.\n(2) Copies of the audit reports shall be sent to the Government along with the comments of the\nAuthority.\n(3) The audit report shall be available for public inspection.\n(4) The Government may issue directions to the Authority for rectification of any item objected\nto by the Auditor General of Pakistan and the Authority shall comply with such directions."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Protection of actions taken in good faith under this Act",
      "content": "No suit, prosecution or other\nlegal proceeding shall lie against the Government or the Authority or any person acting under the\nauthority of the Government or the Authority for anything which is in good faith done or intended to\nbe done in pursuance of this Act or any rule or regulation made thereunder."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Submission of yearly reports and returns",
      "content": "(1) As soon as possible after the end of\nevery financial year but before the last day of the month of December of that year, the Authority shall\nsubmit to the Government a report on the conduct of its affairs for that year.\n(2) The Government may, after giving sufficient notice to the Authority, require it to furnish:—\n(a)     any return, statement, estimate, statistics, or other information regarding any\nmatter under the control of the Authority;\n(b)     a report on any subject with which the Authority is concerned; and\n(c)     a copy of any document in the charge of the Authority."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Power to make rules",
      "content": "The Government may, by notification in the official Gazette,\nmake rules to carry out the purposes of this Act."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Power to make regulations",
      "content": "The Authority may, with the previous approval of the\nGovernment, by notification in the official Gazette, make regulations not inconsistent with this Act or"
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Power to exempt",
      "content": "The Government may, by notification in the official Gazette, exempt\nany article or process or class of articles or processes from the operation of all or any of the provisions\nof this Act."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Power to obtain information",
      "content": "Every holder of a Halal Certificate shall supply to the\nAuthority such information and such samples of any article or material or substance used in relation\nto any article or process as the Authority may require."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Act to override other laws",
      "content": "The provisions of this Act shall have effect notwithstanding\nanything inconsistent therewith in any other law for the time being in force."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Amendment of Schedule",
      "content": "The Government may, by notification in the official\nGazette, add to, delete or otherwise amend Schedule I in accordance with decisions of the OIC.\nSCHEDULE — I\n[see sections 2(p) and 10(1)(b)]\nOIC Guidelines for Halal Food\nThis standard was developed by the Standardization Expert Group (SEG) of the Organization\nof the Islamic Conference (O1C).\nIn this standard, Islamic Rules refer to those commonly accepted rules and beliefs of the Islam,\nregardless of variations in different countries.\nGiven the fact that non safe foods would not be considered halal, therefore the quality standards\nincluding food safety and traceability (to guarantee the claims), should be made prerequisite of this\nstandard (See Normative References)."
    }
  ],
  "definitions": [
    {
      "term": "Accredited Halal Certification Body",
      "definition": "a firm or company which has been certified by the National Accreditation Body as being competent and authorized to carry out Halal Certification;",
      "source_provision": "sec2"
    },
    {
      "term": "article",
      "definition": "any substance, artificial or natural, or partly artificial or partly natural, whether partly or wholly processed or manufactured product, and any service or financial product offered to the public;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "the Pakistan Halal Authority established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of Governors constituted under section 5;",
      "source_provision": "sec2"
    },
    {
      "term": "chairperson",
      "definition": "the chairperson of the Board of Governors;",
      "source_provision": "sec2"
    },
    {
      "term": "Director General",
      "definition": "the Director General of the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "Halal",
      "definition": "anything permitted by the laws of Islam;",
      "source_provision": "sec2"
    },
    {
      "term": "Halal Certificate",
      "definition": "the certificate issued by an Accredited Halal Certification Body to the effect that an article or process is in conformity with the Halal Standard pertaining thereto, and authorizing use of the Halal logo in respect thereof;",
      "source_provision": "sec2"
    },
    {
      "term": "Halal Certification",
      "definition": "the entire process of conformity assessment including audit, inspection, testing, and evaluation to establish that an article or process is in conformity with the Halal Standard, resulting in issue of a Halal Certificate;",
      "source_provision": "sec2"
    },
    {
      "term": "Halal logo",
      "definition": "the logo approved by the Authority for a Halal article or process signifying that the same is in conformity with the Halal Standard pertaining thereto;",
      "source_provision": "sec2"
    },
    {
      "term": "Halal Standard",
      "definition": "the Pakistan Halal Standard for an article or process notified by the National Standards Body;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of the Board of Governors;",
      "source_provision": "sec2"
    },
    {
      "term": "National Accreditation Body",
      "definition": "the Pakistan National Accreditation Council or such other body as may be notified for the purpose by the Government;",
      "source_provision": "sec2"
    },
    {
      "term": "National Standards Body",
      "definition": "the Pakistan Standards and Quality Control Authority or such other body as may be notified for the purpose by the Government;",
      "source_provision": "sec2"
    },
    {
      "term": "OIC Guidelines",
      "definition": "the guidelines, specified in Schedule - I, issued by the Organization of the Islamic Cooperation from time to time relating to Halal food and other articles or processes;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules or regulations;",
      "source_provision": "sec2"
    },
    {
      "term": "process",
      "definition": "a series of steps for the production, manufacture or development of any article or system;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act.",
      "source_provision": "sec2"
    }
  ]
}
