{
  "id": "pk-pakistan-institute-for-parliamentary-services-act-2008",
  "type": "statute",
  "title": "Pakistan Institute for Parliamentary Services Act, 2008",
  "title_en": "Pakistan Institute for Parliamentary Services Act, 2008",
  "short_name": "PIFPS",
  "status": "in_force",
  "issued_date": "2008-12-13",
  "in_force_date": "2008-12-13",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NpapZm-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Institute for Parliamentary Services Act, 2008 (III of 2008) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Pakistan\nInstitute for Parliamentary Services Act, 2008.\n(2)    It extends to the whole of Pakistan.\n(3)    It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(a)     \"Board\" means the Board of Governors constituted under section 6;\n(b)     \"Constitution\" means the Constitution of the Islamic Republic of Pakistan;\n(c)     \"Executive Director\" means the Executive director of the Institute;\n(d)     \"Federal Government\" means the Federal Government of Pakistan;\n(e)     \"Institute\" means the Pakistan Institute for Parliamentary Services;\n(f)     \"Member\" means a member of the Board;\n(g)     \"National Assembly\" means the National Assembly of Pakistan;\n(h)    \"Parliament\" means the National Assembly of Pakistan and the Senate of\nPakistan as defined in the Constitution;\n(i)    “Parliamentarian\" means a member of the Senate, National Assembly or\nmember of a Provincial Assembly;\n(j)    \"Parliamentary functionaries\" mean the employees of the Senate, National\nAssembly and a Provincial Assembly;\n(k)    \"Prescribed\" means prescribed by rules made under this Act;\n(l)    \"President\" means the President of the Board;\n(m)    \"Provincial Assembly\" means a provincial Assembly of a Province;\n(n)    \"Rules\" means the rules made under this Act; and\n(o)    \"Senate\" means the Senate of Pakistan."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Institute",
      "content": "(l) There shall be established an Institute to be known\nas the Pakistan Institute for Parliamentary Services.\n(2)     The Institute shall be a body corporate by the name of the Pakistan Institute for\nParliamentary Services having perpetual succession and a common seal, with power subject to the\nprovisions of this Act, to acquire and hold property, and shall by the said name sue and be sued.\n(3)    The Institute shall be located at Islamabad and may establish its branches in the\nprovinces."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Functions of the Institute",
      "content": "The functions of the Institute shall be,—\n(a)    to maintain the national, provincial and international data, information and\nstatistics to provide to the Parliamentarians for the efficient performance of their\nduties;\n(b)    to undertake the research in respect of the Federal and Provincial laws and also to\nhave a study of international laws to help the Parliamentarians in the law making\nprocess;\n(c)    to provide technical assistance to Parliamentarians in performance of their duties;\n(d)        to provide training to the Parliamentarians and the parliamentary functionaries\nfor performance of their duties;\n1\n[(da) to provide for in-service training related to parliamentary affairs, to the Federal\nGovernment’s officials including the civil servants and such officials of the\nProvincial Governments nominated by respective Governments and selected by\nthe Establishment Division;]\n(e)        to arrange seminars, workshops or conferences;\n(f)        to take measures for the development of law making;\n(g)        to maintain a record of all the existing Act, Ordinances and other enactments in\nforce in Pakistan and in each Province;\n(h)        to assist Parliamentarians and legislative bodies in their efforts to ensure the\npublic's understanding of working of Parliament;\n(i)        to arrange legislative drafting courses with special emphasis on parliamentary\npractices;\n(j)        manage the internship programs for the Parliament and the Provincial\nAssemblies;\n(k)        to establish and maintain resource centres for Parliamentarians;\n(l)        to support the parliamentary committees in the performance of their functions;\nand\n(m)        any other function as may be assigned to it by the Parliament or the Board."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Board of Governors",
      "content": "The over all control, direction and the superintendence of the\naffairs of the institute shall vest in the Board of Governor which may exercise all powers, perform all\nfunctions and do all acts which may be exercised, performed or done by the institute."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Composition of the Board of Governors",
      "content": "(l) The Board of Governors shall consist of\nfollowing members, namely:—\n1Ins. by the Pakistan Institute for Parliamentary Services (Amendment) Act, 2020 (XIII of 2020), s. 2.\n(a)         Chairman of the Senate or the Speaker of the National                   President\nAssembly by rotation for three years.\n(b)         Deputy Chairman of the Senate or the Deputy Speaker                 Vice-President\nof the National Assembly by rotation for a period of\nthree years. However, the President and the Vice-\nPresident shall not be from the same House at a time.\n(c)         Minister for Parliamentary Affairs of Government of                       Member\nPakistan.\n(d)         The Speaker of each Provincial Assembly, and in his                       Member\nabsence, Deputy Speaker of the Assembly concerned.\n(e)         Four members of the Senate to be nominated by the                         Member\nChairman of the Senate on the basis of party\nrepresentation in consultation with the parliamentary\nparty leaders.\n(f)         Eight members of the National Assembly to be                              Member\nnominated by the Speaker on the basis of party\nrepresentation in consultation with the parliamentary\nparty leaders.\n(g)         Secretary Senate of Pakistan.                                Ex-officio Member\n(h)         Secretary National Assembly of Pakistan                      Ex-officio Member\n(i)         Executive Director of the Institute.                         Ex-officio Member\n(2)    Executive Director of the Institute shall also act as Secretary of the Board."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Functions and powers of the Board",
      "content": "In particular and without prejudice to the\ngenerality of the powers conferred by section 5, the Board shall,—\n(a)     exercise the general control over the affairs of the Institute;\n(b)     approve over all plans, policies and programs of the Institute;\n(c)     approve annual and long term business plan of the Institute;\n(d)     review and approve training and research projects proposed by the\nExecutive Director;\n(e)     approve the annual development and non-development budget of the\nInstitute;\n(f)     approve the organizational structure of the Institute and lay down the\nterms and conditions of service of the employees of the Institute;\n(g)     engage such consultants or experts as may be considered necessary for\nthe efficient performance of the functions of the Institute, on such terms\nand conditions as it deems fit;\n(h)     appoint the Executive Director and other officers of the Institute and\napprove their terms and conditions of service;\n(i)     constitute sub-committees or advisory committees for the efficient\ndischarge of the functions of the Institute;\n(j)     ensure the finances for the Institute and exercise oversight thereof;\n(k)     approve and submit and annual report of the Institute; and\n(l)     make rules to carry out the purposes of this Act."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Term of office of members",
      "content": "(1) A member shall hold office for a period of three years\nfrom the date of his assuming the office and shall be eligible for being nominated for another term of\nthree years only:\nProvided that if he ceases to be a Parliamentarian, he shall cease to be a member of the Board.\n(2)      A person who is an ex-officio member shall cease to be, a member when he ceases to\nhold that office or appointment.\n(3)      A member other than an ex-officio member may at any time resign his membership by\nwriting under his hand addressed to the President of the Board, but shall continue to perform his\nfunctions until his resignation is accepted.\n(4)    A vacancy caused by the resignation or by any other reason shall be filled by nomination\nby the Chairman or the Speaker, as the case may be, in the manner provided in section 6.\n(5)    No act or proceeding of the Board shall be invalid on the ground only of the existence of\nany vacancy in the Board."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Meetings of the Board",
      "content": "(1) Save as hereinafter provided, the board shall regulate the\nprocedure for its meetings.\n(2)     Meetings of the Board shall be called by the President who shall fix the date, time and\nplace of the meeting:\nProvided that the Board shall hold at least one meeting every four months in a year.\n(3)    One-third of the total membership shall constitute the quorum of the meeting of the\nBoard.\n(4)     Each meeting of the Board shall be presided over by the President and in his absence by\nthe Vice-President of the Board.\n(5)     The decision in each meeting shall be taken by the majority of the members present in\nthe meeting. In case of equality of votes, the President shall have a casting vote.\n(6)    The minutes of each meeting of the Board shall be recorded and kept by the Secretary of\nthe Board and shall be signed and authenticated by the President."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Executive Director of the Institute",
      "content": "(1) The Board of Governors shall appoint the\nExecutive Director of the Institute.\n(2)    The qualifications of the Executive Director shall be such as may be prescribed by the\nBoard.\n(3)    The Executive Director shall hold office during the pleasure of the Board.\n(4)    The salary and remunerations of the Executive Director and the terms and conditions of\nhis service shall be determined by the Board."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Powers and functions of the Executive Director",
      "content": "The Executive Director shall be the\nChief Executive of the Institute and shall work under the control of the Board and perform the\nfollowing functions, namely:—\n(a)     to ensure efficient functioning of the Institute and to run the day to day\nadministrative matters of the Institute;\n(b)     to carry out the directives and decisions of the board and to formulate the\nprograms for their implementation;\n(c)     to formulate and implement training and research plans for Parliamentarians and\nparliamentary functionaries;\n(d)     to arrange for the conferences, seminars, workshops, orientation and refresher\ncourses for the Parliamentarians and parliamentary functionaries;\n(e)    to prepare the annual report of the Institute for submission to the Board;\n(f)    to appoint such officers and employees as determined by the Board on such terms\nand conditions as may be prescribed;\n(g)    to prepare and propose budget estimates for approval of the Board;\n(h)    to ensure the protection of all assets of the Institute;\n(i)    to maintain the records and seal of the Institute; and\n(j)    such other functions as may be entrusted to him by the Board."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. The Funds of the Institute",
      "content": "The Funds of the Institute shall comprise,—\n(a)     the funds allocated by the Senate from its budget to the Institute which\nshall be one third of the total annual expenses of the Institute;\n(b)     the funds allocated by the National Assembly from its budget to the\nInstitute which shall be two third of the total annual expenses of the\nInstitute;\n(c)     the contributions made by each Provincial Assembly;\n(d)     the contributions made by Parliamentarians;\n(e)     the grants in aid given by any national or international agencies and\norganization;\n(f)     the funds granted by the Federal Government or a Provincial\nGovernment; and\n(g)     the funds raised by the Institute, through donations, endowments and\nthrough its own sources."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Annual Budget",
      "content": "(l) The Executive Director shall, in respect of each financial year,\nsubmit for approval of the Board a statement showing the estimated receipt and expenditure of the\nInstitute for the next financial year in time.\n(2)     The budget prepared by the Executive Director shall be approved by the board with such\namendments as it may deem necessary.\n(3)    The budget approved by the Board shall be submitted to the Senate and the National\nAssembly Secretariats in time for the necessary allocation of finds."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Accounts of the Institute",
      "content": "(1) The accounts of the Institute shall be maintained in such\nform and manner as the Board may prescribe.\n(2)        The accounts of the Institute shall be audited by the Auditor General every year, and made\npart of the annual Report of the Institute.\n1"
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. [Appointment of employees and conditions of service]",
      "content": "(l) The Board shall make\nrules for recruitment of the employees of the Institute and the Executive Director shall act in\naccordance with the rules.\n(2)        The employees may be recruited on permanent or contract basis.\n(3)     The terms and conditions of service, promotion, reduction, removal, suspension and\nother service matters of the employees shall be regulated by the service rules of the Institute made by\nthe Board.\n1\n[(4) The terms and conditions of service of any person to whom this Act applies shall not be\nvaried to his disadvantage.\n(5)     Subject to the provision of this Act and rules made thereunder, the employees of the\nInstitute shall be entitled to such perks, entitlements, memberships, facilities, including but not limited\nto housing and all other schemes of the Government, as admissible or enjoyed or admissible to the\nemployees of the Senate and National Assembly Secretaries in the corresponding equivalent scales,\nnotwithstanding any judgment or order of any court, tribunal or a quasi-judicial authority.]"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Delegation of Powers",
      "content": "The Board may by general or special order in writing delegate\nany of its powers to any of its members, the Executive Director or any Officer of the Institute subject to\nsuch condition as it may deem fit to impose.\n1Subs. and added by the Pakistan Institute for Parliamentary Services (Amendment) Act, 2021 (II of 2021), s. 2."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Submission of Annual report",
      "content": "The Board shall submit to the Parliament an annual\nreport containing the activities of the Institute during a year. The report shall also highlight the objects\nof the Act achieved by the Institute and shall also give a picture of the finances and future plans of the\nInstitute."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Directive from the Parliament",
      "content": "(1) In performance of its functions, the Institute shall\nbe guided by the directives and instructions, if any, given to it by the Parliament and such directives and\ninstructions shall he binding on the Institute.\n(2)    The directive and instruction shall be approved by the Senate as well as the National\nAssembly before its issuance to the Institute."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Declaration of fidelity and secrecy",
      "content": "Every officer or other employee of the Institute\nshall make such declaration of fidelity and secrecy as may be prescribed."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Exemption from taxes",
      "content": "Notwithstanding anything contained in the Income Tax\nOrdinance, 2001 (XLIX of 2001) or any other fiscal law for the time being in force, the Institute shall\nnot be liable to pay any tax on its income, capital profit, wealth or gain."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Ordinance XCI of 2002, not to apply to the Institute",
      "content": "Nothing contained in the\nIndustrial Relations Ordinance, 2002 (XCI of 2002) shall apply to or in relation to the Institute or any of\nthe officer, advisor and employee appointed by it."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Bar of Jurisdiction",
      "content": "No court or tribunal shall have jurisdiction to entertain any\nproceedings, grant any injunction or make any order in relation to anything done in good faith or\npurported to have been done in good faith or intended to be done under this Act."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to any provisions of\nthis Act, the President of the Board may make such order not inconsistent with the provisions of this\nAct as may appear to him to be necessary or expedient for the purpose of removing the difficulty."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Power to make Rules",
      "content": "The Board may by notification in the official Gazette, make\nrules for carrying out the purposes of this Act.\n_____________"
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Board of Governors constituted under section 6;",
      "source_provision": "sec2"
    },
    {
      "term": "Constitution",
      "definition": "the Constitution of the Islamic Republic of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "Executive Director",
      "definition": "the Executive director of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Federal Government",
      "definition": "the Federal Government of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "Institute",
      "definition": "the Pakistan Institute for Parliamentary Services;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "a member of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "National Assembly",
      "definition": "the National Assembly of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "Parliament",
      "definition": "the National Assembly of Pakistan and the Senate of Pakistan as defined in the Constitution;",
      "source_provision": "sec2"
    },
    {
      "term": "Parliamentarian",
      "definition": "a member of the Senate, National Assembly or member of a Provincial Assembly;",
      "source_provision": "sec2"
    },
    {
      "term": "Prescribed",
      "definition": "prescribed by rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "President",
      "definition": "the President of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "Provincial Assembly",
      "definition": "a provincial Assembly of a Province;",
      "source_provision": "sec2"
    },
    {
      "term": "Rules",
      "definition": "the rules made under this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "Senate",
      "definition": "the Senate of Pakistan.",
      "source_provision": "sec2"
    }
  ]
}
