{
  "id": "pk-pakistan-institute-of-development-economics-act-2010",
  "type": "statute",
  "title": "Pakistan Institute of Development Economics Act, 2010",
  "title_en": "Pakistan Institute of Development Economics Act, 2010",
  "short_name": "PIODE",
  "status": "in_force",
  "issued_date": "2010-04-16",
  "in_force_date": "2010-04-16",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Fsa5k%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Institute of Development Economics Act, 2010 (VIII of 2010) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, application and commencement",
      "content": "(1) This Act may be called the\nPakistan Institute of Development Economics Act, 2010.\n(2)    It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything' repugnant in the subject or\ncontext,__\n(a)     “Academic Council” means the Academic Council of the Institute established\nunder section 22;\n(b)     “Authority” means any of the Authorities of the Institute specified in section\n16;\n(c)     “Chancellor” means the Chancellor of the Institute;\n(d)     “Commission” means the Higher Education Commission established under the\nHigher Education Commission Ordinance, 2002 (LIII of 2002);\n(e)     “Committee” means the committees of the Institute constituted under sections\n24 and 25;\n(f)     “Dean” means the head of a Faculty or the head of an academic body granted\nthe status of a Faculty by this Act or by the Statutes or Regulations;\n(g)     “department” means a teaching department maintained and administered or\nrecognized by the Institute in the manner prescribed;\n(h)     “Director” means the head of Research Centre;\n(i)    “Faculty” means an administrative and academic unit of the Institute\nconsisting of one or more departments, as prescribed;\n(j)    “Institute” means the Pakistan Institute of Development Economics\nreconstituted under this Act;\n(k)    “Institute Teacher” means Professor, Assistant Professor and Lecturer engaged\non whole time basis by the Institute for teaching;\n(1)    “Patron” means the Patron of the Institute;\n(m)    “prescribed” means prescribed by Statutes, Regulations or Rules made under\nthis Act;\n(n)    “Registrar” means the Registrar of the Institute;\n(o)    “Representation Committees”          means    the   Representation   Committees\nconstituted under section 24;\n(p)    “Review Panel” means the Review Panel set up by the Chancellor in\naccordance with the provisions of section 9;\n(q)    “Senate” means the Senate of the Institute;\n(r)    “statutes”, “Regulations” and “Rules” mean respectively the statutes, the\nregulations and the rules made under this Act and for the time being in force;\n(s)    “Syndicate” means the Syndicate of the Institute; and\n(t)    “teachers” include Professor, Associate Professors, Assistant Professors and\nLecturers engaged on whole-time basis by the Institute and such other persons\nas may be declared to be teachers by Regulations."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment and incorporation of the Institute",
      "content": "(1) The Pakistan Institute of\nDevelopment Economics, Islamabad, as reconstituted in accordance with the provisions of this Act,\nshall consist of__\n(a)    the Patron, the Chancellor, the Vice-Chancellor, the Senate, the Deans, the\nRegistrar and the Directors;\n(b)    the members of the Senate, Academic Council, committees and other bodies\nas the Senate may establish;\n(c)    the teachers and students of the Institute; and\n(d)    such other full-time officers and members of the staff as the Senate may, from\ntime to time, specify.\n(2)    The Institute shall be a body corporate by the name of the Pakistan Institute of\nDevelopment Economics, Islamabad, having perpetual succession and a common seal, and may sue\nand be sued by the said name.\n(3)   The Institute shall be competent to acquire and hold property, both movable and\nimmovable, and to lease, sell or otherwise transfer any movable and immovable property which may\nhave become vested in or been acquired by it.\n(4)      Notwithstanding anything contained in any other law for the time being in force, the\nInstitute shall have academic, financial and administrative autonomy, including the power to employ\nofficers, teachers and other employees on such terms as may be prescribed, subject to the provision\nof this Act and the Higher Education Commission Ordinance, 2002 (LIII of 2002). In particular, and\nwithout prejudice to the authority granted to the Commission by law, the Federal Government or an\nauthority or auditor appointed by the Federal Government shall have no power to question the policy\nunderlying the allocation of resources approved by the Senate in the annual budget of the Institute.\n(5)     All properties, rights and interests of whatever kind, used, enjoyed, possessed, owned\nor vested in, or held in trust by and liabilities legally subsisting against the Institute in existence\nimmediately before the commencement of this Act shall pass to the Institute reconstituted under this\nAct.\n(6)     The seat of the Institute shall be at Islamabad and it may set up its Research Study\nCenters at such places in Pakistan as Senate may determine."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers and Purposes of the Institute",
      "content": "The Institute, in order to become a\nnationally and internationally recognized premier institute of learning and research in the fields of\ndevelopment and economics, shall have the following powers namely:___\n(i)     to provide for education and scholarship in the fields of development and\neconomics such as economics, international economics, development\neconomics, business economics, trade and commerce, environmental\neconomics, public policy and governance, technology and development, fiscal\npolicies and taxation, economics of competitiveness, agricultural economics,\nsocial and political economy and in such branches of knowledge which it may\ndeem fit, and to make provision for research, service to society and for the\napplication, advancement and dissemination of knowledge in such manner as\nit may determine;\n(ii)    to prescribe courses of studies to be conducted by it;\n(iii)   to hold examinations and to award and confer degrees, diplomas, certificates\nand other academic distinctions to and on persons who have been admitted to\nand have passed its examinations under prescribed conditions;\n(iv)    to prescribe the terms and conditions of employment of the officers, teachers\nand other employees of the Institute and to lay down terms and conditions that\nmay be different from those applicable to Government servants in general;\n(v)     to engage, where necessary, person on contracts of specified duration and to\nspecify the terms of each engagement;\n(vi)    to confer honorary degrees or other distinctions on approved persons in the\nmanner prescribed;\n(vii)   to provide for such instruction for person not being students of the Institute as\nit may prescribe, and to grant certificates and diplomas to such persons;\n(viii) to institute programmes for the exchange of students and teachers between the\nInstitute and other universities, educational institutions and research\norganizations, inside as well as outside Pakistan;\n(ix)    to provide career counseling and job search to students and alumni;\n(x)     to maintain linkages with alumni;\n(xi)    to develop and implement fund-raising plans;\n(xii)   to provide and support the academic development of the faculty of the\nInstitute;\n(xiii) to confer degrees on persons who have completed the requisite course work\nand carried out research off campus under prescribed conditions and\nsupervision;\n(xiv)   to accept the examinations passed and the period of study spent by students of\nthe Institute at other universities and places of learning equivalent to such\nexaminations and periods of study in the Institute, as it may prescribe, and to\nwithdraw such acceptance;\n(xv)    to co-operate with other Universities, public authorities or private\norganizations, inside as well as outside Pakistan, in such manner and for such\npurposes as it may prescribe;\n(xvi)   to institute Professorships, Associate Professorships, Assistance\nProfessorships and Lectureships and any other posts and to appoint persons\nthereto;\n(xvii) to create posts for research, extension, administration and other related\npurposes and to appoint persons thereto;\n(xviii) to institute and award financial assistance to students in need, fellowships,\nscholarships, bursaries, medals and prizes under prescribed conditions;\n(xix)   to establish teaching departments, and other centers of research and to make\nsuch arrangements for their maintenance, management and administration as it\nmay prescribe;\n(xx)    to provide for the residence of the students of the Institute, to institute and\nmaintain halls of residence and to approve or license hostels and lodging;\n(xxi)   to maintain order, discipline and security on the campuses of the Institute;\n(xxii) to promote the extra curricular and recreational activities of such students, and\nto make arrangement for promoting their health and general welfare;\n(xxiii) to demand and receive such fees and other charges as it may determine;\n(xxiv) to make provisions for research, advisory or consultancy services and with\nthese objects to enter into arrangements with other institutions, public or\nprivate bodies, commercial and industrial enterprises under prescribed\nconditions;\n(xxv) to enter into, carry out vary or cancel contracts;\n(xxvi) to receive and manage property transferred and grants, contributions made to\nthe institute and to invest any fund representing such property, grants\nbequests, trust, gifts, donations, endowments or contributions in such manner\nas it may deem fit;\n(xxvii) to provide for the printing and publication of research and other works; and\n(xxviii)to do all such other acts and things, whether incidental to the powers aforesaid\nor not, as may be requisite or expedient in order to further the objectives of the\nInstitute as a place co-education, learning, and research."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Institute open to all classes, creeds, etc",
      "content": "(l) The Institute shall be open to all\npersons of either sex of whatever, religion, race, creed, color or domicile who are academically\nqualified for admission to the courses of study offered by the Institute, and no such person shall be\ndenied the privilege on the ground only of sex, religion, creed, race, class, color or domicile.\n(2)     An increase in any fee or charge may be made only with the approval of the Senate.\n(3)    The Institute shall institute financial aid programmes for students in need, to the\nextent considered feasible by the Senate given the resources available, so as to enable admission and\naccess to the Institute and the various opportunities provided by it to be based on merit rather than\nability to pay;\n(4)     The Institute shall offer admission on merit to its teaching and research programmes\nup to a maximum of ten percent of its total students strength to overseas Pakistanis and international\nstudents at the fee structure to be determined by the Senate."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Teaching and Examination at the Institute",
      "content": "(1) All recognized teachings in\nvarious courses shall be conducted by the Institute in the prescribed manner and may include\nlectures, tutorials, discussions, seminars, demonstrations, distance learning and other methods of\ninstruction as well as practical work in Government or private organizations.\n(2)    The authority responsible for organizing recognized teaching shall be such as may be\nprescribed.\n(3)      The academic programmes of the Institute shall be conducted in the prescribed\nmanner.\n(4)     The Institute shall associate external examiners for the conduct of examination.\n(5)     In the prescribing syllabi, courses of studies and instructions for the conduct of\nstudies, the Institute shall abide by the directions given by the Higher Education Commission under\ncurricula, textbooks, and maintenance of standards of education."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Principal Officers",
      "content": "The following shall be the principal officers of the Institute,\nnamely:__\n(a)    the Patron;\n(b)    the Chancellor;\n(c)    the Vice-Chancellor;\n(d)    the Deans;\n(e)    the Directors;\n(f)    the Registrar;\n(g)    the Treasurer;\n(h)    the Controller of Examinations; and\n(i)    such other persons as may be prescribed by the Statutes or Regulations to be\nthe principal officers of the Institute."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Patron",
      "content": "(1) The President of the Islamic Republic of Pakistan shall be the Patron of\nthe Institute.\n(2)      The Patron, or in his absence, the Chancellor shall preside at the convocation of the\nInstitute.\n(3)    Every proposal to confer any honorary degree shall be subject to confirmation by the\nPatron.\n(4)    The Patron, may cause an inspection or inquiry to be made in respect of any matter\nconnected with the affairs of the Institute and shall, from time to time, direct any person or persons\nas he may deem fit to inquire into or carry out inspection of such matters a may be specified by him.\n(5)    The Patron shall communicate to the Senate his views with regard to the result of\nvisitation and shall, after ascertaining the views of the Senate, advise the Senate on the actions to be\ntaken by it.\n(6)  The Senate shall, within such time as may be specified by the Patron, communicate to\nhim such action, if any, as has been taken or may be proposed to be taken upon the result of\nvisitation.\n(7)     Where the Senate does not, within the time specified, take action to the satisfaction of\nthe Patron, the Patron may issue such directions as he deems fit and the Senate shall comply with all\nsuch directions."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Chancellor",
      "content": "(1) The Deputy Chairman, Planning Commission shall be the\nChancellor of the Institute and the Chairperson of the Senate.\n(2)     The members of the Senate shall be appointed by the Chancellor.\n(3)      If the Chancellor is satisfied that serious irregularity or mismanagement with respect\nto the affairs of the Institute has occurred, he may ___\n(a)     as regards proceedings of the Senate, direct that specified proceedings be\nreconsidered and appropriate action taken within one month of the direction\nhaving been issued:\nProvided that if the Chancellor is satisfied that either no reconsideration has been carried out\nor that the reconsideration has failed to address the concern expressed he may, after calling upon the\nSenate to show cause in writing, appoint a five member Review Panel to examine and report to the\nChancellor on the functioning of the Senate. The report of the Review Panel shall be submitted\nwithin such time as may be prescribed by the Chancellor. The Review Panel shall be drawn from\npersons of eminence in academics and in the fields of law, accountancy and administration; and\n(b)     as regards proceedings of any Authority or with respect to matters within the\ncompetence of any Authority other than the Senate, direct the Senate to\nexercise powers under section 18."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Removal from the Senate",
      "content": "(1) The Chancellor may upon the recommendation of\nthe Review Panel, remove any person from the membership of the Senate on the ground that such\nperson__\n(a)     has become of unsound mind;\n(b)     has become incapacitated to function as member of the Senate;\n(c)     has been convicted by a Court of law for an offence involving moral turpitude;\n(d)     has absented himself from two consecutive meetings without just cause; or\n(e)     has been guilty of misconduct, including use of position for personal\nadvantage of any kind, or gross inefficiency in the performance of function.\n(2)    The Chancellor shall remove any person from the membership of the Senate on a\nresolution calling for the removal of such person supported by at least three-fourths of the\nmembership of the Senate:\nProvided that before passing such resolution the Senate shall provide the member concerned\na fair hearing:\nProvided further that the provisions of this section shall not be applicable to the Vice-\nChancellor in his capacity as a member of the Senate."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Vice",
      "content": "Chancellor.__ (1) There shall be a Vice-Chancellor of the Institute who shall be\nan eminent academic or a distinguished administrator and shall be appointed on such terms and\nconditions as may be prescribed.\n(2)   The Vice-Chancellor shall be the chief executive officer of the Institute responsible\nfor all administrative and academic functions of the Institute and for ensuring that the provisions of\nthis Act, Statutes, Regulations and Rules are faithfully observed in order to promote the general\nefficiency and good order of the Institute. The Vice-Chancellor shall have all powers prescribed for\nthis purpose, including administrative control over the officers, teachers and other employees of the\nInstitute.\n(3)     The Vice-Chancellor shall, if present, be entitled to attend any meeting of any\nAuthority or body of the Institute.\n(4)    The Vice-Chancellor may, in an emergency that in his opinion requires immediate\naction ordinarily not in the competence of the Vice-Chancellor, take such action and forward, within\nseventy-two hours, a report of the action taken to the members of the Emergency Committee of the\nSenate, to be set up by Statute. The Emergency Committee may direct such further action as is\nconsidered appropriate.\n(5)     The Vice-Chancellor shall also have the following powers, namely:__\n(a)     to direct teachers, officers and other employees of the Institute to take up such\nassignments in connection with examination, administration and such other activities\nin the Institute as he may consider necessary for the purposes of the Institute;\n(b)     to sanction by re-appropriation an amount not exceeding an amount prescribed by the\nSenate for an unforeseen item not provided for in the budget and report it to the\nSenate at the next meeting;\n(c)     to make appointments of such categories of employees of the Institute and in such\nmanner as may be prescribed by the statutes;\n(d)     to suspend, punish and remove, in accordance with prescribed procedure, from service\nofficers, teachers and other employees of the Institute except those appointed by or\nwith the approval of the Senate;\n(e)     to delegate, subject to such conditions as may be prescribed, any of his powers under\nthis Act to an officer or officers of the Institute; and\n(f)     to exercise and perform such other powers and functions as may be prescribed.\n(6)     The Vice-Chancellor shall present an annual report before the Senate within three\nmonths of the close of the academic year. The annual report shall present such information as regards\npertaining to__\n(a)    academics;\n(b)    research;\n(c)    administration; and\n(d)    finances.\n(7)    The Vice-Chancellor's annual report shall be made available, prior to its presentation\nbefore the Senate, to all officers and Institute teachers and shall be published in such numbers as are\nrequired to ensure its wide circulation."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Appointment and removal of the Vice",
      "content": "Chancellor.__ (1)The Vice-Chancellor shall\nbe appointed by the Patron on the recommendations of the Search Committee.\n(2)    A Search Committee for the recommendation of persons suitable for appointment as\nVice-Chancellor shall be constituted by the Senate on the date and in the manner prescribed by the\nstatutes and shall consist of Chancellor as Chairperson, Governor of State Bank of Pakistan,\nChairman HEC, Rector of leading private sector university and an internationally renowned\neconomist and shall make its recommendations through transparent and competitive process. The\nSearch Committee shall remain in existence till such time that the appointment of the next Vice-\nChancellor is made by the Patron.\n(3)    The Search Committee for appointment of Vice-Chancellor shall recommend a panel\nof two, in order of priority, to the Patron:\nProvided that the Patron may decline to appoint any of the two persons recommended, by\nindicating reasons and seek recommendation of a fresh panel. In the event of a fresh recommendation\nbeing sought by the Patron the Search Committee shall make a proposal to the Patron in the\nprescribed manner.\n(4)    The Vice-Chancellor shall be appointed for a period of five years on terms and\nconditions prescribed by statutes. Three months prior to the completion of Vice-Chancellor term of\noffice the process of selection of new Vice-Chancellor shall be initiated in accordance with the\nsubsection (2) of the section 12.\n(5)     The Senate may, pursuant to a resolution in this behalf passed by three-fourths of its\nmembership, recommend to the Patron the removal of the Vice-Chancellor on the ground of\ninefficiency, moral turpitude or physical or mental incapacity or gross misconduct, including misuse\nof position for personal advantage of any kind:\nProvided that the Patron may make a `reference to the Senate stating the instances of\ninefficiency, moral turpitude or physical or' mental incapacity or gross misconduct on the part of the\nVice-Chancellor that have come to his notice. After consideration of the reference the Senate may,\npursuant to a resolution in this behalf passed by two-thirds of its membership, recommend to the\nPatron the removal of the Vice-Chancellor:\nProvided further that prior to a resolution for the removal of the Vice-Chancellor being voted\nupon the Vice-Chancellor shall be given an opportunity of being heard.\n(6)     A resolution recommending the removal of the Vice-Chancellor shall be submitted to\nthe Patron forthwith. The Patron may accept the recommendation and order removal of the Vice-\nChancellor or return the recommendation to the Senate.\n(7)      At any time when the office of the Vice-Chancellor is vacant, or the Vice-Chancellor\nis absent or is unable to perform the functions of his office due to illness or some other cause, the\nSenate shall make such arrangements or the performance of the duties of the Vice Chancellor as it\nmay deem fit."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Registrar",
      "content": "(1) There shall be a Registrar of the Institute to be appointed by the\nSenate through transparent and merit based process, on the recommendation of the Vice-Chancellor,\non such terms and conditions as may be prescribed.\n(2)    The experience as well as the professional and academic qualifications necessary for\nappointment to the post of the Registrar shall he as may be prescribed.\n(3)    The Registrar shall be a full-time officer of the Institute and shall:__\n(a)    be the administrative head of the secretariat of the Institute and be responsible\nfor the provision of secretariat support to the Authorities of the Institute;\n(b)    be the custodian of the common seal and the academic records of the Institute;\n(c)    maintain a register of registered graduates in the -prescribed manner;\n(d)    supervise the process of election, appointment or nomination of members to\nthe various authorities and other bodies in the prescribed manner; and\n(e)    perform such other duties as may be prescribed.\n(4)    The term of office of the Registrar shall be for a period of four years:\nProvided that the Senate may, on the advice of the Vice-Chancellor, terminate the\nappointment of the Registrar on grounds of inefficiency or misconduct in accordance with prescribed\nprocedure."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Treasurer",
      "content": "(1) There shall be a Treasurer of the Institute to be appointed by the\nSenate through transparent and merit based process, on the recommendation of the Vice-Chancellor,\non such terms and conditions as may be prescribed.\n(2)    The experience and the professional and academic qualifications necessary for\nappointment to the post of the Treasurer shall be such as may be prescribed.\n(3)    The Treasurer shall be the chief financial officer of the Institute and shall__\n(a)    manage the assets, liabilities, receipts, expenditures, funds and investments of\nthe Institute;\n(b)    prepare the annual and revised budget estimates of the Institute and present\nthem to the Syndicate or a committee thereof for approval and incorporation in\nthe budget to be presented to the Senate;\n(c)    ensure that the funds of the Institute are expended on the purposes for which\nthey are provided;\n(d)    have the accounts of the Institute audited annually so as to be available for\nsubmission to the Senate within six months of the close of the financial year;\nand\n(e)     perform such other duties as may be prescribed.\n(4)     The term of office of the Treasurer shall be for a period of four years:\nProvided that the Senate may, on the advice of the Vice-Chancellor, terminate the\nappointment of the Treasurer on grounds of inefficiency or misconduct in accordance with\nprescribed procedure."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Controller of Examinations",
      "content": "(1) There shall be a Controller of Examinations to be\nappointed by the Senate through transparent and merit based process on recommendation of the\nVice-Chancellor, on such terms and conditions as may be prescribed.\n(2)     The minimum qualifications necessary for appointment to the post of the Controller of\nExaminations shall be such as may be prescribed.\n(3)     The Controller of Examinations shall be a full-time officer of the Institute and shall be\nresponsible for all matters connected with the conduct of examinations and perform such other duties\nas may be prescribed.\n(4)     The Controller of Examinations shall be appointed for a period of four years:\nProvided that the Senate may, on the advice of the Vice-Chancellor, terminate the\nappointment of the Controller of Examinations on grounds of inefficiency or misconduct in\naccordance with prescribed procedure."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Authorities",
      "content": "(l) The Following shall be the Authorities of the Institute, namely:__\n(a)     Authorities established by this Act, namely:\n(i)     the Senate;\n(ii)    the Syndicate; and\n(iii)   the Academic Council;\n(b)     Authorities to be established by the Statutes, namely:__\n(i)     Graduate and Research Management Council;\n(ii)    Recruitment, Development, Evaluation and Promotion Committees for\nteachers and other staff whether at the level of the department, the\nFaculty or the Institute;\n(iii)   Career Placement and Internship Committee of each Faculty;\n(iv)    Search Committee for the appointment of the Vice-Chancellor;\n(v)     the Representation Committees for appointment to the Senate,\nSyndicate and the Academic Council;\n(vi)    Faculty Council; and\n(vii)   Departmental Council.\n(2)      The Senate, the Syndicate and the Academic Council may set up such other\ncommittees or sub-committees, by whatever name described, as are considered desirable through\nstatutes or regulations as appropriate. Such committees or sub-committees shall be Authorities of the\nInstitute for the purposes of this Act."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Senate",
      "content": "(1) The body responsible for the governance of the Institute shall be\ndescribed as the Senate, and shall consist of the following, namely:__\n(a)     the Chancellor who shall be the Chairperson of the Senate;\n(b)     two parliamentarians, one from the National Assembly and one from the\nSenate;\n(c)     the Vice-Chancellor;\n(d)     the Secretary, Planning and Development Division;\n(e)     the Secretary, Ministry of Commerce;\n(f)     the Secretary, Finance;\n(g)     Chairman or Additional Chief Secretaries of Planning and Development\nDepartments of four Provinces;\n(h)     five persons from civil society being persons of distinction in the fields of\nmanagement, education, academics, agriculture, and economics such that the\nappointment of these persons reflects a balance across the various fields, the\nspecial focus of the Institute, may be reflected in the persons of distinction\nwho are appointed to the Senate;\n(i)     one distinguished person from amongst the alumni of the Institute;\n(j)     three Institute teachers, and\n(k)     a member of the Higher Education Commission.\n(2)     All appointments to the Senate shall be made by the Chancellor. Appointments of\npersons described in clauses (i) to (j) of subsection (1) shall be made from amongst a panel of three\nnames for each vacancy recommended by the Representation Committee set up in terms of section\n24 and in accordance with procedure as may be prescribed:\nProvided that effort shall be made, without compromising on quality or qualification, to give\nfair representation to women on the Senate:\nProvided further that as regards the Institute Teachers described in clause (i) of subsection (1)\nthe Senate shall prescribe a procedure for appointment on the basis of elections that provide for\nvoting by the various categories of Institute Teachers:\nProvided also that the Senate may alternatively prescribe that appointment of Institute\nteachers to the Senate shall also be in the manner provided by this subsection for persons described\nin clauses (g) to (h) of subsection (1).\n(3)   Members of the Senate, other than ex officio members, shall hold office for four\nyears. One-half of the members, other than ex officio members, of the first restructured Senate, to be\ndetermined by lot, shall retire from office on the expiration of two years from the date of\nappointment by the Chancellor:\nProvided that no person, other than an ex officio member, may serve on the Senate for more\nthan two consecutive terms:\nProvided further that the Institute teachers appointed to the Senate may not serve for two\nconsecutive terms.\n(4)     The Senate shall meet at least once in a calendar year.\n(5)     Service on the Senate shall be on honorary basis:\nProvided that travel and boarding or lodging expenses may be reimbursed as prescribed\n(6)     The Registrar shall be the Secretary of the Senate.\n(7)     In the absence of the Chancellor meetings of the Senate shall be presided over by such\nmember, not being an employee of the Institute or the Federal Government, as the Chancellor may,\nfrom time to time, nominate. The member so nominated shall be the convener of the Senate.\n(8)     Unless otherwise prescribed by this Act, all decisions of the Senate shall be taken on\nthe basis of the opinion of a majority of the members present. In the event of the members being\nevenly divided on any matter the person presiding over the meeting shall have a casting vote.\n(9)    The quorum for a meeting of the Senate shall be two-thirds of its membership, a\nfraction being counted as one."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Powers and functions of the Senate",
      "content": "(1)The Senate shall have the power of general\nsupervision over the Institute and shall hold the Vice-Chancellor and the Authorities accountable for\nall the functions of the Institute. The Senate shall have all powers of the Institute not expressly vested\nin an Authority or officer by this Act and all other powers not expressly conferred by this Act that\nare necessary for the performance of its functions.\n(2)   Without prejudice to the generality of the foregoing powers, the Senate shall have the\nfollowing powers namely:__\n(a)     to approve the proposed annual plan of work, the annual and revised budgets,\nthe annual report and the annual statement of account;\n(b)     to hold, control and lay down policy for the administration of the property,\nfunds and investments of the Institute, including the approval of the sale and\npurchase or acquisition of immovable property;\n(c)     to oversee, the quality and relevance of the Institute's academic programmes\nand to review the academic affairs of the Institute in general;\n(d)     to approve the appointment of the Deans, Professors, Associate Professors and\nsuch other senior faculty and senior administrators through a transparent and\nmerit based process as may be prescribed;\n(e)     to institute schemes, directions and guidelines for the terns and conditions of\nappointment of all officers, teachers and other employees of the Institute;\n(f)     to approve strategic plans;\n(g)     to approve financial resource development plans of the Institute;\n(h)     to consider the drafts of statutes and regulations proposed by the Syndicate\nand the Academic Council and deal with them in the manner as provided for in\nsections 26 and 27, as the case may be:\nProvided that the Senate may frame a Statute or Regulation on its own initiative and approve\nit after calling for the advice of the Syndicate or the Academic Council as the case may be;\n(i)     to annul by order in writing the proceedings of any Authority or officer if the\nSenate is satisfied that such proceedings are not in accordance with the\nprovisions of this Act, Statutes or Regulations after calling upon such\nAuthority or officer to show cause why such proceedings should not be\nannulled;\n(j)     to recommend to the Chancellor removal of any member of the Senate in\naccordance with the provisions of this Act;\n(k)     to make appointment of members of the Syndicate, other than ex officio\nmembers, in accordance with the provisions of this Act;\n(1)     to make appointment of members of the Academic ‘Council, other than ex\nofficio members, in accordance with the provisions of this Act;\n(m)     to appoint Emeritus Professors on such term and conditions as may be\nprescribed;\n(n)     to remove any person from the membership of any Authority if such person__\n(o)     has become of unsound mind; or\n(p)     has become incapacitated to function as member of such Authority; or\n(q)     has been convicted by a Court of law for an offence involving moral turpitude;\nand\n(o)     to determine the form, provide for the custody and regulate the use of the\ncommon seal of the Institute.\n(3)    The Senate may, subject to the provisions of this Act delegate all or any of the powers\nand functions of any Authority, officer or employee of the Institute at its main campus, to any\nAuthority, committee, officer or employee at its additional campus for the purpose of exercising such\npowers and performing such functions in relation to such additional campus, and for this purpose the\nSenate may create new posts or positions at the additional campus."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Visitation",
      "content": "The Senate may, in accordance with the terms and procedures as may be\nprescribed, cause an inspection to be made in respect of any matter connected with the Institute."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Syndicate",
      "content": "(1) There shall be a Syndicate of the Institute consisting of the following,\n__\nnamely\n(a)    the Vice-Chancellor who shall be its Chairperson;\n(b)    two members of the Senate to be nominated by the Senate;\n(c)    the Deans of the Faculties of the Institute;\n(d)    three professors from different departments, who are not members of the\nSenate, to be elected by the Institute Teachers in accordance with procedure to\nbe prescribed by the Senate;\n(e)    the Registrar;\n(f)    the Treasurer; and\n(g)    the Controller of Examinations.\n(2)     Members of the Syndicate, other than ex officio members, shall hold office for a\nperiod of three years.\n(3)    As regards the three professors described in clause (d) of subsection (1) the Senate\nmay, as an alternative to elections, prescribe a procedure for proposal of a panel of names by the\nRepresentation’ Committee set up in terms of section 24. Appointment of persons proposed by the\nRepresentation Committee may be made by the Senate on the recommendation of the Vice-\nChancellor.\n(4)      The quorum for a meeting of the Syndicate shall be one-half of the total number of\nmembers, a fraction being counted as one.\n(5)   The Syndicate shall meet at least once in each quarter of the year."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Powers and duties of the Syndicate",
      "content": "(1) The Syndicate shall be the executive body\nof the Institute and shall, subject to the provisions of this Act and the Statutes, exercise general\nsupervision over the affairs and management of the Institute.\n(2)    Without prejudice to the generality of the foregoing powers, and subject to the\nprovisions of this Act, the statutes and’ directions of the Senate the Syndicate shall have the\nfollowing powers, namely:__\n(a)    to consider the annual report, the annual and revised budget estimates and to\nsubmit these to the Senate;\n(b)    to transfer and accept transfer of movable property on behalf of the Institute;\n(c)   to enter into, vary, carry out and cancel contracts on behalf of the Institute;\n(d)   to cause proper books of account to be kept for all sums of money received\nand expended by the Institute and for the assets and liabilities of the Institute;\n(e)   to invest any money belonging to the Institute including any unapplied income\nin, any of the securities described in section 20 of the Trusts Act, 1882 (Act II\nof 1882), or the purchase of immovable property or in such other manner, as it\nmay prescribe, with the like power of varying such investments;\n(f)   to receive and manage any property transferred, and grants, bequests, trust,\ngifts, donations, endowments, and other contributions made to the Institute;\n(g)   to administer any funds placed at the disposal of the Institute for specified\npurposes;\n(h)   to provide, the buildings, libraries, premises, furniture, apparatus, equipment\nand other means required for carrying out the work of the Institute;\n(i)   to establish and maintain halls of residence and hostels or, approve or license\nhostels or lodgings for the residence of students;\n(j)   to arrange for the inspection of the departments;\n(k)   to institute Professorships, Associate Professorships, Assistant Professorships,\nLectureships and other teaching posts or to suspend or to abolish such posts;\n(1)   to create, suspend or abolish such administrative or other posts as may be\nnecessary;\n(m)   to prescribe the duties of officers, teachers and other employees of the\nInstitute;\n(n)   to report to the Senate on matters with respect to which it has been asked to\nreport;\n(o)   to appoint members to various Authorities in accordance with the provisions\nof this Act;\n(p)   to propose drafts of statutes for submission to the Senate;\n(q)   to regulate the conduct and discipline of the students of the Institute;\n(r)   to take actions necessary for the good administration of the Institute in general\nand to this end exercise such powers as are necessary;\n(s)   to delegate any of its powers to any Authority or officer or a committee; and\n(t)   to perform such other functions as have been assigned to it by the provisions\nof this Act or may be assigned to it by the Statutes."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Academic Council",
      "content": "(1) There shall be an Academic Council of the Institute\nconsisting of the following, namely:__\n(a)     the Vice-Chancellor who shall be its Chairperson;\n(b)     the Deans of Faculties and such heads of departments as may be prescribed;\n(c)     five eminent Professors including emeritus Professors from other leading\nuniversities and institutions;\n(d)     the Registrar;\n(e)     the Controller of Examinations; and\n(f)     the Librarian.\n(2)    The Senate shall appoint the members of the Academic Council, other than the ex\nofficio and the elected members, on the recommendation of the Vice-Chancellor. Appointment of\npersons proposed by the Representation Committee may be made by the Senate on the\nrecommendation of the Vice-Chancellor.\n(3)     Members of the Academic Council shall hold office for three years.\n(4)     The Academic Council shall meet at least three time a year.\n(5)    The quorum for meetings of the Academic Council shall be one-half of the total\nnumber of members, a fraction being counted as one."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Powers and Functions of the Academic Council",
      "content": "(1)The Academic Council shall\nbe the principal academic body of the Institute and shall, subject to the provisions of this Act and the\nstatutes, have the power to lay down proper standards of instruction, research and examinations and\nto regulate and promote the academic life of the Institute and the colleges.\n(2)     Without prejudice to the generality of the foregoing powers, and subject to the\nprovisions of this Act and the statutes, the Academic Council shall have the power to___\n(a)     approve the policies and procedures pertaining to the quality of academic\nprogrammes;\n(b)     approve academic programmes;\n(c)     approve the policies and procedures pertaining to student related functions\nincluding admissions, expulsions, punishments, examinations and\ncertification;\n(d)     approve the policies and procedures assuring quality of teaching and research;\n(e)     propose to the. Syndicate schemes for the constitution and organization of\nfaculties, teaching departments and boards of studies;\n(f)     appoint paper setters and examiners for all examinations of the Institute after\nreceiving panels of names from the relevant authorities;\n(g)     institute programmes for the continued professional development of Institute\nTeachers at all levels;\n(h)     recognize the examinations of other Universities or examining bodies as\nequivalent to the corresponding examinations of the Institute;\n(i)     regulate the award of studentships, scholarships, exhibitions, medals and\nprizes;\n(j)     frame Regulations for submission to the Senate;\n(k)     prepare an annual report on the academic performance of the Institute; and\n(l)     perform such functions as may be prescribed by regulations."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Representation Committees",
      "content": "(1) There shall be a Representation Committee\nconstituted by the Senate through statute for recommendation of persons for appointment to the\nSenate in accordance with the provisions of section 17.\n(2)     There shall also be a Representation Committee constituted by the Senate through\nStatute for the recommendation of persons for appointment to the Syndicate and the Academic\nCouncil in accordance with the provisions of sections 20 and 22.\n(3)    Members of the Representation Committee for appointment to the Senate shall consist\nof the following, namely:__\n(a)     Secretary, Planning and Development Division, who shall be its Chairperson\nin his ex officio capacity;\n(b)     three members of the Senate who are not Institute teachers;\n(c)     two persons nominated by the Institute Teachers from amongst themselves in\nthe manner prescribed;\n(d)     one eminent person from business, trade and industry as nominated by the\nChancellor; and\n(e)     one eminent economist to be nominated by the Chancellor.\n(4)      The Representation Committee for appointment to the Syndicate and the Academic\nCouncil shall consist of the following, namely:__\n(a)     the Vice-Chancellor, who shall be its Chairperson in his ex officio capacity;\n(b)     two members of the Senate who are not Institute Teachers; and\n(c)     three persons nominated by the Institute Teachers from amongst themselves in\nthe manner prescribed.\n(5)     The tenure of, other than ex officio Chairperson, the Representation Committee shall\nbe three years:\nProvided that no member shall serve for more than two consecutive terms.\n(6)     The procedures of the Representation Committees shall be as may be prescribed.\n(7)     There may also be such Other Representation Committees, headed by Secretary,\nPlanning and Development Division, set up by any of the other Authorities of the Institute as are\nconsidered appropriate for recommending persons for appointment to the various Authorities and\nother bodies of the Institute."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Appointment of Committees by certain Authorities",
      "content": "(l) The Senate, the\nSyndicate, the Academic Council and other Authorities may, from time to time, appoint such\nstanding, special or advisory committees, as they may deem fit, and may place on such committee\npersons who are not members of the Authorities appointing the Committees.\n(2)     The constitution, functions and powers of the Authorities for which no specific\nprovision has been made in this Act shall be such as may be prescribed by statutes or regulations.\nSTATUTES, REGULATIONS AND RULES"
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Statutes",
      "content": "(1) Subject to the provisions of this Act, Statutes, to be published in the\nofficial Gazette, may be made to regulate or prescribe all or any of the following matters, namely:__\n(a)    the contents of and the manner in which the annual report to be presented by\nthe Vice-Chancellor before the Senate shall be prepared;\n(b)    the Institute fees and other charges;\n(c)    the constitution of any pension, insurance, gratuity, provident fund and\nbenevolent fund for Institute employees;\n(d)    the scales of pay and other terms and conditions of service of officers, teachers\nand other Institute employees;\n(e)    the maintenance of the register of registered graduates;\n(f)    the establishment of Faculties, departments, research centres and other\nacademic divisions;\n(g)    the powers and duties of officers and teachers;\n(h)    conditions under which the Institute may enter into arrangements with other\ninstitutions or with public bodies for purposes of research and advisory\nservices;\n(i)    conditions for appointment of emeritus Professors and award of honorary\ndegrees;\n(j)    efficiency and discipline of Institute employees;\n(k)    the constitution and procedure to be followed by Representation Committees\nin carrying out functions in terms of this Act;\n(1)    the constitution and procedure to be followed by the Committee for\nappointment of the Vice-Chancellor;\n(m)    constitution, functions and powers of the Authorities of the Institute;\n(n)    academic and research audit of the Institute; and\n(o)    all other matters which by this Act are to be or may be prescribed or regulated\nby statutes.\n(2)     The draft of statutes shall be proposed by the Syndicate to the Senate which may\napprove or pass with such modifications as the Senate may think fit or may refer back to the\nSyndicate, as the case may be, for reconsideration of the proposed draft:\nProvided that statutes concerning any of the matters mentioned in clauses (a) and (1) of\nsubsection (1) shall be initiated and approved by the Senate after seeking the views of the Syndicate:\nProvided further that the Senate may initiate a Statute with respect to any matter in its power\nor with respect to which a Statute may be framed in terms of this Act and approve such Statute after\nseeking the views of the Syndicate."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Regulations",
      "content": "(1) Subject to the provisions of this Act and the statutes, the\nAcademic Council may make Regulations, to be published in the official, Gazette, for all or any of\nthe following matters, namely:__\n(a)    the courses of study for degrees, diplomas and certificates of the Institute;\n(b)    the manner in which the teaching referred to in subsection (1) of section 6\nshall be organized and conducted;\n(c)    the admission and expulsion of students to and from the Institute;\n(d)    the conditions under which students shall be admitted to the courses and the\nexaminations of the Institute and shall become eligible for the award of\ndegrees, diplomas and certificates;\n(e)    the conduct of examinations;\n(f)    conditions under which a person may carry on off campus research to entitle\nhim to a degree;\n(g)    the institution of fellowships scholarships, exhibitions, medals and prizes;\n(h)    the use of the Library;\n(i)    the formation of Faculties, departments and board of studies, and\n(j)    all other matters which by this Act or the Statutes are to be or may be\nprescribed by regulations.\n(2)   Regulations shall be proposed by the Academic Council and shall, be submitted to the\nSenate which may approve them or withhold approval or refer them back to the Academic Council\nfor reconsideration. A Regulation proposed by the Academic Council shall not be effective unless it\nreceives the approval of the Senate.\n(3)    Regulations regarding or incidental to matters contained in sub-clauses (g) and (i)\nshall not be submitted to the Senate without the prior approval of the Syndicate."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Amendment and repeal of statutes and regulations",
      "content": "The procedure for adding to,\namending or repealing the statutes and the regulations shall be the same as that prescribed\nrespectively for framing or making statutes and regulations."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Rules",
      "content": "(1) The Authorities and the other bodies of the Institute may make rules, to\nbe published in the official Gazette, consistent with this Act, statutes or the regulations, to regulate\nany matter relating to the affairs of the Institute which has not been provided for by this Act or that is\nnot required to be regulated by statutes or regulations, including rules to regulate the conduct of\nbusiness and the time and place of meetings and related matters.\n(2)     Rules shall become effective upon approval by the Syndicate."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Institute Fund",
      "content": "The Institute shall have a fund to which shall be credited its income\nfrom fees, charges, donations, trusts, bequests, endowments, contributions, Government grants and\nall other sources."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Audits and accounts",
      "content": "(1)The Accounts of the Institute shall be maintained in such\nform and in such manner as may be prescribed.\n(2)      The teaching department and all other bodies designated as such by the Syndicate in\nterms of statutes shall be independent cost centers of the Institute with authority vested in the head of\neach cost centre to sanction expenditure out of the budget allocated to it:\nProvided that re-appropriation from one head of expenditure to another may be made by the\nhead of a cost centre in accordance with and to the extent prescribed by the statutes.\n(3)     All funds generated by a teaching department, of the Institute through consultancy,\nresearch or other provision of service shall be made available without prejudice to the budgetary\nallocation otherwise made, after deduction of overheads. in the manner and to the extent prescribed\nby statute, to the teaching department, for its development. A part of the funds so generated may be\nshared with the Institute teachers or researchers in charge of the consultancy, research or service\nconcerned in the manner and to the extent prescribed by Statute.\n(4)     No expenditure shall be made from the funds of the Institute, unless a bill for its\npayments has been issued by the head of the cost centre concerned in accordance with the relevant\nstatutes and the Treasurer has verified that the payment is provided for in the approved budget of the\ncost centre, subject to the authority to re-appropriate available to the head of the cost centre.\n(5)     Provision shall be made for an internal audit of the finances of the Institute.\n(6)    Without prejudice to the requirement of audit by an auditor appointed by Government\nin accordance with the provisions of any other law in force, the annual audited statement of accounts\nof the Institute shall be prepared in conformity with the generally accepted accounting principles by\na reputed firm of chartered accountants, selected through a transparent and merit based process and\napproved by the Senate and signed by the Treasurer. The annual audited statement of accounts so\nprepared shall be submitted to the Auditor-General of Pakistan for his observations.\n(7)    The observations of the Auditor-General of Pakistan, if any, together with such\nannotations as the Treasurer may make, shall be considered by the Syndicate and shall be placed\nbefore the Senate within six months of closing of the financial year."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Opportunity to show cause",
      "content": "Except as otherwise provided by law no officer,\nteacher or other employee of the Institute holding a permanent post shall be reduced in rank, or\nremoved or compulsorily retired from service for cause arising out of any act or omission on the part\nof the person concerned unless he has been given a reasonable opportunity of showing cause against\nthe action proposed to be taken."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Appeal to the Syndicate and the Senate",
      "content": "Where an order is passed punishing any\nofficer other than the Vice-Chancellor, teacher or other employee of the Institute or altering or\ninterpreting to his disadvantage the prescribed terms or conditions of his service, he shall, where the\norder is passed by any officer or teacher of the Institute other than the Vice-Chancellor, have the\nright to appeal to the Syndicate against the order and where the order is passed by the Vice-\nChancellor, have the right to appeal to the Senate."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Service of the Institute",
      "content": "(1) All persons employed by the Institute in accordance\nwith the terms and conditions of service prescribed by statutes shall be persons in the service of\nPakistan for the purposes of any court or of tribunal set up by law in terms of Article 212 of the\nConstitution of the Islamic Republic of Pakistan:\nProvided that any provision as regards the terms and conditions of employment of persons in\nthe service of Pakistan in general or in comparable employment notwithstanding the service of\nperson employed by the Institute shall be entirely governed by the terms and conditions prescribed\nby the relevant Statutes.\n(2)     An officer, teacher or other employee of the Institute shall retire from service on the\nattainment of sixty years age or tenure of service as may be prescribed.\n(3)     No adverse change shall be made in the terms and conditions of employment of any\nInstitute teacher or staff member in the employment of the Institute on the date of enforcement of\nthis Act."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Benefits and insurance",
      "content": "(1) The Institute shall constitute for the benefit of its\nofficers, teachers and other employees schemes, as may be prescribed, for the provision of post-\nemployment benefits as well as health and life insurance while in service.\n(2)    Where any provident fund has been constituted under this Act, the provisions of the\nProvident Funds Act, 1925, shall apply to such funds as if it were the Government Provident Fund."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Commencement of term of office of members of Authority",
      "content": "(1) When a member\nof a newly constituted Authority is elected, appointed or nominated, his term of office, as fixed under\nthis Act, shall commence from such date as may be prescribed.\n(2)     Where a member who has accepted any other assignment or for any other similar\nreason remains absent from the Institute for a period of not less than six months he shall be deemed\nto have resigned and vacated his seat."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Filling of casual vacancies in Authorities",
      "content": "Any casual vacancy among the\nmembers of any Authority shall be filled as soon as conveniently may be, in the same manner and by\nthe same person or authority that had appointed the member whose place has become vacant and the\nperson appointed to the vacancy shall be a member of such Authority for the residue of the term for\nwhich the person whose place he fills would have been a member."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Flaws in the constitution of Authorities",
      "content": "Where there is a flaw in the constitution\nof an Authority, as constituted by this Act, the statutes or the regulations on account of the abolition\nof a specified office under the Federal Government or because an organization, institution or other\nbody outside the Institute has been dissolved or has ceased to function, or because of some other\nsimilar reason, such flaw shall be removed in such manner as the Senate may direct."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Proceedings of authorities not invalidated by the vacancies",
      "content": "No act, resolution or\ndecision of any Authority shall be invalid by reason of any vacancy on the Authority doing, passing,\nor making it or by reason of any want of qualification or invalidity in the election, appointment or\nnomination of any de facto member of the Authority, whether present or absent."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Transitory provisions",
      "content": "(1) Notwithstanding anything contained in the Act, upon the\ncoming into force of this Act with respect to an Institute, the Senate shall be restructured and the\nmembers thereof, except the Institute teachers, appointed afresh by the Chancellor in accordance\nwith the numbers and criteria for membership specified in the Act. As regards the Institute teachers\nto be elected or appointed to the restructured Senate elections shall be held as soon as possible in the\ncase of Institutes where the repealed Resolution or any other law or other legislative instrument had\nprovided for the election of Institute teachers to the Senate, in all other cases Institute teachers shall\nbe appointed to the restructured Senate by the Chancellor. The number of Institute teachers to be\nelected or appointed to the restructured Senate shall be as provided in this Act. The first restructured\nSenate so constituted shall initiate, as soon as possible, the process for the appointment of the\nmembers of the Syndicate and the Academic Council in accordance with the terms of this Act. The\nterm of tenure provided in subsection (4) of section 17 notwithstanding one-third of the members,\nother than ex officio members, of the first restructured Senate, to be determined by lot, shall retire\nfrom office on the expiration of two years from the date of appointment by the Chancellor.\n(2)     Any existing provision as regards tenure notwithstanding the Vice-Chancellor and the\nother Authorities, in existence immediately before the date on which the Act is enforced with respect\nto an Institute listed in the Schedule, shall continue to function and shall, as far as may be, exercise\nthe powers respectively assigned to the Vice-Chancellor and corresponding Authorities by or under\nany law, until such time as they are respectively replaced in accordance with the terms of this Act.\n(3)     Notwithstanding anything contained in the Act, as regards an Institute set up after its\ncommencement, the members of the first Senate, except the Institute Teachers, shall be appointed by\nfirst Senate so constituted shall initiate, as soon as possible, the process for the recruitment of\nInstitute teachers and appointment of the members of the Syndicate and the Academic Council in\naccordance with the terms of this Act. The Institute teachers to be appointed to the first Senate shall\nbe appointed as soon as the procedure prescribed for appointment of Institute teachers to the Senate\nhas been complied with. The terms of tenure provided in sub-section (4) of section 17,\nnotwithstanding, one-third of the members, other than ex officio members, of the first Senate to be\ndetermined by lot, shall retire from office on the expiration of two years from the date of\nappointment by the Chancellor.\n(4)      The current staff of the Institute including the Vice-Chancellor shall continue to\nfunction for the remaining period of their tenure or service as applicable in the statutes."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Indemnity",
      "content": "No suit or legal proceedings shall lie, against the Federal Government,\nthe Institute or any Authority, officer or employee of the Government or the Institute or any person\nin respect of any thing which is done in good faith under this Act."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Power to allow appointment of employees of the Government, other universities",
      "content": "or educational or research institutions to the Institute.__ (1) Notwithstanding anything contained\nin this Act the Senate may, on the advice of the Syndicate, allow any post in the Institute to be filled\nby appointment, on such terms as the Senate may specify, an employee of the Government or any\nother Institute or educational or research institution.\n(2)     Where any appointment has been made under this section, the terms and conditions of\nservice of the appointee shall not be less favorable than those admissible to him immediately before\nsuch appointment and he shall be entitled to all benefits of his post of service."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Removal of difficulties",
      "content": "(1) If any question arises as to the interpretation of any of\nfinal.\n(2)     If any difficulty arises in giving effect to effect of the provisions of, this Act, the\nChancellor may make such order after obtaining the views of the Senate, no inconsistent with the\nprovisions of this Act, as may appear to him to be necessary for removing the difficulty.\n(3)    Where this Act makes any provision for anything to be done but no provision or no\nsufficient provision has been made as respects the authority by whom, or the time at which, or the\nmanner in which, it shall be done, then it shall be done by such authority, at such time, or in such\nmanner as the Chancellor may direct after obtaining the views of the Senate."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Repeal and Savings",
      "content": "(1) The Planning and Development Division's Resolution\nNo.15(3)Ad.II/PD/80, dated the 12th December, 1981, is hereby repealed.\n(2)     Notwithstanding the repeal envisaged by sub-section (1),__\n(a)     everything done, action taken, obligations or liabilities incurred, rights and\nassets acquired, persons appointed or authorized, jurisdiction or powers\nconferred, endowments, bequests, funds or trusts created, donations or grants\nmade, scholarships, studentship, or exhibitions instituted, affiliations or\nprivileges granted and orders issued under any of the provisions of the\nrepealed Resolution, or the Statutes, the regulations and the rules made or\ndeemed to have been made there under, shall, if not inconsistent with the\nprovisions of this Act or the Statutes, the regulations or the rules made under\nthis Act, be continued and, so far as may be, be deemed to have been\nrespectively done, taken, incurred, acquired, appointed, authorized, conferred,\ncreated, made, instituted, granted and issued under this Act, and any\ndocuments referring to any of the provisions of the repealed Resolution, or the\nStatutes, the regulations and the rules first referred shall , so far, as may be, be\nconsidered to refer to the corresponding provisions of this Act or the Statutes,\nthe regulations and the rules made under this Act; and\n(b)    any statutes, regulations, or rules made or deemed to have been made under\nthe repealed Resolution shall, if not inconsistent with the provisions of this\nAct, be deemed to be statutes, regulations or rules made under this Act having\nregard to the various matters which by this Act have to be regulated or\nprescribed by statutes, regulations and rules respectively and shall continue to\nbe in force until they are repealed, rescinded or modified in accordance with"
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Validation of action, etc",
      "content": "Anything done, actions taken, orders passed, instruments\nmade, notifications issued, agreements made, proceedings initiated, processes or communication\nissued, powers conferred, assumed or exercised, by the Institute or its officers on or after the 8th\nNovember, 2006 and before the commencement of this Act, shall be deemed to have been validly\ndone, made, issued, taken, initiated, conferred, assumed, and exercised and the provisions of this Act\nshall have, and shall be deemed always to have had effect accordingly.\nUploaded on 15.2.2024"
    }
  ],
  "definitions": [
    {
      "term": "Academic Council",
      "definition": "the Academic Council of the Institute established under section 22;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "any of the Authorities of the Institute specified in section 16;",
      "source_provision": "sec2"
    },
    {
      "term": "Chancellor",
      "definition": "the Chancellor of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the Higher Education Commission established under the Higher Education Commission Ordinance, 2002 (LIII of 2002);",
      "source_provision": "sec2"
    },
    {
      "term": "Committee",
      "definition": "the committees of the Institute constituted under sections 24 and 25;",
      "source_provision": "sec2"
    },
    {
      "term": "Dean",
      "definition": "the head of a Faculty or the head of an academic body granted the status of a Faculty by this Act or by the Statutes or Regulations;",
      "source_provision": "sec2"
    },
    {
      "term": "department",
      "definition": "a teaching department maintained and administered or recognized by the Institute in the manner prescribed;",
      "source_provision": "sec2"
    },
    {
      "term": "Director",
      "definition": "the head of Research Centre;",
      "source_provision": "sec2"
    },
    {
      "term": "Faculty",
      "definition": "an administrative and academic unit of the Institute consisting of one or more departments, as prescribed;",
      "source_provision": "sec2"
    },
    {
      "term": "Institute",
      "definition": "the Pakistan Institute of Development Economics reconstituted under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Institute Teacher",
      "definition": "Professor, Assistant Professor and Lecturer engaged on whole time basis by the Institute for teaching; (1) “Patron” means the Patron of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by Statutes, Regulations or Rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Registrar",
      "definition": "the Registrar of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Representation Committees",
      "definition": "the Representation Committees constituted under section 24;",
      "source_provision": "sec2"
    },
    {
      "term": "Review Panel",
      "definition": "the Review Panel set up by the Chancellor in accordance with the provisions of section 9;",
      "source_provision": "sec2"
    },
    {
      "term": "Senate",
      "definition": "the Senate of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Syndicate",
      "definition": "the Syndicate of the Institute; and",
      "source_provision": "sec2"
    }
  ]
}
