{
  "id": "pk-pakistan-institute-of-engineering-and-applied-science-ordinance-2000",
  "type": "statute",
  "title": "Pakistan Institute of Engineering and Applied Science Ordinance, 2000",
  "title_en": "Pakistan Institute of Engineering and Applied Science Ordinance, 2000",
  "short_name": "PIOEA",
  "status": "in_force",
  "issued_date": "2000-03-21",
  "in_force_date": "2000-03-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaYYw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Institute of Engineering and Applied Science Ordinance, 2000 (X of 2000) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Power to make rules",
      "content": "ORDINANCE, 2000\nORDINANCE No. X of 2000\n[22nd March, 2000]\nAn Ordinance to confer on the Pakistan Institute of Engineering and Applied Sciences, Islamabad,\nthe power to award degrees\nWHEREAS it is expedient to confer on the Pakistan Institute of Engineering and Applied\nSciences, Islamabad, the power to award degrees and to provide for matters connected there with or\nancillary thereto;\nAND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the\nProclamation of Emergency of the Fourteenth day of October, 1999, and the Provisional Constitution\nOrder No. 1 as amended;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of Proclamation of the fourteenth day of October, 1999,\nand Provisional Constitution Order No. 1 of 1999, as amended, as well as Order No. 9 of 1999, and in\nexercise of all powers enabling him in that behalf, the President of the Islamic Republic of Pakistan is\npleased to make and promulgate the following Ordinance:―"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "_ (1) This Ordinance may be called the Pakistan Institute\nof Engineering and Applied Sciences Ordinance, 2000.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definition",
      "content": "_ In this Ordinance, unless there is anything repugnant in the subject or\ncontext,—\n(a)     “Board” means the Board of Governors of the Institute constituted under section\n9;\n(b)     “Chairman” means the Chairman of the Board;\n(c)     “Chancellor” means the Chancellor of the Institute;\n(d)     “Commission” means the Pakistan Atomic Energy Commission established\nunder the Pakistan Atomic Energy Commission Ordinance, 1965; (XVII of\n1965)\n(e)     “Institute” means the Pakistan Institute of Engineering and Applied Sciences\nnotified as such vide Pakistan Atomic Energy Commission's Circular No.\n19(116)/97-l, dated the 5th December, 1997;\n(f)     “prescribed” means prescribed by Rules;\n(g)     “Pro-Rector” means the Pro-Rector of the Institute appointed under section 8;\n(h)     “Rector” means the Rector of the Institute appointed under section 7; and\n(i)     “Rules” means the Rules made under this Ordinance."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Institute",
      "content": "_ The Pakistan Institute of Engineering and Applied\nSciences, Islamabad, as reconstituted in accordance with the provisions of this Ordinance shall be a\nbody corporate having perpetual succession and a common seal with power to acquire, hold and\ndispose off property, both movable and immovable and shall by the said name sue and be sued."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers of the Institute",
      "content": "_ The Institute shall have powers―\n(a)     to provide for instruction and training in engineering and applied sciences\nincluding medicine and any other discipline;\n(b)     to prescribe courses of study for all the educational and training programmes\noffered at the Institute, and approve courses of study offered by its affiliates;\n(c)     to decide teaching methods and strategies in order to ensure the most effective\neducational and training programmes;\n(d)     to specify selection criteria, admit and examine students, hold examinations and\nconfer or award degrees, diplomas, certificates, academic and research prizes\nand distinctions on and to persons who fulfil the requirements or have passed\nits examinations in accordance with such conditions as may be prescribed by\nrules;\n(e)     to provide for the teaching of specified courses and training for persons not\nbeing the students of the Institute and grant certificates and diplomas to such\npersons, pursue and make provisions for research, innovations, inventions,\ndemonstrations and other services as it may deem fit;\n(f)     to ensure technical excellence and promote humanitarian values among its\nstudents;\n(g)     to establish and maintain campuses for the effective discharge of its functions\nand responsibilities anywhere in Pakistan;\n(h)     to undertake joint investigation and collaborative research in the field of\nengineering, applied sciences and other allied disciplines;\n(i)     to provide assistance to industry, Government institutions and organisations in\nthe country and abroad through expert advice, consultation or in any other\nmanner as it may deem fit;\n(j)     to promote contact, establish liaison and enter into agreements, contracts and\narrangements with national and international universities, institutions and other\nresearch and development organisations within the country and abroad for\neffective discharge of its functions and responsibilities;\n(k)     to affiliate or associate itself with other institutions in Pakistan or abroad and\nallow affiliation to other institutions with itself;\n(l)     to print, publish and circulate periodicals, journals, magazines, monographs,\nbooks, and disseminate scientific, technological and other related knowledge\nand information conducive to the attainment of any of the objectives of the\nInstitute;\n(m)     to award fellowships, scholarships, stipends, bursaries, medals and prizes;\n(n)     to confer, in the prescribed manner, honorary degrees;\n(o)     to confer, in the prescribed manner, the status of 'professor emeritus' on\ndistinguished scholars and determine appropriate remuneration for them;\n(p)     to establish Chairs in various disciplines within the Institute that may be funded\nthrough its own resources or by individuals or organisations from within the\ncountry or abroad;\n(q)     to supervise and control the discipline of the students of the Institute;\n(r)     to promote extra-curricular and recreational activities of its students, and to\nmake arrangements for promoting their health and general welfare;\n(s)     to perform internal security functions within its premises;\n(t)     to charge and receive such fees and other payments as it may determine;\n(u)     to accept and receive donations, contributions, subscriptions, aid and grants\nmade by individuals and organisations, both national and foreign;\n(v)     to use its financial and other resources to the fullest extent for the execution of\nits programmes; and\n(w)     to do all such acts and things as may be required to improve its objectives and\nperform its functions."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Officers of the Institute:___ The following shall be the officers of the Institute, namely",
      "content": "(i)     the Chancellor;\n(ii)    the Rector;\n(iii)   the Pro-Rector; and\n(iv)    such other officers as may be appointed by the Board."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Chancellor",
      "content": "_ (1) The President of the Islamic Republic of Pakistan shall be the Chancellor\nof the institute.\n(2) The Chancellor shall preside over the convocations of the Institute and, in his absence, the\nChairman shall preside.\n(3) Every proposal to confer an honorary degree shall be subject to confirmation by the\nChancellor."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Rector",
      "content": "_ (1) The Chancellor shall, on the recommendation of the Chairman, appoint an\neducationist of distinction as Rector for such period and on such terms and conditions as he may\ndetermine.\n(2) The Rector shall be the executive and academic head of the Institute and shall exercise\ngeneral control and supervision over its affairs.\n(3) The Rector shall be the executive and academic head of the Institute and shall exercise\ngeneral control and supervision over its affairs."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Pro",
      "content": "Rector:___ (1) The Pro-Rector shall be appointed by the Board, and shall act as the\nSecretary of the Board.\n(2) In the absence of the Rector he shall act as Rector.\n(3) The Pro-Rector shall assist the Rector in particular, on matters relating to teaching, research,\nacademic programme and development projects."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Board of Governors",
      "content": "_ (1) The overall control of the Institute shall vest in the Board of\nGovernors subject to such conditions and restrictions as the Commission may deem fit.\n(2) The Board shall consist of the following ex-officio members, namely:—\n(i)      Chairman, Pakistan Atomic Energy Commission, who shall also be the\nChairman of the Board;\n(ii)     all full-time members of the Pakistan Atomic Energy Commission;\n(iii)    Secretary, Ministry of Education;\n(iv)     Secretary, Ministry of Science and Technology;\n(v)      Chairman, University Grants Commission, or his nominee of the rank of a full\ntime member;\n(vi)     Vice-Chancellor, Quaid-i-Azam University;\n(vii)    Rector, National University of Science and Technology;\n(viii)   Chairman, Pakistan Engineering Council;\n(ix)    Chairman, Pakistan Medical and Dental Council; and\n(x)    Rector.\n(3) The following shall be nominated members of the Board, namely:—\n(a)     two eminent engineers;\n(b)     two prominent scientists;\n(c)     two distinguished persons known for their learning and experience in the field\nof management, industry or related fields of interest; and\n(d)     two faculty members of the Institute.\n(4) A nominated member of the Board shall be nominated by the Chairman in consultation with\nthe Rector.\n(5) A nominated member of the Board shall, unless the Chairman, with the approval of the\nCommission, terminates his membership earlier, hold office for a term of three years and shall be\neligible for renomination on the expiry of his term.\n(6) The office of a nominated member of the Board shall become vacant if he resigns or fails\nto attend three consecutive meetings of the Board without sufficient cause or leave of absence.\n(7) A casual vacancy in the office of a nominated member of the Board shall be filled by a\nperson nominated by the Chairman with approval of the Commission.\n(8) No act or proceedings of the Board shall be invalid by reason only of the existence of a\nvacancy in, or any defect in the constitution of, the Board."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Powers and functions of the Board",
      "content": "_ The Board shall exercise and perform the following\npowers and functions, namely:—\n(a)     to recommend all such activities as may be required for the furtherance of the\nobjectives;\n(b)     to approve the creation of new components of the Institute such as school,\ndepartment, faculty, division, centre or any other teaching or research unit with\nthe approval of the Commission;\n(c)     to undertake responsibility for the financial integrity of the Institute, for\nensuring effectiveness of its future operations;\n(d)     to formulate or approve long-term strategies, policies and plans governing the\nactivities and operation of the Institute so as to ensure its autonomy in teaching,\nresearch and other academic work;\n(e)     to approve the annual budget of the Institute;\n(f)     to call for annual, bi-annual or quarterly progress reports relating to the activities\nof the Institute and execution of the approved work plans to review the progress\nand direct the Rector to furnish information relating to any matter;\n(g)     to recommend to the Commission the creation of such administrative and\nacademic posts on specified terms and conditions as may be deemed necessary\nfor the performance of its function and to approve appointment to such posts on\nthe recommendations of a duly constituted Selection Committee;\n(h)     to approve all affiliations and other arrangements through which universities\nand other research and development organizations may become associated with\nthe Institute;\n(i)     to authorise when required, the mobility of qualified staff among universities,\nresearch organisations and other bodies, provided that the rights and privileges\nof the staff under this arrangement shall be protected;\n(j)     to perform such other functions and exercise such other powers as may be\nspecified by the Commission."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Meetings of the Boards",
      "content": "_ (1) The Board shall meet at least twice in a year on dates to be\nfixed by the Chairman:\nProvided that a special meeting may be called at any time at the request of not less than five\nmembers of the Board to consider any matter of an urgent nature.\n(2) The Chairman shall, preside over the meeting of the Board and in his absence, a member\nnominated by him shall preside.\n(3) The quorum for a meeting of the Board shall be one half of its members, a fraction being\ncounted as one, and out of which not less than four shall be the nominated members.\n(4) The decision of the Board shall be expressed in terms of the views of the majority of the\nmembers present and voting and, if the members are equally divided, the Presiding Officer of the Board\nshall have and exercise a casting vote."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Delegation of Powers",
      "content": "_The Board may, by general or special order in writing, direct that\nsuch of its powers shall, in such circumstances and under such conditions, if any, as may be specified\nin the order, be exercisable by members of the Board or officers of the Institute as it may specify."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Committees:___ (1) The Board may constitute the following committees, namely",
      "content": "(i) the Executive Committee;\n(ii)    the Academic Committee;\n(iii)   the Finance Committee; and\n(iv)    any other committee that may be needed\n(2) The constitution, function and powers of the committees shall be such as may be prescribed.\n(3) The decision of the Committees shall be subject to the approval of the Board."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Academic and Administrative employees",
      "content": "_(1) The regular technical, academic and\nadministrative employees of the Commission may be transferred to work at the Institute as may be\nprescribed by rules and such employees shall be governed by the service regulations of the\nCommission.\n(2) The Board may authorise grant of additional remuneration and privileges to the employees\nworking at the Institute as it may deem fit.\n(3) The Institute may continue to exercise such powers of recruitment, appointments and\npromotion as may be prescribed by the Commission from time to time.\n(4) The Board may make appointment on contract basis on such terms and conditions as may\nbe prescribed by rules."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Fund of the Institute:___ The Institute shall have a fund to which shall be credited",
      "content": "(i)     all grants and contributions made by the Commission;\n(ii)    donations, subscriptions, aid and grants made by the donors;\n(iii)   aid, grants and other forms of assistance by the Federal Government, Provincial\nGovernments and local bodies, national and international institutions,\norganisations and agencies; and\n(iv)    fees, remuneration, charges for any service rendered, sale proceeds, royalties on\npublications, commission and receipts from any other source."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Audit and accounts",
      "content": "_ (I) The accounts of the Institute shall be maintained in such form\nand manner as the Federal Government in consultation with the Auditor General of Pakistan,\ndetermine.\n(2) The accounts of the Institute shall be audited by an Auditor who is a Chartered Accountant\nwithin the meaning of the Chartered Accountants Ordinance, 1961, (X of 1961) and is appointed by\nthe Federal Government in consultation with Auditor General of Pakistan on such remuneration, to be\npaid by the Institute, as the Federal Government may fix."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Declaration of fidelity and secrecy",
      "content": "_ Every member of the Board, officer or other\nemployee of the Institute shall make such declaration of fidelity and secrecy as may be prescribed by\nrules."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Institute open to all classes, creeds etc",
      "content": "_The Institute shall be open to all persons of\neither sex of whatever religion, race, colour or domicile who are academically qualified for admission\nto the courses of study offered by the Institute based on the criteria and policy determined by the Board\nand no person shall be denied the privileges of the Institute on the ground only of sex, religion, race,\nclass, colour or domicile."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Discoveries and inventions to vest in the Institute",
      "content": "_ All rights relating to discoveries\nand inventions and any improvements in materials, methods, processes, apparatus or equipment made\nby any officer or employee of the Institute in the course of his employment shall vest in the Institute."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Budget",
      "content": "_ (1) The Institute shall, in each year, submit to the Board for approval a budget\nby such date and in the form as may be prescribed by rules, for each financial year, showing the\nestimated receipts and expenditure and the sums which are likely to be required from the Federal\nGovernment during the financial year.\n(2) The Institute may open accounts in any scheduled bank in Pakistan."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Indemnity",
      "content": "_ No suit, prosecution or other legal proceeding shall lie against the Institute,\nCommission or any officer of the Institute for anything which is done or intended to be done in good\nfaith under this Ordinance."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Transfer of assets and liabilities etc.:___ Upon the commencement of this Ordinance,",
      "content": "(a)     everything done, action taken, obligations and liabilities incurred, persons\nappointed or authorised, fellowships or scholarships instituted and orders issued\nprior to such commencement shall be continued and, so far as may be, be\ndeemed to have been respectively done, taken, incurred, appointed or\nauthorised, instituted or issued by the Institute;\n(b)     all monies and properties held by the Institute immediately before such\ncommencement shall stand transferred to, and vest in, the Institute; and\n(c)     all laws, rules, regulations and bye-laws applicable to the Institute shall, in so\nfar as they are not inconsistent with the provisions of this Ordinance, continue\nto be in force until they are repealed, rescinded or modified under this\nOrdinance."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Removal of difficulties, etc",
      "content": "_If any difficulty arises in giving effect to any of the\nprovisions of this Ordinance, the Commission may make such order, not inconsistent with the\nprovisions of this Ordinance, as may appear to be necessary for removing such difficulty."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Board of Governors of the Institute constituted under section 9;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "Chancellor",
      "definition": "the Chancellor of the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the Pakistan Atomic Energy Commission established under the Pakistan Atomic Energy Commission Ordinance, 1965; (XVII of 1965)",
      "source_provision": "sec2"
    },
    {
      "term": "Institute",
      "definition": "the Pakistan Institute of Engineering and Applied Sciences notified as such vide Pakistan Atomic Energy Commission's Circular No. 19(116)/97-l, dated the 5th December, 1997;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by Rules;",
      "source_provision": "sec2"
    },
    {
      "term": "Pro-Rector",
      "definition": "the Pro-Rector of the Institute appointed under section 8;",
      "source_provision": "sec2"
    },
    {
      "term": "Rector",
      "definition": "the Rector of the Institute appointed under section 7; and",
      "source_provision": "sec2"
    },
    {
      "term": "Rules",
      "definition": "the Rules made under this Ordinance.",
      "source_provision": "sec2"
    }
  ]
}
