{
  "id": "pk-pakistan-international-airlines-corporation-pia-conversion-act-2016",
  "type": "statute",
  "title": "Pakistan International Airlines Corporation - PIA (Conversion) Act, 2016",
  "title_en": "Pakistan International Airlines Corporation - PIA (Conversion) Act, 2016",
  "short_name": "PIACP",
  "status": "in_force",
  "issued_date": "2016-04-18",
  "in_force_date": "2016-04-18",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2JwZpk%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan International Airlines Corporation - PIA (Conversion) Act, 2016 (XV of 2016) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Pakistan\nInternational Airlines Corporation (Conversion) Act, 2016.\n(2)    It extends to the whole of Pakistan\n(3)    It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,―\n(a)     “arrangement” means an arrangement in writing between the Company and\nany relevant entity setting forth the terms, conditions and manner of transfer\nof one or more assets of the Company to a relevant entity along with the\nconsideration for the same, which transfer is subject to be provisions of\nsection 4;\n(b)     “assets” includes all properties, rights and entitlements of every description\nand nature whatsoever, whether present or future, actual or contingent, and\ntangible or intangible, in Pakistan or elsewhere and includes but not limited\nto property held on trust, both movable and immovable, benefits, claims,\nreceivables, cash balances, documents, investments, privileges and powers;\n(c)     “Company” means Pakistan International Airlines Corporation Limited\nincorporated under the Companies Ordinance;\n(d)     “Companies Ordinance” means the Companies Ordinance, 1984 (XLVII of\n1984);\n(e)     “Company request” means a written request made by the Company to the\nFederal Government to issue an order pursuant to section 4 to effect transfer\nto a relevant entity of specified assets in terms of the relevant arrangement,\nprovided nevertheless, such request may only be made once the Company has\nto that extent complied with the provisions of sub-section (3) of section 196\nof the Companies Ordinance and the applicable code of corporate\ngovernance;\n(f)        “conversion” with all its cognate expressions means, in accordance with the\nprovisions of this Act, the conversion of the Corporation into a Company;\n(g)        “commencing date” means the date of promulgation of this Act;\n(h)        “Corporation” means the Pakistan International Airlines Corporation\nestablished under the Pakistan International Airlines Corporation Act. 1956\n(XIX of 1956);\n(i)        “liabilities” includes all borrowings, duties, obligations, loans encumbrances\nof every description and nature whatsoever in Pakistan or elsewhere, whether\npresent or future, actual or contingent, and disclosed or undisclosed;\n(j)        “order” means any order issued by the Federal Government pursuant to sub-\nsection (1) of section 4 and notified in the official Gazette and the expression\n“orders” shall be construed accordingly;\n(k)        “PIAC Act” means the Pakistan International Airlines Corporation Act, 1956\n(XIX of 1956);\n(l)        “proceedings” includes any suit, arbitration or other legal or administrative\nproceedings applications, appeals, awards, reviews or revisions filed or\npending;\n(m)        “relevant entity” means any body corporate or company owned or controlled\nby the Federal Government or the Federal Government itself;\n(n)        “specified assets” means the assets specified in the relevant arrangements;\n(o)        “undertakings” include all projects, ventures and operations undertaken by\nthe Corporation, individually or collectively, in collaboration with some other\nperson; and\n1\n[(p)   “validity period” means the period starting on the commencing\ndate and ending on the 30th day of June, 2025 or on such date as the\nFederal Government may, by notification in the official Gazette, appoint;]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Conversion of Corporation into a Company.⸻ (1) The Corporation shall be deemed",
      "content": "to have been converted into a public company limited by shares with effect from the commencing\ndate.\n(2) As and from the commending date,⸻\n(a)        the Company shall be deemed to hold and own all assets and liabilities of the\nCorporation without any conveyance, alienation or assignment and without\nany further act, deed or registration and without discharging or invalidating\nany contract; and\n1\nSubs. by Act No. LVII of 2023, s. 2.\n(b)     without prejudice to the generality of the foregoing clause, the Company\nshall,⸻\n(i)     be entitled to the benefit of all notifications, licenses, permissions,\nsanctions, authorizations, concessions, decrees, air service\nagreements, orders and benefits whatsoever issued or granted in\nfavour of the Corporation as on the commencing date, including but\nnot limited to the permission connected with the listing of the\nsecurities of the Corporation on the relevant stock exchanges; and\n(ii)    be deemed to have taken over and shall be entitled to enforce, all\nrights, licenses, grants and concessions and to have assumed all\nliabilities of the Corporation and shall be liable to pay and discharge\nall liabilities of every description and nature whatsoever of the\nCorporation.\n(3) The shareholders of the Company shall be deemed without any fresh issuance of shares\nto own and hold the same number of fully paid shares with such rights and privileges (including as\nto class, kind and face value) as they owned and held in the Corporation on the commencing date;\nand the authorized capital of the Company shall be deemed to be equivalent to the authorized capital\nof the Corporation as on the commencing date and no fee or charges shall be payable in this regard.\n(4) All proceedings of every description and nature whatsoever by or against or relating to\nthe Corporation pending on the commencing date in any court, tribunal, or other authority shall be\ncontinued, defended, prosecuted and enforced by or against or relating to the Company in the same\nmanner and to the same extent as they would have been continued, defended, prosecuted and\nenforced by or against or relating to the Corporation, and the same shall not abate, be discontinued,\nprejudiced or otherwise affected by the provisions of this Act.\n(5) The Company shall be deemed to be the successor-in-interest of the Corporation, and\nthe name of the Company shall be deemed to have been substituted for the name of the Corporation\nin all contract, agreements, licenses, orders, certificates, powers of attorney, consents,\nundertakings, leases, grants, concessions, records of Central Depository Company of\nPakistan Limited and all other instruments or documents of every description and nature\nwhatsoever relating to the Corporation and no objection shall be entertained by any court,\ntribunal or authority in regard to such substitution or on the ground that any such contract, agreement\nor document as aforesaid was, or is, I, or with, the name of the Corporation and not the Company.\n(6) All employees of the Corporation shall be deemed to be employees of the\nCompany on the same remuneration and other conditions of service, rights and privileges including\nbut not limited to the provisions as to their pension, provident fund and gratuity, as the case\nmay be, and other matters as were applicable to them before the conversion, including all\nexisting retirement benefits of the employees whether funded or non-funded:\nProvided that ⸻\n(i)     Notwithstanding anything contained in this Act or any other law, or any\ndecision of any court or tribunal, the employees of the Company shall\ncontinue to be governed by non-statutory contractual terms, conditions,\nrules and regulations which shall not acquire, or be deemed to have\nacquired or be treated as having acquired, statutory status;\n(ii)       no person deemed to be employed by the Company under this section\nshall be entitled to any compensation or benefit as a consequence of the\nconversion of the Corporation into a Company;\n(iii)      The salaries, emoluments and all other terms of service of employees, whether\npermanent or contractual, shall not be changed to their disadvantage;\nand\n(iv)        Pensions and other existing obligations of the Corporation        to retired\nemployees shall not be changed to their disadvantage.\n(7) Notwithstanding the provisions of section 146 of the Companies Ordinance, the Company\nshall, upon conversion, continue all business and undertakings of the Corporation as were\nbeing carried on immediately prior to the commencing date."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to pass orders for the transfer of assets.⸻ (1) During the validity period and",
      "content": "subject to a prior Company request, the Federal Government may issue orders providing for the\ntransfer of specified assets to a relevant entity substantially on the terms set forth in the relevant\narrangement.\n(2) The orders shall binding on the Company, the relevant entity and any other person having\nany right, claim or liability in relation to the Company or any relevant entity.\n(3) As and from the date specified in the order, the specified assets shall, by virtue and\nto the extent provided in the relevant order, stand transferred to, and vest in, the relevant entity,\nwithout any conveyance, alienation or assignment and without any further act, deed or registration\nand without discharging or invalidating any contract, and be subject to the terms of the relevant\norder in all cases.\n1\n[(4) Representation on the Board of Directors and all other rights and privileges of\nshareholders of the company, or any of its subsidiary companies, shall be proportionate to\nshareholding]\n1\n[*     *          *          *        *   *       *]\n(5) The Federal Government shall carry out or cause to be carried out valuation of the assets\nof the Company, and its subsidiary companies carrying on air-transport business, by a recognized\nvaluator before transferring any shares of these companies to a third party.\n1\n[(6) Notwithstanding anything contained in the Public Procurement Regulatory Authority\nOrdinance, 2002 (XXII of 2002) and the rules and regulations made thereunder, the\nprocurement rent and lease of aircraft and parts thereof and such other items as the Federal\nGovernment may from time to time specify through a notification in the official Gazette by the\nCompany shall be made through one or more committees in the manner prescribed by the rules.]\n1\nSubs. and omitted by Act No. LVII of 2023, s. 3."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Guarantees to remain in force.⸻ Notwithstanding the repeal of the PIAC Act,",
      "content": "all guarantees given by the Federal Government to any person, including foreign or\nlocal institutions, to secure any of the liabilities of the Corporation shall remain in full force and\naffect as though they were given on behalf of the Company."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Waiver from taxes, duties, fees etc.⸻ The Federal Government may, by notification",
      "content": "in the Official Gazette, waive any tax, duty, fee or any other charge that may be payable under any\nFederal law for the time being in force."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Name and Headquarters of Company.⸻(1) The name of the Company shall not be",
      "content": "changed without the consent, in writing, of the Federal Government.\n(2) The Headquarters of the Company and any of its subsidiary companies carrying on air-\ntransport business shall be at Karachi."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. No gain or loss",
      "content": "Neither the conversion nor the transfer of any asset of the Company\nthrough an order shall given rise to any gain or Loss under the Income Tax Ordinance, 2001 (XLX\nof 2001)."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Act to override.⸻ The provisions of this Act and the orders issued hereunder shall have",
      "content": "effect notwithstanding anything to the contrary contained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Removal of transitional difficulties.⸻ if any difficulty arises during the validity period",
      "content": "in giving effect to any provision of this Act, the Federal Government may, be notification in the\nofficial Gazette, make such provisions as may appear to it to be necessary for the purpose of\nremoving the difficulty."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Repeal.⸻ (1) The PIAC Act is hereby repealed",
      "content": "(2)     On repeal of PIAC Act under sub-section (1), nothing contained in the said Act shall\nbe applicable to the Company, its shareholders or any other person that may have had interest in the\nCorporation immediately prior to the conversion."
    }
  ],
  "definitions": [
    {
      "term": "arrangement",
      "definition": "an arrangement in writing between the Company and any relevant entity setting forth the terms, conditions and manner of transfer of one or more assets of the Company to a relevant entity along with the consideration for the same, which transfer is subject to be provisions of section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "assets",
      "definition": "all properties, rights and entitlements of every description and nature whatsoever, whether present or future, actual or contingent, and tangible or intangible, in Pakistan or elsewhere and includes but not limited to property held on trust, both movable and immovable, benefits, claims, receivables, cash balances, documents, investments, privileges and powers;",
      "source_provision": "sec2"
    },
    {
      "term": "Company",
      "definition": "Pakistan International Airlines Corporation Limited incorporated under the Companies Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "Companies Ordinance",
      "definition": "the Companies Ordinance, 1984 (XLVII of 1984);",
      "source_provision": "sec2"
    },
    {
      "term": "Company request",
      "definition": "a written request made by the Company to the Federal Government to issue an order pursuant to section 4 to effect transfer to a relevant entity of specified assets in terms of the relevant arrangement, provided nevertheless, such request may only be made once the Company has to that extent complied with the provisions of sub-section (3) of section 196 of the Companies Ordinance and the applicable code of corporate governance;",
      "source_provision": "sec2"
    },
    {
      "term": "commencing date",
      "definition": "the date of promulgation of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Corporation",
      "definition": "the Pakistan International Airlines Corporation established under the Pakistan International Airlines Corporation Act. 1956 (XIX of 1956);",
      "source_provision": "sec2"
    },
    {
      "term": "liabilities",
      "definition": "all borrowings, duties, obligations, loans encumbrances of every description and nature whatsoever in Pakistan or elsewhere, whether present or future, actual or contingent, and disclosed or undisclosed;",
      "source_provision": "sec2"
    },
    {
      "term": "order",
      "definition": "any order issued by the Federal Government pursuant to sub- section (1) of section 4 and notified in the official Gazette and the expression “orders” shall be construed accordingly;",
      "source_provision": "sec2"
    },
    {
      "term": "PIAC Act",
      "definition": "the Pakistan International Airlines Corporation Act, 1956 (XIX of 1956);",
      "source_provision": "sec2"
    },
    {
      "term": "proceedings",
      "definition": "any suit, arbitration or other legal or administrative proceedings applications, appeals, awards, reviews or revisions filed or pending;",
      "source_provision": "sec2"
    },
    {
      "term": "relevant entity",
      "definition": "any body corporate or company owned or controlled by the Federal Government or the Federal Government itself;",
      "source_provision": "sec2"
    },
    {
      "term": "specified assets",
      "definition": "the assets specified in the relevant arrangements;",
      "source_provision": "sec2"
    },
    {
      "term": "validity period",
      "definition": "the period starting on the commencing date and ending on the 30th day of June, 2025 or on such date as the Federal Government may, by notification in the official Gazette, appoint;]",
      "source_provision": "sec2"
    }
  ]
}
