{
  "id": "pk-pakistan-junior-cadet-corps-act-1953",
  "type": "statute",
  "title": "Pakistan Junior Cadet Corps Act, 1953",
  "title_en": "Pakistan Junior Cadet Corps Act, 1953",
  "short_name": "PJCCA",
  "status": "in_force",
  "issued_date": "1953-11-04",
  "in_force_date": "1953-11-04",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap%2BaZg%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Junior Cadet Corps Act, 1953 (XXXVI of 1953) published by The Pakistan Code (Military Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_ (1) This Act may be called the Pakistan Junior\nCadet Corps Act, 1953.\n(2) It applies to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "_\n(a)        “cadet” means a school boy who is deemed to be enrolled as a cadet under\nsub-section (1) of section 5 ;\n1\n(b)             [*    *                     *                    *                     *                *      *]\n(c)        “prescribed” means prescribed by rules made under this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Constitution of Junior Cadet Corps. There shall be raised and maintained in the manner",
      "content": "hereinafter provided a force, which shall be designated the Junior Cadet Corps, and shall consist of\nunits constituted under section 4."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Constitution and organization of units",
      "content": "_(1) Subject to the control of the 2[Federal\nGovernment], the 1[Chief of the Army Staff] may, by order in writing, direct the constitution and\nmaintenance for any boys’ school in Pakistan of two separate companies of the Junior Cadet Corps,\neach company to consist of the boys of one of each of the two final classes of the school, and may\ndirect the disbandment of the companies so constituted.\n(2) The companies constituted under sub-section (1) from schools located in the same\nrevenue district shall jointly constitute a battalion to be designated after the name of that district."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Certain students to be deemed to be enrolled",
      "content": "_(1) On the constitution of a company\nunder sub-section (1) of section 4, every student of the class concerned who,___\n1\nOmitted and subs. by The Federal Adaptation of Laws Order 1975 (President’s Order No. 4 of 1975, Art. 2 and Sch.\n3\nSubs., ibid. Art. 2 and Table.\n(i)        is above thirteen years of age, at the commencement of the academic year, or\nby the first day of April of that year, and\n(ii)       is certified on examination by an officer of the Pakistan Army Medical Corps\nto be physically fit to undergo the prescribed military training, shall be\ndeemed to have been enrolled as a cadet in that company.\n(2) A student who is deemed to be enrolled as a cadet in a company under sub-section (1)\nshall not cease to belong to that company, until he passes out of or otherwise leaves, the class for\nwhich the company was constituted, or is duly certified by an officer of the Pakistan Army Medical\nCorps to have become physically unfit to undergo further military training."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Officers of the Junior Cadet Corps",
      "content": "_(1) The 1[Federal Government], on the\nrecommendation of the Headmaster of the school for which units of the Junior Cadet Corps have\nbeen constituted under sub-section (1) of section 4, supported by the Director of Public Instruction of\nthe Province concerned and the officer commanding the local military formation being not below the\nrank of brigadier, may appoint any member of the staff of that school, who is not less than twenty-\nthree and not more than thirty-five years of age, as an officer of the corps.\n(2) A person appointed officer under sub-section (1) shall be granted a commission in the\nform prescribed in this behalf under sub-section (2) of section 232 of the Government of India Act,\n1935 3[or under clause (2) of Article 40 of the Constitution] 4[of 1956 or under clause (2) of Article\n17 of the Constitution of 1962] 2[or under clause (2) of Article 56 of the Interim Constitution of 1972\nor under clause (2) of Article 243 of the Constitution of 1973]."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Officers to be attached to regular units for training. An officer of the Junior Cadet",
      "content": "Corps shall be liable, under the orders of the officer commanding the local military formation being\nnot below the rank of brigadier, to be attached to a unit of the regular army for undergoing the\nmilitary training prescribed for his class."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Officers to be subject to military law. An officer of the Junior Cadet Corps shall, when",
      "content": "undergoing military training under section 7, be subject to 5[* * *] the Pakistan Army Act, 1952\n(XXXIX of 1952),] in such manner and to such extent as may be prescribed."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Allowance of officers",
      "content": "_An officer of the Junior Cadet Corps may be paid such allowance\nby the Provincial Government concerned as may have been agreed upon between the 1[Federal\nGovernment] and the Provincial Government:\nProvided that an officer, who is attached to a regular unit for training under section 7, shall\nreceive such additional allowances as may be prescribed."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Termination of officer’s commissions",
      "content": "_ (1) The 1[Federal Government] may withdraw\nthe commission of an officer at any time and for any cause whatever.\n1\nSubs. by The Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table.\n2\nAdded ibid., Art. 2 and Sch.\n3\nAdded by The Central Adaptation of Laws Order, 1961 (P. O. No. 1 of 1961), Art. 2 and Sch.\n4\nIns. by The Central Adaptation Order of Laws 1964 (P. O. No. 1 of 1964), Art. 2 and Sch.\n5\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and II Sch.\n(2) An officer of the Junior Cadet Corps shall cease to hold his commission___\n(i)        on ceasing to be a member of the staff of the school from which he received\nhis commission:\nProvided that an officer who is immediately re-employed in another school for which\ncompanies of the Junior Cadet Corps have been constituted under subsection (1) of\nsection 4 may, on the recommendation of the Headmaster of that school, be allowed\nby the 1[Chief of the Army Staff] to retain his commission ;\n(ii)       on attaining the age of forty-five years."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Military training of cadets",
      "content": "_A cadet shall be liable to undergo the prescribed military\ntraining."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Discipline of Cadets",
      "content": "_(1) The Headmaster of each school shall be Honorary\ncommanding officer of the companies constituted for his school under sub-section (1) of section 4\nand the primary responsibility for enforcing discipline in those companies shall rest on him.\n(2) With the approval of the 1[Chief of the Army staff] the Headmaster of each school may\nframe rules for the punishment of cadets who wilfully and without reasonable cause absent them-\nselves from parades held for imparting the prescribed military training or who are otherwise guilty of\nconduct to the prejudice of good order and discipline in the Junior Cadet Corps.\n(3) In addition to any other punishment, which the Headmaster may specify therein, the rules\nmade under sub-section (2) shall provide for the subjection of the offender to extra drill for twenty\nminutes."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Members of Junior Cadet Corps not to be liable to perform service",
      "content": "_Officers and\ncadets of the Junior Cadet Corps shall not be liable to perform military service of any kind whatever."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Power to make rules. The 1[Chief of the Army Staff] may, with the approval of the",
      "content": "2\n[Federal Government], make rules to provide for any matter which may be prescribed under this Act\nand to carry out the purposes of this Act.\n___________\n41351                                                                                         Date: 03-02-2025\n1\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Sch.\nSubs. ibid., Art. 2 and Table."
    }
  ],
  "definitions": [
    {
      "term": "cadet",
      "definition": "a school boy who is deemed to be enrolled as a cadet under sub-section (1) of section 5 ; 1 (b) [* * * * * * *]",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act.",
      "source_provision": "sec2"
    }
  ]
}
