{
  "id": "pk-pakistan-land-port-authority-act-2025",
  "type": "statute",
  "title": "Pakistan Land Port Authority Act, 2025",
  "title_en": "Pakistan Land Port Authority Act, 2025",
  "short_name": "PLPAA",
  "status": "in_force",
  "issued_date": "2025-08-28",
  "in_force_date": "2025-08-28",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tnaw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Land Port Authority Act, 2025 (XXV of 2025) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, and commencement",
      "content": "(1) This Act shall be called the Pakistan Land\nPort Authority Act, 2025.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the subject or context,__\n(a)     “Administrative Division” means the division to which the business of the\nAuthority stands allocated;\n(b)     “Adjudication Board” means the Adjudication Board established under section\n38;\n(c)     “Authority” means the authority constituted under section 3;\n(d)     “border control” means integrated systems and measures put in place to monitor\nand regulate the movement of people, vehicles and goods across land ports and\nto ensure the security of land ports and border crossing points in coordination\nwith all relevant Government Agencies;\n(e)   “border crossing point” means the territory or part of territory of border railway\nstations, border stations and any crossing point that allows for cross border\nmovement of goods and passengers by road or rail as notified under the Customs\nAct, 1969 (IV of 1969) and under any other applicable law or rules for the time\nbeing inforce;\n(f)   “Controller” means the Controller of the Management Board;\n(g)   “goods” means any goods as defined under the Customs Act, 1969 (IV of 1969);\n(h)   “Governing Council” means the Governing Council constituted under section\n4;\n(I)   “Government Agencies” means the ministries, divisions, departments,\nauthorities, law enforcement agencies, corporations and other instrumentalities\nof the respective Governments and shall include their officers and\nrepresentatives;\n(j)   “infrastructure” means infrastructure required for setting up cargo and\npassenger terminals, administration center, infrastructure for handling, storage\nand transportation of goods including warehouses, container depots, canopies\nand cargo complexes for storage and processing of goods, facilitation of\npassengers, cargo and passenger transport, information communication\ntechnology and for providing facilities including but not limited to power, water\nand any other utilities and infrastructure required for land port operation and\ngiving effect to the provisions of this Act;\n(k)   “land” includes buildings and benefits arising out of land and things attached to\nthe earth or permanently fastened to anything attached to the earth;\n(l)   “land port” shall mean any land customs station, border crossing point, or any\narea that provides or is intended to provide controlled entry into or departure\nfrom Pakistan of goods, vehicles and passengers with terminal services and\nfacilities at the border, excluding seaports and airports as declared under section\n18,\n(m)   “land customs station” means any land customs station declared under the\nrelevant provision of the Customs Act, 1969 (IV of 1969) for the clearance of\ngoods or any class of goods imported or to be exported by land or inland\nwaterways;\n(n)   “land port operations” shall mean the services and facilities for the handling,\nstorage and transportation of goods, facilitation of passengers and vehicles, and\nany other services and facilities necessary for carrying out the operations of a\nland port as authorized and include such other operations as may be prescribed\nby Rules;\n(o)   “land port operator” shall mean the person or an organization holding a license\nor engaged under contractual agreement under this Act for carrying out land\nport operations;\n(p)      “Managing Director” means the Chairperson of the Authority appointed under\nsection 10;\n(q)      “Member” means the members of the Governing Council, Authority or the\nManagement Board, as the case may be;\n(r)      “Management Board” means the Land Port Management Board constituted\nunder section 20;\n(s)      “Person” includes an association of persons or joint-venture, whether\nincorporated or otherwise, undertaking, firm, public or private concern,\ncompany, corporation, department, organization, agency, authority, or a body\ncorporate set up or controlled by the Federal Government, or as the case may, a\nProvincial Government;\n(t)      “prescribed” means prescribed by Rules or Regulations made under this Act;\n(u)      “President” means president of the Governing Council;\n(v)      “Regulations” means the regulations made under this Act;\n(w)      “Rules” means the rules made under this Act;\n(x)      “Secretary” means the secretary of the Authority; and\n(y)      “Service Provider” means all persons other than Government Agencies and land\nport operators that provide services at the land ports relating to food, catering,\nhealth, recreational facilities and other general amenities."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. The Authority",
      "content": "(1) On commencement of this Act, there shall stand established an\nAuthority to be known as the Pakistan Land Port Authority for carrying out the purposes of this Act.\n(2) The Authority shall be a body corporate, having perpetual succession and a common seal,\nwith power to purchase, procure, sell, exchange, hold, acquire, and dispose of property, both movable\nand immovable, as well as interests therein, and may, by its name, sue or be sued.\n(3) The head office of the Authority shall be at Islamabad. The Authority may establish and\noperate regional offices at such other places, as the Authority may determine, from time to time."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Governing Council",
      "content": "(1) On the commencement of this Act, the Prime Minister of Pakistan\nshall constitute a Governing Council consisting of the following members, namely:__\n(a)         Minister of the Administrative Division                               President\n(b)     Secretary of the Administrative Division                               Member\n(c)     Secretary, Ministry of Commerce                                        Member\n(d)     Secretary, Ministry of Communications                                  Member\n(e)     Secretary, Ministry of Defence                                         Member\n(f)     Secretary, Revenue Division                                            Member\n(g)     Secretary, Ministry of Planning, Development and                       Member\nSpecial Initiatives\n(h)     Secretary, Ministry of National Food Security &                        Member\nResearch\n(i)     Managing Director                                                      Member\n(j)     Director General, Immigration and Passport                             Member\n(k)     Chief Executive, Trade Development Authority                           Member\nPakistan\n(l)     Member Customs (Operations)                                            Member\n(m)     President of Federation of Pakistan Chambers of                        Member\nCommerce and Industry or his nominee\n(n)     Economic Expert, having at least a Master degree\nin Economics or Trade from a recognized                               Member\ninstitution or University, and a minimum of ten\nyears of professional experience in the fields of\ntrade, commerce, or economic policy\n(o)     Legal Expert, who is an advocate of the High                           Member\nCourt with at least fifteen years experience with\ndemonstrated expertise in customs laws;\n(2) The relevant Additional Secretary of the Division concerned shall be the Secretary of the\nGoverning Board.\n(3) The Governing Council may, for its assistance, invite any person having special knowledge\nor expertise in any relevant field to attend its meeting. Such person may be invited in such manner,\nhaving such qualification on such terms and conditions, as the Governing Council may determine.\nSuch invitee shall not be entitled to vote."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Meetings of the Governing Council",
      "content": "(1) The meetings of the Governing Council shall be\ncalled by the President at least twice a year at such time and place as may he specified by him or on\nhis direction, the Managing Director may call such meeting.\n(2) The quorum for a meeting of the Governing Council shall be half of the total members:\nProvided that no meeting of the Governing Council shall be held in the absence of the President\nand the Managing Director.\n(3) The decisions of the Governing Council shall be taken by a majority of the members present\nand noting.\n(4) The President or in his absence, the Managing Director shall preside over the meetings of\nthe Governing Council.\n(5) The President may invite any relevant Person to attend a meeting of the Governing Council\non any specific agenda item taken up for consideration at such meeting.\n(6) In circumstances of urgency or exceptional necessity, when it is not reasonably practicable\nto convene physical meeting of the Governing Council, a virtual or hybrid meeting shall be held using\nsecure video conferencing platforms. All decisions made in such meeting shall be duly recorded and\nshall be placed before the next physical meeting of the Governing Council for ratification and inclusion\nin the official minutes.\n(7) No act or proceedings of the Governing Council shall be invalid merely on the ground of\nthe existence of any vacancy in or any defect in the constitution of the Governing Council.\n(8) Subject to the provisions of this Act, the Governing Council shall have the power to regulate\nthe procedure and conduct of its business."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Powers and Functions of the Governing Council",
      "content": "(1) The Governing Council shall he\nresponsible for the overall supervision of the Authority for the purposes of carrying out the functions\nunder this Act,\n(2) In particular and without prejudice to the generality of the foregoing, the Governing Council\nshall__\n(a)     supervise, monitor and review the functions of the Authority;\n(b)     recommend for consideration by the Government requisite policy initiatives;\n(c)     provide guidelines and directions to the Authority for carrying out its functions\nunder this Act;\n(d)     review plans and initiatives of the Authority;\n(e)     conduct annual performance review of the Authority in such manner as may be\nprescribed by Regulations;\n(f)     review and approve annual budget of the Authority, and ensure transparent\nutilization thereof in the manner prescribed by Regulations; and\n(g)     transact such other business as entrusted to it under this Act.\n(3) The Governing Council may, in such manner as may be prescribed, constitute committees\nand sub-committees, from time to time, and entrust such powers and functions to them, as the\nGoverning Council may deem appropriate.\n(4) The Governing Council may, in exceptional circumstances and for the purpose of carrying\nout the objectives of this Act, delegate any of its functions to the Authority or to any member thereof;\nsubject to such conditions as it may deem appropriate and upon recording in writing the reasons for\nsuch delegation.\n(5) The decision taken by Governing Council under this Act, shall be binding on Government\nAgencies to follow at land ports."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Composition of the Authority",
      "content": "(1) The Authority shall comprise of the following\nmembers, namely:__\n(a)    Managing Director                                                   -   Chairperson\n(b)    Additional Secretary of the Administrative Division                 -   Member\n(c)    Additional Secretary, Ministry of Defence                           -   Member\n(d)    Additional Secretary, Ministry of Commerce                          -   Member\n(e)    Chairman, National Highway Authority                                -   Member\n(f)    Member Customs (Operations)                                         -   Member\n(g)    Director Military Operations, Military Operations Directorate       -   Member\n(h)    Additional Director General Immigration, FIA                        -   Member\n(i)    Director, Pakistan Land Port Authority                              -   Secretary\n(2) The Authority may, as deemed appropriate, co-opt logistics and supply chain professionals\nor any other relevant Person as member, from time to time, in such manner and on such terms and\nconditions as may be prescribed.\n(3) The Managing Director shall be the chief executive and principal accounting officer of the\nAuthority and shall be responsible for carrying out the functions of the Authority."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Meetings of the Authority",
      "content": "(1) The Chairperson may call and preside a meeting of the\nAuthority at such times and at such places as may be specified by him or in his absence, the Additional\nSecretary of the Administrative Division may call and preside the meeting.\n(2) The quorum of a meeting of the Authority shall be the majority of the total members and\nall order and decisions of the Authority shall be taken by vote of majority of the members present, and\nshall be recorded, in writing, by the Secretary.\n(3) If an ex-officio Member is unable to attend the meeting, he may authorize any of his officer,\nnot below the rank of BPS-20 or equivalent, to attend the meeting in his place.\n(4) No proceeding, meeting, or decision of the Authority shall be called in question or\ninvalidated for the reason of a defect or vacancy in the constitution of the Authority."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Powers and functions of the Authority",
      "content": "(1) The Authority shall exercise the powers and\nperform the functions necessary for the achieving the purposes of this Act.\n(2) In particular and without prejudice to the generality of sub-section (1), the Authority shall\nhave the power to__\n(a)    develop, administer and manage land ports and exercise powers of regulation of\nprocesses at land ports for facilitation of trade and implementation of border\ncontrol;\n(b)    inspect, monitor and administer the performance of land port operators;\n(c)   monitor and coordinate with the Government Agencies engaged in or deployed\nat land ports;\n(d)   stipulate and implement measures for reducing dwell time in clearance of goods\nat land ports in coordination with Government Agencies, and to formulate and\ndevelop strategies as well as procedures for carrying out its functions in\naccordance with the provisions of the Act and rules made thereunder;\n(e)   grant, issue, recognize, suspend, and revoke licenses, agreements and contracts\nfor any commercial facilities for land port operators;\n(f)   establish liaison and communication with foreign port authorities, international\norganizations and designated counterparts;\n(g)   arrange and promote training sessions, seminars, workshops, and constitute\nworking groups for implementing programs aimed at improving the\nfunctionality of land ports;\n(h)   facilitate the process of optimizing logistics costs and other related charges\nunder the market economy;\n(i)   to collect or cause to be collected fees, dues, charges, levy, rents and other\namounts under the Act;\n(j)   establish cold storages, quarantine facilities, certification laboratories, hotels,\nresidential buildings, restaurants, shops, restrooms and other recreational\ncenters for facilitating passengers at land ports or any other facility as required;\n(k)   accredit equipment and infrastructure, implement systems, and frameworks for\nthe development and efficient operation of land ports;\n(l)   develop and operate information technology systems for implementing\nintegrated business processes, port community system and integrated cross-\nborder cargo management systems for carrying out the purposes of this Act;\n(m)   implement and facilitate programs for ease of doing business at land ports to\nensure a trade-friendly environment;\n(n)   purchase, procure, acquire, hold, sell and dispose of land and property, as welt\nas interests therein, for carrying out the purposes of this Act;\n(o)   procure, install, maintain, and modernize infrastructure including land port\nmanagement system at land ports to ensure efficient provision of terminal\nservices and facilities;\n(p)   plan, construct and maintain roads, terminals and infrastructure within the limits\nof land ports in order to ensure their smooth functioning;\n(q)   design, approve, execute any scheme, and to undertake any works for carrying\nout the purposes of this Act;\n(r)   plan, develop and undertake any commercial undertaking or project individually\nor through joint venture or public private partnership with local and\ninternational agencies, government institutions and private sector for carrying\nout the purposes of this Act;\n(s)     carry out investigation, survey, exploration or feasibilities studies and to\ncollaborate in, carrying out, or procure the carrying out of, research relating to\nits functions under this Act and publish information that results from the\nresearch;\n(t)     acquire lands for carrying out purposes of the Authority and to lease, purchase,\nprocure, sell, exchange, mortgage or rent out or otherwise dispose of any\nmovable or immovable property;\n(u)     may, in accordance with applicable policy of the Federal Government,\nrequisition or engage officers or members of staff from government agencies as\nmay be necessary for the effective discharge of its functions under this Act;\n(v)     raise funds through borrowing, investments, leasing of assets or any other means\nin the manner prescribed by Regulations and incur any expenditure necessary\nfor carrying out the purposes of this Act; and\n(w)     performing other functions connected therewith or ancillary thereto.\n(3) The Authority may, in such manner as may be prescribed by Regulations, constitute\ncommittees and sub-committees, from time to time, for the purposes of this Act.\n(4) The Authority may, subject to such conditions and restrictions as may be prescribed by\nRules, delegate any of its functions to the Managing Director.\n(5) The Authority shall exercise all the administrative, executive and financial powers and do\nall acts, which are required to be exercised or done by the Authority for the purpose of this Act."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Appointment of the Managing Director",
      "content": "The Prime Minister shall appoint a Managing\nDirector of the Authority who is serving or has served in BPS-22 having such qualifications,\nexperience and on such terms and conditions as may be prescribed by Rules."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Powers and functions of Managing Director",
      "content": "(1) The Managing Director shall exercise\nsuch administrative, operational and financial powers with regards to the functioning of the Authority,\nas may be delegated to him by the Authority under this Act.\n(2) In particular and without prejudice to generality of sub-section (1), the Managing Director\n__\nshall\n(a)     administer day-to-day affairs of the Authority in accordance with the guidelines\nissued by the Governing Council;\n(b)     appoint a Director General to the Authority, after the approval of the Prime\nMinister, on such terms and conditions as may be prescribed, who shall perform\nsuch functions as the Managing Director may assign;\n(c)     ensure implementation of the directions and guidelines issued by the Governing\nCouncil;\n(d)     manage and supervise the officers, members of the staff and other employees of\nthe Authority;\n(e)     perform any act or function that may be assigned to him, under this Act; and\n(f)     carry out all activities connected therewith or ancillary thereto for the purposes\nof this Act.\n(3) The Managing Director may, either by himself or through any officer designated by him in\nthis behalf, carry out correspondence and sign, verify, pursue and file all pleadings, contracts, and such\nother legal documents on behalf of the Authority at appropriate forum.\n(4) For the efficient management of the Authority, the Managing Director with the approval of\nGoverning Council may, from time to time, subject to such restrictions as may be prescribed, delegate\nany of his powers and functions to any Member or officer of the Authority."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Employment under the Authority",
      "content": "(1) The Authority may, from time to time, appoint,\nengage, induct, remove or transfer as deemed appropriate, any person as an employee, officer, staff,\nexpert, consultant, advisor, public servant on deputation, or through initial recruitment, contractual or\nother basis by such procedures on such and the terms and conditions of their service may as be\nprescribed by Regulations.\n(2) The Authority with approval of the Federal Government, from time to time, establish,\ncreate, sanction, approve, abolish, or merge any post, office, or directorate, as may be required.\n(3) In case of any adverse finding by the Authority against any public servant on deputation\nshall forwarded such findings to the relevant agency for disposal of case, which shall be decided by\nthe relevant agency under its relevant laws and rules made there under."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Employees to be public servants",
      "content": "The Managing Director, Members, employees,\ndirectors, staff, functionaries, and officers of the Authority shall, when acting or purporting to act in\npursuance of any of the provisions of this Act, be deemed to be public servants, within the meaning of\nsection 21 of the Pakistan Penal Code, 1860 (Act XLV of 1860).\nCOORDINATION WITH GOVERNMENT AGENCIES, TRADE FACILITATION AND"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Coordination, Trade Facilitation and Border Controls",
      "content": "(1) For the performance of\nfunctions under this Act, the Authority shall provide office space and areas, duly designated for\ndifferent Government Agencies within each land port and ensure provision of basic requirements.\n(2) The Authority shall be solely responsible for coordinating with all relevant Government\nAgencies for performance of their functions and for implementing border control, and shall facilitate\nthe working of such agencies at land ports.\n(3) For purposes mentioned in sub-section (2), the Authority shall issue standard operating\nprocedures, code of operations and may enter into arrangements, where required, with Government\nAgencies.\n(4) The Authority may, whenever required, request the assistance of Government Agencies to\nmaintain peace and security at land ports, in accordance with applicable laws.\n(5) Notwithstanding anything contained in any provisions of this Act, the Government\nAgencies shall discharge their functions under their respective laws.\n(6) If any dispute arises with regard to coordination amongst the Government Agencies,\nstandards or in their roles and duties amongst each other or any other dispute under this Act, such\ndisputes shall be settled by the Authority.\n(7) If any Government Agency is not satisfied with the resolution of the dispute under sub-\nsection (6), such agency may refer the matter to the Governing Council, which shall decide upon the\nmatter on expeditious basis and such decision shall be binding on all Government Agencies.\n(8) For the purposes of trade facilitation, integrated border management, interagency\ncooperation, implementing standards, reduction in dwell time and other interagency issues for\nclearance of goods, the working of relevant Government Agencies shall be coordinated for operational\nefficiency. The data and information in this respect shall be maintained and published by the Authority."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Conflict of interest",
      "content": "(1) Every Member shall arrange and manage his affairs in a manner\nthat prevents such person from having a conflict of interest, direct or indirect, pecuniary or otherwise,\nwith the affairs of the Authority, and shall make a declaration to this effect in such manner as may be\nprescribed by Regulations.\n(2) Any person who is in contravention of the provisions of sub-section (1), or submits a false\nor inaccurate declaration to such effect, shall be proceeded against in such manner as may be prescribed\nunder Regulations may result in his removal as well."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Members Not to engage in other businesses",
      "content": "Any Member, except the president of the\nFederation of Pakistan Chambers of Commerce and Industry or his nominee, shall not, during their\nrespective term of office, engage with, for compensation or profit, any person or entity engaged in land\nport operations, or any part thereof, under this Act."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Removal, resignation etc of Member.__ (1) Any Member, other than an ex",
      "content": "officio\nmember, may be removed from such body, by the appointing authority, if such member__\n(a)     is found guilty of misconduct;\n(b)     is inefficient or becomes incapable of discharging his responsibilities and\nfunctions under this Act;\n(c)     is declared insolvent by a competent court of law;\n(d)     is declared to be disqualified for employment in, or has been dismissed from the\nservice of Pakistan or has been convicted by a court of competent jurisdiction,\nof offences involving moral turpitude or financial embezzlement; or\n(e)     enters into plea bargain under any law for the time being in force.\n(2) Any Member, other than an ex-officio member, may resign from his office under this Act\nat any time by writing under his hand addressed to the appointing authority, and such resignation shall\nbe effective from the date of its acceptance by the appointing authority."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Declaration of Land Ports",
      "content": "The Authority may, with the concurrence of the concerned\nProvincial Government, from time to time, by notification in the official Gazette, declare, define, alter\nor extend the limits of any land port after the same have been duly verified under the Custom Act,\n1969 (IV of 1969) for the purposes of this Act:\nProvided that such extension shall only apply to areas that are contiguous to the existing land\nport boundaries."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Assets and Liabilities",
      "content": "(1) On the date of notification of the Authority or any time\nafterwards as specified in the said notification, all lands, buildings, equipment and all other forms of\nproperty relating to land port, whether real or personal, and all interests therein, as immediately before\nthe issue of that notification or specified date, as the case may be, were in the ownership or possession\nor lease of the Federal Government, subject to such limitations if any Federal Government may, in\nsuch notification specify, shall vest in the Authority and such vesting shall also be deemed to include\nliabilities and obligations in relation to such assets.\n(2) The notification under sub-section (1) shall be issued only after the concurrence of the\nconcerned Government Agencies, in case where such properties are owned or controlled by any of\nsuch Government Agency.\n(3) Notwithstanding any thing contained in this Act, except with the prior written permission\nof the Governing Council, the Authority shall not sell any land vested in the Authority.\n(4) Any contract, agreement, and working arrangement subsisting in relation to land ports,\nimmediately before the date of notification of Authority under section 3, shall be succeeded by the\nAuthority with such modifications and adaptations or execution as are necessary to give effect to the\nprovisions of this Act.\n(5) Where at the time of the transfer of any functions by or under this Act, any legal proceedings\nare pending to which any Government Agency is a party and those proceedings relate to the functions\ntransferred by or under this Act, the Authority shall be substituted in those proceedings for such\nGovernment Agency and the proceedings shall not abate by reason of the substitution.\n(6) If any question arises as to whether any asset has become the property or responsibility of\nthe Authority, that question shall be decided by Federal Government."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Land Port Management Board",
      "content": "(1) The Authority shall constitute a Management Board\nfor each land port consisting of the following ex-officio members, namely:\n(a)    Controller (serving or retired BPS-19 or           -   Chairperson\n20, or equivalent officer)\n(b)    Officer of Federal Investigation Agency            -   Member\n(c)    Assistant or Deputy Collector of Customs           -   Member\nposted at the concerned land port\n(d)    Officer of Anti-Narcotics Force                    -   Member\n(e)    Border Terminal Operator                           -   Member\n(f)    An officer of relevant Civil Armed Force               Member-         cum-\nresponsible for security of the relevant land          Secretary\nport duly nominated by the Authority\n(2) The Management Board may, as deemed appropriate, invite any other officer of the relevant\nGovernment agency for a particular issue.\n(3) The Controller shall be responsible for managing affairs of the Management Board as well\nas the execution of the functions assigned or delegated to it under this Act.\n(4) The Management Board shall meet at such times and in such places and manner, as may be\ndetermined by the Controller. In the absence of the Controller, the Management Board may elect one\nof its members to preside.\n(5) The Management Board shall meet at least once every week."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Powers and function of Management Board",
      "content": "The Management Board shall monitor\nand regulate the activities of land port operators, Service Providers and coordinate with other\nGovernment Agencies for smooth operations at the land port, and for implementing Border Control as\nper the provision of this Act."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Power to implement directions",
      "content": "(1) Any person may lodge a complaint regarding any\nof the matters enumerated in sub-section (1), to the Controller.\n(2) The Controller shall, either on his own or upon the complaint of any person under sub-\nsection (2), immediately place the matter before the Management Board.\n(3) The Management Board, if the complaint pertains to any employee of the Authority or any\nland port operator, shall decide the matter within three days after providing such delinquent an\nopportunity of being heard. Where the complaint is against a person of the other Government Agencies,\nthe matter shall be forwarded to the concerned officer of that Government Agency to be dealt under\ntheir respective laws.\n(4) Where a complaint has been received against Chairperson of the Management Board, the\nsame shall be placed before the Authority, who shall decide the same within seven days, in the manner\nprescribed:\nProvided that the decision of the Authority, under this sub-section, shall be final.\nCONTRACTS BY AUTHORITY, OUTSOURCING AND LICENSING"
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Contracts by Authority etc",
      "content": "(1) Every contract on behalf of the Authority, shall be made\nby the Managing Director or such other officer of the Authority as may be generally or specially\nempowered in this behalf by the Authority and shall be sealed with the common seal of the Authority.\n(2) The Authority may enter into any contract or arrangement with any person, entity, company,\nagency, authority, or organization national or international and may outsource land port operations and\nany of its functions or activities, including development works, through any mode including pubic\nprivate partnerships:\nProvided that the land port operations can be out sourced to only such land port operators who\nis registered under the provisions of the Customs Act, 1969 (IV of 1969) and rules made thereunder.\n(3) Notwithstanding anything contained in any other law, the Authority shall prior to inviting\nproposals for bids, prescribed by regulations the criterion for selection of land port operator and Service\nProvider and award contracts accordingly.\n(4) For the performance of functions and carrying out activities, the Authority may delegate,\noutsource or lease or assign the right and collection of any user fees, dues or charges under this Act to\nsuch private entity, operator or entity as the case may be.\n(5) In accordance with the provisions of the Public Private Partnership Authority Act, 2017\n(VIII of 2017), and rules and regulations made thereunder, the Governing Council may, by regulations,\nprescribe the manner, methods and procedures for undertaking public private partnerships under this\nAct.\n(6) In accordance with the provisions of the Public Procurement Regulatory Authority\nOrdinance, 2002 (XXII of 2002), any rules and regulations made thereunder, the Governing Council\nmay, by regulations, prescribe the manner, methods and procedures for undertaking procurement under\nthis Act."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Grant of Licenses",
      "content": "(1) Unless an agreement is executed under section 23, no person or\nentity may provide services relating to land port operations or any services at a land port or perform\nany functions under this Act, otherwise than in terms of a licence issued to it under the prescribed\nRules.\n(2) Subject to the conditions stipulated under this Act and in accordance with existing laws or\nin the manner as may be prescribed, the Authority shall have the power to grant, issue, recognize,\nrenew, extend, modify, amend, suspend, review, cancel, re-issue, revoke, or terminate a license for any\nperson to carry out any component of land port operations as may be prescribed by Rules."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Offences",
      "content": "(1) Any person who knowingly__\n(a)     undertakes, without a valid license or agreement, any of the activities envisaged\nunder this Act;\n(b)     performs any act with the intention of interfering with, obstructing, or\nencumbering, without authorization, the land port operations;\n(c)     undermines or defrauds the lawful exchange of persons, goods and services in\nor across land ports; and\n(d)     causes physical damage to the establishment, installation or infrastructure, or\nany part thereof, of a land port, land port operator or service provider;\nshall be guilty of an offence punishable with imprisonment upto three years and fine upto two\nhundred millions rupees under this Act:\nProvided that the punishment and fine under this Act shall be in addition to the punishment and\nfine provided under any law for the time being in force.\n(2) Any person who attempts or aids, abets, counsels or procures the commission of an offence\nunder this Act shall be punishable with the same punishment provided for the offence he so aids, abets,\ncounsels, or procures.\n(3) The provisions of sub-sections (1) and (2) shall be in addition to, and not in derogation of,\nany law for the time being in force."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Cognizance of offences",
      "content": "Notwithstanding anything contained in any other law for the\ntime being in-force, unless there is anything inconsistent with the provisions of this Act, the provisions\nof the Code of Criminal Procedure, 1898 (Act No. V of 1898) shall mutates mutandis apply to the\nproceedings under this Act."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Strategic support",
      "content": "(1) For the proper and efficient performance of its functions, the\nAuthority may, whenever required, seek the assistance of the Federal Government or the Provincial\nGovernments, as the case may be, in accordance with applicable laws, rules and regulations.\n(2) All Government Agencies, land port operators, and Service Providers shall render such\nassistance to the Authority, as may be required for the exercise or performance of activities and\nfunctions, of the Authority under this Act.\n(3) The Authority may requisition or engage officers or members of the staff of the Government\nAgencies, on deputation or secondment basis, as per the applicable policy regime of the Federal\nGovernment, for carrying out its functions under this Act."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Power of the Federal Government to issue Policy Guidelines",
      "content": "The Authority shall be\nbound to comply with the policy guidelines issued by the Federal Government, to the extent that these\nare not inconsistent with the provisions of this Act."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Authority to charge fees, rent etc. at land ports",
      "content": "(1) The Authority shall be competent\nto impose, levy and collect such fees, dues, charges, rentals, and other amounts at such rates separately\nfor each land port from time to time as under,__\n(a)     handling and transportation of cargo, storage, warehousing, weighment, entry\nand parking fees for trucks/cargo vehicles, transshipment and any service or\nfacility offered in connection with transport operations;\n(b)     parking spaces and other amenities given to the passengers and visitors;\n(c)     in respect of commercial exploitation of properties of the Authority, whether\nmovable or immovable including land, building and infrastructure;\n(d)     fees paid in connection with any accreditation, survey, inspection, permit,\nauthorization, license, approval either issued or renewed and for rendering any\nother services provided by the Authority;\n(e)     collection of fine and penalty for violation of the Act, rules and regulations\nframed thereunder; and\n(f)     any other fee or levy as prescribed from time to time.\n(2) Before approving any fees or charges under clauses (a) and (b) of subsection (1) the\nAuthority shall consider the recommendations of the Government Agencies and invite objections from\npublic or private sector at least two weeks before notifying the same in a consultative process."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Exemption and power to remit",
      "content": "In special cases, the Authority may, with the approval\nof the Governing Council, waive or remit in full the whole or any portion of fees, dues, charges, rentals\nand other amounts under section 29 on such terms as specified in the aforesaid approval."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Pakistan Land Port Authority Fund",
      "content": "(1) On commencement of this Act there shall be\nconstituted a non-lapsable fund vested in the Authority known as the “Pakistan Land Port Authority\nFund” hereafter refer to as “The Fund” to be utilized by the Authority to meet charges in connection\nwith its functions under this Act including the payment of salaries and other remuneration to the\nManaging Director, Members, officers, employees, experts and consultants of the Authority.\n(2) The sources of the Funds shall be__\n(a)     funds, loans or grants provided by the Federal Government or Provincial\nGovernment or local bodies;\n(b)     local loans obtained by the Authority;\n(c)     foreign aid and loans obtained from any source outside Pakistan;\n(d)     all sums received by the Authority as fees, charges, rentals, etc. and other\nmoneys received or collected the Act;\n(e)     income from lease and sale of assets of the Authority;\n(f)     funds from bonds, sukuk and other forms of finances obtained on the basis of\nparticipation term certificates, musharika certificates, term finance certificates\nor any other financial or debt instruments or securities issued by the Authority;\nand\n(g)     all other sums received by the Authority such as damages, costs, refunds, fines,\npenalties etc.\n(3) The Authority shall have the power, subject to the provisions of this Act, to spend such\nsums as it thinks fit to cover all administrative, business development expenses of the Authority and\nfor performing any function of the Authority and such sums shall be treated as expenditure out of the\nfund of the Authority.\n(4) All moneys standing at the credit of the Authority which cannot immediately be applied as\nprovided under sub-section (3) shall be__\n(a)     deposited in bank accounts as provided in section 32; and\n(b)     invested in the securities of the Federal Government or in such manner as may\nbe prescribed under rules."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Bank Accounts.__ The Authority may open and maintain its non",
      "content": "lapsable bank accounts in\nscheduled banks and shall operate such accounts in such manner as may be prescribed by regulations:\nProvided that till the time the Regulations and made the Authority may operate such accounts\nin accordance with the directions of the Governing Council."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Borrowing powers of Authority",
      "content": "The Authority, with approval of the Federal\nGovernment, for the purposes of its capital expenditure, working capital requirements or for\nperforming any of its functions may raise loan in any currency from any:\n(a)     scheduled bank or financial institution located within Pakistan;\n(b)     financial institution in any country outside Pakistan in compliance with the laws\nfor the time being in force; and\n(c)     funds from bonds or securities."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Budget and Accounts",
      "content": "(1) The Authority shall maintain proper accounts and other\nrecords relating to its financial affairs including its income and expenditures and its assets and\nliabilities in such form and manner as may be prescribed under Rules.\n(2) The Governing Council shall approve the annual budget of the Authority for a financial\nyear in the manner prescribed by Rules.\n(3) The Managing Director shall have the power to re-appropriate funds in various heads of\naccounts as per the Rules and Regulations applicable therein."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Audit",
      "content": "(1) The accounts of the Authority shall be audited every year by the Auditor\nGeneral in terms of Articles 169 and 170 of the constitution.\n(2) The accounts of the Authority, as certified by Auditor General of Pakistan together with the\naudit report thereon shall be forwarded annually to the Division concerned for examination and laying\nbefore both Houses of the Majlis-e-Shoora (Parliament).\n(3) The Authority may, in addition to the audit under sub-section (1), cause to be carried out\ninternal audit of its accounts."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Recovery of fees, charges etc",
      "content": "All fees, charges, dues, fines and other sums due to the\nAuthority under this Act shall be recovered by such modes of recovery as may be prescribed by Rules."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Complaint Cell",
      "content": "(1) The Authority shall establish a complaint cell at each land port,\nwhich shall receive complaints from any land port user or any person aggrieved on any non-contractual\nmatter relating to land port.\n(2) The Complaint Cell shall enter all complaints in serially numbered register and shall\nundertake expeditious measures to resolve the complaint within twenty one days from receipt of\ncomplaint.\n(3) The complainant shall remain informed about the status of the complaint."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Adjudication Board",
      "content": "(1) There shall be established an Adjudication Board by the\nAuthority for speedy disposal of complaints, claims and disputes of general public, users of land port\nservices and parties having claims or aggrieved by actions of the Authority under the Act, rules and\nregulations shall be consisting:__\n(a)     a person qualified to be Session Judge or equivalent;\n(b)     an advocate with a minimum of ten years experience preferably in Customs\nlaws; and\n(c)     a Chartered Accountant or qualified Accountant with at least ten years of\nprofessional experience.\n(2) The conduct and procedure of Adjudication Board shall he such as may be prescribed by\nRules and the proceedings before the Adjudication Board may be conducted in person or by virtual\ncommunication.\n(3) The Adjudication Board referred to in this section shall perform the following functions\nnamely:__\n(a)     to receive and adjudicate reference on any dispute or differences including fines\nimposed by the Authority or claims arising under this Act, rules and regulations\nor relating to rights and obligations of parties within the framework of their\nagreements entered with the Authority, and to pass orders after considering and\nhearing all the parties involved in the dispute;\n(b)     to look into the complaints received from land port users or general public\nagainst the services and terms of services rendered by the Authority, if not\naddressed by the Complaint Cell within the stipulated time and to pass necessary\norders after hearing the parties concerned;\n(c)     conduct an inquiry in any case; and\n(d)     to look into any other matter relating to the operations of the Authority, as may\nbe referred to it by the Federal Government, Governing Council or the\nAuthority, and to pass orders or give suggestions, as the case may be.\n(4) Notwithstanding anything contained in any other law for the time being in force, the\nAdjudication Board shall have the same powers as are vested in a Civil Court under the Code of Civil\nProcedure, 1908 (V of 1908), while trying a suit, in respect of the following matters, namely:__\n(a)    the discovery and production of books of account and other documents, at such\nplace and at such time as may be specified by the Adjudication Board;\n(b)    summoning and enforcing the attendance of persons and examining them on\noath;\n(c)    issuing commissions for the examination of witnesses or documents; to receive\nevidence on affidavit, to compel a person to given evidence and to produce any\ndocument or other material;\n(d)    requisition information from any office;\n(e)    issue summons to any party, witness; and\n(f)    any other matter which may be prescribed.\n(5) Any proceeding before the Adjudication Board shall be deemed to be a judicial proceeding.\n(6) The Adjudication Board shall execute its decisions in such manner as may be prescribed by\nRegulation.\n(7) During the course of any proceedings before the Adjudication Board and before passing a\nfinal order, the Adjudication Board may pass such interlocutory orders as it may consider appropriate\nin the circumstances."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Dispute Resolution",
      "content": "In case of any dispute between the Authority and any entity arising\nout of the public private partnership agreement or concession agreement or any other agreement having\ncontract value above one hundred million rupees, then notwithstanding any provisions of the Act, the\nparties shall resolve the dispute in the following manner namely;__\n(a)    the parties shall first deliberate to achieve a consensus; and\n(b)    if no consensus is achieved, the parties shall settle the dispute in an amicable\nmanner by mediation or arbitration as provided under any contract agreement\nentered into with the Authority."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Review and appeal of any order or decision",
      "content": "(1) If there is any clerical and manual\ncalculation errors in any decisions or order of the Adjudication Board and party aggrieved by such\ndecision or order may apply for a review of such decision before the Adjudication Board, in such form\nand manner and within such time, as may be prescribed by Regulations and the Adjudication Board\nmay make such order thereon, as it thinks fit.\n(2) Any party aggrieved by any decision or order of the Adjudication Board, may file an appeal\nto the Appellate Tribunal, within thirty days from the date of communication of such decision or order\nto him:\nProvided that no appeal shall lie from a decision or order passed by the Adjudication Board\nwith the consent of parties.\n(3) The composition, conduct, procedure of the Appellate Tribunal and its functions shall be\nsuch as prescribed by Rules and the proceedings before the Appellate Tribunal may be conducted in\nperson or by virtual communication."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Submission of annual report",
      "content": "(1) The Authority shall, within three months of the end of\na financial year, submit to the Federal Government an annual report.\n(2) the Annual report under sub-section (1) shall consist of,__\n(a)     the statement of accounts and audit reports of the Authority;\n(b)     a comprehensive statement of the work and activities of the Authority during\nthe preceding financial year and its proposed projects; and\n(c)     such other matters as may be prescribed by Rules or as the Authority may\nconsider appropriate."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Acquisition of land",
      "content": "(1) The acquisition of any land or any interest in land for the\npurposes of performing the functions of the Authority shall be deemed to be an acquisition for public\npurposes.\n(2) Where any land is required for the purposes of the Authority, the Federal Government or\nas the case may be, the Provincial Government may, at the request of the Authority, procure the\nacquisition thereof under the provisions of the Land Acquisition Act, 1894 (I of 1894) or any other\nlaw for the time being in force. After payment by the Authority of the compensation awarded under\nthat Act and of the charges incurred in connection with the proceedings, the land shall vest in the\nAuthority."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Purchase, lease or exchange of property",
      "content": "The Authority may purchase, lease or\nexchange any land or building or any other property by entering into an agreement with the owner of\nthe property, or a person legally competent to sell, lease out or exchange such property."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Custody and disposal of lost property",
      "content": "Subject to other provisions of this Act and\nRegulations as prescribed, the Authority shall provide for securing the safe custody and disposal of\nany property, which, while not in proper custody, is found on any premises belonging to the Authority\nor under its overall control."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Co",
      "content": "operation with international organizations.__ The Authority may, subject to the prior\napproval of the Federal Government, co-operate with foreign port authorities or international\norganizations in the field of transportation, logistics, port management, cross border movement of\ngoods and people or related fields on the terms and conditions of any program or agreement for co-\noperation to which such authority or organization is a party, or pursuant to any other international\nagreement made earlier or after the commencement of this Act."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Industrial Relations Ordinance, 1969, etc. not to apply",
      "content": "Nothing contained in the\nIndustrial Relations Act, 2012 (X of 2012) or in any other law relating to labour or trade unions for the\ntime being in force shall apply in relation to the Authority or any of the members, employees,\nfunctionaries, officers, experts, consultants and advisors of the Authority."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Symbol, design or representation of Authority",
      "content": "(1) The Authority shall have the\nexclusive right to the use of such symbol, design or representation as it may select or devise and\nthereafter display or exhibit it in connection with its activities or affairs.\n(2) Any person who, knowingly or otherwise, uses a symbol, design or representation identical\nwith that of the Authority or which resembles the symbol, design or representation, which causes or is\nlikely to cause a deception of the identity of the Authority, shall be punished in such manner as may\nbe prescribed by Rules."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Power to make Rules",
      "content": "(1) The Federal Government shall make rules not inconsistent\nwith the provisions of this Act, for giving effect to the provisions of this Act.\n(2) In particular, and without prejudice to the generality to the foregoing, rules may be framed\nfor, inter alia, the following, namely.__\n(a)     administrative, operational, and financial management of the Authority;\n(b)     procedure of the issuance, modification cancellations and revocation of licenses\nunder this Act;\n(c)     regulation and control of movement of vehicles, goods, entry and exit of\npassengers and other personnel at land ports;\n(d)     the inspection and regulation of commercial services, Service Providers and\nland port operators, the conditions under which infrastructure may be operated,\nmanaged, maintained, monitored, evaluated and for services provided;\n(e)     the inspection or supervision of properties of the Authority for the purpose of\nenforcing the provisions of the Act;\n(f)     provisions for accreditation;\n(g)     imposition and collection of fines subject to provisions of the Act; and\n(h)     any other matters as provided in the Act."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Power to make Regulations",
      "content": "(1) The Authority may make regulations, not inconsistent\nwith the provisions of this Act or the rules made under this Act, for carrying out the purposes of this\nAct:\n(2) In particular, and without prejudice to the generality to the foregoing, Regulations may be\nframed for, inter alia, the following, namely:__\n(a)     appointing, inducting, removing or regulating employees, officers, staff,\nconsultants or advisors of the Authority;\n(b)     terms and conditions of service for the employees, officers, staff, consultants or\nadvisors of the Authority;\n(c)     procedure for appointment of members of various committees, as well as the\nprocedure or conduct of such committees; and\n(d)     any other matter connected therewith or ancillary thereto."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Authority to be exempt from taxation",
      "content": "Notwithstanding anything contained in any other\nlaw, for a period of five years starting from the commencement of this Act, the Authority shall be\nexempt from the payment of income tax. For this purpose, the Federal Government may take all\nnecessary administrative measures, and pass all requisite orders, instructions or notifications."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Confidential Information",
      "content": "(1) Except as provided under the Rules made under this Act,\nno person shall communicate or allow to be communicated, any record or information obtained\npursuant to this Act, to a person not legally entitled to that record or information or allow any person\nnot legally entitled to that record or information to have access to any record obtained under this Act.\n(2) Any person who contravenes the provisions of this section, shall be punished in such\nmanner, as may be Prescribed."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Indemnity",
      "content": "No suit, prosecution or other legal or judicial proceedings shall lie against the\nGoverning Council, Authority, Managing Director, Secretary, members, employees, officers, members\nof the staff, experts, consultants or advisors of the Authority, in respect of anything done or purported\nto be done in good faith, under the provisions of this Act or the Rules and Regulations made hereunder."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Savings and Transition",
      "content": "Any existing contracts or arrangements of parties engaged in\nland port operations at land ports prior to the commencement of this Act shall continue till awarding\nof contracts or licenses under this Act by the Authority for such land ports:\nProvided that such transitory arrangements shall remain in force only for a period as deemed\nnecessary by the Authority in the interest of fostering free competition."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Act not to derogate",
      "content": "The provisions of this Act shall be in addition to and not in\nderogation of any law governing any Government Agencies involved in connections with the affairs\nof land port and in case of any conflict the provisions of this Act shall prevail."
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Removal of difficulty",
      "content": "If any difficulty arises in giving effect to any provision of this\nAct, the Federal Government may, give such directions, not inconsistent with the provisions of this\nAct, as deem appropriate.\nRGN.Dated.26-09-2025"
    }
  ],
  "definitions": [
    {
      "term": "Administrative Division",
      "definition": "the division to which the business of the Authority stands allocated;",
      "source_provision": "sec2"
    },
    {
      "term": "Adjudication Board",
      "definition": "the Adjudication Board established under section 38;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "the authority constituted under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "border control",
      "definition": "integrated systems and measures put in place to monitor and regulate the movement of people, vehicles and goods across land ports and to ensure the security of land ports and border crossing points in coordination with all relevant Government Agencies;",
      "source_provision": "sec2"
    },
    {
      "term": "border crossing point",
      "definition": "the territory or part of territory of border railway stations, border stations and any crossing point that allows for cross border movement of goods and passengers by road or rail as notified under the Customs Act, 1969 (IV of 1969) and under any other applicable law or rules for the time being inforce;",
      "source_provision": "sec2"
    },
    {
      "term": "Controller",
      "definition": "the Controller of the Management Board;",
      "source_provision": "sec2"
    },
    {
      "term": "goods",
      "definition": "any goods as defined under the Customs Act, 1969 (IV of 1969);",
      "source_provision": "sec2"
    },
    {
      "term": "Governing Council",
      "definition": "the Governing Council constituted under section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "Government Agencies",
      "definition": "the ministries, divisions, departments, authorities, law enforcement agencies, corporations and other instrumentalities of the respective Governments and shall include their officers and representatives;",
      "source_provision": "sec2"
    },
    {
      "term": "infrastructure",
      "definition": "infrastructure required for setting up cargo and passenger terminals, administration center, infrastructure for handling, storage and transportation of goods including warehouses, container depots, canopies and cargo complexes for storage and processing of goods, facilitation of passengers, cargo and passenger transport, information communication technology and for providing facilities including but not limited to power, water and any other utilities and infrastructure required for land port operation and giving effect to the provisions of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "land",
      "definition": "buildings and benefits arising out of land and things attached to the earth or permanently fastened to anything attached to the earth;",
      "source_provision": "sec2"
    },
    {
      "term": "land port",
      "definition": "any land customs station, border crossing point, or any area that provides or is intended to provide controlled entry into or departure from Pakistan of goods, vehicles and passengers with terminal services and facilities at the border, excluding seaports and airports as declared under section 18,",
      "source_provision": "sec2"
    },
    {
      "term": "land customs station",
      "definition": "any land customs station declared under the relevant provision of the Customs Act, 1969 (IV of 1969) for the clearance of goods or any class of goods imported or to be exported by land or inland waterways;",
      "source_provision": "sec2"
    },
    {
      "term": "land port operations",
      "definition": "the services and facilities for the handling, storage and transportation of goods, facilitation of passengers and vehicles, and any other services and facilities necessary for carrying out the operations of a land port as authorized and include such other operations as may be prescribed by Rules;",
      "source_provision": "sec2"
    },
    {
      "term": "land port operator",
      "definition": "the person or an organization holding a license or engaged under contractual agreement under this Act for carrying out land port operations;",
      "source_provision": "sec2"
    },
    {
      "term": "Managing Director",
      "definition": "the Chairperson of the Authority appointed under section 10;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "the members of the Governing Council, Authority or the Management Board, as the case may be;",
      "source_provision": "sec2"
    },
    {
      "term": "Management Board",
      "definition": "the Land Port Management Board constituted under section 20;",
      "source_provision": "sec2"
    },
    {
      "term": "Person",
      "definition": "an association of persons or joint-venture, whether incorporated or otherwise, undertaking, firm, public or private concern, company, corporation, department, organization, agency, authority, or a body corporate set up or controlled by the Federal Government, or as the case may, a Provincial Government;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by Rules or Regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "President",
      "definition": "president of the Governing Council;",
      "source_provision": "sec2"
    },
    {
      "term": "Regulations",
      "definition": "the regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Rules",
      "definition": "the rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Secretary",
      "definition": "the secretary of the Authority; and",
      "source_provision": "sec2"
    },
    {
      "term": "Service Provider",
      "definition": "all persons other than Government Agencies and land port operators that provide services at the land ports relating to food, catering, health, recreational facilities and other general amenities.",
      "source_provision": "sec2"
    }
  ]
}
