{
  "id": "pk-pakistan-madrasah-education-establishment-and-affiliation-of-model-dini-madaris-",
  "type": "statute",
  "title": "Pakistan Madrasah Education (Establishment and Affiliation of Model Dini Madaris) Board Ordinance, 2001",
  "title_en": "Pakistan Madrasah Education (Establishment and Affiliation of Model Dini Madaris) Board Ordinance, 2001",
  "short_name": "PMEAA",
  "status": "in_force",
  "issued_date": "2001-08-17",
  "in_force_date": "2001-08-17",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cp%2BUY2Jr-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Madrasah Education (Establishment and Affiliation of Model Dini Madaris) Board Ordinance, 2001 (XL of 2001) published by The Pakistan Code (Islamic/Religious Laws).",
  "provisions": [
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Removal of difficulties",
      "content": "THE PAKISTAN MADRASAH EDUCATION (ESTABLISHMENT AND\nAFFILIATION OF MODEL DINI MADARIS) BOARD ORDINANCE, 2001\nORDINANCE NO. XL OF 2001\n[18th August, 2001]\nAn\nOrdinance\nto enable the establishment of Model Dini Madaris to improve and secure uniformity of standards of\neducation and for the integration of the system of Islamic education imparted at dini madaris within\nthe general education system;\nWHEREAS it is expedient to provide for securing the registration, regulation, standardization\nand uniformity or curricula and standard of education of the dini madaris imparting specialized Islamic\neducation in Pakistan with the general education system in order to enable recognition of equivalence\nof the degrees, certificates and asnad awarded by such institutions and to regulate their examination\nsystem and the matters connected therewith or ancillary thereto;\nAND WHEREAS there is need that the Dini Madaris maintain their autonomous character and\nare better organized for the promotion of full-fledged, comprehensive and specialized Islamic Education\nalong with subjects of general education system;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the Fourteenth day of\nOctober, 1999, and the Provisional Constitution Order No. 1 of 1999, read with the Provisional\nConstitution (Amendment) Order No. 9 of 1999, and in exercise of all powers enabling him in that\nbehalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the\nfollowing Ordinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Ordinance, may be called the Pakistan\nMadrasah Education (Establishment and Affiliation of Model Dini Madaris) Board Ordinance, 2001.\n(2) It extends to the whole Pakistan.\n(3) It shall come into force on such date as the Federal Government may, by notification in the\nofficial Gazette, specify in this behalf and different dates may be so specified for different areas."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context,",
      "content": "(a)    “Academic council” means the Academic Council established under section 10;\n(b)    “affiliated dini madaris” means the dini madaris or darul ulooms which are\naffiliated with the Board;\n(c)    “Board” means Pakistan Madrassah Education Board, constituted under section\n3;\n(d)    “Controlling Authority” means the Chairman of the Board;\n(e)    “Dini Madaris” means religious educational institutions including Dini Madaris\nor Darul Ulooms established for the purpose of imparting Islamic Education with\nIslamic teachings and instructions as the principal competent of their curricula;\n(f)    “Federal Government” means the Ministry of Religious Affairs;\n(g)    “general education system” means the education system as recognized by the\nMinistry of Education, Government of Pakistan;\n(h)    “member” means the member of the Board;\n(i)    “Model Madrassah or Model Darul-Uloom” means a Madrassah or a Darul\nUloom established by or affiliated to the Board under this Ordinance;\n(j)    “Nazim or Sadr” means the Nazim or Sadr of a Wifaq or Tanzeem;\n(k)    “prescribed” means prescribed by rules or regulations made under this\nOrdinance;\n(l)    “qualifications” means any diploma, degree, sanad or other certificate in\nrecognition of having fully completed the necessary course of study or training\nas recognized by the Board;\n(m)    “regulations” means regulations made under this Ordinance;\n(n)    “rules” means rules made under this Ordinance;\n(o)    “students” means persons of any sex receiving education in a recognized or\nreputable religious institution of good standard; and\n(p)    “syllabii” means the curricula which shall comprise of Islamic Education as the\nmain component and shall also include subjects of the general education system\nas may be prescribed."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Board",
      "content": "(1) As soon as may be after the commencement of this\nOrdinance, the Federal Government shall, by notification in the official Gazette, establish a Board to be\nknown as the Pakistan Madrassah Education Board.\n(2) The Board shall be a body corporate having perpetual succession and a common seal with\npower, subject to the provisions of this Ordinance, to acquire, hold and dispose of property both\nmoveable and immovable, and may, by the said name, sue and be sued.\n(3) The headquarters of the Board shall be at Islamabad.\n(4) The Board may establish its regional offices as and where it considers necessary."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Composition of the Board",
      "content": "(1) The Board shall consist of the following members, to be\nappointed by the Federal Government, namely:—\n(i)    An educationist of eminence                                            Chairman\nSadr or nazim of a wafaq or tanzim or rabitah to be appointed       Vice/Chairman\n(ii)\nby the Federal Government in consultation with the Chairman.\n(iii)   an educationist having experience in administrative matters.           Secretary\nSecretary, Ministry of Education or his nominee not below the\n(iv)                                                                            Member\nrank of a Joint Secretary.\nSecretary, Ministry of Religious Affairs or his nominee not\n(v)                                                                             Member\nbelow the rank of a Joint Secretary.\nSecretary, Ministry of Science and Technology or his nominee\n(vi)                                                                            Member\nnot below the rank of a Joint Secretary.\nChairman, University Grants Commission or a Member\n(vii)                                                                           Member\nnominated by him.\ntwo Ulema who are or have been members of the Council of\n(viii) Islamic Ideology to be nominated by the Chairman.                        Members\nDirector General, Dawa Academy, International Islamic\n(ix)    University.                                                             Member\none Professor who is also a head of the Department of Islamic\n(x)     Studies in a University.                                                Member\n(xi)    Provincial Education Secretaries of all the four Provinces.            Members\n(xii)   one President or Nazim of Wifaqs                                       Members\none President or Nazim of Tanzim\n(xiii)                                                                           Member\n(xiv) one President or Nazim of Rabita                                           Member\nChairman, Inter-Board Co-ordination Committee (IBCC)\n(xv)                                                                            Member\ntwo representatives of the Ministry of Science and\n(xvi)                                                                           Members\nTechnology\n(2) A member, other than an ex officio member, unless earlier removed shall hold office during\nthe pleasure of the Federal Government\n(3) No person shall be appointed or continue to be a member of the Board if he has been declared\ninsolvent or is convicted of an offence involving moral turpitude or is declared disqualified from\nemployment in, or dismissed from, Government service.\n(4) No person, who has committed misconduct, directly or indirectly, or he himself or his\npartner has any share or interest in a contract with, by or on behalf of the Board or is in any employment\nunder, by or on behalf of the Board, shall be appointed or continue on the Board. On receipt of any\nsuch complaint against a member, the Board, after giving the member an opportunity of hearing, shall\ndecide the matter, and send its recommendation to the Federal Government for its approval. The\ndecision of the Federal Government shall be final."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Powers and functions of the Board",
      "content": "(1) The Board shall have powers to perform such\nfunctions and exercise such powers as are necessary or conducive to implement and achieve the\npurposes of this Ordinance.\n(2) Subject to the provisions of this Ordinance and with due regard to the autonomy of a Wifaq\nor Tanzeem or Rabita, the Board shall have the following powers and functions to perform:\n(a)    to establish such model madaris and model darul ulooms in which the Islamic\nEducation is the main component and includes courses and curricula of the\ngeneral education system as may be prescribed;\n(b)     to regulate and approve conditions for affiliation of such existing madaris as\nhave duly been recommended by the Academic Council;\n(c)     to approve the curricula, courses of study and conditions for holding of\nexaminations in the model dini madaris keeping in view the recommendations\nof the Academic Council;\n(d)     to organize teachers training programmes for the teachers of the model dini\nmadaris and dar-ul-ulooms in various social sciences and religious courses;\n(e)     to grant affiliation and to lay down the regulations and to approve conditions\nfor affiliation of existing madaris;\n(f)      to suggest ways and means to bridge the existing gulf between the general\neducation system and the madaris by revising and improving the curricula of\nMadaris and general education programs;\n(g)     to approve the curricula, courses of study and the conditions for holding of\nexaminations in the Dini Madaris on recommendations of the Academic\nCouncil;\n(h)     to appoint such officers and staff as it may consider necessary for the\nperformance of its functions and define their duties and lay down conditions of\nservice;\n(i)     to promote co-operation and co-ordination amongst existing Dini Madaris and\ntheir organizations;\n(j)     to approve equivalence of degrees, diplomas, sanads or certificates where\ncurricula includes subjects of the general education system;\n(k)     to promote curricular and extra curricula activities in Model Dini Madaris and\nModel Darul Ulooms;\n(l)     to inspect or arrange for inspection of a Model Dini Madrasah or Model Darul\nUloom with a view to improve the performance of such Madrasah or the Darul\nUloom;\n(m)    to institute and award scholarships, medals and prizes subject to such conditions\nas may be prescribed;\n(n)    to assist in the development of libraries of Dini Madaris;\n(o)    to approve the Annual Budget;\n(p)    to advise the Government in matters pertaining to model Dini Madaris;\n(q)     to prescribe minimum conditions for admission of candidates to the\nexaminations conducted by the Board and to print all educational material\nnecessary for improving the standard of education;\n(r)    to regulate and decide all administrative matters including creation and abolition\nof posts under the Board;\n(s)     to enter into or carry out or cancel any contract to administer, invest buy or sell\nany moveable or immoveable property and assets;\n(t)     to spend or incur expenditure as may be necessary for carrying out purposes of\nthis Ordinance;\n(u)     the Board may delegate any of its functions and powers to any member or officer\nof the Board or a committee or a sub-committee appointed by it\n(v)     to hear complaints, conduct enquiries and inspections and direct or\nrecommend measures for the improvement of any dini madaris established by\nor affiliated to the Board; and\n(w)     to exercise inter alia all powers as given in this Ordinance and to perform all\nother acts necessary for carrying out the purposes of this Ordinance."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Visitation. The Board may cause an inspection or inquiry to be made in respect of any matter",
      "content": "connected with the affairs of a Model Dini Madarsah or a Model Darul Uloom and shall from time to\ntime appoint such persons as it may deem fit for the purposes of carrying out such inspection or inquiry\nand to submit its report to the Board."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Meetings of the Board",
      "content": "(1) The meetings of the Board shall be called by the Chairman on\nsuch date, time and place as he may decide:\nProvided that not more than six months shall intervene between the two meetings of the Board\nand at least eight days written notice sent by registered post or courier shall be given to the members\nspecifying the agenda, date, time and place of the meeting.\n(2) The Chairman or, in his absence the Vice-Chairman, shall preside over the meetings of the\nBoard.\n(3) One half of the total members of the Board shall constitute a quorum for the meeting of the\nBoard, a fraction being counted as one.\n(4) The decision of the Board shall be taken by the majority of its members present and voting,\nand in case of a tie, the Chairman shall have a casting vote."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Chairman",
      "content": "(1) The Chairman of the Board shall be its principal executive officer and shall\npreside over the meetings of the Board.\n(2) The Chairman shall exercise such powers and perform such functions as may be assigned\nto him by the Board and shall be responsible for the proper running of the affairs of the Board.\n(3) In the absence of the Chairman, the Vice-Chairman shall exercise such powers and performs\nsuch functions as the Board may assign."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Secretary",
      "content": "(1) There shall be a Secretary of the Board who shall be a full time officer\nappointed by the Federal Government on such terms and conditions as it may determine.\n(2) The Secretary shall be the Administrative Officer of the Board and shall ensure subject to\nthe approval of the Chairman that the orders of the Board and the Chairman are carried out and shall\nexecute decisions for and on behalf of the Board. He shall also act as Secretary of the Academic\nCouncil.\n(3) The Secretary shall with the approval of the Chairman send notice of a meeting. The notice\nof the meeting and agenda shall be sent to every member of the Board by registered post or courier.\n(4) The Secretary shall ensure that all funds are spent for the purpose for which they are granted,\nallocated or authorized and shall prepare and submit annual statement of accounts and budget estimates\nfor the approval of the Board.\n(5) The Secretary shall maintain in minutes of the meetings of the Board and its records and\nperform such other duties and functions as may be assigned to him by the Board.\n(6) The Secretary shall also act as the Registrar of the Board and shall perform such functions\nas may be assigned to him in this connection by the Board."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Academic Council",
      "content": "(1) There shall be an Academic Council of the Board to advise and\nassist it in the performance of its functions.\n(2) The Council shall consist of the following members, to be appointed by the Board,\nnamely:__\n(1)    Chairman of the Board                                                           Chairman\n(2)    a representative of the Ministry of Education                                    Member\n(3)    a representative of the Ministry of Science and Technology                       Member\n(4)    Director General Research, Ministry of Religious Affairs, Zakat and Ushr         Member\n(5)    Chairman, Inter-Board Co-ordination Committee                                    Member\n(6)    two eminent scholars                                                            Members\n(7)    one eminent scientist                                                            Member\n(8)    one eminent educationist                                                         Member\n(3) The Academic Council shall be the Advisory Committee of the Board and shall, subject to\nteaching and instructions, syllabi and examinations for the model Dini Madaris and Darul Ulooms, for\nconsideration and approval by the Board."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Establishment and affiliation of dini madaris",
      "content": "(1) A Dini Madrassah or Darul Uloom\nmay apply for affiliation under section 12.\n(2) The Board may establish Model Dini Madaris and Model Darul Uloom for the purposes of\nthis Ordinance."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Affiliation",
      "content": "(1) Any institution (Dini darul uloom or dini madrassah) may apply to the\nBoard for affiliation in accordance with the procedure as the Board may prescribe.\n(2) The Board shall consider the application and may reject or grant affiliation on such terms\nand conditions as may be prescribed. The decision of the Board in any such matter shall be final."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Syllabii",
      "content": "(1) Every dini madrassah and dar-ul-uloom affiliated with the Board shall\nteach Islamic education as the main component and shall also include such subjects of general\neducation system as may be prescribed by the Board.\n(2) Where an affiliated dini madrassah or dar-ul-uloom contravenes the provisions of this\nOrdinance or any direction of the Board it may cancel the affiliation of such madrassah or dar-ul-\nuloom after giving the madrassah or Darul uloom as the case may be an opportunity of hearing."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Officers and servants of the Board to be public servants. The officers and servants of",
      "content": "the Board shall be deemed to be public servants within the meaning of section 21 of the Pakistan Penal\nCode(Act XLV of 1860)."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Officer and other staff. The Board may appoint such officers and staff as it may consider",
      "content": "necessary for carrying out the purposes of this Ordinance."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Delegation of powers. The Board may, by order in writing and subject to such conditions",
      "content": "as may be specified in the order, direct that any specific power or functions shall be exercisable by the\nChairman or a member of the Board for a specified period which shall not extend for more than six\nmonths at a time."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Fund",
      "content": "(1) There shall be established a fund to be known as Pakistan Madrasah Education\nFund to which shall be credited all income of the Board including income from endowments and grants\nfrom the Federal Government, the Provincial Government or other organization:\nProvided that any grant from an international agency shall not be accepted without sanction of\nthe Federal Government.\n(2) The funds of the Board may be used to finance the programme and activities of the model\ndarul uloom and model dini madaris established by or affiliated to the Board."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Accounts and audit",
      "content": "(1) The Board shall maintain complete and accurate books of\naccounts of its actual expenses and receipts and annually submit its report to the Federal Government.\n(2) The Board shall cause to be carried out audit of its accounts by one or more auditors who\nare chartered accountants within the meaning of the Chartered Accountants Ordinance, 1961 (X of\n1961), appointed by the Federal Government in consultation with the Auditor-General of Pakistan\nfrom a penal of chartered accountants proposed by the Board on such remuneration as the Federal\nGovernment may determine and annually submit its audited accounts to the Auditor General of\nPakistan."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Indemnity. No suit, prosecution or other legal proceeding shall lie against the Chairman,",
      "content": "any member of the Board or a committee thereof or an officer or employee of the Board, in respect of\nanything in good faith done or purported to have been done under this Ordinance or regulation made\nthereunder."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Power to make rules",
      "content": "(1) The Board may, in consultation with the Federal\nGovernment, by notification in the official Gazette, make rules for carrying out the purposes of this\nOrdinance.\n(2) Without prejudice to the generally of the powers conferred by sub-section (1), such rules\nmay provide for all or any of the following matters, namely:__\n(a)    finances;\n(b)    general administration;\n(c)    management of assets and matters ancillary thereto; and\n(d)    such other matters as may be necessary for giving the effect to the provisions of\nthis Ordinance,"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Power to make regulations",
      "content": "(1) The Board may, by notification in the official Gazette,\nmake regulations for carrying out the purposes of this Ordinance.\n(2) Without prejudice to the generally of the foregoing powers, such regulations may provide\nfor all or any of the following matters, namely:__\n(a)    constitution of the committees, the appointment of the employees of the Board\nand their terms and conditions of service;\n(b)     matters relating to pension and provident fund for the benefit of the employees\nof the Board;\n(c)    admission, curricula, conduct of courses of study, quality institutions, regulation\nof examination and award of degrees and matters ancillary thereto; and\n(d)    such other matters as may be necessary for giving effect to the provisions of this\nOrdinance."
    }
  ],
  "definitions": [
    {
      "term": "Academic council",
      "definition": "the Academic Council established under section 10;",
      "source_provision": "sec2"
    },
    {
      "term": "affiliated dini madaris",
      "definition": "the dini madaris or darul ulooms which are affiliated with the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "Pakistan Madrassah Education Board, constituted under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Controlling Authority",
      "definition": "the Chairman of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "Dini Madaris",
      "definition": "religious educational institutions including Dini Madaris or Darul Ulooms established for the purpose of imparting Islamic Education with Islamic teachings and instructions as the principal competent of their curricula;",
      "source_provision": "sec2"
    },
    {
      "term": "Federal Government",
      "definition": "the Ministry of Religious Affairs;",
      "source_provision": "sec2"
    },
    {
      "term": "general education system",
      "definition": "the education system as recognized by the Ministry of Education, Government of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "the member of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "Model Madrassah or Model Darul-Uloom",
      "definition": "a Madrassah or a Darul Uloom established by or affiliated to the Board under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "Nazim or Sadr",
      "definition": "the Nazim or Sadr of a Wifaq or Tanzeem;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules or regulations made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "qualifications",
      "definition": "any diploma, degree, sanad or other certificate in recognition of having fully completed the necessary course of study or training as recognized by the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "students",
      "definition": "persons of any sex receiving education in a recognized or reputable religious institution of good standard; and",
      "source_provision": "sec2"
    },
    {
      "term": "syllabii",
      "definition": "the curricula which shall comprise of Islamic Education as the main component and shall also include subjects of the general education system as may be prescribed.",
      "source_provision": "sec2"
    }
  ]
}
