{
  "id": "pk-pakistan-maritime-shipping-transfer-of-managed-establishments-ordinance-1980",
  "type": "statute",
  "title": "Pakistan Maritime Shipping (Transfer of Managed Establishments) Ordinance, 1980",
  "title_en": "Pakistan Maritime Shipping (Transfer of Managed Establishments) Ordinance, 1980",
  "short_name": "PMSOM",
  "status": "in_force",
  "issued_date": "1980-06-21",
  "in_force_date": "1980-06-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cpuc-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Maritime Shipping (Transfer of Managed Establishments) Ordinance, 1980 (XXII of 1980) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Power to make rules",
      "content": "THE PAKISTAN MARITIME SHIPPING (TRANSFER OF MANAGED\nESTABLISHMENTS) ORDINANCE, 1980\nOrdinance No. XXII of 1980\n[22nd June, 1980]\nAn Ordinance to provide for the transfer of certain managed establishments relating to maritime\nshipping.\nWHEREAS it expedient to provide for the transfer of certain managed establishments\nrelating to maritime shipping and matters connected therewith or ancillary thereto ;\nAND WHEREAS the President is satisfied that circumstances exist which render it\nnecessary to take immediate action ;\nNOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, read\nwith the Laws (Continuance in Force) Order, 1977 (C.M.L.A. Order No. J of 1977), and in exercise\nof all powers enabling him in that behalf, the President is pleased to make and promulgate the\nfollowing Ordinance :—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Ordinance may be called the Pakistan\nMaritime Shipping (Transfer of Managed Establishments) Ordinance, 1980.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Interpretation.Words and expressions used in this Ordinance shall, unless there is",
      "content": "anything repugnant in the subject or context, have the same meaning as in the Pakistan Maritime\nShipping (Regulation and Control) Act, 1974, hereinafter referred to as the said Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Ordinance to override other laws.This Ordinance shall have effect notwithstanding",
      "content": "anything contained in the said Act or any other law for the time being in force or in any agreement,\ncontract, memorandum or articles."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Transfer of shares and proprietary interests",
      "content": "(1) The Federal Government may, if it\nconsiders necessary in the national interest so to do, through a public notice offer to transfer the\nshares or proprietary interests in respect of a managed establishment acquired by it under section 5 of\nthe said Act, to the persons specified, and on the terms set out, in the Schedule :\nProvided that, in the case of a managed establishment of which persons who are not citizens\nof Pakistan are also shareholders, the Federal Government may transfer the shares of such\nestablishments to its shareholders in accordance with the terms of an agreement reached between the\nFederal Government and the previous management of such establishment.\n(2) If the offer made under sub-section (1) is not accepted by any person within a period of\ntwenty-one days the Federal Government may retain the shares or proprietary interest offered to such\nperson or dispose of them in any manner it may deem fit and such person shall have no right\nwhatsoever in respect of such shares or proprietary interests.\n(3) Upon the acceptance of the offer to transfer proprietary interests in the case of a managed\nestablishment which is not a company, the Federal Government shall transfer the proprietary\ninterests to the company or other person from whom the proprietary interests were acquired under\nsection 5 of the said Act.\n(4) Upon the acceptance of the offer to transfer shares in a managed establishment which is a\ncompany or an establishment owned by a company, the Federal Government shall transfer the shares\nacquired by it under section 5 of the said Act in the names of the persons who have accepted the\noffer and the said transfer shall be recorded in the register of members of the company."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Election of Board of Directors. Within sixty days of the issue of the public notice under",
      "content": "sub-section (1) of section 4 in respect of a managed establishment which is a company or, in the case\nof a managed establishment referred to in the proviso to that sub-section, of the transfer of shares, an\nextraordinary general meeting of the company shall be held for the purpose of electing the Board of\nDirectors of the company in accordance with the Companies (Managing Agency and Election of\nDirectors) Order, 1972."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Transfer of Management",
      "content": "(1) Upon the election of the Board of Directors under section\n5 in the case of a managed establishment which is a company, and upon the transfer of a proprietary\ninterests under sub-section (3) of section 4 in the case of a managed establishment which is not a\ncompany, the Federal Government shall cancel the orders made by it under sub-section (1) of section\n6 and sub-section (3) or sub-section (4) of section 13 of the said act in respect of the managed and\nestablished.\n(2) Upon the issue of an order under sub-section (1) in respect of a managed establishment,\nthe administration of the affairs of the establishment shall, subject to the rules made under this\nOrdinance, stand transferred—\n(a)     to the Board of Directors, in the case of an establishment which is a company ;\n(b)     to the company, in the case of an establishment owned by a company ; and\n(c)     to the person or body in whom the management of the establishment vested\nimmediately before the appointment of a Managing Director in respect\nthereof, in the case of any other establishment.\n(3) Where the Federal Government cancels, in pursuance of sub-section (1), an order made by\nit under sub-section (3) or sub-section (4) of section 13 of the said Act in respect of a managed estab-\nlishment which is a company, the Federal Government may, by order, make such provision for the\nadjustment or reduction of the share capital of the corporation to which the order under the said sub-\nsection (3) or sub-section (4) of section 13 relates as it may deem fit."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Audit",
      "content": "(1) The Federal Government may at any time appoint one or more firms of\nauditors for carrying out a special audit of any establishment with such terms of reference as the\nFederal Government may determine.\n(2) The remuneration to be. Paid to the auditors appointed under sub-section (1) shall be paid\nby the establishment.\n(3) If, after a firm of auditors has been appointed under sub-section (1) in respect of a\nmanaged establishment, an order is issued under sub-section (1) of section 6 in respect of that\nmanaged establishment and the audit of the said managed establishment is still in progress, the firm\nof auditors shall continue the work of audit until it is complete and the report submitted by the firm\nhas been accepted by the Federal Government.\n(4) The audited accounts prepared in pursuance of subsection (1) and accepted by the Federal\nGovernment shall not be challenged by the establishment or the shareholders or any other person and\nshall be accepted by them."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. No claim of compensation. No establishment, and no shareholder of an establishment,",
      "content": "shall make any claim of any sort nor a claim for compensation of any nature whatsoever against the\nFederal Government or a corporation set up by the Federal Government or against any officer of the\nFederal Government or of such Corporation, after an order under sub-section (1) of section 6 has\nbeen issued in respect of that establishment."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Employees to continue in service. All persons employed in, by or for the purpose of",
      "content": "business of an establishment in respect of which an order under sub-section (1) of section 6 is issued\nshall continue in such employment on the same terms and conditions as were applicable to them\nimmediately before the issue of such order."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Contracts and agreement to continue. All contracts and agreements made by an",
      "content": "establishment in respect of which an order is issued under sub-section (1) of section 6 which may be\nsubsisting immediately before the issue of such order shall continue to be of full force and effect\nagainst or in favour of the establishment and may be enforced or acted upon accordingly."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Removal of difficulties. If any difficulty arises in giving effect to any of the provisions of",
      "content": "this Ordinance, the Federal Government may make Such order, not inconsistent with the provisions\nof this ordinance, as may appear to it to be necessary for the purpose of removing the difficulty."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Bar of Jurisdiction",
      "content": "(1) No court shall call in question or permit to be called in\nquestion any provision of this Ordinance or of any rule or order made or anything done or any action\ntaken thereunder.\n(2) No court shall grant any injunction, or make any order, nor shall any court entertain any\nproceedings, in relation to anything in good faith done or intended to be done under this Ordinance."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Penalties",
      "content": "(1) Whoever obstructs or resists or hinders any person in the discharge of his\nduties under this Ordinance shall be punishable with rigorous imprisonment for a term which may\nextend to three years, or with fine, or with both.\n(2) No court shall take cognizance of an offence punishable under sub-section (1) except\nupon a complaint in writing made by, or under the authority of, the Federal Government."
    }
  ],
  "definitions": []
}
