{
  "id": "pk-pakistan-medical-and-dental-council-ordinance-pmdc-1962-repealed-by-act-no-xxxii",
  "type": "statute",
  "title": "Pakistan Medical And Dental Council Ordinance (PMDC), 1962 (Repealed by Act no. XXXIII of 2020 section 50 (w.e.f 22-09-2020)",
  "title_en": "Pakistan Medical And Dental Council Ordinance (PMDC), 1962 (Repealed by Act no. XXXIII of 2020 section 50 (w.e.f 22-09-2020)",
  "short_name": "PMADC",
  "status": "repealed",
  "issued_date": "1962-06-04",
  "in_force_date": "1962-06-04",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJ6Y-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Medical And Dental Council Ordinance (PMDC), 1962 (Repealed by Act no. XXXIII of 2020 section 50 (w.e.f 22-09-2020) (XXXII of 1962) published by The Pakistan Code (Health/Medical Laws).",
  "provisions": [
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Incorporation of the Council. The Council constituted under section 3 shall be a body",
      "content": "corporate by the name of the 2[Medical and Dental Council], having perpetual succession and a\ncommon seal, with power to acquire and hold property both movable and immovable, and to contract,\nand shall by the said name sue and be sued.\n1 Subs. by Act No. XIX of 2012, ss.5 and 6.\n2 Subs. by Medical Concil (Amdt.) Act, 1973 (10 of 1973), s.5, for \"Medical Council\".\n1[The Council shall be a regulatory body for regulating medical and dental profession, medical\nand dental education and institutions,].\n1[7. Terms of office.—(1) The President of the Council shall hold office for a term not exceeding\nfour years and not extending beyond the expiry of his term as member of the Council.\n(2) Subject to the provisions of sub­Sections (4) and (6), a member shall hold office for a term of\nfour years from the date of his nomination or election or until his successor has been duly nominated\nor elected, whichever is earlier.\n(3) If a member fails to attend three consecutive meetings of the Council or remains out of\nPakistan for a continuous period exceeding one year or, in the case of an elected member, ceases to\nrepresent his electoral college, he shall cease to be the member of the Council. A person shall\nthereupon be nominated or, as the case may be, elected to fill the vacancy:\nProvided that a member nominated by the Federal Government shall hold office only during\npleasure of the Federal Government. If a nominated member is being considered for cancellation of\nmembership while his term remains, he shall be given a notice to show­cause and an opportunity of\npersonal hearing by the Federal Government before a final order is passed. The Federal Government's\nnominees shall not be eligible for the post of President.\n(4) The case of a member of the Council, other than the member nominated under clauses (a), (b)\nand (o) of sub­section (1) of Section 3, shall be forwarded to the Federal Government for decision of\nmaintaining his membership or otherwise in the following circumstances, namely:­\n(a) if the Council decides by a majority that his membership is not in the interest of the\nCouncil; or\n(b) his name has been removed from the Register of practitioners as a result of inquiry under\nSection 31; or\n(c) he becomes insane or is declared an insolvent by a competent Court; of__\n(d) he is convicted for a criminal offense which implies moral turpitude, including\nunprofessional and infamous conduct as provided under Section 31.\n(5) Other than the member nominated under clauses (a), (b), (m) and (o) of sub­section (1) of\nSection 3, the Council may, only by a majority decision, suspend the membership of a member if he\nfalls under sub section (4) till a decision by the Federal Government about maintenance of his\nmembership or otherwise.\n(6) Where the said term of four years is about to expire in respect of any member, his successor\nmay be nominated or elected at any time within three months before the said term expires, but shall\nnot assume office until the expiry of the said term.\n(7) An elected or nominated member may, at any time, resign his membership by writing under\nhis hand addressed to the President and the seat of such member shall be deemed to have fallen\nvacant from the date of acceptance of his resignation by the President.\n1 Added and subs. by Act No. XIX of 2012, ss.7 and 8.\n(8) A vacancy in the Council shall be filled through election or nomination, as the case may be,\nand the person elected or nominated to fill the vacancy shall hold office for the full term of four\nyears.]."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Meeting of the Council",
      "content": "_(1) The Council shall meet at least once in each year at such time\nand place as may be 1[decided by the President].\n(2) Until otherwise provided by Regulation, 1[one­third] members of the Council shall form a\nquorum, and all of the acts of the Council shall be decided by a majority of the members present and\nvoting."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Officers, Committees and servants of the Council.­(1) The Council shall­",
      "content": "(a) elect from amongst its members a Vice­President ;\n(b) constitute from amongst its members an Executive Committee, and such other\nCommittees for general or special purposes as the Council deems necessary to carry out\nthe purposes of this Ordinance ;\n1[(c) appoint a Registrar, a Secretary and a Treasurer to carry out the purposes of this\nOrdinance;\n(d) appoint, employ or nominate such other advisers to the President, officers, officials and\nservants on regular basis or contract as the Council deems necessary to carry out the\npurposes of this Ordinance;\n(e) require the Treasurer to take from the Registrar, Secretary, advisers to the President,\nofficers, officials and servants, such security for the due performance of their duties as\nthe Council deems necessary; and\n(f) fix the remuneration and allowances to be paid to the President, Vice­President, members,\nofficers and servants of the Council employed under this section.].\n(2) All persons appointed or employed under this section shall be deemed to be public servants\nwithin the meaning of section 21 of the Pakistan Penal Code (Act XLV of 1860).\n1[10. Executive Committee.—(1) The Executive Committee shall consist of nine members, of\nwhom seven shall be elected by the Council from amongst its members and of which at least one shall\nbe a dental practitioner and one from the post graduate institutions. The President shall have the\npower to co­opt a maximum of two additional members to the Committee.\n(2) The President: Vice­president of the Council shall be ex­officio members of the Executive\nCommittee and shall be its President and Vice­president respectively.\n(3) In addition to the power and duties conferred and imposed upon it by this Ordinance, the\nExecutive Committee shall exercise and discharge such powers and duties as the Council may confer\nupon it by regulations and shall have the power and responsibility to take decisions of administrative\nand financial nature for the smooth functioning and working of the Council.].\n1 Subs. by Act No. XIX of 2012, ss. 9, 10 and 11.\n1[11. Recognition of medical institutions and qualifications.—(1) The Federal Government may grant\nrecognition to any medical institution in Pakistan which trains or grants or both trains and grants medical\nqualifications and the qualifications granted by them. All such recognized medical institutions or qualifications\nshall be included in the First Schedule by the Federal Government by notification in the official Gazette.\n(2) if any medical institution in Pakistan intends to get recognition of the institution which trains or grants\nor both trains and grants medical qualifications or qualification granted by it in pursuance of sub­section (1) it\nshall apply to the Federal Government for the same.\n(3) The Federal Government shall transmit the application to the Council after being satisfied that\napplication is complete and is in accordance with the prescribed procedure. The Council shall form\nrecommendations for the Federal Government after assessing the institution and the qualification as per\nprescribed procedure. Upon receiving recommendations from the Council, the Federal Government shall grant\nrecognition as provided under sub­section (1).\n(4) The notification for the grant of recognition may also direct that an entry shall be made in the last\ncolumn of the First Schedule against such institution and medical qualification granted by it, declaring that it\nshall be a recognized medical institution or qualification only when granted after the date of notification.].\n1[11A. Recognition of hospitals or institutions for house job or internship or foundation year\ntraining.—(1) The Federal Government may grant recognition to any hospitals or institutions in Pakistan which\ntrain for house job or internship or foundation year. All such recognized hospitals or institutions shall be\nincluded in the Sixth Schedule by the Federal Government by notification in the official Gazette.\n(2) If any hospital and institution in Pakistan intends to get recognition of the institution which trains for\nhouse job, internship or foundation year in pursuance of sub­section (1), it shall apply to the Federal\nGovernment for the same.\n(3) The Federal Government shall transmit the application to the Council after being satisfied that\napplication is complete and is in accordance with the prescribed procedure. The Council shall form\nrecommendations for the Federal Government after assessing the institution as per prescribed procedure. Upon\nreceiving recommendations from the Council, the Federal Government shall grant recognition as provided under\nsub­section (1).\n(4) The notification for the grant of recognition may also direct that an entry shall be made in the last\ncolumn of the Sixth Schedule against such hospital or institution, declaring that it shall be a recognized hospital\nor institution only when granted after the date of notification.].\n2*                *                *                 *   *         *        *\n2[13. Arrangements for schemes with foreign countries. At any time, the Council may enter into\nnegotiations with the appropriate authority in any foreign country or organization, for the settling of a scheme\nfor improvement of medical education in Pakistan or postgraduate degrees or any matter or prospect related to\nthe medical or dental profession.].\n3*                *                *                 *   *         *        *\n1 Subs. and Ins. by Act No. XIX of 2012, ss.12 and 13.\n2 Omitted and subs. by Act No. XIX of 2012, ss.14 and 15.\n3 Omitted by Act No. XIX of 2012, s.16.\n1[15. Power of the Council to certify certain persons to be possessed of sufficient medical\nqualifications.—(1) If, after an examination by a board constituted by the Council, the Council is\nsatisfied that a person holding a qualification granted by a medical institution outside Pakistan, is\npossessed of sufficient knowledge and skill to be registered as a practitioner for the purpose of this\nOrdinance, it may recommend to the Federal Government to issue a notification in favour of such\nperson to register him and his qualification. Upon such notification, the Council shall register the\nqualification possessed by the person without it being entered in any of the Schedules of this\nOrdinance.\n(2) The Council shall register the qualification granted by a medical institution outside Pakistan,\npossessed by the person by maintaining a separate list in the Register.].\n1[16. Additional medical or dental qualifications.—(1) The Federal Government may grant\nrecognition to any post­graduate medical or dental institutions in or outside Pakistan which train or\ngrant or both train and grant additional medical or dental qualifications and the qualifications granted\nby them. All such recognized additional medical or dental institutions or qualifications shall be\nincluded in the Third Schedule by the Federal Government by notification in the official Gazette.\n(2) If any post­graduate medical and dental institution in or outside Pakistan intends to get\nrecognition of the institution which trains or grants or both trains and grants additional medical and\ndental qualifications or qualification granted by it in pursuance of sub­section (1) it shall apply to the\nFederal Government for the same. If an institution wishes to only train for a recognized postgraduate\nqualifications in any specialty, it shall apply to the qualification awarding body and after consultation\nand approval of the Council, the institution shall be added in the Third Schedule.\n(3) The Federal Government shall transmit the application to the Council after being satisfied that\napplication is complete and is in accordance with the prescribed procedure. The Council in\nconsultation with the examining body shall form recommendations for the Federal Government after\nassessing the institution and the qualification as per prescribed procedure. Upon receiving\nrecommendations from the Council, the Federal Government shall grant recognition as provided\nunder sub­section (1).\n(4) The notification for the grant of recognition may also direct that an entry shall be made in the\nlast column of the Third Schedule against such institution and additional medical and dental\nqualification granted by it, declaring that it shall be a recognized post­graduate medical and dental\ninstitution and additional medical and dental qualification only when granted after the date of\nnotification.].\n2[16­A. Recognition of foreign additional medical or dental qualifications.—The Council shall\nevaluate any additional medical or dental qualifications granted by any foreign institution and may—\n1 Subs. by Act No. XIX of 2012, ss. 17 and 18.\n2 Ins. by Act No. XIX of 2012, s.19.\n(a) recommend to the Federal Government that such institution or qualification be—\n(i) recognized and included in the Third Schedule as specified in Section 16; or\n(ii) notified only and shall not be included in the Third Schedule, however, a separate list\nthereof shall be maintained; or\n(b) proceed as per Section 15 or 19, as the case may be.\n16­B. Recognition of continuous professional development opportunity providers.—(1) The\nFederal Government may grant recognition to any organization in Pakistan, which provides\nopportunities of continuous professional development to the registered medical and dental\npractitioners. All such recognized organizations shall be included in the Seventh Schedule by the\nFederal Government by notification in the official Gazette.\n(2) If any organization in Pakistan, which provides opportunities of continuous professional\ndevelopment to the registered medical and dental practitioners, intends to get recognition of the\norganization in pursuance of sub­section (1) it shall apply to the Federal Government for the same.\n(3) The Federal Government shall transmit the application to the Council after being satisfied that\napplication is complete and is in accordance with the prescribed procedure. The Council shall form\nrecommendations for the Federal, Government after assessing the institution and the qualification as\nper prescribed procedure. Upon receiving recommendations from the Council, the Federal\nGovernment shall grant recognition as provided under sub­section (1), declaring that it shall be a\nrecognized organization in Pakistan, which provides opportunities of continuous professional\ndevelopment to the registered medical and dental practitioners only when granted after the date of\nnotification.\n(4) A separate list of international continuous professional development opportunities providing\norganization or institutes shall be maintained by the Council.\n16­C. Role of specialists' boards.—(1) The Federal Government may grant recognition to\nspecialists boards which shall help the Council in maintenance of such minimum standards of\nproficiency in that particular specialty as may be prescribed by the Council. All recognized specialists\nboards shall be included in the Eighth Schedule by the Federal Government by notification in the\nofficial Gazette.\n(2) The Council shall authorize a specialist board constituted as per prescribed procedures and\nshall form recommendations for the Federal Government. Upon receiving recommendations from the\nCouncil, the Federal Government shall grant recognition as provided under sub­section (1), declaring\nthat it shall be a recognized specialists board only when granted after the date of notification.].\n1*                 *                *         *   *      *        *\n2[18. Recognition of dental institutions and qualifications.—(1) The Federal Government may\ngrant recognition to any dental institutions in Pakistan which train or grant or both train and grant\ndental qualifications and the qualifications granted by them. All such recognized dental institutions or\nqualifications shall be included in the Fifth Schedule by the Federal Government by notification in the\nofficial Gazette.\n(2) If any dental institution in Pakistan intends to get recognition of the institution which trains or\ngrants or both trains and grants dental qualifications or qualification granted by it in pursuance of sub­\nsection (1) it shall apply to the Federal Government for the same.\n(3) The Federal Government shall transmit the application to the Council after being satisfied that\napplication is complete and is in accordance with the prescribed procedure. The Council shall form\nrecommendations for the Federal Government after assessing the institution and the qualification as\nper prescribed procedure. Upon receiving recommendations from the Council, the Federal\nGovernment shall grant recognition as provided under sub­section (1).\n(4) The notification for the grant of recognition may also direct that an entry shall be made in the\nlast column of the Fifth Schedule against such institution and dental qualification granted by it,\ndeclaring that it shall be a recognized dental institution and dental qualification only when granted\nafter the date of notification.].\n2[19. Power of the Council to certify certain persons to be possessed of sufficient dental\nqualifications.—(1) If after an examination by a board constituted by the Council, the Council is\nsatisfied that a person holding a qualification granted by a dental institution outside Pakistan, is\npossessed of sufficient knowledge and skill to be registered as a practitioner for the purpose of this\nOrdinance, it may recommend to the Federal Government to issue a notification in favour of such\nperson to register him and his qualification. Upon such notification, the Council shall register the\nqualification possessed by the person without it being entered in any Schedule of this Ordinance.\n(2) The Council shall register the qualification granted by a dental institution outside Pakistan,\npossessed by the person by maintaining a separate list in the register.].\n2[20. Power to acquire information as to courses of study and examination. Every medical or\ndental institution or hospital or organization in Pakistan recognized under this Ordinance, which trains\nfor or grants or both trains for and grants a medical or a dental qualification, additional medical or\ndental qualification, trains for house job or internship or foundation year or is a continuous\nprofessional development opportunity provider shall furnish such information as the Council may,\nfrom time to time, require about the facilities and faculty available in the institution, courses of study\nand processes of admission of the institution concerned, examinations required to be undergone prior\nto such qualifications being conferred and generally as to the requisites for obtaining such\nqualifications.].\n1 Omitted by Act No. XIX of 2012, s.20.\n2 Subs. by Act No. XIX of 2012, ss. 21, 22 and 23.\n1[21. Inspection.—(1) The Executive Committee shall approve a list of inspectors in the country and the\nPresident shall commission such number of medical or dental inspectors from the approved list, as it may deem\nappropriate, to inspect the facilities for training available at the medical or dental institutions and attend at any\nor all of the examinations held by medical or dental institutions in Pakistan recognized under this Ordinance for\nthe purpose of granting recognized medical or dental or additional medical or denial qualifications.\n(2) Inspectors appointed under this section shall form a comprehensive report about the facilities for\ntraining in the institution and shall not interfere with conduct of any examination and shall report to the\nExecutive Committee on the standard of the inspected examination which they attend and on the courses of\nstudy and facilities for teaching provided by the medical or dental institution inspected for different stages\nleading up to examinations and on any other matters in regard to which the President or Executive Committee\nmay require them to report.\n(3) The Executive Committee shall forward a copy of any such report to the medical or dental institution\nconcerned and shall also forward a copy, with the remarks of such medical or dental institution thereon, to the\nCouncil.].\n1[22. Withdrawal of recognition.—(1) If a recognized institution is violating provisions of this Ordinance\nand regulations made thereunder or the facilities for training for the courses of study or standard of examination\nin the institution to obtain a recognized medical or dental qualification, additional medical or dental\nqualification, training for house job or internship or foundation year or in a continuous professional\ndevelopment opportunity providing organization has deteriorated to an extent that the standard of proficiency\nrequired from candidates at any examination held for the purpose of granting such qualification is not such as\nto secure to persons holding such qualification the knowledge and skill requisite for the efficient practice of\nmedicine or dentistry, the Council may stop further intake of students in the institution and forward a summary\nof its findings and its intent to the medical or dental institution with an intimation of the period within which the\nmedical or dental institution may submit its explanation to the Council and may request for a hearing before the\nCouncil if it so desires.\n(2) If the Council is not satisfied with the explanation then it shall make a recommendation to the Federal\nGovernment for closure of the institution to which shall include a scheme for adjustment of students in other\nrecognized institutions of the corresponding public or private sector, as the ease may be.\n(3) On recommendations of the Council, the Federal Government may, by notification in the official\nGazelle, direct that an entry shall be made in the First, Third, Fifths Sixth or Seventh Schedule, as the case may\nbe, against the said medical or dental or a postgraduate institution and qualification granted by it, hospital or\ncontinuous professional development opportunity provider declaring that, it shall be a recognized medical,\ndental or additional medical or dental qualification, institution, hospital and continuous professional\ndevelopment opportunity provider only before the date of notification.].\n2[22­A. Establishment and running of medical and dental institutions without recognition.—No\nperson shall run nor establish any institution for training or grant or both training or grant of medical or dental\nqualifications, additional medical or denial education, training for house job, internship or foundation year or an\norganization for continuous professional development opportunity providing neither shall any university grant\naffiliation to any such an institution nor any such institution shall award any degree unless recognition has been\ngranted to such college or institution under this Ordinance.\n1 Subs.by Act No. XIX of 2012, ss. 24 and 25.\n2 Ins. by Act No. XIX of 2012, s. 26.\n22­B. Penalty.___(1) Whoever runs or establishes or endorses any institution or advertises\nadmissions in an institution for imparting education in medicine or dentistry, which is not recognized\nunder Sections 11, 11­A, 16, 16­A or 18 or in respect of which recognition has been withdrawn under\nSection 22, shall be guilty of an offence punishable with rigorous imprisonment for a term which may\nextend to five years but shall not be less than a year or with fine which may extend to ten million\nrupees but shall not be less than five million rupees or with both and shall also be liable to closure of\nsuch institution.\n(2) Where any contravention of this Ordinance has been committed by a body corporate or\ninstitution and it appears from the relevant documents that such offence has been committed with the\nconsent or connivance of or is attributed to any negligence on the part of any director, partner,\nmanager, secretary or other officer of the body corporate or institution such director, partner,\nmanager, secretary or other officer of the body corporate or institution, shall be deemed guilty of such\ncontravention along with the body corporate or institution and shall be punished accordingly:\nProvided that in the case of a company as defined under the Companies Ordinance, 1984 (XLVII\nof 1984), only its Chief Executive shall be liable under this section.\nExplanation.—For the purposes of this section, \"body corporate or institution\" includes a firm,\nassociation of persons and a society registered under the Societies Registration Act, 1860 (XXI of\n1860) or under the Co­operative Societies Act, 1925 (VII of 1925).\n(3) Where any contravention of this Ordinance has been committed by any Government agency,\nlocal authority or local council and it appears from the relevant documents that such contravention\nhas been committed with the consent or connivance of or is attributable to any negligence on the part\nof the head or any other officer of the Government agency, local authority or local council, such head\nor other officer shall also be deemed guilty of such contravention alongwith the Government agency,\nlocal authority or local council and shall be liable to be proceeded against and punished accordingly.].\n1[23. Maintenance of Register of medical practitioners.—(1) The Council shall maintain a\nRegister of medical practitioners possessing qualifications which are recognized medical or additional\nmedical qualifications for the purposes of this Ordinance and may prescribe the necessary particulars\nto be entered in the Register. Holders of a recognized basic degree shall be registered on provisional\nbasis for internship or foundation or house job of a minimum of one year duly assessed, hands on\nclinical rotation in an approved hospital or institution included in the Sixth Schedule which shall be\nmandatory for conversion of provisional registration into full registration.\n(2) The practitioner shall be deemed to hold a valid registration and entitled to be known and\neligible for privileges of a registered medical practitioner if his name is retained on the Register after\nfulfillment of requirements of continuation of registration as laid down by the Council from time to\ntime and provided he had paid the dues of the Council. The valid registration certificate shall be the\nlicence to practice medicine in Pakistan.].\n1 Subs. by Act No. XIX of 2012, s.27.\n1*                 *                *    *   *      *        *\n1*                 *                *    *   *      *        *\n2[26. Maintenance of Register of dental practitioners.—(1) The Council shall maintain a Register\nof dental practitioners possessing qualifications which are recognized dental or additional dental\nqualifications for the purposes of this Ordinance and may prescribe the necessary particulars to be\nentered in the Register. Holders of a recognized basic degree shall be registered on provisional basis\nfor internship or foundation or house job of a minimum of one year duly assessed, hands on clinical\nrotation in an approved hospital or institution included in the Sixth Schedule which shall be\nmandatory for conversion of provisional registration into full registration.\n(2) The practitioner shall be deemed to hold valid registration and entitled to be known and eligible\nfor privileges of a registered dental practitioner if his name is retained on the Register after fulfillment\nof requirements of continuation of registration as laid down by the Council from time to time and\nprovided he had paid the dues of the Council. The valid registration certificate shall be the licence to\npractice dentistry in Pakistan.]."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Registers to be public documents. The Register maintained under section 23 or section 26",
      "content": "shall be deemed to be public document within the meaning of the 2[Qanun­e­Shahadat, 1984 (P.O.\nNo. 10 of 1984).]\n3[28. Penalty for fraudulent representation or registration. Whoever falsely pretends to be\nregistered under this Ordinance as a medical practitioner or dentist and uses with his name or title any\nwords or letters representing that he is so registered with the Council or uses the word \"doctor\"\nwithout legal basis, irrespective of whether any person is actually deceived by such pretence or\nrepresentation or not, shall, on conviction before a Magistrate of the first class, be punishable with\nfine which may extend to one hundred thousand rupees or with imprisonment for a term which may\nextend to six months or with both. Any person found aiding and abetting him shall also be prosecuted\nand punished.].\n4[28­A. Penalty of practicing without registration.—(1) No person, other than a registered\nmedical or dental practitioner, shall practice medicine or dentistry.\n(2) Any person who acts in contravention of the provisions of sub­section (1) shall be punishable\nwith imprisonment for a term which may extend to two years but shall not be less than six months or\nwith fine which may extend to two hundred thousand rupees but shall not be less than one hundred\nthousand rupees or with both.\n28­B. Cognizance of offences.—(1) No Court shall take cognizance of any offence or matter\nunder this Ordinance except upon complaint in writing made by the authorized officer of the Council.\n(2) Notwithstanding anything contained in the Code of Criminal Procedure, 1898 (Act V of\n1898), it shall be lawful for any Magistrate of the first class to pass any sentence authorized by this\nOrdinance even if such sentence exceeds his powers under Section 32 of the said Code.].\n1 Omitted by Act No. XIX of 2012, s.28.\n2 Subs. by Act No. XIX of 2012, ss.29 and 30.\n3 Subs. by Act No. XIX of 2012, s.31.\n4Ins. by Act No. XIX of 2012, s.32.\n1[29. Privileges of registered medical or dental practitioners.—(1) A registered medical\npractitioner and dentist shall have following privileges, namely:__\n(a) valid registration shall be considered as a licence to practice medicine and dentistry in\nPakistan and of a level mentioned by the Council in the registration certificate;\n(b) a registered medical practitioner or a registered dentist having valid full registration shall\nbe competent to practice medicine or dentistry and prescribe allopathic medicine and\nperform any surgical or interventional procedure on any patient;\n(c) a registered medical practitioner or a registered dentist having valid full registration may\ntake admission for an additional qualification course;\n(d) to hold any medical or dental or relevant administrative appointment in any medical or\ndental institution or setup or hospitals or clinic or related health institution;\n(e) to hold a commission as a medical or dental officer in the Armed Forces; and\n(f) only a registered practitioner having valid registration is eligible to participate in the\nelections of the member of the Council.\n(2) Notwithstanding anything to the contrary contained in any other law for the time being in\nforce, no medical certificate or proscription or advice shall be considered valid unless obtained from a\nmedical or dental practitioner having valid registration.\n(3) No person shall be entitled to recover any charge in any Court of law for any medical or\nsurgical advice or attendance or for the performance of any operation or intervention or for any\nmedicine prescribed or supplied unless he can prove upon the trial that he is a registered medical or\ndental practitioner having valid registration.].\n1[30. Responsibilities of registered medical or dental practitioner.—(1) Every registered\nmedical or dental practitioner shall notify any transfer of the place of his residence or practice to the\nRegistrar within sixty days of such transfer, failing which his name is liable to be struck off the\nRegister by order of the Federal Government either permanently or for such period as may be\nspecified therein.\n(2) No registered person shall use or publish in any way whatsoever any time, title, description or\nsymbol indicating or calculated to lead persons to infer that he possesses any additional or other\nprofessional qualification unless the same has been conferred upon him by a legally constituted\nauthority within or outside Pakistan and which is recognized under this Ordinance.\n(3) Every registered medical practitioner or dental practitioner shall comply with the code of\nmedical ethics prescribed by the Council.].\n1 Subs. by Act No. XIX of 2012, ss.33 and 34.\n1[31. Removal of names from the Register.___(1) The Council, in its discretion, may direct the\nRegistrar to remove altogether or for a specified period from the Register the name of any registered\nmedical practitioner or registered dentist who has been convicted by the disciplinary committee or by\nany other Court of law of any such offence as implies in the opinion of the Council a defect of\ncharacter defined in the code of ethics of practice or who, after an inquiry at which opportunity has\nbeen given to such person to be heard in person or through a pleader, has been convicted by the\ndisciplinary committee of the Council as guilty of professional negligence or incompetence or who\nhas shown himself to be until to continue in practice or on account of mental ill health or other\ngrounds as prescribed in the code of ethics of practice regulations.\n(2) The Council may also direct that any name removed from the Register under sub­section (1)\nshall be restored.\n(3) For the purpose of an inquiry under sub­section (1), the disciplinary committee of the Council\nshall exercise all the powers of a Civil Court under the Code of Civil Procedure, 1908 (Act V of\n1908) for summoning the witnesses, for compelling the production of documents and for issuing\ncommissions with the help of law enforcing authorities.\n(4) The claim of professional negligence shall initially be established before the disciplinary\ncommittee of the Council before any other proceedings.].\n2*                 *                *                *          *      *        *"
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Power to make Regulations.­(1) The Council may, with the previous sanction of the",
      "content": "3[Federal Government], make Regulations generally to carry out the purposes of this Ordinance, and,\nwithout prejudice to the generality of this power, such Regulations may provide for__\n(a) the management of the property of the Council and the maintenance and audit of its\naccounts ;\n1 Subs. by Act No. XIX of 2012, s.35.\n2 Omitted by Act No. XIX of 2012, s. 36.\n3 Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n(b) the summoning and holding of meetings of the Council, the times and places where such\nmeetings are to be held, the conduct of business thereat and the number of members\nnecessary to constitute a quorum ;\n(c) the powers and duties of the President and Vice­President ;\n(d) the mode of the appointment of the Executive Committee and other Committees, the\nsummoning and holding of meetings, and the conduct of business of such Committees ;\n1[(e) code of practice and ethics for the medical and dental practitioners;\n(f) the appointment, powers, duties and procedures of medical and dental inspectors;\n(g) the conditions and procedure for maintenance, compilation and publication of the Register\nof medical and dental practitioners and of health care providing facilities and their\nminimum requirements and the fees to be charged for registration and, if necessary, for\nopening of sub­offices or branches for this purpose;]\n2[(gg) the fee for application under section 22A;]\n1[(h) the procedure for any inquiry under sub­section (1) of Section 31; and\n(i) any matter for which under this Ordinance provision may be made by regulations.];\n(2) Notwithstanding anything contained in sub­section (1), the Council shall make Regulations\nwhich may provide for­\n(a) prescribing a uniform minimum standard of courses of training for obtaining graduate and\npost­graduate medical and dental qualifications to be included or included respectively in\nthe First, Third and Fifth Schedules ;\nb) (prescribing minimum requirements for the content and duration of courses of study as\naforesaid ;\n(c) prescribing the conditions for admission to courses of training as aforesaid ;\n(d) prescribing minimum qualifications and experience required of teachers for appointment\nin medical and dental institutions ;\n1 Subs. by Act No. XIX of 2012. s.37.\n2 Subs. ins. by Ord. VII of 1999, ss. 9­10 (valid upto 21­09­1999).\n(e) prescribing the standards of examinations, methods of conducting the examinations and\nother requirements to be satisfied for securing recognition of medical and dental\nqualifications under this Ordinance ;\n1[(f) prescribing the qualifications, experience and other conditions required for examiners for\nprofessional examinations in medicine and dentistry antecedent to the granting of\nrecognized medical and dental and additional medical and dental qualifications;\n(g) registration of medical or dental students at any medical or dental college or school or any\nuniversity and the fees payable in respect of such registration;\n(h) laying down criteria including university affiliation, conditions and requirements for\nrecognition and continuation of recognition and for grant of status of a teaching institution\nof institutions and organizations under this Ordinance and on all connected matters of\ninspection of medical and dental institutions for recognition and continuation of\nrecognition and inspection of examinations in these institutions and fee for such\ninspections;\n(i) terms and conditions of service for all employees appointed under section 9;\n(j) election of members of the Council; and\n(k) prescribing a uniform minimum standard for continuous professional development for\nregistered graduate and postgraduate medical and dental practitioners.]."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Information to be furnished by the Council and publication thereof.(1) the Council shall",
      "content": "furnish such reports, copies of its minutes, abstracts of its accounts, and other information to the\n2[Federal Government] as it may require.\n(2) The 2[Federal Government] may publish, in such manner as it may think fit, any report, copy,\nabstract or other information furnished to it under this section or under section 21.\n3[35. Commission of inquiry.—(1) Whenever it is made to appear to the Federal Government\nthat the Council is not complying with any provisions of this Ordinance, the Federal Government may\nrefer the particulars of the complaint to a commission of inquiry consisting of three persons two of\nwhom shall be appointed by the Federal Government, including the chairman being at least a judge of\na High Court, and one member nominated by the Council after a resolution.\n(2) Such commission shall proceed to inquire in a summary manner and to report to the Federal\nGovernment as to the truth of the matter charged in the complaint and in case of any charge of\ndefault or of improper action being found by the commission to have been established, the\ncommission shall recommend the remedies, if any, which are in its opinion necessary.\n1 Subs. by Act No. XIX of 2012, s.37 (b).\n2 Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n3 Subs. by Act No. XIX of 2012, s.38.\n(3) The Federal Government shall forward the report of the commission of inquiry to the Council\nfor implementation and for remedial actions. The Council shall submit lo the Federal Government a\ndetailed plan of remedial measures to be adopted by the Council which shall be considered as\napproved if no further orders are passed by the Federal Government in this regard within three\nmonths. All remedial actions shall be taken by the Council within a stipulated period of six months\nand the Council shall submit to the Federal Government a report of actions taken thereon. If the\nCouncil fails to comply with the remedial measures forwarded to it by the Federal Government, the\nFederal Government may by itself amend the regulations of the Council or make such provisions or\nissue orders or take such other steps as may seem necessary to give effect to the recommendations of\nthe commission.\n(4) The commission of inquiry shall have power to administer oaths, to enforce the attendance of\nwitnesses and the production of documents and shall have other necessary powers for the purpose of\nany inquiry conducted by it as are exercised by a Civil Court under the Code of Civil Procedure,\n1908 (Act V of 1908).]."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. [Repeals, etc.] Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981",
      "content": "(XXVII of 1981), s. 3 and Sch.,II.\n1[36­A.Over­ridding provision. The provisions of this Ordinance shall have effect\nnotwithstanding anything to the contrary contained in any other law for the time being in force. No\nsuit, prosecution or other legal proceeding shall lie against the Government, the Council or any\ncommittee thereof or any officer or servant of the Government or the Council for anything which is in\ngood faith done or intended to be done under this Ordinance.\n36­B. Transitory provision. Upon the commencement of the Medical and Dental Council\n(Amendment) Act; 2012, the incumbent Council constituted under Section 3 shall stand dissolved and\nthe President, Vice­President of the Council and Executive Committee of the Council as exists before\nthe commencement of the aforesaid Act shall stay infact till a new President, Vice­President of the\nCouncil, Executive Committee is elected by the Council. The President, Vice­President of the\nCouncil and Executive Committee of the Council shall have the powers of the Council and shall\nconduct elections for membership of the Council within one year.].\n_______\n1 Ins. by Act No. XIX of 2012, s.39.\n(See section 11)\nIN PAKISTAN.\nMedical Institution.    Recognized medical qualification.     Abbreviation for\nregistration.\nUniversity of the       Licentiate in Medicine and Surgery.   L.M.S., Punjab.\nPunjab\nBachelor of Medicine.                 M.B., Punjab\nBachelor of Medicine and Bachelor     M.B.B.S., Punjab.\nof Surgery.\nPunjab State Medical Licentiate in Medicine and Surgery       L.M.S. (P.S.M.F.)\nFaculty              (when the holder of the qualification\nhad passed the F.Sc. (Medical\nGroup) examination of a recognised\nUniversity before taking up medical\nstudies.\nUniversity of Karachi Bachelor of Medicine and Bachelor       M.B.,B.S., Karachi.\nof Surgery.\nUniversity of Sind      Bachelor of Medicine and Bachelor     M.B.,B,S. Sind.\nof Surgery.\n1*                  *   *               *               *     *           *\nUniversity of           Bachelor of Medicine and Bachelor     M.B.,B.S., Peshawar.\nPeshawar                of Surgery.\n1 Omitted by F.A.O., 1975, Art. 2 and Sch.\n(See section 12)\n1*                   *                 *            *            *        *          *\n(See section 16)\nRecognized Additional Medical                 Abbreviations for\nMedical Institution.\nQualification.                                Registration.\nPART ‘A’\nUniversity of the Punjab.                             Doctor of Medicine          ..                M.D. (Punjab).\nMaster of Surgery           ..                M.S. (Punjab).\nDiploma in Public Health.                     D.P.H. (Punjab).\nDiploma in Ophthalmology.                     D.O. (Punjab).\nM.Phil. Bio­Chemistry\nMaster of Philosophy (Bio­ Chemistry).\n(Karachi).]\n2[Doctor of Medicine ..                       M.D. (Karachi).\nMaster of Surgery ..                          M.S. (Karachi).\n3[College of Physicians and                           Fellow of the College of Physicians and\nF.C.P.S. (Pak).\nSurgeons of Pakistan).                                Surgeons of Pakistan.\nMember of the College of Physicians and\nM.C.P.S. (Pak).\nSurgeons of Pakistan.]\n1Omitted by Act No. XIX of 2012, s.40.\n2 Added by S.R.O. No. 1713 (I)/73. at 4­12­1973, see, Gaz. of P., 1973, Pt.­II, p­2450.\n3 Added by S.R.O. No. 620(K)/67, dt. 10­4­1967, see, Gaz. of P., 1967, Pt.,­I, p­382.\nPART ‘B’\nIndia:\n*University of Bombay                     Doctor of Medicine ..          M.D. (Bombay).\nMaster of Surgery    ..        M.S. (Bombay).\n*University of Calcutta                   Doctor of Medicine        ..   M.D. (Calcutta).\nMaster of Surgery      ..      M.S. (Calcutta).\nDiploma in Public Health.      D.P.H. (Calcutta)\nMaster of Obstetrics ..        M.O. (Calcutta).\n*University of Lucknow                    Doctor of Medicine ..          M.D. (Lucknow).\nMaster of Surgery ..           M.S. (Lucknow).\n*University of Madras                     Doctor of Medicine ..          M.D. (Madras).\nMaster of Surgery    ..        M.S. (Madras).\n*University of Patna ..                   Doctor of Medicine ..          M.D. (Patna).\nMaster of Surgery      ..      M.S. (Patna).\n*Andhra University ..                     Doctor of Medicine and         M.D., M.S., Andhra.\nMaster of Surgery.\nUnited Kingdom:                           1[Doctor of Philosophy         Ph. D.\n(Basis Medical Subjects)\nM.Sc.\nMaster of Science ..\n(Basic Medical Subjects)\n* When granted on or before the 14th February, 1956.\n1 Added by S.R.O. No. 916 (K)/66, dated, 8­9­1966, see Gaz. of P., 1966, Pt. I., p.497.\n1                                      2                           3\nPost Graduate Diplomas       D.A., D.A.P. & E.\nD. Bact., D.C.H.,\nD.C.M.T.,\nD.C.P. D.I.H., D.L.O.,\nD.M.J., D.M.R.D.,\nD.M.R.T., D.M.S.A.,\n(Edin), D.O.Hyg., D.O.,\nD.PhyS. Med., D.P.M.,\nD.T.C.D., D.T.P.H. (Only\nwhen granted after training\nof atleast one academic\nyear)],\nUniversities of:\nBirmingham, Bristol,\nCambridge, Durham,\nLeeds, Liverpool, London,                                                M.D.\nManchester, Oxford,\nM.S. or M.Ch.\nShefield, Wales, Aberdeen,\nEdinburgh, Glassgow                         Doctor of Medicine ..        D.P.H.\n1[Exerter, New Castle\nupon Tyne,] St. Andrews                     Master of Surgery ..\nand Bolfast.\nDiploma in Public Health.\nRoyal College of                            Member, Fellow               M.R.C.P., F.R.C.P.\nPhysicians of London.\n(London).\nRoyal College of Surgeons                   Fellow                  ..   F.R.C.S. (England).\nof London.\nRoyal College of                            Member, Fellow      ..       M.R.C.P., F.R.C.P.,\nPhysicians of Edinburgh.\n(Edin).\nRoyal College of Surgeons                   Fellow                       F.R.C.S. (Edin.).\nof Edinburgh.\nRoyal Faculty of                            Fellow             ..        F.R.F.P.S. (Glasgow).\nPhysicians and Surgery of\nGlasgow.\n1 Ins. by S.R.O No. 916 (K)/66, dated, 8­9­1966, see Gaze. of P., 1966 Pt. I P. 497.\n2[Diploma in Public\nHealth.\nD.P.H. (R.C.P.S. England]\n1[Royal College of                                                                   D.P.H. (R.C.P.S.\nPhysicians and Surgeons,                   Diploma in Public Health.                 England).\nEngland.\nRoyal College of                           Member, Fellow, Honorary                  M.R C.P. (Glasg.)\nPhysicians and Surgeons\nof Glasgow.                                Fellow                                    F.R.C.P. (Glasg.)\nF.R.C.S. (Glasg.)\nHon.\nF.R.C.P.S. (Glasg.)].\n[Post­Graduate Diploma.                   D.A., D.A.P. & E.\nD.Bact., D.C.H.,\nD.C.M.T., D.C.P.,\nD.I.H.., D.L.O., D.M.J.,\nDMR. D. D.M.R.T.\nD.M.S.A., (Edin), D.O.\nHyg.,\nD.O., D.Obst. R.C.O.G.\nD.P.H., D. Phys. Med.,\nD.P.M., D.T.C.D.,\nD.T.P.H.\n( Only when granted after\ntraining of at least one\nacademic year);]\n1 Added by S.R.O. No. 505 (K)/65, dated. 24­10­1965, see Gaz. of P., 1965, Pt. I., p. 498.)\n2 Subs. by the Health Divn. Notifin No. S.R.O. 716(K)/65, dated the 26th August, 1965, for the existing entries, see Gaz. of P., 1965, Pt. I, p. 642.\n3 Added by S.R.O. No. 916 (K)/66, dated 8­9­1966, see Gaz. of P., 1966, Pt. I., pp. 457­458.\nRepublic of Ireland:\nniversity of Dublin                            Doctor of               M.D.\nMedicine ..\nNational University of Ireland.                                        M.Ch.\nMaster of\nSurgery ..              M.A.O.\nMaster in\nObstetrics ..\nRoyal College of Physicians of                 Member                  M.R.C.P. (Ireland)\nIreland.                                       Fellow ..\nF.R.C.P. (Ireland)\nRoyal College of Surgeons in                   Fellow             ..   F.R.C.S (Ireland).\nIreland.\n1[Diploma in            D.G.O.]\nObstetrics and\nGynaecology.]\n1[United States of America:\nIndiana University ..                          Doctor of               Ph. D. (Basic\nPhilosophy ..           Medical Subject).]\n1 Added by the Health Divn. Notifn. No. S.R.O. 78(K)/65, dated the 20th January, 1965, see ibid., pp. 34­35.\n(See section 17)\n1*                 *     *         *        *                                          *             *\n(See section 18)\nMedical Institution.                           Recognised Dental Qualification. Abbreviation for Registration.\nBachelor of Dental Surgery.                          B.D.S. (Punjab).\nUniversity of the Punjab\nLicentiate in Dental Surgery.                        L.D.S. (PSMF).]\n2[Punjab State Medical Faculty.\nBachelor of Dental Surgery.\n3[University of Sind.\nBachelor of Dental Surgery.                          B.D.S. (Sind).\nUniversity of Peshawar.\nB.D.S. (Peshawar).]\n4[THE SIXTH SCHEDULE\n(see Section 11­A)\nS. No. Approved Hospitals or Institutions Specialties/Department\n(see Section 16­B)\nS. No. CPD Opportunity Provider\n(see Section 16­C)\nS. No. Specialist Boards Specialties/Department.].\n__________\n1 Omitted by Act No. XIX of 2012, s.40.\n2 Added by the Health Divn. Notifin. No. S.R.O. 111 (K)/66, dated the 29th January, 1966, see Gaz. of P., 1966, Pt. I, p. 78.\n3 Added by S.R.O. No. 215 (K)/69, dated 9­1­1969, see Gaz. of P., 1969, Pt. I., p. 148.\n4 Ins. by Act No. XIX of 2012, s.41."
    }
  ],
  "definitions": []
}
