{
  "id": "pk-pakistan-national-accreditation-council-pnac-act-2017",
  "type": "statute",
  "title": "Pakistan National Accreditation Council (PNAC) Act, 2017",
  "title_en": "Pakistan National Accreditation Council (PNAC) Act, 2017",
  "short_name": "PNACA",
  "status": "in_force",
  "issued_date": "2017-03-20",
  "in_force_date": "2017-03-20",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2JwZ58%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan National Accreditation Council (PNAC) Act, 2017 (VI of 2017) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Pakistan National\nAccreditation Council Act, 2017.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,\n(a)   “Board” means the Board of Governors constituted under section 7;\n(b)   “Chairman” means the Chairman of the Board;\n(c)    “Conformity Assessment Body” means a body that performs conformity assessment\nservices which may form the object of accreditation;\n(d)    “Council” means Pakistan National Accreditation Council established under section\n3;\n(e)   “Director - General” means the Director­General of the Council;\n(f)   “Executive Committee” means the Committee constituted under section 11;\n(g)   “MLA” means multilateral recognition arrangements;\n(h)    “MRA” means mutual recognition arrangements;\n(i)    “prescribed” means as prescribed by rules made under this Act; and\n(j)    “rules” means rules made under section 26."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Council. (1) On the commencement of this Act, there shall stand",
      "content": "established a Council to be known as Pakistan National Accreditation Council.\n(2) The Council shall be a body corporate having perpetual succession and a common seal, with\npowers, subject to the provisions of this Act, to acquire and hold property, and shall by the said name\nsue and be sued.\n(3) The Headquarters of the Council shall be at Islamabad and it may, with the prior approval of\nthe Federal Government, set up offices at other places as and when required."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Functions of the Council. The Council shall,",
      "content": "(a)    establish an internationally recognized accreditation system ;\n(b)    make policies, schemes, procedures and guidelines for provision of accreditation\nservices in line with national and international standards;\n(c)     provide training on accreditation standards to the Conformity Assessment Bodies\nand other stakeholders;\n(d)    accredit the Conformity Assessment Bodies;\n(e)    co-ordinate with National, Regional and International Organizations for effective\nimplementation of Accreditation System; and\n(f)     perform any other function related to the accreditation system."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Management of the Council. The management of the Council shall comprise,",
      "content": "(a)     Board of Governors;\n(b)     Executive Committee; and\n(c)     Director-General."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Composition of the Board of Governors",
      "content": "(1) The Board of Governors shall consist of\nfollowing:—\n(a)     Minister for Science and Technology.              Chairman\n(b)     Secretary Science and Technology Division.        Vice-Chairman\n(c)     Secretary Commerce Division, or his\nnominee not below the rank of Joint               Member\nSecretary.\n(d)     Secretary Industries Division, or his\nnominee not below the rank of Joint               Member\nSecretary.\n(e)     Secretary National Food Security and\nResearch Division, or his nominee not below       Member\nthe rank of Joint Secretary.\n(f)     Secretary National Health Services,\nRegulation and Coordination Division, or his      Member\nnominee not below the rank of Joint\nSecretary.\n(g)     President Federation. of Pakistan Chambers\nMember\nof Commerce and Industry or his nominee.\n(h)     Presidents Provincial Chamber of Commerce\nand Industry or their nominees.                    Member\n(i)     Director-General                                   Member\n(2) The Director-General shall also act as the Secretary of the Board."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Functions and powers of the Board. The Board shall,",
      "content": "(a)       review and approve annual and long term plans, policies and schemes of the\nCouncil;\n(b)       approve the annual development and non­development budgets of the Council;\n(c)       create, abolish or re-designate any post, or engage consultants or ofexperts from\ntime to time on such pay or remuneration, other allowances and terms and\nconditions, as it may deem necessary for efficient performance of the functions of\nthe Council, and as may be prescribed; and\n(d)      determine service fee for the services rendered or offered by the Council."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Terms of office of members",
      "content": "(1) Save as hereinafter provided, a person, who becomes or\nis nominated to be, a member by virtue of his holding an office or appointment, shall cease to be a\nmember as and when he ceases to hold that office or appointment.\n(2) No act or proceeding of the Board shall be invalid on the ground only of the existence of a\nvacancy in the Board.\n(3) The Federal Government may, by notification in the Official Gazette increase or decrease the\nnumber of members of the Board."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Meetings of the Board",
      "content": "(1) Save as hereinafter provided, the Board shall regulate the\nprocedure for its meetings.\n(2) Meetings of the Board shall be called by its Chairman and in his absence by the Vice-\nChairman on such dates, time and places as he may deem fit, provided that at least one meeting shall\nbe held in a calendar year.\n(3) At least five members shall constitute quorum for a meeting of the Board.\n(4) Each meeting of the Board shall be presided over by the Chairman and, in his absence, by the\nVice-Chairman."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Executive Committee of the Board",
      "content": "(1) Notwithstanding anything contained in this Act,\nthe Executive Committee shall take decisions on behalf of the Board subject to ratification by the Board\nat its meeting immediately following the meeting of the Executive Committee, unless otherwise\nauthorized by the Board.\n(2) The Executive Committee shall comprise the following members, namely:\n(a)   Director-General                                   Convener\n(b)   Dealing officer not below the rank of Joint\nSecretary of the Division Controlling the          Member\nsubject matter of Science and Technology\nMember\n(c)   Deputy Director General, Council\n(3) Subject to the provisions of this Act and rules made in this behalf and such general or special\ndirections as may, from time to time, be given by the Board, the Executive Committee shall deal with\nany matter as authorized by the Board."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Director General",
      "content": "(1) The Federal Government shall appoint a Director General of the\nCouncil, for a term of four years, extendable further for another term, on terms and conditions as may\nbe prescribed.\n(2) The person having MS or MSc. degree in natural or physical sciences, or equivalent in\nengineering sciences from HEC recognized University, with at least fifteen years experience in\nmanagement at top level position including five years experience in the field of accreditation, shall be\neligible to be appointed as Director-General."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Powers and functions of the Director",
      "content": "General.—(1) The Director-General, who shall be\nthe Chief Executive Officer of the Council, shall work under the general policy guidelines of the Board\nand have such powers, functions and duties as may be conferred upon or vested in him under this Act.\nThe Director-General shall,—\n(a)     develop policies and business plans relating to the operations of the Council;\n(b)     supervise the implementation of the policies and the procedures;\n(c)     approve the award of accreditation and use of accreditation mark;\n(d)    suspend, withdraw and or reduce scope of accreditation when an accredited\nConformity Assessment Body has persistently failed to meet the requirements of\naccreditation or to abide by the rules for accreditation;\n(e)     supervise the finances of the Council;\n(f)     make contractual arrangements to undertake the functions of the Council;\n(g)    propose nomination of employees upto BPS -21 or equivalent, for foreign\ntrainings, seminars, work-shops, symposia, meetings etc., for approval by the\ncompetent fora;\n(h)     plan and take measures to enhance the 'scope of accreditation and acquire MRA\nor MLA status on such scope;\n(i)    ensure participation in international obligatory meetings and trainings;\n(j)    ensure the protection of all assets of the Council including intellectual property\nassets;\n(k)    arrange for annual or any other report of the Council as may be desired by the\nFederal Government;\n(l)    identify areas of strength and weakness and formulate remedial programs; and\n(m) subject to the provisions of paragraph (c) of section 8, appoint such officers,\nconsultants, experts, and employees as may be necessary for the efficient\nperformance of the Council on such terms and conditions as may be prescribed.\n(2) The Director-General may in general or specific delegate his powers to the committee or\nindividuals as he may deem necessary."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Funds of the Council",
      "content": "(1) The funds of the Council shall consist of,—\n(a)   grants made by the Federal Government;\n(b)    grants from national and international agencies;\n(c) funds generated through its own resources; and\n(d) The Funds which shall stand transferred to the Council under paragraph (a) of\nsection 24.\n(2) The Council shall not accept any financial support that may affect the impartiality and\nobjectiveness of the accreditation process."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Budget and accounts",
      "content": "(1) The Council shall, by such date and in such form as may be\nprescribed, submit to the Government its budget, for each financial year for approval.\n(2)    The Director-General shall, submit annual budget and accounts of the Council, to the\nBoard.\n(3)    The accounts of the Council shall be maintained in such form and procedure as may be\ndetermined by the Government.\n(4)    Internal audit of the accounts shall be conducted regularly once in a year or sooner as\nand when deemed necessary by the Executive Committee.\n(5)    The audited accounts shall be finalized and laid before the Board as soon as possible,\nbut not later than one year, after close of each financial year.\n(6)    The accounts of the Council shall be audited by the Auditor-General of Pakistan."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Grant of accreditation",
      "content": "(1) The Council shall complete the assessment process of\nConformity Assessment Body and make a decision whether or not to grant accreditation within the\nprescribed time.\n(2) The Council shall grant and renew accreditation to a Conformity Assessment Body on\nsuccessful completion of assessment process and authorize the use of mark of the Council."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Prohibition of improper use of marks",
      "content": "(1) No person shall in relation to any article,\nproduct, process or service or in any trademark or design, use the Council's mark to give that\nimpression, except under a valid registration certificate issued by the Council or its authority..\n(2) Subject to section 18, any person or a group who contravenes provision of the section (1)\nshall be liable for punishment by the court to the extent that any financial gain in respect of which the\nfiontravention is established shall be forfeited to the Council."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Punishment for improper use of Council mark. (1) Any person who cont venes the",
      "content": "provisions of section 17 shall, in addition to the punishment specified under sub-section (2) of section\n17, be punishable with imprisonment of either description for a term which may extend to one year, or\nwith a fine extending upto one million rupees, but hall not be less than one hundred thousand rupees,\nor with both.\n(2) A Court convicting a person under this section may direct that any articles in respect of\nwhich the contravention was made shall be forfeited to the Government."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Cognizance of offences by courts. No court inferior to that of a Magistrate of the First",
      "content": "Class shall try any offence punishable under this Act."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Appeal",
      "content": "(1) Any person aggrieved by an order passed under sections 17 and 18 may\nprefer an appeal to the Court of Sessions within thirty days of the date of the order.\n(2) The appeal shall be presented in such form and manner and within such time and on\npayment of such fee as may be prescribed.\n(3) The Court of Sessions shall, in dealing with appeals under this section, follow the\nprocedure specified in the Code of Criminal Procedure, 1898 (V of 1898)."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Submission of reports, etc. The Council shall submit to the Federal Government, at such",
      "content": "time and at such intervals as the Federal Government may specify,—\n(a)     annual reports on the working of the Council;\n(b)     such periodical reports and summaries as may be required by the Federal\nGovernment;\n(c)      such periodical returns, accounts, statements and statistics as may be required\nby the Federal Government;\n(d)      information and comments asked for by the Federal Government on any specific\npoint;\n(e)     copies of the documents required by the Federal Government; and\n(f)   original documents required by the Federal Government for examination any\nother purpose."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Directives from the Federal Government. The Council shall follow and carry out all",
      "content": "such directives and orders issued by the Federal Government in writing, as may be issued from time to\ntime, as it may consider necessary for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Employees of the Council to be public servants. The employees of the Council shall,",
      "content": "when acting or purporting to act in pursuance of any of the provisions of this Act, be deemed to be\npublic servants within the meaning of section 21 of the Pakistan Penal Code (XLV of 1860)."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Savings. Upon the commencement of this Act, the National Accreditation Council",
      "content": "established vide Ministry of Science and Technology's Notification No. 3(99)/97-S.O (T) NAC, dated\nthe 5th March, 1998, shall stand dissolved and upon such dissolution,—\n(a)     all assets, rights, powers, authorities, privileges and property, movable and\nimmovable, cash and bank balance, reserve funds, investments and all other\ninterests and rights in, liabilities and obligations of whatever kind of the\nCouncil subsisting immediately before its dissolution shall stand transferred to\nand vest in the Council;\n(b)     all employees of the Council shall, notwithstanding anything contained in any\nlaw, any agreement, deed, document or other instrument, stand transferred to\nthe Council in accordance with the present terms and conditions of the service\napplicable to them, and no officer or other employee whose services are so\ntransferred shall be entitled to any compensation because of such transfer:\nProvided that an irrevocable option shall be given to the employees of\nthe Council to opt either to retain the status and terms and condition which\nthey have as civil servants or to opt to the employment of the Council:\nProvided further that those who opt to continue as civil servants shall\ncontinue as such in the manner prescribed;\n(c)     all debts and obligations incurred or contracts entered into or rights acquired\nand all matters and things engaged to be done by, with or for the Council\nestablished under the resolution before its dissolution shall be deemed to have\nbeen incurred, ,entered into, acquired or engaged to be done by, with or for the\nCouncil;\n(d)     all suits and other legal proceedings instituted by or against the Council\nestablished under the resolution, before its dissolution shall be deemed to be\nsuits and proceedings by or against the Council and may be dealt with\naccordingly; and\n(e)     all actions done by the Council before the commencement of this Act shall be\ndeemed to be done under this Act."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Power to make rules. The Federal Government may, by notification in the official",
      "content": "Gazette, make rules, for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Removal of difficulty. If any difficulty arises in giving effect to any of the provisions of",
      "content": "this Act, the Federal Government may make such order, not inconsistent with the provisions of this\nAct, as it may appear it to be necessary or expedient for the purpose of removing such difficulty:\nProvided that no such power shall be exercised after the expiry of two years from the\ncommencement of this Act."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Board of Governors constituted under section 7;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "Conformity Assessment Body",
      "definition": "a body that performs conformity assessment services which may form the object of accreditation;",
      "source_provision": "sec2"
    },
    {
      "term": "Council",
      "definition": "Pakistan National Accreditation Council established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Director - General",
      "definition": "the Director­General of the Council;",
      "source_provision": "sec2"
    },
    {
      "term": "Executive Committee",
      "definition": "the Committee constituted under section 11;",
      "source_provision": "sec2"
    },
    {
      "term": "MLA",
      "definition": "multilateral recognition arrangements;",
      "source_provision": "sec2"
    },
    {
      "term": "MRA",
      "definition": "mutual recognition arrangements;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "as prescribed by rules made under this Act; and",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under section 26.",
      "source_provision": "sec2"
    }
  ]
}
