{
  "id": "pk-pakistan-national-council-of-the-arts-act-1973",
  "type": "statute",
  "title": "Pakistan National Council of the Arts Act, 1973",
  "title_en": "Pakistan National Council of the Arts Act, 1973",
  "short_name": "PNCOT",
  "status": "in_force",
  "issued_date": "1973-08-10",
  "in_force_date": "1973-08-10",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2hs-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan National Council of the Arts Act, 1973 (LIX of 1973) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Audit of accounts",
      "content": "10   Power to make rules\n11   Power to make regulations\n1\nACT NO LIX OF 1973\n[11th August, 1973]\nAn Act to provide for the establishment of the Pakistan National Council of the Arts.\nWHEREAS it is expedient to provide for the establishment of a Pakistan National Council\nof the Arts for the patronage, promotion and development of the Arts, and for matters\nconnected therewith or incidental thereto;\nIt is hereby enacted as follows:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Pakistan\nNational Council of the Arts Act, 1973.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or",
      "content": "context,—\n(a)        “artistic activity” means any activity so declared by the Federal Government\nby notification in the official Gazette;\n(b)         “Board” means the Board of Governors of the Council constituted under\nsection 4;\n(c)         “Chairman” means the Chairman of the Council;\n(d)         “Council” means the Pakistan National Council of the Arts established under\nsection 3; and\n(e)          “Director-General” means the Director-General of the Council."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Council",
      "content": "(1) As soon as may be after the commencement of this\nAct, the Federal Government may, by notification in the official Gazette, establish a Council to be\ncalled the Pakistan National Council of the Arts.\n(2) The Council shall be a body corporate having perpetual succession and a common\nseal, with power to acquire, hold and dispose of property, both movable, and immovable, and shall\nby the said name sue and be sued.\n1\nFor Statement of Objects and Reasons, see Gaz. of P., 1973, Ext., Pt. III, p. 1205.\n1\n[4. Board of Governors.— (1) The management, overall control and supervision of the\naffairs of the council shall vest in a Board of Governor consisting of the following members,\nnamely:—\n(a)        the Federal Minister-in-Charge of Culture who shall also be the Chairman;\n(b)        the Minister of State for Culture, who shall also be the Vice-Chairman:\nProvided that, if there is no such Minister of State; the Federal\nGovernment may nominate any member of the Board to be the Vice-Chairman;\n(c)        the Secretary to the Government of Pakistan in the Division dealing with\nCulture;\n(d)        a representative of the Ministry of Foreign Affairs;\n(e)        the Financial Adviser of the Division dealing with Culture;\n(f)        the Joint Secretary to the Government of Pakistan in the Division dealing with\nCulture;\n(g)        the Director-General;\n(h)        the Director of Archaeology;\n(i)        the Managing Director, Pakistan Television Corporation;\n(j)        the Director-General, Pakistan Broadcasting Corporation;\n(k)        twenty persons, including five women, eminent in the fields or art and\nculture, to be nominated by the Chairman; and\n(l)        a member-secretary to be appointed by the Chairman.].\n(2) The Board of Governors shall have power to co-opt. members from amongst persons who\nare specialists in their respective field, for advice on particular projects and matters under\nconsideration.\n(3) The members of the Board, excepting the ex-officio members, shall hold office for a\nterm of three years and shall be eligible for re-election or re-nomination, as the case may be.\n(4) A member of the Board, other than an ex-officio member, may, by writing under his hand\naddressed to the Chairman, resign his office.\n(5) Any casual vacancy in the office of a member other than an ex-officio member shall be\nfilled by a person nominated by the Federal Government and the person so nominated shall\nhold office for the unexpired period of the term of his predecessor.\n1\nSubs. by the Pakistan National Council of the Arts (Amdt.) Ordinance, 1979 (61 of 1979), s. 2, for sub-section (1)."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Director",
      "content": "General.—(1) The Director-General shall be appointed by the Chairman on such\nremuneration and other terms and conditions as the Chairman may determine.\n(2) The Director-General shall be the chief executive of the Council and shall be\nresponsible to the Board for carrying out the objectives of the Council.\n(3) The Director-General may, by writing under his hand addressed to the Chairman, resign\nhis office."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Functions",
      "content": "(1) The Council shall—\n(a)    advise the Federal Government on matters of policy on artistic activity and\ntheir implementation;\n(b)    improve knowledge, understanding and practice of the arts and advise the\nFederal Government in order to increase regional activity through systematic\nplanning and coordination at all levels;\n(c)    coordinate, evaluate and supervise activities of cultural organizations and\nindividuals engaged in cultural activities;\n(d)    advise and assist the Provincial Governments in the setting up of Provincial\nArt Councils to serve as liaison between the local cultural bodies and the\nCouncil with regard to their activities and financial assistance;\n(e)    plan, establish and run art academies, folk museums, exhibition halls,\nauditoria, art galleries and similar other institutions;\n(f)    organize exhibitions of arts and crafts within Pakistan and in other countries;\n(g)    organize national and regional ensembles for performance within the country\nand in other countries;\n(h)    organize and promote cultural fairs and festivals;\n(i)    help, establish and organize national unions of artists on the basis of their\nchosen field of activity;\n(j)    help in the implementation of cultural pacts and programmes on directions of\nthe Federal Government;\n(k)    have contacts with similar organizations in other countries, through the\nFederal Government;\n(l)    set up penals of experts in specific fields of the arts where necessary; and\n(m)    perform any other function in the field of arts which the Federal Government\nmay direct or which the council may consider necessary or desirable.\n(2) Where it appears to the Council that an organization engaged in artistic activity which\nis in receipt of any grant from the Federal Government or the council, is conducting its activities in\na manner contrary to the policy laid down by the Council or is in any other way mismanaging its\naffairs, the Council may, and where the Federal Government so directs shall, hold an enquiry into\nthe affairs of such organization and submit a report to the Federal Government alongwith its\nrecommendations."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Funds. The funds of the Council shall be derived from the following sources,",
      "content": "namely:—\n(i)    grants of the Federal Government and the Provincial Governments; and\n(ii)   contributions and donations from individuals, local bodies, corporations,\ninstitutions, organizations and agencies."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Power to make rules. The Federal Government may, by notification in the official",
      "content": "Gazette, make rules to carry out the purposes of this Act."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Power to make regulations. The Council may make such regulations as it may",
      "content": "consider necessary for carrying the provisions of this Act into effect.\n____________"
    }
  ],
  "definitions": [
    {
      "term": "artistic activity",
      "definition": "any activity so declared by the Federal Government by notification in the official Gazette;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of Governors of the Council constituted under section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Council;",
      "source_provision": "sec2"
    },
    {
      "term": "Council",
      "definition": "the Pakistan National Council of the Arts established under section 3; and",
      "source_provision": "sec2"
    },
    {
      "term": "Director-General",
      "definition": "the Director-General of the Council.",
      "source_provision": "sec2"
    }
  ]
}
