{
  "id": "pk-pakistan-navy-extension-of-service-act-1950",
  "type": "statute",
  "title": "Pakistan Navy (Extension of Service) Act, 1950",
  "title_en": "Pakistan Navy (Extension of Service) Act, 1950",
  "short_name": "PNOSA",
  "status": "in_force",
  "issued_date": "1950-01-29",
  "in_force_date": "1950-01-29",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap%2BVaQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Navy (Extension of Service) Act, 1950 (XXIV of 1950) published by The Pakistan Code (Military Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, and commencement",
      "content": "_(1) This Act may be called the 2* Pakistan Navy\n(Extension of Service) Act, 1950.\n(2) It shall come into force at once"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Extension of service where term of service has expired. Until such date as may be notified in",
      "content": "this behalf by the 3[Federal Government], any person enrolled for service in the 2* Pakistan Navy\nwho, by reason of the expiry of the term for which\n1 For Statement of Objects and Reasons, see Gaz. of P.,1950, Pt. V, p. 52.\nThe Act has been __\n(i) applied to Baluchistan, with effect on and from the 1st October, 1952, see Gaz. of P.,1952, Pt. I, p.168;\n(ii) applied in the Federated Areas of Baluchistan, see Ibid., 1953, Pt. I p. 152;\n(iii) extended to the Leased Areas of Baluchistan­ see the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950);\n(iv) extended to the Baluchistan States Union by the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G.G.O. 4 of 1953), as amended; and\n(v) extended to the Khairpur State, see the Khairpur (Federal Laws) (Extension) Order, 1953 (G.G.O. 5 of 1953).\n1960 (37 of 1960), s. 2.\n2 The word \"Royal\" omitted by A. O.,1961, Art, 2 and Sch. (with effect from 23rd March, 1956).\n3 Subs. by F.A.O. 1975, Art. 2 and Table, for “Central Government”.\nhe was engaged to serve when so enrolled, is no longer liable for service shall, notwithstanding such\nexpiry, continue to be enrolled for service and to be liable for service in the 1* Pakistan Navy until he\nis discharged by the order of the Officer Commanding the 1* Pakistan Navy:\nProvided that the period for which the service of any such person is extended under this section\nshall not exceed five years from the day on which his service would otherwise have terminated.\n2*                         *                          *                          *                      *   *   *\n______\n1 The word “Royal” omitted by A.O., 1961, Art. 2 and Sch. (with effect from the 23 rd March, 1956).\n2 Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2 nd Sch ___"
    }
  ],
  "definitions": []
}
