{
  "id": "pk-pakistan-nuclear-regulatory-authority-ordinance-2001",
  "type": "statute",
  "title": "Pakistan Nuclear Regulatory Authority Ordinance, 2001",
  "title_en": "Pakistan Nuclear Regulatory Authority Ordinance, 2001",
  "short_name": "PNRAO",
  "status": "in_force",
  "issued_date": "2001-01-21",
  "in_force_date": "2001-01-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cp%2BUY2Fr-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Nuclear Regulatory Authority Ordinance, 2001 (III of 2001) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Co",
      "content": "operation with International Organization, etc"
    },
    {
      "provision_ref": "sec60",
      "section": "60",
      "title": "Section 60. Repeal and savings",
      "content": "ORDINANCE, 2001\nORDINANCE No. III OF 2001\n[22nd January, 2001]\nAn Ordinance to provide for the establishment of the Pakistan Nuclear Regulatory Authority for\nregulation of nuclear safety and radiation protection in Pakistan and the extent of civil liability for\nnuclear damage resulting from any nuclear incident;\nWHEREAS it is expedient to provide for the establishment of the Pakistan Nuclear\nRegulatory Authority to be the competent national authority for regulation of safety of nuclear\ninstallations, the protection against risks arising from ionizing radiation, the extent of civil liability\nfor nuclear damage resulting from any nuclear incident and for matters ancillary thereto or connected\ntherewith;\nAND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the\nProclamation of Emergency of the fourteenth day of October 1999, and the Provisional Constitution\nOrder No. 1 of 1999;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day\nof October 1999, and the Provisional Constitution Order No. 1 of 1999, as well as Order No.9 of\n1999; and in exercise of all powers enabling him in that behalf, the President of the Islamic Republic\nof Pakistan is pleased to make and promulgate the following Ordinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_ (1) This Ordinance may be called the Pakistan\nNuclear Regulatory Authority Ordinance, 2001."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "__ In this Ordinance, unless there is anything repugnant in the subject or\ncontext,\n(a)     “Authority” means the Pakistan Nuclear Regulatory Authority established\nunder section 3;\n(b)     “authorization” means an authorization granted under section 20 or, as the case\nmay be, sections 21, 22 or 23;\n(c)     “Chairman” means the Chairman of the Authority;\n(d)   “Commission” means the Pakistan Atomic Energy Commission established\nunder the Pakistan Atomic Energy Commission Ordinance, 1965(XVII of\n1965);\n(e)   “ionizing radiation” means any electromagnetic or particular radiation capable\nof producing ions, directly or indirectly in its passage through matter;\n(f)   “license” means a license issued under section 19;\n(g)   “member” means a member of the Authority;\n(h)   “nuclear damage” means loss of life, any personal injury or any loss of, or\ndamage to, property which arises out of or results from the radioactive\nproperties or a combination of radioactive properties with toxic, explosive or\nother hazardous properties of nuclear substance, radioactive materials\nor radioactive products or waste in, or of nuclear material coming from,\noriginating in, or sent to, a nuclear installation, or from the ionizing radiation\nemitted by any other source of radiation inside a nuclear installation;\n(i)   “nuclear fuel” means any material which is capable of producing energy by\nself sustaining chain process of nuclear fission, nuclear fusion or other nuclear\ntransmutation;\n(j)   “nuclear incident” means any occurrence, or series of occurrences having the\nsame origin which causes nuclear damage or but only with respect to\npreventive measures, creates a grave and imminent threat of causing such\ndamage;\n(k)   “nuclear installation” means:\n(i)     any nuclear reactor used as a source of power or for any other purpose;\n(ii)    any factory using nuclear fuel for the production of nuclear material, or\nany factory for the processing of nuclear material including any factory\nfor the reprocessing of irradiated nuclear fuel; and\n(iii)   any facility where nuclear material is stored, other than storage\nincidental to the carriage of such material:\nProvided that several nuclear installations of one operator, which are\nlocated at the same site, may be considered as a single nuclear installation;\n(l)   “nuclear material” means:—\n(i)     nuclear fuel, including natural uranium and depleted uranium, capable\nof producing energy by a self-sustaining chain process of nuclear\nfission outside a nuclear reactor, either alone or in combination with\nsome other material; and\n(ii)    radioactive products or waste;\n(m)    “nuclear substance” means any substance or nuclear material which the\nAuthority determines as being a substance or material which may be used for\nproduction of or use in atomic energy or for research into matters connected\ntherewith and includes all substances obtained or obtainable from the soil or\nwater by under-ground or surface working or from the atmosphere;\n(n)    “operator”, in relation to a nuclear installation, means the person licensed under\nsection 19;\n(o)    “person” means any individual, corporation, partnership, firm, association,\ntrust, estate, public or private institution, group, Government agency, any state\nor any political sub-division or any political entity within a state, any foreign\nGovernment or nation, or other entity and includes any legal successor,\nrepresentative, agent or agency of any of the aforesaid;\n(p)    “radiation generator” means a device or an apparatus capable of generating\nradiation, such as X-rays, neutrons, electrons, or other charged particles, which\nmay be used for scientific, industrial or medical purposes;\n(q)    “radioactive material” means any substance which contains or consists of\nradioactive nuclide, naturally occurring or 'artificially produced, provided that\nprescribed by regulations;\n(r)    “regulations” means regulations made under this Ordinance; and\n(s)    “rules” means rules made under this Ordinance."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Authority",
      "content": "_ (1) As soon as may be, but not later than thirty days\nafter the commencement of this Ordinance, the Federal Government shall, by notification in the\nofficial Gazette, establish, in accordance with provisions of this Ordinance, an Authority to be called\nthe, Pakistan Nuclear Regulatory Authority;\nProvided that till such time as the Authority is fully constituted, the Chairman shall exercise\nthe powers, perform the functions and discharge the duties of the Authority.\n(2) The Authority shall be a body corporate having perpetual succession, and a common\nseal, and may sue and be sued in its own name and, subject to and for the purposes of this Ordinance,\nmay enter into contracts and may acquire, purchase, take, hold and enjoy moveable and immovable\nproperty of every description and may convey, assign, surrender, yield up, charge, mortgage, demise,\nreassign, transfer or otherwise dispose of or deal with, any moveable or immovable property or any\ninterest vested in it.\n(3) The head office of the Authority shall be at Islamabad and it may set up offices, at such\nplaces as it may deem appropriate;\n(4) The common seal of the Authority shall be kept in the custody of the Chairman or such\nother person as may be prescribed by regulations and documents required or permitted to be executed\nunder the common seal shall be specified and authenticated in such manner as may be prescribed by\nregulations."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Composition of the Authority",
      "content": "_(1) The Authority shall consist of a Chairman not more\nthan two full-time members and seven part-time members to be appointed by the Federal Government.\n(2) The Chairman and every member of the Authority shall be a person of ability, integrity and\nstanding having such knowledge and experience as hereinafter specified.\n(3) The Chairman shall be a person holding a postgraduate degree in physical or nuclear\nsciences or in engineering and technology, preferably a Ph.D. or equivalent from an internationally\nrecognised university and have worked for at least twenty-five years in the field of nuclear sciences or\nnuclear engineering and technology.\n(4) Each of the two full-time members shall be a person holding a postgraduate degree in\nphysical or nuclear sciences or be graduate in engineering and technology from an internationally\nrecognised university and have worked for at least twenty years in the relevant field of radiation\nprotection, nuclear safety or reactor safety.\n(5) Seven part-time members as follows:—\n(a)    three technical members:\n(i)     two of whom shall be reputable scientists or engineers from\ninternationally recognized universities holding a post-graduate\nprofessional degree in nuclear physics or nuclear engineering and\ntechnology and have worked at least for fifteen years in the relevant\nfield; and\n(ii)    one medical doctor holding a postgraduate professional degree in\nnuclear medicine, radiotherapy or radiation sciences and have worked at\nleast for fifteen years in the relevant field;\n(b)     two nominees one each from the Ministry of Health and the\nPakistan Environmental Protection Agency not below the rank of Joint\nSecretary;\n(c)     one nominee from the Pakistan Atomic Energy Commission with the rank or\ngrade equivalent to that 'of a full-time member of the Commission; and\n(d)     Director General, Strategic Plans Division, JSHQ.\n(6) There shall be a Secretary of the Authority who shall be a non-voting member of the\nAuthority.\n(7) No person shall be appointed as the Chairman or a member unless he is a citizen of\nPakistan."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Chairman",
      "content": "The Chairman shall be the Chief Executive Officer of the Authority and shall,\nsubject to the provisions of this Ordinance, the rules and regulations, be responsible for the day to day\nadministration of the affairs of the Authority"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Term of office of the Chairman",
      "content": "(1) Subject to the provisions of this Ordinance, the\nChairman shall hold office for a term of four years from the date of his appointment.\n(2) The Chairman shall be eligible for reappointment for a period of four years but not for\nmore than two consecutive terms."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Term of office of a member.___ Subject to the provisions of this Ordinance, a full",
      "content": "time\nmember and a part-time member other than an ex-officio member, shall hold office for a period of\nfour years from the date of his appointment and shall be eligible for reappointment for a period of four\nyears but not for more than two consecutive terms."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Resignation by the Chairman or a member.__ The Chairman, a full",
      "content": "time member or a\npart-time member may, by giving in writing to the Federal Government a notice of not less than three\nmonths, resign his office:\nProvided that the resignation shall not take effect until it has been accepted by the Federal\nGovernment."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Removal of the Chairman or a member",
      "content": "(1) Subject to sub-section (2), the Federal\nGovernment may by notification in the official Gazette, remove the Chairman or any member from\nhis office.\n(2) The Chairman or any member may be removed from his office, if he:—\n(a)     in the opinion of the Federal Government, fails to discharge, or becomes\nincapable of discharging, his duties under this Ordinance;\n(b)     has been declared insolvent;\n(c)    has been declared to be disqualified for employment in, or has been dismissed\nfrom the service of Pakistan;\n(d)    has been convicted of an offence involving moral turpitude; or\n(e)    has knowingly acquired or continued to hold without the permission in writing\nof the Federal Government, directly or indirectly or through a partner, any share\nor interest in any contract or employment with, or by on behalf of the\nAuthority, in any land or property which in his knowledge, is likely to benefit\nor has benefitted as a result of the operation of the Authority:"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Filling of a casual vacancy",
      "content": "_ A casual vacancy in the office of the Chairman or a\nmember shall be filled by the appointment of another Chairman or, as the case may be, member for\nthe remaining term of office of his predecessor."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Terms and conditions of service",
      "content": "(1) The salary and allowance payable to, and other\nterms and conditions of service of, the Chairman and a full-time member shall be such as may be\nprescribed by rules.\n(2) Remuneration and-allowances of a part-time member shall be such as may be prescribed\nby regulations."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Meetings of the Authority",
      "content": "(1) The Authority shall meet at such times and place and in\nsuch manner, as may be prescribed by regulations:\nProvided that until regulations are made in this behalf, such meetings shall be convened by the\nChairman.\n(2) As and when required, and for the purpose of advice, the Chairman may, in consultation\nwith full-time members, invite a senior level expert or representative of a relevant organization to\nparticipate in the meetings of the Authority."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Directorates of the Authority",
      "content": "The Authority may establish one or more Directorates\nwhich shall execute, enforce and supervise all decision of the Authority and all nuclear anal radiation\nsafety measures vested in the Authority under the provisions of this Ordinance or the rules and\nregulations made thereunder."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Advisory Committees",
      "content": "(1) The Authority may, from time to time, constitute such\nAdvisory Committees, from amongst its members or other suitably qualified persons, for assisting the\nAuthority in the performance of its functions generally, or for advising on or evaluating any particular\nnuclear or radiation safety aspect.\n(2) An Advisory Committee constituted under sub-section (1) shall perform such functions as\nmay be prescribed by regulations"
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Appointment of advisers and consultants",
      "content": "(1) The Authority may employ suitably\nqualified advisers and consultants to transact any business or to do any act required to be\ntransacted or done in exercise of its powers or performance of its functions under this Ordinance.\n(2) The decision to employ and the terms and conditions of employment under sub- section\n(1) shall be made by the Authority as it may deem fit."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Functions and powers of the Authority",
      "content": "(1) Subject to the provisions of this\nOrdinance, the Authority shall have the responsibility for controlling, regulating and\nsupervising all matters related to nuclear safety and radiation protection measures in Pakistan.\n(2) Without prejudice to the-generality of the foregoing powers, the following shall be the\npowers and functions of the Authority, namely:\n(a)    to devise, adopt, make and enforce such rules, regulations, orders or\ncodes of practice for nuclear safety and radiation protection as may,\nin its opinion, be necessary;—\n(b)    to plan, develop and execute comprehensive policies and\nprogrammes for the protection of life, health and property against\nthe risk of ionizing radiation;\n(c)    to regulate the radiation safety aspects of:__\n(i)     Exploitation of any radioactive ore;\n(ii)    Production, import, export, transport, possession, processing,\nreprocessing; use, sale, transfer, storage or disposal of a\nnuclear substance, radioactive material or any other\nsubstance as the Authority may, by notification in the official\nGazette, specify;\n(iii)   equipment used for production, use or application of nuclear\nenergy for :__\n(a)    the generation of electricity; or\n(b)    any other uses;\n(d)    to approve effective reporting procedures with respect to radiation\nincidents and to ensure that plans for protective action in emergency\nsituation have been prepared;\n(e)    to ensure that corrective actions are undertaken when unsafe or,\npotentially unsafe conditions are detected concerning a nuclear\ninstallation, radiation generator, nuclear material, nuclear substance\nor radioactive material;\n(f)    to ensure that appropriate measures for physical protection of\nnuclear installations and nuclear materials are taken;\n(g)    to establish the extent of insurance to be carried by a licensee against\nthe risks of nuclear damage to the public;\n(h)    to grant authorization, or issue licence for the production, storage,\ndisposal, trade in and use of any nuclear substance, radioactive\nmaterial or any other substance or equipment used for production or\nuse of nuclear energy as the Authority may, by notification in the\nofficial Gazette, specify;\n(i)    to inspect all nuclear installations, radiation generators, nuclear\nmaterials, nuclear substances or radioactive materials to ensure that\nregulations concerning safety measures are properly followed;\n(j)    to advise the Federal Government departments or Provincial\nGovernment departments, educational and research institutions,\npublic or private industry and other undertakings on questions\nrelated to nuclear safety and radiation protection; and\n(k)    to do all other acts and things, such as initiating and coordinating\nresearch and development necessary for carrying into effect the\nprovisions of this Ordinance."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Directives, orders and instructions from the Federal Government",
      "content": "(1) The Federal\nGovernment may, from time to time, issue to the Authority such directives and orders as it may\nconsider necessary for carrying out the purposes of this Ordinance and the Authority shall\nfollow and carry out such directives and orders.\n(2) In discharging its functions, the Authority shall be bound by such instructions, if any, as\nmay be given to it on any question of policy by the Federal Government which shall be the sole judge\nas to whether a question is a question of policy."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Delegation of powers. The Authority may, by general or special order in writing, direct",
      "content": "that any of its powers, shall, in such circumstances and under such conditions, if any, as may be\nspecified in the order, be exercisable also by the Chairman, a member or officer of the Authority."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Power to issue license",
      "content": "__(1) No person shall, unless he is exempted as may be\nprescribed by regulations, or unless he is the holder of a license issued by the Authority:\n(a)     acquire, design, manufacture, construct, install or operate any device to the\ncontains any radioactive material or produce ionizing radiation including\nconsumer products, sealed sources, unsealed sources and radiation generators,\nincluding mobile radiography equipment;\n(b)     establish installations and facilities which contain radioactive materials or\ndevices which produce radiation including irradiation facilities, mines and mills\nprocessing radioactive ores, installations processing radioactive substances,\nnuclear installations and radioactive waste management facilities;\n(c)     explore for mines and mill, extract, acquire, handle, use for; medical, industrial,\nveterinary, or agriculture purposes, or for education, training or research, etc.,\nsell, lease, lend, buy, transfer, import, export, convert, enrich, produce, store,\nprocess, reprocess, fabricate, transport, dispose of any radioactive ores,\nradioactive material, nuclear substance or any other substance as the Authority\nmay, by notification in the official Gazette, specify; and\n(d)     treat food by ionizing radiation.\n(2) Subject to sub-section (1), the Authority may, on application made to it accompanied by\nsuch fee, information and documents, as may be prescribed by regulations, issue a licence for carrying\nout of such activities as are specified in the licence for such period as may be so specified.\n(3) The Authority may require an applicant to demonstrate by submitting the required\ninformation that the activity for which the license is required would not be hazardous to public or the\nenvironment.\n(4) The Authority may prescribe terms and conditions that may be attached to a licence.\n(5) The Authority may require the establishment of effective reporting procedure in respect of\nradiation accidents and ensure that the plans for mitigating the effects of nuclear incidents have been\nprepared."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Power to grant authorization",
      "content": "__(1) The Authority may, on application made to it\naccompanied by such fee, information and documents, as may be prescribed by regulations, grant an\nauthorization for carrying out of such activities as are specified in the authorization for such period as\nit tray specify.\n(2) The Authority may specify terms and conditions that may he attached to an authorization."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Authorization prior to licensing",
      "content": "No person shall commence construction of any\nnuclear installation without first obtaining an authorization for the purpose from the Authority\nas may be prescribed by regulations.\nExplanation. For the purposes of this section, “construction” includes the sitting, designing\nand construction of buildings for, and every stage of setting up of, a nuclear installation."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Authorization prior to radioactive waste discharge and disposal",
      "content": "_ No person shall\ndischarge, or dispose of; radioactive waste to the environment without first obtaining an authorization\nfor the purpose from the Authority as may be prescribed by regulations."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Authorization for nuclear powered vehicle, vessel or aircraft, and any vehicle, vessel",
      "content": "or aircraft carrying nuclear material.___ No person shah cause a nuclear powered vehicle, vessel\nor aircraft, and any vehicle, vessel or aircraft carrying nuclear material to enter in Pakistan\nwithout first obtaining an authorization for this purpose from the Authority as may be prescribed by\nregulations."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Cancellation or suspension of an authorization or a licence",
      "content": "_ (1) Where any person\nhas been found to have contravened any of' the provisions of this Ordinance, the rules and regulations,\nor has consistently failed to comply with the terms and conditions of an authorization or, as the case\nmay be, a licence, the Authority may, subject to sub-section (2), cancel or suspend the authorization\nor, as the case may be, the license.\n(2) Before taking any action under sub-section (1) the Authority shall issue a notice to such\nperson to, show cause and give him an opportunity of being heard or an opportunity to rectify the\nomission subject to such conditions as the Authority may specify."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Actions to be taken subsequent to cancellation or suspension of licence",
      "content": "_ In case the\nAuthority cancels or suspends a license under section 24, it may subsequently undertake all or any of\nthe following actions in respect of the installation or facility covered under the licence, namely:\n(a)    ask the licensee to put the installation or facility in safe State and Shut down the\ninstallation or facility;\n(b)    permit the licensee to continue operating the installation or facility under such\nterm and conditions as the Authority may specify; or\n(c)    appoint another person to take over the operation of the installation or facility."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Transitional",
      "content": "(1) Whoever before the commencement of this Ordinance is engaged in\nactivities requiring authorization or license under this Ordinance shall declare to the Authority and\nshall apply for grant of an authorization or, as the case may be, issue of a licence within six months\nfrom such commencement.\n(2) Pending action, on the application submitted pursuant to sub-section (1), the applicant may\ncontinue to pursue such activities referred to in sub-section (1), provided that all necessary measures\nto comply with the provisions of this Ordinance are taken immediately."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Control of contaminated foodstuff",
      "content": "No person shall sell, distribute or otherwise dispose\nof foods that have been contaminated by material producing ionizing radiation except as may be\nprescribed by regulations."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Power to obtain information",
      "content": "_ The Authority, any officer of the Authority or any other\nperson authorized in that behalf by the Authority may, by a notice, in writing, served on any person\nrequire such person to make such returns, at such time, and maintain such particulars as may\nbe specified in the notice in respect of all or any of the following matters, namely:__\n(a)     any such radioactive material, or nuclear substance specified in the notice as is\nin his possession or under his control;\n(b)     any plant in his possession or under his control designed or adapted for the\nproduction or use of atomic energy, ionizing radiation or radioactive material;\n(c)     any contract entered into by him or any right granted by or to him relating to\nsuch production or use as aforesaid; and\n(d)     any other information in his possession relating to any work carried out by him,\nor on his behalf or under his direction in connection with such production or\nuse."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Power of entry, inspection, etc",
      "content": "Any member of the Authority, any officer of the\nAuthority or any other person authorized in that behalf by the Authority may, at all reasonable hours,\nenter any premises, vehicle, vessel or aircraft for the purpose of satisfying himself as to whether the\nprovisions of this Ordinance and the rules and regulations made thereunder have been, are being\nadequately complied with and may—\n(a)     carry out any tests and investigations;\n(b)     obtain and analyse any samples;\n(c)     examine designs, drawings, records, memoranda, reports or documents\npertaining to the use, operation, maintenance or storage of any radiation\ngenerator or, as the case may be, nuclear substances or radioactive\nmaterials;\n(d)     inspect all measures and records pertaining to environmental and\npersonnel monitoring and disposal of radioactive wastes;\n(e)     obtain any other information required for the safety evaluation of any\nradiation generator or nuclear installation concerned; and\n(f)     lock and seal any nuclear installation or radiation generator, or any part\nthereof, where any nuclear substance or radiation generator is being\nused, stored, operated or maintained in contravention of the provisions\nof this Ordinance or the rules and regulations made thereunder."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Fixation of extent of civil liability",
      "content": "_ The Authority shall have the power to fix the extent\nof civil liability for an operator in case of various nuclear incidents."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Absolute and exclusive liability of an operator",
      "content": "An operator shall be absolutely and\nsolely liable for nuclear damage upon proof` that such damage has been caused by a nuclear\nincident___\n(a)     in his nuclear installation, however, caused such as handling, storage, use, etc.;\nand\n(b)     involving nuclear material coming from, or originating or originally received\nin, his nuclear installation."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Insurance or other financial guarantee",
      "content": "_ Every opera or of a nuclear installation shall\nmaintain insurance or other financial guarantee adequate to cover his civil liability for nuclear\ndamage, in such amount of such type and on such terms as the Authority may from time to time,\ndetermine."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Indemnity by the Federal Government",
      "content": "_ The Federal Government shall ensure\npayment of claims against any operator liable for nuclear damage and for such damage by providing\nnecessary funds to the extent that the yield of insurance or other financial guarantee maintained by the\noperator under section 32 falls short to satisfy such clams in full:\nProvided that in no case shall the civil liability of the Federal Government be more than fifteen\ntimes the insurance or the financial guarantee required to be carried by an operator of a nuclear\ninstallation:"
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Saving as to governmental and certain other installations",
      "content": "Nothing in section32 shall\napply to a nuclear installation owned and operated by the Federal Government and the Federal\nGovernment shall assume limited civil liability up to at least an amount to be determined by the\nAuthority for any nuclear damage in the event of a nuclear incident in any such nuclear installation."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Claim against foreign operators",
      "content": "_ In the event of nuclear incident occurring within\nPakistan and engaging the civil liability for nuclear damage of an operator in a country other than\nPakistan, jurisdiction over claims under this Ordinance shall be that of the Courts of competent\njurisdiction in Pakistan unless specifically provided otherwise by the terms of a contract in writing."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Limitation",
      "content": "(1) The right to compensation under this Ordinance shall be\nextinguished if any action is not brought within ten years from the date of the nuclear incident and\nwithin three years from the date on which the person suffering nuclear damage had knowledge of the\nnuclear damage provided that the period shall in no case exceed ten years.\n(2) Where nuclear damage is caused by a nuclear incident involving nuclear material which at\nthe time of the nuclear incident was stolen, lost, jettisoned or abandoned, the period established\npursuant to subsection (1) shall be computed from the date of that nuclear incident, but the period\nshall in no case exceed twenty years from the date of the theft, loss, jettison or abandonment."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Re",
      "content": "adjustment.__ Any person suffering nuclear damage, who has brought an action for\ncompensation within the period specified in section 36 may amend his claim to take into account any\naggravation of the damage, even after the expiry of that period, provided the final judgement has not\nbeen entered."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Environmental surveillance and radiation emergency plans.",
      "content": "(1) The Authority shall\nensure, implement and co-ordinate national programme of environmental surveillance to check any\nbuild-up of environmental radioactivity that might affect the public. Such programme shall be carried\nout in collaboration with various governmental, public or private bodies concerned.\n(2) The Authority shall ensure, co-ordinate and enforce preparation of emergency plans for\naction to be taken following foreseeable types of nuclear incidents that might affect the public. Such\nplans shall include arrangements for reporting and communication, the co- ordination of action\nbetween the various public bodies involved, the training of personnel and the provision of necessary\nfacilities and instrumentation.\n(3) If the radiation from environmental contamination by radioactive material reaches a level\nof intensity at which public health may be endangered, the Authority shall at once notify the Federal,\nProvincial, local and other authorities concerned who shall immediately take, in consultation with the\nAuthority, all necessary protective and safety measures.\n(4) The protective and safety measures referred to in sub-sections (1), (2) and (3) may include\nrestrictions on the movements of persons and objects such as confining people to their homes,\nisolating people and objects, limiting the transfer of persons and foods, curtailing or prohibiting sales\nof foodstuffs, farm products and the use of water, evacuating certain zones or forbidding entry thereto,\nrendering dangerous objects harmless, destroying animals and dispensing of the bodies.\n(5) If in the opinion of the Authority it is necessary, the Civil Defence Organization, the police\nor other law enforcing agencies or the Armed Forces may be called upon to assist in the\nimplementation of the measures specified in sub-section (4)."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Appointment of officers, employees and consultants",
      "content": "(1) Subject to the provisions of\nsub-section (3), the Authority may appoint such officers, employees and consultants as it may\nconsider necessary for the efficient performance of its functions on such terms and conditions as it\nmay deem fit.\n(2) The Authority may also borrow the services of officers, employees and consultants of\nother organizations on ouch terms and conditions as may be mutually settled between the lending\norganization and the Authority.\n(3) The method and procedure of appointment and the terms and conditions of service of\nofficers and employees shall be regulated by rules to be made with the prior approval of the Federal\nGovernment under Section 55:\nProvided that till such time such Rules are made under Section 55, the PAEC Service\nRegulations as amended from time to time shall, mutatis mutandis regulate appointments of officers\nand employees and the terms and conditions of their Service."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Funds of the Authority",
      "content": "The funds of the Authority shall comprise:\n(a)    funds of the Commission related to the Directorate of Nuclear Safety\nand Radiation Protection as transferred to the Authority under section\n54;\n(b)    grants from the Federal Government;\n(c)     grants from a Provincial Government;\n(d)    income from the grant of authorization and issue of licence;\n(e)    international grants; and\n(f)    receipts from such other sources as may be approved by the Authority."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Budget",
      "content": "(1) The Authority shall, in respect of each financial year, submit for the approval\nof the Federal Government, by such date and in such form as may be prescribed by rules, a statement\nshowing the estimated receipts and expenditures.\n(2) Any surplus of receipts over the actual expenditure in a year, after payment of tax, shall\nbe remitted to the Federal Consolidated Fund and any deficit from the actual expenditure shall be\nmade up by the Federal Government."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Audit and accounts",
      "content": "(1) The Authority shall maintain complete and accurate books of\naccounts of its actual expenses and receipts in such form and manner as the Federal Government may,\nin consultation with the Auditor-General of Pakistan, determine.\n(2) The accounts of the Authority shall be audited by the Auditor-General of Pakistan."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Offences",
      "content": "(1) Any person who contravenes any of the provisions of sections 19,20, 21, 22\nor 23 shall be punishable with imprisonment for a term which may extend to seven years, or with fine\nwhich may extend to one million rupees, or with both.\n(2) Any person who fails to furnish any return required under this Ordinance or the rules and\nregulations made thereunder, or willfully furnishes any false return or information, or obstructs any\nofficer or other person duly authorized under this Ordinance in the discharge of his duty thereunder,\nshall be punishable with imprisonment for a term which may extend to one year, or with fine which\nmay extend to 0.25 million rupees, or with both.\n(3) Any operator licensed under section 19 or any person authorized under sections20, 21, 22\nor 23, who contravenes any of the provisions of any rules or regulations made under this Ordinance,\nor any term or conditions imposed thereunder, shall be punishable with imprisonment for a term\nwhich may extend to three years, or with tine which may extend to 0.5 million rupees or with both.\n(4) Any person who fails to comply with, or contravenes any provisions, conditions or\nrequirements contained under this Ordinance or the rules and regulations made thereunder or commits\nan offence where no penalty is elsewhere provided, shall be punishable with imprisonment for a term\nwhich may extend to six months, or with fine which may extend to 0.1 million rupees, or with both\n(5) All Penalties and fines recovered by the Authority shall be credited to the Federal\nConsolidated Fund"
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Cognizance of offences",
      "content": "(1) No Court shall take cognizance of an offence punishable\nunder this Ordinance except upon complaint in writing made by the Authority or an officer of the\nAuthority authorized by it.\n(2) Notwithstanding anything contained in the Code of Criminal Procedure, 1898 (Act V of\n__\n1898)\n(a)    no Court inferior to that of a Judicial Magistrate of the first class shall try an\noffence punishable under this Ordinance;\n(b)    all offences under this Ordinance shall be non-bailable; and\n(c)    it shall be lawful for any Judicial Magistrate of the first class to pass any\nsentence authorized by this Ordinance.\n(3) The Authority, before filing a complaint under sub-section (1), shall give show cause\nnotice and opportunity of being heard to the licensee."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Tribunals",
      "content": "(1) The Authority may, from amongst its professional staff, establish special\ntribunals for resolving disputes between its Directorates and licensees or such other matters as the\nAuthority may assign.\n(2) The Authority's determinations on decisions by tribunals set up under sub-section (1) shall\nbe deemed to be decrees of a civil court under the Code of Civil Procedure,1908(Act V of 1908)."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Mode of recovery",
      "content": "All sums payable to the Authority under the provisions of this\nOrdinance and the rules and regulations made thereunder shall be recoverable as arrears of land\nrevenue."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Power to exempt",
      "content": "The Authority may, by notification in the official Gazette, exempt\nany activity, person, class of persons, quantity of a nuclear substance or radiation facility,\ntemporarily or permanently, from the application of all, or any of, the provisions of this Ordinance\nsubject to such conditions, as it may specify in the notification."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Submission of periodical reports, etc",
      "content": "The Authority shall submit to the Federal\nGovernment periodical reports, accounts statements, or any other report at such time and at such\nintervals as the Federal Government may specify."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Discoveries and inventions to vest in the Authority",
      "content": "_ All rights relating to\ndiscoveries and inventions and any improvements in materials, methods, processes, apparatus or\nequipment made by any officer or employee of the Authority in the course of his employment shall\nvest in the Authority."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Declaration of fidelity and secrecy",
      "content": "The chairman, every member, adviser, consultant,\nofficer or any other employee of the Authority shall, before entering upon his duties, shall make\ndeclaration of fidelity and secrecy as may be prescribed by rules."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Chairman, members, etc., to be public servants",
      "content": "The Chairman, members, officers\nand employees of the Authority shall, when acting or purporting to, act in pursuance of any of the\nprovisions of this Ordinance, be deemed to be public servants within the meaning of section 21 of the\nPakistan Penal Code 1860(Act XLV of 1860)."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Indemnity",
      "content": "No suit, prosecution or other legal proceedings shall lie against the\nAuthority, the Chairman, members, officers and servants of the Authority in respect of\nanything which is in good faith done or intended to be done under this Ordinance."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Dissolution of PNRB and DNSRP and transfer of rights and liabilities of the",
      "content": "Commission regarding DNSRP to the Authority.__ Upon commencement of this Ordinance the\nPakistan Nuclear Regulatory Board (PNRB) set up under the Prime Minster's Secretariat\nNotification, dated the 30th October, 1994, and the Directorate of Nuclear Safety and Radiation\nProtection (DNSRP) of the Commission set up under the Pakistan Nuclear Safety and Radiation\nProtection (PNSRP) Ordinance 1984, shall stand dissolved and upon such dissolution:—\n(a)     all assets, rights, powers, authorities and privileges, and all property, movable\nand immovable, cash and bank balances, reserve funds, investments and\nall other interests and rights in, or arising out of, such property and all debts,\nliabilities and obligations of whatever kind of the PNRB and of the\nCommissions relating to DNSRP subsisting immediately before its dissolution\nshall stand transferred to and vest in the Authority;\n(b)     all officers, consultants, advisers, auditors and other employees of the PNRB\nand of the Commission working in the DNSRP shall have option to remain on\nthe strength of the Commission or to join the Authority, those opting for the\nAuthority shall, notwithstanding anything contained in any law or in any\nagreement, deed, document or other instrument, stand transferred to the\nAuthority and shall be deemed to have been appointed or engaged by the\nAuthority in accordance with the terms and conditions of service prescribed by\nregulations, and no officer, consultant, adviser, auditor or other employee\nwhose services are so transferred shall be entitled to any compensation\nbecause of such transfer; and\n(c)     all debts and obligations, incurred or contracts entered into or rights acquired\nand all matters and things engaged to be done by, with or for the DNSRP, or\nwith or for the Commission related to DNSRP, before dissolution of DNSRP\nshall be deemed to have been incurred, entered into, acquired or engaged to be\ndone by, with or for the Authority."
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Power to make rules",
      "content": "_ The Authority may, with the approval of the Federal\nGovernment, by notification in the official Gazette, make rules for carrying out the purposes of this\nOrdinance."
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. Power to make regulations",
      "content": "(1) The Authority may, by notification in the official\nGazette, make regulations, not inconsistent with this Ordinance and the rules, for carrying out the\npurposes of this Ordinance.\n(2) In particular and without prejudice to the generality of the foregoing power, such\nregulations may provide for__\n(a)     charging and collection of fees in connection with its licensing and regulatory\nfunctions provided that such fees shall be imposed by regulations on the basis\nof such published criteria as the Authority deems appropriate, taking into\nconsideration among other criteria the nature of the activity authorized; and\n(b)     charging of consultation fees and expenses, etc., from the applicant for any\nservices provided, including the expenses of any consultation of experts."
    },
    {
      "provision_ref": "sec57",
      "section": "57",
      "title": "Section 57. Expenses for safety measures or medical examination",
      "content": "The expenses of any safety\nmeasures or medical examination carried out under this Ordinance or any regulations made\nthereunder shall be borne by the applicant."
    },
    {
      "provision_ref": "sec58",
      "section": "58",
      "title": "Section 58. Ordinance to override other laws",
      "content": "This Ordinance shall have effect notwithstanding\nanything contained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec59",
      "section": "59",
      "title": "Section 59. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to the provisions of this\nOrdinance, the Federal Government may make such orders not inconsistent with the provisions of\nthis Ordinance, as may appear to it to be necessary for the purpose of removing the difficulty:\nProvided that no such power shall be exercised after the expiry of one year from the\ncommencement of this Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "Authority",
      "definition": "the Pakistan Nuclear Regulatory Authority established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "authorization",
      "definition": "an authorization granted under section 20 or, as the case may be, sections 21, 22 or 23;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the Pakistan Atomic Energy Commission established under the Pakistan Atomic Energy Commission Ordinance, 1965(XVII of 1965);",
      "source_provision": "sec2"
    },
    {
      "term": "ionizing radiation",
      "definition": "any electromagnetic or particular radiation capable of producing ions, directly or indirectly in its passage through matter;",
      "source_provision": "sec2"
    },
    {
      "term": "license",
      "definition": "a license issued under section 19;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "nuclear damage",
      "definition": "loss of life, any personal injury or any loss of, or damage to, property which arises out of or results from the radioactive properties or a combination of radioactive properties with toxic, explosive or other hazardous properties of nuclear substance, radioactive materials or radioactive products or waste in, or of nuclear material coming from, originating in, or sent to, a nuclear installation, or from the ionizing radiation emitted by any other source of radiation inside a nuclear installation;",
      "source_provision": "sec2"
    },
    {
      "term": "nuclear fuel",
      "definition": "any material which is capable of producing energy by self sustaining chain process of nuclear fission, nuclear fusion or other nuclear transmutation;",
      "source_provision": "sec2"
    },
    {
      "term": "nuclear incident",
      "definition": "any occurrence, or series of occurrences having the same origin which causes nuclear damage or but only with respect to preventive measures, creates a grave and imminent threat of causing such damage;",
      "source_provision": "sec2"
    },
    {
      "term": "nuclear substance",
      "definition": "any substance or nuclear material which the Authority determines as being a substance or material which may be used for production of or use in atomic energy or for research into matters connected therewith and includes all substances obtained or obtainable from the soil or water by under-ground or surface working or from the atmosphere;",
      "source_provision": "sec2"
    },
    {
      "term": "person",
      "definition": "any individual, corporation, partnership, firm, association, trust, estate, public or private institution, group, Government agency, any state or any political sub-division or any political entity within a state, any foreign Government or nation, or other entity and includes any legal successor, representative, agent or agency of any of the aforesaid;",
      "source_provision": "sec2"
    },
    {
      "term": "radiation generator",
      "definition": "a device or an apparatus capable of generating radiation, such as X-rays, neutrons, electrons, or other charged particles, which may be used for scientific, industrial or medical purposes;",
      "source_provision": "sec2"
    },
    {
      "term": "radioactive material",
      "definition": "any substance which contains or consists of radioactive nuclide, naturally occurring or 'artificially produced, provided that prescribed by regulations;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Ordinance; and",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Ordinance.",
      "source_provision": "sec2"
    }
  ]
}
