{
  "id": "pk-pakistan-ordinance-factories-board-ordinance-1961-ftzz9s",
  "type": "statute",
  "title": "Pakistan Ordinance Factories Board Ordinance, 1961",
  "title_en": "Pakistan Ordinance Factories Board Ordinance, 1961",
  "short_name": "POFBO",
  "status": "in_force",
  "issued_date": "1961-05-14",
  "in_force_date": "1961-05-14",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NpbZc%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Ordinance Factories Board Ordinance, 1961 (XVII of 1961) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Dissolution of the Board",
      "content": "ORDINANCE NO. XVII OF 1961\n[15th May, 1961]\nAn Ordinance to provide for the constitution of a Pakistan Ordnance Factories Board\nand for investing it with certain powers and functions of the Central Government in relation to\nWHEREAS it is expedient to provide for the constitution of a Pakistan Ordnance Factories\nBoard and for investing it with certain powers and functions of the Central Government in relation to\nthe ordnance factories;\nNOW, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958,\nand in exercise of all powers enabling him in that behalf, the President is pleased to make and\npromulgate the following Ordinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Ordinance may be called the Pakistan Ordnance\nFactories Board Ordinance, 1961.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context,",
      "content": "1\n[*               *                    *                    *                 *    *          *]\n(b)        “Board” means the Pakistan Ordnance Factories Board constituted under this\nOrdinance;\n(c)        “Chairman” means the Chairman of the Board;\n(d)        “factory” means an ordnance factory owned by the 2[Federal Government];\n(e)        “member” means a member of the Board."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Constitution of the Board",
      "content": "(1) As soon as may be after the commencement of this\nOrdinance, the 2[Federal Government] shall, by notification3 in the official Gazette, constitute, for\ncarrying out the purposes of this Ordinance, a Pakistan Ordnance Factories Board consisting of 4[5[six]\nmembers] appointed by it.\n(2) The 2[Federal Government] shall appoint one of the members to be the Chairman of the\nBoard, one to be the Financial Adviser to the Board 4[,] the third to be the Director of the Industrial\nand Commercial Relations of the Board 4[ 5[,] the fourth to be the Member Production Coordination\nof the Board] 5[, the fifth member to be called Member (Private) who shall be appointed from the\ncorporate sector on the recommendation of the Secretary, Defence Production Division, and the sixth\nmember shall be the Member Ministerial Co-ordination to be nominated by the Federal Government.]\n1\nCl. (a) omitted by F.A.O., 1975, Art. 2 and Sch.,\n2\nSubs. by F.A.O., 1975, Act 2 and table, for “Central Government”.\n3\nFor such Notification see, Gaz of P., 1961, Ext., p. 1125.\n4\nSubs. and added by The Pakistan Ordnance Factory Board (Amdt.) Ordinance, 1983 (28 of 1983), S.2.\n5\nSubs. and added by Ord. LVIII of 2001, S.2&3."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Terms of office of the members",
      "content": "(1) A member shall hold office for a term of four years\nunless sooner required to vacate by the 1[Federal Government] and shall be eligible for re-appointment\nand shall receive such salary allowances as the 1[Federal Government] may fix[:]2\n2\n[Provided that the Member (Private) shall hold office in honorary capacity.]\n(2) Every member shall be a whole time officer of the Board and shall perform such functions\nas are or may be assigned to him by or under this Ordinance.\n(3) Every member 2[, except Member (Private),] shall, before assuming his office as such,\nrelinquish or divest himself of any office or interest in any corporation, company or concern other than\nan industry owned by the 1[Federal Government] or sponsored by the Board."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Meetings",
      "content": "(1) No business of the Board shall be transacted except at a meeting at which\na quorum of 3[three members] is present.\n(2) The Chairman and in his absence a member nominated by him shall preside at the meetings\nof the Board.\n(3) At the meetings of the Board each member shall have one vote and, in the event of equality\nof votes, the Chairman or the member presiding shall have a second or casting vote."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Functions of the Board",
      "content": "(1) The principal function of the Board shall be to manage and\nadminister the affairs of the factories and to run them on sound commercial lines so as to adequately\nmeet during war and peace the needs of the defence of the country and to utilise the surplus capacity\nof the factories to meet the needs of the civilian population.\n(2) The Board shall, in discharging its functions, be guided on question of policy involving\nnational interest, including defence requirements during war and peace, by such directions as the\n1\n[Federal Government], which shall be the sole judge whether or not national interest is involved, may\ngive from time to time."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Investment of the Board with certain powers",
      "content": "Notwithstanding anything contained in\nany law, regulation, rule, order, notification, agreement or other instrument for the time being\napplicable to any factory, or any officer or other employee appointed or engaged in, or in connection\nwith, any factory, the Board may, in relation to such factory, officer or employee, exercise the\nfollowing powers of the 1[Federal Government], or of any officer authorized for the purpose by the\n1\n[Federal Government], that is to say,—\n(a)        to determine the terms and conditions of service, recruitment, promotion,\ntransfer, posting,, dismissal, discharge, demotion and other disciplinary actions\nof all officers and other employees:\nProvided that the terms and conditions of service of any officer or other\nemployee appointed or engaged before the commencement of this Ordinance\nshall not be varied to his disadvantage and that he shall not be dismissed or\nremoved from service or reduced in rank by any authority subordinate to that\nby which he was appointed;\n________________________________________________________________________________\n1\nSubs. by F.A.O., 1975 Art. 2 and Table for “Central Government”.\n2\nSubs. added and ins. by Ord. LVIII of 2001, s. 3.\n3\nSubs. by the Pakistan Ordnance Factory Board (Amdt.) Ordinance, 1983 (28 of 1983), S.3. for “two members”\n(b)        to appoint or engage such officers and other employees, advisers, consultants\non contract as it consider necessary for the efficient discharge of its functions\non such terms and conditions of service as it may determine;\n(c)         to carry out all technical and engineering projects or works or to enter into\ncontract or agreement pertaining to their execution;\n(d)         to make all purchases of plant, machinery and stores either in the country or\nabroad in such manner as it thinks fit and also to dispose of stores and\nequipment;\n(e)         to fix pay of the officers and other employees wherever necessary either\ninitially or otherwise at any stage within the pay scales prescribed by the\n1\n[Federal Government];\n(f)         to utilise or incur expenditure in respect of lump sum grant allocated for the\npurpose in the Budget; and\n(g)        subject to any direction issued in this behalf by the 1[Federal Government], to\nframe departmental financial and accounting rules and procedure."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Submission of estimates of receipts and expenditures to the Federal Government",
      "content": "(1)\nThe Board shall, in the month of November every year, submit, in such manner and form as the\n1\n[Federal Government] may direct, to the 1[Federal Government], for making necessary provision in\nits Budget, a statement of the estimated receipts and expenditure pertaining to the discharge of its\nfunctions under this Ordinance in respect of the new financial year together with a statement showing\nseparately the estimated receipts and expenditure in foreign exchange for that year.\n(2) The Board shall not, without the previous sanction of the 1[Federal Government], incur any\nexpenditure, or undertake any financial liability involving expenditure, in excess of the amount\nprovided for in the Budget."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Accounts and audit",
      "content": "(1) The Board shall maintain its accounts including those of the\nfactories in such manner and form as may be prescribed by the 1[Federal Government] in consultation\nwith the Auditor-General.\n(2) The accounts of the Board including those of the factories shall be audited by the Auditor-\nGeneral.\n(3) The Board shall, as soon as possible after the end of every financial year, submit to the\n1\n[Federal Government] the statement of accounts audited by the Auditor-General.\n(4) The 1[Federal Government] may at any time require the Auditor-General to report to it upon"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Submission of annual report, returns, etc",
      "content": "(1) The Board shall, as soon as possible\nafter the end of every financial year but not later than the thirty-first day of December next following,\nsubmit to the 1[Federal Government] a report on the conduct of the affairs of the Board during that\nyear.\n_________________________________________________________________________________\n1\nSubs. by F.A.O., 1975 Art. 2 and Table for “Central Government”.\n(2) The 1[Federal Government] may require the Board to furnish it with —\n(a)       any return, statement, estimate, statistics or other information regarding any\nmatter relating to, or under the control of, the Board;\n(b)       a report on any subject with which the Board is concerned; or\n(c)       any document or copy in charge or under the control of the Board,\nand the Board shall comply with such requisition."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Delegation of powers",
      "content": "Subject to any rules made in this behalf by the 1[Federal\nGovernment], the Board may, by general or special order, direct that any of its powers, functions and\nduties under this Ordinance shall be exercised, performed or discharged also by the Chairman or any\nother member or any officer of the Board specified in the order."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Mode of signifying communications from the Board",
      "content": "Any notice, determination,\ndirection, requisition, appointment, expression of opinion, approval or sanction to be given or signified\non the part of the Board for any of the purposes of, or in relation to, any powers or functions with\nwhich it has been invested under this Ordinance, shall be sufficient and binding if it is in writing signed\nby the Chairman or by any other person authorized by the Board to act in its behalf in respect of the\nmatters to which such authorization may relate, and the Board shall not in any case be bound in respect\nof any of the matters aforesaid unless by some writing signed in the manner aforesaid."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Power to issue directions",
      "content": "The 1[Federal Government] may, from time to time, issue\ndirections to the Board to take such measures as it considers necessary for the efficient management\nof the factories and the Board shall comply with such directions."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Power to make rules",
      "content": "The 1[Federal Government] may make rules for carrying out the\npurposes of this Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Pakistan Ordnance Factories Board constituted under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "factory",
      "definition": "an ordnance factory owned by the 2[Federal Government];",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of the Board.",
      "source_provision": "sec2"
    }
  ]
}
