{
  "id": "pk-pta-content-rules-2020",
  "type": "statute",
  "title": "Pakistan Telecommunication Authority (Removal and Blocking of Unlawful Online Content) Rules 2020",
  "title_en": "PTA Removal and Blocking of Unlawful Online Content Rules 2020",
  "short_name": "PTA-RBUOC",
  "status": "in_force",
  "issued_date": "2020-11-19",
  "in_force_date": "2020-11-19",
  "url": "https://www.pta.gov.pk/en/media-center/single-media/rules-removal-and-blocking-of-unlawful-online-content-rbuo-rules-2020",
  "description": "The PTA Removal and Blocking of Unlawful Online Content Rules 2020 establish the regulatory framework for the identification, removal and blocking of unlawful online content in Pakistan. The Rules define categories of prohibited content, establish the procedures for issuing removal orders to social media companies and internet service providers, set timeframes for compliance, and establish an appeal mechanism for persons aggrieved by blocking decisions.",
  "provisions": [
    {
      "provision_ref": "rule1",
      "section": "1",
      "title": "Rule 1. Short Title and Commencement",
      "content": "These Rules shall be called the Removal and Blocking of Unlawful Online Content (Procedure, Oversight and Safeguards) Rules, 2020. They shall come into force at once upon publication in the official Gazette. The Rules apply to all social media companies providing services or hosting content accessible to users in Pakistan, regardless of whether such companies have a physical presence or establishment in Pakistan. The Rules apply equally to licensed telecommunications service providers, internet service providers, internet exchange operators, and other intermediaries. The Rules are made in exercise of powers conferred by section 37 and other applicable provisions of the Prevention of Electronic Crimes Act, 2016. Compliance with these Rules is mandatory and failure to comply may result in blocking of access to the non-compliant platform."
    },
    {
      "provision_ref": "rule2",
      "section": "2",
      "title": "Rule 2. Definitions",
      "content": "In these Rules: 'Authority' means the Pakistan Telecommunication Authority; 'online information system' means any information system on the internet including all websites, web applications, software applications, social media platforms, and any other digital service accessible to users in Pakistan; 'social media company' means a company that owns or operates a social media platform enabling users to generate, share or view content; 'unlawful online content' means any online content which is in contravention of any provision of the Pakistan Penal Code, Prevention of Electronic Crimes Act 2016, or any other applicable law of Pakistan, or which is against the glory of Islam, against the integrity, security or defence of Pakistan, against friendly relations with foreign states, against public order, decency or morality."
    },
    {
      "provision_ref": "rule3",
      "section": "3",
      "title": "Rule 3. Categories of Unlawful Online Content",
      "content": "Without limiting the generality of the term 'unlawful online content', the following categories of content are considered unlawful and subject to removal or blocking under these Rules: (a) content that is blasphemous or defamatory of religious figures, religions or sects; (b) content that instigates violence, hate speech, or incitement to religious or sectarian hatred; (c) content involving child sexual abuse material; (d) content that glorifies or promotes terrorism or extremism; (e) content that infringes the copyright or intellectual property rights of any person; (f) content that relates to the private sexual images of a real person shared without consent; (g) content that constitutes cyberstalking, harassment or defamation; (h) content that is likely to cause harm to the sovereignty, integrity or security of Pakistan; (i) content promoting gambling, drug use or other activities illegal under Pakistani law. Social media companies shall maintain up-to-date content policies aligned with Pakistani law."
    },
    {
      "provision_ref": "rule4",
      "section": "4",
      "title": "Rule 4. Procedures for Blocking or Removal of Content",
      "content": "Upon receipt of a complaint from any person or on its own motion, the Authority may issue a direction to a social media company or internet service provider to remove or block access to any specific content that the Authority believes constitutes unlawful online content. The Authority shall issue a direction in the form of a notice providing: the identity of the content, including its URL or other identifying information; the ground upon which the Authority considers the content to be unlawful; the date by which the content must be removed or blocked; and the mechanism for the company to contest the notice. The social media company or internet service provider shall comply with the direction within twenty-four hours for content involving child sexual abuse material, terrorism or incitement to imminent violence, and within forty-eight hours for all other categories of unlawful content. Failure to comply within the specified timeframe shall entitle the Authority to block access to the platform."
    },
    {
      "provision_ref": "rule5",
      "section": "5",
      "title": "Rule 5. Obligations of Social Media Companies",
      "content": "Social media companies providing services accessible to users in Pakistan shall: (a) register with the Authority and designate a focal person resident in Pakistan for compliance purposes; (b) establish a local office or appoint a local representative authorized to receive and respond to legal process in Pakistan; (c) provide a mechanism for Pakistani users to report unlawful content, and notify users of the decision taken in response to their report; (d) maintain a record of all content removal actions taken in respect of Pakistani users; (e) report to the Authority quarterly on the number and nature of content removal actions taken; (f) implement geo-restriction capabilities to restrict access to specific content for users in Pakistan when required by the Authority; (g) maintain data of Pakistani users on servers located in Pakistan or provide access to user data when lawfully required by competent authorities. Social media companies shall respond to emergency law enforcement requests within six hours."
    },
    {
      "provision_ref": "rule6",
      "section": "6",
      "title": "Rule 6. Suspension of Access to Social Media Platforms",
      "content": "Where a social media company fails to comply with a lawful direction of the Authority within the specified timeframe, the Authority may, after issuing a notice to the company and providing it with a reasonable opportunity to be heard, order telecommunications service providers and internet service providers to suspend access to the non-compliant platform within Pakistan. The suspension order shall: specify the social media platform to be suspended; state the basis for the suspension; specify the conditions that must be met for the suspension to be lifted; and be communicated to the company simultaneously with the order to suspend access. The suspension shall be lifted upon the company's compliance with the outstanding direction. Where a suspension has been in effect for more than ninety days, the Authority shall review the suspension and determine whether it should be continued, modified or lifted. A suspension order may be appealed to the High Court."
    },
    {
      "provision_ref": "rule7",
      "section": "7",
      "title": "Rule 7. Appeal Mechanism",
      "content": "Any person aggrieved by a content removal direction or blocking order of the Authority may: (a) within fifteen days of the direction, file a complaint with the Authority seeking reconsideration of the direction, setting out the reasons why the direction is erroneous or inappropriate; (b) where the Authority does not revoke or modify the direction within fifteen days of the complaint, file an appeal before the High Court of competent jurisdiction. The Authority shall constitute an internal review committee to examine complaints about content removal directions and shall decide complaints within thirty days of filing. The complainant may be assisted by a legal representative in the appeal proceedings. Content blocked pending appeal shall be restored if the court determines that the blocking was unlawful or disproportionate. User-generated content removed pursuant to an erroneous direction shall be restored without any change."
    },
    {
      "provision_ref": "rule8",
      "section": "8",
      "title": "Rule 8. Safeguards and Oversight",
      "content": "The Authority shall implement the following safeguards in exercising its powers under these Rules: (a) all directions shall be issued in writing and be reasoned; (b) except in cases of emergency, affected parties shall be given an opportunity to be heard before a blocking direction is issued; (c) blocking directions shall be proportionate to the harm sought to be prevented; (d) the Authority shall make publicly available aggregate statistics on content removal and blocking actions taken; (e) the Authority shall submit a quarterly report to the Ministry of Information Technology on the directions issued under these Rules; (f) a Complaint Council including members of civil society shall be constituted to advise the Authority on the exercise of its powers. An independent annual audit of the Authority's use of its content removal powers shall be conducted and the results made available to Parliament. The Ministry of Information Technology shall report to Parliament annually on the implementation of these Rules."
    },
    {
      "provision_ref": "rule9",
      "section": "9",
      "title": "Rule 9. Emergency Powers",
      "content": "In case of an emergency where there is a clear and imminent threat to public safety, national security, or the integrity of Pakistan, the Authority may issue an emergency direction to internet service providers or social media companies to block access to specific content or services without prior notice to the company. An emergency direction shall: specify the nature of the emergency; identify the specific content or service to be blocked; state the legal basis for the emergency direction; and be valid for a period not exceeding seventy-two hours, after which it shall be reviewed and either revoked or replaced with a direction issued pursuant to the normal procedure. Emergency directions shall be logged and shall be included in the quarterly report submitted to the Ministry. The use of emergency powers shall be subject to post-facto review by the Complaint Council. Emergency powers shall not be used as a routine substitute for the normal direction procedure."
    }
  ],
  "definitions": [
    {
      "term": "unlawful online content",
      "definition": "Online content in contravention of any provision of the Pakistan Penal Code, Prevention of Electronic Crimes Act 2016, or other applicable Pakistani law, or against the glory of Islam, against Pakistan's integrity, security or defence, against friendly relations with foreign states, against public order, decency or morality.",
      "source_provision": "rule2"
    },
    {
      "term": "social media company",
      "definition": "A company that owns or operates a social media platform enabling users to generate, share or view content, including all platforms accessible to users in Pakistan regardless of the company's country of incorporation.",
      "source_provision": "rule2"
    },
    {
      "term": "geo-restriction",
      "definition": "Technical capability to restrict access to specific content for users in a particular geographic territory, such as Pakistan, while keeping such content available to users in other territories.",
      "source_provision": "rule5"
    }
  ]
}
