{
  "id": "pk-pakistan-plant-quarantine-act-1976",
  "type": "statute",
  "title": "Pakistan Plant Quarantine Act, 1976",
  "title_en": "Pakistan Plant Quarantine Act, 1976",
  "short_name": "PPQA",
  "status": "in_force",
  "issued_date": "1976-11-30",
  "in_force_date": "1976-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2hu-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Plant Quarantine Act, 1976 (LXXV of 1976) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Pakistan\nPlant Quarantine Act, 1976.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or",
      "content": "context,—\n(a)         “Convention” means the International Plant Protection Convention, 1951;\n(b)        “crop” includes all agricultural or horticultural crops and all trees, bushes,\ngrass or plants;\n(c)         “import” means the bringing or taking by sea, land or air across any customs\nfrontier as defined by the Federal Government and includes transportation by\nany means from one Province to another or from one place to another within a\nProvince;\n(d)         “infection” means infection by any insect, fungus, or other pest injurious to a\ncrop or plant;\n(e)         “pest” means any living stage of any or all insects, mites, nematodes, slugs,\nsnails, protozoa, or other invertebrate animals, fungi, bacteria, or other\nparasitic plants or reproductive parts thereof, virus or any organism, or any\ninfectious substance which may directly or indirectly injure or cause disease to\nany crop or plant; and\n(f)         “plant” means all species of plants or parts thereof whether living or dead\nincluding stemps, branches, tubers, bulbs, corms, stocks, budwood, cuttings,\nlayers, slips, suckers, roots, green-scum on stagnant pools, leaves, flowers,\nfruits and seeds.\n1\nFor Statement of Objects and Reasons, see Gaz. of P., 1976. Ext., Pt., III, p. 692."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Power to prohibit or regulate import of certain articles",
      "content": "(1) The Federal Government\nmay, by notification in the official Gazette, prohibit, restrict or otherwise regulate, subject to such\nconditions as it may think fit to impose, import of any article or class of articles likely to cause\ninfection to any crop or plant, or of any pest generally or any class of pests.\n(2) A notification under this section may specify any article or class of articles or any pest or\nclass of pests either generally or in any particular manner, whether with reference to the country of\norigin, or the route by which imported or otherwise.\n(3) Any condition imposed under a notification under this section may require—\n(a)     compliance with the provisions of the Convention;\n(b)     examination by authorised persons of goods articles of plant origin and pests\nbrought in or to be taken out;\n(c)     obtaining of certificate of non-infection; and\n(d)     treatment or detention, confiscation and destruction of infected goods or\narticles of plant origin."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Operation of notification under section 3. A notification under section 3 shall operate as",
      "content": "if it has been issued under section 16 of the Customs Act, 1969 (IV of 1969); and the officers of\ncustoms shall have the same powers in respect of any goods, articles of plant origin or pests in\nrespect of which such a notification has been issued as they have for the time being in respect of\nany article the importation of which is prohibited or restricted under the said Act, and all the\nprovisions of that Act shall have effect accordingly."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Goods and articles import or transportation of which prohibited not to be carried",
      "content": "When a notification has been issued under section, 3 then, notwithstanding anything contained in any\nother law for the time being in force, the person responsible for the booking of goods or parcels at\nany port, railway station, airport or other place,—\n(i)     where the notification prohibits import, shall refuse to receive for carriage at,\nor to forward, or knowingly allow to be carried by sea, air, land, rail or other\ncarrier from that port, station, airport or place anything of which the import\nhas been prohibited; and\n(ii)    where the notification imposes any conditions upon import, shall so refuse\nunless the prescribed documents showing that the conditions have been\nfulfilled are produced."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Penalty. Whoever contravenes or attempts to contravene any of the provisions of this Act,",
      "content": "or of any rules made or notification issued thereunder, shall, without prejudice to any confiscation\nor penalty to which he may be liable under the provisions of the Customs Act, 1969 (IV of 1969) as\napplied by section 4, be punishable with fine which may extend to five hundred rupees and, upon\nany subsequent conviction, with imprisonment for a term which may extend to six months, or\nwith fine which may extend to two thousand rupees, or with both."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Cognizance of offence. No Court shall take cognizance of any offence under this Act",
      "content": "except upon complaint in writing made by any officer authorised by the Federal Government in this\nbehalf."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Indemnity. No suit, prosecution or other legal proceeding shall lie against any person for",
      "content": "anything which is in good faith done or intended to be done under this Act."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Delegation of powers. The Federal Government may delegate to a Provincial",
      "content": "Government, or to any officer or authority of such Government, any of its powers under this Act in\nso far as it relates to the prohibition or restriction of bringing or taking into or out of any place\nfrom or to another place within a Province or to the transportation from one place to another within\na Province or to the sale of goods or articles of plant origin imported in contravention of any of the\nprovisions of this Act."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Power to make rules",
      "content": "(1) The Federal Government may, by notification in the official\nGazette, make rules for carrying out the purposes of this Act.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules\nmay provide for all or any of the following matters, namely:—\n(a)    the method and manner of examination and treatment of goods and articles of\nplant origin likely to cause infection to any crop or plant;\n(b)    the form of certificate of non-infection;\n(c)    the documents to be produced before goods or articles of plant origin are\naccepted for carriage; and\n(d)    the fees to be levied under this Act."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. [Repeal.] Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981",
      "content": "(XXVII of 1981), s. 3 and Sen., II.\n______________\nLast uploaded on 13.11.2023"
    }
  ],
  "definitions": [
    {
      "term": "Convention",
      "definition": "the International Plant Protection Convention, 1951;",
      "source_provision": "sec2"
    },
    {
      "term": "crop",
      "definition": "all agricultural or horticultural crops and all trees, bushes, grass or plants;",
      "source_provision": "sec2"
    },
    {
      "term": "import",
      "definition": "the bringing or taking by sea, land or air across any customs frontier as defined by the Federal Government and includes transportation by any means from one Province to another or from one place to another within a Province;",
      "source_provision": "sec2"
    },
    {
      "term": "infection",
      "definition": "infection by any insect, fungus, or other pest injurious to a crop or plant;",
      "source_provision": "sec2"
    },
    {
      "term": "pest",
      "definition": "any living stage of any or all insects, mites, nematodes, slugs, snails, protozoa, or other invertebrate animals, fungi, bacteria, or other parasitic plants or reproductive parts thereof, virus or any organism, or any infectious substance which may directly or indirectly injure or cause disease to any crop or plant; and",
      "source_provision": "sec2"
    },
    {
      "term": "plant",
      "definition": "all species of plants or parts thereof whether living or dead including stemps, branches, tubers, bulbs, corms, stocks, budwood, cuttings, layers, slips, suckers, roots, green-scum on stagnant pools, leaves, flowers, fruits and seeds. 1 For Statement of Objects and Reasons, see Gaz. of P., 1976. Ext., Pt., III, p. 692.",
      "source_provision": "sec2"
    }
  ]
}
