{
  "id": "pk-pakistan-railways-police-act-1977",
  "type": "statute",
  "title": "Pakistan Railways Police Act, 1977",
  "title_en": "Pakistan Railways Police Act, 1977",
  "short_name": "PRPA",
  "status": "in_force",
  "issued_date": "1977-01-08",
  "in_force_date": "1977-01-08",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2hv-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Railways Police Act, 1977 (VII of 1977) published by The Pakistan Code (Police Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, application and commencement",
      "content": "(1) This Act may be called the\nPakistan Railways Police Act, 1977.\n(2) It extends to the whole of Pakistan.\n(3) It shall apply to all members and officers of the Pakistan Railways Police wherever they\nmay be.\n(4) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(a)        ‘Chief Executive’ means a person appointed by the Federal Government\nto manage the Pakistan Railways, by whatever name called;\n(b)        ‘Code’ means the Code of Criminal Procedure, 1898 (Act V of 1898).\n(c)        ‘competent authority’ means any officer or authority designated as such by\nthe Federal Government;\n(d)        ‘Inspector-General’ means the Inspector-General of the Pakistan Railways\npolice or any person for the time being performing the duties of the Inspector-\nGeneral;\n1\nFor Statement of Objects and reasons, see Gaz., of P., 1976 Ext., Pt. III, pp. 1230-31.\n2\nSubs. by Ord. 92 of 02, s 44, sch.\n(e)        ‘member’ means a person, other than an officer, who is appointed to the\nPakistan Railways Police and has signed an affirmation in the form set out in\nthe First Schedule;\n(f)         ‘offence’ means an offence punishable under this Act or under any other law\nfor the time being in force;\n(g)         ‘officer’ means a person who is so appointed to the Pakistan Railways Police\nand has signed an affirmation in the form set out in the First Schedule;\n(h)         ‘Officer-in-Charge of Railway Police Station’ means any person appointed as\nsuch by the competent authority and includes, when the officer-in-charge of\nthe Railway Police Station is absent from the station-house or is unable by\nreason of illness or any other cause to perform his duties, the member\npresent at the station-house who is next in rank to such officer and is above\nthe rank of a constable;\n(i)         ‘Provincial Police’ means the police constituted            by   a   Provincial\nGovernment under the Police Act, 1861 (V of 1861).\n(j)         ‘Railway’ means railway as defined in the Railways Act, 1890 (IX of\n1890) including rolling stock as defined in the said Act, but excluding—\n(i)     such lines of rail as lie outside the territorial limits notified under\nsection 3; and\n(ii)    such fixed installations as lie outside the territorial limits notified\nunder section 3 and are classified by the Federal Government as key\npoints;\n1\n[(ja) “railway employee” means railway employee as defined in the Railway\nRegulatory Authority Ordinance, 2002 ( of 2002)]\n(k)         ‘regulations’ means regulations made under this Act; and\n(l)         ‘rules’ means rules made under this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Power to constitute, control and maintain the Pakistan Railways Police and its",
      "content": "functions.—(1) Notwithstanding anything contained in any other law for the time being in force, the\nFederal Government may constitute, control and maintain a force to be called the Pakistan Railways\nPolice for performing, within such territorial limits as the Federal Government may, by notification\nin the official Gazette, specify the following functions, namely:—\n1\nIns. by Ord. 92 of 2002 s. 44 and Sch.\n(a)        preventing loss to Railway property and property consigned to the Railways\nand prevention of offences in respect thereof;\n(b)        ensuring proper conduct of persons on the Railways;\n(c)        general maintenance of law and order on the Railways and taking cognizance\nof offences committed on them;\n(d)        to render all possible assistance to passengers and 1[railway employees;]\n(e)        to protect travellers from injury to person or property;\n(f)        to keep Railway platforms and other Railway premises clear of idlers and\nbeggars and to keep a lookout for suspicious persons, smugglers and persons\ntravelling with arms without a licence or in contravention of rules, regulations\nor orders for the time being in force;\n(g)        to search empty carriages for property left behind by passengers and to take\npossession of such property for due disposal under the law;\n(h)        to control and regulate movement and parking of hackney carriages and\nmechanically propelled vehicles at Railway Stations and to enforce the\nregulations of the Railway authorities with regard to them;\n(i)        to bring to the notice of the appropriate Railway authorities any\ncontravention, breach or violation of any law of which the Pakistan\nRailways Police cannot itself take cognizance; and\n(j)        such other functions connected with the purposes of this Act as the\nFederal Government may, by notification in the official Gazette, require the\nPakistan Railways Police to perform.\n(2) Without prejudice to the powers conferred on it by or under this Act, the Federal\nGovernment may, in relation to the Pakistan Railways Police exercise all powers which, under\nrelation to the Provincial Police."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Constitution superintendence and administration of the Pakistan Railways",
      "content": "Police.__(1) The Pakistan Railways Police shall be constituted in such manner as may be\nprescribed by rules.\n(2) The head of the Pakistan Railways Police shall be an Inspector-General who shall\nadminister it in accordance with the provisions of this Act and the rules and regulations, and such\norders and instructions as may be made or issued by the Federal Government from time to time.\n1\nSubs., of Ord. 92 of 2002, s.44 and sch.\n(3) The Inspector-General shall exercise his powers and perform his functions under the\ngeneral supervision of the Chief Executive."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Transfer of Provincial Railway Police and Railway Watch and Ward to the Pakistan",
      "content": "Railways Police.—(1) Notwithstanding anything contained in any other law for the time being in\nforce or any contract, agreement or any condition of service, —\n(a)    all persons holding any rank or post, not above the rank or post of\nSuperintendent, in or under the Railway Police of any Province; and\n(b)    all persons holding any rank or post in the Railway Watch and Ward;\nshall, subject to such conditions as may be laid down by the Federal Government, stand transferred\nand appointed to such corresponding ranks or posts in or under the Pakistan Railways Police as may\nbe notified by the Federal Government.\n(2) If, at any time, the Federal Government considers that the services of any person referred\nto in clause (a) of sub-section (1) are no longer needed by the Pakistan Railways Police, the Federal\nGovernment may, by order in writing, revert such person to the Police of the Province, to which he\nbelonged immediately before the commencement of this Act."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Ordinance No. XXIII of 1969 not to apply to the Pakistan Railways Police. Nothing",
      "content": "contained in the Industrial Relations Ordinance, 1969 (XXIII of 1969), shall apply to, or in\nrelation to, the Pakistan Railways Police."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Appointment of officers of the Pakistan Railways Police. For the purposes of this",
      "content": "Act, the Federal Government may, by notification in the official Gazette, appoint any person to be—\n(a)    the Inspector-General of the Pakistan Railways Police ;\n(b)    a Deputy Inspector-General of the Pakistan Railways Police;\n(c)    a Superintendent of the Pakistan Railways Police; and\n(d)    an officer with any other designation."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Appointment of members and ministerial staff",
      "content": "(1) The Inspector-General, or an\nofficer to whom the power is delegated by the Inspector-General, may appoint members and\nministerial staff and determine the duties to be performed by them.\n(2) Appointments under sub-section (1) shall be made by direct recruitment or promotion or\ntransfer from any other force or any department of the Federal Government or a Provincial\nGovernment in such manner as may be prescribed by rules.\n(3) The officers and members and ministerial staff shall receive such pay, pension,\nallowances and other remuneration, and shall enjoy such other privileges, as may be prescribed by\nrules.\n(4) Every officer and member, other than the Inspector-General, shall receive a certificate in\nthe form set out in the Second Schedule under the seal of the Inspector-General or such other\nofficer as the Inspector-General may authorise in this behalf and, by virute of holding such\ncertificate, he shall be vested with the powers, functions and privileges of an officer or member, as\nthe case may be.\n(5) Any person who ceases, for any reason, to be an officer or member shall forthwith\nsurrender the certificate referred to in subsection (4) to any officer authorised by the Inspector-\nGeneral in this behalf, together with the uniform and equipment, if any, issued to him.\n(6) Officers and members of the Pakistan Railways Police shall wear such uniforms as may\nbe prescribed by regulations."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Powers of officers and members of the Pakistan Railways Police",
      "content": "(1) The Inspector-\nGeneral shall exercise the powers of an Inspector-General of Police under the Police Act, 1861\n(V of 1861).\n(2) The Inspector-General shall, in respect of the officers, members and ministerial staff, have\nall the powers conferred on him by or under this Act.\n(3) An officer or member shall, in respect of 1[Railway],—\n(a)        for the purpose of inquiry, investigation, arrest, trial and prosecution,\nexercise all the powers conferred on an officer or member of Police under the\nPolice Act, 1861 (V of 1861), and the Code 2[* * * * * *] the Railways Act,\n1890 (IX of 1890), this Act and the rules and regulations; 3[* *]\n(b)        use such arms, ammunition and equipment as may be authorised by\ntheInspector-General, for the purposes of this Act,4[ ; and]\n5\n[(c)   for the purpose of arresting without warrant any person whom he is\nauthorised by law to arrest and who is attempting to escape, or has escaped,\nimmediately after the commission of an offence, have the power to pursue\nsuch person into any place in Pakistan.]\n(4) Officers superior in rank to an officer-in-charge of a Railway Police Station may exercise\nthe same powers, throughout the local areas or jurisdictions to which they are appointed, as may\nbe exercised by such officer within the limits of his station or jurisdiction.\nExplanation.—For the purpose of the exercise by the officers and members of the powers of\nan officer-in-charge of a Railway Police Station under this Act, ‘Police Station’ means any place\ndeclared, generally or specially, by the Federal Government to be a Police Station within the\nmeaning of the ‘Code’.\n1\nSubs., by Ord 92 of 2002 s. 44 and Sch.\n2\nThe brackets and words \"(except powers under section 58 thereof)\" omitted by the Pakistan Railways Police (Amdt.) Ordinance, 1977 (39 of 1977),\ns.2.\n3\nThe word \"and\" omitted ibid.\n4\nSubs. ibid., for full-stop.\n5\nCl. (c) added ibid.,\n(5) If any officer or member suspects that any property is stolen property and that it is likely\nto be removed, transferred or otherwise disposed of before an order of the appropriate authority for\nits seizure is obtained, such officer or member may, by order in writing, direct the owner or any\nperson who is apparently for the time being in possession thereof not to remove, transfer or\notherwise dispose of such property in any manner except with the previous permission of that officer\nor member and such order shall be subject to any order made by the Court having jurisdiction in the\nmatter.\n(6) Any contravention of an order made under sub-section (5) shall be punishable with\nrigorous imprisonment for a term which may extend to one year, or with fine, or with both.\n(7) An officer or an officer-in-charge of a Railway Police Station may, for the purposes of\nthis Act, call upon the Provincial Police and the District Magistrate concerned to come to the help of\nthe Pakistan Railways Police and in such a case the Provincial Police and the District Magistrate\nshall act in the same manner as they act within their own jurisdiction for the maintenance of law and\norder, for the arrest of offenders and for recovery of persons and property.\n_____"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Appointment of Magistrates and Public Prosecutors. Notwithstanding anything",
      "content": "contained in the Code, the Federal Government may, for the purposes of this Act, appoint—\n(a)     any person to be a Magistrate of the first class within the meaning of the\nCode; and\n(b)     any person or officer of the Pakistan Railways Police to be a public\nprosecutor within the meaning of the Code.\n__________"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Liabilities of officers and members",
      "content": "(1) It shall be the duty of every officer and\nmember promptly to obey and to execute all orders and instructions issued to him by the competent\nauthority.\n(2) Every officer and member shall be liable to serve wherever he is required to serve by the\ncompetent authority.\n(3) Every officer or member who is guilty of any violation of duty or wilful breach or\nneglect of any provision of this Act or of any rule or regulation or lawful order made by a competent\nauthority, or who withdraws from his duties without permission, or who, being absent On leave,\nfails, without reasonable cause, to report himself for duty on the expiration of such leave, or on\nbeing recalled to duty earlier, or who engages without authority in any employment other than his\nduty under this Act, or Who is guilty of cowardice, or who offers any unwarrantable personal\nviolence to any person in his custody, shall be liable to be proceeded against departmentally, or, on\nconviction before a Magistrate, to imprisonment for a term which may extend to six months, or with\nfine which may extend to one thousand rupees, or with both.\n(4) No court shall take cognizance of an offence punishable under sub-section (3) except\nupon a complaint in writing made by a person authorised in this behalf by the Federal Government.\n(5) Any person convicted, under sub-section (3) may, within thirty days from the date of his\nconviction, file an appeal to the Court of Session having jurisdiction, whose decision thereon shall be\nfinal."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Indemnity. No suit, prosecution or other legal proceedings shall lie against any person",
      "content": "for anything in good faith done or intended to be done under this Act or the rules or regulations.\n__________"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Public servant. Every officer and member of the Pakistan Railways Police shall be a",
      "content": "public servant within the meaning of section 21 of the Pakistan Penal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Assets and liabilities",
      "content": "(1) All rights, properties, assets and liabilities of the Railway\nPolice of a Province shall stand transferred to the Pakistan Railways Police on the commencement\nof this Act.\n(2) The transfer of rights, properties, assets and liabilities under sub-section (1) shall be\nsubject to such terms and conditions as may be agreed upon between the Federal Government and\nthe Provincial Government or, in the absence of such agreement, as may be determined by the\nPresident.\n(3) All rights, properties, assets and liabilities of the Railway Watch and Ward shall stand\ntransferred to the Pakistan Railways Police on the commencement of this Act in such manner and to\nsuch extent as may be determined by the Federal Government."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Delegation of powers by the Federal Government. The Federal Government may, by",
      "content": "notification in the official Gazette, delegate all or any of its powers under this Act, except those\nunder section 17, to 1[ * * * * ] the Inspector-General."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Delegation of powers by the Inspector",
      "content": "General. The Inspector-General may, with the\nprior approval in writing of the Federal Government, delegate all or any of his powers under\nthe rules for the efficient functioning of the Pakistan Railways Police to any officer or member."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Power to make rules. The Federal Government may, by notification in the official",
      "content": "Gazette, make rules—\n1\nomitted by ord. 92 of 02, s.44 and sch.\n(a)        regulating the functions and powers of the officers including the Magistrates\nand the public prosecutors;\n(b)        regulating the grades of, and the remuneration and rewards to be paid to, the\nofficers, members and ministerial staff of the Pakistan Railways Police and\ntheir conditions of service;\n(c)        prescribing and regulating the award of departmental punishments and trial of\ncases by Magistrates;\n(d)        appointing the place where a person punished with imprisonment may be\nkept in custody; and\n(e)        generally for the purpose of carrying into effect the provisions of this Act.\n1[18. Power to make regulations. The Inspector-General may, with the prior approval in\nwriting of the Federal Government, make regulations consistent with this Act and the rules.]"
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Transitional provision. Till such time as the rules and regulations are framed,",
      "content": "(a)        the persons referred to in clause (a) of sub-section (1) of section 5, and the\nofficers and members appointed after the commencement of this Act, shall,\nso far as may be and with the necessary modifications, be governed by the\nPunjab Police Rules, 1934; and\n(b)        the persons referred to in clause (b) of the aforesaid sub-section shall, so far as\nmay be and with the necessary modifications, be governed by the rules\ngoverning the Railway Watch and Ward immediately before the\ncommencement of this Act."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. [Repeal]. Omitted by the Federal Laws (Revision and’ Declaration) Ordinance, 1981",
      "content": "(XXVII of 1981), s. 3 and Sch, II.\n1\nSubs by ord. 92 of 02, s.44 and sch.\n[See section 2(e) and (g)]\nI, ______________________son/daughter of ________________solemnly affirm in the\npresence of Almighty Allah that I will bear true faith and allegiance to the Islamic Republic of\nPakistan and that I will, as in duty bound, honestly and faithfully serve in the Pakistan Railways\nPolice and go wherever I may be ordered by air, land or sea, and that I will observe and obey all\ncommands of any officer set over me even to the peril of my life.\nSigned in acknowledgement of the above having been read out to me.\nPerson Enrolled\nDated..........................\nSigned in my presence after I had ascertained that the person understood the purpose of\nwhat he/she signed.\nInspector-General,\nPakistan Railways Police\nOr\nOther Enrolling Officer.\nROMAN—URDU TRANSLATION OF AFFIRMATION\nMain ___________________ WALD/BINT________________________ Khuda-e-Taala ko\nhazir-o-nazir janker iman se iqrar karta/karti hun key main Islami Jamhooria Pakistan ka/ki suche dil\nse wafadar rahunga/rahungi aur Pakistan Railways Police men imandari aur wafadari se khidmat\nseranjam doonga/doongi aur hawa, khushki ya tari ke raste jahan bhi jane ka hukam melega\njaonga/jaongi aur jise mera afsar muqarar kia jaega uskey her hukam ki tamil aur pairwi\nkarunga/karungi, khah us men jan ka khatra ho.\n________\n[See section 8(4)]\nMr./Mrs/Miss _____________________________________________ has been appointed as\nofficer/member of the Pakistan Railways Police under the Pakistan Railways Police Act, 1977,\nand is vested with powers, functions and privileges of an officer a member of the Pakistan\nRailways Police.\nIdentification of the\nOfficer/Member.\nInspector-General,\nSeal of the Pakistan Railways,\nPolice.\nPhoto of the\nOfficer/Member.\nLast uploaded on 25.9.2023"
    }
  ],
  "definitions": [
    {
      "term": "railway employee",
      "definition": "railway employee as defined in the Railway Regulatory Authority Ordinance, 2002 ( of 2002)] (k) ‘regulations’ means regulations made under this Act; and (l) ‘rules’ means rules made under this Act.",
      "source_provision": "sec2"
    }
  ]
}
