{
  "id": "pk-pakistan-science-foundation-act-1973",
  "type": "statute",
  "title": "Pakistan Science Foundation Act, 1973",
  "title_en": "Pakistan Science Foundation Act, 1973",
  "short_name": "PSFA",
  "status": "in_force",
  "issued_date": "1973-01-30",
  "in_force_date": "1973-01-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2hw-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Science Foundation Act, 1973 (III of 1973) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Pakistan Science\nFoundation Act, 1973.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definition. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(a)        \"Board\" means the Board of Trustees of the Foundation;\n(b)        \"Chairman\" means the Chairman of the Foundation; and\n(c)        \"Foundation\" means the Pakistan Science Foundation established under, this\nAct."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Foundation",
      "content": "(1) As soon as may be after the commencement of\nthis Act, the Federal Government may, by notification in the official Gazette, establish a Pakistan\nScience Foundation to promote and finance scientific activities having a bearing on the socio-\neconomic needs of the country.\n(2) The Foundation shall be a body corporate by the name of the Pakistan Science\nFoundation, having perpetual succession and a common seal, with power, subject to the provisions\nof this Act, to acquire, hold and dispose of property, both movable and immovable, and shall by the\nsaid name sue and be sued.\n(3) The head office of the Foundation shall be at Islamabad."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Functions of the Foundation",
      "content": "(1) The Foundation shall function as a financing\nagency for—\n1 For Statement of Objects and Reasons, see Gaz. of P., 1973, Ext., Pt. III, p. 27.\n(i)     the establishment of comprehensive scientific and technological information\nand dissemination centres;\n(ii)    the promotion of basic and fundamental research in the universities and\nother institutions on scientific problems relevant to the socio- economic\ndevelopment of the country;\n(iii)   the utilisation of the results of scientific and technological research including\npilot plant studies to prove the technical and economic feasibility of processes\nfound to be promising on a laboratory scale;\n(iv)    the establishment of science centres, clubs, museums, herbaria and\nplanetaria;\n(v)     the promotion of scientific societies, associations and academies engaged in\nspreading the cause of scientific knowledge in general or in the pursuit of a\nspecific scientific discipline or technology in particular;\n(vi)    the organisation of periodical science conferences, symposia and\nseminars;\n(vii)   the exchange of visits of scientists and technologists with other countries;\n(viii) the grant of awards, prizes and fellowships to individuals engaged in\ndeveloping processes, products and inventions of consequence to the economy\nof the country; and\n(ix)    special scientific surveys not undertaken by any other organization and\ncollection of scientific statistics related to the scientific effort of the\ncountry.\n(2) The Foundations shall also—\n(i)     review the progress of scientific research sponsored by it and evaluate the\nresults of such research;\n(ii)    maintain a National Register of highly qualified and talented scientists of\nPakistan, including engineers and doctors, in or outside the country and to\nassist them, in collaboration with the concerned agencies in finding\nappropriate employment; and\n(iii) establish liaison with similar bodies in other countries.\n(3) In the performance of its functions, the Foundation shall be guided on questions of\npolicy by the instructions, if any, given to it by the Federal Government which shall be the sole\njudge as to whether a question is a question of policy."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Board of Trustees. The general direction, conduct and management of the affairs of the",
      "content": "Foundation, including administration of its funds, shall vest in a Board of Trustees consisting of the\nfollowing members namely:—\nWhole-time members\n(i)       the Chairman;\n(ii)      one eminent scientist;\n(iii)     the Director of Finance;\nto be appointed by the President;\nPart-time members\n(iv) the Chairman of the National Science Council;\n(v)      four scientists to be nominated by the National Science Council; and\n(vi) eleven eminent scientists to be nominated by the President.\n(2) The remuneration and other terms and conditions of service of the Chairman and the\ntwo other whole-time members of\" the Board' shall be such as may be determined by the President.\n1\n[6. Chairman of the Foundation.—(1) The Chairman of the Board shall be the Chairman\nof the Foundation and shall be appointed from amongst eminent scientist of the country having\nexperience of research and scientific administration:—\n(2) The Chairman shall, subject to sub-section (3), hold office for a term not exceeding\nthree years and shall be eligible for re-appointment\n(3) The President may at any time terminate the appointment of the Chairman without notice\nand without assigning any reason.].\n2\n[7. Members of the Board.—(1) The members of the Board, other than the ex-officio\nmember shall, subject to sub-section (3), hold office for a term not exceeding three years and shall\nbe eligible for re-appointment or re-nomination, as the case may be.\n(2) A member, other than an ex-officio member, may at any time resign his office by writing\nunder his hand addressed to the President but shall continue to perform his functions until his\nresignation has been accepted.\n(3) The President may at any time terminate the appointment or, as the case may be,\nnomination of any member of the Board without notice and without assigning any reason].\n1\nSubs, by the Pakistan Science Foundation (Amdt.) Ordinance, 1979 (13 of 1979), s. 2.\n2\nSubs. by the Pakistan Science Foundation (Amdt.) Ordinance, 1979 (13 of 1979), s. 3."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Meetings of the Board",
      "content": "(1) The meetings of the Board shall be held at least twice\na year and shall be presided over by the Chairman or, in his absence, by its whole-time scientist\nmember.\n(2) All decisions at a meeting of the Board shall be taken by a majority of the votes of the\nmembers present and voting."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Quorum at the meeting of the Board. To constitute a quorum at a meeting of the Board",
      "content": "not less than nine members shall be present."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Executive Committee. There shall be an Executive Committee consisting of the",
      "content": "Chairman and the two other whole-time members of the Board."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Delegation of powers. The Board may, from time to time, delegate to the Chairman or",
      "content": "the Executive Committee such of its powers and functions as it may consider necessary."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Ad hoc Committees. The Foundation may set up ad hoc committees consisting of",
      "content": "university professors and other leading scientists and experts to scrutinize applications for financial\nassistance for carrying out scientific research submitted to the Foundation by the universities or\nother institutions or by individual scientific workers or groups of scientific workers and to review\nand evaluate the results of research sponsored by the Foundation."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Funds. The funds of the Foundation shall consist of",
      "content": "(a)     grants made by the Federal Government and the Provincial Governments;\n(b)     donations and endowments; and\n(c)     income from other sources."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Budget. The Foundation shall cause to be prepared and approve a statement of its",
      "content": "receipts and expenditure for each financial year."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Accounts and Audit",
      "content": "(1) The funds of the Foundation shall be kept in a personal\nledger account of the Foundation with the State Bank of Pakistan or with any Branch of the\nNational Bank of Pakistan acting as an agent of the State Bank.\n(2) The accounts of the Foundation shall be maintained in such form and manner as the\nAuditor-General of Pakistan may determine in consultation with the Federal Government.\n(3) The accounts of the Foundation shall be audited by one or more auditors who are\nchartered accountants within the meaning of the Chartered Accountants Ordinance, 1961 (X of\n1961) and are appointed by the Foundation in consultation with the Auditor-General of Pakistan."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Appointments of officers and servants",
      "content": "(1) The Foundation may appoint such\nofficers and servants, and engage such consultants or experts, as it may consider necessary for\nthe efficient performance of its Functions, on such terms and conditions as it may deem fit.\n(2) In fixing the terms and conditions of service of its officers and servants, the Foundation\nshall as nearly as may be conform to the scales of pay, allowances and conditions of service\napplicable to the corresponding class of employees of the Federal Government."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Annual Report",
      "content": "(1) The annual report of the Foundation, which shall, among other\nthings, clearly bring out the benefits accruing to the nation as a result of the activities sponsored by\nthe Foundation, shall be prepared by the Chairman and submitted, through the Board, to the\nFederal Government alongwith the audited accounts of the Foundation.\n(2) The annual report alongwith the audited accounts of the Foundation shall be laid before\nthe National Assembly."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Board of Trustees of the Foundation;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Foundation; and",
      "source_provision": "sec2"
    },
    {
      "term": "Foundation",
      "definition": "the Pakistan Science Foundation established under, this Act.",
      "source_provision": "sec2"
    }
  ]
}
