{
  "id": "pk-pakistan-single-window-act-2021",
  "type": "statute",
  "title": "Pakistan Single Window Act, 2021.",
  "title_en": "Pakistan Single Window Act, 2021.",
  "short_name": "PSWA",
  "status": "in_force",
  "issued_date": "2021-04-12",
  "in_force_date": "2021-04-12",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NpaZpo-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Single Window Act, 2021. (III of 2021) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act shall be called the Pakistan\nSingle Window Act, 2021.\n(2) It shall extend to the whole of Pakistan.\n(3) It shall come into force from such date as the Federal Government may, by a notification\nin the official Gazette, appoint."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the context or subject,—\n(a) “Agreement on Trade Facilitation” means the Trade Facilitation Agreement of the World\nTrade Organisation as ratified by Pakistan;\n(b) “Board of Directors” means the Board of Directors of the operating entity established under\nthe Companies Act, 2017 (XIX of 2017);\n(c) “Chairperson” means the Chairperson of the Governing Council established under this\nAct;\n(d) “electronic” includes electrical, digital, magnetic, optical, biometric, electrochemical,\nwireless or electromagnetic technology;\n(e) “electronic document” includes documents, records, information, communications or\ntransactions in electronic form;\n(f) “electronic signature” means any letters, numbers, symbols, images, characters or any\ncombination thereof in electronic form, applied to, incorporated in or associated with an\nelectronic document, with the intention of authenticating or approving the same, in order\nto establish authenticity or integrity or both;\n(g) “Governing Council” means the Pakistan Single Window Governing Council established\nunder section 4;\n(h) “information” includes text, message, data, voice, sound, database, video, signals, software,\ncomputer programs, codes including object code and source code;\n(i) “lead agency” means the organization responsible for or appointed under section 5 for\nimplementation of Pakistan single window;\n(j) “member” means a member of the Governing Council including its Chairperson;\n(k) “memorandum of understanding” means the memorandum of understanding signed by and\nbetween the Governing Council with the lead agency and its operating entity, or any\nOGAs;\n(l) “operating entity” means an entity created by the lead agency under section 6;\n(m) “Pakistan single window” means an information and communication technology based\nfacility that allows persons or entities involved in trade and transport to lodge standardised\ninformation and documents with a single-entry point to fulfil import, export and transit-\nrelated regulatory requirements in Pakistan without being required to submit the same\ndata element more than once;\n(n) “other government agencies” hereinafter referred to as OGAs means any of the regulatory\nauthorities including their subordinate entities as listed in the schedule whether referred\nto jointly or severally;\n(o) “prescribed” means prescribed by rules or regulations made under this Act;\n(p) “registration” means issuance of a unique user identifier to any person or entity to access\nthe Pakistan single window system, in the prescribed manner;\n(q) “risk management system” means the systematic application of trade controls and\nmanagement procedures on goods, means of transport and passengers including at pre-\narrival, clearance or post clearance stage for identifying, analysing, evaluating,\nmonitoring, reviewing and treating the risks associated with them and includes priority\naccorded to compliant, persons, entities or organisations using the Pakistan single\nwindow system;\n(r) “rules” means the rules made under this Act;\n(s) “secretariat” means the secretariat to the Governing Council established under section 4;\n(t) “secretary to the Governing Council” means the secretary to the Governing Council;\n(u) “selectivity criteria” means the risk parameters determined by the risk management\ncommittee constituted in prescribed manner, for meaningful application of risk\nmanagement system;\n(v) “system” means an electronic system for creating, generating, sending, receiving, storing,\nreproducing, displaying, recording or processing information or any part thereof;\n(w) “trade bodies” means any of the recognized and registered chambers of commerce and\nindustry, representatives thereof, registered professional associations, trade unions and\nothers;\n(x) “trade controls” means measures applied by the officers of Pakistan customs service or\nother Government agencies through the Pakistan single window system to manage risks\nand ensure compliance with the laws, regulations and rules for the time being inforce;\nand\n(y) “un-authorised access” means access to an information system or data which is not\navailable for access by general public, without authorisation or in violation of the terms\nand conditions of the authorisation.\n(2) Any other expressions used but not defined in this Act, shall have the same meanings\nassigned thereto in the respective laws and rules made thereunder."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Pakistan single window",
      "content": "(1) The Federal Government shall, by\nnotification in the official Gazette, establish a facility to be known as the Pakistan single window to\nfacilitate efficient imports, exports, international transit and matters ancillary thereto, across Pakistan’s\nnational territory and notified international borders and shall use any technological means available or\nmade available in the future, for the purpose.\n(2) The Federal Government may provide financial, human and administrative resources as it\nmay deem necessary, for the establishment, operation, maintenance and in case of exigency or\ntechnological advancements, the succession and replacement of Pakistan single window.\n(3) Pakistan customs department and OGAs shall participate in and form an integral part of the\nPakistan single window and accordingly align their respective laws, regulations, procedures, processes\nand information requirements related to regulation of imports, exports, transit trade and associated\ntransport with the Pakistan single window:\nProvided that the Governing Council may waive, in whole or in part, temporarily or otherwise,\nthe requirement for participation of any OGA.\n(4) Where any law, rules, regulations, by-laws, notifications, orders, procedures, instructions,\ncirculars, etc. related to import, export, transit or any matter ancillary thereto are required to be\namended, rescinded or repealed, such amendment, rescission or repeal shall not be made except on the\ncondition of previous publication giving a notice thereof in the official Gazette or through electronic\nmeans soliciting opinion of the persons likely to be affected thereby:\nProvided that the Governing Council may on its own or on a motion by Pakistan customs or\nany OGA and for reasons to be recorded in writing, dispense with the requirements, temporarily or\notherwise, under this sub-section in case of exigency."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. The Governing Council",
      "content": "(l) The Federal Government may, by notification in the official\nGazette, establish a Governing Council comprising Chairperson and such members as the Federal\nGovernment may specify therein.\n(2) No act or proceedings of the Governing Council shall be invalid by reason only of the\nexistence of a vacancy in or defect in the constitution of the Governing Council.\n(3) The Federal Minister-in-charge of the Division to which business of this Act stands\nallocated shall be the Chairperson of the Governing Council.\n(4) The Chairperson may delegate, powers to convene and chair meetings of the Governing\nCouncil, in case of necessity to any of its members.\n(5) The Governing Council may constitute committees comprising two or more of its members\nfor performance of any task or inquiry as specified by the Governing Council and such committee\nshall send its recommendations or report to the Governing Council in such period as the Governing\nCouncil may specify.\n(6) Decision of the Governing Council shall be by simple majority of the members present and\nvoting and the Chairperson or member presiding shall have a casting vote in case of equality of the\nvotes.\n(7) The Governing Council may invite any persons or representatives of the trade or\nprofessional bodies or organisations to participate in its deliberations, make recommendations, submit\nreports and provide any assistance as the Governing Council may deem appropriate and may pay them\nremuneration for such service:\nProvided that such persons or representatives shall have no right of vote.\n(8) The Governing Council with relation to the Pakistan single window shall perform such\nfunctions as the Federal Government may by rules prescribe which may inter alia include establishing\nthe direction, principles, monitoring and maintaining oversight of information and communication\ntechnology system, serving as the interface and collaborator between all relevant stakeholders for early\nimplementation and smooth operations, and establishing, managing and monitoring performance\nagainst the agreed benchmarks as per the memorandum of understanding with the lead agency and\noperating entity to ensure achievement of the anticipated outcomes.\n(9) The Federal Government may, by notification in the official Gazette, establish a secretariat\nof the Governing Council and offices thereof at such places as it may determine which shall perform\nsuch functions as the Federal Government may prescribe.\n(10) The head of the lead agency shall —\n(a)   act as the ex-officio secretary to the Governing Council;\n(b)   convene meetings of the Governing Council, with the prior approval of the\nChairperson, after giving a notice to the members of the Governing Council;\n(c)   head the secretariat to the Governing Council; and\n(d)   maintain records of the proceedings of the Governing Council and timely\ncommunicate the same to the relevant OGAs, Pakistan customs, any government\ndepartments, individuals and entities concerned."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Lead agency",
      "content": "(1) Unless the Federal Government may determine otherwise, the Pakistan\ncustoms shall be the lead agency for the purposes of this Act.\n(2) The lead agency shall establish an operating entity for the development, acquisition, roll\nout, operations, maintenance, up-grading, enhancements and marketing of the Pakistan single window\nand its allied systems, as it may deem fit, for maximising benefit of the Pakistan single window for the\ntrade, OGAs, Pakistan customs and other related stakeholders:\nProvided that the relationship between the Governing Council, the lead agency and the\noperating entity shall be regulated through signing of a memorandum of understanding in the\nmanner as the Federal Government may by rules prescribe.\n(3) The Federal Government may on its own motion or upon the recommendation of the\nGoverning Council, by a notification in the official Gazette, change or replace the lead agency due to\nnon-performance or failure in achieving performance benchmarks set by the memorandum of\nunderstanding and as reported in the performance audit reports consistently for three consecutive years.\n(4) The lead agency shall furnish annual performance reports to the Governing Council\nhighlighting therein progress on development, deployment, operations, achievement vis-a-vis\nbenchmarks set by the memorandum of understanding and matters ancillary thereto."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Operating entity",
      "content": "(1) The lead agency shall establish an operating entity under the\nprovisions of the Companies Act, 2017(X1X of 2017) to develop, roll out, operate, maintain, expand,\nenhance, replace and market Pakistan single window and systems allied thereto.\n(2) The Governing Council upon the recommendation of the lead agency may replace the\noperating entity in case of non-performance or failure in achieving performance benchmarks set by the\nmemorandum of understanding and as reported in the performance audit reports, consistently for three\nconsecutive years.\n(3) Government officers from Pakistan customs, OG-As or any other relevant government\nministry or division or associated departments, organisations or entity may be seconded to the\noperating entity through a competitive process to be carried out in the manner as may be prescribed by\nregulations by the lead agency to support implementation, operations and enhancement of Pakistan\nsingle window:\nProvided that during the period of their secondment with the operating entity, the\ngovernment officers shall be entitled to a special Pakistan single window allowance, in addition\nto the regular government pay and admissible allowances, as notified by the lead agency in\nconsultation with the operating entity:\nProvided further that retention of officers seconded under this sub-section or extension\nin their secondment period shall be subject to objective performance assessment by the\noperating entity as per its performance evaluation benchmarks or human resource policy.\n(4) The operating entity may enter into partnerships or itself develop or acquire fully or partly\nthe requisite software, hardware, system code, data, infrastructure or anything ancillary thereto to\neffectively run the Pakistan single window but such software, hardware, system code, data,\ninfrastructure or anything ancillary thereto, shall at all times be accessible to and remain the property\nof the Federal Government, unless otherwise agreed in writing by the Governing Council.\n(5) The operating entity shall be entrusted with such functions and responsibilities as its\nmemorandum of association under the Companies Act, 2017(XIX of 2017) and the memorandum of\nunderstanding with the Governing Council and lead agency may specify."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Grants, funds, budget and accounts of the Governing Council",
      "content": "(1) The Federal\nGovernment may, from time to time, place annual grants at the disposal of the Governing Council for\nthe smooth discharge of its affairs and for defraying of all expenditures incurred by the Governing\nCouncil including expenses of its secretariat.\n(2) In respect of each financial year, the Governing Council shall submit for approval of the\nFederal Government, by such date as may be specified by the Federal Government, a statement\nshowing the estimated receipts and expenditure and the sums which are likely to be required from\nthe Federal Government during the next financial year and the accounts of the Governing Council shall\nbe kept in such form and in accordance with such principles and methods as may be determined in\naccordance with Article 170 of the Constitution of the Islamic Republic of Pakistan.\n(3) The secretariat on behalf of the Governing Council may open accounts with the State Bank\nof Pakistan or with any scheduled bank in Pakistan and the accounts of the Governing Council shall\nbe audited every year by the Auditor-General of Pakistan.\n(4) Subject to the provisions of financial laws and regulations for the time being in force and\nas the Federal Government may prescribe by rules, accounts of the Governing Council may be\nexpended for the purposes which shall include, but not limited to, the following, namely:—\n(a)   paying any expenditure lawfully incurred by it including the allowances of the\nChairperson, the members, secretary or any other person, as notified by the Governing\nCouncil, hired for any activity or function under this Act;\n(b)   paying for expenditure incurred on marketing, publicity, seminars and conferences;\n(c)   paying rent, purchasing or hiring equipment and any other materials, acquiring land,\nerecting buildings and conducting other work and undertakings in the performance of its\nfunctions or the exercise of its powers under this Act; and\n(d)   paying any other expenses, costs or expenditure properly incurred or accepted by the\nGoverning Council in the performance of its functions or the exercise of its powers."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Sources of funding",
      "content": "(1) The sources of funding for development, operations,\nenhancement and up-gradation of the Pakistan single window shall include —\n(a)   such sums as the Federal Government may allocate to the lead agency, from time to time,\nin the annual budget;\n(b)   grants from the Federal Government to the lead agency;\n(c)   income generated from levy of fee and service charges as provided in sub-section (2);\n(d)   income generated from sales of products, services and investments; and\n(e)   any other source, as approved by the Governing Council, upon recommendation of the\nlead agency.\n(2) For the purpose of meeting operating expenses, enhancements and up-gradation of the\nPakistan single window, the Governing Council may, by notification in the official Gazette, upon the\nrecommendation of the lead agency and subject to such conditions, limitations or restrictions as it may\ndeem fit to impose, levy fee and service charges for any of the services provided by or on behalf of the\noperating entity, at such rate as may be specified therein.\n(3) The Federal Government upon recotnmendation of the Governing Council may allocate\nadditional funds to the lead agency to the credit of the operating entity in case the income from Pakistan\nsingle window fee and service charges is insufficient to meet the operating expenses.\n(4) The management, operations and maintenance of all accounts and sums received or raised\ntherein, under this Act, shall be done by the operating entity in the manner as may be prescribed by\nregulations:\nProvided that all sums received or raised under this Act may be utilised for meeting the\noperating expenses and enhancement of the Pakistan single window including, but not limited to,\nprocuring, owning, hiring, developing, maintaining, upgrading, marketing or operating etc any\nPakistan single window related software, hardware, system code, data, infrastructure, property\nrequired or utilised by the operating entity, Pakistan customs and OGAs, and for hiring, training,\ncapacity building and welfare of their employees, as approved by the Board of Directors, in the\nprescribed manner.\n(5) Audit of the accounts of the operating entity shall be conducted by the Auditor General of\nPakistan."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Application of the Pakistan single window and its allied systems",
      "content": "The Pakistan single\nwindow and any systems ancillary thereto shall apply to any of the OGAs, Pakistan customs, other\nentities and organisations in any matter related directly or indirectly to the imports, exports and transit\ntrade, as the Governing Council may, by a notification in the official Gazette, specify. The Governing\nCouncil may further specify different dates for such application in respect of different OGAs, relevant\ndepartments, entities or organisations or areas, as the case may be, for this purpose."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Access to the Pakistan single window and its allied systems, maintenance of record",
      "content": "etc.—(1) No person shall access, physically or electronically, the Pakistan single window or its allied\nsystems or infrastructure, transmit to or receive information from the Pakistan single window, unless\nthat person is duly registered or authorised in the manner prescribed by rules.\n(2) The rules made for the purpose of sub-section (1) shall specify the requirements for\nregistration or authorisation, the manner of registration or refusal to grant registration and in case of\nnecessity, conditions for suspension or cancellation of registration or authorization:\nProvided that no order shall be passed for refusal, suspension or cancellation of registration\nunless a reasonable opportunity of being heard is given to the registered person or applicant, as the\ncase may be.\n(3) Access to the Pakistan single window system shall be granted only through the use of a\nunique user identifier and shall be subject to such conditions or restrictions as may be prescribed by\nregulations.\n(4) Any electronic exchange of information, declaration, documents or record, transaction,\naccounts, offer or acceptance of an offer, notice, order, payment, authentication, authorisation or\ninformation required, delivered or provided by any of the OGAs or Pakistan customs, authorised or\nregistered users or any other entity, organisation or department shall be deemed to have been provided,\nrequired, delivered or done in accordance with the law for the time being in force if and when\ncommunicated electronically through the Pakistan single window or its allied systems and shall be\nadmissible as an evidence in any court of law, tribunal or before an inquiry commission or any quasi-\njudicial authority etc.\n(5) The operating entity or the lead agency, as the case may be, shall keep a record of every\ntransmission sent or received, electronic documents transmitted or received or any other messages,\ncodes or software, employed in furtherance of the objectives of this Act for a period of not less than\nfive years and shall be liable to use the same in accordance with sub-section (6).\n(6) Any trade-related information, transmission, documents, data or record gathered by any of\nshall be confidential and shall not be used except as prescribed by rules.\n(7) The Federal Government may prescribe the manner and mode of requisitioning of\ndocuments, records or transmission, conducting audit or examination of the same and allow officers\nof the OGAs, Pakistan customs or any other entity or organisation to have access to premises,\ncomputers or any other systems where data is being stored, recorded or retained subject to the condition\nthat a reasonable advance notice be given to the persons or entities in possession of such data, records\nor transmissions etc."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Application of risk management system",
      "content": "For the purpose of enforcing trade controls, a\nrisk management system shall be applied in such manner as may be prescribed by rules."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Electronic documents non",
      "content": "discrimination vis-i-vis paper documents.— (1) Any law,\nfor the time being in force, and requiring documents to be created, retained, authenticated, notarised,\nduplicated, submitted, delivered or evidenced shall be deemed to have been complied with if such\ndocuments are available and retrievable in the electronic form.\n(2) Any permit, licence, authorisation or approval required under any law to be issued shall be\ndeemed to have been lawfully issued if the same is issued in electronic form.\n(3) Any information, documents, data, authentication, or authorisation transmitted, received,\nstored, done or processed in the Pakistan single window electronically may bear such marks,\nnumbers, bar codes or identifiers which shall be deemed to bear electronic signatures and shall be\nadmissible as an evidence in any legal fora within and outside Pakistan."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Offences and punishments",
      "content": "(1) Whoever commits any offence as described in column\n(2) of the Table below shall, in addition to and not in derogation of any punishment to which such\nperson may be liable under any other law, be liable to punishment under this Act as provided in column\n(3) thereof, namely:—\nS. No.                Offences                              Punishments\n(1)                    (2)                                     (3)"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Other laws to apply",
      "content": "(1) Subject to sub-section (2) of section 13, the provisions of the\nCustoms Act, 1969 (IV of 1969), the Electronic Transactions Ordinance, 2002 (LI of 2002) and the\nPrevention of Electronic Crimes Act, 2016 (XL of 2016), to the extent not inconsistent with the\nprovisions of this Act, shall mutatis mutandis apply to electronic submission of documents, data\nretention or storage, copyrights, legal recognition and presumption, certification, notarisation,\nregistration, offences etc. in as much as they are relevant to the stated intent, objectives and operations\nunder this Act and shall be deemed to have been so applied from the commencement of this Act."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Provision of services, sale of software and IT systems etc",
      "content": "(1) The operating entity\nwith prior approval of the Governing Council, subject to such conditions, limitations or restrictions as\nthe Federal Government may impose, may provide services locally or to foreign governments,\norganisations, companies or any other entities etc, for development, deployment, up-gradation,\nmaintenance or replacement of their respective single windows or any other electronic systems or sell\nsoftware or IT systems or make investments for a consideration:\nProvided that delivery of any such services or development of systems or investments shall\nin no way have any bearing on security of the systems being operated in Pakistan nor shall it\ncompromise the security of trade data."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Indemnity",
      "content": "No suit, prosecution or other legal proceedings shall lie against the Federal\nGovernment, the Governing Council, lead agency, operating entity, Chairperson, members, officers\nassociated in any capacity with the Pakistan single window for anything done in good faith or intended\nto be done in good faith, under this Act or any rules and regulations made thereunder."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Dispute resolution",
      "content": "(1) Subject to section 13, the Governing Council may, by\nnotification in the official Gazette, specify the procedure for resolving any disputes that may arise\nduring the course of implementation of this Act or for any actions taken or intended to be taken under\nthis Act or rules made thereunder and the Governing Council may appoint a committee from among\nits members for this purpose on case to case basis.\n(2) Any decision taken by the Governing Council in this regard shall be final and shall not\nbe called into question by any court as long as such findings are nor in conflict with the provisions of\nthis Act."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Overriding effect",
      "content": "The provisions of this Act shall have effect notwithstanding anything\ncontained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Power to amend the Schedule",
      "content": "The secretary of the Governing Council may, by\nnotification in the official Gazette and after approval of the Governing Council, amend the Schedule\nso as to add any entry thereto, omit any entry therefrom or amend any entry therein."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Delegation",
      "content": "The Federal Government may, by notification in the official Gazette,\ndelegate any of its powers under this Act to the Governing Council, a member thereof including the\nChairperson or any other authority or officer subordinate to it to such extent and subject to such\nlimitations and conditions and for such period as specified in the notification:\nProvided that power to make rules of the Federal Government under this Act shall not be\ndelegated."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Power to make rules",
      "content": "(1) The Federal Government may, by notification in the official\nGazette, make rules to carry out purposes of this Act.\n(2) Power to make rules under sub-section (1) shall be subject to the condition of previous\npublication.\n(3) Rules made under sub-section (1) shall be laid before both Houses of the Majlis-e-Shura\n(Parliament) within one hundred and twenty days of making thereof."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Power to make regulations",
      "content": "The lead agency may in consultation with the Governing\nCouncil and by notification in the official Gazette, make regulations for carrying out purposes of this\nAct which shall not be inconsistent with the provisions of this Act and the rules made thereunder."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Removal of difficulties",
      "content": "(1) Notwithstanding anything contained in any other law for\nthe time being in force, the Federal Government in respect of rules and the lead agency in consultation\nwith the Governing Council in respect of regulations, may by a notification in the official Gazette\nsuspend any rules, regulations and notifications or provisions thereof for removal of any difficulty in\n(2) The condition of sub-section (3) of section 21 shall apply to any notification issued under\nsub-section (1).\n[SCHEDULE]\n{see sections 2 (n) and 19}\nS.    Organization / Department / Ministry\nNo."
    }
  ],
  "definitions": [
    {
      "term": "Agreement on Trade Facilitation",
      "definition": "the Trade Facilitation Agreement of the World Trade Organisation as ratified by Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "Board of Directors",
      "definition": "the Board of Directors of the operating entity established under the Companies Act, 2017 (XIX of 2017);",
      "source_provision": "sec2"
    },
    {
      "term": "Chairperson",
      "definition": "the Chairperson of the Governing Council established under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "electronic",
      "definition": "electrical, digital, magnetic, optical, biometric, electrochemical, wireless or electromagnetic technology;",
      "source_provision": "sec2"
    },
    {
      "term": "electronic document",
      "definition": "documents, records, information, communications or transactions in electronic form;",
      "source_provision": "sec2"
    },
    {
      "term": "electronic signature",
      "definition": "any letters, numbers, symbols, images, characters or any combination thereof in electronic form, applied to, incorporated in or associated with an electronic document, with the intention of authenticating or approving the same, in order to establish authenticity or integrity or both;",
      "source_provision": "sec2"
    },
    {
      "term": "Governing Council",
      "definition": "the Pakistan Single Window Governing Council established under section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "information",
      "definition": "text, message, data, voice, sound, database, video, signals, software, computer programs, codes including object code and source code;",
      "source_provision": "sec2"
    },
    {
      "term": "lead agency",
      "definition": "the organization responsible for or appointed under section 5 for implementation of Pakistan single window;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of the Governing Council including its Chairperson;",
      "source_provision": "sec2"
    },
    {
      "term": "memorandum of understanding",
      "definition": "the memorandum of understanding signed by and between the Governing Council with the lead agency and its operating entity, or any OGAs;",
      "source_provision": "sec2"
    },
    {
      "term": "operating entity",
      "definition": "an entity created by the lead agency under section 6;",
      "source_provision": "sec2"
    },
    {
      "term": "Pakistan single window",
      "definition": "an information and communication technology based facility that allows persons or entities involved in trade and transport to lodge standardised information and documents with a single-entry point to fulfil import, export and transit- related regulatory requirements in Pakistan without being required to submit the same data element more than once;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules or regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "registration",
      "definition": "issuance of a unique user identifier to any person or entity to access the Pakistan single window system, in the prescribed manner;",
      "source_provision": "sec2"
    },
    {
      "term": "risk management system",
      "definition": "the systematic application of trade controls and management procedures on goods, means of transport and passengers including at pre- arrival, clearance or post clearance stage for identifying, analysing, evaluating, monitoring, reviewing and treating the risks associated with them and includes priority accorded to compliant, persons, entities or organisations using the Pakistan single window system;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "the rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "secretariat",
      "definition": "the secretariat to the Governing Council established under section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "secretary to the Governing Council",
      "definition": "the secretary to the Governing Council;",
      "source_provision": "sec2"
    },
    {
      "term": "selectivity criteria",
      "definition": "the risk parameters determined by the risk management committee constituted in prescribed manner, for meaningful application of risk management system;",
      "source_provision": "sec2"
    },
    {
      "term": "system",
      "definition": "an electronic system for creating, generating, sending, receiving, storing, reproducing, displaying, recording or processing information or any part thereof;",
      "source_provision": "sec2"
    },
    {
      "term": "trade bodies",
      "definition": "any of the recognized and registered chambers of commerce and industry, representatives thereof, registered professional associations, trade unions and others;",
      "source_provision": "sec2"
    },
    {
      "term": "trade controls",
      "definition": "measures applied by the officers of Pakistan customs service or other Government agencies through the Pakistan single window system to manage risks and ensure compliance with the laws, regulations and rules for the time being inforce; and",
      "source_provision": "sec2"
    },
    {
      "term": "un-authorised access",
      "definition": "access to an information system or data which is not available for access by general public, without authorisation or in violation of the terms and conditions of the authorisation. (2) Any other expressions used but not defined in this Act, shall have the same meanings assigned thereto in the respective laws and rules made thereunder.",
      "source_provision": "sec2"
    }
  ]
}
