{
  "id": "pk-pakistan-space-and-upper-atmosphere-research-commission-ordinance-1981",
  "type": "statute",
  "title": "Pakistan Space and Upper Atmosphere Research Commission Ordinance, 1981",
  "title_en": "Pakistan Space and Upper Atmosphere Research Commission Ordinance, 1981",
  "short_name": "PSAUA",
  "status": "in_force",
  "issued_date": "1981-05-20",
  "in_force_date": "1981-05-20",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bZyc-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Space and Upper Atmosphere Research Commission Ordinance, 1981 (XX of 1981) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Submission of reports, etc",
      "content": "18    Continuance of certain rules\n19    Ordinance XXIII of 1969 not to apply to Commission\n20    Winding up of the Commission"
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Removal of difficulties",
      "content": "COMMISSION ORDINANCE, 1981.\nORDINANCE NO. XX OF 1981\n[21st May, 1981]\nAn Ordinance to provide for the establishment of a Space Research Council and the Pakistan Space\nand Upper Atmosphere Research Commission.\nWHEREAS it is expedient to provide for the establishment of a Space Research Council and\nthe Pakistan Space and Upper Atmosphere Research Commission for the promotion of peaceful uses\nand applications of space and for matters connected therewith or ancillary thereto;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, read\nwith the Laws (Continuance in Force) Order, 1977 (C. M. L. A. Order No. 1 of 1977) and in exercise\nof all powers enabling him in that behalf, the President is pleased to make and promulgate the\nfollowing Ordinance :—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, and commencement",
      "content": "(1) This Ordinance may be called the Pakistan Space\nand Upper Atmosphere Research Commission Ordinance, 1981.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once.\n1\n[2. Definitions.—In this Ordinance, unless there is anything repugnant in the subject or\ncontext,―\n(a)       “Chairman” means the Chairman of the Commission;\n(b)       “CJCSC” means the Chairman Joints Chiefs of Staff Committee;\n(c)       “Commission” means the Pakistan Space and Upper Atmosphere Research\nCommission (SUPARCO);\n(d)       “DCC” means the Development Control Committee of NCA;\n(e)       “NCA” means the National Command Authority;\n(f)       “prescribed” means prescribed by rules made under this Ordinance;\n(g)       “Secretary” means the Secretary of the Commission; and\n(h)       “SPD” means Strategic Plans Division, Joint Staff Headquarters.]\n1\nSubs by the Pakistan space and upper Atmosphere Research Commission (Amdt.) Ordinance, 2002 (CXXVII of 2002) s.2.\n1\n[(3)*                *                  *         *          *                  *             *]\n1\n[(4)*                *                        *           *      *              *             *]\n1\n[(5)*                *                        *           *      *              *             *]\n1\n[(6)*                *                        *           *      *              *             *]"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Establishment etc., of the Commission.― 2[(1) The Federal Government shall establish,",
      "content": "in accordance with the provisions of this Ordinance, a Commission to be called the Pakistan Space\nand Upper Atmosphere Research Commission.]\n(2) The Commission shall be a body corporate having perpetual succession and a common\nseal with power, subject to the provisions of this Ordinance, to acquire and hold property, both\nmovable and immovable, and shall by the said name sue and be sued.\n2\n[(3) Every employment under the Commission shall, for the purpose of the Pakistan\nEssential Services (Maintenance) Act, 1952 (LIII of 1952), be deemed to be employment under the\nFederal Government and the said Act shall have effect accordingly.]\n2\n[(4) The Federal Government shall exercise control over the Commission through DCC of\nNCA, SPD being the secretariat of NCA shall coordinate tasking and exercise financial and\nadministrative control over the Commission.]\n2\n[8. Composition of the Commission.―(1) The Commission shall consist of the following\nmembers, namely:―\n(a)    Chairman;\n(b)        Member, Space Technology;\n(c)        Member, Space Electronics;\n(d)        Member, Space Research;\n(e)        Member, Range; and\n(f)        Member, Finance.\n(2) The Chairman of the Commission shall be appointed by the President on the\nrecommendation of the CJCSC.\n(3) The President may, on recommendation of the CJCSC, increase or decrease the number of\nmembers of the Commission.\n(4) The members of the Commission shall be appointed by the President on the\nrecommendation of the CJCSC.]"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Functions of the Commission. The functions of the Commission shall be:―",
      "content": "2\n[(a)   to advance research and development in space science and allied fields and to\nenhance indigenous capabilities in space technology and to promote the\npeaceful applications of space science and technology for the socio-economic\ndevelopment of the country;]\n1\nOmitted by Ord. (CXXVII of 02), ss. 3 to 6.\n2\nSubs. by Ord. (CXXVII of 02), ss. 7 to 9.\n(b)       to undertake such special serveys, investigations and other specialised works\nas may be assigned by the 1[DCC];\n(c)        to prepare and submit to the 1[DCC] its quarterly progress reports;\n(d)        to prepare and submit to the 1[DCC] its annual budget for approval; and\n1\n[(e)   to do all acts and things including research and development projects in space\nscience and technology for the execution of policies laid down by the DCC.]"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Meetings of the Commission.―(1) Save as hereinafter provided, the Commission shall",
      "content": "regulate its own procedure for its meetings.\n(2) The annual report and the accounts of the Commission for each financial year shall be\nsubmitted by the Secretary at a meeting of the Commission to be held within six months of the close\nof that year for adoption.\n(3) To constitute a quorum at a meeting of the Commission, not less than three members,\nincluding the Chairman, shall be present.\n(4) All meetings of the Commission shall be presided over by the Chairman and, in the\nabsence of the Chairman, by a member of the Commission authorised in writing by the Chairman\nand, in the absence of such authorization or of the member so authorised, by a member elected for\nthe purpose by the members present.\n(5) All questions at a meeting of the Commission shall be decided by a majority vote and in\ncase of equality of votes the person presiding shall have a second or casting vote:\nProvided that, in the event of a difference of opinion between the Finance Member and a\nmajority of the other members of the Commission in any matter having financial implications, the\nmatter shall, if the Finance Member so desires, be referred to the 1[DCC] for a decision.\n(6) Any urgent business of the Commission may be transacted by circulation among all its\nmembers, and any proposal so circulated and approved by a majority of the members shall be as\neffective and binding as if such proposal had been passed at a regular meeting of the Commission."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Powers of the Chairman.―(1) The Chairman shall be the Chief Executive Officer of the",
      "content": "Commission and shall, subject to such directions as the 1[DCC] may give from time to time, exercise\nall such powers as are necessary to direct and control the affairs of the Commission in accordance\nwith this Ordinance.\n(2) The Chairman may, subject to rules and regulations made under this Ordinance, appoint,\nemploy on contract or on a part time basis or otherwise such officers, consultants, advisers and other\nstaff as are considered necessary for the efficient working of the Commission.\n(3) The Chairman may delegate all or any of his powers to any member or officer of the\nCommission.\n1\nSubs. by Ord. No. (CXXVII of 02), ss. 9 to 11."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Funds of the Commission.―(1) The funds of the Commission shall consist of―",
      "content": "(i)        grants-in-aid from           the    Federal   Government   and   Provincial\nGovernments;\n(ii)       donations and endowments of money approved by the Federal\nGovernment;\n(iii)      income from investments and royalties; and\n(iv)       receipts from such other sources as may be approved by the\nCommission.\n(2) The Commission may open its account with any scheduled Bank of Pakistan 1[as per the\nprescribed procedures].\n1\n[13. Budget, audit and accounts.― (1) The Commission shall prepare and submit its\nannual budget to the DCC showing the estimated receipts and expenditure and the sums likely to be\nrequired from the Federal Government during the next financial year before the end of March every\nyear.\n(2) The accounts of the Commission shall be maintained and presented for audit to the DCC\nin such form and manner as may be prescribed by the Federal Government.]"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. International Co",
      "content": "operation. The Commission may, subject to the prior approval of the\nFederal Government, co-operate with any international organization for furthering peaceful uses of\nspace and applications of space sciences and technology pursuant to the terms and conditions of any\nprogramme or agreement for co-operation to which such organization is a party or pursuant to any\nother international agreement made before or after the commencement of this Ordinance."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Discoveries and Inventions. All rights relating to discoveries and inventions and any",
      "content": "improvement in materials, methods, processes, apparatus or equipment made by any officer or\nemployee of the Commission in the course of his employment shall vest in the Commission."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Declaration of fidelity. Every member, adviser, officer or other employee of the",
      "content": "Commission shall make such declaration of fidelity and secrecy as may be prescribed."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Continuance of certain rules. All rules, regulations, orders and instructions of the",
      "content": "1\n[Commission] in force immediately before the commencement of this Ordinance shall, mutatis\nmudandis and so far as they are not inconsistent with any of the provisions of this Ordinance,\ncontinue in force until repealed or altered by rules or regulations made under this Ordinance."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Ordinance XXIII of 1969 not to apply to Commission. Nothing contained in the",
      "content": "Industrial Relations Ordinance, 1969 (XXIII of 1969), shall apply to or in relation to the Commission\nor any of the officers and employees of the Commission."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Winding up of the Commission. No provision of law relating to the winding up of",
      "content": "bodies corporate shall apply to the Commission and the Commission shall not be wound up except\nby order of the Federal Government and in such manner as the Federal Government may direct.\n1\n[(21)*                *                     *                  *      *    *               *]\n1\n[(22)*               *                      *                  *      *    *               *]"
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Power to make rules. The Federal Government may, by notification in the official",
      "content": "Gazette, make rules 1[, not inconsistent with the provisions of this Ordinance,] for carrying out the\npurposes of this Ordinance."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Power to make regulations. The Commission may, with the previous approval of the",
      "content": "2\n[DCC] make such regulations not inconsistent with the provisions of this Ordinance and the rules\nmade thereunder as it may consider necessary or expedient for the administration and management of\nthe affairs of the Commission."
    }
  ],
  "definitions": []
}
