{
  "id": "pk-pakistan-study-centres-act-1976",
  "type": "statute",
  "title": "Pakistan Study Centres Act, 1976",
  "title_en": "Pakistan Study Centres Act, 1976",
  "short_name": "PSCA",
  "status": "in_force",
  "issued_date": "1976-05-10",
  "in_force_date": "1976-05-10",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2hx-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Study Centres Act, 1976 (XXVII of 1976) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Pakistan\nStudy Centres Act, 1976.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act unless there is anything repugnant in the subject or context,",
      "content": "(a)        “Board” means a Board of Governors referred to in sub-section (1) of\nsection 6;\n(b)        “Centre” means a Pakistan Study Centre established under section 3 and,\nexcept in that section and section 4, includes the Institute;\n(c)        “Commission” means the University Grants Commission;\n(d)        “Director” means the Director of a Centre or Institute;\n(e)        “Institute” means the National Institute of Pakistan Studies, University of\nIslamabad;\n(f)        “regulations” means regulations made under section 12; and\n(g)        “rules” means rules made under section 11."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of Centre and the Institute. As soon as may be after the commencement",
      "content": "of this Act, the Federal Government may by notification in the official Gazette, establish a\nPakistan Study Centre in a University specified in the notification and the National Institute of\nPakistan Studies in the University of Islamabad.\n1\nFor Statement of Objects and Reasons, see Gaz. of P., 1976, Ext., Pt. Ill, p. 334."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Functions of Centre. A Centre shall",
      "content": "(a)    engage in the study of languages, literature, social structure, customs,\nattitudes and motivation, of the people of various regions of Pakistan;\n(b)    establish under-graduate, graduate, post-graduate degree and other\nprogrammes in the relevant discipline in accordance with the standard and\nrequirements of the University in which the Centre is established;\n(c)    promote co-operation in inter-disciplinary relationship with other centres,\nteaching and research establishments;\n(d)    arrange conferences, seminars and refresher courses for the development of\nteaching and research;\n(e)    promote teaching and research in particular subjects as assigned to it by the\nFederal Government in consultation with the University in which the Centre\nis established."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Functions of Institute. The Institute shall",
      "content": "(a)    engage in high-level teaching and research;\n(b)    train research workers;\n(c)    establish M.A., M.Phil, Ph.D. and other programmes in the relevant discipline\nin accordance with the standard requirements of the University of Islamabad;\n(d)    promote co-operation in inter-disciplinary relationship with other centres,\nteaching and research establishments;\n(e)    arrange conferences, seminars and refresher courses for the development of\nteaching and research; and\n(f)    conduct teaching and research in such particular field as is assigned to it by the\nFederal Government in consultation with the University of Islamabad."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Board of Governors",
      "content": "(1) The management, overall control and supervision of the affairs\nof a Centre established in a University shall vest in a Board of Governors consisting of the following\nmembers, namely:—\n(a)    Vice-Chancellor of the University, who shall also be its Chairman;\n(b)    a representative of the Commission;\n(c)    a representative of the Pakistan History Commission;\n(d)    a representative of the Ministry of Education;\n(e)    a representative of the National Educational Council;\n(f)    Dean of the Faculty of the University;\n(g)    two experts in the relevant discipline to be nominated by the Federal\nGovernment on the recommendation of the Commission;\n(h)    one expert in the relevant discipline to be nominated by the Syndicate of the\nUniversity;\n(i)    one expert in the relevant discipline to be nominated by the Academic Council\nof the University;\n(j)    Director of the Centre.\n(2) In particular and without prejudice to the generality of the foregoing provision, a Board\nshall have the power to—\n(a)    approve the academic and research programmes of the Centre with the\nconcurrence of the Academic council of the Univeristy in which the centre is\nestablished;\n(b)    lay down rules of admission to the Centre;\n(c)    institute fellowships for promotion of research in the discipline concerned;\n(d)    create, suspend or abolish such posts as may be necessary;\n(e)    appoint teachers and other officers; and\n(f)    hold, control and administer the funds of the Centre.\n(3) A member of a Board referred to in clause (g) of sub-section (1) shall hold office for such\nterm as may be determined by the Federal Government.\n(4) The meetings of a Board shall be held as and when called by the Chairman:\nProvided that not less than two meetings shall be held in each year and the period between\nsuch meetings shall not be more than twelve months. .\n(5) In the exercise of its powers and the performance of its functions, a Board shall be subject\nto such special or general instructions as may be issued by the Commission from time to time.\n(6) A Board may, for the speedy and efficient working of the Centre, delegate to the\nDirector such of its powers as it may deem necessary."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Director",
      "content": "(1) The Director shall be appointed by the Federal Government after\nconsultation with the Commission and the University in which the Centre concerned is\nestablished on such remuneration and other terms and conditions of service as may be determined by\nthe Federal Government.\n(2) The Director shall be the academic and executive head of the Centre and Secretary of the\nBoard, and shall be responsible to the Board for carrying out the objectives of the Centre.\n(3) The Director shall perform such other functions and exercise such powers as may be\nassigned or delegated to him by the Board.\n(4) The Director may, by writing under his hand addressed to the Chairman, resign his office."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Academic Committee",
      "content": "(1) At each Centre there shall be an Academic Committee\nconsisting of the following members, namely:—\n(a)    Director of the Centre, who shall also be its convener;\n(b)    all Professors and Associate Professors of the Centre; and\n(c)        two experts to be nominated by the Commission.\n(2) The Committee may associate such other experts as it may consider necessary.\n(3) The Committee shall prepare and submit to the Board the academic and research\nprogrammes of the Centre."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Fund. Each Center shall have a fund to which shall be credited",
      "content": "(a)        grants made by the Federal Government, the Provincial Government and the\nCommission;\n(b)        contributions and donations from individuals, local bodies, corporations,\ninstitutions, organizations and agencies; and\n(c)        income from fees."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Audit and accounts, etc.(1) The accounts of a Centre shall be maintained in such form",
      "content": "and manner as may be prescribed by rules.\n(2) The accounts of a Centre shall be audited once in every year by an auditor appointed by\nthe Commission on such remuneration, if any, to be paid by the Centre, as the Commission may fix.\n(3) A Center shall submit, through the Commission, to the Federal Government a copy\nof its audited annual accounts, together with the observations of the Director, if any thereon, and a\nreport on the activates of the Centre during the preceding year.\n(4) A Centre shall furnish to the Federal Government such information relating to its\nactivities as may be asked for by the Federal Government from time to time.\n1\n[10A. Power to transfer Centres. The Federal Government may, by Order published in the\nofficial Gazette and subject to such terms and conditions as may be specified therein, transfer any\nCentre to a University or, as the case may be, the Provincial Government.]"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Power to make rules. The Federal Government may, by notification in the official",
      "content": "Gazette, make rules for carrying out the purposes of this Act, including rules to regulate the financial\nand administrative matters relating to a Centre."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to make regulations. A Centre may, with the approval of the Commission, make",
      "content": "such regulations concerning academic matters, not inconsistent with the rules, as it may consider\nnecessary for carrying out the purposes of this Act.\n1\nIns. by Ord. LVIII of 02, s. 2 and Sch."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "a Board of Governors referred to in sub-section (1) of section 6;",
      "source_provision": "sec2"
    },
    {
      "term": "Centre",
      "definition": "a Pakistan Study Centre established under section 3 and, except in that section and section 4, includes the Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the University Grants Commission;",
      "source_provision": "sec2"
    },
    {
      "term": "Director",
      "definition": "the Director of a Centre or Institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Institute",
      "definition": "the National Institute of Pakistan Studies, University of Islamabad;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under section 12; and",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under section 11.",
      "source_provision": "sec2"
    }
  ]
}
