{
  "id": "pk-pakistan-trade-control-of-wiled-fauna-and-flora-act-2012",
  "type": "statute",
  "title": "Pakistan Trade Control of Wiled Fauna and Flora Act, 2012",
  "title_en": "Pakistan Trade Control of Wiled Fauna and Flora Act, 2012",
  "short_name": "PTCOW",
  "status": "in_force",
  "issued_date": "2012-05-07",
  "in_force_date": "2012-05-07",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Fqapc%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Trade Control of Wiled Fauna and Flora Act, 2012 (XIV of 2012) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Pakistan Trade\nControl of Wild Fauna and flora Act, 2012.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force on such date as the Federal Government may by notification in\nthe official Gazette, appoint."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(a)    “Convention” means the United Nations Convention on International Trade in\nEndangered Species of Wild Fauna and flora 1973 including such\namendments made therein, which are accepted by Pakistan;\n(b)    “designated authority” means a management authority designated by the\nGovernment of a State, other than Pakistan, for the purposes of the\nConvention;\n(c)    “exotic” means a wild animal or plant species introduced to an area outside of\nits natural occurrence;\n(d)    “export” means taking out of Pakistan by land, sea or air;\n(e)    “indigenous” means a wild animal or plant species native to a specified area, a\ncountry or a region, but not introduced from an area of its natural Occurrence;\n(f)    “Management Authority” means the authority constituted under Section 15;\n(g)    “person” includes legal or natural person, a company, association, a body of\nindividuals whether incorporated or not; and\n(h)    “Scientific Authority” means the Authority designated under Section 16.\n(i)    Then expressions used but not defined herein shall have the same meanings as\nare assigned to them in the Convention."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Prohibition of export, re",
      "content": "export and import and punishment for contravention.—(1)\nNo person shall export or re-export out of or import into Pakistan any specimen included in any\nAppendix of the Convention, except as provided under Section 5, 6, 7 and 9. Such export, re-export\nor import shall be through a customs port of exit or entry, and subject to any other law relating to\ncontrol on export, re-export and import for the time being in force.\n(2) Any person who attempts or abets to do anything which is prohibited under this Act rules\nmade hereunder shall be liable to the same punishment as that of the offence under this Act.\n(3) A person who presents, possesses or uses a false license or certificate shall be guilty of\nthe offence specified in sub-section (2) and be liable for the same punishment as provided in sub-\nsection (5).\n(4) Where an offence under this Act has been committed by a body corporate, and it is\nproved that such offence has been committed with the consent or connivance of or, to be attributable\nto any neglect on part of a director, manager, secretary or other officer of the body corporate or any\nperson who was purporting to act in any such capacity, he as well as the body corporate shall be\nguilty of that offence and shall be liable to be proceeded against and punished accordingly.\n(5) Any person who,—\n(a)    contravenes or resists or interferes with the enforcement of the provisions of\nthis Act or any rule or order made there under; or\n(b)    in an application or in any proceedings under this Act furnishes or abets the\nfurnishing of any information which he knows or has reason to believe to be\nfalse, or fraudulently conceals or misrepresents facts, or abets such\nconcealment or misrepresentation.\nShall be punished with imprisonment for a term which shall not be less than one year or more\nthan two years or with fine which shall not be less than 0.500 million rupees or more than 1.000\nmillion rupees."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Cognizance of Offence",
      "content": "No Court shall take cognizance of any offence punishable under\nthis Act except upon a complaint in writing made by a duly authorized officer of department or an\nofficer designated by the Federal Government."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Export from Pakistan",
      "content": "The export from Pakistan of any specimen included in any\nAppendix shall require valid export permit issued by the Management Authority. An export permit\nshall be granted on fulfill of the following conditions namely:—\n(a)     the Scientific Authority has advised that such export shall not be detrimental\nto the survival of that species and to other species of fauna and flora;\n(b)     the Management Authority is satisfied that the specimen was not obtained in\ncontravention of the laws of Pakistan for the protection of fauna and flora;\n(c)     the Management Authority is satisfied that any living specimen will be so\nprepared and shipped as to minimize the risk of injury, damage to health or\ncruel treatment; and\n(d)     the Management Authority is satisfied that an import permit or no objection\ncertificate has been granted for the specimen by the designated authority."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Import into Pakistan",
      "content": "(1) The import into Pakistan of any specimen included in any\nAppendix shall require the following, namely:—\n(a)      the export permit on a re-export certificate issued by a designated authority;\nand\n(b)     an import permit or no objection certificated issued by the Management\nAuthority.\n(2) An import permit shall be granted on fulfillment of the following conditions, namely:—\n(a)     the Scientific Authority has advised that the import shall be for purposes\nwhich are not detrimental to the survival of the species involved and to other\nindigenous species of fauna and flora;\n(b)     the Scientific Authority is satisfied that the proposed recipient of a living\nspecimen is suitably equipped to house and care for it; and\n(c)      the Management Authority is satisfied that the specimen is not to be used\nprimarily for commercial purposes."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Re",
      "content": "export from Pakistan.—The re-export from Pakistan of any specimen included in any\nAppendix shall require a valid re-export certificate issued by the Management Authority and a re-\nexport certificate shall be granted on fulfillment of the following conditions, namely:—\n(a)      the Management Authority is satisfied that the specimen was imported in\naccordance with the provisions of this Act;\n(b)     the Management Authority is satisfied that any living specimen will be so\nprepared and shipped as to minimize the risk of injury, damage to health or\ncruel treatment;\n(c)     the Scientific Authority is satisfied that the proposed recipient of a living\nspecimen is suitably equipped to house and care for it; and\n(d)     the Management Authority is satisfied that an import permit has been granted\nfor such specimen by the designated authority."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Introduction from the sea",
      "content": "The introduction from the sea of any specimen of a species\nincluded in any Appendix shall require the prior grant of a certificate by the Management Authority.\nA certificate shall be granted on fulfillment of the following conditions, namely:—\n(a)     the Scientific Authority has advised that the introduction will be for purposes\nwhich are not detrimental to the survival of the species involved and to other\nindigenous species of fauna and flora;\n(b)     the Scientific Authority is satisfied that the proposed recipient of a living\nspecimen is suitably equipped to house and care for it;\n(c)     the Management Authority is satisfied that any living specimen will be so\nhandled as to minimize the risk of injury, damage to health or cruel treatment;\nand\n(d)     the Management Authority is satisfied that the specimen is not to be used\nprimarily for commercial purposes."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Export or re",
      "content": "export to or import from a state not a party to the convention.—Where\nexport or re-export from Pakistan to or import into Pakistan is from a State not a Party to the\nConvention, comparable documentation issued by the competent authorities in that State, which\nsubstantially conforms with the requirements of the Convention for permits and certificates, may be\naccepted by the Management Authority in place of the required documents."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Transit or trans",
      "content": "shipment of specimens.___ The provisions of Sections 3 of 9 shall not\napply to the transit or trans-shipment of specimens through or in Pakistan while the specimens\nremain in Customs control."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Specimens that are personal or household effects",
      "content": "The provisions of Sections 3 to 9\nshall not apply to specimens that are personal or household effects but this exemption shall not apply\nwhere,—\n(a)     in the case of specimens included in Appendix-I, they were acquired by the\nowner outside Pakistan, and are being imported into Pakistan; or\n(b)     in the case specimens included in Appendix-II, if—\n(i)     they were acquired by the owner outside Pakistan and in a State where\nremoval from the wild occurred;\n(ii)    they are being imported into Pakistan; and\n(iii)   the State where removal from the wild occurred requires the prior grant\nof export permits before any export of such specimens unless the\nManagement Authority is satisfied that the specimens were acquired\nbefore the coming into force of the Convention and this Act."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Export and import of specimens bred in captivity or artificially propagated",
      "content": "Where\nthe Management Authority or the designated authority or competent authority is satisfied for the\npurposes of export from or import into Pakistan that a specimen of an animal or plant species was\nbred in captivity or was artificially propagated, or is a part of such an animal or plant or was derived\ntherefrom the Management Authority shall,—\n(a)    issue a certificate to this effect; and\n(b)    accept similar certificate issued by a designated authority or a competent\nauthority in lieu of any of the permits and certificates required under Sections\n3 to 9 of this Act."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Non commercial loan, exchange etc",
      "content": "The provisions of Sections 3 to 9 shall not apply\nto the non-commercial loan, donation or exchange, between scientists or scientific institutions\nregistered by the Management Authority or a designated authority or a competent authority, of\nspecimens which carry a label issued or approved by the Management Authority or the designated\nauthority."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Waiver of requirements",
      "content": "The Management Authority may waive the requirements of\nSections 3 to 9 and allow the movement, subject to conditions as it may deem appropriate without\npermits or certificates, of such specimens which form part of a traveling zoo, circus, menagerie, plant\nexhibition or other traveling exhibition provided that,—\n(a)    the exporter or importer registers full details of such specimens with the\nManagement Authority;\n(b)    the specimens are in either of the categories specified in Sections 11, 12 and\n13 of this Act; and\n(c)    the Management Authority is satisfied that any living specimen will be so\ntransported and cared for as to minimize the risk of injury, damage to health or\ncruel treatment."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Management Authority",
      "content": "For purposes of this Act, the Federal Government shall, by\nnotification in the official Gazette, designate one or more Management Authorities, with which at\nleast one representative each from all the Provincial Government and Government of Gilgit\nBaltistan, shall be associated."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Scientific authorities",
      "content": "The Federal Government, on the recommendation of the\nManagement Authority, shall designate one or more scientific authorities, as deemed appropriate\nfrom time to time or on case to case basis, to render advice on plants and animals. The final decision\non all matters related to the Convention shall rest with the Management Authority."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Entry and release of wild exotic fauna and flora",
      "content": "The Federal Government may, by\nnotification in the official Gazette, make rules to regulate entry into and release of exotic fauna and\nflora in Pakistan."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Confiscation or return of specimens unlawfully traded",
      "content": "The specimens included in\nconfiscation by the Federal Government and thereafter, if so desired, return to the State of export."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Confiscation of specimens possessed unlawfully",
      "content": "Any specimen included in the\nAppendices found in possession of a person without legal permit or certificate shall be confiscated\nand the person shall be punished as provided under Section 3."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Animals and plants etc., to be Government property",
      "content": "(1) Notwithstanding anything\ncontained in any other law for the time being in force and subject to the provisions of this Act, the\nspecimens, the trade and possession of which has been prohibited under this Act or rules made there\nunder shall, upon confiscation, be the property of the Federal or the Provincial Government, as the\ncase may be.\n(2) Any person who obtains, by any means, the possession of the Government property as\nmention in sub-section (1) shall, within forty-eight hours from obtaining such possession, handover\nsuch property to such officer as designated by the Federal Government.\n(3) No person shall, without the previous permission in writing of the Management Authority\nor the designated department or officer,—\n(a)    acquire or keep in his possession, custody or control; or\n(b)    transfer to any person, whether by way of gift, sale or otherwise; or\n(c)    destroy or damage the property of the Government."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Arrangements for feeding and safe keeping",
      "content": "The Management Authority shall make\nsuitable arrangements for feeding and safe keeping of the specimens confiscated under this Act so\nthat the living specimens are properly cared for so as to minimize the risk of injury, damage to health\nor cruel treatment."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Maintenance of records",
      "content": "The Management Authority shall maintain the following\nrecords of trade in specimens included in Appendices, namely:—\n(a)    the names and addresses of traders including the exporters and\nimporters;\n(b)    the number and type of permits and certificates granted;\n(c)    the State with which such trade occurred;\n(d)    the numbers or quantities and types of specimens;\n(e)    names of species as included in Appendices; and\n(f)    where applicable, the size and sex of the specimen in question."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Officers to be public servants",
      "content": "The officers or persons authorized under any provisions\nof this Act to do certain thing or act in certain manner shall be deemed to be public servant within the\nmeaning Section 21 of the Pakistan Penal Code, 1860 (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Power to delegate",
      "content": "The Federal Government may by notification in the official Gazette\ndelegate, subject to such conditions as may be specified in the notification, any of its or of a Federal\nagency's powers and functions under this Act and the rules made there under to any Provincial\nGovernment."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Bar of jurisdiction",
      "content": "No Court shall grant any injunction or make any order, nor shall\nany Court entertain any proceeding, in relation to anything done under this Act, except the Court or\ntribunal designated by the Federal Government. Such Court or tribunal shall have the authority to\nexercise powers and functions as provided under the relevant laws, necessary for the implementation\nof the provisions of this Act."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Indemnity",
      "content": "No suit, prosecution or other legal proceeding shall lie against Federal\nGovernment or any person for anything which is in good faith done or intended to be done under this\nAct."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Act to override other laws",
      "content": "The provisions of this Act or rule made there under shall\nhave effect notwithstanding anything contained in any other law for the time being in force or in any\ninstrument having effect by virtue of any such law."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to the provisions of this\nAct, the Federal Government may, not inconsistent with the provisions of this Act, give such\ndirections as it may consider necessary for the removal of such difficulties.\n__________________"
    }
  ],
  "definitions": [
    {
      "term": "Convention",
      "definition": "the United Nations Convention on International Trade in Endangered Species of Wild Fauna and flora 1973 including such amendments made therein, which are accepted by Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "designated authority",
      "definition": "a management authority designated by the Government of a State, other than Pakistan, for the purposes of the Convention;",
      "source_provision": "sec2"
    },
    {
      "term": "exotic",
      "definition": "a wild animal or plant species introduced to an area outside of its natural occurrence;",
      "source_provision": "sec2"
    },
    {
      "term": "export",
      "definition": "taking out of Pakistan by land, sea or air;",
      "source_provision": "sec2"
    },
    {
      "term": "indigenous",
      "definition": "a wild animal or plant species native to a specified area, a country or a region, but not introduced from an area of its natural Occurrence;",
      "source_provision": "sec2"
    },
    {
      "term": "Management Authority",
      "definition": "the authority constituted under Section 15;",
      "source_provision": "sec2"
    },
    {
      "term": "person",
      "definition": "legal or natural person, a company, association, a body of individuals whether incorporated or not; and",
      "source_provision": "sec2"
    },
    {
      "term": "Scientific Authority",
      "definition": "the Authority designated under Section 16. (i) Then expressions used but not defined herein shall have the same meanings as are assigned to them in the Convention.",
      "source_provision": "sec2"
    }
  ]
}
