{
  "id": "pk-pakistan-water-and-power-development-authority-act-1958",
  "type": "statute",
  "title": "Pakistan Water and Power Development Authority Act, 1958",
  "title_en": "Pakistan Water and Power Development Authority Act, 1958",
  "short_name": "PWAPD",
  "status": "in_force",
  "issued_date": "1958-04-18",
  "in_force_date": "1958-04-18",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tkZg%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pakistan Water and Power Development Authority Act, 1958 (XXXI of 1958) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent. (1) This Act may be called the 4[Pakistan Water and Power",
      "content": "Development Authority Act, 1958].\n(2) It extends to the whole of 5[Pakistan, except the 6[Districts] of Karachi.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context",
      "content": "(i)        “Authority” means the 7[Pakistan Water and Power Development Authority]\nestablished under section 3 of this Act;\n(ii)       “Chairman” means the Chairman of the Water and Power Development\nAuthority;\n(iii)      “controlled station” means a power generating station declared as a controlled\nstation under clause (iv) of sub-section (1) of section 11;\n(iv)       “Government” means the 8[Federal Government];\n(v)        “land” includes benefits to arise out of land, and things attached to the earth or\npermanently fastened to anything attached to the earth;\n(vi)       “local body” means any District Board, District Local Board, Municipal\nCorporation, Municipal Committee, Municipality, Small Town Committee or\nNotified Area Committee;\n1\nSubstituted by West Pakistan Ordinance No. LXXII of 1979, s. 2.\n2\nSubstituted by West Pakistan Ordinance No. LXXII of 1979, s. 2.\n3\nSubstituted by West Pakistan Ordinance No. LXXII of 1979, s. 2.\n4\nSubstituted by West Pakistan Ordinance No. LXXII of 1979, s. 3.\n5\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. 2 and Sch.\n6\nSubstituted by Act No. XIII of 1994, s. 2.\n7\nSubstituted by West Pakistan Ordinance No. LXXII of 1979, s. 4.\n8\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. 2 and Sch.\n(vii)     “Member” means Member of the Water and Power Development Authority;\n(viii)     “power” includes hydraulic power, electrical energy, steam, gas or any other\npower notified as such by the 1[Government] in the Official Gazette; and\n(ix)       “Regulations” means Regulations framed under this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Constitution of the Authority. (1) There shall be established an Authority to be known as",
      "content": "2\nthe [Pakistan Water and Power Development Authority] for carrying out the purposes of this Act.\n(2) The Authority shall be a body corporate, shall be entitled to acquire 3[, hold and dispose of]\nproperty, shall have perpetual succession and a common seal and shall by the said name sue and be\nsued."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Appointment and term of office of Chairman and Members. 4[(1) The Authority shall",
      "content": "consist of a Chairman and not more than three members, to be appointed by Government.]\n(2) The term of office of the Chairman shall be five years and that of a Member three years.\n(3) Any person ceasing to be the Chairman or Member by reason of the expiry of the term of\nhis office shall be eligible for re-appointment for another term or for such shorter term as the\nGovernment may decide.\n(4) The Chairman or any Member may at any time resign; provided that his resignation shall\nnot take effect until accepted by the Government."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Remuneration and conditions of service. The Chairman and each Member shall receive",
      "content": "such salary and allowances and be subject to such conditions of service as may be prescribed by the\nGovernment, and shall perform such duties as are assigned to them under this Act or by any Regulation\nframed under it."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Removal of Chairman or Members. The Government may by notification remove the",
      "content": "Chairman or any Member__\n(a)        if he refuses or fails to discharge or becomes in the opinion of the Government,\nincapable of discharging, his responsibilities under this Act; or\n(b)        if he has been declared insolvent; or\n(c)        if he has been declared to be disqualified for employment in, or has been\ndismissed from the service of Pakistan, or has been convicted of an offence\ninvolving moral turpitude; or\n(d)        if he has knowingly acquired or continued to hold without the permission in\nwriting of the Government, directly or indirectly or through a partner, any share\n1\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. 2 and Sch.\n2\nSubstituted by West Pakistan Ordinance No. LXXII of 1979, s. 3.\n3\nSubstituted by Act No. XIII of 1994, s. 3.\n4\nSubstituted by the West Pakistan Ordinance No. XII of 1967, s. 2.\nor interest in any contract or employment with or by or on behalf of the\nAuthority, or in any land or property which, in his knowledge, is likely to benefit\nor has benefited as a result of the operation of the Authority."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Meetings of the Authority. (1) The Authority shall meet at such time and place and in such",
      "content": "manner, as may be prescribed by Regulations:\nProvided that until Regulations are made in this behalf, such meetings shall be convened by\nthe Chairman.\n(2) The Chairman, or in his absence a Member authorised by him, and one other Member shall\nbe present to constitute a quorum at a meeting of the Authority."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. General powers and duties of the Authority and framing of schemes. (1) The Authority",
      "content": "shall prepare, for the approval of the Government, a comprehensive plan for the development and\nutilization of the water and power resources of 1[Pakistan] on a unified and multi-purpose basis.\n(2) The Authority may frame a scheme or schemes for 2[a Province] or any part thereof\nproviding for all or any of the following matters, namely—\n(i)        irrigation, water-supply and drainage; and recreational use of water resources;\n(ii)       the generation, transmission and distribution of power; and the construction,\nmaintenance and operation of power houses and grids;\n(iii)      flood control;\n(iv)       the prevention of waterlogging and reclamation of waterlogged and salted lands;\n(v)        inland navigation; 3[*]\n(vi)       the prevention of any ill-effects on public health resulting from the operations\nof the Authority ; 4[;] 5[and]\n5\n[(vii) Privatise or otherwise restructure any operation of the Authority except the\nhydel generating power stations and the National Transmission Grid]\n(3) Every scheme prepared by the Authority under sub-section (2) shall be submitted for\napproval to the Government, with the following information:__\n(i)        a description of the scheme and the manner of its execution;\n_________________________________________________________________________________\n1\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. 2 and Sch.\n2\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. 2 and Sch.\n3\nOmitted by Act No. XIII of 1994, s. 4.\n4\nSubstituted by Act No. XIII of 1994, s. 4.\n5\nAdded by Act No. XIII of 1994, s. 4.\n(ii)       an estimate of costs and benefits; the allocation of costs to the various purposes\nto be served by the scheme and the amounts to be repaid by the beneficiaries;\nand\n(iii)      a statement of the proposals by the Authority for the resettlement or rehousing\nof persons likely to be displaced by the execution of the scheme.\n(4) The Government may sanction or may refuse to sanction, or may return for reconsideration\nany scheme submitted to it under this section, or may call for such further details or information about\nthe scheme, or may direct such further examination of the scheme as it may consider necessary.\n1\n[(5) Where a scheme is sanctioned by the Government under sub-section (4), the Authority\n__\nmay\n(a)        undertake any joint venture or work in association with the Provincial\nGovernment, an agency, corporation, company, authority or any person and\nmay subscribe to the equities and acquire such other rights and obligations as\nmay be necessary for such joint venture or association;\n(b)        promote, form or sponsor any company or companies having objects of\ninstallation of thermal and hydel projects and development and utilization of\nany resources of energy for generation, transmission and distribution of power\nand for survey, investigation, exploitation and utilization of resources of energy\nfor generation, transmission and distribution of power;\n(c)        subscribe for, take or otherwise acquire, hold and dispose of shares, bonds,\ndebentures, commercial papers or other securities of any company promoted,\nformed or sponsored under clause (b) and receive dividends or other payments\ntherefrom and transfer to it any of its land or any other property, moveable or\nimmoveable, tangible or intangible, against cash, shares, bonds, debentures,\ncommercial papers or other securities as is desirable or necessary to enable it to\nprivatise or otherwise restructure any operation of the Authority;\n(d)        enter into any of the following arrangements which may be consistent with its\nobjects, namely:__\n(i)     provision of services and personnel;\n(ii)    provision of goods, appliances, plants, machinery and other material;\nand\n(iii)   purchasing of electrical capacity and energy from any company\nspecified in clause (b); and\n(e)        enter into any contract or agreement with any company or companies specified\nin clause (b).\nExplanation.__ For the purpose of this section, the expression “privatise” means the transfer or\ndisinvestment of any of its assets, property, rights or liabilities, interest, power houses, grid operation\nof work, or maintenance thereof, or generation or its distribution, by the Authority, with the prior\n1\nAdded by Act No. XIII of 1994, s. 4.\napproval of the Federal Government, for valuable consideration to any person, company or\nbody on ownership basis or for management, control, operation or maintenance, either in joint venture\nor in association or otherwise and subject to such conditions as the Authority may impose.]"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Schemes framed by other agencies. (1) Any scheme framed by an agency in 1[any",
      "content": "Province], other than the Authority, in respect of any of the matters enumerated in sub-section (2) of\nsection 8, if its estimated cost exceeds the amount to be prescribed by the Government, shall be\nsubmitted to the Government through the Authority and the Government may pass any of the orders\ncontemplated by sub-section (4) of section 8.\n(2) The Authority may, with the approval of the Government undertake the execution of any\nscheme, or exercise technical supervision and administrative and financial control over the execution\nof any scheme framed or sponsored by any agency in respect of the matters enumerated in sub-section\n(2) of section 8.\n2\n[9A. Notwithstanding anything contained in this Act, the Authority may, with the previous\napproval of the Government, undertake the execution of any scheme framed or sponsored by a\nProvincial Government or any agency under the control of a Provincial Government or exercise\ntechnical supervision and administrative and financial control over the execution thereof on such terms\nand conditions as may be agreed to by the Authority on the one hand and the Provincial Government\nor, as the case may be, such agency in consultation with the Provincial Government on the other.]"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Survey and experiments. The Authority, if it considers this necessary or expedient for",
      "content": "carrying out the purposes of this Act, may__\n(a)         cause studies, surveys, experiments or technical research to be made; or\n(b)         contribute towards the cost of any such studies, surveys, experiments or\ntechnical research made by any other agency.\n3\n[10-A. On and from such date as the Government may, by notification, declare and subject to\nsuch terms and conditions as it may determine, all assets including lands, works, machinery, apparatus,\nmaterial and plants vested in the Government in the Electricity Department shall vest in the Authority,\nand all liabilities in respect of the said assets shall be the liability of the Authority.]"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Control over waters, power houses and grids. (1) Subject to the provisions of any other",
      "content": "law for the time being in force, the Authority__\n(i)         shall have control over the—\n(a)         underground water resources of any region in 4[a Province];\n(b)         operation of 5[its] power houses and grids, including such ancillary\nworks as may be considered necessary for their proper operation;\n1\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. 2 and Sch.\n2\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. 2 and Sch.\n3\nAdded by the West Pakistan Ordinance No. XIII of 1959, s. 3.\n4\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. 2 and Sch.\n5\nSubstituted by Act No. XIII of 1994, s. 5.\n(ii)       may make recommendations to the Government for prescribing standards for\nthe__\n(a       operation and maintenance of all irrigation works;\n(b)      maintenance of power houses and grids;\n(iii)      may make recommendations to the Government for promoting simplification of\nmethods of charge for supplies of electricity and standardisation of the system\nof supply;\n1\n[*   *       *      *       *       *      *]\n2\n[*   *      *       *      *       *      *]\n(2) Before the Authority exercises any control under clause (i) of sub-section (1), the area over\nwhich and the extent to which control is intended to be exercised shall be agreed to and notified by the\nGovernment in the Official Gazette.\n2\n[*                *               *              *              *               *              *]"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Authority to have powers and obligations of licensee under Act IX of 1910. The",
      "content": "Authority shall, for the purposes of the Electricity Act, 1910 (IX of 1910), be deemed to be a licensee\nand shall have all the powers and discharge all the obligations of a licensee under the said Act:\nProvided that nothing in sections 3 to 11, sub-sections (2) and (3) of section 21 and sections\n22, 23 and 27 or in clauses I to XII of the Schedule to the said Act relating to the duties and obligations\nof a licensee shall apply to the Authority."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Powers regarding certain matters. (1) The Authority may take such measures and",
      "content": "exercise such powers as it considers necessary or expedient for the carrying out of the purposes of this\nAct.\n(2) Without prejudice to the generality of the power conferred by the preceding sections and\nthe provisions of sub-section (1) of this section, the Authority may for carrying out the purposes of\nthis Act__\n(a)        undertake any works, incur any expenditure, procure plant, machinery and\nmaterials required for its use and enter into and perform all such contracts as it\nmay consider necessary or expedient;\n(b)        acquire by purchase, lease, exchange or otherwise and dispose of by sale, lease,\nexchange or otherwise any land or any interest in land;\n(c)        place wires, poles, wall brackets, stays, apparatus and appliances for the\ntransmission of electricity, or for the transmission of telegraphic or telephonic\ncommunications necessary for the proper execution of a scheme;\n(d)        direct the owners of private lands to—\n(i)      carry out measures for training of streams;\n1\nOmitted by Act No. XIII of 1994, s. 5.\n2\nOmitted by Act No. XIII of 1994, s. 5.\n(ii)    undertake anti-erosion operations, including conservation of forests and\nre-afforestation;\n(e)     restrict or prohibit by general or special order the clearing and breaking up of\nland in the catchment area of any river;\n(f)     direct that any work which has been required to be done by any person under\nthe two preceding clauses, and which remains undone, shall, after due notice to\nsuch person and consideration of any objection raised by him, be executed by\nthe Authority and specify the proportion in which the risk and expense of such\nwork shall be borne by such person, or by any other person who, after being\ngiven a reasonable notice and after such inquiry as the Authority considers\nnecessary, is held by the Authority to be responsible for the execution of such\nwork in whole or in part; and\n(g)     seek and obtain advice and assistance in the preparation or execution of a\nscheme from any local body or agency of the Government, and such local body\nor agency shall give the advice and assistance sought by the Authority to the\nbest of its ability, knowledge and judgement:\nProvided that the Authority shall pay the cost of such advice and\nassistance if the giving of such advice and assistance entails additional\nexpenditure to the local body or the agency.\n(3) The acquisition of any land or any interest in land for the Authority under this section, or\nfor any scheme under this Act, shall be deemed to be an acquisition for a public purpose within the\nmeaning of the Land Acquisition Act, 1894 (I of 1894), and the provisions of the said Act shall apply\nto all such proceedings."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Right of entry. (1) The Chairman or any person authorised by him in writing, may enter",
      "content": "upon and survey any land, erect pillars for the determination of intended lines of works, make borings\nand excavations and do all other acts which may be necessary for the preparation of any scheme:\nProvided that when the affected land does not vest in the Authority, the power conferred by\nthis sub-section shall be exercised in such manner as to cause the least interference with, and the least\ndamage to, the rights of the owner thereof.\n(2) When any person enters into or upon any land in pursuance of sub-section (1), he shall, at\ndamage to be done as aforesaid, and in case of dispute as to the sufficiency of the amount so paid or\ntendered, the dispute shall be referred to the Deputy Commissioner of the district whose decision shall\nbe final."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Sanction of the Government. A scheme framed and sanctioned under this Act may be",
      "content": "amended or modified by the Authority at any time, but if a material change is made in the scheme,\nprevious sanction of the Government shall be obtained.\nExplanation__ An increase in the cost of the scheme by more than fifteen per cent of the\nsanctioned cost, or a change in the benefit and cost ratio which either makes the cost component in the\nratio exceed the benefits or reduces the benefits component by more than fifteen per cent shall be\ndeemed to be a material change for the purpose of this section."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Arrangements with local body or other agency. (1) As soon as any scheme has been",
      "content": "carried out by the Authority or at a later date, the Authority may arrange by a written agreement with\na local body or other agency within whose jurisdiction any particular area covered by the scheme lies,\nto take over and maintain any of the works and services in that area. If the Authority fails to obtain the\nassent of such a local body or other agency, it may refer the matter to the 1[Provincial Government],\nand the 2[Provincial Government] may give such directions to the local body or the other agency as it\nmay deem fit.\n(2) The Government shall have the power to direct the Authority to hand over any scheme other\nthan a power scheme or the power part of a multi-purpose scheme carried out by it to any agency of\nthe Government or a local body. In such a case the Authority shall be entitled to receive credit to the\nextent of the audited expenditure incurred by it on that scheme."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Employment of officers and servants. (1) The Authority may from time to time employ",
      "content": "such officers and servants, or appoint such experts or consultants, as it may consider necessary for the\nperformance of its functions, on such terms and conditions as it may deem fit 3[:]\n4\n[Provided that all persons serving in connection with the affairs of 5[a Province] in the\nElectricity and Irrigation Departments shall be liable to serve under the Authority, if required to do so\nby the 6[Provincial Government], on such terms and conditions as the 7[Provincial Government] may,\nin consultation with the Authority, determine but shall not be entitled to any deputation allowance:\nProvided further that the 8[Provincial Government] may, in relation to any such person as\naforesaid, delegate such administrative, disciplinary and financial powers to the Authority as the\n9\n[Provincial Government] may deem fit:\nProvided also that the terms and conditions of service of any such person as aforesaid shall not\nbe varied by the Authority to his disadvantage.]\n10\n[(1A) Notwithstanding anything contained in sub-section (1) or any rules made, or orders or\ninstructions issued, by the Authority, or in the terms and conditions of service of any person employed\nby, or serving under the Authority, the Authority may, at any time, retire or remove from its service\nany person 11[after informing him in writing of the grounds on which such action is proposed to be\ntaken and giving him an opportunity of showing cause in writing against the action, within a period of\nfourteen days.]\n[Explanation I.__ For the purpose of this sub-section, ‘any person employed by, or serving\n12\nunder the Authority’ includes a person referred to in the provisos to sub-section (1).\nExplanation II.__ Any person referred to in the provisos to sub-section (1) who is removed or\nretired from service by the Authority under this sub-section shall stand reverted to the Province to\n1\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. and Sch.\n5\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. and Sch.\n3\nSubs. by the West Pakistan Ordinance No. XIII of 1959, s. 4.\n4\nAdded by the West Pakistan Ordinance No. XIII of 1959, s. 4.\n5\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. and Sch.\n6\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. and Sch.\n7\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. and Sch.\n8\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. and Sch.\n9\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. and Sch.\n10\nInserted by the West Pakistan Act No. LXXXIV of 1975, s. 2.\n11\nSubstituted by Act No. XIII of 1994, s. 6.\n12\nAdded and shall be deemed always to have been so added by West Pakistan Ordinance No. LXXII of 1979, s. 6.\nwhich he is allocated under the Province of West Pakistan (Dissolution) Order, 1970 (P.O. No.1 of\n1970).]\n(1B) Service under the Authority is hereby declared to be service of Pakistan and every person\nholding a post under the Authority, not being a person who is on deputation to the Authority from any\nProvince, shall be deemed to be a civil servant for the purposes of the Service Tribunals Act, 1973\n(LXX of 1973).]\n1\n[(1C) Any order of removal or termination of service passed by the Authority, in exercise of\nthe powers conferred by sub-section (1A), shall not be called in question in any proceedings taken\nunder the Industrial Relations Ordinance, 1969 (XXIII of 1969), or the Essential Services\n(Maintenance) Act, 1952 (LIII of 1952), or under any law for the time being in force, before any Court,\nTribunal or Commission and any order passed by any Court, Tribunal or Commission after the thirtieth\nday of September, 1975, and before the coming into force of the West Pakistan Water and Power\nDevelopment Authority (Amendment) Ordinance, 1979, setting aside or modifying or declaring any\norder of the Authority to be void and of no effect, shall stand vacated.]\n2\n[(1D) Nothing contained in the Industrial Relations Ordinance, 1969 (XXIII of 1969), shall\napply to or in relation to any person employed as a member of the security staff of the Authority for\nthe protection of the installations and establishments of the Authority.]\n(2) The Chairman, in case of urgency, may appoint such officers and servants on such terms\nand conditions as may be necessary:\nProvided that every appointment made under this sub-section shall be reported to the Authority\nwithout unreasonable delay.\n(3) 3[*              *         *          *         *          *         *          *]"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Recruitment and conditions of service and disciplinary powers. The Authority shall",
      "content": "prescribe the procedure for appointment, and terms and conditions of service of its officers and\nservants, and shall be competent to take disciplinary action against its officers and servants."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Immunity of the Authority and its employees. (1) The Chairman, Members, officers and",
      "content": "servants of the Authority shall, when acting or purporting to act in pursuance of any of the provisions\nof this Act, be deemed to be public servants within the meaning of section 21 of the Pakistan Penal\nCode (XLV of 1860).\n(2) No suit, prosecution or other legal proceedings shall lie against the Authority, the Chairman,\nMembers or officers and servants of the Authority in respect of anything done or intended to be done,\nin good faith under this Act.\n1\nAdded by West Pakistan Ordinance No. LXXII of 1979, s. 6.\n2\nAdded by Ordinance No. XIII of 1983, s. 2.\n3\nOmitted by the West Pakistan Statutory Bodies (Appointment and Removal of Legal Advisers) Ordinance, 1965 (West Pakistan Ordinance No. XXXII\nof 1965, s. 5 and Sch.\n4\nOmitted by Ordinance No. XXVII of 2000, s. 2."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Delegation of powers to Chairman, etc. The Authority may by general or special order",
      "content": "delegate to the Chairman, a Member, or officer of the Authority, any of its powers, duties or functions\nunder this Act subject to such conditions as it may think fit to impose."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Submission of yearly reports and returns, etc. (1) The Authority shall submit to the",
      "content": "Government, as soon as possible after the end of every financial year but before the last day of\n1\n[September] next following, a report on the conduct of its affairs for that year.\n(2) A copy of the report mentioned in sub-section (1), together with a copy of the audit report\nreferred to in section 28 shall be placed by the Government before the 2[National Assembly] 3[,] 4[and\nthe 5[National Assembly] shall refer the same to its Committee on public Accounts for scrutiny and\nexamination,]\n6[\n(2A) The Committee on Public Accounts shall scrutinise and examine the reports referred to\nit under sub-section (2) in the same manner as, and shall in respect thereof, perform the same functions\nand exercise the same powers as are required by it to be performed and exercised in respect of\nappropriation accounts of the 7[Federal Government] and the report of the 8[Auditor-General] of\nPakistan thereon.]\n(3) The Government may require the Authority to furnish it with__\n(i)         any return, statement, estimate, statistics or other information regarding any\nmatter under the control of the Authority, or\n(ii)        a report on any such matter, or\n(iii)       a copy of any document in the charge of the Authority, and\nthe Authority shall comply with every such requisition."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Authority Fund",
      "content": "(1) There shall be a fund to be known as the “Authority Fund” vested\nin the Authority which shall be utilised by the Authority to meet charges in connection with its\nfunctions under this Act including the payment of salaries and other remunerations to the Chairman\nand Members of the Authority and to its officers and servants.\n(2) The Authority Fund shall consist of—\n(a)         grants made by the Government;\n1\nSubstituted by West Pakistan Ordinance No. XII of 1960, s. 2.\n2\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. and Sch.\n3\nSubstituted by the West Pakistan Act No. XIII of 1967, s. 2.\n4\nAdded by the West Pakistan Act No. XIII of 1967, s. 2.\n5\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. and Sch.\n6\nInserted by the West Pakistan Act No. XIII of 1967, s. 2.\n7\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. and Sch.\n8\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. and Sch.\n(b)        loans obtained from the Government;\n(c)        grants made by local bodies as required by the Government;\n1\n[(d) sale proceeds of bonds, debentures, commercial papers or other securities issued\nby the Authority;]\n2\n[(dd) all sums, dividends, shares, bonds, debentures, commercial papers, securities or\nany other payments received from a company or companies specified in clause\n(b) of sub-section (5) of section 8;]\n(e)        loans obtained by the Authority with the special or general sanction of the\nGovernment;\n(f)        foreign aid and loans obtained from the International Bank of Reconstruction\nand Development or otherwise, with the sanction 3[and under the gaurantee] of,\nand on such terms and conditions as may be approved by the Government; and\n(g)        all other sums received by the Authority."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Authority to be deemed to be a local authority. 4[(1)] The Authority shall be deemed to",
      "content": "be a local authority under the Local Authorities Loans Act, 1914 (IX of 1914), for the purpose of\nborrowing money under the said Act, and the making and execution of any scheme under this Act shall\nbe deemed to be a work which such authority is legally authorised to carry out.\n5\n[(2) Any sum due to the Authority shall be recoverable as arrears of land revenues.]"
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Limited liability. The liability of the Government to the creditors of the Authority shall be",
      "content": "limited to the extent of grants made by the Government and the loans raised by the Authority with the\nsanction of the Government."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Rates for sale of power. (1) The Authority shall ordinarily sell power in bulk",
      "content": "(2) The rates at which the Authority shall sell power shall be so fixed as to provide for meeting\nthe operating costs, interest charges and depreciation of assets, the redemption at due time of loans\nother than those covered by depreciation, the payment of any taxes and a reasonable return on\ninvestment."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Maintenance of accounts. The Authority shall maintain complete and accurate books of",
      "content": "accounts in such form as may be prescribed by it:\nProvided that separate accounts shall be maintained for all schemes and transactions relating\nto power."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Annual statement of accounts. In the month of 6[January] each year the Authority shall",
      "content": "submit to the Government for approval a statement of the estimated receipts and expenditure in respect\nof the next financial year.\n1\nSubstituted by Act No. XIII of 1994, s. 7.\n2\nIns. by Act No. XIII of 1994, s. 7.\n3\nIns. by Act No. XIII of 1994, s. 7.\n4\nRe-numbered by Act No. XIII of 1994, s. 8.\n5\nAdded by Act No. XIII of 1994, s. 8.\n6\nSubstituted by the West Pakistan Ordinance No. XII of 1960, s. 3."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Audit. The accounts of the Authority shall be audited every year by the 1[Auditor",
      "content": "General]\nof Pakistan in such manner as may be prescribed by the Government. Copies of the audit report shall\nbe sent to the Authority, and, with the comments of the Authority, to the Government and shall also\nbe available for public inspection. The Authority shall carry out any directive issued by the\nGovernment for rectification of an audit objection."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Regulations. For the purpose of carrying into effect the provisions of this Act, the Authority",
      "content": "may, with the approval of the Government, frame such Regulations as it may consider necessary or\nexpedient."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Repeal. The West Pakistan Water and Power Development Authority Ordinance, 1958",
      "content": "(West Pakistan Ordinance No. VIII of 1958), is hereby repealed.\n_______\nRGN Date: 12-05-2025\n1\nSubstituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. and Sch."
    }
  ],
  "definitions": [
    {
      "term": "Authority",
      "definition": "the 7[Pakistan Water and Power Development Authority] established under section 3 of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Water and Power Development Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "controlled station",
      "definition": "a power generating station declared as a controlled station under clause (iv) of sub-section (1) of section 11;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the 8[Federal Government];",
      "source_provision": "sec2"
    },
    {
      "term": "land",
      "definition": "benefits to arise out of land, and things attached to the earth or permanently fastened to anything attached to the earth;",
      "source_provision": "sec2"
    },
    {
      "term": "local body",
      "definition": "any District Board, District Local Board, Municipal Corporation, Municipal Committee, Municipality, Small Town Committee or Notified Area Committee; 1 Substituted by West Pakistan Ordinance No. LXXII of 1979, s. 2. 2 Substituted by West Pakistan Ordinance No. LXXII of 1979, s. 2. 3 Substituted by West Pakistan Ordinance No. LXXII of 1979, s. 2. 4 Substituted by West Pakistan Ordinance No. LXXII of 1979, s. 3. 5 Substituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. 2 and Sch. 6 Substituted by Act No. XIII of 1994, s. 2. 7 Substituted by West Pakistan Ordinance No. LXXII of 1979, s. 4. 8 Substituted by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. 2 and Sch.",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "Member of the Water and Power Development Authority; (viii) “power” includes hydraulic power, electrical energy, steam, gas or any other power notified as such by the 1[Government] in the Official Gazette; and",
      "source_provision": "sec2"
    },
    {
      "term": "Regulations",
      "definition": "Regulations framed under this Act.",
      "source_provision": "sec2"
    }
  ]
}
