{
  "id": "pk-passports-act-1974",
  "type": "statute",
  "title": "Passports Act, 1974",
  "title_en": "Passports Act, 1974",
  "short_name": "Passports Act, 1974",
  "status": "in_force",
  "issued_date": "1974-03-06",
  "in_force_date": "1974-03-06",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2lp-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Passports Act, 1974 (XX of 1974) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This act may be called the Passports\nAct, 1974.\n(2) It extends to the whole of Pakistan and also applies to all citizens of Pakistan, wherever\nthey may be.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or",
      "content": "context,—\n(a) “passport” means a passport 1[including a diplomatic passport and an official\npassport] which is for the time being valid, and includes any such permit, or other\ntravel document authorising the holder thereof to travel from Pakistan to any other\ncountry, issued by or under the authority of the Federal Government; .\n(b) “Prescribed” means prescribed by rules made under this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Prohibition of departure from Pakistan without passport, etc. No citizen of",
      "content": "Pakistan shall—\n(a)         depart from Pakistan by any means whatever unless he is in possession of a\npassport, nor otherwise than from such port or place, by such route and in\naccordance with such conditions, as may be prescribed; or\n(b)         visit a foreign country unless his passport is valid for such country."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Punishment for contravention of sections 3, etc",
      "content": "(1) A citizen of Pakistan who is of\nthe age of twelve years or more shall be punishable with imprisonment for a term which may\nextend to one year, or with fine, or with both, if he—\n(a)         contravenes or attempts to contravene or abets the contravention of any of\nthe provisions of section 3; or\n(b)         enters or attempts to enter Pakistan by any means whatever without being in\npossession of a passport or otherwise than at such port or place, or by such\nroute, as may be prescribed.\n1\nFor Statement of Objects and Reasons, see Gaz. of P., 1974, Ext., Pt. III, p. 181.\n2\nIns. by the Passports (Amdt.) Ordinance, 1978 (21 of 1978), s. 2.\n(3) Notwithstanding anything contained in the Code of Criminal Procedure, 1898 (Act V of\n1898.), an offence punishable under subsection (1) or sub-section (2) shall be non- bailable.\n(2) A person departing from or entering, or attempting to depart from or enter, Pakistan in\nwhose custody or charge a person who has not attained the age of twelve years departs from or\nenters, or attempts to depart from or enter, Pakistan in contravention of section 3 or clause (b) of\nsub-section (1) shall, in addition to any penalty to which he may be otherwise liable, be liable to the\npenalty provided for in that sub-section."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Certain acts to be deemed contravention of section 3",
      "content": "(1) Whoever gives any person\nwho has contravened the provisions of section 3, any assistance with intent thereby to prevent,\nhinder or otherwise interfere with his arrest, trial or punishment for such contravention, shall be\ndeemed to have abetted the offence of contravention of the provisions of that section.\n(2) The owner, master or person in charge of any means of transport who causes or\nknowingly allows any person to depart from Pakistan in contravention of the provisions of section 3\nby such means of transport shall be deemed to have contravened the Provision of that section and\nthe means of transport shall, if the court convicting the owner, master or person in charge so directs,\nbe forfeited to the Federal Government."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Penalties for certain offences relating to passport",
      "content": "(1) A person shall be\npunishable with imprisonment which may-extend to three years, or with fine, or with both, if he—\n(a)        makes or makes use of any statement which he knows or believes to be false\nin any document for obtaining passport; or\n(b)        attests or verifies a statement which he knows or has reason to believe to be\nfalse in any document used for obtaining a passport; or\n(c)        wilfully conceals any fact which under the circumstances he ought to disclose\nfor the purpose of obtaining a passport for himself or another person; or\n(d)        forges, alters or tampers with any passport or any document which he uses for\nobtaining a passport; or\n(e)        uses a passport which has been forged, altered, or tampered with; or\n(f)        uses for obtaining a passport a document which has been forged, altered or\ntampered with; or\n(g)        is in wrongful possession of a passport not lawfully issued to him or allows\nhis passport to be used “by another person; or\n(h)        traffics in passports or any documents required for obtaining a passport; or\n(i)        wilfully fails or neglects to return a passport issued to him, if he is required to\ndo so or if an order cancelling, impounding or confiscating it is made 1[;or]\n1\n[(j)   obtains more than one passport for himself either in the same or different\nnames by concealing the fact of his already being in possession of a\npassport].\n1\nSubs. and added by the Passports (Amdt.) Ordinance, 1978 (21 of 1978), s. 3.\nProvided that a person guilty of an offence punishable under clause (h) shall be punished\nwith rigorous imprisonment for a term which shall not be less than six months and with fine which\nshall not be less than one thousand rupees.\n(2) Notwithstanding anything contained in the Code of Criminal Procedure, 1898 (Act V\nof 1898), an offence punishable under clause (b) of sub-section (1) shall be a bailable offence."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power of arrest, seizure, etc",
      "content": "(1) Any police officer not below the rank of Sub-\nInspector, and any officer of Customs empowered by a general or special order of the Federal\nGovernment in this behalf, may arrest without warrant any person who has contravened, or against\nwhom a reasonable suspicion exists that he has contravened any provision of this Act.\n(2) Any police officer or other person authorised in this behalf by the Federal\nGovernment may seize in any place any means of transport which he knows or has reason to believe\nto be the means of transport by which a person has departed from Pakistan in contravention of the\nprovisions of section 3.\n(3) Any means of transport seized under sub-section (2) shall be disposed of in accordance\nwith the decision of the court before which the owner, master or person in charge thereof is\nprosecuted under sub-section (2) of section 5 for a contravention of section 3.\n(4) Every officer making an arrest under this section shall, within a period of twenty- four\nhours of such arrest exclusive of the time necessary for the journey from the place of arrest to the\ncourt of the nearest Magistrate, take or send the person arrested before a Magistrate having\njurisdiction in the case or before the officer incharge of the nearest police station; and thereupon the\nprovisions of the Code of Criminal Procedure, 1898 (Act V of 1898), applicable in respect of a\nperson who, having been arrested without warrant, has been taken or sent before a Magistrate has\nbeen taken or sent before a Magistrate or an officer incharge of a police station shall apply to him."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Power to cancel, impound or confiscate passport",
      "content": "(1) A passport issued by or on\nbehalf of the Federal Government shall be the property of the Federal Government and may, by an\norder under the hand of a Secretary to the Government of Pakistan, 1[or an officer authorised\nby the Federal Government in this behalf] be required to be returned and shall also be liable to be\ncancelled, impounded or confiscated by a like order.\n(2) Subject to sub-section (3), before making an order under sub-section (1) in respect of\nthe passport issued to any person, the Federal Government shall give such person notice in writing\ncalling upon him to show cause why the order should not made:\n2\n[Provided that no such notice need be given in the case of an order impounding a Passport if\nit is necessary in the opinion of the Secretary or such other officer to take immediate action, but an\nopportunity to show cause against the making of the order shall be afforded to the person to whom\nthe order relates, within two weeks from the making of the order.]\n1\nIns. by the passports (Amdt.) Ordinance, 1978 (21 of 1978), s. 4.\n2\nSubs. by the Passports (Amdt.) Act, 1992 (15 of 1992), s. 2, for the original proviso.\n(3) If the Federal Government has reason to believe that the person in respect of whose\npassport it is proposed to make an order under sub-section (1) is, or has been, engaged in\nsubversive activities or in activities which are prejudicial to the interest of Pakistan or to Pakistan's\nrelations with any foreign power, it shall not be necessary to give to such person the notice\nprovided for in sub-section (2) or to afford him an opportunity of being heard.\n(4) Any person in respect of whose passport an order under sub-section (1) has been made in\nthe circumstances referred to in sub-Section (3) may, within thirty days of the date of the order,\napply to the Federal Government for a review of the order; and the decision of the Federal\nGovernment in review shall be final.\n1\n[(5) Any expenditure incurred by the, Federal Government on the repatriation to Pakistan of\na citizen of Pakistan who gets stranded or becomes a destitute while he is in a foreign country, or for\nany other reason, shall be recoverable as an arrear of land revenue.]."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Burdon of proof. The burden of proving that a statement made in any document used for",
      "content": "obtaining a passport is true shall lie on the person making the statement and the burden of proving\nthat the owner, master or person in charge of any means of transport by which any person departs\nfrom Pakistan in contravention of the provisions of section 3 did not knowingly allow such person\nto so depart shall lie on such owner, master or person in charge."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Indemnity. No suit, prosecution or other legal proceeding shall lie against any person for",
      "content": "anything which is in good faith done or intended to be done in pursuance of this Act or of any rules\nmade thereunder."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Delegation of power. The Federal Government may, by notification in the official",
      "content": "Gazette, direct that any of its powers or functions under this Act shall, in such circumstances and\nsubject to such conditions, if any, as may be specified in the notification, be exercised or performed\nalso—\n(a)        by any officer or authority subordinate to the Federal Government;\n(b)        by any Provincial Government or by any officer or authority subordinate to\nsuch Government."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to exempt. The Federal Government may, by notification in the official Gazette,",
      "content": "exempt any person or class of persons from all or any of the provisions of this Act or the rules\nmade thereunder."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Power to make rules",
      "content": "(1) The Federal Government may, by notification in the official\nGazette, make rules2 for carrying out the purposes of this Act.\n(2) In particular, and without prejudice to the generality of the foregoing power, such rules\nmay provide for all or any of the following matters, namely:—\n1\nAdded by Ord. 21 of 1978, s. 4.\n2\nFor the Passport Rules, 1974, see S.R.O. No. 986 (I)/74, dated the 18th July, 1974, see Gaz. of P., 1974, Ext., (Islamabad) Pt. II, pp. 14091414.\n(a)        the conditions to which a passport issued by or on behalf of the Federal\nGovernment shall be subject, including conditions as to the ports or places in\nPakistan at or from which alone a person holding a passport shall depart from\nor enter Pakistan;\n(b)        the persons, other than the applicants for the issue of passports, by whom, and\nthe manner in which, applications for the issue of passports may be\nsubmitted;\n1\n*            *            *            *             *             *             *\n(3) Rules made under sub-section (1) may provide that a contravention thereof shall be\npunishable with imprisonment for a term which may extend to six months, or with fine, or with\nboth."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Act not to derogate from other laws. The provisions of this Act shall be in addition to,",
      "content": "and not in derogation of, the provisions of the 2[Emigration Ordinance, 1979 (XVIII of 1979)] the\nForeign Exchange Regulation Act, 1947 (VII of 1947), the Pakistan (Control of Entry) Act, 1952\n(LV of 1952), and any other law relating to foreign exchange or entry into Pakistan."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. [Repeal.] Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981",
      "content": "(XXVII of 1981), s. 3 and Sch, 11\n1\nOmitted by the Passports (Amdt.) Ordinance 1983 (34 of 1983). s. 2.\n2\nSubs, by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and Sch. II."
    }
  ],
  "definitions": [
    {
      "term": "passport",
      "definition": "a passport 1[including a diplomatic passport and an official passport] which is for the time being valid, and includes any such permit, or other travel document authorising the holder thereof to travel from Pakistan to any other country, issued by or under the authority of the Federal Government; .",
      "source_provision": "sec2"
    },
    {
      "term": "Prescribed",
      "definition": "prescribed by rules made under this Act.",
      "source_provision": "sec2"
    }
  ]
}
