{
  "id": "pk-patents-ordinance-2000",
  "type": "statute",
  "title": "Patents Ordinance, 2000",
  "title_en": "Patents Ordinance, 2000",
  "short_name": "Patents Ordinance, 2000",
  "status": "in_force",
  "issued_date": "2000-12-01",
  "in_force_date": "2000-12-01",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FobZo%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Patents Ordinance, 2000 (LXI of 2000) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec94",
      "section": "94",
      "title": "Section 94. Evidence of entries, documents, etc",
      "content": "(1) A certificate purporting to be signed by the\nController as to any entry, matter or thing which he is authoritized by this Ordinance or any rule to\nmake or do, shall be prima facie evidence of the entry having been made and of the contents\nthereof and of the matter or thing having been done or omitted to be done.\n(2) A copy of any entry in any Register or of any document kept in the Patent Office or of\nany patent, or an extracts from any such Register or document, purporting to be certified by the\nController and sealed with the seal of the Patent Office shall be admitted in evidence in all courts,\nand in all proceedings, without further proof or production of the original.\n(3) The Controller or any other officer of the Patent Office shall not, in any legal proceedings\nto which he is not a party, be compellable to produce the Register or any other document in his\ncustody, the contents of which can be proved by the production of a certified copy issued under this\nOrdinance or to appear as a witness to prove the matters therein recorded unless by order of the\nCourt made for special causes."
    },
    {
      "provision_ref": "sec95",
      "section": "95",
      "title": "Section 95. Declaration by infants, lunatics, etc",
      "content": "(1) If any person is, by reason of minority,\nlunacy or other disability, incapable of making any statement or doing anything required or permitted\nby or under this Ordinance, the lawful guardian, committee or manager, if any, of the person subject\nto the disability, or if there be none, any person appointed by any Court having jurisdiction in\nrespect of his property, may make such statement or a statement as nearly corresponding thereto as\ncircumstances permit, and do such thing in the name and on behalf of the person subject to the\ndisability.\n(2) An appointment may be made by the Court for the purposes of this section upon the\npetition of any person active on behalf of the person subject to the disability or of any other person\ninterest in the making of the statement or the doing of the thing."
    },
    {
      "provision_ref": "sec96",
      "section": "96",
      "title": "Section 96. Service of notice, etc., by post. Any notice required or authorized to be given by or",
      "content": "under this Ordinance, and any application or other document so authorized or required to be made or\nfiled, may be given, made or filed by post."
    },
    {
      "provision_ref": "sec97",
      "section": "97",
      "title": "Section 97. Security for cost. If any party by whom notice of any opposition is given under this",
      "content": "Ordinance or by whom application is made to the Controller for the grant of a licence under a patent\nneither resides nor carries on business in Pakistan, the Controller may require him to give security\nfor the costs of the proceedings, and in default of such security being given may treat the opposition\nor application abandoned."
    },
    {
      "provision_ref": "sec98",
      "section": "98",
      "title": "Section 98. Transmission of orders of High Court or Court to the Controller",
      "content": "(1) Every order of\nthe High Court on a petition for revocation, including an order granting certificate of validity of any\nclaim, shall be transmitted by the High Court to the Controller who shall cause an entry thereof and\nreference thereto to be made in the Register.\n(2) Where in any suit for infringement of a patent or in any suit under section 60 the validity\nof any claim or a specification is contested and that claim is found by the Court to be valid or not\nvalid, as the case may be, the Court shall transmit a copy of its judgement and decree to the\nController who shall on receipt thereof cause an entry in relation to such proceedings to be made in\nthe prescribed manner in a supplemental record.\n(3) The provisions of sub-sections (1) and (2) shall also apply to the Court to which appeals\nare referred against decisions of the Court referred to in those sub-sections."
    },
    {
      "provision_ref": "sec99",
      "section": "99",
      "title": "Section 99. Transmission of copies of specifications, etc. and inspection thereof. Copies of all",
      "content": "such specifications drawings and amendments left at the Patent Office as become open to public\ninspection under the provisions of the Ordinance shall be transmitted, as soon as may be, after the\nprinted copies thereof are available, to such authorities as the Federal Government may appoint in\nthis behalf, and shall be open to the inspection of any person at all reasonable times at places to be\nspecified by those authorities with the approval of the Federal Government."
    },
    {
      "provision_ref": "sec100",
      "section": "100",
      "title": "Section 100. Information relating to patents. Any person making a request to the Controller in the",
      "content": "prescribed manner for information relating to any such matter, as may be prescribed, as respects any\npatent specified in the request or as respects any application for a patent so specified shall be entitled,\nsubject to the payment of the prescribed fee, to have information supplied to him accordingly."
    },
    {
      "provision_ref": "sec101",
      "section": "101",
      "title": "Section 101. Loss or destruction of patents. If a patent is lost or destroyed, or its non",
      "content": "production is\naccounted for to the satisfaction of the Controller, the Controller may at any time, on application\nmade in the prescribed manner and on payment of the prescribed fee, cause a duplicate thereof to be\nsealed and delivered to the applicant.\n1\n[*         *         *          *         *          *          *]"
    },
    {
      "provision_ref": "sec103",
      "section": "103",
      "title": "Section 103. Right of the Government to sell or use forfeited articles. Nothing in this Ordinance",
      "content": "shall affect the power of the Government or of any person deriving title directly or indirectly from\nthe Government to sell or use any articles forfeited under any law for the time being in force."
    },
    {
      "provision_ref": "sec104",
      "section": "104",
      "title": "Section 104. Power of High Court to make rules. The High Court may make rules consistent with",
      "content": "this Ordinance as to the conduct and procedure in respect of all proceedings before it under this\nOrdinance."
    },
    {
      "provision_ref": "sec105",
      "section": "105",
      "title": "Section 105. Power of the Federal Government to make rules",
      "content": "(1) The Federal Government\nmay, by notification in the official Gazette, make rules for carrying out the purposes of this\nOrdinance.\n_________________________________________________________________________________\n1\nSection 102 Omitted by the Patent (Amdt.) Ordinance, 2002 (95 of 2002), s.21.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules\nmay provide for all or any of the following matters, namely:—\n(i)        the form and manner in which any application for a patent, any specifications\nor drawings, and any other application or document may be filed in the Patent\nOffice;\n(ii)       the time within which any act or thing may be done under this Ordinance,\nincluding the manner in which and the time within which any matter may be\nadvertised under this Ordinance;\n(iii)      the fees which may be payable under this Ordinance and the manner of\npayment of such fees;\n(iv)       the matters in respect of which an examiner may make a report to the\nController;\n(v)        the form of request for sealing of patent;\n(vi)       the form and manner in which and the time within which any notice may be\ngiven under this Ordinance;\n(vii)      the provisions which may be inserted in an order for restoration of a patent for\nthe protection of the person who may have availed themselves of the\nsubject-matter of the patent after the patent had ceased;\n(viii)     the maintenance of the Register and the matters to be entered therein;\n(ix)       the time when and the manner in which the Register and any other document\nopen to inspection may be inspected under this Ordinance;\n(x)        the qualifications of and the preparation of a role of scientific advisers for the\npurpose of section 68;\n(xi)       the manner in which any compensation for acquisition by the Government of\nan invention may be paid;\n(xii)      the manner in which the register of patent agents may be maintained, and\nmatters connected with the practice and conduct of the patent agents; 1*\n(xiii)     the regulation of the making, printing, publishing and selling of indexes to,\nand abridgements of, specifications and other documents in the Patent Office,\nand inspection of indexes and abridgements and other documents 2[;].\n3\n[(xiv) the manner to establish the regime for exhaustion of intellectual property\nrights;\n_____________________________________________________________________________\n1\nThe word “and” omitted by the Patents (Amdt.) Ordinance, 2002 (95 of 2002) s. 22.\n2\nSubs. ibid., for the full stop.\n3\nNew clauses (xiv), (xv), (xvi), (xvii) and (xviii) added ibid.\n(xv)       the details in respect of inventions referred to in sub-section (4) of section 7;\n(xvi)      the manner in which an invention shall be disclosed including the best mode\nknown for the execution of the invention, the forms and limits of allowable\nclaims and, in the case of inventions relating to microorganisms, the\nrequirement and the manner of submission of a culture for experimental\npurposes in relation to the scope of the claim and the procedure for grant of\nsuch patents;\n(xvii) the procedure and the criteria for determining the remuneration for a\ncompulsory licence and the terms and conditions for licensing agreements\nincluding, in particular, those which do not adversely affect competition or\ncause impediment to the research and development in the country or to bind\nthe licensee to transfer the improvements made by him to the licensor or to\nforce the licensee to acquire technologies or inputs not needed or desired by\nhim; and\n(xviii) the form of filing application and manner of grant of exclusive marketing\nrights].\n(3) The power to make rules under this section shall be subject to the condition of the rules\nbeing made after previous publication."
    },
    {
      "provision_ref": "sec106",
      "section": "106",
      "title": "Section 106. Repeal and savings._(1) The Patents and Designs Act, 1911 (Act II of 1911) is hereby",
      "content": "repealed.\n(2) Notwithstanding the repeal of the Patents and Designs Act, 1911 (Act II of 1911) the\nrenewal fee in respect of a patent granted under that Act shall be as fixed thereunder.\n(3) Save as otherwise provided in sub-section (2), the provisions of this Ordinance shall apply\nto any application for a patent pending on the commencement of this Ordinance and to any\nproceedings consequent thereon, and to any patent granted in pursuance thereof.\n(4) Notwithstanding anything contained in this Ordinance, any suit for infringement of a\npatent, or any proceedings for revocation of a patent, pending in any Court on the commencement of\nthis Ordinance, may be continued and disposed of under the Patents and Designs Act, 1911 (Act II\nof 1911)as if this Ordinance had not come into force, 1* * *.\n2\n[107. Acts done in good faith. No suit, prosecution, or any other legal proceedings shall lie\nagainst any government employee or any person exercising any powers or performing any functions\nunder this Ordinance or the rules made thereunder for any act or thing which has been done in good\nfaith."
    },
    {
      "provision_ref": "sec108",
      "section": "108",
      "title": "Section 108. Removal of difficulties. If any difficulty arises in giving effect to any of the provisions",
      "content": "of this Ordinance, the Federal Government may, by notification in the official Gazette, make such\nprovisions as it deems fit for removing that difficulty].\n_________________________________________________________________________________\n1\n2\nNew sections 107 and 108 added ibid., s.24"
    }
  ],
  "definitions": []
}
