{
  "id": "pk-pensions-act-1871",
  "type": "statute",
  "title": "Pensions Act, 1871",
  "title_en": "Pensions Act, 1871",
  "short_name": "Pensions Act, 1871",
  "status": "in_force",
  "issued_date": "1871-08-07",
  "in_force_date": "1871-08-07",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-a5k%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Pensions Act, 1871 (XXIII of 1871) published by The Pakistan Code (Service Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title. This Act may be called the Pensions Act, 1871",
      "content": "Extent of Act. 2[It extends to the whole of Pakistan];\n3*       *         *       *        *        *        *\n4*       *         *       *        *        *        *"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Interpretation section. In this Act, the expression \"grant of money or land revenue\"",
      "content": "includes anything payable on the part of Government in respect of any right, privilege, perquisite or\noffice.\n5\n[3A. Definition. The expression \"the appropriate Government’’ means, in relation to\n6\n[Federal] pensions, the 7[Federal Government] and in relation to other pensions, the Provincial\nGovernment].\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1871, Pt. V, p. 141; for Proceedings in Council, see ibid., 1871, Supplement, pp. 314, 401,\n683, 1056, and 1147.\nThis Act has been declared in force in Baluchistan by the British Baluchistan Laws Regulation, 1913 (2 of 1913), s.3.\nIt has been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.W.F.P., subject to certain\nmodifications; and extended to the Excluded Area of Upper Tanawal (N.W.F.P.) other than Phulera with effect from such date and subject to          such\nmodifications as may be notified; see N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950.\nIt has been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950); and applied in the Federated\nAreas of Baluchistan, see Gazette of India, 1937, Pt. I, p. 1499.\nThis Act has been extended to the Baluchistan States Union, see the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G.G.O. 4 of\n1953), as amended by the Baluchistan States Union (Federal Laws) (Extension) (Second Amendment) Order, 1953 (G.G.O. 19                 of 1953).\nIt has also been extended to the Khairpur State, see G.G.O. 5 of 1953, as amended by G.G.O. 24 of 1953.\nThis Act has been extended to the State of Bahawalpur, see the Bahawalpur (Extension of Federal Laws) Order, 1953 (G.G.O. 11 of 1953).\nThis Act and all rules, notifications, declarations, resolutions and orders made under it, have been extended to the State of Bahawalpur, See the\nBahawalpur (Extension of Federal Laws) Order, 1953 (G.G.O.11 of 1953).\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), section 3 and 2nd Sch., for \"It extends to [all the Provinces and the capital\nof the Federation]\". The words in crotchets were subs., for \"the whole of British India\" by A.O., 1949, Arts. 3(2) and 4.\n3\nThe words \"And it shall come into force on the date of the passing thereof\" rep. by the Repealing and Amending Act, 1914 (10 of 1914).\n4\nThe words \"but not so as to affect any suit in respect of a pension or grant of money or land-revenue which may have been instituted before such date\"\nrep. by the Amending Act. 1891 (12 of 1891).\n5\nSection 3A ins. by A.O., 1937.,\n6\nSubs. by F.A.O., 1975 Art. 2 and Table, for \"Central\" which was subs. by A. 0., 1964, Art. 2 and Sch., for \"federal\".\n7\nSubs. by F.A.O., 1975, Art 2 and Table, for \"Central Government\".\nII.—RIGHTS TO PENSIONS"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Bar of suits relating to pensions. Except as hereinafter provided, no Civil Court shall",
      "content": "entertain any suit relating to any pension or grant of money or land-revenue conferred or made by the\n1\n[Federal Government] or any Provincial Government or any former Government, whatever may\nhave been the consideration for any such pension or grant, and whatever may have been the nature of\nthe payment, claim or right for which such pension or grant may have been substituted."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Claims to be made to collector or other authorized officer. Any person having a claim",
      "content": "relating to any such pension or grant may prefer such claim to the Collector of the District or Deputy\nCommissioner or other officer authorized in this behalf by the 2[appropriate Government]; and such\nCollector, Deputy Commissioner or other officer shall dispose of such claim in accordance with such\nrules as the Chief Revenue-authority may, subject to the general control of the 2[appropriate\nGovernment], from time to time prescribe in this behalf."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Civil Court empowered to take cognizance of such claims. A Civil Court, otherwise",
      "content": "competent to try the same, shall take cognizance of any such claim upon receiving a certificate from\nsuch Collector, Deputy Commissioner or other officer authorized in that behalf that the case may be\nso tried, but shall not make any order or decree in any suit whatever by which the liability of\nGovernment to pay any such pension or grant as aforesaid is affected directly or indirectly."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Pensions for lands held under grants in perpetuity. Nothing in sections 4 and 6 applies",
      "content": "to—\n3\n*        *          *          *          *           *          *\n4\npensions heretofore granted by Government in 5[the territories subject to the Lieutenant\nGovernor of Bengal], either wholly or in part as an indemnity for loss sustained by the resumption by\na Native Government of lands held under sanads purporting to confer a right in perpetuity. Such\npensions shall not be liable to resumption on the death of the recipient, but every such pension shall\nbe capable of alienation and descent, and may be sued for and recovered in the same manner as any\nother property.\nIII.—MODE OF PAYMENT"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Payment to be made by Collector or other authorized officer. All pensions or grants by",
      "content": "Government of money or land-revenue shall be paid by the Collector or the Deputy Commissioner or\nother authorized officer, subject to such rules as may, from time to time, be prescribed by the Chief\nControlling Revenue-authority."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Saving of rights of grantees of land",
      "content": "revenue. Nothing in sections 4 and 8 shall affect the\nright of a grantee of land-revenue, whose claim to such grant is admitted by Government, to recover\nsuch revenue from the persons liable to pay the same under any law for the time being in force for\nthe recovery of the rent of land.\n1\nSubs. ibid., for\" Central Government\" which had been subs. by the Federal Laws (Revision and Declaration) Act,1951 (26 of 1951), s. 4 and III Sch.,\nfor \"British\".\n2\nSubs. by A. O., 1937, for\" L. G\".\n3\nClause (1) omitted by A. 0., 1949, Sch.\n4\nThe number and brackets \"(2)\" omitted, ibid.\n5\nSubs. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 4 and III Sch., for “The territories respectively subject to the\nLieutenant -Governor of the Noth-Western Province.”"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Commutation of pension. The 1[appropriate Government] may, with the consent of the",
      "content": "holder, order the whole or any part of his pension or grant of money or land-revenue to be commuted\nfor a lump sum on such terms as may seem fit.\nIV.—MISCELLANEOUS\n2"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Exemption of pension from attachment. No pension granted or continued by",
      "content": "Government on political considerations, or on account of past services or present infirmities or as a\ncompassionate allowance, and no money due or to become due on account of any such pension or\nallowance, shall be liable to seizure, attachment or sequestration by process of any Court in\n3\n[Pakistan], at the instance of a creditor, for any demand against the pensioner, or in satisfaction of a\ndecree or order of any such Court.\n4\n[This section applies in 5[Pakistan] also to pensions granted or continued, 6after the\nseparation of Burma from India, by the Government of Burma.]"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Assignments etc., in anticipation of pension, to be void. All assignments, agreements,",
      "content": "orders, sales and securities of every kind made by the person entitled to any pension, pay or\nallowance mentioned in section 11, in respect of any money not payable at or before the making\nthereof, on account of any such pension, pay or allowance, or for giving or assigning any future\ninterest therein, are null and void."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Reward to informers. Whoever proves to the satisfaction of the 1[appropriate",
      "content": "Government] that any pension is fraudulently or unduly received by the person enjoying the benefit\nthereof shall be entitled to a reward equivalent to the amount of such pension for the period of six\nmonths."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Power to make rules. 4[In each Province] the Chief Controlling Revenue authority may,",
      "content": "with the consent of the 1[appropriate Government], from time to time make rules consistent with this\nAct respecting all or any of the following matters:—\n(l)         the place and times at which, and the person to whom, any pension shall be\npaid;\n(2)         injuries into the identity of claimants;\n(3)         records to be kept on the subject of pensions;\n(4)         transmission of such records;\n(5)         correction of such records;\n(6)         delivery of certificates to pensioners;\n(7)         registers of such certificates;\n1\nSubs. by A. 0., 1937, for “L. G.”.\n2\nSee also s. 60, clause (g) of the Code of Civil Procedure, 1908 (Act 5 of 1908).\n3\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), section 3 and 2nd Sch, (with effect from the 14th October, 1955), for\" the\nProvinces and the Capital of the Federation\" which was subs., for \"British India\" by A. O., 1949. Arts, 3(2) and 4.\n4\nIns. by A. 0., 1937.\n5\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for\" the\nProvinces and the Capital of the Federation\" which was subs., for \"British India\" by A. 0., 1949, Arts. 3(2) and 4. 3I.e., on or after the 1st April, 1937.\n(8)         reference to the Civil Court, under section 6, of persons claiming a right of\nsuccession to, or participation in, pensions or grants of money or land-revenue\npayable by Government;\nand generally for the guidance of officers under this Act.\nAll such rules shall be published in the 1[official Gazette], and shall thereupon have the force\nof law.\nSCHEDULE.—[Rep. by the Repealing Act, 1938 (I of 1938).]\n___________\nDate: 16-09-2024\n1\nSubs. by A. O., 1937, for\" local official Gazette\"."
    }
  ],
  "definitions": []
}
