{
  "id": "pk-poisons-act-1919",
  "type": "statute",
  "title": "Poisons Act, 1919",
  "title_en": "Poisons Act, 1919",
  "short_name": "Poisons Act, 1919",
  "status": "in_force",
  "issued_date": "1919-09-02",
  "in_force_date": "1919-09-02",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apmY-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Poisons Act, 1919 (XII of 1919) published by The Pakistan Code (Criminal Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent",
      "content": "_(1) This Act may be called the Poisons Act, 1919.\n5\n[(2) It extends to the whole of Pakistan.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Power of the Provincial Government to regulate possession for sale and sale of any",
      "content": "poison.___ (1) 6* * *, the 7[Provincial Government] may by rule regulate within the whole or any part\nof the territories under its administration the possession for sale and the sale, whether wholesale or\nretail, of any specified poison.\n(2) In particular, and without prejudice to the generality of the foregoing power, such rules may\nprovide for–\n(a)        the grant of licences to possess any specified poison for sale, wholesale or retail,\nand the fixing of the fee (if any) to be charged for such licences ;\n(b)        the classes of persons to whom alone such licences may be granted ;\n(c)        the classes of persons to whom alone any such poison may be sold ;\n(d)        the maximum quantity of any such poison which may be sold to any one person;\n(e)        the maintenance by vendors of any such poison of registers of sales, the\nparticulars to be entered in such registers, and the inspection of the same ;\n(f)        the safe custody of such poisons and the labelling of the vessels, packages or\ncoverings in which any such poison is sold or possessed for sale ; and\n(g)        the inspection and examination of any such poison when possessed for sale by\nany such vendor.\n2\nFor Statement of Objects and Reasons, see Gazette of India, 1919, Pt. V, p. 22 ; and for Proceedings in Council, s., 1919, Pt. VI, pp. 170 and 872.\nThis Act has been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.-W.F.P., subject to certain\nmodifications ; and extended to the Excluded Area of Upper Tanawal (N.- W.F.P.) other than Phulera with effect from such date and subject to such\nmodifications as may be notified, see N.- W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950.\nIt has also been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950) ; and applied in the Federated\nAreas of Baluchistan, see Gazette of India, 1937, Pt. 1, p. 1499.\n3\nThe words \"throughout British India\" omitted by A. O., 1949 Sch.\n4\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for the original\nsub-section (2) as amended by A. O., 1949, and the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 8.)\n5\nThe words \"Subject to the control of the G. G. in C.\" rep. by A. O., 1937.\n6\nSubs. ibid., for \"L. G.\"."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Power to prohibit importation into Pakistan of any poison except under licence. The",
      "content": "1\n[Federal Government] may, by notification in the 2[official Gazette], prohibit, except under and in\naccordance with the conditions of a licence, the importation into 3[Pakistan] 4[across any customs\nfrontier defined by the 5[Federal Government]] of any specified poison, and may by rule regulate the\ngrant of licences."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to regulate possession of any poison in certain areas",
      "content": "_(1) The 6[Provincial\nGovernment] 7* * * may by rule regulate the possession of any specified poison in any local area in\nwhich the use of such poison for the purpose of committing murder or mischief by poisoning cattle\nappears to it to be of such frequent occurrence as to render restrictions on the possession thereof\ndesirable.\n(2) In making any rule under sub-section (1), the 6[Provincial Government] may direct that any\nbreach thereof shall be punishable with imprisonment for a term which may extend to one year, or with\nfine which may extend to one thousand rupees, or with both, together with confiscation of the poison\nin respect of which the breach has been committed, and of the vessels, packages or coverings in which\nthe same is found."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Presumption as to specified poisons. Any substance specified as a poison in a rule made",
      "content": "or notification issued under this Act shall be deemed to be a poison for the purposes of this Act."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Penalty for unlawful importation, etc.___(1) Whoever",
      "content": "(a)         commits a breach of any rule made under section 2, or\n(b)         imports 8* * * without a licence 9[into 3[Pakistan] across a customs frontier\ndefined by the 10[Federal Government]] any poison the importation of which is\nfor the time being restricted under section 3, or\n(c)         breaks any condition of a licence for the importation of any poison granted to\nhim under section 3, shall be punishable,___\n(i)        on a first conviction, with imprisonment for a term which may extend to\nthree months, or with fine which may extend to five hundred rupees, or\nwith both, and\n(ii)       on a second or subsequent conviction, with imprisonment for a term\nwhich may extend to six months, or with fine which may extend to one\nthousand rupees, or with both.\n1\nSubs. by F.A.O., 1975, Art. 2 and Table, for \"Central Government\", which was previously amended by A. O., 1937, for \"G. G. in C.\".\n2\nSubs. by A.O. 1937 for \"Gazette of India\".\n3\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 74th October, 1955), for \" the Provinces\nand the Capital of the Federation\" which had been subs. by A. O., 1949, Arts. 3 (2) and 4, for \"British India\".\n4\nIns. by A. O., 1937.\n5\nSubs. by F.A.O., 1975 Art. 2 and Table, for \"Central Government\".\n6\nSubs. by A. O., 1937 for \"L. G.\".)\n7\nThe words “subject to the control of the G.G. in C.\" were rep. by A. O., 1937. The word s\"subject to the control\" had been substituted for the words\n“with the previous sanction\" by the Devolution Act, 1920 (38 of 1920), s. 2 and Sch. I.\n8\nThe words \"into British India\" rep. by. A. O., 1937.\n9\nIns., ibid.\n10\nSubs. by F. A. O., 1975, Art. 2 and Table, for “Central Government”.\n(2) Any poison in respect of which an offence has been committed under this section, together\nwith the vessels, packages or coverings in which the same is found, shall be liable to confiscation."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power to issue search warrants.___(1) The District Magistrate, 1[and] the Sub",
      "content": "divisional\nMagistrate 2* * *, may issue a warrant for the search of any place in which he has reason to believe or\nto suspect that any poison is possessed or sold in contravention of this Act or any rule thereunder, or\nthat any poison liable to confiscation under this Act is kept or concealed.\n(2) The person to whom the warrant is directed may enter and search the place in accordance\ntherewith, and the provisions of the Code of Criminal Procedure, 1898 (V of 1898), relating to search\nof warrants shall as far as may be, be deemed to apply to the execution of the warrant."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Rules",
      "content": "(1) In addition to any other power to make rules hereinbefore conferred 3* * * the\n4\n[Provincial Government] may make rules generally to carry out the purposes and objects of this Act\n5\n[except section 3].\n(2) Every power to make rules conferred by this Act shall be subject to the condition of the\nrules being made after previous publication.\n(3) All rules made by the 6[Federal Government] or by the 7[Provincial Government] under this\nAct shall be published in the 8[official Gazette] and on such publication shall have effect as if enacted\nin this Act."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Savings",
      "content": "_(1) Nothing in this Act or in any licence granted or rule made thereunder shall\nextend to, or interfere with, anything done in good faith in the exercise of his profession as such by a\nmedical or veterinary practitioner.\n(2) Notwithstanding anything hereinbefore contained, the 7[Provincial Government] may 9* *\n* by general or special order declare that all or any of the provisions of this Act 10[except section 3]\nshall be deemed not to apply to any article or class of articles of commerce specified in such order, or\nto any poison or class of poisons used for any purpose so specified.\n(3) The authority on which any power to make rules under this Act is conferred may, by general\nor special order, either wholly or partially-\n(a)         exempt from the operation of any such rules, or\n(b)         exclude from the scope of the exemption provided by sub-section (1),\nany person or class of persons either generally or in respect of any poisons specified in\nthe order."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. [Repeal of Act I of 1904.] Rep. by the Repealing Act. 1927 (XII of 1927)",
      "content": "Date: 11-09-2024\n1\nIns. by A. O., 1949, Sch\n2\nThe words and commas \"and, in a Presidency-town, the Commissioner of Police\" omitted ibid.\n3\nThe words \"and subject to the control of the G. G. in C.\" were rep. by A. O., 1937. The word \"and\" had been subs., for the words \"the G. G.. in C. or\"\nby the Devolution Act, 1920 (38 of 1920), s. 2 and Sch. I.\n4\nSubs. by A.O 1937 for “L.G”\n5\nIns. A. O., 1937.\n6\nSubs. ibid., for \"L. G.\"\n7\nSubs. by para. 4 of A. O., 1937, for \"Gazette of India or the local official Gazette, as the case may be\". Strictly the substitution would read \"official\nGazette or the official Gazette, as the case may be\" but the last nine words have been omitted as being obviously redundant\n8\nThe words \"in its discretion\" rep. by A. O., 1937\n9\nIns. ibid."
    }
  ],
  "definitions": []
}
