{
  "id": "pk-police-incitement-to-disaffection-act-1922",
  "type": "statute",
  "title": "Police (Incitement to Disaffection) Act, 1922",
  "title_en": "Police (Incitement to Disaffection) Act, 1922",
  "short_name": "PTDA",
  "status": "in_force",
  "issued_date": "1922-10-04",
  "in_force_date": "1922-10-04",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apyX-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Police (Incitement to Disaffection) Act, 1922 (XXII of 1922) published by The Pakistan Code (Police Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Act may be called the Police (Incitement\nto Disaffection) Act, 1922.\n1\n[(2) It extends to the whole of Pakistan.]\n(3) It shall come into force in any Province or part of a Province on such date4 as the\n2\n[Provincial Government] may, by notification in the 2[official Gazette], direct."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definition. In this Act the expression “member of a police",
      "content": "force” means any person\n*\nappointed or enrolled for the performance of police duties under any enactment specified in the\nSchedule."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Penalty for causing disaffection, etc. Whoever intentionally causes or attempts to cause,",
      "content": "or does any act which he knows is likely to cause, disaffection ; towards 3[Pakistan] or the Government\nestablished by law in 1[Pakistan] 4[* * *] amongst the members of a police-force, or induces or attempts\nto induce, or does any act which he knows is likely to induce, any member of a police-force to withhold\nhis services or to commit a breach of discipline shall be punished with imprisonment which may extend\nto six months, or with fine which may extend to two hundred rupees, or with both.\nExplanation.___ Expressions of disapprobation of the measures of the Government with a view\nto obtain their alteration by lawful means, or of disapprobation of the administrative or other action of\nthe Government, do not constitute an offence under this section unless they cause or are made for the\npurpose of causing or are likely to cause disaffection."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Saving of acts done by police associations and other persons for certain purposes",
      "content": "Nothing shall be deemed to be an offence under this Act which is done in good faith___\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch.\n2\nSubs. by A. O., 1937.\n3\nSubs. by the Central Laws (Adaptation) Order, 1961 (P. O. No. 1 of 1961), Art. 2 and Sch.\n4\nOmitted by the Adaption of Central Acts and Ordinances Order, 1949 (Order No. 4 of 1949), Art. 3 and Sch.\n*\nSubs. by the Federal Laws (Revision & Declaration) Ordinance, 1981 (XXVII of 1981), s. 5 (only to the extent of Islamabad Capital Territory) to read as\n“2. Definition In this Act, the expression “member of a police-force” means any person appointed or enrolled for the performance of police duties\nunder the Police Act, 1861 (V of 1861), or the Police Act, 1888 (III of 1888).”\n(a)       for the purpose of promoting the welfare or interest of any member of a police-\nforce by inducing him to withhold his services in any manner, authorised, by\nlaw; or\n(b)        by or on behalf of any association formed for the purpose of furthering the\ninterests of members of a police-force as such, where the association has been\nauthorised or recognised by the Government and the act done is done under any\nrules or articles of the association which have been approved by the\nGovernment."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Sanction to trial of offences by subordinate Courts. No Court shall proceed to the trial of",
      "content": "any offence under this Act except with the previous sanction, or on the complaint, of the District\nMagistrate 1[* * *]."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Trial of cases",
      "content": "_ (1) No Court inferior to that of a 1[* * *] Magistrate of the first class shall\ntry and offence under this Act.\n(2) Notwithstanding anything contained in Chapter XXII of the Code of Criminal Procedure,\n1898 (V of 1898), no offence under this Act shall be triable summarily.\n2THE SHEDULE\n(See section 2)\nYear              No.                                      Short title\nActs of the Governor General in Council.\n1\n[* *            *            *            *              *              *               *               *]\n1861               V            The Police Act, 1861.\n1\n[* *            *            *            *              *              *               *               *]\n1888              III           The Police Act, 1888.\n1892               V            The Bengal Military Police Act, 1892.\nMadras Act.\n1\n[* *            *            *            *              *              *               *               *]\n1890              IV                      Bombay Act.\n1\n[* *            *            *            *              *              *               *               *]\nBengal Acts.\n1\nOmitted by the Adaptation of Central Acts & Ordinances Order, 1949 (Order No. 4 of 1949), Art. 3 and Sch.\n2\nThis schedule stood omitted to the extent of ICT by the Federal Laws (Revision & Declaration) Ordinance, 1981 (XXVII of 1981), s. 5 and 4th Sch.\n1\n[* *         *                  *            *              *              *               *              *]\n1\n[* *         *                  *            *              *              *               *              *]\n1\n[* *         *                  *            *              *              *               *              *]\n1920             II                 The Eastern Frontier Rifles (Bengal Battalion) Act, 1920.\nBurma Act.\n1\n[* *         *                  *            *               *              *               *             *]\nAssam Act.\n1\n[* *         *                  *            *               *              *               *             *]\nRegulation by the Governor General in Council.\n1\n[* *         *                  *            *               *              *               *             *]\n__________\n4912                                                                                                                   Dated: 25-02-2025\n1\nOmitted by the Adaptation of Central Acts and Ordinances Order, 1949 (Order No. 4 of 1949), Art. 3 and Sch."
    }
  ],
  "definitions": []
}
