{
  "id": "pk-police-act-1861",
  "type": "statute",
  "title": "Police Act 1861",
  "title_en": "Police Act 1861",
  "short_name": "Police Act 1861",
  "status": "in_force",
  "issued_date": "1861-03-21",
  "in_force_date": "1861-03-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NpbZo%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Police Act 1861 (V OF 1861) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Constitution of the force. The entire police‑establishment under a 7[Provincial Government]",
      "content": "8[in a general Police district] shall, for the purposes of this Act, be deemed to be one 9police‑force,\nand shall be formally enrolled; and shall consist of such number of officers and men, and shall be\nconstituted\n1 Under s.2 fo the Police Act, 1888 (3 of 1888), the Central Government may, notwithstanding this provision, create a special police­district, consisting of parts of two or more Provinces.\nThe N.­W.F.P. has been declared to be general police­district for the purposes of this Act, see the N.­W.F.P. Law and Justice Regulation, 1901 (7 of 1901),s.13.\n2 The word “presidency” omitted byA.O., 1949,Sch.\n3 Subs. by C.E.O. 12 of 2001, Art. 2.\n4 The clauses relating to “number” and “gender” rep. by the Repealing and amending Act, 1914 (10 of 1914),s.3 and Sch II.\n5 Cf. definition of “cattle” in s.3 of the Cattle­trespass Act, 1871 (1 of 1871).\n6 Ins. By A.O., 1937.\n7 Subs. By A.O., 1937, for “L.G.”.\n8 Subs. & ins. by C.E.O. 7 of 2001, Act. 2 (w.e.f. 14­8­2001).\n9 See note appended to s.8, infra, as to enrolment of the police­force in certain places.\nin such manner, 1*                                      *                * as shall from time to time be ordered by the 2[Provincial\nGovernment] 3*      *                                     *.\n4[Subject to the provisions of this Act the pay and all other conditions of service5 of members of\nthe subordinate ranks of any police force shall be such as may be determined by the Provincial\nGovernment:]\n6[Provided that in a general police district notified as City District, the                                                                   police force shall be\norganized on functional basis:\nProvided further that no recruitment or induction in the police force shall be made except in the\n[ranks of constable and Assistant Sub­Inspector of Police.]\n3.Superintendance in the Provincial Government. The superintendence of the police\nthroughout a general police‑district shall vest in and 7* * * shall be exercised by the 2[Provincial\nGovernment] to which such district is subordinate; and, except as authorized under the provisions of\nthis Act, no person, officer or Court shall be empowered by the 2[Provincial Government] to\n8*supersede or control any police functionary."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Inspector­General of Police etc. The administration of the police throughout a general",
      "content": "police‑district shall be vested in an officer to be styled the Inspector­General of Police, and in such\nDeputy Inspectors‑General and Assistant Inspectors‑General as to the 2[Provincial Government] shall\nseem fit.\nThe administration of the police 6[in a district shall vest] in a District Superintendent and such\nAssistant District Superintendents as the 2[Provincial Government] shall consider necessary.\n9*                                    *                                  *                                    *                                   *\n*                               *\n10[5.Relationship of District Superintendent of Police with Zila Nazim, etc.__ (1) Subject to\nfunction under this Act, but shall not include administration of the district police, investigation of\ncriminal cases, and police functions relating to prosecution, which shall rest with the police:\nProvided that Zila Nazim may visit a police station to find out if any person is under unlawful\ndetention and in appropriate cases may also direct action in accordance with law having regard to the\nfacts and circumstances of the case.\n(2) In case of a difference of opinion between the Zila Nazim and the Provincial Government on\nany matter concerning the district police, the decision of the provincial Government shall prevail.]\n1 The words “and the members of such force shall receive such pay” rep. by A.O., 1937.\n2 Subs. Ibid., for “L.G.”.\n3 The words “subject in the case of officers of the Indian Police of and above theh rank of Assistant Superintendent to the Control of the G.G. of India in C.” rep. ibid.\n4 Ins.ibid.\n5 For the Baluchistan Promotion and Appointmenet Rules, 1952,see Gazette of Paksitan, 1952,Pt.VI,pp.185­187.\n6 Ins. added & subs. by C.E.O.7., of 01, Arts..3­5 (w.e.f. 14­8­01).\n7 The words “subject in the case of officers of the Indian Police of and above the rank of Assistant Superintendant to the general control of the G.G. of India in C.” rep. , by A.O., 1937.\n8 The word “appoint” rep., ibid.\n9 The sentence “the Inspector­General and other officers above mentioned shall from time to time be appointed by the L.G. and may be removed by the same authority” was rep., ibid.\n10 Subs. & ins by C.E.O. 12 of 01, Act 3­5."
    },
    {
      "provision_ref": "sec5a",
      "section": "5A",
      "title": "Section 5A. Police support to Government Functionaries, etc.­ (1) Any functionary of the Federal",
      "content": "Government, Provincial Government, any statutory body or any body or corporation owned, set up or\ncontrolled by any such Government or in which such Government has a controlling share or interest,\nDistrict Government, Tehsil or Town Municipal Administration or\nUnion Administration, may, for the discharge of his official duties which in his opinion require\npolice assistance, ask for police support from the concerned police authority of the area and such\nauthority shall provide the requisite support:\nProvided that, if for any reason, the police authority is unable to provide the police support\nrequested under this sub­section, it shall forthwith bring the matter through its channel of command to\nthe notice of the District Police Officer who shall make arrangement for provision of police support\nand, where he is unable to provide such support, he shall inform the Zila Nazim accordingly:\nProvided further that before making a report to the higher officers, each officer in the chain of\ncommand shall make an effort to provide the requisite police support:\nProvided also that where any police officer is of the opinion that the request for police support is\nunnecessary, unlawful or malafide, he shall, through his channel of command, report to the District\nPolice Officer who may seek recourse to the District Public Safety Commission and in that case the\ndecision of the District Public Safety Commission shall prevail.\n(2) Where the Zila Nazim so directs, the District Coordination Officer shall be responsible for\ncoordination of police support by the District Police Officer to the District Government, Tehsil\nMunicipal Administration and Union Administration in exigencies threatening law and order, natural\ncalamities and emergencies.\"."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. [Magisterial powers of police‑officers.] Rep. by the Code of Criminal Procedure, 1882 (Act X",
      "content": "of 1882).\n7.Appointment, dismissal, etc. 1[Subject to such rules as the Provincial Government may from\ntime to time make under this Act the Inspector‑General, Deputy Inspectors‑General, Assistant\nInspectors‑General and District Superintendents of Police may at any time dismiss, suspend or reduce\nany police‑officer of the subordinate ranks] whom they shall think remiss or negligent in the discharge\nof his duty, or unfit for the same ;\n2[or may award any one or more of the following punishments to any police‑officer 3[of the\nsubordinate ranks] who shall discharge his duty in a careless or negligent manner, or who by any act\nof his own shall render himself unfit for the discharge thereof, namely :‑\n(a) fine to any amount not exceeding one month's pay ;\n(b) confinement to quarters for a term not exceeding fifteen days, with or without punishment\ndrill, extra guard, fatigue or other duty ;\n(c) deprivation of good‑conduct pay ;\n(d) removal from any office of distinction or special emolument.]"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Certificates to police­officer.4Every police‑officer 5[appointed to the police‑force other than",
      "content": "an officer mentioned in section 4] shall receive on his appointment a certificate in the form annexed\nto this Act, under the seal of the Inspector‑General or such other officer as the Inspector‑General\nshall appoint, by virtue of which the person holding such certificate shall be vested with the powers,\nfunctions and privileges of a police‑officer.\nSurrender of certificate.6[Such certificate shall cease to have effect whenever the person\nnamed in it ceases for any reason to be a police‑officer, and, on his ceasing to be such an officer, shall\nbe forthwith surrendered by him to any officer empowered to receive the same.\nA police‑officer shall not by reason of being suspended from office cease to be a police‑officer.\nDuring the term of such suspension the powers, functions and privileges vested in him as a police ­\nofficer shall be in abeyance, but he shall continue subject to the same responsibilities, discipline and\npenalties and to the same authorities, as if he had not been suspended.]\n1 Subs. ibid., for “the appointment fo all police­officers other than those mentioned in section 4 of this Act shall, under such rules as the L.G. shall from time to time sanction, rest with\nthe Inspector­General, Deputy Inspectors General, Assistant Inspector­General, and District Superintendents of Police who may, under such rules as aforesaid, at any time dismiss,\nsuspend or reduce any police officer”.\n2 The second paragraph of s.7 was subs. For the words “or fine any police­officer to any amount not exceeding one months pay who shall discharge his duty in a careless or negligent\nmanner, or who, by any act of his own, shall render himself unfit for the discharge therof, by the Police Act (1861) Amendment Act, 1895 (8 of 1895),s.2.\n3 Ins. By A.O., 1937.\n4 As to enrolment, maintenance and discipline of__\n(1) The Punjab Frontier Police­officers, see the Punjab Frontier Police officer Regulation, 1893 (7 of 1893);\n(2) The Police establishment in municipal areas in the Punjab, see the Punjab Municipal Act, 1911 (Pujab 3 of 1911),\n5 Subs. By A.O., 1937, for “so appointed”.\n6 These two paragraph were subs., for the original paragraph by the Police Act (1861) Amendment Act 1895 (8 of 1895),s.3."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Police­office not to resign without leave or two months notice. No police‑officer shall be at",
      "content": "liberty to withdraw himself from the duties of his office, unless expressly allowed to do so by the\nDistrict Superintendent or by some other officer authorized to grant such permission, or, without the\nleave of the District Superintendent, to resign his office, 1[unless he shall have given to his superior\nofficer notice in writing, for a period of not less than two months, of his intention to resign.]"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Police­officers not to engage in other employment. No police‑officer shall engage in any",
      "content": "employment or office whatever other than his duties under this Act, unless expressly permitted to do\nso in writing by the Inspector‑General."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power of Inspector­General to make rules. The Inspector‑General of Police may, from",
      "content": "time to time, subject to the approval of the 2[Provincial Government], frame such orders and rules as\nhe shall deem expedient relative to the organization, classification and distribution of the police force,\nthe places at which the members of the force shall reside, and the particular services to be performed\nby them; their inspection, the description of arms, accoutrements and other necessaries to be\nfurnished to them ; the collecting and communicating by them of intelligence and information ; and\nall such other orders and rules relative to the police‑force as the Inspector‑General, shall, from time to\ntime, deem expedient for preventing abuse or neglect of duty, and for rendering such force efficient in\nthe discharge of its duties.\n3[13. Additional Police officers employed at cost of     individuals.__(1) On the application of\nany person, for the reasons to be recorded in writing, the District Superintendent may, subject to the\napproval of the Inspector­General, depute any additional number of police officers to keep the\npeace at any place within the general police district, and for such time as shall be deemed proper.\n(2) The additional police officers reffered to in sub­section (1) shall be exclusively under the\norder of the District Superintendent and the cost thereof shall be borne by person making the\napplication:\nProvided that it shall be lawful for the person making the application, on giving one month’s\nnotice in writing to the District Superintendent, to require that the police officers so deputed shall be\nwithdrawn; and such person shall be relieved from the cost of such additional force from expiration\nof such notice.]"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Appointment of additional force in the neighbourhood of railway and other works",
      "content": "Whenever any railway, canal or other public work, or any manufactory or commercial concern shall\nbe carried on, or\n1 The words in brackets shall be deemed to have been omitted for so long as the police (Resignaiton of office) Ordinance, 1942 (11 of 1942) remains in force.\n2 Subs. by A.O., 1937,for “L.G”.\n3 Subs. by C.E.O. 7 of 01, Art.6 (w.e.f. 14­8­01).\nbe in operation in any part of the country, and it shall appear to the Inspector‑General that the\nemployment of an additional police force in such place is rendered necessary by the behaviour or\nreasonable apprehension of the behaviour of the persons employed upon such work, manufactory or\nconcern, it shall be lawful for the Inspector‑General, with the consent of the 1[Provincial\nGovernment], to depute such additional force to such place, and to employ the same so long as such\nnecessity shall continue, and to make orders, from time to time, upon the person having the control or\ncustody of the funds used in carrying on such work, manufactory or concern, for the payment of the\nextra force so rendered necessary, and such person shall thereupon cause payment to be made\naccordingly.\n2[15.*                        *                           *                          *                           *                           *      *].\n3 Recovery of money payable 4/s 13 & 14."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Special police officers. When it shall appear that any unlawful assembly, or riot or",
      "content": "disturbance of the peace has taken place, or may be reasonably apprehended, and that the\npolice‑force ordinarily employed for preserving the peace is not sufficient for its preservation and for\nthe protection of the inhabitants and the security of property in the place where such unlawful\nassembly or riot or disturbance of the peace has occurred, or is apprehended, it shall be lawful for\n3[The District Superintendent of Police] to appoint so many of the residents of the neighbourhood as\nsuch police‑officers may require to act as special police‑officers for such time and within such limits\nas he shall deem necessary ; 3[* * *]"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Powers of special police­officers. Every special police‑officer so appointed shall have the",
      "content": "same powers, privileges and protection, and shall be liable to perform the same duties and shall be\namenable to the same penalties, and be subordinate to the same authorities, as the ordinary officers of\npolice.\n3[19.*                        *                           *                          *                           *                           *      *].\n4[20.Authority tobe exercised by police­officers. Police‑officers enrolled under this Act shall\nnot exercise any authority, except the authority provided for a police‑officer under this Act and any\nAct which shall hereafter be passed for regulating criminal procedure.\n1 Subs. by A.O., 1937,for “L.G.”.\n2 Omitted by C.E.O.7 of 01, Art.7­8 (w.e.f 14­8­2001).\n3 Subs. & omitted by C.E.O of 01, Acts 9­11 (w.e.f. 14­08­01).\n4 For some cases in which the application of s.20 has been restricted, see section 2 of the Punjab Frontier Police­Officer Regulation, 1893 (7 of 1893).\n1*                            *                           *                      *                          *                  *   *"
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Police­officers always on duty and may be employed in any part of district. Every",
      "content": "police‑officer shall, for all purposes in this Act contained, be considered to be always on duty, and\nmay at any time be employed as a police‑officer in any part of the general police‑district."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Duties of police­officers. It shall be the duty of every police‑officer promptly to obey and",
      "content": "execute all 1[lawful] orders and warrants lawfully issued to him by any competent authority ; to\ncollect and communicate intelligence affecting the public peace ; 2[to prevent the commission of\noffences and public nuisances ; to prevent sectarianism and hate speech and proliferation of hate\nmaterial by any person, organized group, any organization or prescribed organization] to detect and\nbring offenders to justice and to apprehend all persons whom he is legally authorized to apprehend,\nand for whose apprehension sufficient ground exists : and it shall be lawful for every police‑officer,\nfor any of the purposes mentioned in this section, without a warrant, to enter and inspect any\ndrinking‑shop, gaming‑house or other place of resort of loose and disorderly characters."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Police­officers may lay information, etc. It shall be lawful for any police‑officer to lay any",
      "content": "information before a Magistrate, and to apply for a summons, warrant, search‑warrant or such other\nlegal process as may by law issue against any person committing an offence 3* * *.\n1[25. Police officer to take charge of unclaimed property.__(1) It shall be the duty of every\npolice officer to take charge of all unclaimed property and to furnish an inventory to the District\nSuperintendent of Police who shall send a copy of the inventory to the District Public Safety\nCommission.\n(2) The District Superintendent shall be guided as to the disposal of unclaimed property by the\norders of the District Public Safety Commission as may be given by it in this behalf.]"
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. 1[District Superintendent] may detain property and issue proclamation. (1) The 1[District",
      "content": "Superintendent] may detain the property and issue a proclamation, specifying the articles of which it\nconsists, and requiring any person who has any claim thereto to appear and establish his right to the\nsame within six months from the date of such proclamation.\n1 Omitted, Ins. & Subs. by C.E.O.7 of 01, Arts 12­15 (w.e.f. 14­8­01).\n2 Subs. by Act No. IV of 2017. s.3(1).\n3 The words “and to prosecute such person up to final judgment” were rep. by the Code of Criminal Procedure, 1882 (Act 10 of 1882).\n1[(2) The provisions of section 525 of the 2[Code of Criminal Procedure, 1898 (Act V of 1898)],\nshall be applicable to property referred to in this section.]\n3[27. Confiscation of property if no claimant appears.__(1) If no person shall within the period\nallowed claim such property, or the proceeds thereof, if sold, it may, if not already sold under\nsub‑section (2) of the last preceding section, be sold under the orders of the 4[District Public Safety\nCommission.]\n(2) The sale‑proceeds of property sold under the preceding sub‑section and the proceeds of\nproperty sold under section 26 to which no claim has been established shall be 5[at the disposal of the\nProvincial Government].]"
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Persons refusing to deliver certificate, etc., on ceasing to be police­officers. Every person,",
      "content": "having ceased to be an enrolled police­officer under this Act, who shall not forthwith deliver up his\ncertificate, and the clothing, accoutrements, appointments and other necessaries which shall have\nbeen supplied to him for the execution of his duty, shall be liable, on conviction before a Magistrate,\nto a penalty not exceeding two hundred rupees, or to imprisonment with or without hard labour, for a\nperiod not exceeding six months, or to both."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Penalties for neglect of duty, etc. Every police‑officer who shall be guilty of any violation of",
      "content": "duty or wilful breach or neglect of any rule or regulation or lawful order made by competent\nauthority, or who shall withdraw from the duties of his office without permission, 6[or without having\ngiven previous notice for the period of two months], 7[or who, being absent on leave, shall fail,\nwithout reasonable cause, to report himself for duty on the expiration of such leave,] or who shall\nengage without authority in any employment other than his police‑duty, or who shall be guilty of\ncowardice, or who shall offer any unwarrantable personal violence to any person in his custody, shall\nbe liable, on conviction before a Magistrate, 8[to imprisonment for a term which may extend to three\nyears and with 0.1 million fine.]\n9[30. Regulation of public assemblies and processions and licensing of same.__(1) The District\nSuperintendent or Assistant District Superintendent of Police may, as occasion requires, direct the\nconduct of all assemblies and processions on the public roads, or in the public streets or\nthoroughfares, and prescribe the routes by which, and the times at which, such processions may pass.\n1 Ins. by the Police Act (1861) Amendment Act, 1895 (8 of 1895), s. 7.\n2 Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and II Sch., for “Code of Criminal Procedure, 1882”.\n3 Subs. by Act 8 of 1895, s. 8, for the original section.\n4 Subs. by C.E.O 7 of 01, Art. 16 (w.e.f. 14­8­01).\n5 Subs. by A.O., 1937, for “at the disposal of Govt.”.\n6 The words in brackets shall be deemed to have been omitted for so long as the Police (Resignation of Office) Ordinance, 1942 (11 of 1942) remains in force.\n7 Ins. by the Police Act (1861) Amendment Act, 1895 (8 of 1895), s. 9.\n8 Subs. by Act IV of 2017 s.3 (2).\n9 Subs. ibid., s. 10, for the original section.\n(2) He may also, on being satisfied that it is intended by any persons or class of persons to\nconvene or collect an assembly in any such road, street or thoroughfare, or to form a procession\nwhich would, in 1[this judgment, if uncontrolled, be likely to cause a breach of the peace, require by\ngeneral or special notice that the persons convening or collecting such assembly or directing or\npromoting such procession shall apply for a license.\n(3) On such application being made, he may issue a license specifying the names of the licensees\nand defining the conditions on which alone such assembly or such procession is to be permitted to\ntake place and otherwise giving effect to this section: Provided that no fee shall be charged on the\napplication for, or grant of, any such license.\nMusic in the streets. (4) He may also regulate the extent to which music may be used in the\nstreets on the occasion of festivals and ceremonies.]\n2[30A. Powers with regard to assemblies and processions violating conditions of license.‑ (1)\n1[A]  District Superintendent of Police or Assistant District Superintendent of Police or Inspector of\nPolice or any police‑officer in charge of a station may stop any procession which violates the\nconditions of a license granted under the last foregoing section, and may order it or any assembly\nwhich violates any such conditions as aforesaid to disperse.\n(2) Any procession or assembly which neglects or refuses to obey any order given under the last\npreceding sub‑section shall be deemed to be an unlawful assembly.]"
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Police to keep order in public road, etc. It shall be the duty of the police to keep order on",
      "content": "the public roads, and in the public streets, thoroughfares, ghats and landing‑places, and at all other\nplaces of public resort, and to prevent obstructions on the occasions of assemblies and processions on\nthe public roads and in the public streets, or in the neighbourhood of places of worship, during the\ntime of public worship, and in any case when any road, street, thoroughfare, ghat or landing­place\nmay be thronged or may be liable to be obstructed."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Penalty for disobeying orders issued under last three sections etc. Every person opposing",
      "content": "or not obeying the orders issued under 3[section 30, 30A or section 31] or violating the conditions of\nany license granted by the District Superintendent or Assistant District Superintendent of Police for\nthe use of music, or for the conduct of assemblies and processions, shall be liable, on conviction\nbefore a Magistrate, to a fine not exceeding two hundred rupees.\n1 Subs. & omitted by C.E.O. 7 of 01, Arts 17­19 (w.e.f. 14­8­01).\n2 Ins. by the Police Act (1861) Amendment Act, 1895 (8 of 1895), s. 11.\n3 Subs. by Act No. IV of 2017, s. 3 (b).\n1[33A. Powers to make rules regarding use of street, etc.__(1) In any town or other place in\nwhich he thinks fit, the District Superintendent may, from time to time and subject to such order as\nmay have been made by a municipal or other authority empowered in that respect, make rules or\norders for___\n(a) closing certain streets or places temporarily, in cases of danger from ruinous buildings or\nother cause, with such exceptions as shall appear reasonable;\n(b) guarding against injury to persons and property in the construction, repair and demolition\nof buildings, platforms and other structures from which danger may arise to passengers,\nneighbours or the public;\n(c) regulating the leading, driving, conducting or conveying of any elephant or wild or\ndangerous animal through or in any street;\n(d) prohibiting the hanging or placing of any cord or pole across a street or part thereof, or the\nmaking of a projection or structure so as to obstruct traffic or the free access of light and\nair;\n(e) prescribing certain hours of the day during which ordure and offensive matter or objects\nshall not be taken from or into houses or buildings in certain streets or conveyed through\nsuch streets and during which cattle shall not be driven along the streets or along certain\nspecified streets, except subject to such reasonable regulations as he may prescribe in that\nbehalf;\n(f) prohibiting the setting fire to or burning any straw or discharging a firearm or air gun, or\nletting off or throwing a firework, or sending up a fire balloon in or other matter, or\nlighting a bonfire, or wantonly upon or within fifty feet of a street or building or the\nbutting up of any post or other thing on the side of or across a street for the purpose of\naffixing thereto lamps or other contrivances for illumination, except subject to such\nreasonable regulations as he may prescribe in that behalf;\n(g) prohibiting, save under such reasonable regulations as the District Superintendent may\nimpose, the making of any excavation the placing of building materials or other articles,\nor the fastening or detention of any hours or other animal in any street;\n(h) prohibiting, save under such regulation as aforesaid, the exposure or movement in any\nstreet of persons or animals suffering from contagious or infectious diseases and the\ncarcasses of animal or part thereof and the corpses of persons deceased;\n(i) setting a part places for the slaughtering of animals, the cleaning of carcasses or hides, the\ndeposit of noxious or offensive matters, and for obeying calls of nature;\n1 Subs. & omitted by C.E.O.7 & 01, Arts 17­19 (w.e.f. 14­8­01).\n(j) in cases of existing or apprehended epidemic or infectious diseases of men or animals, with\nrespect to cleanliness and disinfection of premises by the occupier thereof and residents\ntherein, and as to the segregation and management of the persons or animals diseased or\nsupposed to be diseased, as may been directed or approved by the Provincial Government\nwith a view to prevent the disease or to check the spreading thereof;\n(k) directing the closing or disuse, wholly or for certain purposes, or limiting to certain\npurposes only the use, of any source, supply or receptacle of water and providing against\npollution of the same or of the water, therein;\n(l) regulating the hours during which and the manner in which any place for the disposal of\nthe dead, any Sarai, village­gate or other place of public resort may be used, so as to\nsecure the equal and appropriate application of its advantages and accommodation and to\nmaintain orderly conduct amongst those who resort thereto ;\n(m) regulating the movement of persons, animals and vehicles at such times and such places\nat which, in the opinion of the District Superintendent, special regulations may be\nnecessary for the public safety and convenience; and\n(n) prescribing the number or position of lights to be used on vehicles in streets and the hours\nbetween which such lights shall be used.\n(2) Every rule or order made under clause (h) or clause (i) with respect to the use of a place for\nthe disposal of the dead shall be made with due regard to ordinary and established usages and to the\nnecessities of prompt disposal of the dead in certain cases; and every rule or order made by the\nDistrict Superintendent under clauses (c), (e), (f), (g), (h), (i), or (n) shall be published by affixing a\ncopy thereof, in the language of district on some public building in the town or place in which the\nsame is to have operation, and a copy, in the language of the district, of every rule or order made\nunder clauses (a), (b), (j), (k) or (l) shall be kept affixed in a conspicuous spot near to the building,\nstructure, work or place to which the same specially relates.\n(3) Every rule promulgated under the authority of clause (j) of sub­section (1) shall be forthwith\nreported to the Zila Nazim and shall remain in force for not more than fifteen days unless extended by\nthe Zila Nazim.\n(4) It shall be the duty of all persons concerned to conform to any order duly made as aforesaid\nso long as the same shall be in operation.]"
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Punishment for certain offences on roads, etc Power of police of officer. Any persons",
      "content": "who, on any road or in any 1[open place or] street or thoroughfare within the limits of any town to\nwhich this section shall be specially 2extended by the 3[Provincial Government], commits any of the\nfollowing offences, to the obstruction, inconvenience, annoyance, risk, danger or damage of the\n4[residents or passengers] shall, on conviction before a Magistrate, be liable to a fine not exceeding\nfifty rupees, or to imprisonment 5[with or without hard labour] not exceeding eight days ; and it shall\nbe lawful for any police‑officer to take into custody, without a warrant, any person who within his\nview commits any of such offences, namely:__\nFirst._ Slaughtering cattle, furious riding, etc.‑Any person who slaughters any cattle or cleans\nany carcass; any person who rides or drives any cattle recklessly or furiously, or trains or breaks any\nhorse or other cattle:\nSecond.‑Cruelty to animals. Any person who wantonly or cruelly beats, abuses or tortures any\nanimal:\nThird.‑Obstructing passengers. Any person who keeps any cattle or conveyance of any kind\nstanding longer than is required for loading or unloading or for taking up or setting down passengers,\nor who leaves any conveyance in such a manner as to cause inconvenience or danger to the public:\nFourth.‑Exposing goods for sale. Any person who exposes any goods for sale:\nFifth.‑Throwing dirt into street. Any person who throws or lays down any dirt, filth, rubbish or\nany stones or building materials, or who constructs any cowshed, stable or the like, or who causes any\noffensive matter to run from any house, factory, dung‑heap or the like:\nSixth.‑ Being found drunk or riotous. Any person who is found drunk or riotous or who is\nincapable of taking care of himself:\nSeventh.‑ Indecent exposure of person. Any person who wilfully and indecently exposes his\nperson, or any offensive deformity or disease, or commits nuisance by easing himself, or by bathing\nor washing in any tank or reservoir not being a place set apart for that purpose:\nEight.‑ Neglect to protect dangerous place. Any person who neglects to fence in or duly to\nprotect any well, tank or other dangerous place or structure.\n1 Ins. by Act 8 of 1895, s. 13.\n2 For list of the towns to which this section has been specially extended, see different Local Rules and Order, and Gazette of Punjab, 1955, Pt. I, p. 989.\n3 Subs. by A.O., 1937, for “L.G.”.\n4 Subs. by Act 8 of 1895, s. 13 for “residents and passengers”.\n5 Ins. by the Amending Act, 1903 (1 of 1903), s. 3 and II Sch.\n1[34A. Penalty for contravention of any rule or order made under section 33. Whoever\ncontravenes any rule or order made under section 33A or abets the commission of any such offence\nshall be pubnished with fine which may extent to two hundred rupees."
    },
    {
      "provision_ref": "sec34b",
      "section": "34B",
      "title": "Section 34B. Summary disposal of cases",
      "content": "_(1) A Court taking cognizance of an offence pubishable\nunder section 34 or section 34 A may state upon the summons to be served on the accused persons\nthat he___\n(a) may appear by pleader and not in person; or\n(b) may, by a specified date prior to the hearing of the charge, plead guilty to the charge by\nregistered letter and remit to the Court such sum not exceeding twenty­five rupees as the\nCourt may specify.\n(2) The accused person shall, if he pleads guilty to the charge, forward his licence, if any, to the\nCourt with a letter containing his plea in order that the conviction may be endorsed on the licence.\n(3) Where an accused person pleads guilty and remits the sum specified and has complied with\nthe provisions of sub­section (2), no further proceedings in respect of the offence shall be taken\nagainst him, nor shall be liable to be disqualified for holding or obtaining a licence by reason of his\nhaving pleaded guilty.]"
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Jurisdiction. 2* * * Any charge against a police‑officer above the rank of a",
      "content": "constable under this Act shall be enquired into and determined only by an officer exercising the\npowers of a 3Magistrate.\n1 Ins. by C.E.O., 7 of 2001, Art. 21 (w.e.f. 14­08­01).\n2 The words “In all cases of convctions under this Act the Officer trying the case shall be limited to his ordinary jurisdiction as to the amount of fine or imprisonment which he may\ninflict: Provided that,” were rep. by the Code of Criminal Procedure, 1882 (Act 10 of 1882).\n3 I. e., by a Magistrate of the first class, see s. 3 (2) of the Code of Criminal Procedure, 1898 (Act 5 of 1898)."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Power to prosecute under other law not affected. Nothing contained in this Act shall be",
      "content": "construed to prevent any person from being prosecuted under any other Regulation or Act for any\noffence made punishable by this Act, or from being liable under any other Regulation or Act or any\nother or higher penalty or punishment than is provided for such offence by this Act:\nProviso. Provided that no person shall be punished twice for the same offence.\n1[37. Recovery of penalties and fines imposed by Magistrates. The provisions of sections 64 to\n70, both inclusive, of the Pakistan Penal Code (XLV of 1860), and of sections 386 to 389, both\ninclusive, of the 2[Code of Criminal Procedure, 1898 , (Act V of 1898)], with respect to fines, shall\napply to penalties and fines imposed under this Act on conviction before a Magistrate:\nProvided that, notwithstanding anything contained in section 65 of the first‑mentioned Code, any\nperson sentenced to fine under section 34 of this Act may be imprisoned in default of payment of\nsuch fine for any period not exceeding eight days."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. [Procedure until return is made to warrant of distress.] Rep. by the Police Act (1861)",
      "content": "Amendment Act, 1895 (VIII of 1895), s. 14."
    },
    {
      "provision_ref": "sec1937",
      "section": "1937",
      "title": "Section 1937. 442. Limitation ofactions. All actions and prosecutions against any person, which may be",
      "content": "lawfully brought for anything done or intended to be done under the provisions of this Act, or under\nthe general police‑powers hereby given shall be commenced within three months after the act\ncomplained of shall have been committed, and not otherwise ;\nand notice in writing of such action and of the cause thereof shall be given to the defendant, or to\ncommitted, one month at least before the commencement of the action.\nTender of amends. No plaintiff shall recover in any such action if tender of sufficient amend shall\nhave been made before such action brought, or if a sufficient sum of money shall have been paid into\nCourt after such action brought, by or on behalf of the defendant, and, though a decree shall be given\nfor the plaintiff in any such action, such plaintiff shall not have costs against the defendant, unless the\nJudge before whom the trial is held shall certify his approbation of the action:\n1 Subs. by the Police Act (1861) Amendment Act, 1895 (8 of 1895), s. 14, for the original ss. 37 to 40.\n2 Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981, (27 of 1981), s. 3 and II Sch., for “Code of Criminal Procedure, 1882”.\n3 See however, paragraph 4 of the India and Burma (Transitory Provisions) Order, 1937. Section 41 read as follows:___ “All sums paid for the service of process by police­officers, and all\nrewards, forfeitures and penalties or shares of rewards, forfeitures and penalties which by law are payable to informers shall, when the information is laid by a police­officer, be paid into\nthe General Police Fund.\n4 So much of s. 42 (the portion printed in italics) as relates to the limitation of suit was rep. by the Indian Limitation Act, 1871 (9 of 1871).\nProviso. Provided always that no action shall in any case lie where such officers shall have been\nprosecuted criminally for the same act."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Plea that act was done under warrant. When any action or prosecution shall be brought or",
      "content": "any proceedings held against any police‑officer for any act done by him in such capacity, it shall be\nlawful for him to plead that such act was done by him under the authority of a warrant issued by a\nMagistrate.\nSuch plea shall be proved by the production of the warrant directing the act, and purporting to be\nsigned by such Magistrate and the defendant shall thereupon be entitled to a decree in his favour,\nnotwithstanding any defect of jurisdiction in such Magistrate. No proof of the signature of such\nMagistrate shall be necessary, unless the Court shall see reason to doubt its being genuine:\nProviso. Provided always that any remedy which the party may have against the authority issuing\nsuch warrant shall not be affected by anything contained in this section."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Police­officers to keep diary. It shall be the duty of every officer in charge of a police­­",
      "content": "station to keep a general diary in such form as shall, from time to time, be prescribed by the\n1[Provincial Government] and to record therein all complaints and charges preferred, the names of all\npersons arrested, the names of the complainants, the offences charged against them, the weapons or\nproperty that shall have been taken from their possession or otherwise, and the names of the\nwitnesses who shall have been examined.\n2*                           *                  *        *          *   *             *"
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Provincial Government may prescribe form of returns. The 1[Provincial Government] may",
      "content": "direct the submission of such returns by the Inspector‑General and other police‑officers as to such\n1[Provincial Government] shall seem proper, and may prescribe the form in which such returns shall\nbe made.\n1 Subs. by A.O., 1937, for “L.G.”.\n2 omitted by C.E.O.7 of 01, Art. 22 (w.e.f. 14­8­01).\n1[46. Scope of Act.‑ (1) This Act shall not by its own operation take effect in any 2* province or\nplace. But the 3[Provincial Government] by an order to by published in the 4[official Gazette] may\nextend5 the whole or any part of this Act to any 2* province or place, and the whole or such portion\nof this Act as shall be specified in such order shall thereupon take effect in such 2* province or place.\n(2) When the whole or any part of this Act shall have been so extended, the 6[Provincial\nGovernment] may, from time to time, by notification in the official Gazette, make rules consistent\nwith this Act___\n(a) to regulate the procedure to be followed by Magistrates and police‑officers in the\ndischarge of any duty imposed upon them by or under this Act ;\n(b) to prescribe the time, manner and conditions within and under which claims for\ncompensation under section 15A are to be made, the particulars to be stated in such\nclaims, the manner in which the same are to be verified, and the proceedings (including\nlocal enquiries if necessary) which are to be taken consequent thereon ; and\n(c) generally, for giving effect to the provisions of this Act.\n(3) All rules made under this Act may from time to time be amended, added to or cancelled by\nthe 6[Provincial Government].]\n7[47. Authroity of district Superintendent over village police. It shall be lawful for the\n6[Provincial Government] in carrying out this Act into effect in any part of the Province to declare\nthat the authority over village watchman or other village police officer for the purposes of police shall\nbe exercised by the District Superintendent of Police.]\n1 Subs. by the Police Act (1861) Amendment Act, 1895 (8 of 1895), s. 15 for the original section.\n2 The original word and comma “presidency,” omitted by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955).\nIn the Province of Sind there is a special Police Act, see the Bombay District Police Act, 1890 (Bom. 4 of 1890).\nFor notification extending this Act under the power conferred by the original section to:­\n(i) Several district in the Punjab, see notification no. 971, dated 15th May, 1861 Calcutta Gazette, 18th May 1861, P. 1302, and Punjab R. and O.\nFor list of Provinces and District to which the Act has been extended by special enactments, see foot­note 1 on P. 210, supra.\n3 Subs. by A. O., 1937, for “G.G.in C”.\n4 Subs. ibid., for “Gazette of India”.\n5 For extension of all the provisions of this Act (V of 1861) to­\n(i) certain district in West Pakistan, see Gazette of West Pakistan 1955, Ext., p. 60;\n(ii) the districts of Kalat, kharan, Lasbella and Mekran, see Gazette of West Pakistan, 1959, Ext., p. 297.\nFor order extending section 34 of this Act to­\n(i) the Municipal limits of Haveli Wasavewala, see Gazette of West Pakistan, 1957, Pt. I., p. 493.\n(ii) The limits of Towns of Shadipalli, Jamesabad, Somaro and Pithoro in Tharparkar District, see Gazette of West Pakistan, 1957, Pt. I, p. 656.\n(iii) the limits of Town in the Khairpur District, viz., Khairpur, Gambat and Ranipur, see Gazette of West Pakistan, 1958, Pt. I., p. 597.\n6 Subs. by A.O., 1937, for “L.G.”.\n7 Subs. by C.E.O. 12 of 01 Arts. 6­8."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. District Public Safety Commission, its establishment, composition, etc.­ (1) In every",
      "content": "district, the Provincial Government shall, by notification in the official Gazette, establish a District\nPublic Safety Commission consisting of eight, ten or twelve members depending upon the size of the\ndistrict.\n(2) Half of the members of the District Public Safety Commission shall be elected by the Zila\nCouncil from amongst its councillors on the basis of each councillor casting only one vote in favour\nof any one candidate through secret ballot, while the other half of the members, hereinafter to be\ncalled the 'independent members', shall be appointed by the Chief Executive of the Province from a\nlist of persons recommended by the selection panel under sub­section (3) of section 50:\nProvided that, as far as practicable, one­third of both the elected and independent members of the\nDistrict Public Safety Commission shall be women:\nProvided further that until the appointment of independent members, the members elected by the\nZila Council shall constitute the District Pubic Safety Commission.\n(3) The Nab Zila Nazim shall request the Chairperson of the selection panel to conduct the\nelection of the members of the District Pubic Safety Commission referred to in sub­section (2).\n(4) The tenure of the District Public Safety Commission shall, unless dissolved earlier under sub­\nsection (5), be three years:\nProvided that, notwithstanding the expiry of its tenure, the District Public Safety Commission\nshall continue to perform its functions until the constitution of its successor.\n(5) Where the performance of District Public Safety Commission is found unsatisfactory, the Zila\nCouncil may, by a resolution passed by two­thirds majority of its total membership, recommend the\ndissolution of the District Public Safety Commission to the Provincial Government which shall, within\nfifteen days, decide either to retain the District Public Safety Commission or dissolve it and, where it\nis decided to dissolve the District Public Safety Commission, the Provincial Government shall\nreconstitute the District Public Safety Commission in accordance with the foregoing provisions within\nforty­five days from such decision\n1[49. Selection panel for the appointment of independent members.­ There shall be a selection\npanel for the independent members consisting of District and Sessions Judge who shall be its\nChairperson and one nominee each of the Chief Executive of the Province and Zila Nazim:\nProvided that such nominees shall not be elected representatives or public servants.\".]\n1 Subs. by C.E.O. 12 of 01 Act 6­8."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Procedure for Selection of independant members.­ 1[\"(1) The selection panel shall invite",
      "content": "applications and nominations from the general public for selection of independent members.\"];\n(2) The eligible and willing candidates shall be called for interview.\n(3) The 1[District] shall select double the number of persons than the number of independent\nmembers to be appointed as members of the commission.\n(3A) The selection of independent members shall be by consensus.\n(3B) The selection process of the independent members shall be completed within thirty days.\".\n(4) The list of the persons referred to in sub­section (3) shall, accompanied by complete\nparticulars of such persons, be forwarded to the Chief Executive of the Province for appointment of\nthe independent members under section 48."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Selection criteria. ­ (1) No person shall be selected or appointed as independent member",
      "content": "who is activist of any political party, holds or has held any representative office or has\nremained public servant in the last two years immediately preceding his appointment or who is\notherwise disqualified under the provisions of sub­section (2).\n(2) A person shall be disqualified, from becoming a member if ­\n(a) he is of unsound mind and has been so declared by a competent court; or\n(b) he is or has been declared as bankrupt, loan defaulter or tax evader; or\n(c) he 1[is not a ] citizen of Pakistan; or\n(d) he holds an office of profit in the service of Pakistan; or\n(e) he is in the service of any statutory body or ary establishment or corporation which has\nbeen established or is owned or controlled by the Government or in which\nthe Government has a controlling share or interest; or\n(f) he has been dismissed, removed or compulsorily retired from the service of Pakistan on\ngrounds of misconduct; or\n(g) he has been convicted for any offence; or\n(h) he is not of impeccable integrity and proven professional competence in such fields as\nsocial work, law, administration, education, corporate sector, 1[or],\n1[(i) has no personal interest or conflict of interest in any matter pending before the District\nPublic Safety Commission.].\n1 Subs. by C.E.O 12 of 01, Arts. 6­8."
    },
    {
      "provision_ref": "sec152",
      "section": "152",
      "title": "Section 152. Establishment of Capital City District Public Safety Commission.­ The Provincial",
      "content": "Government shall establish a Capital City District Public Safety Commission for the Provincial\nCapital City District consisting of twelve members."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. The remaining six members, hereinafter to be called the \"independent members\" shall be",
      "content": "appointed by the Chief Executive of the Province from a list of persons recommended by the\nselection panel for the Capital City District under sub­section (3) of section 50"
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Capital City District Selection Panel for the, appointment of Independent members.­ (1)",
      "content": "There shall be a Capital City District Seleclicr Panel for the preparation of the list of the persons for\nappointment as independent members consisting of Chief Justice of the High Court who shall be its\nChairperson, and one nominee each of the Chief Executive of the Proviice and Zila Nazim who shall\nnot be holder of any elective office nor shall be a public servants."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Procedure for selection of independenLmembers.­ The procedure provided under sections",
      "content": "50 and 51 shall be applicable for selection of the narres of the independent members of the Capital\nCity District Public Safe:y Commission.\n1 Subs. by C.E.O.12 of 01, Art.12."
    },
    {
      "provision_ref": "sec54a",
      "section": "54A",
      "title": "Section 54A. Responsibility of District Police Officer on complaints of neglect and excesses by",
      "content": "police.­ (1) Where the Zila Nazim on the basis of any complaint or information has reason to believe\nthat any police official has committed an act of neglect, failure or excess, or the Union Public Safety\nCommittee on its own motion or on receipt of a complaint from an aggrieved person reports to the\nZila Nazim about police neglect, failure or excess, the Zila Nazim may direct the District Police\nOfficer to take remedial measures, including registration of First Information Report in appropriate\ncases, within the period specified by him and inform the District Public Safety Commission.\n(2) The District Police Officer or the concerned competent authority shall immediately take\nremedial measures, and may suspend the concerned official where necessary, initiate an inquiry and\ntake appropriate action in accordance with law.\n(3) The District Police Officer shall, without delay, inform the Zila Nazim and District Public\nSafety Commission of the action taken by him pursuant to the directions given under section (1) and\nforward a copy of the final report of inquiry within forty­five days of such directions.\"."
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Furicaons of the District Public Safety Commission",
      "content": "(1)The functions of the District and\nCapital City District Public Safety Commission shall be to­\n1[(a) direct the District Police Officer, where the District Public Safety Commission has reason\nto believe that the officer in­charge of the police station has unjustifiably refused or\navoided to register any First Information Report, to conduct an inquiry into the matter and\ncause the registration of he First Information Report under section 154 of the Code of\nCriminal Procedure, 1898 (V of 1898), if any cognizable case is made out from the\nallegations of the complainant and report to the District Public Safety Commission within\nforty­eight hours the action taken by him.\n1 Subs. by C.E.O.12 of 01, Art.12.\n(b) direct the District Police Officer to take action and report in accordance with the provisions\nof section 54, where any public grievance is brought to its notice about any neglect or\nexcess by the police in general or any functionary of the police, and if —\n(i) such report is not made or appropriate action is not taken within the period specified\nby the District Public Safety Commission; or\n(ii) such report or action taken, after ascertaining further facts, is found unsatisfactory,\nthe District Public Safety Commission may refer the matter to the Provincial Government and\nInspector­General of Police for appropriate action;\n(c) refer the matter in writing to the Provincial Government for appropriate action where the\nDistrict Public Safety Commission is satisfied that a collusive relationship detrimental to the\ninterest of the people exists between the Zila Nazim and the District Police Officer:\nProvided that before making such report the District Police Officer and the Zilla Nazim\nshall be given an opportunity to be heard in person to explain their respective positions;\n(d) provide recourse to District Police Officer for reporting against any unlawful or malafide\norder or request for police support from any authority received by him or any officer\nsubordinate to him and give a decision thereon which shall prevail;\n(e) approve an annual local policing plan prepared by the District Police Officer in consultation\nwith Zila Nazim setting out the arrangements for the policing during the year :\nProvided that such policing plan shall include­\n(i) a statement of the financial resources expected to be made available by the Provincial\nGovernment and local governments; and\n(ii) performance targets for the year and their delivery mechanism;\n(f) evaluate the delivery of performance targets on quarterly basis and send half­yearly reports\nto Zila Nazim, Tehsil Nazim, Union Nazim, Provincial Government and Inspector General\nof Police;\n(g) receive from the District Police Officer by the end of August each year, a general report on\nthe policing of the district during the previous year; and\n(h) seek to enhance police­public co­operation by facilitating the creation of Citizen­Police\nLiaison Committees.\".]\n(2) The Commission may recommend financial incentives for good work done by any\npolice officer.\n(3) The Commission may, subject to rules establish independent reporting centres for\nregistration of First Information Reports.\n.\n1[55A. Meetings and conduct of business by the District Public Safety Commission.­ (1) The\nmembers of the District Public Safety Commission shall, annually, elect from amongst themselves a\nChairperson alternating between independent and elected members.\n(2) In the absence of the Chairperson for any reason, the members present in the regular convened\nmeeting shall elect from amongst themselves a Chairperson for such meeting.\n(3) The business of the District Public Safety Commission shall be conducted by it in its meetings.\n(4) Quorum for the District Public Safety Commission shall be two­thirds of its total membership.\n(5) The decision of the District Public Safety Commission shall be taken by a simple majority.\n(6) The District Public Safety Commission may with the prior approval of the Provincial\nGovernment make rules of procedure for discharge of its functions.]."
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. Terms of members of the Commissions. ­ (1) The term of the independent members of the",
      "content": "District and Capital City District Public Safety Commission shall be four years:\nProvided that no independent member shall be appointed for a second term.\n(2) Independent members may be entitled to travelling and daily allowance as may be prescribed.\n1[57.­ Removal of members.­ The Chief Executive of a Province may remove a member of the\nDistrict Public Safety Commission from office, if he —\n(a) ceases to be a citizen of Pakistan;\n(b) is found suffering from physical or mental incapacity or illness;\n(c) is guilty of misconduct;\n(d) is found to have dealt with any matter in which he had a personal interest or conflict of\ninterest;\n(e) is convicted of a criminal offence;\n(f) is declared a bankrupt, loan defaulter or tax evader;\n(g) is involved in activities prejudicial to the ideology, interest, security, unity, solidarity, peace\nand integrity of Pakistan and its people, and the good order and harmony of society; or\n(h) brings the District Public Safety Commission into disrepute; or\n(i) fails to attend three consecutive meetings of the District Public Safety Commission without\nany reasonable cause.\"]."
    },
    {
      "provision_ref": "sec58",
      "section": "58",
      "title": "Section 58. Secretariat.­ The 1[Provincial Government] shall provide the Secretariat of the 1[District Public",
      "content": "Safetry Commossion] headed by a full time officer not below BS 17 and such staff as it may deem\nappropriate.]\n1 Ins & subs. by C.E.O. 12 of 01, Arts. 13­15.\nFORM\n(See section 8)\nA.B. has been appointed a member of the police­force under Act V of 1861, and is vested with\nthe powers, functions and privileges of a police­officer.\n__________\n1 Subs.added by C.E.O 7 of 01 Act 23­24 (w.e.f. 14­08­01)."
    }
  ],
  "definitions": []
}
