{
  "id": "pk-police-act-1888",
  "type": "statute",
  "title": "Police Act, 1888",
  "title_en": "Police Act, 1888",
  "short_name": "Police Act, 1888",
  "status": "in_force",
  "issued_date": "1888-02-16",
  "in_force_date": "1888-02-16",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-b5s%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Police Act, 1888 (III of 1888) published by The Pakistan Code (Police Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Title and extent",
      "content": "(1) This Act may be called the Police Act, 1888.\n2                                                              3\n[(2) It extends to the whole of Pakistan]; *\n3\n[*     *      *        *      *       *       *]\n4[2. Constitution of police forces for special purposes.—(1) Notwithstanding anything in\n5\n* * *, the Police Act, 1861(V of 1861), 6* * * 7* * *, the 8[Federal Government] may, by\nnotification 9in the official Gazette, create a special police district embracing parts of two or more\nProvinces, and extend to every part of the said district the powers and jurisdiction of members of a\npolice force belonging to any part of l0[Pakistan (Bom. IV of 1890)] specified in the notification.\n8\n(2) Subject to any orders which the [Federal Government] may make in this behalf,\nmembers of the said police force shall have, within every part of any Province of which any part is\nincluded in the said district, the powers, duties, privileges and liabilities which, as police officers,\nthey have in their own Province.\n(3) Any member of the said police force whom the 8[Federal Government] shall generally or\nspecially empower to act under this sub-section may, subject to any orders which the l[Federal\nGovernment] may make in this behalf, exercise within any Province any part of which is included in\nthe said district any of the powers of the officer in charge of a police-station in that Province, and\nwhen so exercising any such powers, shall, subject to any such order as aforesaid, be deemed to be\nan officer in charge of a police-station discharging the functions of such an officer within the limits\nof his station.\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1888, Pt. V, p. 130; for Report of the Select Committee, see ibid., 1888, Pt. IV,\np. 8; and for Proceedings in Council, see ibid., 1887, Pt. VI, p. 100, and ibid., 1888, pp. 37 and 40.\nThis Act has been declared to be in force in Balochistan by the British Balochistan Laws Regulation, 1913 (2 of 1913).\nIt has also been extended to the Leased Areas of Balochistan, see the Leased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950); and applied in\nthe Federated Areas of Balochistan, see Gazette of India, 1937, Pt. I, p. 1499.\n2\nSub-section (2) as amended by A. O., 1949, Arts. 3(2) and 4, has been subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of\n1960). s. 3 and 2nd Sch. (with effect from the 14th October, 1955).\n3\nThe word “and” at the end of sub-section (2), and sub-section (3), were rep. by the Repealing and Amending Act, 1914 (10 of 1914), s. 3\nand Sch. II.\n4\nSubs. by A. O., 1937, for the original section as amended by the Amending Act, 1891 (12 of 1891).\n5\nThe words and figures “the Madras District Police Act, 1859”, omitted by A. O., 1949, Sch.\n6\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2nd Sch.\n7\nThe words “or any Act relating to the Police in any Presidency-town”, omitted, ibid.\n8\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n9\nFor such notifications, see Gen. R. & O., and the Gazette of India, 1937, Extraordinary, dated 1st April, 1937, pp. 671 and 672, and ibid.,\nPt. I, pp. 873 and 1553.\n10\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from 14th October, 1955), for\n“the Provinces and the Capital of the Federation” which had been subs. by A. O., 1949, Arts. 3(2) and 4, for “British India”.\n(4) A part of a Province included in the said district shall not by reason of that inclusion cease,\nfor the purposes of any enactment relating to police, to be part of that Province."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Employment of police officers beyond the province to which they belong",
      "content": "Notwithstanding anything in any of the Acts mentioned or referred to in the last foregoing section,\nbut subject to any orders which the 1[Federal Government] may make in this behalf, a member of the\n2\n[police force] of any 3[Province] may discharge the functions of a police-officer in any part of\n4\n[Pakistan] beyond the limits of the 3[Province] and shall, while so discharging such functions, be\ndeemed to be a member of the 2[police force of that part and be vested with the powers, functions\nand privileges, and be subject to the liabilities, of a police officer belonging to 5[that police force].\n6\n[4. Consent of Provincial Government to exercise of powers and jurisdiction. Nothing\nin this Act shall be deemed to enable the police of one Province to exercise powers and jurisdiction\nin any area within another Province, not being a railway area, without the consent of the Government\nof that other Province.]\n________\nDate: 05-09-2024\n1\nSubs. ibid., for “Central Government” which had been subs. by A. O., 1937. for “G. G. in C.”.\n2\nSubs. by A.O., 1937, for “police-establishment”.\n3\nSubs. ibid., for “presidency, province or place”.\n4\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for\n“the Provinces and the Capital of the Federation” which had been subs. by A. O.,1949, Arts. 3 (2) and 4, for “British India”.\n5\nSubs. by A.O., 1937, for “that establishment”.\n6\nIns. ibid., cf., the Govt. of India Act, 1935, Sch. VII. List I, entry 39."
    }
  ],
  "definitions": []
}
