{
  "id": "pk-post-office-national-savings-certificates-ordinance-1944",
  "type": "statute",
  "title": "Post Office National Savings Certificates Ordinance, 1944",
  "title_en": "Post Office National Savings Certificates Ordinance, 1944",
  "short_name": "PONSC",
  "status": "in_force",
  "issued_date": "1944-09-08",
  "in_force_date": "1944-09-08",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJma-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Post Office National Savings Certificates Ordinance, 1944 (XLII of 1944) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Rules",
      "content": "1944\n1\nORDINANCE NO. XLII OF 1944\n[9th September, 1944]\nAn Ordinance to make certain provision in respect of Post Office Twelve-Year National Savings\nCertificates and other classes of Savings Certificates.\nWHEREAS an emergency has arisen which renders it necessary to make certain provision in\nrespect of Post Office Twelve-Year National Savings Certificates and other classes of Savings\nCertificates;\nNOW, THEREFORE, in exercise of the powers conferred by section 72 of the Government\nof India Act, as set out in the Ninth Schedule to the Government of India Act, 1935 (26 Geo. 5,c.2.),\nthe Governor-General is pleased to make and promulgate the following Ordinance:-"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, application and commencement",
      "content": "(1) This Ordinance may be called the Post\nOffice National Savings Certificates Ordinance, 1944.\n(2) It applies to—\n(a)        Post Office Twelve-Year National Savings Certificates issued in pursuance of\nthe Notification of the Government of India in the Finance Department, No. F.\n17(100)-F/43, dated the 4th September, 1943, and\n(b)        any 2other classes of savings certificates to which the 3[Federal Government]\nmay from time to time by notification in the official Gazette direct that the\nprovisions of this Ordinance shall apply.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Interpretation",
      "content": "In this Ordinance—\n(a)        “minor” means a person who is not deemed to have attained his majority\nunder the Majority Act, 1875 (IX of 1875);\n(b)        “savings certificate” includes a Post Office Twelve-Year National Savings\nCertificate referred to in clause (a) of sub-section (2) of section 1 and a\nsavings certificate of any other class to which the provisions of this Ordinance\nhave been applied by a direction in pursuance of clause (b) of that sub-section;\n1\nThe Ordinance has been applied to__\n(i)        Baluchistan, see Notification No. 52-W., dated the 11th October, 1944, Gazette of India, 1944, Pt. I, p. 1326;\nIt has been extended to__\n(a)          Leased Areas of Baluchistan by the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950).\n(b)         the Baluchistan States Union by the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G.\nG. O., 4 of 1953), as amended ; and\n(c)         the Khairpur State by the Khairpur (Federal Laws) (Extension) Order, 1953 (G. G.O. 5 of 1953), as\namended.\nThe Act has been and shall be deemed to have been brought into force in Gwadur with effect from the 8th\nSeptember, 1958, by the Gwadur (Application of Central Laws) Ordinance, 1960 (37 of 1960), s. 2.\n2\nDefence Savings Certificates, see Gaz. of P. 1948, Pt. I, p. 601; the Pakistan Post Office Ten-Years Savings Certificates and Pakistan Post\nOffice Five-Years Saving Certificates, see ibid., 1953, Pt. I, p. 235; and the Ten-Years National Development Certificates, see ibid., 1957,\nExt. p. 2215.\n3\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. of 1975), Art. 2 and Table.\n(c)        “transfer” means a transfer inter vivos and does not include a transfer by\noperation of law."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Restriction of transfer",
      "content": "Notwithstanding any provision in any enactment or any rule of\nlaw for the time being in force to the contrary, no transfer, whether made before or after the\ncommencement of this Ordinance or, as the case may be, before or after the making of a direction in\npursuance of clause (b) of sub-section (2) of section I, of a savings certificate shall be valid without\nthe previous consent in writing of an officer of the Post Office authorised by general or special order\nof the 1[Federal Government] in that behalf."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Payment on death of holder of savings certificate",
      "content": "(1) If a person dies and is at the\ntime of his death the holder of a savings certificate, payment of the sum for the time being due\nthereon may be made in the manner provided in the Government Savings Banks Act, 1873 (V of\n1873), for the payment of deposits belonging to the estates of deceased person, and the provisions of\nsections 4 to 9 of the said Act shall apply accordingly as if the holder of the savings certificate were a\ndepositor in a Government Savings Bank and the sum for the time being due on the certificate were a\ndeposit in such a Bank:\nProvided that in such application section 8 of the said Act shall be construed as if the\nreference therein to three thousand rupees were a reference to the amount of the maximum holding of\nsavings certificates prescribed in the rules made or deemed to have been made under this Ordinance\napplicable to the particular savings certificate;\nProvided further that—\n(a)        the powers conferred by the said provisions on the Secretary of a Government\nSavings Banks shall be exercisable by the Postmaster-General for the area\nwithin which the post office of issue of such savings certificate is situate 2[or if\nthat area is in India, by the Postmaster-General for such area in Pakistan as the\n1\n[Federal Government] may by a general or special order specify in this\nbehalf].\n(b)        where in any one case payment is to be made of savings certificates issued\nfrom more post offices than one, the said powers shall be exercisable by the\nPostmaster-General for the area in which any of the said post offices is situate.\n(2) Nothing in sub-section (1) shall be deemed to require any person to accept payment of the\namount due on a savings certificate before it has reached maturity."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Holdings by or on behalf of minors",
      "content": "Notwithstanding any provision in any enactment\nor any rule of law for the time being in force to the contrary,—\n(1) a minor may apply for and hold savings certificates and any person may apply for and\nhold savings certificates on behalf of a minor;\n1\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. of 1975), Art.2 and Table.\n2\nIns, by A. O., 1949.\n(2) where any certificate is held by or on behalf of a minor, the minor shall, whether the\ncertificate was applied for and issued before or after the commencement of this Ordinance or, as the\ncase may be, before or after the making of a direction in respect of such certificate in pursuance of\nclause (b) of sub-section (2) of section 1, be bound by the provisions of this Ordinance and of any\nrules made or deemed to have been made thereunder applicable to such savings certificate and by the\nterms of any declaration made by the applicant for the certificate in pursuance of the said rules;\n(3) payment of the sum for the time being due on a savings certificate held by or on behalf of\na minor may be made—\n(a)        to him personally, if he himself applied, for the certificate, or\n(b)        for the use of the minor, if the application for the certificate was made by any\nperson other than the minor,__\n(i)        to any such person, being a parent of the minor or guardian of his\nproperty, as may be nominated in that behalf in the form of application,\nor\n(ii)       if no such nomination has been made, to any guardian of the property\nof the minor appointed by a competent Court, or where no such\nguardian has been so appointed, to either parent of the minor, or where\nneither parent is alive, to any other guardian of the minor,__\nand the receipt of the minor or, as the case may be, of his parent or guardian for any sum paid\nunder this clause shall be a sufficient discharge therefore."
    }
  ],
  "definitions": []
}
