{
  "id": "pk-powers-of-attorney-act-1882",
  "type": "statute",
  "title": "Powers-of-Attorney Act, 1882",
  "title_en": "Powers-of-Attorney Act, 1882",
  "short_name": "Powers-of-Attorney Act, 1882",
  "status": "in_force",
  "issued_date": "1882-02-23",
  "in_force_date": "1882-02-23",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bps%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Powers-of-Attorney Act, 1882 (VII of 1882) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. ___This Act may be called the Powers",
      "content": "of-Attorney\nAct, 1882.\n1\n[It extends to the whole of Pakistan ;] and it shall come into force on the first day of May 1882."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Execution under power",
      "content": "of-attorney.___The donee of a power-of-attorney may, if he thinks\nfit, execute or do any assurance, instrument or thing in and with his own name and signature, and his\nown seal, where sealing is required, by the authority of the donor of the power; and every assurance,\ninstrument and thing so executed and done, shall be as effectual in law as if it had been executed or\ndone by the donee of the power in the name, and with the signature and seal, of the donor thereof.\nThis section applies to powers-of-attorney created by instruments executed either before or\nafter this Act comes into force."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Payment by attorney under power, without notice of death, etc., good",
      "content": "_Any person\nmaking or doing any payment or act in good faith, in pursuance of a power-of-attorney, shall not be\nliable in respect of the payment or act by reason that, before the payment or act, the donor of the power\nhad died or become lunatic, of unsound mind, or bankrupt, or insolvent, or had revoked the power, if\ntime of the payment or act, known to the person making or doing the same.\nBut this section shall not affect any right against the payee of any person interested in any\nmoney so paid; and that person shall have the like remedy against the payee as he would have had\nagainst the payer, if the payment had not been made by him.\nThis section applies only to payments and acts made or done after this Act comes into force."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Deposit of original instruments creating powers",
      "content": "of-attorney.___(a) An instrument\ncreating a power-of-attorney, its execution being verified by affidavit, statutory declaration or other\nsufficient evidence, may, with the affidavit or declaration, if any, be deposited in the High Court within\nthe local limits of whose jurisdiction the instrument may be.\n(b) A separate file of instruments so deposited shall be kept; and any person may search that\nfile, and inspect every instrument so deposited; and a certified copy thereof shall be delivered out to\nhim on request.\n1\nSubs. by the Central Laws (Statute Reform) Ordinance No. XXI of 1960, s. 3 and 2nd Sch. (with effect from the 14th October, 1955).\n(c) A copy of an instrument so deposited may be presented at the office and may be stamped\nor marked as a certified copy, and, when so stamped or marked, shall become and be a certified copy.\n(d) A certified copy of an instrument so deposited shall, without further proof, be sufficient\nevidence of the contents of the instrument and of the deposit thereof in the High Court.\n(e) The High Court may, from time to time, make rules for the purposes of this section, and\nprescribing, with the concurrence of the l[Provincial Government], the fees to be taken under clauses\n(a), (b), and (c).\n(f) 2[*               *                     *                    *                     *     *               *]\n(g) This section applies to instruments creating powers-of-attorney executed either before or\nafter this Act comes into force."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power",
      "content": "of-attorney of married women.___A married woman, whether a minor or not, shall,\nby virtue of this Act, have power, as if she were unmarried and of full age, by a non-testamentary\ninstrument, to appoint an attorney on her behalf, for the purpose of executing any non-testamentary\ninstrument or doing any other act which she might herself execute or do; and the provisions of this\nAct, relating to instruments creating powers-of-attorney, shall apply thereto.\n3\n[This section shall not apply to a Muslim married woman.]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. 4[Repealed]",
      "content": "______________\nDate: 13-06-2024\n1\nSubs. by A.O., 1937.\n2\nRep. by the Lower Burma Courts Act No. VI of 1900, s. 48 and Sch. II.\n3\nSubs. by the Federal Laws (Revision and Declaration) Ordinance No. XXVII of 1981 s. 3 and 2nd Sch.\n4\nRep. by the Amending Act No. XII of 1891."
    }
  ],
  "definitions": []
}
