{
  "id": "pk-president-s-pension-act-1974",
  "type": "statute",
  "title": "President's Pension Act, 1974",
  "title_en": "President's Pension Act, 1974",
  "short_name": "PPA",
  "status": "in_force",
  "issued_date": "1975-01-16",
  "in_force_date": "1975-01-16",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUY2ls-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of President's Pension Act, 1974 (IX of 1975) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement.(1) This Act may be called the President's Pension",
      "content": "Act,1974\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Amount and condition of pension",
      "content": "There shall be payable to every person who, having\nheld, after the nineteenth day of December, 1971, the office of President for not less than two years\nand not having been removed therefrom for violating the constitution or gross misconduct, has\nceased to hold such office, a monthly pension for life of 2[eighty five percentum of the salary\npayable to such person] free from all taxes 2[.]\n2\n[*     *           *           *          *           *    *]\n2\n(2)             [*     *           *           *          *           *    *]\n2\n(3)             [*     *           *           *          *           *    *]\n3\n[3. Provision of other facilities.—(1) The President who is entitled to pension under this\nAct, shall further be entitled to the facilities specified in clause (a) of the Schedule.\n(2) The widow of the President referred to in sub-section (1) shall be entitled to the facilities\nspecified in clause (b) of the Schedule.]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Expenditure on pension and other facilities to be charged on Federal Consolidated",
      "content": "Fund.— The expenditure on the pension and other facilities aforesaid shall be charged upon the\nFederal Consolidated Fund."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. [Repeal.] Omitted by the Federal Laws (Revision and Declaration) Ordinance,",
      "content": "1981 (XXV 11 of 1981), s. 3 and Sch,, 11.\n1\nFor Statement of Objects and Reason, see Gaz. of P., 1974, Ext., Pt. III, p.1008.\n2\nSubs and Omitted by Ord. XII of 2002, s.2.\n3\nSubs. by the Finance Act, 1996 (IX of 1996), s.7, for section 3.\n1\n[THE SCHEDULE\n(See section 3)\n(a)        (i) Exemption from the provision of the Pakistan Arms Ordinance, 1965 (W.P.\nOrdinance No. XX of 1965), or any other law for the time being in force relating to the\npossession of arms, fire arms or ammunition.\n(ii) Diplomatic Passport for self, wife and dependent children.\n(iii) Access to Government guest houses, rest houses and circuit houses in the country, free\nof charge.\n(iv) Installation of telephone at residence at Government expense and exemption from\npayment of its rental charges and of charges of calls made therefrom to the extent of rupees\n2\n[seventy two] thousand during a financial year in the aggregate.\n(v) Service of one Private Secretary in BPS-17 or 18, one security guard, one driver and\none cook for life from the date on which right to receive pension under this Act accrues.\n3\n[(va) Suitable security, making the required arrangement including services of personnel,\nvehicle or vehicles and allied matter, which the Federal Government shall, by notification in\nthe official Gazette, specify.]\n(vi) Free medical aid for life in Pakistan and abroad subject to approval by the Medical\nBoard for self, wife and dependent children.\n2\n[(vii) Free official residence for life or rent at the rate of fifty thousand rupees per\nmonth if official residence is not provided or occupied to be maintained at Government\nexpenses.\nExplanation.—In this paragraph, maintenance in relation to a residence (whether\nofficial or otherwise occupied) includes the payment of local rates and taxes, provision of\nelectricity to the extent of monthly consumption of 2000 units, gas to the extent of monthly\nconsumption of 10 HM3 (consumption of the electricity and gas to be adjusted at the\nclose of each financial year) and water.]\n(viii) An amount of one hundred thousand rupees for movement of house-hold effects and\ncollection of papers and books.\n2\n[(ix) Car allowance at the rate of twenty thousand rupees per month or such higher amount\nas the Federal Government may, keeping in view price of motor fuel, cost of car and its\nmaintenance, determine from time to time.\n1\nSubs. by Act 9 of 1996, s.7, for the Schedule.\n2\nSubs. & Added by Ord. XII of 02, s.3.\n3\nIns. by Act XVII of 2012, s.6, (dated.1-7-12).\n(x) No income tax shall be payable in respect of the facilities, benefits and perquisites\nadmissible under this Schedule.]\n(b)         1\n[(i)   Fifty per centum of the pension as is or may from time to time be, payable to\nthe President]\n1\n[(ii) Free official residence for life or rent at the rate of twenty-five thousand\nrupees per month if official residence is not provided or occupied to be\nmaintained at the Government expenses.\nExplanation.—In this paragraph, maintenance in relation to a residence (whether official or\notherwise occupied) includes the payment of local rates and taxes, provision of electricity to the\nextent of monthly consumption of 2000 units, gas to the extent of monthly consumption of 10 HM3\n(consumption of the electricity and gas to be adjusted at the close of each financial year) and\nwater.]\n(iii) Free medical aid in Pakistan and abroad subject to approval of the Medical for\nherself and dependent children, if any.\n(iv)       Installation of telephone at residence at Government expense and exemption\nfrom payment of its rental charges and of charges of calls made therefrom the\nextent of 1[forty-eight] thousand rupees during a financial year in the\naggregate.]\n1\n[(v)   Diplomatic Passport for self and dependent children.\n(vi)       Access to the Government Guest Houses. Rest Houses and Circuit Houses\nin the country, free of charge.\n(vii)      Service of one driver or orderly.\n(viii) An amount of one hundred thousand rupees for movement of house-hold\neffects and collection of papers and books, if not already availed by the\nPresident.\n(ix)       Car allowance at the rate of ten thousand rupees per month or such higher\namount as the Federal Government may, keeping in view price of motor fuel,\ncost of car and its maintenance, determine from time to time.\n(x)        No income tax shall be payable in respect of the facilities, benefits and\nperquisites admissible under this schedule.]\n______________________________________________________________________________\n1\nSubs. by Ord. XII of 02, s.3."
    }
  ],
  "definitions": []
}
