{
  "id": "pk-prevention-and-control-of-human-trafficking-ordinance-2002-repealed-by-act-xxxiv",
  "type": "statute",
  "title": "Prevention and Control of Human Trafficking Ordinance, 2002 (Repealed by Act XXXIV of 2018)",
  "title_en": "Prevention and Control of Human Trafficking Ordinance, 2002 (Repealed by Act XXXIV of 2018)",
  "short_name": "PACOH",
  "status": "repealed",
  "issued_date": "2002-10-02",
  "in_force_date": "2002-10-02",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Fta5w%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Prevention and Control of Human Trafficking Ordinance, 2002 (Repealed by Act XXXIV of 2018) (LIX of 2002) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.­(1) This Ordinance may be called the Prevention and",
      "content": "Control of Human Trafficking Ordinance, 2002.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.­In this Ordinance, unless there is anything repugnant in the subject or context,­",
      "content": "(a) \"benefit\" includes monetary profit, proceeds or payment in cash or in kind;\n(b) \"child means any person who has not attained the age of eighteen years;\n(c) \"Code\" means the Code of Criminal Procedure, 1898 (Act V of 1898);\n(d) \"coercion\" means the use of force, violence, physical restraint, deception, fraud or acts or\ncircumstances not necessarily including physical force but calculated to have the same\neffect, such as the credible threat of force or of infliction of serious harm;\n(e) \"document\" related to human trafficking includes a passport, a travel document and any\nidentification document used by law enforcement authorities;\n(f) \"exploitative entertainment\" means all activities in connection with human sports or sexual\npractices or sex and related abusive practices;\n(g) \"Government\" means the Federal Government;\n(h) \"human trafficking\" means obtaining, securing, selling, purchasing, recruiting, detaining,\nharbouring or receiving a person, notwithstanding his implicit or explicit consent, by the\nuse of coercion, kidnapping, abduction, or by giving or receiving any payment or benefit,\nor sharing or receiving a share for such person's subsequent transportation out of or into\nPakistan by any means whatsoever for any of the purposes mentioned in section 3;\n(i) \"inhuman sports\" include all sports involving, as a matter of normal course, infliction of\nphysical or mental injury on a person against his will, intention or reasonable expectation;\n(j) \"organized criminal group\" means a structured group of two or more persons, existing for a\nperiod of time and acting in concert with the aim of committing any offence, under this\nOrdinance, in order to obtain, directly or indirectly, any financial or other material benefit\nand includes a person knowingly receiving or disbursing benefits accruing from the\ncommission of any offence in relation to human trafficking by an organized criminal\ngroup; and\n(k) \"victim\" means the person who is the subject of or against whom any offence under this\nOrdinance has been committed."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Punishment for human trafficking.­The human trafficking shall be punishable as under:­",
      "content": "(i) Whoever knowingly plans or executes any such plan for human trafficking into or out of\nPakistan for the purpose of attaining any benefit, or for the purpose of exploitative\nentertainment, slavery or forced labour or adoption in or out of Pakistan shall be\npunishable with imprisonment which may extend to seven years and shall also be liable to\nfine:\nProvided that in case of an accused who, in addition to committing an offence as\naforesaid has also been guilty of kidnapping or abducting or any attempt thereto in\nconnection with such offence, the imprisonment may extend to ten years with fine:\nProvided further that whoever plans to commit an offence under this clause but has not as\nyet executed the same shall be punishable with a term of imprisonment which may extend\nto five years and shall also be liable to fine.\n(ii) Whoever knowingly provides, obtains or employees the labour or services of a person by\ncoercion, scheme, plan or method intended to make such person believe that in the event\nof non­performance of such labour or service, he or any other person may suffer from\nserious harm or physical restraint or legal proceedings, shall be punishable with\nimprisonment which may extend to seven years and shall also be liable to fine:\nProvided that if the commission of the offence under this clause involves kidnapping or\nabduction or any attempt thereto, the term of imprisonment may extend to ten years with\nfine:\nProvided further that payment of any remuneration in lieu of services or labour of the\nvictim shall not be treated as a mitigating circumstance while awarding the punishment.\n(iii) Whoever knowingly purchases, sells, harbours, transports, provides, detains or obtains a\nchild or a woman through coercion, kidnapping or abduction, or by giving or receiving\nany benefit for trafficking him or her into or out of Pakistan or with intention thereof, for\nthe purpose of exploitative entertainment by any person and has received or expects to\nreceive some benefit in lieu thereof shall be punishable with imprisonment which may\nextend to ten years and shall also be liable to fine:\nProvided that if the commission of the offence under this clause involves kidnapping or\nabduction or any attempt thereto of the victim, the term of imprisonment may extend to\nfourteen years with fine: .\nProvided further that plea, if any, taken by the biological parents of the child shall not\nprejudice the commission of offence under this clause.\n(iv) whoever knowingly takes, confiscates, possesses, conceals, removes or destroys any\ndocument related to human trafficking in furtherance of any offence committed under this\nOrdinance or to prevent or restrict or attempt to present or restrict, without lawful\nauthority, a person's liberty to move or travel, shall be punishable with imprisonment\nwhich may extend to seven years and shall also be liable to fine."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Offences committed by organized criminal groups.­Where an organized criminal group is",
      "content": "guilty of any offence under clauses (i), (ii), (iii) or (iv) of section 3, the term of imprisonment for each\nmember of such group involved in the commission of such offence shall not be less than ten years\nimprisonment and may extend to fourteen years where the purpose of trafficking of a victim is\nexploitative entertainment and shall also be liable to fine."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Repetition of commission of offences.­Whoever repeats the commission of an offence under",
      "content": "this Ordinance, the term of imprisonment may extend to fourteen years and the offender shall\nalso be liable to fine."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Compensation etc., to the victim",
      "content": "The Court trying an offence under this Ordinance may\nwhere appropriate direct:­\n(i) the competent Authorities of the Government, at any stage of the trial to allow or extend\nthe stay of the victim in Pakistan till such time, as the Court deems necessary;\n(ii) payment of compensation and expenses to the victim in accordance with section 545 of\nthe Code;\n(iii) Government to make arrangements for the shelter, food and medical treatment of victim\nbeing an unaccompanied child or a destitute woman."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Proceedings under the Ordinance to be in addition to and not in derogation of any other",
      "content": "law.­The Proceedings under the Ordinance shall be in addition to and not in derogation of any other\nproceedings initiated under any other law for the time being in force."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Offences to be cognizable etc.­All offences under the Ordinance shall be cognizable, non­",
      "content": "bailable, and non­compoundable as construed by the Code."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Investigation.­Notwithstanding anything contained in the Code or any other law for the time",
      "content": "being in force, the investigation of the offences under the Ordinance shall be carried out by only such\npersons or agencies as the specially empowered by the Government in that behalf."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Cognizance of offences etc.­No Court inferior to that of a Magistrate of the First Class shall",
      "content": "try an offence punishable under this Ordinance.\n(2) Notwithstanding anything contained in section 32 of the Code, it shall be lawful for a\nMagistrate of the First Class to pass any sentence authorised by this Ordinance."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Indemnity.­No suit prosecution or any other legal proceedings shall lie against the",
      "content": "Government or any other person exercising any power or performing any function under this\nOrdinance or the rules made thereunderfor anything done in good faith."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to make rules.­The Government may, by a notification in Official Gazette, make rules",
      "content": "to carry out the purposes of this Ordinance.\n_____"
    }
  ],
  "definitions": [
    {
      "term": "benefit",
      "definition": "monetary profit, proceeds or payment in cash or in kind;",
      "source_provision": "sec2"
    },
    {
      "term": "Code",
      "definition": "the Code of Criminal Procedure, 1898 (Act V of 1898);",
      "source_provision": "sec2"
    },
    {
      "term": "coercion",
      "definition": "the use of force, violence, physical restraint, deception, fraud or acts or circumstances not necessarily including physical force but calculated to have the same effect, such as the credible threat of force or of infliction of serious harm;",
      "source_provision": "sec2"
    },
    {
      "term": "exploitative entertainment",
      "definition": "all activities in connection with human sports or sexual practices or sex and related abusive practices;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "human trafficking",
      "definition": "obtaining, securing, selling, purchasing, recruiting, detaining, harbouring or receiving a person, notwithstanding his implicit or explicit consent, by the use of coercion, kidnapping, abduction, or by giving or receiving any payment or benefit, or sharing or receiving a share for such person's subsequent transportation out of or into Pakistan by any means whatsoever for any of the purposes mentioned in section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "organized criminal group",
      "definition": "a structured group of two or more persons, existing for a period of time and acting in concert with the aim of committing any offence, under this Ordinance, in order to obtain, directly or indirectly, any financial or other material benefit and includes a person knowingly receiving or disbursing benefits accruing from the commission of any offence in relation to human trafficking by an organized criminal group; and",
      "source_provision": "sec2"
    },
    {
      "term": "victim",
      "definition": "the person who is the subject of or against whom any offence under this Ordinance has been committed.",
      "source_provision": "sec2"
    }
  ]
}
