{
  "id": "pk-prevention-of-smuggling-of-migrants-act-2018",
  "type": "statute",
  "title": "Prevention Of Smuggling Of Migrants Act, 2018",
  "title_en": "Prevention Of Smuggling Of Migrants Act, 2018",
  "short_name": "POSOM",
  "status": "in_force",
  "issued_date": "2018-03-13",
  "in_force_date": "2018-03-13",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Nob5Y%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Prevention Of Smuggling Of Migrants Act, 2018 (XVII of 2018) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_ (1) This Act may be called the Prevention of\nSmuggling of Migrants Act, 2018.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once.\n(4) This Act shall apply to any person who commits an offence under section 3, 4, 5, 6 or 7\n___\nwhere\n(a)    the offence is committed within the territory of Pakistan;\n(b)    the offence is committed on board a vessel or aircraft that is registered under the laws\nof Pakistan at the time of commission of the offence; or\n(c)    the offence is committed outside the territory of Pakistan by a citizen of Pakistan."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_ ln this Act, unless there is anything repugnant in the subject or context, ___\n(a)    ‘benefit’ includes monetary profit, proceeds or payment in cash or in kind;\n(b)    ‘Code’ means the Code of Criminal Procedure, 1898;\n(c)    ‘Government’ means the Federal Government;\n(d)    ‘illegal entry’ means crossing borders through any port or place other than the\ndesignated port or place or without complying with the legal requirements for entering\ninto Pakistan or another country;\n(e)    ‘harbour’ shall have the same meaning as in section 52-A of the Penal Code;\n(f)    ‘migrant’ means a person who travels or intends to travel from one country to another;\n(g)    ‘organized criminal group’ means a structured group of two or more persons acting in\nconcert for benefit, with the aim of committing any offence under this Act;\n(h)        ‘Penal Code’ means the Pakistan Penal Code (Act XVL of 1860);\n(i)        ‘smuggling of migrants’ means the facilitation, for benefit, of illegal entry of another\nperson who, ___\n(i)        is a foreigner, as defined in clause (a) of the Foreigner’s Act, 1946 (XXXI of\n1946), into Pakistan or from Pakistan into a country of which the person is not\na national or a permanent resident; or\n(ii)       is a citizen of Pakistan, as specified in the Pakistan Citizenship Act, 1951 (II of\n1951), into another country of which the person is not a national or a permanent\nresident; and\n(j)        ‘smuggled migrant’ means any person in relation to whom an offence under section\n3,4,5,6 or 7 is committed irrespective of the fact whether or not the perpetrator is\nidentified, apprehended, prosecuted or convicted."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Punishment of smuggling of migrants",
      "content": "_Whoever intentionally engages in or attempts to\nengage in the smuggling of migrants shall be punished with imprisonment which may extend to 1[ten\nyears and with fine up to ten] million rupees."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Offences in relation to documents",
      "content": "_ (l) Whoever intentionally, for the purpose of getting\nbenefit, ___\n(a)        produces or attempts to produce a document for the purpose of enabling the smuggling\nof migrants; or\n(b)       procures, provides, or possesses, or attempts to procure, ‘provide, or possess a\ndocument for the purpose of enabling the smuggling of migrants,___\ncommits an offence.\n(2) Whoever commits or attempts to commit an offence under sub-section (1) shall be punished\nwith imprisonment which may extend to 1[ten years but shall not be less than three years and with fine\nup to five] million rupees."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Offence of harbouring illegal residents for benefit",
      "content": "_Whoever intentionally, for the\npurpose of getting benefit, harbours or attempts to harbour a person who is not a citizen or permanent\nresident of Pakistan and who has not complied with the necessary requirements for legally remaining\nin Pakistan commits an offence and shall be punished with imprisonment which may extend to 1[five\nyears but shall not be less than two years and with fine up to two] million rupees.\n1\nSubs. by Act No. X of 2025, ss.2-4."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Aggravated offences",
      "content": "_ The offences under sections 3, 4, and 5 shall be punished with\nimprisonment for a term which may extend to fourteen years but which shall not be less than 1[seven\nyears and with fine up to ten] million rupee in any of the following circumstances,___\n(a)        where the offence involves serious injury, life-threatening illness, or death, or other\ncircumstances that endanger, or are likely to endanger, the life or safety of the smuggled\nmigrant or another person;\n(b)        where the offence involves cruel, inhuman or degrading treatment of another person;\nor\n(c)        where the offence was committed as part of the activity of an organized criminal group."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Offence of abetment and criminal conspiracy",
      "content": "_(1) Whoever abets any of the offences\nunder section 3,4,5 or 6, shall be punished in accordance with Chapter V of the Penal Code.\n(2) Any person who is party to a criminal conspiracy to commit an offence under section 3,4,5\nor 6 shall be punished in accordance with Chapter V-A of the Penal Code."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Non",
      "content": "criminalization of smuggled migrants.___ Without prejudice to the applicability of\nother laws establishing criminal offences, smuggled migrants shall not become liable to criminal\nprosecution under this Act for the fact of having been the object of conduct set forth in section 3,4,5,6\nor 7 and may be a witness in the case."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Offences to be cognizable offences etc",
      "content": "_All offences under this Act shall be cognizable,\nnon-bailable, and non-compoundable as construed by the Code."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Cognizance of offences",
      "content": "Notwithstanding anything contained in the Code, 1[Special\nCourt (Central) constituted under the Pakistan Criminal Law Amendment Act, 1958 (XL of 1958)]\nshall try an offence punishable under this Act and may impose any punishment provided under the\nAct."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Investigating agency",
      "content": "_ The Federal Investigation Agency, or such other agency as may\nbe specially empowered by the Government through notification in the official Gazette, shall be\nresponsible for investigation of offences under this Act."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. National and international cooperation",
      "content": "_ The Federal Investigation Agency, or such\nother agency notified under section 11 may, ___\n(a)        co-operate with relevant authorities in Pakistan and in other countries of origin, transit\nand destination of smuggled migrants and make reciprocal arrangements after due\nadministrative process to share, request and receive information relating to smuggling\nof migrants; and\n(b)        maintain liaison with all relevant national or international authorities, organizations,\nbodies, associations and societies and represent Pakistan.\n1\nSubs. by Act No. X of 2025, ss.5-6."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Applicability of Code",
      "content": "_ The provisions of this Act shall have effect notwithstanding\nanything contained in the Code or any other law but, save as expressly provided in this Act, the\nprovision of the Code shall, in so far as they are not inconsistent with the provisions of this Act, apply\nto the proceedings under this Act."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Power to make rules",
      "content": "_ The Government may, by a notification in the official Gazette,\nmake rules to carry out the purposes of this Act."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. lndemnity",
      "content": "_ No suit prosecution or any other legal proceedings shall lie against the\nGovernment or any other person exercising any power or performing any function under this Act or\nthe rules made thereunder for anything done in good faith."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Act not in derogation",
      "content": "The provisions of this Act shall be in addition to and not in\nderogation of any other law for the time being in force."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Repeal",
      "content": "_ The Prevention of Smuggling of Migrants Ordinance, 2018 (VII of 2018) is\nhereby repealed.\n_____________\nRGN Dated. 21.04.2025"
    }
  ],
  "definitions": []
}
