{
  "id": "pk-prevention-of-trafficking-in-persons-act-2018",
  "type": "statute",
  "title": "Prevention of Trafficking In Persons Act, 2018",
  "title_en": "Prevention of Trafficking In Persons Act, 2018",
  "short_name": "POTIP",
  "status": "in_force",
  "issued_date": "2018-06-01",
  "in_force_date": "2018-06-01",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Nob50%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Prevention of Trafficking In Persons Act, 2018 (XXXIV of 2018) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Prevention of\nTrafficking in Persons Act, 2018.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context, —\n(a)        “child” means a person under eighteen years of age;\n(b)        “Code” means the Code of Criminal Procedure, 1898 (V of 1898);\n(c)        “Government” means the Federal Government;\n(d)        “Penal Code” means the Pakistan Penal Code, I860 (XLV of 1860);\n(e)        “prescribed” means prescribed by the rules made under this Act;\n(f)        “Provincial Government” means the Government of a Province; and\n1\n[(fa) “sexual exploitation” means any actual or attempted abuse of position of\nvulnerability or trust for sexual purpose, including but not limited to profiting\nmonetarily or any other gain for the sexual exploitation of another;]\n(g)        “victim” means a person against whom an offence under this Act is committed\nregardless of whether the perpetrator is identified, apprehended, prosecuted or\nconvicted."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Trafficking in persons",
      "content": "(1) Any person who recruits, harbours, transports, provides or\nobtains another person, or attempts to do so, for compelled labour 1[or organized beggary or sexual\nexploitation] through the use of force, fraud or coercion, commits an offence of trafficking in persons\nand shall be punished with imprisonment which may extend to 1[ten years and fine which may extend\nto one million rupees].\n1\nIns. and Subs. by Act No. IX of 2025, ss.2-3.\n(2) If the offence of trafficking in persons under sub-section (1) is committed against a child or\na woman, the person who commits the offence shall be punished with imprisonment which may extend\nto 1[fourteen years and with fine which may extend upto two million rupees].\n(3) In this section:\n(a)        “coercion” means use or threat of use of force, or other forms of nonviolent use\nof force including—\n(i)         threat of harm to or physical restraint of any person;\n(ii)       any scheme, plan or pattern intended to cause a person to believe that\nfailure to perform an act would result in serious harm to or physical\nrestraint of any person;\n(iii)      threat due to the vulnerable position of a person; or\n(iv)       psychological pressure; 1[*]\n(b)        “compelled labour” includes involuntary servitude, slavery or practices similar\nto slavery, or debt bondage and forced labour 1[; and]\n1\n[(c)   “organized beggary” includes an act of a person to allure, entice or coerce a\nperson intentionally, knowingly, by use of force, fraud or without fraudulent\nintention to indulge or to be indulged in soliciting or receiving alms directly,\nindirectly or on any pretext and includes,__\n(i)        soliciting or receiving alms at a public place, under any pretence visibly\nin a form of beggary;\n(ii)       having no visible means of subsistence and wandering about or\nremaining in any public place in such condition or manner which raise\na presumption that the person doing so subsists by soliciting or receiving\nalms;\n(iii)      enters on any private premises for the purposes of soliciting or receiving\nalms;\n(iv)       exposes or exhibits with the object of obtaining or extorting alms, any\nsore, wound, injury, deformity or disease, whether of human being or of\nan animal; or\n(v)        allows oneself to be used as an exhibit for the purpose of soliciting or\nreceiving alms.]\n1\n[(4) A victim’s consent or consent of guardian on behalf of minor victim to, or acquiescence\nin, any of the acts constituting the offence of trafficking in persons as provided in sub-section (1), shall\nbe irrelevant and shall not be considered a defence in any proceeding as to the conduct that would\notherwise constitute an offence under this Act.]\n1\nSubs., omitted and added by Act No. IX of 2025, s.3."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Aggravating circumstances",
      "content": "Where an offence under section 3 involves:\n(a)        serious injury, life-threatening illness or death of the victim or another person;\n(b)        activity of an organized criminal group;\n(c)        confiscation or destruction of any travel document of the victim; or\n(d)        repetition of the offence by the same offender;\nthe offender shall be punished with imprisonment 1[of not less than fourteen years] and fine which\nmay extend to two million rupees.\nExplanation.— In this section, ‘organized criminal group’ means a structured group of two or\nmore persons, existing for a period of time and acting in concert with the aim of committing any\noffence under this Act, in order to obtain, directly or indirectly, any financial or other material benefit."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Abetment and criminal conspiracy",
      "content": "(l) Any person who participates as an accomplice,\naids, or abets an offence under section 3 or section 4, shall be punished in accordance with Chapter V\nof the Penal Code.\n(2) Any person who is a party to a criminal conspiracy to commit an offence under section 3\nor section 4, shall be punished in accordance with Chapter V-A of the Penal Code.\n[6. Victims of trafficking in persons. — Without prejudice to any other defence available\n1\nunder any law, a victim of trafficking in persons shall not be criminally or otherwise liable for acts and\nomissions that were the direct result of having been trafficked or were in obedience to the order made\nby the trafficker in relation thereto, but may become witness in the case:\nProvided that the acts done by the victim of trafficking in persons were direct result of force,\nfraud or coercion by the Trafficker.]"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Presumption in case of child victim",
      "content": "Where the victim is a child, the prosecution may\nnot prove actual use of force, fraud or coercion and the Court may not consider the consent of the\nvictim, his parent or guardian as a defence."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Investigating agency",
      "content": "(1) Subject to sub-section (2), the police shall investigate an\noffence under this Act.\n(2) If the offence involves transportation of the victim into or out of Pakistan and it constitutes\npart of the transaction constituting the offence, the Federal Investigation Agency shall investigate the\noffence."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Cognizance",
      "content": "An offence under this Act shall be cognizable 1[, non-compoundable] and\nnon-bailable under the Code.\n1\nSubs. and ins. by Act No. IX of 2025, ss.4-6.\n[10. Cognizance of offences. — (1) Notwithstanding anything contained in the Code, a\n1\nMagistrate of the First Class shall try an offence punishable under this Act and may impose any\npunishment provided under this Act:\nProvided that if an offence involves transportation of the victim into or out of Pakistan and it\nconstitutes part of the transaction constituting the offence, the Special Court (Central) constituted under\nunder this Act and may impose any punishment provided under this Act.\n(2) Where in any trial before a Special Court of an offence punishable under sections 3, 4 and\n5, it is proved that an accused person has accepted or obtained, or has agreed to accept for himself or\nany other person, any financial or material benefit from a victim or any person on his behalf, it shall\nbe presumed unless the contrary is proved, that he accepted or obtained, that financial or material\nbenefit, or as the case may be, as such as is mentioned in sections 3, 4 and 5.]"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Safety of victims and witnesses of offences",
      "content": "(1) The Government or a Provincial\nGovernment may, in the prescribed manner, take appropriate measures to ensure that a victim, witness\nof an offence under this Act or any other related person is provided adequate protection, if safety of\nthe victim, witness or the person is at risk.\n(2) When it is necessary to safeguard the physical safety of a victim or witness of an offence\nunder this Act, the Government or a Provincial Government may, in the prescribed manner, take\nnecessary measures to relocate victim or witness or to limit the disclosure of name of the victim or\nwitness, address and other identifying personal information or both."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Protection of victims and witnesses by the Court",
      "content": "(1) The rules made under this Act\nmay specify circumstances in which the Court may—\n(a)        conduct the Court proceedings in camera;\n(b)        seal or restrict access to record of the Court proceedings;\n(c)         permit evidence of a victim or a witness behind a screen or similar adequate\nmeans out of view of the accused, or through a video link or the use of other\ncommunications technology; or\n(d)        use a pseudonym of a victim or a witness."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Compensation to victims",
      "content": "Where an offender is convicted of an offence under this Act,\nthe Court may direct payment of compensation to the victim under section 545 of the Code."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Awareness raising and prevention",
      "content": "The Government may—\n(a)        develop and disseminate information programmes to increase public awareness\nregarding offences of trafficking in persons and dangers to victims;\n(b)        promote and strengthen development programmes and national and\ninternational cooperation in order to address the root-causes of trafficking in\npersons, and the special vulnerabilities of women and children;\n1\nSubs. by Act No. IX of 2025, s.7.\n(c)     establish procedures to collect data and to promote research in relation to\ntrafficking in persons, the factors that cause trafficking in persons, and on the\nbest practices to prevent trafficking in persons, prosecution of offenders, and\nprotection of victims."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Power to make rules",
      "content": "(1) The Government or a Provincial Government may, by a\nnotification in the official Gazette, make rules to carry out the purposes of this Act.\n(2) if the rules made by a Provincial Government are inconsistent with the rules, at any time,\nmade by the Government, the rules of the Government shall prevail over the rules of the Provincial\nGovernment."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Repeal",
      "content": "(1) The Prevention and Control of Human Trafficking Ordinance, 2002 (LIX\nof 2002) is hereby repealed.\n(2) Notwithstanding repeal of the Prevention and Control of Human Trafficking Ordinance,\n2002 (LIX of2002), any act done, prosecution or proceedings undertaken or the rule made under the\nrepealed Ordinance shall deemed to have been done, undertaken or made under this Act.\n(3) In the Penal Code, section 369-A shall be omitted.\n______________\nRGN 23.04.2025"
    }
  ],
  "definitions": [
    {
      "term": "child",
      "definition": "a person under eighteen years of age;",
      "source_provision": "sec2"
    },
    {
      "term": "Code",
      "definition": "the Code of Criminal Procedure, 1898 (V of 1898);",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "Penal Code",
      "definition": "the Pakistan Penal Code, I860 (XLV of 1860);",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by the rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Provincial Government",
      "definition": "the Government of a Province; and 1 [(fa) “sexual exploitation” means any actual or attempted abuse of position of vulnerability or trust for sexual purpose, including but not limited to profiting monetarily or any other gain for the sexual exploitation of another;]",
      "source_provision": "sec2"
    },
    {
      "term": "victim",
      "definition": "a person against whom an offence under this Act is committed regardless of whether the perpetrator is identified, apprehended, prosecuted or convicted.",
      "source_provision": "sec2"
    }
  ]
}
