{
  "id": "pk-price-control-and-prevention-of-profiteering-and-hoarding-act-1977",
  "type": "statute",
  "title": "Price Control and Prevention of Profiteering and Hoarding Act, 1977",
  "title_en": "Price Control and Prevention of Profiteering and Hoarding Act, 1977",
  "short_name": "PCAPO",
  "status": "in_force",
  "issued_date": "1977-05-20",
  "in_force_date": "1977-05-20",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUZWVp-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Price Control and Prevention of Profiteering and Hoarding Act, 1977 (XXIX of 1977) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.―(1) This Act may be called the Price Control",
      "content": "and Prevention of Profiteering and Hoarding Act, 1977.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(a)         “Controller-General” means the Controller-General of Prices and Supplies\nappointed by the Federal Government, and includes any Deputy or Assistant\nController-General of Prices and Supplies so appointed, and any other officer\nauthorised by the Federal Government to exercise all or any of the powers of\nthe Controller-General under this Act;\n(b)         “dealer” means a person carrying on, whether in conjunction with any other\nbusiness or not, the business of selling any essential commodity, whether\nwholesale or retail;\n(c)         “essential commodity” means any of the commodities or classes of\ncommodities mentioned in the Schedule;\n(d)         “importer” means a person importing into Pakistan, whether under an import\nlicence granted by the Federal Government or otherwise, any essential\ncommodity from outside Pakistan, but does not include a person importing any\nessential commodity as part of his personal baggage;\n(e)         “notified order” means an order notified in the official Gazette;\n(f)         “producer” means a person engaged in the manufacture or production of any\nessential commodity.\n1\nFor Statement of Objects and Reasons, see Gaz. of P., 1977, Ext. Pt. III, p. 3539."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Powers to make orders etc.―(1) The Federal Government, so far as it appears to it to",
      "content": "be necessary or expedient for securing equitable distribution of an essential commodity and its\navailability at fair prices, may, by notified order, provide for regulating the prices, production,\nmovement, transport, supply, distribution, disposal and sale of the essential commodity and for the\nprice to be charged or paid for it at any stage of transaction therein.\n(2) Without prejudice to the generality of the powers conferred by sub-section (1), an order\nmade thereunder may provide—\n(a)     for controlling the prices at which any essential commodity may be bought or\nsold in any area;\n(b)     for regulating the       production,   treatment    and    keeping    of   any\nessential commodity;\n(c)     for regulating, by licences, permits or otherwise, the transport, movement and\ndistribution between the Provinces of an essential commodity;\n(d)     for prohibiting the withholding of sale of an essential commodity ordinarily\nkept for sale; .\n(e)     for requiring any person holding stock in a Province of an essential\ncommodity to sell in another province the whole or a specified part of the\nstock at such price, to such persons or class of persons and under such\nconditions as may be specified in the order;\n(f)    for fixing the maximum quantity of any essential commodity which may at\nany time be possessed by a producer or dealer;\n(g)     for collecting any information or statistics with a view to regulating or\nprohibiting any of the matters aforesaid;\n(h)     for requiring persons engaged in any of the matters aforesaid in respect of any\nessential commodity to maintain and produce for inspection such books,\naccounts and records relating to their business, and to furnish such\ninformation relating thereto, as may be specified in the order;\n(i)     for requiring every importer, producer and dealer to mark the\nessential commodities with the sale prices and to exhibition his premises a\nprice list of the essential commodities held by him for sale; and\n(j)     for any incidental and supplementary matters, including in particular the\nentering and search of premises, vehicles, vessels and aircraft, the seizure by\na person authorised to make such search of any articles in respect of which\nsuch person has reason to believe that a contravention of the order has been,\nis being or is about to be committed, or any records connected therewith, the\ngrant or issue of licences, permits or other documents and the charging of fees\ntherefor."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Delegation of powers. The Federal Government may, by notified order, direct that any",
      "content": "power conferred on it by or under this Act shall, in relation to such matters and subject to such\nconditions, if any, as may be specified in the direction, be exercisable also by—\n(a)        such officer or authority subordinate to the Federal Government; or\n(b)        such Provincial Government or such officer or authority subordinate to a\nProvincial Government, as may be specified in the direction."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Effect of orders inconsistent with other enactments. Any order made under section 3",
      "content": "shall have effect notwithstanding anything inconsistent therewith contained in any enactment other\nthan this Act or any instrument having effect by virtue of any enactment other than this Act."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Fixation of prices",
      "content": "(1) Subject to such general or special orders as may be made by the\nFederal Government under section 3, the Controller- General may, by notification in the official\nGazette, fix specific maximum prices of essential commodities and different prices may be\nfixed for different localities or for different classes or categories of any essential\ncommodities.\n(2) No person shall sell or re-sell any essential commodity at a price higher than the\nmaximum price so fixed.\n1\n[(2A) Every dealer, importer or producer of an essential commodity the maximum price of\nwhich is not for the time being fixed by a notification issued under sub-section (1) shall, if so\nrequired by the Controller-General by an order in writing or by a notified order, inform the\nController-General by notice in writing forwarded to him by registered post acknowledgement\ndue of his intention to raise the price of the essential commodity and shall not raise the price.\n(a)        before the expiration of thirty days from the day on which the notice\nis received by the Controller-General ; or\n(b)\nat any time thereafter, if, within the said period, the Controller-General\ncommunicates to him an objection to the price being raised.\n(2B) A notice under sub-section (2A) shall specify the amount by which the price of the\nessential commodity is proposed to be raised and the reasons therefore and be accompanied by the\nlatest annual audited accounts of the dealer, importer or producer.]\n(3) Every dealer, importer, or producer shall supply to the Controller-General such\ninformation regarding the production, importation, purchase, stock, sale or distribution of any of the\nessential commodities as the Controller-General may, by an order in writing or by a notified order,\nrequire.\n2\n[6A.Appeal.—(1) Any producer, dealer or importer, if aggrieved by an order of a Controller\nGeneral, may prefer an appeal within three working days of the order to an appellate committee\ncomprising of federal secretary of the division to which business of industries stands allocated and\ntwo federal secretaries nominated by the Cabinet Division in case of the Federal Government and an\nappellate committee comprising of three provincial secretaries including secretary of the department\nto which business of industries stands allocated, constituted by chief secretary of the province\nconcerned in case of a province or district thereof, as the case maybe.\n1\nSubs. by the Price Control and Prevention of Profiteering and Hoarding (Amdt.) Ordinance, 1979 (64 of 1979), s. 2.\n2\nIns by the Price Control and Prevention of Profiteering and Hoarding (Amendment) Act, 2023, (Act No. LXIV of 2023), s.2.\n(2) An appeal under sub-section (l) shall be decided by the concerned appellate committee\nwithin five working days after providing the appellant an opportunity of being heard.]"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Penalties",
      "content": "(1) Any person who contravenes any order made under section 3 or a\nnotification issued, or order made, under section 6 shall be punishable with imprisonment for a term\nwhich may extend to three years and with fine which may extend to one lac rupees:,\nProvided that, if a person convicted for an offence punishable under this sub-section is again\nconvicted for such offence, the term of imprisonment awarded to him shall not be less than one year.\n(2) If the order made under section 3 so provides, any Court trying any contravention of such\norder may direct that any property in respect of which the Court is satisfied that the order has been\ncontravened shall be forfeited to the Federal Government."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Attempts and abetments. Any person who attempts to contravene, or abets a",
      "content": "contravention of, any order made under section 3 shall be deemed to have contravened the order:\nProvided that a person who buys an essential commodity for his personal\nconsumption or use and not for sale shall not be deemed to have abetted the contravention of an\norder controlling the price at which the essential commodity may be sold."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Offences by corporations. If the person contravening an order made under section 3 is a",
      "content": "company or other body corporate or a partnership or other body of individuals, every director,\nmanager, secretary, member or other officer or agent thereof shall, unless he proves that the\ncontravention took place without his knowledge or that he exercised all due diligence to prevent such\ncontravention, be deemed to be guilty of such contravention."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. False statements. If any person",
      "content": "(i)         when required by an order made under section 3 to make a statement or\nfurnish any information makes any statement or furnishes any statement\nwhich is false in any material particular and which he knows or has\nreasonable cause to believe to be false, or does not believe to be true; or\n(ii)        makes any statement as aforesaid in any book, account, record,\ndeclaration, return or other document which he is required by any such order\nto maintain or furnish,\nhe shall be punishable with imprisonment for a term which may extend to three years, or with fine,\nor with both.\n1[11. Power to try offences summarily.—(1) Offences punishable under this Act shall be\ntried by a Special Magistrate appointed under section 14A of the Code of Criminal Procedure, 1898,\nin a summary manner as provided in sections 262 to 265 of the said Code.\nProvided that sub-section (2) of section 262 shall not apply.\n1\nSubs by Act III of 06, s. 14.\n(2) If a Special Magistrate has reason to believe that any offence punishable under this Act\nhas been committed by any person, he may enter the place or premises where the offence has been\ncommitted and try the offence on the spot.]"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to amend Schedule. The Federal Government may, by notification in official",
      "content": "Gazette, amend the Schedule so as to add to, or omit from it any commodity or class of\ncommodities."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Presumption as to order",
      "content": "(1) No order made by any authority other than a Court\nin exercise of any power conferred by or under this Act shall be called in question in any Court.\n(2) Where an order purports to have been made and signed by an authority in exercise of\nany power conferred by or under this Act, a Court shall, within the meaning of the Evidence\nAct, 1872 (L of 1872) presume that such order was so made by that authority."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Burden of proof in certain cases. Where any person is prosecuted for contravening",
      "content": "any order made under section 3 which prohibits him from doing an act or being in\npossession of a thing without lawful authority or without a permit, licence or other document, the\nburden of proving that he has such authority, permit, licence or other document shall be on\nhim."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Protection of action taken under the Act",
      "content": "(1) No suit, prosecution or other legal\nproceeding shall lie against any person for anything which is in good faith done or intended to be\ndone in pursuance of any order made under section 3.\n(2) No suit or other legal proceeding shall lie against the Government for any damage caused\nor likely to be caused by anything which is in good faith done or intended to be done in pursuance\nof any order made under section 3."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. [Repeal.] Omitted by the Federal laws (Revision and Declaration) Ordinance, 1981",
      "content": "(XXVII of 1981), s. 3 and Sch., II.\n1[SCHEDULE\n(See Section 2 and section 12)"
    }
  ],
  "definitions": [
    {
      "term": "Controller-General",
      "definition": "the Controller-General of Prices and Supplies appointed by the Federal Government, and includes any Deputy or Assistant Controller-General of Prices and Supplies so appointed, and any other officer authorised by the Federal Government to exercise all or any of the powers of the Controller-General under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "dealer",
      "definition": "a person carrying on, whether in conjunction with any other business or not, the business of selling any essential commodity, whether wholesale or retail;",
      "source_provision": "sec2"
    },
    {
      "term": "essential commodity",
      "definition": "any of the commodities or classes of commodities mentioned in the Schedule;",
      "source_provision": "sec2"
    },
    {
      "term": "importer",
      "definition": "a person importing into Pakistan, whether under an import licence granted by the Federal Government or otherwise, any essential commodity from outside Pakistan, but does not include a person importing any essential commodity as part of his personal baggage;",
      "source_provision": "sec2"
    },
    {
      "term": "notified order",
      "definition": "an order notified in the official Gazette;",
      "source_provision": "sec2"
    },
    {
      "term": "producer",
      "definition": "a person engaged in the manufacture or production of any essential commodity. 1 For Statement of Objects and Reasons, see Gaz. of P., 1977, Ext. Pt. III, p. 3539.",
      "source_provision": "sec2"
    }
  ]
}
