{
  "id": "pk-prisons-act-1894",
  "type": "statute",
  "title": "Prisons Act, 1894",
  "title_en": "Prisons Act, 1894",
  "short_name": "Prisons Act, 1894",
  "status": "in_force",
  "issued_date": "1894-03-21",
  "in_force_date": "1894-03-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cZc%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Prisons Act, 1894 (IX of 1894) published by The Pakistan Code (Criminal Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Title, extent and commencement",
      "content": "(1) This Act may be called the Prisons Act, 1894.\n3\n[(2) It extends to the whole of Pakistan.]\n(3) It shall come into force on the first day of July, 1894.\n(4) Nothing in this Act shall apply to civil jails in 4[Sind and the 5[Karachi Division]] and\nthose jails shall continue to be administered under the provisions of Section 9 to 16 (both inclusive)\nof 6Bombay Act, II of 1874, as amended by subsequent enactments."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Definitions. In this Act",
      "content": "_\n(1)        “prison” means any jail or place used permanently or temporarily under the\ngeneral or special orders of a 2[Provincial Government] for the detention of\nprisoners, and includes all lands and buildings appurtenant thereto, but does\nnot include-\n1\nFor Statement of Objects and ‘Reasons, see Gazette of India, 1894, Pt. V, p. 14 ; for Report of the Select Committee, see ibid., p. 63, and for\nProceedings in Council, see ibid., Pt. VI, pp.l0, 21,93,126 and 139.\nThis Act has been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.W.F.P., subject to certain\nmodifications; see N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950.\nIt has been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950); and applied in the Federated\nAreas of Baluchistan, see Gaz. of India, 1937, Pt. I, p. 1499.\nIt has been extended to the Excluded Area of Upper T1inawal other than Phulera by the N.W.F.P., (Uper Tanawal) (Excluded Area) Laws Regulation,\n1950 and declared to be in force in that area with effect from 1st June, 1951, see NW.F.P., Gazette, Extraordinary, dated 1st June,"
    },
    {
      "provision_ref": "sec3a",
      "section": "3A",
      "title": "Section 3A. It has been amended in its application to the Province of West Pakistan by West Pakistan Act 41 of 1958.",
      "content": "The Act, as in force in the North-West Frontier Province immediately before the commencement of N.W.F.P. Regulation No. II of 1974 has been\napplied to the Provincially Administered Tribal Areas of Chitral, Dir, Kalam, Swat and Malakand Protected Area by N.W.F.P., Regulation, No. II of\n1974, s. 3.\nThis Act has been amended in its application to the province of Sind by the Sind Act No. 17 of 1975, s. 3 and 2nd Sch.\nThis Act has been amended to the extent of Islamabad Capital Territory, see Ordinance No. 27 of 1981, S. 5 and Sch. IV.\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “the\nProvinces and the Capital of the Federation” which had been subs. by A.O. 1949, Arts. 3(2) and 4, for “British India.”.\n3\nSubs. by Ord. 21 of 1960, s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for the existing sub-section (2), as amended by the Federal Laws\n(Revision and Declaration) Act, 1951 (26 of 1951).\n4\nSubs. by A. O., 1949, Sch. fur “the Presidency of-Bombay outside the City of Bombay”.\n5\nSubs. by A. O., 1964, Art 2 and Sch., for “Federal Tcrritory of Karachi” which had been subs. by the Repealing and Amending Ordinance, 1961 (1 of\n1961), s. 3 and 2nd Sch., for “Capital of the Fedoration”:\n6\n(a)         any place for the confinement of prisoners who are exclusively in the\ncustody of the police ;\n(b)         any place specially appointed by the 1[Provincial Government] under\nSection 541 of the 2[Code of Criminal Procedure, 1898 (Act V of\n1898)] ; or\n(c)         any place which has been declared by the 1[Provincial Government] by\ngeneral or special order, to be a subsidiary jail ;\n(2)        “criminal prisoner” means any prisoner duly committed to custody under the\nwrit, warrant or order of any Court or authority exercising criminal\njurisdiction, or by order of a Court-martial ;\n(3)        “convicted criminal prisoner” means any criminal prisoner under sentence of a\nCourt or Court-martial, and includes a person detained in prison under the\nprovisions of Chapter VIII of the 2[Code of Criminal Procedure, 1898 (Act V\nof 1898)] or under the 2[Prisoners Act, 1900 (III of 1900)] ;\n(4)        “civil prisoner” means any prisoner who is not a criminal prisoner:\n(5)        “remission system” means the rules for the time being in force regulating the\naward of marks to and the consequent shortening of sentences of, prisoners in\njails :\n(6)        “history-ticket” means the ticket exhibiting such information as is required in\nrespect of each prisoner by this Act or the rules thereunder.:\n(7)        “Inspector-General” means the Inspector-General of Prisons :\n[(7-A) “Deputy Inspector-General” means the Deputy Inspector-General of Prison] ;\n(8)        “Medical Subordinate” means an Assistant Surgeon, Apothecary or qualified\nHospital Assistant : and\n(9)        “prohibited article” means an article the introduction or removal of which into\nor out of a prison is prohibited by any rule under this Act.\n1\nSubs. by: A. 0.,1937, for “L. G.”.\n2\nSubs. by Ord. XXVII of 1981, s. 5 and Sch. IV (only to the extent of Islamabad. Capital Territory)."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Accommodation for prisoners. The 1[Provincial Government] shall provide, for the",
      "content": "prisoners in the territories under such Government, accommodation in prisons constructed and\nregulated in such manner as to comply with the requisitions of this Act in respect of the separation of\nprisoners."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Inspector",
      "content": "General. An Inspector-General2 shall be appointed for the territories subject to\n1\neach [Provincial Government], and shall exercise, subject to the orders of the Provincial\nGovernment, the general control and superintendence of all prisons situated in the territories under\nsuch Government.\n3"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Officers of prisons. For every prison there shall be a Superintendent, a Medical Officer",
      "content": "(Who may also be the Superintendent), a Medical Subordinate, a Jailer and such other officers as the\n1\n[Provincial Government] thinks necessary.\n4\n******"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Temporary accommodation for prisoners. Whenever it appears to me inspector General",
      "content": "that the number of prisoners in any prison is greater than can conveniently or safely be kept therein,\nand it is not convenient to transfer the excess number to some other prison, or whenever from the\noutbreak of epidemic disease a within any prison, or for any other reason, it is desirable to provide\nfor the temporary shelter and safe custody of any prisoners, provision shall be made, by such officer\nand in such manner as the 1[Provincial Government] may direct, for the shelter and safe custody in\ntemporary prisons of so many of the prisoners as cannot be conveniently or safely kept in the prison.\nor whenever from the outbreak of epidemic disease within any prison, or for any other reason, it is\ndesirable to provide for the temporary shelter and safe custody of any prisoners,\nprovision shall be made, by such officer and in such manner as the 1[Provincial Government] may\ndirect, for the shelter and safe custody in temporary prisons of so many of the prisoners as cannot be\nconveniently or safely kept in the prison.\nGenerally"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Control and duties of officers of prisons. All officers of a prison shall obey the directions",
      "content": "of the Superintendent; all officers subordinate to the Jailer shall perform such duties as may be\nimposed on them by the Jailer with the sanction of the Superintendent or be prescribed by rules\nunder Section [59]5."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Officers not to have business dealings with prisoners. No officer of a prison shall sell or",
      "content": "let, nor shall any person in trust for or employed by him sell or let, or derive any benefit from, selling\nor letting, any article to any prisoner or have any money or other business dealings directly or\nindirectly with any prisoner.\nl\nSubs. by A. O.,1937, for “L. G.”.\n2\nFor notification appointing an Inspector General for the N.W.F.P., see Gazette of India , 1901, Pt. II, p. 1305.\n3\nA further proviso has been added to s.6 in its application to the Punjab by the Prisons (Punjab Amdt.) Act, 1926 (Punjab 9 of 1926), s.2.\n4\nThe Original proviso as amended by A.O. 1937, omitted by A.O., 1949, Sch.\n5\nSubs. by A. O., 1937, for “60”."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Officers not to be interested in prison contracts. No officer of a prison shall, nor shall",
      "content": "any person in trust for or employed by him, have any interest, direct or indirect, in any contract for\nthe supply of the prison: nor shall he derive any benefit, directly or indirectly, from the sale or\npurchase of any article on behalf of the prison or belonging to a prisoner.\nSuperintendent"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Superintendent.___ (1) Subject to the orders of the Inspector",
      "content": "General, the Superintendent\nshall manage the prison in all matters relating to discipline, labour, expenditure, punishment and\ncontrol.\n(2) Subject to such general or special directions as maybe given by the 1[Provincial\nGovernment]; the Superintendent of a prison other than a central prison or a prison situated in a\npresidency- town shall obey all orders not inconsistent with this Act or any rule thereunder which\nmay be given respecting the prison by the District Magistrate, and shall report to the Inspector-\nGeneral all such orders and the action taken thereon."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Records to be kept by Superintendent. The Superintendent shall keep’, or cause to be",
      "content": "kept, the following records:__\n(1) a register of prisoners admitted ;\n(2) a book showing when each prisoner is to be released;\n(3) a punishment-book for the entry of the punishments inflicted on prisoners for prison\noffences ;\n(4) a visitors’ book for the entry of any observations made by the visitors touching any\nmatters connected with the administration of the prison ;\n(5) a record of the money and other articles taken from prisoners ;\nand all such other records as may be prescribed by rules under Section 59.1 * * *\nMedical Officer"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Duties of Medical Officer. Subject to the control of the Superintendent, the Medical",
      "content": "Officer shall have charge of the sanitary administration of the prison, and shall perform such 2duties\nas may be prescribed by rules made by the 3[Provincial Government] under Section 4[59]."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Medical Officer to report in certain cases. Whenever the Medical Officer has reason to",
      "content": "believe that the mind of a prisoner is, or is likely to be, injuriously affected by the discipline or\ntreatment to which he is subjected, the Medical Officer shall report the case in writing to the\nSuperintendent, together with such observations as he may think proper.\nThis report, with the orders of the Superintendent thereon, shall forthwith be sent to the\nInspector-General for information.\n1\nSubs.ibid., for “L.G.”."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Report on death of prisoner. On the death of any prisoner, the Medical Officer shall",
      "content": "forthwith record in a register the following particulars, so far as they can be ascertained, namely:\n(1)         the day on which the deceased first complained of illness or was observed to\nbe ill,\n(2)         the labour, if any, on which he was engaged on that day,\n(3)         the scale of his diet on that day,\n(4)         the day on which he was admitted to hospital,\n(5)         the day on which the Medical Officer was first informed of the illness,\n(6)         the nature of the disease,\n(7)         when the deceased was last seen before his death by the Medical Officer or\nMedical Subordinate,\n(8)         when the prisoner died, and\n(9)     (in cases where a post-mortem examination is made) an account of the\nappearances after death,\ntogether with any special remarks that appear to the Medical Officer to be required.\nJailer"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Jailer",
      "content": "_(1) The Jailer shall reside in the prison, unless the Superintendent permits him in\nwriting to reside elsewhere.\n(2) The Jailer shall not, without the Inspector-General's sanction in writing, be concerned in\nany other employment."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Jailer to give notice of death of prisoner. Upon the death of a prisoner, the Jailer shall",
      "content": "give immediate notice thereof to the Superintendent and the Medical Subordinate."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Responsibility of Jailer. The Jailer shall be responsible for the safe custody of the",
      "content": "records to be kept under Section 12, for the commitment warrants and all other documents confided\nto his care, and for the money and other articles taken from prisoners."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Jailer to be present at night. The Jailer shall not be absent from the prison for a night",
      "content": "without permission in writing from the Superintendent; but, if absent without leave for a night from\nunavoidable necessity, he shall immediately report the fact and the cause of it to the Superintendent."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Powers of Deputy and Assistant Jailers. Where a Deputy Jailer or Assistant Jailer is",
      "content": "appointed to a prison, he shall, subject to the orders of the Superintendent, be competent to perform\nany of the duties, and be subject to all the responsibilities, of a Jailer under this Act or any rule\nthereunder.\n1\nThe words and figures “or section 60” rep. by A. 0., 1937.\n2\nFor rules as to Medical Officer's duties under s. 13, see different local Rules and Orders.\n3\nSubs. by A. O., 1937, for “L. G.”.\n4\nSuhs. ibid., for “60”.\nSubordinate Officers"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Duties of gate",
      "content": "keeper. The officer acting as gate-keeper, or any other officer of the\nprison, may examine anything carried in or out of the prison, and may stop and search or cause to be\nsearched any person suspected of bringing any prohibited article into or out of the prison, or of\ncarrying out any property belonging to the prison, and, if any such article or property be found, shall\ngive immediate notice thereof to the Jailer."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Subordinate Officers not to be absent without leave. Officers subordinate to the Jailer",
      "content": "shall not be absent from the prison without leave from the Superintendent or from the Jailer."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Convict officers. Prisoners who have been appointed as officers of prisons shall be",
      "content": "deemed to be Public servants within the meaning of the Pakistan Penal Code (Act XLV of 1860).\n__________\nADMISSION, REMOVAL AND DISCHARGES OF PRISONERS"
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Prisoners to be examined on admission",
      "content": "_(1) Whenever a prisoner is admitted into\nprison, he shall be searched, and all weapons and prohibited articles shall be taken from him.\n(2) Every criminal prisoner shall also, as soon as possible after admission, be examined under\nthe general or special orders of the Medical Officer, who shall enter or cause to be entered in a book,\nto be kept by the Jailer, a record of the state of the prisoner's health, and of any wounds or marks on\nhis person, the class of labour he is fit for if sentenced to rigorous imprisonment, and any\nobservations which the Medical Officer thinks fit to add.\n(3) In the case of female prisoners the search and examination shall be carried out by the\nmatron under the general or special orders of the medical Officer."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Effects of prisoners. All money or other articles in respect whereof no order of a",
      "content": "competent Court has been made, and which may with proper authority be brought into the prison by\nany criminal prisoner or sent to the prison for his use, shall be placed In the custody of the Jailer."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Removal and discharge of prisoners",
      "content": "_(1) All prisoners, previously to being removed\nto any other prison, shall be examined by the Medical Officer.\n(2) No prisoner shall be removed from one prison to another unless Medical Officer certifies\nthat the prisoner is free from any illness rendering him unfit for removal.\n(3) No prisoner shall be discharged against his will from prison, if laboring under any acute\nor dangerous distemper, nor until, In the opinion of the Medical Officer; such discharge is safe."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Separation of prisoners. The requisitions of this Act with respect to the separation of",
      "content": "prisoners are as follows:-\n(1) in a prison containing female as well as male prisoners, the females shall be imprisoned in\nseparate buildings, or separate parts of the same building, in such manner as to prevent their seeing,\nor conversing or holding any intercourse with, the male prisoners :\n(2) in a prison where male prisoners under the age of 1[twenty-one] are confined, means shall\nbe provided for separating them altogether from the other prisoners and for separating those of them\nwho have arrived at the age of puberty from those who have not:\n(3) unconvicted criminal prisoners shall be kept apart from convicted criminal prisoners; and\n(4) civil prisoners shall be kept apart from criminal prisoners."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Association and segregation of prisoners. Subject to the requirements of the last",
      "content": "foregoing section convicted criminal prisoners may be confined either in association or individually\nin cells or partly in one way and partly in the other."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Solitary confinement. No cell shall be used for solitary confinement unless it is",
      "content": "furnished with the means of enabling the prisoners to communicate at any time with an officer of the\nprison, and every prisoner so confined in a cell for more than twenty-four hours, whether as a\npunishment or otherwise, shall be visited at least once a day by the Medical Officer or Medical\nSubordinate."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Prisoners under sentence of death",
      "content": "_(1) Every prisoner under sentence of death shall,\nimmediately on his arrival in the prison after sentence, be searched by, or by order of, t he Jailer and\nall articles shall be taken from him which the Jailer deems it dangerous or independent to leave in his\npossession.\n(2) Every such prisoner shall be confined in a cell apart from all other prisoners, and shall be\nplaced by day and by night under the charge of a guard.\n________\nFOOD, CLOTHING AND BEDDING OF CIVIL AND UNCONVICTED CRIMINAL\nPRISONERS."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Maintenance of certain prisoner from private sources. A civil prisoner or an",
      "content": "unconvicted criminal prisoner shall be permitted to maintain himself, and to purchase, or receive\nfrom private sources at proper hours, food, clothing, bedding or other necessaries, but subject to\nexamination and to such rules as may be approved by the Inspector-General.\n1\nSubs. by the Prisons (Amdt.) Act, 1930 (6 of 1930) s. 2, for “eighteen”."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Restriction on transfer of food and clothing between certain prisoners. No part of any",
      "content": "food, clothing, bedding or other necessaries belonging to any civil or unconvicted criminal prisoner\nshall be given, hired or sold to any other prisoner; and any prisoner transgressing the provisions of\nthis section shall lose the privilege of purchasing food or receiving it from private sources, for such\ntime as the Superintendent thinks proper."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Supply of clothing and bedding to civil and unconvinced criminal prisoners",
      "content": "_(1)\nEvery civil prisoner and unconvinced unable to provide himself with sufficient clothing and bedding\nshall be supplied by the Superintendent with such clothing and bedding as may be necessary.\n(2) When any civil prisoner has been committed to prison in execution of a decree in favour\nof a private person, such person, or his representative, shall within forty-eight hours after the receipt\nby him of a demand in writing, pay to the Superintendent the cost of the clothing and bedding so\nsupplied to the prisoner; and in default of such payment the prisoner may be released."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Employment of civil prisoners",
      "content": "_(1) Civil prisoners may with the Superintendent's\npermission, work and follow any trade or profession.\n(2) Civil prisoners finding their own implements, and not maintained at the expense of the\nprison, shall be allowed to receive the whole of their earnings; but the earnings of such as are\nfurnished with implements or are maintained at the expertise of the prison shall be subject to a\ndeduction, to be determined by the Superintendent, for the use of implements and the cost of\nmaintenance."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Employment of criminal prisoners",
      "content": "_(1) No criminal prisoner sentenced to labour or\nemployed on labour at his own desire shall, except on an emergency with the sanction in writing of\nthe Superintendent, be kept to labour for more than nine hours in any one day.\n(2) The Medical Officer shall from time to time examine the labouring prisoners while they\nare employed, and shall at least once in every fortnight cause to be recorded upon the history-ticket\nof each prisoner employed on labour the weight of such prisoner at the time.\n(3) When the Medical Officer is of opinion that the health of any prisoners suffers from\nemployment on any kind or class of labour, such prisoner shall not be employed on that labour but\nshall be placed on such other kind or class of labour as the Medical Officer may consider suited for\nhim."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Employment of criminal prisoners sentenced to simple imprisonment. Provision shall",
      "content": "be made by the Superintendent for the employment (as long as they so desire) of all criminal\nprisoners sentenced to simple imprisonment; but no prisoner not sentenced to rigorous imprisonment\nshall be punished for neglect of work excepting by such alteration in the scale of diet as may be\nestablished by the rules of the prison in the case of neglect of work by such a prisoner."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Sick prisoners",
      "content": "_(1) The names of prisoner desiring to see the Medical Subordinate or\nappearing out of health in mind or body shall, without delay, be reported by the officer in immediate\ncharge of such prisoners to the Jailer.\n(2) The Jailer shall, without delay, call the attention of the Medical Subordinate to any\nprisoners desiring to see him, or who is ill, or whose state of mind or body appears to require\nattention, and shall carry into effect all written directions given by the Medical Officer or Medical\nSubordinate respecting alterations of the discipline or treatment of any such prisoner."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Record of directions of Medical officers. All directions given by the Medical Officer or",
      "content": "Medical Subordinate in relation to any prisoner, with the exception of orders for the supply of\nmedicines or directions relating to such Matters as are carried into effect by the Medical Officer\nhimself or under his superintendence, shall be entered day by day in the prisoner's history-ticket or in\nsuch other record as the 1[Provincial Government] may by rule direct, and the Jailer shall make an\nentry in its proper place stating in respect of each direction the fact of its having been or not having\nbeen complied with, accompanied by such observations, if any, as the Jailer thinks fit to make, and\nthe date of the entry."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Visits to civil and unconvicted criminal prisoners. Due provision shall be made for the",
      "content": "admission, at proper times and under proper restrictions, into every prison of persons with whom\ncivil or unconivted criminal prisoners may desire to communicate, care being take n that so far as\nmay be consistent with the interests of justice, prisoners under-trial may see their duly qualified legal\nadvisers without the presence of any other person."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Search of visitors",
      "content": "_(1) The Jailer may demand the name and address of any visitor to a\nprisoner, and, when the Jailer has any ground for suspicion, may search any visitor, or cause him to\nbe searched, but the search shall not be made in the presence of any prisoner or of another visitor.\n(2) In case of any such visitor refusing to permit himself to be searched, the Jailer may deny\nhim admission; and the grounds of such proceeding, with the particulars thereof, shall be entered in\nsuch record as the 1[Provincial Government] may direct.\n1\nSubs. by A. O., 1937, for “L.G.”."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Penalty for introduction or removal of prohibited article into or from prison and",
      "content": "communication with prisoners. Whoever, contrary to any rule under Section 1[59] introduces or\nremoves or attempts by any means whatever to introduce or remove, into or from any prison, or\nsupplies or attempts to supply to any prisoner outside the limits of a prison, any prohibited article,\nand every officer of a prison who, contrary to any such rule, knowingly suffers any such article to be\nintroduced into or removed from any prison, to be possessed by any prisoner, or to be supplied to any\nprisoner outside the limits of a prison, and whoever, contrary to any such rule, communicates or\nattempts to communicate with any prisoner, and whoever abets any offence made punishable by this\nsection, shall, on conviction before a Magistrate, be liable to imprisonment for a term not exceeding\nsix months, or to fine not exceeding two hundred rupees, or to both."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Power to arrest for offence under section 42. When any person, in the presence of any",
      "content": "officer of a prison, commits any offence specified in the last foregoing section, and refuses on\ndemand of such office to state his name and residence, or gives a name or residence which such\nofficer knows, or has reason to believe, to be false, such officer may arrest him, and shall without\nunnecessary delay make him over to a Police Officer, and thereupon such Police-officer shall\nproceed as if the offence had been committed in his presence."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Publication of penalties. The Superintendent shall cause to be affixed, in a cons",
      "content": "Publication picuous place outside the prison, a notice in English and the Vernacular setting forth the\nacts prohibited under section 42 and the penalties incurred by their commission."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Prison",
      "content": "offences. The following acts are declared to be prison-offences when committed\nby a prisoner :-\n(1)   such wilful disobedience to any regulation of the prison as shall have been\ndeclared by rules made under section 59 to be a prison-offence;\n(2)   any assault or use of criminal force.\n(3)   the use of insulting or threatening language;\n(4)   immoral or indecent or disorderly behaviour;\n(5)   wilfully disabling himself from labour ;\n(6)   contumaciously refusing to work;\n1\nSubs. ibid., for “60”.\n(7)         filing, cutting, altering or removing handcuffs, fetters or bars without due\nauthority;\n(8)         Wilful idleness or negligence at work by any prisoner sentenced to rigorous\nimprisonment;\n(9)         Wilful mismanagement of work by any prisoner sentenced to rigorous\nimprisonment;\n(10)        Wilful damage to prison-property;\n(11)        tampering with or defacing history tickets, records or documents;\n(12)        receiving, possessing or transferring any prohibited article ;\n(13)        feigning illness;\n(14)        wilfully bringing a false accusation against any officer or prisoner;\n(15)        omitting or refusing to report, as soon as it comes to his knowledge, the\noccurrence of any fire, any plot or conspiracy, any escape, attempt or\npreparation to escape, and any attack or preparation for attack upon any\nprisoner or prison-official; and\n(16)        conspiring to escape, or to assist in escaping, or to commit any other of the\noffences aforesaid.\n1"
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Punishment of such offences. The Superintendent may examine any person touching",
      "content": "any such offence, and determine thereupon, and punish such offence by-\n(1) a formal warning :\nExplanation.__A formal warning shall mean a warning personally addressed to a prisoner by\nthe Superintendent and recorded in the punishment-book and on the prisoner's history-ticket;\n(2) change of labour to some more irksome or severe form 2[for such period as may be\nprescribed by rules made by the 3[Provincial Government]] ;\n(3) hard labour for a period not exceeding seven days in the case of convicted criminal\nprisoners not sentenced to rigorous imprisonment;\n(4) such loss of privileges admissible under the remission system for the time being in force\nas may be prescribed by rules made by the 3[Provincial Government];\n(5) the substitution of gunny or other coarse fabric for clothing of other material, not being\nwoolen, for a period which shall not exceed three months;\n1\nFor rules issued with reference to clauses (4), (6) and (7) of section 46, see Gen. R. & O.\n2\nIns. by s. 2(a) of the Prisons (Amdt.) Act, 1925(17 of 1925).\n3\nSubs. by A.O., 1937, for “G.G. in C.”.\n(6) imposition of handcuffs of such pattern and weight, in such manner and for such period,\nas may be prescribed by rules made by the 1[Provincial Government];\n(7) imposition of fetters of such pattern and weight, in such manner and for such period, as\nmay be prescribed by rules made by the 1[Provincial Government];\n(8) separate confinement for any period not exceeding 2[three] months :\nExplanation.—Separate confinement means such confinement with or without labour as\nsecludes a prisoner from communication with, but not from sight of, other prisoners, and allows him\nnot less than one hour’s exercise per diem and to have his meals in association with one or more\nother prisoners;\n(9) penal diet, that is, restriction of diet in such manner and subject to such conditions\nregarding labour as may be prescribed by the 3[Provincial Government] :\nProvided that such restriction of diet shall in no case be applied to a prisoner for more than\nninety-six consecutive hours, and shall not be repeated except for a fresh offence nor until after an\ninterval of one week;\n(10) cellular confinement for any period not exceeding fourteen days:\nProvided that after each period of cellular confinement an interval of not less duration than\nsuch period must elapse before the prisoner is again sentenced to cellular or solitary confinement:\nExplanation.—Cellular confinement means such confinement with or without labour as\nentirely secludes a prisoner from communication with, but not from sight of, other prisoners;\n4\n*******\n4\n[(11)] penal diet as defined in clause (9) combined with 5[cel1ular] Confinement 6* * *;\n4\n[(12)] whipping, provided that the number of stripes shall not exceed thirty;\nProvided that nothing in this section shall render any female or civil prisoner liable to the\nimposition of any form of handcuffs or fetters, or to whipping.\n7\n[47. Plurality of punishments under section 46.___(1)] Any two of the punishments\nenumerated in the last foregoing section may be awarded for any such offence in combination,\nsubject to the following exceptions, namely :-\n(1) formal warning shall not be combined with any other punishment except loss of privileges\nunder clause (4) of that section;\n(2) penal diet shall not be combined with change of labour under clause (2) of that section,\nnor shall any additional period of penal diet awarded singly be combined with any period of penal\ndiet awarded in combination with 8[cellular] confinement;\n1\nSubs. by A.O., 1937, for “G. G. in C.”.\n2\nSubs. by the Prisons (Amdt.) Act, 1925 (17 of 1925), s.2 (b), for “six”.\n3\nSubs. by A. O., 1937, for “L. G.”.\n4\nOriginal clause (11) was rep. and clauses (12) and (13) were renumbered (11) and (12), respectively by Act 17 of 1925, s. 2.\n5\nSubs. ibid., for “solitary” .\n6\nThe words “as defined in clause (11)” rep., ibid.\n7\n8\nSubs. ibid., s. 2 for “solitary”.\n1\n[(3) cel1ular confinement shall not be combined with separate confinement, so as to prolong\nthe total period of seclusion to which the prisoner shall be liable ;]\n(4) whipping shall not be combined with any other form of punishment except cellular 2[and]\nseparate confinement and loss of privileges admissible under the remission system;\n3\n[(5) no punishment will be combined with any other punishment in contravention of rules\nmade by the 4[Provincial Government].]\n3\n[(2) No punishment shall be awarded for any such offence so as to combine, with the\npunishment awarded for any other such offence, two of the punishments which may not be awarded\nin combination for any such offence.]"
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Award of punishments under sections 46 and 47",
      "content": "_(1) The Superintendent shall have\npower to award any of the punishments enumerated in the two last foregoing sections, subject, in the\ncase of separate confinement for a period exceeding one month, to the previous confirmation of the\nInspector General.\n(2) No officer subordinate to the Superintendent shall have power to award any punishment\nwhatever."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Punishments to be in accordance with foregoing sections. Except by order of a Court",
      "content": "of Justice, no punishment other than the punishments specified in the foregoing sections shall be\ninflicted on any prisoner, and no punishment shall be inflicted on any prisoner otherwise than in\naccordance with the provisions of those sections."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Medical Officer to certify to fitness of prisoner for punishment",
      "content": "_(1) No punishment\nof penal diet, either singly or in combination, or of whipping, or of change of labour under section\n46, clause (2), shall be executed until the prisoner to whom such punishment has been awarded has\nbeen examined by the Medical Officer, who, if he considers the prisoner fit to undergo the\npunishment, shall certify accordingly in the appropriate column of the punishment-book prescribed\nin section 12.\n(2) If he considers the prisoner unfit to undergo the punishment, he shall in like manner\nrecord his opinion in writing and shall state whether the prisoner is absolutely unfit for punishment\nof the kind awarded, or whether he considers any modification necessary.\n(3) In the latter case he shall state what extent of punishment he thinks the prisoner can\nundergo without injury to his health."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Entries in punishment book.___(1) In the punishment",
      "content": "book prescribed in section 12 there\nshall be recorded, in respect of every punishment inflicted, the prisoner's name, register number and\nthe class (whether habitual or not) to which he belongs, the prison-offence of which he was guilty,\nthe date on which such prison-offence was committed, the number of previous prison- offences\nrecorded against the prisoner, and the date of his last prison-offence, the punishment awarded, and\nthe date of infliction.\n1\nSubs, ibid., s. 3, for the original exception (3).\n2\nSubs. by the Repealing and Amending Act, 1914 (10 of 1914), s. 2 and Sch. I for “or”.\n3\nException (5) and sub-section (2) were ins. by Act 17 of 1925, s. 3.\n4\nSubs. by A. O., 1937, for “G.G. in C”.\n(2) In the case of every serious prison-offence, the names of the witnesses proving the\noffence shall be recorded, and, in the case of offences for which whipping is awarded, the\nSuperintendent shall record the substance of the evidence of the witnesses, the defence of the\nprisoner, and the finding with the reasons therefore.\n(3) Against the entries relating to each punishment the Jailer arid Superintendent shall affix\ntheir initials as evidence of the correctness of the entries,"
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Procedure on committal of heinous offence. If any prisoner is guilty of any offence",
      "content": "against prison discipline which, by reason of his having frequently committed such offences or\notherwise, in the opinion of the Superintendent, is not adequately punishable by the infliction of any\npunishment which he has power under this Act to award, the Superintendent may forward such\nprisoner to the Court of the District Magistrate or of any Magistrate of the first class 1 * * * having\njurisdiction, together with a statement of the circumstances, and such Magistrate shall thereupon\ninquire into and try the charge so brought against the prisoner, and, upon conviction, may sentence\nhim to imprisonment which may extend to one year, such term to be in addition to any term for\nwhich such prisoner was undergoing imprisonment when he committed such offence, or may\nsentence him to any of the punishments enumerated in section 46 :\n2\n[provided that any such case may be transferred for inquiry and trial by the District\nMagistrate to any Magistrate of the first class 3* * *: and]\nProvided also that no person shall be punished twice for the same offence."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Whipping",
      "content": "_(1) No punishment of whipping shall be inflicted in installments, or except\nin the presence of the Superintendent and Medical Officer or Medical Subordinate.\n(2) Whipping shall be inflicted with a light ratan not less than half an inch in diameter on the\nbuttocks, and in case of prisoners under the age of sixteen it shall be inflicted, in the way of school\ndiscipline, with a lighter ratan."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Offences by prison subordinates",
      "content": "_ (1) Every Jailer or officer of a prison subordinate to\nhim who shall be guilty of any violation of duty or wilful breach or neglect of any rule or regulation\nor lawful order made by competent authority, or who shall withdraw from the duties of his office\nwithout permission, or without having given previous notice in writing of his intention for the period\nof two months, or who shall wilfully overstay any leave granted to him, or who shall engage without\nauthority in any employment other than his prison-duty, or who shall be guilty of cowardice, shall be\nliable, on conviction before a Magistrate, to fine not exceeding two hundred rupees, or to\nimprisonment for a period not exceeding three months, or to both.\n(2) No person shall under this section be punished twice for the same offence.\n1\nThe original words “or Presidency Magistrate” which were ins. by the Prisons (Amdt.) Act, 1910 (13 of1910), s. 2 (1), omitted by A.O., 1949, Sch.\n2\nSubs. by the Prisons (Arndt.) Act, 1910 (13 of 1910), s. 2 (2), for the original proviso.\n3\nThe words “and by a Chief Presidency Magistrate to any other Presidency Magistrate” omitted by A.O., 1949, Sch."
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Extramural custody, control and employment of prisons. A prisoner, when being",
      "content": "taken to or from any prison in which he may be lawfully confined, or whenever he is working\noutside or is otherwise beyond the limits of any such prison in or under the lawful custody or control\nof a prison officer belonging to such Prison shall be deemed to be in prison and shall be subject to all"
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. Confinement in irons. Whenever the Superintendent considers it necessary (with",
      "content": "reference either to the state of the prison or the character of the prisoners) for the safe custody of any\nprisoners that they should be confined in irons, he may, subject to such rules and instructions as may\nbe laid down by the Inspector General with the sanction of the 1[Provincial Government], so confine\nthem."
    },
    {
      "provision_ref": "sec57",
      "section": "57",
      "title": "Section 57. Confinements of prisoners under sentence of transportation in irons",
      "content": "_(1) Prisoners\nunder sentence of 2[imprisonment for life] may, subject to any rules made under section 2[59], be\nconfined in fetters for the first three months after admission to prison.\n(2) Should the Superintendent consider it necessary, either for the safe custody of the prisoner\nhimself or for any other reason, that fetters should be retained on any such prisoner for more than\nthree months, he shall apply to the Inspector General for sanction to their retention for the period for\nwhich he considers their retention necessary, and the Inspector General may sanction such retention\naccordingly."
    },
    {
      "provision_ref": "sec58",
      "section": "58",
      "title": "Section 58. Prisoners not to be ironed by Jailer except under necessity. No prisoner shall be put in",
      "content": "irons or under mechanical restraint by the Jailer of his own authority, except in case of urgent\nnecessity, in which case notice thereof shall be forthwith given to the Superintendent."
    },
    {
      "provision_ref": "sec59",
      "section": "59",
      "title": "Section 59. Power to make rules. 3[The Provincial Government] may make rules",
      "content": "consistent Power\nto with this Act—\n(1)         defining the acts which shall constitute prison-offences;\n(2)         determining the classification of prison-offences into serious and minor\noffences;\n(3)         fixing the punishments admissible under this Act which shall be awardable for\ncommission of prison-offences or classes thereof;\n(4)         declaring the circumstances in which acts constituting both a prison-offence\nand an offence under the Pakistan Penal Code mayor may not be dealt with as\na prison offence ;\n(5)         for the award of marks and the shortening of sentences 4[so, however, that a\nsentence of imprisonment for life is not shortened to a period of imprisonment\nless than fifteen years];\n1\nSubs. by the Law Reforms Ordinance, 1972 (12 of 1972), s. 2 and Sch., for “transportation”.\n2\nSubs. by A. O., 1937.for “60”.\n3\nSubs. ibid., for “The G. G. in C. may for any part of British India, and each L.G. with the previous sanction of the G. G. in C. may for the territories\nunder its administration”.\n4\nAdded by Ord. 12 of 1972, s. 2 and Sch.\n(6)        regulating the use of arms against any prisoner or body of prisoners in the case\nof an outbreak or attempt to escape;\n(7)        defining the circumstances and regulating the conditions under which\nprisoners in danger of death may be released;\n1\n[(8)   for the classification of prisons, and description and construction of wards,\ncells and other places of detention ;\n(9)        for the regulation by numbers, length or character of sentences, or otherwise,\nof the prisoners to be confined in each class of prisons;\n(10)       for the government of prisons and for the appointment of all officers appointed\nunder this Act;\n(11)       as to the food, bedding and clothing of criminal prisoners and of civil\nprisoners maintained otherwise than at their own cost;\n(12)       for the employment, instruction and control of convicts within or without\nprisons;\n(13)       for defining articles the introduction or removal of which into or out of prisons\nwithout due authority is prohibited ;\n(14)       for classifying and prescribing the forms of labour and regulating the periods\nof rest from labour;\n(15)       for regulating the disposal of the proceeds of employment of prisoners;\n(16)       for regulating the confinement in fetters of prisoners sentenced to\n2\n[imprisonment for life] ;\n(17)       for the classification and the separation of prisoners;\n(18)       for regulating the confinement of convicted criminal prisoners under section\n28;\n(19)       for the preparation and maintenance of history-tickets;\n(20)       for the selection and appointment of prisoners as officers of prisons ;\n(21)       for rewards for good conduct;\n(22)       for regulating the transfer of prisoners whose term of 3[imprisonment for life\nor shorter] imprisonment is about to expire; subject, however, to the consent of\nthe Provincial Government of any other Province to which a prisoner is to be\ntransferred;\n1\nSubs. by A. 0.,1937, for the original clauses (8) and (9).\n2\nSubs. by Law Reforms Ordinance, 1972, (12 of 1972)s. 2 and Sch., for., “transportation”.\n3\nSubs. by the Law Reforms Ordinance, 1972, (12 of 1972), s.2 and Sch., for “transportation or”.\n(23)        for the treatment, transfer and disposal of criminal lunatics or recovered\ncriminal lunatics confined in prisons;\n(24)        For regulating the transmission of appeals and petitions from prisoners and\ntheir communication with their friends;\n(25)        for the appointment and guidance of visitors of prisons;\n(26)        for extending any or all of the provisions of this Act and of the rules\nthereunder to subsidiary jails or special places of confinement appointed under\nsection 541 of the 1[Code of Criminal Procedure, 1898 (Act V of 1898), and to\nthe officers employed, and the prisoners confined, therein;\n(27)        in regard to the admission, custody, employment, dieting, treatment and\nrelease- of prisoners; and\n(28)        generally for carrying into effect the purposes of this Act.]\n2"
    },
    {
      "provision_ref": "sec61",
      "section": "61",
      "title": "Section 61. Exhibition of copies of rules. Copies of rules, under 3[section 59] so far as they affect the",
      "content": "government of prisons, shall be exhibited, both in English and in the Vernacular, in some place to\nwhich all persons employed within a prison have access,"
    },
    {
      "provision_ref": "sec62",
      "section": "62",
      "title": "Section 62. Exercise of powers of Superintendent and Medical Officer. All or any of the powers",
      "content": "and duties conferred and imposed by this Act on a Superintendent or Medical Officer may in his\nabsence be exercised and performed by such other officer as the 4[Provincial Government] may\nappoint in this behalf either by name or by his official designation.\n________\nTHE SCHEDULE.—[ENACTMENTS REPEALED.] Rep. by\nDate: 05-09-2024\n1\nSubs. by Ord. XXVII of 1981, s. 5, Sch. IV (only to the extent of Islamabad Capital Territory).\n2\nThis section has been incorporated with slight modification in clauses (8) to (27) of s. 59.\n3\nSubs. by A.O., 1937, for “sections 59 and 60.\n4\nSubs. ibid., for “L.G.”."
    }
  ],
  "definitions": []
}
