{
  "id": "pk-professions-tax-limitation-act-1941",
  "type": "statute",
  "title": "Professions Tax Limitation Act, 1941",
  "title_en": "Professions Tax Limitation Act, 1941",
  "short_name": "PTLA",
  "status": "in_force",
  "issued_date": "1941-11-25",
  "in_force_date": "1941-11-25",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJeU-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Professions Tax Limitation Act, 1941 (XX of 1941) published by The Pakistan Code (Labour Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Professions Tax\nLimitation Act, 1941.\n3\n[(2) It extends to the whole of Pakistan].\n(3) It shall come into force 2[at once.]\n4[2. Limitation of tax on professions, etc.—(1) Notwithstanding the provisions of any law\nfor the time being in force, a Provincial Assembly may by an Act impose tax not exceeding one\nhundered thousand rupees on persons engaged in professions, trades, callings or employments.\n(2) Notwithstanding anything contained in any law or in any judgment of any court including\na High Court and the Supreme Court, the tax on professions, trades, callings or employments levied\nand collected under an Act of a Provincial Assembly on or after the 1st day of July, 1977, as is not in\nexcess of the limit fixed in sub-section (1), shall be deemed to have been validly levied and collected\nand shall not be liable to be refunded and the provisions of this Act shall have, and shall be deemed\nalways to have had, effect accordingly.]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. [Saving]",
      "content": "Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981\n(XXVII of 1981), s. 3 and Sch. II.\nTHE SCHEDULE.—[TAXES TO WHICH SECTION 2 DOES NOT APPLY.] Rep. by A. O.,\n1949.\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1941, Pt. V, p. 123, and for Report of Select Committee, see ibid., p. 167.\nThe Act has been applied to Balochistan, see Notification No. 52-F, dated the 5th April, 1942, Gazette of India, 1942, Pt. I, p. 682.\nIt has been extended to the Leased Areas of Balochistan by the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950).\n2\nSubs. by Act 4 of 1999, s. 2.\n3\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for the original\nsub-section (2), as amended by A. O., 1949.\n4\nSubs. by Act III of 06, s. 3 and shall be deemed to have been so, subs. on 1st July, 1977."
    }
  ],
  "definitions": []
}
