{
  "id": "pk-prohibitation-of-smoking-and-protection-of-non-smokers-health-ordinance-2002",
  "type": "statute",
  "title": "Prohibitation of Smoking and Protection of Non-Smokers Health Ordinance, 2002",
  "title_en": "Prohibitation of Smoking and Protection of Non-Smokers Health Ordinance, 2002",
  "short_name": "POSAP",
  "status": "in_force",
  "issued_date": "2002-10-14",
  "in_force_date": "2002-10-14",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FtbJk%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Prohibitation of Smoking and Protection of Non-Smokers Health Ordinance, 2002 (LXXIV of 2002) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Power to make rules",
      "content": "SMOKERS HEALTH ORDINANCE, 2002\nORDINANCE NO. LXXIV OF 2002\n[15th October 2002]\nAn\nOrdinance\nto provide for prohibition of smoking and other tobacco uses in places of public work or use and\npublic service vehicles and to protect the health of non-smokers\nWHEREAS smoking and other tobacco uses in posing a serious threat to the health of people\nand the environment it is expedient to provide for prohibition of smoking and other tobacco uses in\nplaces of public work or use and in public service vehicles and to protect the health of non-smokers\nand for matters connected therewith or ancillary thereto;\nAND WHEREAS the President is satisfied that circumstances exist which render it\nnecessary to take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the Fourteenth day\nof October, 1999, and the Provisional Constitution Order No.1 of 1999, read with the Provisional\nConstitution (Amendment) Order No.9 of 1999, and in exercise of all powers enabling him in that\nbehalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the\nfollowing Ordinance:––"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement :―(1) This Ordinance may be called the",
      "content": "Prohibition of Smoking and Protection of Non-Smokers Health Ordinance, 2002.\n(2) It extends to the whole of Pakistan,\n(3) It shall come into force on such date as the Federal Government may, by\nnotification in the official Gazette, specify."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions:― In this Ordinance, unless there is anything repugnant in the subject or the",
      "content": "context,––\n(a)     “advertisement” means and includes any notice, circular, wall paper,\npamphlet, display on any board or hoarding, through internet, or any visible\nrepresentation made by any form of media whether mechanical, electronic,\naudio, visual or any other technological means of any light, sound, smoke,\ngas, writing instruments, stickers, symbol, colour; logo, trade marks, display,\non articles like T-shirts, shoes, sports wears, sports gears, caps, carry bags,\ntelephone booths or by any other mean, direct or indirect, which have the\neffect of promoting smoking and other tobacco use and the expression\n“advertise” shall be construed accordingly;\n(b)     “authorized officer” means a person authorized under section 4;\n(c)     “place of public work or use” means any place declared as such under section\n3 and includes auditoriums, buildings, health institutions, amusement centres,\nrestaurants, public offices, Court buildings, cinema halls, conference or\nseminar halls, eating houses, hotel lounges, other waiting lounges libraries,\nbus stations or stands, sports stadiums, educational institutions, libraries and\nthe like which are visited by general public but does not include any open\nplace;\n(d)     “promotion” includes sponsorship, sampling, display and use of tobacco\nbrand names, logos and colors on non-tobacco merchandise which has\nthe effect of promoting smoking and other tobacco use;\n(e)     “public service vehicle” means a vehicle as defined in the Provincial\nMotor Vehicles Ordinance, 1965 (W.P. Ordinance XIX of 1965), and includes\nrailway train and aeroplanes.\n(f)     “rule” means the rule made under this Ordinance; and\n(g)     “smoking” means smoking of tobacco in any form whether in the form\nof cigarette, cigar or otherwise with the aid of a pipe, wrapper or any other\ninstrument."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Powers to declare no",
      "content": "smoking places of public work of use:__ As soon as may be after\nin the official Gazette, declare any place of public work or use to be a no-smoking and no-tobacco\nuse place for the purposes of this Ordinance."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to authorize :―(1) The Federal Government may, by notification in the official",
      "content": "Gazette, authorize one or more persons who shall be competent to act under this Ordinance.\n(2) Every person authorized under subsection (1) shall be deemed to be a public servant\nwithin the meaning of section 21 of the Pakistan Penal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Prohibition of smoking and others tobacco use:―No person shall smoke or use tobacco",
      "content": "in any other form in any place of public work or use. The Federal Government may however\nissue guidelines for permitting designated smoking areas in premises or places where adequate\narrangements are made to protect the health of non-smokers."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Prohibition of smoking in public service vehicles:― without prejudice to the provisions",
      "content": "of the Provincial Motor Vehicle Ordinance, 1965 (W.P. Ordinance XIX of 1965), no person shall\nsmoke or use tobacco in any other form in a public service vehicle."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Prohibition on advertisement of cigarettes, etc.:― Notwithstanding anything contained",
      "content": "in any other law for the time being in force, no person or company shall advertise tobacco and\ntobacco products on any media or in any place and any public service vehicle, if such advertisement\nis not in accordance with guidelines prescribed for this purpose by a committee which the Federal\nGovernment may, by notification in the official Gazette, constitute."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Prohibition of sale of cigarettes, etc., to minors:― No person shall sell cigarettes or any",
      "content": "other smoking substance to any person who is below the age of eighteen years."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Prohibition of Storage, sale and distribution of cigarettes, etc., the immediate vicinity",
      "content": "of educational institutions.––No person shall himself or by any person on his behalf, store, sell or\ndistribute cigarettes or any other smoking substance or any other tobacco products within 50 (fifty)\nmeters from any college, school or educational institution."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Display and exhibition of board",
      "content": "The owner or manager or incharge of the affairs of\nevery place of public work or use shall display and exhibit a board at each conspicuous place in and\noutside the premises visited or used by general public prominently stating that the place is a “No\nSmoking Zone” and that “Smoking is an Offence.”"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Penalties:―Any person, who contravenes the provisions of––",
      "content": "(a)    section 5, 6 or 10 shall be punishable with fine which may extend to one\nthousand rupees and in case of second or subsequent offence, shall be\npunishable with a fine which shall not be less then one thousand rupee, and\nmay extend to one hundred thousand rupees; and\n(b)    section 7, 8 or 9 shall be punishable with fine which may extend to five\nthousand rupees and in case of second or subsequent offence, shall be\npunishable with imprisonment which may extend to three months or with a\nfine which shall not be less then one hundred thousand rupees, or with both."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Ejectment of violators from any place of public work or use",
      "content": "Any authorize officer\nor a police officer not below the rank of sub-Inspector may eject any person from any place of public\nwork or use who contravenes the provisions of this Ordinance."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Cognizance of offences:― (1) Notwithstanding anything contained in the Code of",
      "content": "Criminal Procedure, 1898 (Act V of 1898), no Court shall take cognizance of any offence under this\nOrdinance except on a complaint in writing by an authorized officer with respect to an offence under\nsections 5, 6 and 10 and on a report in writing by a police officer, not below the rank of sub-\ninspector, with respect to an offence under sections 7, 8 and 9."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Procedures:― Notwithstanding anything contained in the Code of Criminal Procedure,",
      "content": "1898 (Act V of 1898),\n(a)    an offence under sections 7, 8 and 9 shall be cognizable and boilable;\n(b)    no Court other than Magistrate of the First Class shall try an offence under this\nOrdinance;\n(c)    a Magistrate trying an offence under this Ordinance shall have the power to try\nsuch offence summarily in accordance with the procedure laid down for\nsummary trial in the said Code; and\n(d)    it shall be lawful for the Magistrate of the First Class to pass any sentence\nauthorized by this Ordinance."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Power to delegate",
      "content": "The Federal Government may, by notification in the official\nGazette, direct that all or any of, its powers under this Ordinance or the rules shall, subject to such\nconditions, if any, as may be specified therein be exercisable also by any officer or authority\nsubordinate to the Federal Government or Provincial Government."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Application of other laws passed:― The provisions of this Ordinance shall be in",
      "content": "addition to, and not in derogation of, any law for the time being in force."
    }
  ],
  "definitions": [
    {
      "term": "advertisement",
      "definition": "and includes any notice, circular, wall paper, pamphlet, display on any board or hoarding, through internet, or any visible representation made by any form of media whether mechanical, electronic, audio, visual or any other technological means of any light, sound, smoke, gas, writing instruments, stickers, symbol, colour; logo, trade marks, display, on articles like T-shirts, shoes, sports wears, sports gears, caps, carry bags, telephone booths or by any other mean, direct or indirect, which have the effect of promoting smoking and other tobacco use and the expression “advertise” shall be construed accordingly;",
      "source_provision": "sec2"
    },
    {
      "term": "authorized officer",
      "definition": "a person authorized under section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "place of public work or use",
      "definition": "any place declared as such under section 3 and includes auditoriums, buildings, health institutions, amusement centres, restaurants, public offices, Court buildings, cinema halls, conference or seminar halls, eating houses, hotel lounges, other waiting lounges libraries, bus stations or stands, sports stadiums, educational institutions, libraries and the like which are visited by general public but does not include any open place;",
      "source_provision": "sec2"
    },
    {
      "term": "promotion",
      "definition": "sponsorship, sampling, display and use of tobacco brand names, logos and colors on non-tobacco merchandise which has the effect of promoting smoking and other tobacco use;",
      "source_provision": "sec2"
    },
    {
      "term": "public service vehicle",
      "definition": "a vehicle as defined in the Provincial Motor Vehicles Ordinance, 1965 (W.P. Ordinance XIX of 1965), and includes railway train and aeroplanes.",
      "source_provision": "sec2"
    },
    {
      "term": "rule",
      "definition": "the rule made under this Ordinance; and",
      "source_provision": "sec2"
    },
    {
      "term": "smoking",
      "definition": "smoking of tobacco in any form whether in the form of cigarette, cigar or otherwise with the aid of a pipe, wrapper or any other instrument.",
      "source_provision": "sec2"
    }
  ]
}
