{
  "id": "pk-protection-of-breast-feeding-and-child-nutrition-ordinance-2002",
  "type": "statute",
  "title": "Protection of Breast Feeding and Child Nutrition Ordinance, 2002",
  "title_en": "Protection of Breast Feeding and Child Nutrition Ordinance, 2002",
  "short_name": "POBFA",
  "status": "in_force",
  "issued_date": "2002-10-25",
  "in_force_date": "2002-10-25",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FuaZ4%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Protection of Breast Feeding and Child Nutrition Ordinance, 2002 (XCIII of 2002) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Overriding effect",
      "content": "ORDINANCE, 2002\nORDINANCE XCIII OF 2002\n[26-10-2002]\nAn Ordinance to provide for protection of breast-feeding and nutrition for infants and young\nchildren\nWHEREAS it is expedient to ensure safe and adequate nutrition for infants and young children\nby promoting and protecting breast-feeding, and by regulating the marketing and, promotion of\ndesignated products including breast milk substitutes, and of feeding bottles, valves for feeding bottles,\nnipple shields, teats and pacifier and to provide for matters connected therewith or-ancillary thereto;\nAND WHEREAS the President is satisfied that circumstances exist which render it\nnecessary to take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency Of the Fourteenth day\nof October, 1999, and the Provisional Constitution Order No. 1 of 1999 read with the Provisional\nConstitution (Amendment) Order No.9 of 1999, and in exercise of all powers enabling him in that\nbehalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the\nfollowing Ordinance:___\n___________"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Ordinance may be called the Protection\nof Breast-feeding and Child Nutrition Ordinance, 2002.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_ In this Ordinance, unless there is anything repugnant in the subject or\ncontext,―\n(a)     “infant” means a child up to the age of twelve months;\n(b)     “young child” mans a child from the age of twelve months up to the age of two\nyears;\n(c)     “advertise” or “advertising” means to make any representation by any means\nwhatsoever for the purpose of promoting sale or use of .a designated product;\n(d)     “Board” means the National Infant Feeding Board constituted under section 3;\n(e)     “container” means any form of packaging of adesignated product for sale as a\nretail unit;\n(f)     “designated product” means—\n(i)     any milk manufactured, marketed and promoted for the use of an infant\nor otherwise represented as a partial or total replacement for mother”s milk\nwhether or not it is suitable for such replacement;\n(ii)    any products manufactured, marketed, promoted or otherwise represented as\na complement to mother”s milk to meet the growing nutritional needs of an\ninfant;\n(iii)   any feeding bottle, teat, valve for feeding bottle, pacifier or nipple shield; and\n(iv)    such other product as the Federal Government may, by notification in the\nofficial Gazette, declare to be a designated product for the purposes of this\nOrdinance;\n(g)     “complementary food” means any ford suitable as an addition to breast milk or\nto a breast milk substitute when either becomes insufficient to satisfy the\nnutritional requirements of an infant, also commonly called “weaning food” or\n“breast milk and young child supplement”:\n(h)     “infant-formula” means an animal or vegetable based milk product\nmanufactured in accordance with the standards recommended by the\nCodex Alimentarius Commission and the Codex Code of Hygienic Practice\nfor Foods for Infants and Children to approximate the normal nutritional\nrequirements of an infant up to the age of six months;\n(i)     “feeding bottle” means any bottle or receptacle marketed for the purpose of\nfeeding an infant or a young child;\n(j)     “nipple shield” means an appliance with a teat for a baby to suck from the breast;\n(k)     “pacifier” means an artificial teat for babies to suck also called “dummy”;\n(l)     “follow-up formula” means an animal or vegetable based milk product\nmarketed for infants older than six months or young child and formulated\nindustrially in accordance with the standards of the Codex Alimentarius\nCommission and the Codex Code of Hygienic Practice for Foods for Infants and\nChildren;\n(m)     “distributor” means any person engaged in the business of marketing, whether\nwholesale or retail, and includes a person providing product public relations and\ninformation services;\n(n)     “health care facility” means a Government, non-Government, semi Government\nor private institution or organization, or private medical practitioner engaged,\ndirectly or indirectly, in the provision of health care to infants, young children,.\npregnant women or mothers, and includes a day-care centre, nursery and\nany other child-care institution;\n(o)     “health professional” means a medical practitioner, nurse, nutritionist or such\nother persons as the Federal Government may, by notification in the\nofficial Gazette, specify;\n(p)     “health worker” means any person providing services to infants, young children,\npregnant women or mothers as a medical practitioner, and includes a health\nprofessional, homeopath practitioner, hakim, nurse. midwife, traditional\nbirth attendant,, pharmacist,- dispensed chemist, nutritionist, hospital\nadministrator or employee, whether professional or not whether paid or not,\nand any other person providing such services as the Federal Government tray\nby notification in the official Gazette, specify;\n(q)    “Inspector” means any person designated as Inspector under section 12;\n(r)    “label” means any tag, mark, pictorial or other descriptive matter which is\nwritten, printed, stenciled, marked, embossed, attached or otherwise appearing\non a container;\n(s)    “manufacturer” means a person, corporation or other entity engaged or involved\nin the business of producing, processing, compounding, formulating, filling,\npacking, repacking, altering, ornamenting, finishing and labelling a\ndesignated product, whether directly, through an agent, or through a person\ncontrolled by or under an agreement;\n(t)    “market” means any, method of introducing or selling a designated product, and\nincludes, but not limited to, promotion, distribution, advertising, distribution\nof samples, product public relations and product information services;\n(u)    “person” means any individual, partnership, association, unincorporated\norganization, company, cooperative, corporation, trustee, agent or any group\nof persons;\n(v)    “prescribed” means prescribed by rules\n(w)    “promote” or “promotion” means any method of introducing a person to, or\nfamiliarizing a person with, a designated product or inducing a person to buy or\nus designated product, and includes, but not limited to, advertising, offer of\nsamples or gifts, distribution of literature, public relations and information\nservices related to a designated product, but does not include any\nprescription issued by a medical practitioner based on health grounds;\n(x)    “Provincial Committee” means a Provincial Infant Feeding Committee\nconstituted udder section 3;\n(y)    “rules” means rules made under this Ordinance; and\n(z)    “sample” means any quantity of a designated product provided free of cost.\n_________"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. National Infant Feeding Board and Provincial Infant Feeding Committees.― (1) The",
      "content": "Federal Government shall, by notification in the official Gazette, constitute a National Infant Feeding\nBoard.\n(2) The Board shall consist of a Chairperson, a Secretary and not more than such number of\nmembers as the Federal Government may prescribe:\nProvided that not less than half of the total number of members of the Board shall comprise of\nsuch persons who are professional qualified with respect to infant and young child nutrition and at\nleast one member of the Board shall be selected from the industry involved in the manufacturing and\nmarketing of designated products. Secretary of the Provincial Health Department or his nominee shall\nbe ex-officio member of the Board-\n(3) A Provincial Government shall, by notification in the official Provincial Gazette, constitute\na Provincial Infant Feeding Committee for a Province.\n(4) Subject to subsection (5), a Provincial Infant Feeding Committee shall consist of a\nChairperson and not more than, such number of members as the Provincial Government may\nprescribe:\nProvided that not less than half of the total number of members of a Provincial\nCommittee shall comprise of such persons who are professional qualified with respect to infant and\nyoung child nutrition and at least one member shall be selected from industry involved in the\nmanufacturing and marketing of designated products.\n(5) The Federal Government shall nominate the members of the Board and a Provincial\nGovernment shall nominate the members of a Committee, who shall hold office for a term as may be\nprescribed by the respective Governments."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers and functions of the Board and Provincial Committees",
      "content": "_The following shall be\nthe powers and functions of the Board in the case of the Federal Government and a Provincial\nCommittee in the case of a Provincial Government, namely:—\n(a)     To receive, reports of violations of provisions of this Ordinance or the rules;\n(b)     to recommend , investigation of cases against manufacturers, distributors or\nhealth workers found to be violating the provisions of this Ordinance or the\nrules;\n(c)     to plan for and co-ordinate the dissemination of informational and educational\nmaterials on the topic of infant feeding and recommend continuing education\ncourses for health workers on topics related to this Ordinance;\n(d)     to advise the Federal Government, and the Provincial Governments on national\npolicies for the promotion and protection of breast-feeding, and matters relating\nto designated products especially infant and young child nutrition, particularly\nthrough national or provincial education campaigns, and to organize health\neducation on the same for health workers and general public; and\n(e)     to propose guidelines to the Federal Government or to a Provincial\nGovernment. as the case may be in respect of matter specified in clause (d)."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Meeting of the Board and. Provincial Committees",
      "content": "_The Secretary of the Board or, as\nthe case may be, a Provincial Committee, shall call meetings of the Board or a Provincial Committee,\nas the case may be, at the direction of the Chairperson, and maintain minutes of such meetings."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Implementation and monitoring",
      "content": "_ The Federal Government tray give such directions to\na Provincial Government as tray appear to it to be necessary for carrying into effect in a Province any\nof the provisions of this Ordinance or of the rules or any order or direction made thereunder or for\nachievement of uniformity in respect of any matter related thereto in different parts of Pakistan.\n____________"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Prohibited practices.",
      "content": "_(1) No person shay in any form whatsoever, promote any\ndesignated products except as provided for under this Ordinance.\n(2) No person shall in any manner assert that any designated product is a substitute for\nmother”s milk, or that it is equivalent to or comparable with or superior to mother”s milk.\n(3) No manufacturer or distributor shall offer, or make gift or contributions of any kind, or\npay to any extent for any reason whatsoever, or give any kind of benefit, to a health worker or his\nfamily, or any personnel employed, directly or indirectly, in a health care facility, or any member\nof the Board or a Provincial Committee, as the case may be, or the employees thereof.\n(4) No manufacturer or distributor shall donate any designated product and equipment or\nservices related to a designated product free of charge or at low cost to a health care facility, or\noffer or give any benefit to a professional association of medical practitioners for this purpose.\n(5) No person other than a health worker who is not engaged by a manufacturer or distributor\nshall instruct any user on the need and proper preparation and use of any designated product:\nProvided that a manufacturer or distributor may instruct any user on the need and proper\npreparation and use of any designated product in accordance with the provisions of section 8.\n(6) No distributor or manufacturer shall in furtherance of or for the purposes of its business\nhave contact, directly or indirectly, with general public within a health care facility.\n(7) No manufacturer, distributor or any person engaged by them shall produce or distribute\nany educational or informational material relating to infant and young child feeding:\nProvided that any educational or informational material relating to a designated product\nmay be provided by a manufacturer or distributor to a health professional subject to the prescribed\nconditions, and that the same shall be restricted to scientific and factual matters, and shall not\nimply or create a belief that bottle-feeding is equivalent or superior to breast-feeding."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Prohibitions and guidance relating to labels of designated products",
      "content": "__ (1) No\ndesignated product shall be marketed or sold in Pakistan unless its label is in accordance with\nthe Federal Government:\nProvided that for any designated product already being sold in Pakistan, a manufacturer or\ndistributor shall provide for the label of such product within one hundred and eighty days of its\napproval in the manner as may be prescribed.\n(2) Label of a designated products shall be designed so as not to discourage breast- feeding\nand shall provide the necessary information in Urdu about the appropriate use of such product and\nthe age before which a designated product should not be used.\n(3) Every container shall have a clear, conspicuous and easily understood message printed\non it, or on a label that cannot become separated from it, which shall be written in Urdu and if\nso desired by the manufacturers, in English as well.\n(4) The label shall―\n(a)     not contain anything that may discourage breast-feeding\n(b)     contain a conspicuous notice in bold characters in the prescribed height stating\nthe following, namely:___ ”MOTHER”S MILK IS BEST FOOD FOR\nOTHER ILLNESSES”\n(c)     instead of or in addition to the notice specified in clause (b), contain any other\nmessage as may be prescribed with respect to any designated product;\n(d)     neither uses expression such as “materialized” or “humanized” or equivalent\nnor contains any comparison with mother”s milk. ,\n(e)     not show photographs. drawings or graphics except that graphics may be used\nto illustrate the correct method of preparation;\n(f)     contain the name and address of manufacturer and of wholesale distributor\nif a designated product is an imported item; and\n(g)     except for bottles, teats, pacifiers and nipple shields, contain appropriate\ninstructions in Urdu for the correct preparation in words and easily\nunderstood graphics, and indicate the ingredients, composition and analysis\nof a designated product required storage conditions, batch number and expiry\ndate, and contain any warning as may be prescribed for the implementation of\nthis Ordinance in characters of the prescribed height in Urdu or regional\nlanguages.\n_____________"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Informational and educational materials",
      "content": "_(1) any person who produces or distributes\nany informational and educational materials referred in this section shall submit copies thereof to the\nBoard as may be prescribed.\n(2) Informational and educational materials, whether written, audio or visual, which refer\nto infant feeding shall contain only correct information and shall not use any pictures graphics or text\nthat encourage bottle-feeding or discourage breast-feeding.\n(3) The Federal Government shall, in consultation with the Board, arrange for and approve\nthe dissemination of objective and consistent informational and educational materials on infant and\nyoung child feeding, excluding medical literature and may, by notification in the official Gazette,\npublish such instructions, guidelines or policies as it deems necessary or appropriate, for the\npurposes of producing and distributing informational and educational materials."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Health workers and health care facilities",
      "content": "_(1) Health workers shall encourage, support\nand protect breast-feeding. They shall be expected to know the provisions of this Ordinance, in\nparticular, any instructions, guidelines or policies published under section 9, and to implement the\nsame whenever possible.\n(2) Health workers shall not accept, or give samples of any designated product to any, person,\nparticularly pregnant women, mothers of infants and young children; or members of their\nfamilies.\n(3) Health workers and their Association shall not promote in any way whatsoever, any\ndesignated product.\n(4) Health workers falling within the jurisdiction of the Federal Government shall make in\nwriting a report to the Board, and in all other cases to a concerned Provincial Committee any offer of\na gift or other financial benefit made by a manufacturer or distributor or any other contravention of\n(5) There shall be kept posted in every health care facility in Urdu and English, and in such\nother language as may be deemed appropriate by the health care facility, such abstracts of this\nOrdinance as may be prescribed by the Federal Government,- or a Provincial Government, as the\ncase may be, for this purpose.\n__________\nCHAPTER – V"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Quality assurance.",
      "content": "(1) No designated product shall be manufactured, sold or otherwise\ndistributed in Pakistan unless it is formulated industrially in accordance with the standards\nrecommended by the Codex Alimentarus Commission and the Codex Code of Hygienic Practice\nfor Foods for Infants and Children, and in addition. shall meet such applicable standards specified in\nthis Ordinance and the rules,\n(2) The Board or a Provincial Committee, as the case may be, may require an Inspector\nor any other person invested with powers under this Ordinance to test any designated product sold in\nPakistan in order to determine whether it is fit for human consumption.\n(3) A designated product that does not meet the standards for use in the country of manufacture\nshall not be sold in Pakistan.\n(4) A designated product that has reached the expiry date shall not be marketed sold or\ndistributed.\n(5) A designated product shall be sold only in the original container in order to prevent\nquality deterioration, adulteration or contamination thereof."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Investigation and inspection.",
      "content": "_ (1) The Federal Government may designate any number\nof persons professionally qualified with respect to infant and young child nutrition as Inspector to\nconduct inspection and investigation and prosecution for this Ordinance and to monitor compliance\nwith the provisions of this ordinance.\n(2) After an inspection for purpose of this Ordinance, an Inspector shall refer the case, and if\nso required, provide one portion of the sample of a designated product, or the whole of a designated\nproduct if it is such that it cannot be divided, to the Board, or a Provincial Committee, as the case\nmay be."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Investigation and filing of case.",
      "content": "_ (1) Upon completion of an .investigation and receipt\nof a complete report, and after giving the concerned party an opportunity of being heard, the Board\nor a Provincial Committee, as the case may be shall recommend to the Federal Government whether\nor not institute prosecution under this Ordinance.\n(2) No Court shall take cognizance of any offence punishable under this Ordinance except on\na report in writing by an officer authorized by the Federal Government, or any other person as\nthe Federal Government may, by notification in the official Gazette, authorize in this behalf.\n(3) An offence punishable under this Ordinance shall be non-cognizable."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Appeal.―(1) Any person sentenced by a Court under this Ordinance may prefer an appeal",
      "content": "to the High Court within thirty days of the judgment.\n(2) The provisions of sections 5 and 12 of the Limitation Act, 1908 (IX of 1908), shall be\napplicable to an appeal preferred under subsection (1)."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Public enforcement.― (1) Any person whomsoever may make an application in writing",
      "content": "to the Board or d Provincial Committee concerning contravention of any of the provisions of this\nOrdinance or the rules.\n(2) In the event an investigation reveals an offence, the Board or a Provincial Committee, as\nthe case may be, shall follow the procedure specified in section 13 for recommending prosecution.\n__________"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Revocation or suspension of license, etc.―(1) Where any person; except a medical",
      "content": "practitioner, has, been found to have contravened any of the provisions of this Ordinance or the rules\nthe concerned authority upon written recommendation of the Board or a Provincial Committee, as\nthe case may be, and after giving such person an opportunity of being heard, tray recommend to the\nFederal Government to suspend or cancel, his license for the practice of his profession or occupation,\nor for the pursuit of his business.\n(2) In the case of a contravention involving a medical practitioner registered under the Medical\nand Dental Council Ordinance, 1962 (XXXII of 1962), the matter shall be referred to the Pakistan\nMedical and Dental Council for further action."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Penalties",
      "content": "_(1) Any manufacturer or distributor who contravenes the provisions of\nsubsections (1) to (7) of section?, subsection (1) of section 8, subsections (1), (3) (4) or (5) of section"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Responsibility of an individual for the act of a company, corporation, partnership or",
      "content": "an institution. __Where the offence is found to have been committed by a company, corporation,\npartnership or an institution, as a result of an institutional or operational instructions issued by\nit or implemented by it, the company, corporation. partnership or the institution may be found\nguilty in addition to the individuals directly responsible for the commission of such offence."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Power to make rules",
      "content": "_(1) The Federal Government may, by notification in the official\nGazette, make rules for carrying out the purposes of this Ordinance.\n(2) A Provincial Government may, by notification in the official Provincial Gazette, made\nrules for the administration of a Provincial Committee in a Province."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Power to delegate.",
      "content": "_The Federal Government may delegate any of .the functions and its\npowers under this Ordinance to a Provincial Government."
    }
  ],
  "definitions": [
    {
      "term": "infant",
      "definition": "a child up to the age of twelve months;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the National Infant Feeding Board constituted under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "container",
      "definition": "any form of packaging of adesignated product for sale as a retail unit;",
      "source_provision": "sec2"
    },
    {
      "term": "complementary food",
      "definition": "any ford suitable as an addition to breast milk or to a breast milk substitute when either becomes insufficient to satisfy the nutritional requirements of an infant, also commonly called “weaning food” or “breast milk and young child supplement”:",
      "source_provision": "sec2"
    },
    {
      "term": "infant-formula",
      "definition": "an animal or vegetable based milk product manufactured in accordance with the standards recommended by the Codex Alimentarius Commission and the Codex Code of Hygienic Practice for Foods for Infants and Children to approximate the normal nutritional requirements of an infant up to the age of six months;",
      "source_provision": "sec2"
    },
    {
      "term": "feeding bottle",
      "definition": "any bottle or receptacle marketed for the purpose of feeding an infant or a young child;",
      "source_provision": "sec2"
    },
    {
      "term": "nipple shield",
      "definition": "an appliance with a teat for a baby to suck from the breast;",
      "source_provision": "sec2"
    },
    {
      "term": "pacifier",
      "definition": "an artificial teat for babies to suck also called “dummy”;",
      "source_provision": "sec2"
    },
    {
      "term": "follow-up formula",
      "definition": "an animal or vegetable based milk product marketed for infants older than six months or young child and formulated industrially in accordance with the standards of the Codex Alimentarius Commission and the Codex Code of Hygienic Practice for Foods for Infants and Children;",
      "source_provision": "sec2"
    },
    {
      "term": "distributor",
      "definition": "any person engaged in the business of marketing, whether wholesale or retail, and includes a person providing product public relations and information services;",
      "source_provision": "sec2"
    },
    {
      "term": "health care facility",
      "definition": "a Government, non-Government, semi Government or private institution or organization, or private medical practitioner engaged, directly or indirectly, in the provision of health care to infants, young children,. pregnant women or mothers, and includes a day-care centre, nursery and any other child-care institution;",
      "source_provision": "sec2"
    },
    {
      "term": "health professional",
      "definition": "a medical practitioner, nurse, nutritionist or such other persons as the Federal Government may, by notification in the official Gazette, specify;",
      "source_provision": "sec2"
    },
    {
      "term": "health worker",
      "definition": "any person providing services to infants, young children, pregnant women or mothers as a medical practitioner, and includes a health professional, homeopath practitioner, hakim, nurse. midwife, traditional birth attendant,, pharmacist,- dispensed chemist, nutritionist, hospital administrator or employee, whether professional or not whether paid or not, and any other person providing such services as the Federal Government tray by notification in the official Gazette, specify;",
      "source_provision": "sec2"
    },
    {
      "term": "Inspector",
      "definition": "any person designated as Inspector under section 12;",
      "source_provision": "sec2"
    },
    {
      "term": "label",
      "definition": "any tag, mark, pictorial or other descriptive matter which is written, printed, stenciled, marked, embossed, attached or otherwise appearing on a container;",
      "source_provision": "sec2"
    },
    {
      "term": "manufacturer",
      "definition": "a person, corporation or other entity engaged or involved in the business of producing, processing, compounding, formulating, filling, packing, repacking, altering, ornamenting, finishing and labelling a designated product, whether directly, through an agent, or through a person controlled by or under an agreement;",
      "source_provision": "sec2"
    },
    {
      "term": "market",
      "definition": "any, method of introducing or selling a designated product, and includes, but not limited to, promotion, distribution, advertising, distribution of samples, product public relations and product information services;",
      "source_provision": "sec2"
    },
    {
      "term": "person",
      "definition": "any individual, partnership, association, unincorporated organization, company, cooperative, corporation, trustee, agent or any group of persons;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules",
      "source_provision": "sec2"
    },
    {
      "term": "Provincial Committee",
      "definition": "a Provincial Infant Feeding Committee constituted udder section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Ordinance; and",
      "source_provision": "sec2"
    },
    {
      "term": "sample",
      "definition": "any quantity of a designated product provided free of cost. _________",
      "source_provision": "sec2"
    }
  ]
}
