{
  "id": "pk-protection-of-communal-properties-of-minorities-ordinance-2001",
  "type": "statute",
  "title": "Protection of Communal Properties of Minorities Ordinance, 2001",
  "title_en": "Protection of Communal Properties of Minorities Ordinance, 2001",
  "short_name": "POCPO",
  "status": "in_force",
  "issued_date": "2002-01-21",
  "in_force_date": "2002-01-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FrbZ4%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Protection of Communal Properties of Minorities Ordinance, 2001 (V of 2002) published by The Pakistan Code (Land/Property Laws).",
  "provisions": [
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power to make rules",
      "content": "ORDINANCE, 2001\nORDINANCE NO. V OF 2002\n[22nd January, 2002]\nAN\nto protect the properties of minority communities meant for their communal use\nWHEREAS in view of prevailing circumstances, it is the demand of the minority\ncommunities to protect their properties meant for their communal use ;\nAND WHEREAS the President is satisfied that circumstances exists which render it\nnecessary to take immediate action ;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth\nday of October, 1999, and the Provisional Constitution Order No.1 of 1999, read with the\nProvisional Constitution (Amendment) Order No.9 of 1999, and in exercise of all powers\nenabling him in that behalf, the President of the Islamic Republic of Pakistan is pleased to make\nand promulgate the following Ordinance :—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, commencement and application.― (1) This Ordinance may be",
      "content": "called the Protection of Communal Properties of Minorities Ordinance, 2001.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once.\n(4) It shall apply to properties belonging to the minority communities in Pakistan meant\nfor their communal use."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definition",
      "content": "In this Ordinance, unless there is anything repugnant in the subject or\ncontext,—\n(a)    “Commission” means the National Commission for Minorities.\n(b)    “Property” means places of worship, monasteries, seminaries, vicarages,\ndharamshalas, gaoshalas, burial places, community centers, social welfare,\neducational, health and recreational institutions meant for communal use of\nminority communities and includes side buildings, vacant places, lands,\nresidential places or offices annexed to the said properties."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Ban on sale or transfer of minority communities properties",
      "content": "(1) No property of a\nminority community meant for its communal use shall be bought, sold or transferred by any\nperson without NOC from the Federal Government :\nProvided that nothing contained herein shall apply to a property bought, sold or\ntransferred for a Housing Scheme, meant for a minority community, approved by a\nProvincial or Federal Government.\n(2) The N.O.C. referred to in sub-section (1) may be given by the Federal Government on\nthe recommendation of the National Commission for Minorities."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Ordinance not to apply to evacuee trust properties",
      "content": "_ Nothing in this Ordinance\nshall apply to the evacuee trust properties forming party of Trust Pool and vested in the Federal\nGovernment under the Evacuee Trust Properties (Management and Disposal) Act, 1975 (XIII of\n1975)."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Punishment",
      "content": "Whoever buys, sells or transfers any property belonging to a minority\ncommunity meant for its communal use in violation of section 3, shall be punishable with\nimprisonment of either description which may extend to seven years and shall also be liable to\nfine which shall not be less than one hundred thousand rupees and the sale or transfer transaction\nshall be of no legal effect."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Removal of difficulties",
      "content": "_ If any difficulty arises in giving effect to any of the\nprovision of this Ordinance, the Federal Government may make such order, not inconsistent with\ndifficulty."
    }
  ],
  "definitions": [
    {
      "term": "Commission",
      "definition": "the National Commission for Minorities.",
      "source_provision": "sec2"
    },
    {
      "term": "Property",
      "definition": "places of worship, monasteries, seminaries, vicarages, dharamshalas, gaoshalas, burial places, community centers, social welfare, educational, health and recreational institutions meant for communal use of minority communities and includes side buildings, vacant places, lands, residential places or offices annexed to the said properties.",
      "source_provision": "sec2"
    }
  ]
}
