{
  "id": "pk-protection-of-economic-reforms-act-1992",
  "type": "statute",
  "title": "Protection of Economic Reforms Act, 1992",
  "title_en": "Protection of Economic Reforms Act, 1992",
  "short_name": "POERA",
  "status": "in_force",
  "issued_date": "1992-11-30",
  "in_force_date": "1992-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apmZaQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Protection of Economic Reforms Act, 1992 (XII of 1992) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title extent and commencement",
      "content": "(1)This Act, may be called the Protection of\nEconomic Reforms Act, 1992.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,—\n(a)     “Government” includes both the Federal Government and any\nProvincial Government;\n(b)     “economic reforms” means economic policies and programmes, laws\nand regulations announced, promulgated or implemented by the\nGovernment on and after the seventh day of November, 1990, relating\nto privatization of public sector enterprises, and nationalized banks,\npromotion of savings and investments, introduction of, fiscal incentives\nfor industrialization and deregulation of investment, banking, finance,\nexchange and payments systems, holding and transfer of currencies;\nand\n(c)     all other expressions used in this Ordinance shall have the\nmeaning respectively assigned to them under the relevant laws."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Act to Override other laws. The provisions of this Act shall have effect notwithstanding",
      "content": "anything contained in the Foreign Exchange Regulation Act, 1947 (VII of 1947), the Customs\nAct, 1969 (IV of 1969), the Income Tax Ordinance, 1979 (XXXI of 1979), or any other law for the\ntime being in force."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Freedom to bring, hold, sell and take out foreign currency",
      "content": "(1) All citizens of\nPakistan resident in Pakistan or outside Pakistan and all other persons shall be entitled and free to\nbring, hold, sell, transfer and take out foreign exchange within or out of Pakistan in any form and\nshall not be required to make a foreign currency declaration at any stage nor shall anyone be\nquestioned in regard to the same.\n1\n[(2) Nothing in sub-section (1) shall apply to\n(a)       any foreign exchange borrowed under any general permission given by the\nState Bank of Pakistan under sub-section (1) of section 4 of the Foreign\nExchange Regulations Act, 1947 (VII of 1947);\n(b)       any payment from abroad for good exported from Pakistan;\n(c)       proceeds of securities issued or sold to non-residents;\n(d)       any payment received from abroad for services rendered in, or from Pakistan;\n(e)       earnings or profits of the overseas offices or branches of Pakistani firm\nand companies including banks; and\n(f)       any foreign exchange purchased from an authorized dealer in Pakistan for any\npurpose.]"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Immunities to foreign currency accounts",
      "content": "(1) All citizens of Pakistan resident in\nPakistan or outside Pakistan who hold foreign currency accounts in Pakistan, and all other persons\nwho hold such accounts, shall continue to enjoy immunity against any inquiry from the Income Tax\nDepartment or any other taxation authority as to the source of financing of the foreign currency\naccounts 1[:]\n1\n[Provided that such immunity shall not be available to citizens of Pakistan residing in\nPakistan and to firms, companies and other bodies registered or incorporated in Pakistan in respect of\nany new foreign currency account opened or deposits created on or after the 16th day of December,\n1999 or to any incremental deposits thereafter in an existing foreign currency account]; and\n(2) The balances in the foreign currency accounts and income there from shall continue to\nremain exempted from the levy of wealth-tax and income tax and compulsory deduction of Zakat at\nsource. 1[:]\n1\n[Provided that such exemption shall not be available to citizens of Pakistan residing in\nPakistan and to firms, companies and other bodies registered or incorporated in Pakistan in respect of\nany balance n a new foreign currency account opened or deposits created on or after the 16 th day of\nDecember, 1999 or to incremental deposits created on or after the 16th day of December, 1999 in an\nexisting foreign currency account and income therefrom.]\n(3) The banks shall maintain complete secrecy in respect of transactions in the foreign\ncurrency accounts.\n1\nNumbered, added and subs. by Ordinance 21 of 1999, ss.2 & 3.\n(4) The State Bank of Pakistan or other banks shall not impose any restrictions on deposits in\nand withdrawals from the foreign currency accounts and restrictions if any shall stand withdrawn\nforthwith."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Protection of fiscal incentives for setting",
      "content": "up of industries. The fiscal incentives for\ninvestment provided by the Government through the statutory orders listed in the Schedule or\notherwise notified shall continue in force for the term specified therein and shall not be altered to the\ndisadvantage of the investors."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Protection of transfer of ownership to private sector. The ownership, management and",
      "content": "control of any banking, commercial, manufacturing or other company, establishment or enterprise\ntransferred by the Government to any person under any law shall not again be compulsorily acquired\nor taken over by the Government for any reason whatsoever."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Protection of foreign and Pakistani Investment. No foreign, industrial or commercial",
      "content": "enterprise established or owned in any form by a foreign or Pakistani investor for private gain in\naccordance with law, and no investment in share or equity of any company, firm, or enterprise, and\nno commercial bank or financial institution established, owned or acquired by any foreign or\nPakistani investor, shall be compulsorily acquired or taken over by the Government."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Secrecy of Banking Transaction. Secrecy of bonafide banking transactions shall be",
      "content": "strictly observed by all banks and financial institutions, by whosoever owned, controlled or managed."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Protection of financial obligation. All financial obligations incurred including those",
      "content": "under any instrument, or any financial and contractual commitment made by or on behalf of the\nGovernment shall continue to remain in force, and shall not be altered to the disadvantage of the\nbeneficiaries."
    }
  ],
  "definitions": [
    {
      "term": "Government",
      "definition": "both the Federal Government and any Provincial Government;",
      "source_provision": "sec2"
    },
    {
      "term": "economic reforms",
      "definition": "economic policies and programmes, laws and regulations announced, promulgated or implemented by the Government on and after the seventh day of November, 1990, relating to privatization of public sector enterprises, and nationalized banks, promotion of savings and investments, introduction of, fiscal incentives for industrialization and deregulation of investment, banking, finance, exchange and payments systems, holding and transfer of currencies; and (c) all other expressions used in this Ordinance shall have the meaning respectively assigned to them under the relevant laws.",
      "source_provision": "sec2"
    }
  ]
}
