{
  "id": "pk-protection-of-journalists-and-media-professionals-act-2021",
  "type": "statute",
  "title": "Protection of Journalists and Media Professionals Act, 2021",
  "title_en": "Protection of Journalists and Media Professionals Act, 2021",
  "short_name": "POJAM",
  "status": "in_force",
  "issued_date": "2021-11-30",
  "in_force_date": "2021-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5hq-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Protection of Journalists and Media Professionals Act, 2021 (XXIII of 2021) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Protection of\nJournalists and Media Professionals Act, 2021.\n(2)   It shall extend to the whole of Pakistan.\n(3)   It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the subject or\ncontext,—\n(a)    “Act” shall mean the Protection of Journalists and Media Professionals Act,\n2021;\n(b)    “Authority” means the Authority established under the Legal Aid and Justice\nAuthority Act, 2020;\n(c)    “Commission” means the Independent Commission for the Protection of\nJournalists and Media Professionals, constituted under Section 12 of this Act;\n(d)    “Compensation” means grant/donation/compensatory relief in terms of money\nto be provided from federal and respective provincial funds/ programs/schemes,\nin case of a journalist’s accidental death/injury while performing his/her duties;\n(e)   “Constitution” means the Constitution of the Islamic Republic of Pakistan;\n(f)   “Federal Ombudsman” means the Ombudsman established under the\nHarassment Against Women at Workplace Act, 2012;\n(g)   “Government” means the Federal Government;\n(h)   “Harassment” means any unwelcome sexual advance, or request for sexual\nfavours or other verbal or written communication, or physical conduct of a\nsexual nature or sexually demeaning attitudes, that causing interference with\nwork performance or creating an intimidating, hostile or offensive work\nenvironment, or the attempt to punish the complainant for refusal to comply to\nsuch a request or is made a condition for employment;\n(i)   “Intimidation” means threatening a person with any injury to his person,\nreputation or property, or to the person or reputation of any one in whom that\nperson is interested, with intent to cause alarm to that person, or to cause that\nperson to do any act which he is legally bound to do, or to omit to do any act\nwhich he is legally bound to do, as the means of avoiding the execution of such\nthreat;\n(j)   “Journalist” means any person who is professionally or regularly engaged by a\nnewspaper, magazine, news website or other news broadcast medium (whether\nonline or offline), or any person with a substantial track record of freelancing\nfor at least three years for any newspaper, magazine, news website or other\nnews broadcast medium;\n(k)   “Media professional” includes any other person regularly or professionally\nengaged in the collection, processing and dissemination of information to the\npublic via any means of mass communication, including cameraperson and\nphotographers, technical supporting staff, drivers and interpreters, editors,\ntranslators, publishers, broadcasters, printers and distributors;\n(l)   “Media owner” means the owner of a media house or agency which collects\nand disseminates consumers news, features, comments, photographs and\ngraphics through any means of communications;\n(m)   “Non-journalist” means a person who is employed mainly in a managerial or\nadministrative capacity in a media organization, or is being employed there in\na supervisory capacity, performs, either by the nature of the duties attached to\nhis office or by reason of the powers vested in him, functions mainly of a\nmanagerial / administrative nature.\n(n)   “Sources” mean any book, publication, person or organization that discloses\ninformation forming the substance/subject of work undertaken by any\njournalist, reporter or media professional;\n(o)   “Schedule” means a Schedule to this Act;\n(p)   “Torture” means an act committed by which severe pain or suffering, whether\nphysical or mental, is intentionally inflicted on a person for such purposes as\nobtaining from him or a third person information or a confession, punishing him\nfor an act he or a third person has committed or is suspected of having\ncommitted, or intimidating or coercing him or a third person, or for any reason\nbased on discrimination of any kind, when such pain or suffering is inflicted by\nor at the instigation of or with the consent or acquiescence of a public official\nor other person acting in an official capacity. It does not include pain or\nsuffering arising only from, inherent in or incidental to lawful sanctions.\n(2) All other words and expressions used but not defined in this Act shall have the same\nmeanings as may be assigned to them under all applicable laws in Pakistan including the Pakistan\nPenal Code (Act XLV of 1860), Code of Criminal Procedure, 1898 (Act V of 1898), and Qanoon-e-\nShahadat, 1984 (P.O. No. X of 1984)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Right to life and protection against ill treatment",
      "content": "(1) The Government shall ensure\nthat every journalist and media professionals right to life and security of person, as contained in Article\n9 of the Constitution, is safeguarded, and that no such individual is subjected to ill-treatment.\n(2)     No person or institution, whether private or public, shall engage in any act that violates\nthe right to life and security of any journalist or media professional.\n(3) In order to maintain the independence, impartiality and freedom of journalists and media\nprofessionals, the Government shall take steps to ensure that existing or future counter- terrorism or\nnational security laws are not utilized arbitrarily to hinder the work and safety of journalists and media\nprofessionals, including through arbitrary arrest or detention, or the threat thereof.\n(4) The Government shall ensure that effective measures are taken to protect journalists and\nmedia professionals against forced or involuntary disappearances, kidnapping, abduction or other\nmethods of coercion.\n(5) The Government shall ensure that journalists and media professionals are allowed to\ncarry out their journalistic work in conflict-affected areas within the country, without threats,\nintimidation, harassment or fear of persecution or targeting.\n(6) If the Commission finds that any institution or organization is, directly or indirectly,\ninvolved in violating, or attempting to violate, the rights to life and protection against ill treatment\nsafeguarded in sub-section (1) above, it shall report the same to the Federal Government and\nrecommend appropriate course of action against the perpetrator(s) of these violations."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Right to privacy and non",
      "content": "disclosure of sources.— (1) Each journalist and media\nprofessional shall have the right to privacy, which includes protection of the law against interference\nwith his/her home, correspondence, and family.\n(2) The Government shall ensure that no person, officer, agency or institution unlawfully or\narbitrarily interferes with the right to privacy of any journalist, reporter or media professional and\nhis/her home, correspondence (including electronic correspondences) and family.\n(3) The Government shall ensure that no journalist, reporter or media professional is forced,\ninduced, compelled, coerced or threatened for the disclosure of his/her sources of information by any\nperson, officer, agency, authority or institution save without due process of the law.\n(4) The Government shall make efforts to safeguard the confidentiality of sources, of\njournalists or media professionals."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Independence in the performance of duties",
      "content": "(1) No journalist or media professional\nshall be subjected to any unlawful or arbitrary restrictions on their ability to perform their work\nindependently, and without undue interference.\n(2) Any restriction on the right to freedom of expression of journalists or media professionals\nmust be in accordance with the existing laws, and must only be imposed if it is necessary for respect\nof the rights or reputations of others, or if such restriction is levied against material that advocates\nnational, racial or religious hatred that constitutes incitement to discrimination, hostility or violence.\n(3)    Any restriction imposed under Section 5(2) of this Act must:\n(i)    be easily accessible to the public;\n(ii)   comply with the principles of legality, necessity and proportionality; and\n(iii)   be formulated with sufficient precision to enable a journalist, reporter or media\nprofessional to adjust his or her conduct accordingly."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Good faith obligation of journalists and media professionals",
      "content": "(1) All journalists and\nmedia professionals must respect the rights or reputations of others and not produce material that\nadvocates national, racial, ethnic, religious, sectarian, linguistic, cultural or gender-based hatred,\nwhich may constitute incitement to discrimination, hostility or violence.\n(2) All journalists and media professionals must not engage in the dissemination of material\nknown by such an individual to be false or untrue.\n(3) The journalists who fail to fulfill obligations in sub-section (1) and (2) will be tried in\naccordance with the relevant laws."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Protection from abusive, violent and intolerant behaviour",
      "content": "(1) The Government\nshall take all steps to protect journalists and media professionals from all forms of abuse, violence and\nexploitation through any medium (including electronic communications) at the hands of any person,\ninstitution (private or public) or authority.\n(2) Whenever any act of abuse, violence or intolerant behaviour is committed against any\njournalist, reporter or media professional, whether perpetrated by a private or public person,\ninstitution or authority, the aggrieved journalist or media professional shall file a complaint within a\nperiod of fourteen (14) days, against the same before the Commission created under section 12 of the\nAct.\n(3) Upon receipt of information identified in Section 7(2) of this Act, the Commission shall,\nwithin a period of fourteen (14) days, take all necessary actions to investigate and prosecute such acts\nof abuse, violence or intolerant behaviour, and to take appropriate measures under law to provide\nprotection to the concerned journalist, reporter or media professional in the manner prescribed under\nthis Act."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Protection against harassment",
      "content": "(1) The Government shall ensure that every\njournalist, reporter and media professional is protected against harassment, as defined in Section 2(h)\nof this Act.\n(2) Whenever any act of harassment is committed against any journalist or media\nprofessional, whether perpetrated by a private or public person, institution or authority, the aggrieved\nperson may file a complaint against the same before the Federal Ombudsman within a period of\nfourteen (14) days.\n(3)    Upon receipt of information identified in Section 8(2) of this Act, the Federal\nOmbudsman or the relevant authority shall, within a period of fourteen days, take all necessary actions\nto investigate and prosecute such acts of harassment, and to take appropriate measures under the law\nto provide protection to the concerned journalist, reporter or media professional."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Institution of the Journalists Welfare Scheme",
      "content": "(1) The provision of adequate\ntraining and guarantee of insurance will be governed in accordance with this provision, under the\n“Journalists Welfare Scheme”\n(2) Compliance with the requirements of the Scheme, established pursuant to sub-section (1)\nof Section 9 of this Act, shall be the responsibility of each media owner.\n(3)   The operation of the Journalists Welfare Scheme shall be governed under Schedule-I of\nthis Act.\n(4) The Journalists Welfare Scheme requires each Media Owner to produce a\ncomprehensive, written safety policy and protocols for journalists and media professionals."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Obligation to investigate, prosecute and penalize threats, coercion, acts of violence",
      "content": "and abuse of journalists, and media professionals.— (1) Where any person acts in a threatening,\ncoercive, abusive or violent manner, or conspires to act in a threatening, coercive, abusive or violent\nmanner, or aids and abets a threatening, coercive, abusive or violent act with the intent to undermine\nthe Commission.\n(2)  The Commission shall take appropriate steps to ensure accountability for such acts by\nconducting impartial, prompt, thorough, independent and effective investigations into all such reports.\nThe Commission may set up an advisory committee to determine whether the complaint should\nbe taken up or not.\n(3)    Following the required investigations under section 10(2) of the Act, the Commission\nshall ensure that all perpetrators are prosecuted and simultaneously ensure that the aggrieved\njournalists have access to adequate and effective remedies:\nProvided that if a journalist cannot afford access to legal aid the Commission may refer the\ncase of the aggrieved journalist to the Authority who shall ensure free of cost legal aid to the victim."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Combating impunity",
      "content": "(1) No threatening, coercive, abusive or violent Act, committed\nagainst journalists or media professionals, shall be exempt from immediate and effective investigation\nand prosecution.\n(2) The Government shall develop and implement strategies for combating impunity for\nthose engaging in conduct mentioned in section 11(1) of this Act, particularly with regard to the\nfollowing:\n(i)      Monitoring and conducting investigations into cases reported by journalists, media\nprofessionals, their families or civil society organizations working on journalists’\nprotection;\n(ii)     Coordinating policy and action between relevant government authorities;\n(iii) Ensuring the participation of journalists, and media professionals, and/or their families,\nin processes aimed at guaranteeing their protection and safety.\n(3) The Government will implement best practices provided for in the United Nations Plan of\nAction on Safety of Journalists and the Issue of Impunity."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Establishment of a Commission for the Protection of Journalists and Media",
      "content": "Professionals.— (1) The Federal Government shall constitute an independent commission to be\nknown as the Commission for the Protection of Journalist and Media Professionals (CPJMP) to\nexercise the powers and perform the functions under this Act.\n(2)      The Commission shall consist of:\n(i)      A Chairperson, who has demonstrable knowledge of, or practical experience of\nminimum twenty years in, matters relating to law, justice and human rights;\n(ii)     A member of Pakistan Bar Council duly nominated by the Pakistan Bar Council;\n(iii)     Four journalists with over 25 years of experience nominated by the Pakistan Federal\nUnion of Journalists (PFUJ), one nominated member from each Islamabad Union of\nJournalists, Karachi Union of Journalists, Lahore Union of Journalists, Quetta Union of\nJournalists and Peshawar Union of Journalists;\n(iv)     One member who is a Secretary of the National Press Club (NPC);\n(v)      One member who is Secretary of Parliamentary Reporters Association; and one member\nwho is Secretary Supreme Court Reporters Association;\n(vi)      One representative of the Ministry of Human Rights, as nominated by Ministry of\nHuman Rights (ex-officio); and\n(vii)     One representative of Ministry of Information and Broadcasting not less than the rank\nof Joint Secretary (ex-officio);\n(viii)    Secretary of the Commission who shall not have a right to vote.\n(3) The Commission may co-opt any person having demonstrable knowledge of, or practical\nexperience in, matters relating to journalism as a member.\n(4) The Secretary of the Commission shall be appointed by the Commission in the prescribed\nmanner.\n(5)   Provided that at least three members of the Commission shall be women."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Appointment of Chairperson",
      "content": "(1) The Ministry of Human Rights in consultation with\nMinistry of Information and Broadcasting shall, invite suggestions for appointment as Chairperson\nof the Commission and, after proper scrutiny, shall submit a list of three persons to the Federal\nGovernment.\n(2) The Federal Government shall appoint a Chairperson from the names submitted by the\nMinistry of Human Rights."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Term of office of the Chairperson and members",
      "content": "(1) A person appointed as\nChairperson or a member shall hold office initially for a term of two years from the date on which\nhe/she enters upon his/her office extendable for another two years:\nProvided that the term of the office may be extended once.\n(2) The Chairperson or a member may resign from his/her office in writing under his/her hand\naddressed to the President and on acceptance of the resignation; such vacancy shall be filled within\n30 days."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Removal of the Chairperson and members",
      "content": "The Chairman and members may be\nremoved from office by the Federal Government if they are found to be:\n(a)   guilty of misconduct; or\n(b)   guilty of unsatisfactory performance; or\n(c)   unfit to continue in office by reason of being mentally or physically challenged and\nstands so declared by a competent medical authority; or\n(d) convicted of any offence involving moral turpitude been sentenced to imprisonment for\na term of not less than two years:\nProvided that the Federal Government may remove the Chairperson or members on any one\nof the grounds listed above."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Terms and conditions of service of members including Chairperson",
      "content": "The salary of\nthe Chairperson and other administrative allowances payable to, and terms and conditions of service\nof the members, shall be such as may be prescribed by the Federal Government in consultation with\nthe Commission.\n(2) The salary of the Chairperson and other administrative expenses of the Commission shall\nbe made from funds allocated by the Federal Government:\nProvided that neither the salary of Chairperson and allowances nor the terms and\nconditions of service of a member shall be 'varied to his/her disadvantage after the appointment:\nProvided further that the members of the commission shall, based on their areas of competence\nand expertise, perform their functions in an honorary capacity to assist the Chairperson of the\nCommission."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Functions of the Independent Commission",
      "content": "(1) The Commission shall perform all\nor any of the following functions, namely:—\n(a) On a petition presented to it by an aggrieved journalist, reporter or other media professional\nor any person on his/her behalf, or on its own motion inquire into complaints of —\n(i) Threats or acts of torture, killing, violent attacks, forced disappearance, arbitrary\narrest, arbitrary detention and harassment; or\n(ii) Negligence in the prevention of such violations, as listed in Part II of this Act, by a\npublic servant.\n(b) Produce an annual report on the state of media freedom and safety to be tabled before the\nParliament, through the Ministry of Human Rights, and submit any other independent\nreports, as and when considered necessary, to the Ministry of Human Rights.\n(c) Determine whether an affected journalist is eligible for compensation and recommend the\ncase of compensation to a victim Journalist or their legal heirs in case of their having been\nkilled to a notified officer under any provincial compensatory framework already\nestablished by the provincial and Federal Governments.\n(d) Facilitate the provision of legal aid to aggrieved journalists if the circumstances so require\nthrough the Authority.\n(e) Take such necessary measures to ensure that the laws governing the employment and\nwelfare of journalists are being implemented in the letter and the spirit.\n(f)   Such other functions as it may consider necessary for the protection of the right of\njournalists protected under this Act."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Procedure of the Independent Commission",
      "content": "(1) The Commission shall regulate its\nown procedure.\n(2)  All decisions, directions and orders of the Commission shall be duly authenticated by the\nChairperson of the Commission or by any other member of the Commission duly authorized by the\nChairperson in this behalf.\n(3) The quorum for a meeting of the Commission shall not be less than one-half of the total\nmembership of the Commission.\n(4) The Commission shall take decisions in accordance with the views of the majority of its\nmembers present and, in case of a deadlock, the member presiding the meeting shall have a casting\nvote."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Inquiry into complaints",
      "content": "The Commission, while inquiring into complaints by a\njournalist, media professional or other duly authorized individual on behalf of such journalist or media\nprofessional, may call for information from the Federal Government, a Provincial Government, the\nintelligence agencies or any other authority or organization, subordinate thereto, within such time as\nmay be specified by it:\nProvided that if the information or report is not received within the time stipulated by the\nCommission, it may proceed to inquire into the complaint on its own."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Powers relating to inquiries",
      "content": "(1) The Commission shall, while inquiring into\ncomplaints under this Act, have all the following powers of a civil court trying a suit under Code of\nCivil Procedure, 1908, in respect of the following matters namely:—\n(a)     ordering an inquiry on a complaint or on its own motion;\n(b)     calling for information report, document, data or any other evidence from ministry,\ndepartment, authority of the Federal Government or Provincial Government or law\nenforcement agency, or any other authority or organization, subordinate thereto, within\nsuch time as may be specified by it.\n(c)     summoning and enforcing the attendance of witnesses and examining them under oath;\n(d)     discovery and production of documents;\n(e)     receiving evidence on affidavits;\n(f)     issuing commissions for the examination of witnesses or documents; and\n(g)     any other matter which may be prescribed:\nProvided that upon receipt of direction from the Commission, the concerned ministry,\ndepartment, authority or law enforcement agency shall, within a period of fourteen\ndays, take all necessary actions to investigate and prosecute such acts of abuse, violence\nor intolerant behaviour, and to take appropriate measures under law to provide\nprotection to the concerned journalist, reporter or media professional;\nFurther provided that the ministry, department, authority or law enforcement agency to\nwhom such direction has been passed shall inform the Commission of the progress of\nlegal or disciplinary action, as the case may be, on a periodicity as directed by the\nCommission.\n(2) The Commission shall be deemed to be a civil court to the extent that is described in\nsections 175, 178, 179, 180 and 228 of the Pakistan Penal Code, 1860 (Act XLV of 1860). If any of\nthe offences listed above are committed in the view or presence of the Commission, the Commission\nshall, after recording the facts constituting the offence and the statement of the accused as provided\nfor in the Code of Criminal Procedure, 1898 (Act V of 1898), forward the case to a Magistrate having\njurisdiction to try the same and the Magistrate to whom any such case is forwarded shall proceed to\nhear the complaint against the accused as if the case has been forwarded to him under section 346 of\n(3) Every proceeding before the Commission shall be deemed to be a judicial proceeding\nwithin the meaning of sections 193, 196 and 228 of the Pakistan Penal Code, 1860 (Act XLV of 1860).\n(4) The Commission may establish such Committees from amongst its Members and officials\nas it deems fit and may refer to them any matter for consideration and report. The Commission may,\nif it considers necessary, coopt to a Committee any person possessing special knowledge and expertise\non the relevant subject."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Power to make Rules",
      "content": "The Commission may, by notification in the official Gazette\nmake rules for carrying out the purposes of this Act within six months of commencement of the Act."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Indemnity Clause",
      "content": "No suit, prosecution or other legal proceeding shall lie against the\nmembers of the Commission or its officers for anything done in his / her official capacity which is\ndone in good faith or intended to be done under this Act or the rules, instructions or directions made\nor issued hereunder."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Application of the Act",
      "content": "The provisions of this Act shall be complied with and\nimplemented equally in times of armed conflict, internal conflict and during peacetime."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to any of the provisions\nof this Act, the Government may, within a period of one year from the date of commencement of this\nAct make such order, not inconsistent with the provisions of this Act, as may appear to be necessary,\nfor the purpose of removing the difficulty.\nJournalists Welfare Scheme\nPart A: Obligation to Ensure:\n(1) Media owners have a legal obligation to provide life and health insurance coverage to\neach journalist or media professional, provided the journalist or media professional satisfies any of the\nfollowing criteria:\n(a) Has a long-term contract (for any period exceeding one year) with the media house;\n(b) Has entered into a short-term contract (for any period under one year) with the media\nhouse; or\n(c) Has been employed to work in a dangerous location even where no contract exists.\n(2) Media owners shall have a legal obligation to pay the Journalists on time and not\nunnecessarily withhold the remuneration of the journalists.\n(3)    Media owners shall have a legal obligation to ensure that there is at least one female\nmember in the management board or any governing body, as the case may be, of the media\norganization.\nPart B: Obligation to Provide Adequate and Effective Training:\n(1) Each journalist or media professional shall receive mandatory/compulsory safety\ntraining, based on mandatory written policies and protocols, including safety protocols of the Media\nHouse:\n(a) Within the first month of recruitment; and\n(b)   Prior to engaging in any reporting or journalistic work in any location.\n(2) The safety training mentioned in Section (1) of Part B of this Schedule is to be provided\nfree-of-cost by media owners.\n(3) For journalists and media professionals in dangerous locations, intensive training must\nbe provided free-of-cost by media owners to ensure:\n(a)   Awareness of risks associated with their profession in the particular location;\n(b)   Understanding of the safety rules and procedures that must be observed;\n(c)    Effective capacity building of journalists, and media professionals in the following\nareas:\n(i)     Health and Environmental Hazards Training (HEHT);\n(ii)    Avoidance, Deterrence and Escape Training (ADET); and\n(iii)   Kidnapping and Crises Responses Training (KCRT).\n___________________\nRGN Date: 04-12-2025"
    }
  ],
  "definitions": [
    {
      "term": "Act",
      "definition": "the Protection of Journalists and Media Professionals Act, 2021;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "the Authority established under the Legal Aid and Justice Authority Act, 2020;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the Independent Commission for the Protection of Journalists and Media Professionals, constituted under Section 12 of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Compensation",
      "definition": "grant/donation/compensatory relief in terms of money to be provided from federal and respective provincial funds/ programs/schemes, in case of a journalist’s accidental death/injury while performing his/her duties;",
      "source_provision": "sec2"
    },
    {
      "term": "Constitution",
      "definition": "the Constitution of the Islamic Republic of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "Federal Ombudsman",
      "definition": "the Ombudsman established under the Harassment Against Women at Workplace Act, 2012;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "Harassment",
      "definition": "any unwelcome sexual advance, or request for sexual favours or other verbal or written communication, or physical conduct of a sexual nature or sexually demeaning attitudes, that causing interference with work performance or creating an intimidating, hostile or offensive work environment, or the attempt to punish the complainant for refusal to comply to such a request or is made a condition for employment;",
      "source_provision": "sec2"
    },
    {
      "term": "Intimidation",
      "definition": "threatening a person with any injury to his person, reputation or property, or to the person or reputation of any one in whom that person is interested, with intent to cause alarm to that person, or to cause that person to do any act which he is legally bound to do, or to omit to do any act which he is legally bound to do, as the means of avoiding the execution of such threat;",
      "source_provision": "sec2"
    },
    {
      "term": "Journalist",
      "definition": "any person who is professionally or regularly engaged by a newspaper, magazine, news website or other news broadcast medium (whether online or offline), or any person with a substantial track record of freelancing for at least three years for any newspaper, magazine, news website or other news broadcast medium;",
      "source_provision": "sec2"
    },
    {
      "term": "Media professional",
      "definition": "any other person regularly or professionally engaged in the collection, processing and dissemination of information to the public via any means of mass communication, including cameraperson and photographers, technical supporting staff, drivers and interpreters, editors, translators, publishers, broadcasters, printers and distributors;",
      "source_provision": "sec2"
    },
    {
      "term": "Media owner",
      "definition": "the owner of a media house or agency which collects and disseminates consumers news, features, comments, photographs and graphics through any means of communications;",
      "source_provision": "sec2"
    },
    {
      "term": "Non-journalist",
      "definition": "a person who is employed mainly in a managerial or administrative capacity in a media organization, or is being employed there in a supervisory capacity, performs, either by the nature of the duties attached to his office or by reason of the powers vested in him, functions mainly of a managerial / administrative nature.",
      "source_provision": "sec2"
    },
    {
      "term": "Schedule",
      "definition": "a Schedule to this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Torture",
      "definition": "an act committed by which severe pain or suffering, whether physical or mental, is intentionally inflicted on a person for such purposes as obtaining from him or a third person information or a confession, punishing him for an act he or a third person has committed or is suspected of having committed, or intimidating or coercing him or a third person, or for any reason based on discrimination of any kind, when such pain or suffering is inflicted by or at the instigation of or with the consent or acquiescence of a public official or other person acting in an official capacity. It does not include pain or suffering arising only from, inherent in or incidental to lawful sanctions. (2) All other words and expressions used but not defined in this Act shall have the same meanings as may be assigned to them under all applicable laws in Pakistan including the Pakistan Penal Code (Act XLV of 1860), Code of Criminal Procedure, 1898 (Act V of 1898), and Qanoon-e- Shahadat, 1984 (P.O. No. X of 1984).",
      "source_provision": "sec2"
    }
  ]
}
