{
  "id": "pk-protection-of-ports-special-measures-act-1948",
  "type": "statute",
  "title": "Protection of Ports (Special Measures) Act, 1948",
  "title_en": "Protection of Ports (Special Measures) Act, 1948",
  "short_name": "POPMA",
  "status": "in_force",
  "issued_date": "1948-06-10",
  "in_force_date": "1948-06-10",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap%2BUZw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Protection of Ports (Special Measures) Act, 1948 (XVII of 1948) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Act may be called the Protection of Ports\n(Special Measures) Act, 1948.\n1\n[(2) It may, at any time by notification in the official Gazette be extended by the Federal\nGovernment to any port in Pakistan.]\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Interpretation. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "_\n(a)        “port” means “major port” as defined in subsection (8) of section 3 of the Indian\nPorts Act, 1908 (XV of 1908) ;\n(b)        “protected area” means an area declared to be a protected area under the next\nsucceeding section."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Protected area",
      "content": "_(1) If the 1[Federal Government] considers it necessary or expedient to\nregulate the entry of persons into a port, it may, by notified order, declare the port to be a protected\narea, and thereupon, for so long as the order is in force, such area shall be a protected area for the\npurposes of this Act.\n(2) A notification under subsection (1) shall define the limits of the area to which it refers:\nProvided that the 1[Federal Government] may alter such limits from time to time by a\nnotification issued in this behalf.\n(3) Limits defined under subsection (2) may include any piers, jetties, landing places, wharves,\nquays, docks and other works made on behalf of the public for convenience of traffic, for safety of\nvessels, or for the improvement, maintenance or good government of the port and its approaches,\nwhether within or without high watermark, and any portion of the shore or bank within any limits\nconsidered necessary by Government."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Rules for regulation of entry, etc",
      "content": "_(1) The 1[Federal Government] may, by notification in\nthe official Gazette, make Rules for controlling or regulating the admission of persons to, and the\nconduct of persons in, and in the vicinity of, a protected area.\n1\nSubs. by Federal Adaptation Laws Order 1975 (P. O. No. IV of 1975), Art. 2 and Sch.\n(2) In particular, and without prejudice to the generality of the foregoing power, the 1[Federal\nGovernment] may make Rules for any or all of the following purposes, namely:___\n(a)        for restricting the entry of persons into the protected area;\n(b)        for removing persons from the protected area;\n(c)        for dealing with persons loitering in suspicious circumstances in the vicinity of\nthe protected area."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Delegation. Any order passed in pursuance of Rules made under section 4 may authorise an",
      "content": "officer or officers specified in the order to issue directions for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Penalties. Whoever contravenes any Rule made under this Act or an order passed in",
      "content": "pursuance thereof shall be punishable with imprisonment for a term which may extend to three years,\nor with fine, or with both."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Procedure. No prosecution for any offence punishable under this Act shall be instituted",
      "content": "except on a report in writing made by an officer authorised by the 1[Federal Government] in this behalf."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Bar of legal proceedings. No suit, prosecution or legal proceeding shall lie against any",
      "content": "person for anything done or in good faith intended to be done under this Act."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Saving of other Laws. The provisions of this Act shall be in addition to and not in derogation",
      "content": "of any other law for the time being in force regulating the admission of persons to, and the conduct of\npersons in, and in the vicinity of, a port.\n_______________\nRGN Date: 05-07-2024\n1\nSubs. by Federal Adaptation Laws Order 1975 (P. O. No. IV of 1975), Art. 2 and Table."
    }
  ],
  "definitions": []
}
