{
  "id": "pk-provincial-industrial-development-corporation-west-pakistan-ordinance-1962",
  "type": "statute",
  "title": "Provincial Industrial Development Corporation (West Pakistan) Ordinance, 1962",
  "title_en": "Provincial Industrial Development Corporation (West Pakistan) Ordinance, 1962",
  "short_name": "PIDCP",
  "status": "in_force",
  "issued_date": "1962-06-03",
  "in_force_date": "1962-06-03",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJ6b-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Provincial Industrial Development Corporation (West Pakistan) Ordinance, 1962 (XXXVIII of 1962) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Forwarding of statements, etc., to the Government",
      "content": "13 A. Power of Board to associate other persons."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Business which the Corporation shall transact",
      "content": "15 A. [Omitted.]\n15 B. Security for loans or subscription.\n15 C. [Omitted.]\n15 D. [Omitted.]\n15 E. Loans in foreign currency.\n15 F. [Omitted.]\n15 G. [Omitted.]\n15 H. [Omitted.]\n15 I.   Act XVIII of 1891 to apply to the books of the Corporation."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Winding up of the Corporation",
      "content": "SCHEDULE.\nTHE PROVINCIAL INDUSTRIAL DEVELOPMENT CORPORATION (WEST\nPAKISTAN) ORDINANCE, 1962\n1\nORDINANCE NO. XXXVIII OF 1962\n[4th June, 1962]\nAn Ordinance to establish an Industrial Development Corporation. 2* * *\nWHEREAS it is expedient to provide for the establishment of an Industrial Development\nCorporation for the purpose of promoting the economic and industrial development 2* * *and for\nmatters ancillary thereto;\nNOW, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958,\nand in exercise of all powers enabling him in that behalf, the President is pleased to make and\npromulgate the following Ordinance:-"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Ordinance may be called the\n3\n[Pakistan Industrial Development Corporation Ordinance, 1962].\n(2) It extends to the whole of 4[Pakistan].\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or",
      "content": "context,-\n(a)        “Board” means the Board of Directors of the Corporation;\n5\n*      *           *         *          *          *          *\n(b)        “Chairman” means the Chairman of the Corporation;\n(c)        “Corporation” means the 6[Pakistan Industrial Development Corporation]\nestablished under section 3;\n7\n*      *           *         *          *          *          *\n(d)        “Director” means the Director of the Corporation;\n1\nThis Ordinance has been amended in its application to the Province of West Pakistan by West Pakistan Ordinances and Act,\n(i) W.P. Ord. No. 3 of 1963, s. 2 (with effect from the 26th March, 1963)\n(ii) W.P. Ord. No. 14 of 1964, s. 2 (with effect from the 8th September, 1964), and\n(iii) W.P. Ord. No. 29 of 1965 (with effect from the 16th October, 1965)\n(iv) W.P. Act-No. 10 of 1967, s. 2 (with effect from the 21st July, 1967)\n2\nThe words “for West Pakistan” and “of West Pakistan” were omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27\nof 1981), s. 3. and Sch., II.\n3\nSubs. ibid., for “Provincial Industrial Development Corporation (West Pakistan) Ordinance, 1962”.\n4\nSubs. by F.A.O., 1975, Art. 2 and Sch., for “West Pakistan”.\n5\nClauses (aa) omitted by the Provincial Industrial Development Corporation (West Pakistan (Amdt.) Ordinance, 1965 (W.P. Ord. no. 29 of\n1965), s. 2, which was previously amended by W.P. Ord. No. 3 of 1963, s. 2.)\n6\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981) s. 3 and sch. II for “Industrial Development\nCorporation of West Pakistan”.\n7\nClause (cc) Omitted by the Provincial Industrial Development Corporation (West Pakistan) (Admt.) Ordinance 1965, (W.P. Ord. No. 29 of\n1965) s. 2, which was previously amended by W.P. Ord. No. 3 of 1963, s. 2.)\n(e)        “Government” means the 1[Federal Government];\n(f)        “Minerals” means all minerals excluding minerals necessary for the generation\nof nuclear energy and mineral oil and natural gas;\n(g)        “prescribed” means prescribed by rules or regulations;\n(h)        “regulations” means regulations made under this Ordinance;\n(i)        “rules” means rules made under this Ordinance [;]2\n3\n*     *           *          *          *          *           *"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Corporation and its offices",
      "content": "_ (1) As soon as may be after the\ncommencement of this Ordinance, the Government shall establish a corporation to be called the\n4\n[Pakistan] Industrial Development Corporation.\n(2) The Corporation shall be a body corporate by the name of the 5[Pakistan Industrial\nDevelopment Corporation] having perpetual succession and a common seal with power subject to the\nprovisions of this Ordinance, to acquire and hold property, both movable and immovable, and shall\nby the said name sue and be sued.\n(3) The Head Office of the Corporation shall be at Karachi but the Government may, by\nnotification in the official Gazette, transfer it to such other place as may be specified in such notifica-\ntion.\n(4) The Corporation shall establish Regional Offices at such places as the Government may\ndirect."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Share Capital",
      "content": "_ (1) The authorized share capital of the Corporation shall, in the first\ninstance, be one crore of rupees divided into one hundred fully paid up shares of one lakh of rupees\neach, of which forty five shares will be issued in the first instance and the remaining shares may be\nissued from time to time by the Corporation with the previous sanction of the Government.\n(2) Nothing in sub-section (1) shall prevent the Corporation from increasing its capital with\nthe previous sanction of the Government."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Management",
      "content": "_(1) The 6[determination of questions of policy and the general direction of\nthe affairs of the Corporation shall vest in the Board and the Board] may exercise all powers and do\nall acts and things which may be exercised or done by the Corporation in accordance with the\nprovisions of this Ordinance.\n(2) The Board in discharging its functions shall act on commercial considerations and shall be guided\nby such directions as the Government may give it from time to time.\n1\nSubs. by F.A.O., 1975, Art. 2 and sch., for “Provincial Government”.\n2\nSubs. by the Provincial Industrial Development Corporation (W.P. (Amdt.). Ordinance 1963 (W.P. ord. No. 3 of 1963) s. 2 for full-stop.”\n3\nCls. (j) (k) (l) and (m) were added by W.P. Ord. No. 3 of 1963 s. 2, subsequently cls. (J) (K) and (M) have been omitted by the Provincial\nIndustrial Development Corporation (W.P. (Amdt.) Ordinance, 1965 (29 of 1965) s. 2, to read as above.)\n4\nThe word (West omitted by Ord. 27 of 1981, s. 3, and Sch. II.)\n5\nSubs. ibid., for Industrial Development Corporation West Pakistan”.\n6\nSubs. by the Provisional Industrial Development Corporation (West Pakistan) (Amdt.) Ordinance, 1971 (26 of 1971), s. 2, for certain\nwords.\n(3) If the Board fails to obey any direction as aforesaid, the Government may remove the\nDirectors including the Chairman, and, notwithstanding anything in section 6, appoint persons in\ntheir place to be Directors temporarily until fresh Directors are appointed under that section."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Appointment and term of office of Directors",
      "content": "_(1) The Board shall consist of such\nnumber of Directors, not less than three and not more than five, as may be appointed by the\nGovernment.\n(2) Each Director shall___\n(a)        be a whole-time officer of the Corporation;\n1\n[(b)   Subject to the provisions of sub-section (3), perform under the general\nsupervision and control of the Chairman such duties as may be assigned to\nhim by the Chairman;]\n(c)        divest himself of any directorship or other interest held by him in any other\nCorporation, company or concern other than public companies sponsored by\nthe Corporation under sub-section (5) of section 15 before assuming office as\nDirector;\n(d)        subject to the provisions of section 9, hold office for a term of three years and\nmay be appointed thereafter for a further term or terms of such duration as the\nGovernment may, in appointing him thereto, determine; and\n(e)        receive such salary and allowances as the Government may determine:\nProvided that the Government may, in exceptional circumstances where it considers it\nnecessary to do so in the public interest, exempt, by a special order, any person, who has been\nappointed or is about to be appointed a Director, from the application of clause (a) and (c).\n(3) One of the Directors appointed under sub-section (1) shall be the Financial Director, who\nshall exercise such powers and discharge such duties as may be prescribed."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Chairman",
      "content": "_(1) The Government shall appoint one of the Directors to be the Chairman of\nthe Board, who shall be the Chief Executive of the Corporation 2[and shall, subject to the provisions\nof sub-section (1) of section 5, exercise such powers as are exercisable by the Corporation under this\nOrdinance].\n(2) Subject to his continuing to hold office as a Director, the Chairman shall hold office as\nChairman for a term of three years and, subject as aforesaid, shall remain in office as Chairman\nthereafter until his successor in that office is appointed and may, subject as aforesaid, be appointed to\nhold that office for a further term or terms as the Government may, in appointing him thereto,\ndetermine."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Notwithstanding anything contained in sections 6 and 7, when the Board is first",
      "content": "constituted, the Chairman and Directors, shall hold office for such term, not exceeding three years, as\nmay be determined by the Government:\n1\nSubs. ibid. s. 3, for cl. (b.)\n2\nAdded by the Provisional Industrial Development Corporation (West Pakistan) (Amdt.) Ordinance, 1971 (26 of 1971), s. 4.)\nProvided that such Chairman and Directors may be appointed to hold that office for a further\nterm or terms as the Government may, in appointing him thereto, determine."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Disqualification of Directors",
      "content": "_(1) No person shall be or shall continue to be a Director\nwho___\n(a)       is or at any time has been convicted of an offence involving moral turpitude;\nor\n(b)       is or at any time has been adjudicated insolvent; or\n(c)       is found a lunatic or becomes of unsound mind; or\n(d)       is or at any time has been disqualified for employment in, or dismissed from\nthe service of Pakistan; or\n(e)       is a minor\n(2) The Government may, by order in writing remove the Chairman or a Director if he⸻\n(a)       refuses or fails to discharge or becomes, in the opinion of the Government\nincapable of discharging his responsibilities under this Ordinance; or\n(b)       has, in the opinion of the Government, abused his position as Chairman or\nDirector; or\n(c)       has knowingly acquired or continued to hold, without the permission in\nwriting of the Government, directly or indirectly, or through a partner, any\nshare or interest in any contract or employment with, by or on behalf of the\nCorporation, or in any property which, in his knowledge, is likely to benefit or\nhas benefited as a result of the operations of the Corporation; or\n(d)\nhas absented himself from three consecutive meetings of the Board without\nthe leave of the Government in the case of the Chairman, or of the Chairman\nin the case of a Director.\n(3) Notwithstanding anything contained in this Ordinance, the Chairman or a Director may, at\nany time before the expiry of his term, upon three months' notice, resign his office, or upon similar\nnotice, be removed from office by the Government without assigning any reason."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Appointment of officers",
      "content": "_(1) The Corporation may, subject to such general or special\norders as the Government may give it from time to time and subject to such rules as may be made in\nthis behalf, appoint such officers, advisers and employees as it considers necessary for the efficient\nperformance of its functions on such terms and conditions as it may see fit 1[and each such officer,\nadviser and employee shall, subject to the supervision and control of the Chairman, perform such\nfunctions as may be assigned to him by the Chairman].\n(2) Notwithstanding anything contained, in sub-section (1), the Corporation shall, subject to\nthe provisions of sub-sections (3) and (4), appoint such officers and advisers and employees of the\n2\n[Federal Corporation] as may be transferred to it under the Industrial Corporations (Dissolution)\nOrdinance, 1962.\n1\nAdded by the Provisional Industrial Development Corporation (West Pakistan) (Amdt.) Ordinance, 1971 (26 of 1971), s. 5.\n2\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Corporation”.)\n(3) Subject to the provisions of the Industrial Corporations (Dissolution) Ordinance, 1962,\nand any direction received thereunder, the terms and conditions of employment of such officers,\nadvisers and employees, as are referred to in sub-section (2), shall be such as may be determined by\nthe Government;\nProvided that the Government may direct that until the terms and conditions have been so\ndetermined by it or for such period as it may specify, any such person shall be employed by the\nCorporation on the same terms and conditions on which he was employed by the 1[Federal\nCorporation] concerned.\n(4) Notwithstanding anything contained in the foregoing sub-sections the Government may\ndirect the Corporation to dispense with the services of any such officers, advisers and employees as\nare referred to in sub-sections (2) and (3) and in that event the Corporation shall dispense with the\nservices of such persons in the same manner and subject to the same conditions under which their\nservices could be dispensed with by the 1[Federal Corporation] concerned.\nExplanation.___ In this section 1[Federal Corporation] has the same meaning as in the\nIndustrial Corporations (Dissolution) Ordinance, 1962."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Declaration of fidelity and secrecy. Every Director, adviser, officer or other employee",
      "content": "of the Corporation, before entering upon his duties, shall make such declaration of fidelity and\nsecrecy as may be provided by regulations."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Meetings of the Board",
      "content": "_(1) The meetings of the Board shall be held at such times and\nat such places as may be prescribed by regulations:\nProvided that at least one meeting shall be held in a month:\nProvided further that until regulations are made in this behalf, such meetings shall be held at\nsuch times and at such places as may be determined by the Chairman.\n(2) The quorum necessary for transacting business at a meeting of the Board shall be three, if\nthe Board consists of five Directors and two if the number is less.\n(3) Each Director, including the Chairman, shall have one vote but in the event of an equality\nof votes, the Chairman shall have a second or casting vote.\n(4) The meetings of the Board shall be presided over by the Chairman, and, in his absence, by\na Director authorized by him in this behalf, and in default of such authorization by a person elected\nfor the purpose by the Directors present from among themselves.\n(5) No act or proceeding of the Board shall be invalid merely on the ground of the existence\nof any vacancy in, or any defect in the constitution of, the Board.\n(6) The minutes of every meeting, stating among other things, the names of the Directors\npresent, shall be drawn up and recorded in a book to be kept for the purpose, and shall be signed by\nthe person presiding at the meeting, and such book shall at all reasonable times and without charge\nbe open to inspection by any Director."
    },
    {
      "provision_ref": "sec1962",
      "section": "1962",
      "title": "Section 1962. (2) The Corporation shall be responsible for",
      "content": "3\n[(a)   planning, promoting, organizing and implementing programmes for the\nestablishment of industries listed in the Schedule and the exploitation of\nfisheries;]\n(b)        the exploration, exploitation and development of minerals and mines thereof;\nand\n(c)        the exploration, exploitation and development of any material which the\n4\n[Federal Government] may entrust to it subject to such conditions as the\n4\n[Federal Government] may specify.\n1\nAdded by the Provisional Industrial Development Corporation (West Pakistan) (Amdt.) Ordinance, 1963 (W.P. Ord. 3 of 1963), s. 3.\n2\nSubs. by the Provincial (Industrial Development Corporation (West Pakistan) (Amdt.) Ordinance, 1971 (26 of 1971), s. 6, for section 14.\n3\nSubs. by the Provincial Industrial Development Corporation (West Pakistan) (Amdt.) Ordinance, 1965 (W.P. Ord. No. 29 of 1965), s. 3, for\ncl. (a), which was previously amended by W.P. Ord. No. 3 of 1963, s. 4, for the original cl. (a).\n4\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\nExplanation.___ In clause (a) “planning” includes studies, surveys, experiments and scientific\nand technical investigation.\n(3) Notwithstanding anything contained in sub-sections (1) and (2), the Corporation shall\nperform such other duties and functions as the Government may, from time to time, assign to the\nCorporation.\n(4) The Corporation shall, in order to carry out any functions under sub-section (1) or clause\n(a) or clause (b) of subsection (2) or sub-section (3),⸻\n(a)        submit, for the approval of the Government, proposals or schemes; and\n(b)        proceed to give effect to any proposal or scheme as approved by the\nGovernment.\n(5) The Corporation may, and, where the Government so directs, shall, for the purpose of\ngiving effect to any proposal or scheme approved by Government, sponsor limited company\nindependent of each other or subsidiary companies incorporated under the Companies Act, 1913:\nProvided that before sponsoring any such company, the Corporation shall obtain the approval\nof the Government to the company’s capital structure.\n(6) The Corporation shall, unless otherwise directed by the Government, act as Managing\nAgents for the aforesaid companies, and may, with the prior concurrence of the Government,\nrelinquish the managing agency in favour of any person.\n(7) Nothing contained in section 87A of the Companies Act, 1913 (VII of 1913), shall apply\nto the Corporation.\n(8) The Corporation shall be represented on the Board of Directors of the aforesaid\ncompanies.\n(9) The Corporation may issue the capital required for the aforesaid companies for public\nsubscription and, if any portion thereof remains unsubscribed after the expiry of the closing date for\npublic subscription, subscribe on behalf of the Government that portion.[:]1\n2\n[Provided that the Corporation shall not subscribe to an extent which in the aggregate\nexceeds such limit as may be notified by Government form time to time].\n(10) The Corporation may underwrite the whole or any portion of the capital issued under\nsub-section (9).\n(11) The Corporation shall, when it considers the time opportune, sell or transfer the shares\nsubscribed for by it under sub-section (9) :\nProvided that no such sale or transfer shall take place at a rate below the market quotation or\nbelow the par value of such shares without the previous sanction of the Government.\n3\n*       *          *          *          *          *           *\n4\n[15A. [Limit of accommodation.] Omitted by the Provincial Industrial Development\nCorporation (West Pakistan) (Amdt.) Ordinance 1965 (XXIX of 1965), s. 4.\n1\nSubs. by Provincial Industrial Development Corporation (West Pakistan) (Amdt.) Ordinance, 1965 (29 of 1965), s. 3, for full-stop.\n2\nProviso added ibid.\n3\nSub-section 12 omitted ibid., which was previously amended by W.P. Ord. No. 3 of 1963, s. 4.\n4\nSection 15A to 15I ins. by the Provincial Industrial Development Corporation (W.P. Amdt.) Ordinance, 1963 (3 of 1963), s. 5."
    },
    {
      "provision_ref": "sec15b",
      "section": "15B",
      "title": "Section 15B. Security for loans or subscription. No 1* * subscription shall be made unless it is",
      "content": "adequately secured by pledge, mortgage, hypothecation or assignment of such property, movable or\nimmovable, and of such value in proportion to the 1* * subscription as may be notified by\nGovernment from time to time:\n2\n*   *          *          *          *          *           *"
    },
    {
      "provision_ref": "sec15c",
      "section": "15C",
      "title": "Section 15C. [Limit of loans or guarantees.] Omitted by the Provincial Industrial Development",
      "content": "Corporation (West Pakistan) (Amdt.) Ordinance, 1965 (XXIX of 1965), s. 6."
    },
    {
      "provision_ref": "sec15d",
      "section": "15D",
      "title": "Section 15D. [Power to impose conditions.] Omitted by the Provincial Industrial Development",
      "content": "Corporation (West Pakistan) (Amdt.) Ordinance, 1965 (XXIX of 1965), s. 6."
    },
    {
      "provision_ref": "sec15e",
      "section": "15E",
      "title": "Section 15E. Loans in foreign currency",
      "content": "_(1) The Corporation may, with the previous consent of\nthe 3[Government] and on such terms and conditions as may be approved by the Government,\nborrow in foreign currency from the International Bank for Re-construction and Development or\nother moneys required for the development of industries referred in section 15 4* * *.\n(2) All loans obtained in foreign currency shall be repayable either-\n(a)       in the currency in which they are obtained ; or\n(b)       in any other currency which is agreed upon by the loan-giving agency and the\n3\n[Government] ; or\n(c)       in Pakistan currency at the rate of exchange prevailing on the date of re-\npayment."
    },
    {
      "provision_ref": "sec15f",
      "section": "15F",
      "title": "Section 15F. [Power to demand immediate Payment of the entire sum.] Omitted by the Provincial",
      "content": "Industrial Development Corporation (West Pakistan) (Amdt.) Ordinance, 1965 (XXIX of 1965), s. 8."
    },
    {
      "provision_ref": "sec15g",
      "section": "15G",
      "title": "Section 15G. [Certification of sums re",
      "content": "coverable.] Omitted by the Provincial Industrial Development\nCorporation (West Pakistan) (Amdt.) Ordinance, 1965 (XXIX of 1965), s. 8."
    },
    {
      "provision_ref": "sec15h",
      "section": "15H",
      "title": "Section 15H. [Recovery of dues form borrower or surety.] Omitted by the Provincial Industrial",
      "content": "Development Corporation (West Pakistan) (Amdt.) Ordinance, 1965 (XXIX of 1965, s. 8.)"
    },
    {
      "provision_ref": "sec15i",
      "section": "15I",
      "title": "Section 15I. Act XVIII of 1891 to apply to the books of the Corporation. The Corporation shall be",
      "content": "deemed to be a bank for the purpose of the “Bankers Books Evidence Act, 1891,]"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Annual Budget Statement. The Corporation shall by such date in each year as may be",
      "content": "prescribed, by rules, submit to the Government for approval a statement, to be called the Annual\nBudget Statement, in the prescribed form for every financial year showing the estimated receipts and\nexpenditure and sums which are likely to be required from the Government during that financial\nyear."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Custody and investment of Corporation Funds",
      "content": "_(1) All moneys at the credit of the\nCorporation shall be kept___\n1\nThe words “loan or” omitted by Ord. 29 of 1965, s. 5.\n2\nProviso omitted ibid.\n3\nSubs. by F.A.O., 1975, Art. 2 and Sch., for “Government and the Central Government”.\n4\nCertain words omitted by the Provincial Industrial Corporation (West Pakistan; (Amdt.) Ordinance, 1965 (29 of 1960), s. 7.\n(a)        in places where there is a Government treasury, or sub-treasury or a bank to\nwhich the Government treasury business has been made over, in such treasury,\nsub-treasury or bank; and\n(b)        in other places, with such banks as may be approved by the Government.\n(2) Nothing in sub-section (1) shall be deemed to preclude the Corporation from investing\nany such moneys which are not required for immediate expenditure in any of the securities described\nin section 20 of the Trusts Act, 1882 (II of 1882), or placing them in fixed deposit with a bank\napproved by Government, or in such other manner as may be approved by the Government."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Maintenance of accounts. The Corporation shall maintain proper accounts and other",
      "content": "relevant records and prepare annual statement of accounts, including the profit and loss account and\nbalance-sheet, in accordance with such general directions as may be issued, and in such form as may\nbe specified, by Government in consultation with 1* * * the Auditor General."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Audit",
      "content": "_ (1) The accounts of the Corporation shall be audited by auditors who shall be\nchartered accountants within the meaning of the Chartered Accountants Ordinance, 1961, and\nappointed with the approval of the Government by the Corporation on such remuneration as it may\nthink fit, and such remuneration shall be paid by the Corporation.\n(2) Notwithstanding the audit provided for in sub-section (1), the Auditor General shall audit\nor cause to be audited the accounts of the Corporation.\n(3) The Auditor General shall also hold, or cause to be held, a test audit of the undertakings\nwholly owned by the Corporation and of the Companies of which the Corporation is the Managing\nAgents, and in the event of a text audit disclosing irregularities, the Auditor General may carry out,\nor cause to be carried out, such further audit as he considers necessary.\n(4) The Corporation and every such undertaking and company as is referred to in sub-section\n(3) shall produce the accounts books and connected documents, at the place where they are normally\nexpected to be available, and furnish such explanations and information as the Auditor General or\nany officer authorized by him in this behalf may require at the time of the audit.\n(5) The Auditor General shall, in holding the audit, keep in view the provisions of sub-section\n(2) of section 5 and state in his report how far in his opinion these provisions have been complied\nwith.\n2\n[(6) A statement of accounts of the Corporation and the report of the Audior-General on the\nsaid accounts, together with the report of the Auditor-General on account of the undertakings and the\ncompanies referred to in sub-section (3), shall be furnished to Government by the Corporation after\nthe end of every financial year.]"
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Annual Report",
      "content": "_ 3[(1)] The Corporation shall, as soon as possible, after the end of\nevery financial year, submit an annual report to the Government on the conduct of its affairs for that\nyear, and on its proposals for the next ensuing financial year.\n4\n[(2) The annual report referred to in sub-section (1) shall, as soon as possible, be laid by\nGovernment before the 5[National Assembly]\n1\nThe Certain words omitted by F.A.O., 1975, Art. 2 and Sch.\n2\nSub-section (6) added by the Provincial Industrial Development Corporation (West Pakistan) (Amdt.) Act, 1967 (10 of 1967), s. 2.\n3\nRe-numbered as sub-section (1) by the Provincial Development Corporation (West Pakistan) (Amdt.) Act-1967 (10 of 1967), s. 3.\n4\nSub-section (2) added ibid.\n5\nSubs. by F.A.O., 1975, Art. 2 and Sch., for “Provincial Assembly of West Pakistan”. and “Provincial Assembly,"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Indemnity of Directors.⸻(1) Every Director shall be indemnified by the Corporation",
      "content": "against all losses and expenses incurred by him in the discharge of his duties except such as are\ncaused by his own wilful act or default.\n(2) A Director shall not be personally responsible for the acts of any other Director or of any\nofficer, adviser or employee of the Corporation for any loss or expense resulting to the Corporation\nby reason of the insufficiency or deficiency in value of or title to any property or security acquired or\ntaken on behalf of the Corporation, or by the wrongful act of any person under a liability to the\nCorporation, or by anything done by him in good faith in the execution of the duties of his office.\n1\n[21A.⸻(1) The annual statement of accounts referred to in section 18, together with the\naudit report and test audit report of the Auditor-General on the accounts of the Corporation,\nundertakings and Companies referred to in section 19 shall be placed by Government before the\n4\n[National Assembly] as soon as possible after they are received, and the 2[National Assembly] shall\nrefer the same to its Committee on Public Accounts for scrutiny.\n(2) The Committee on Public Accounts shall scrutinize and examine the reports referred to it\nunder sub-section (1) in the same manner as, and shall in respect thereof perform the same functions\nand exercise the same powers as are required by it to be performed and exercised in respect of\nappropriation account of the Provincial Government and the report of the Comptroller and Auditor-\nGeneral of Pakistan thereon.]"
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Public servants. The Chairman, Directors, officers adviser or employee of the",
      "content": "Corporation shall, while acting or purporting to act in pursuance of the provisions of this Ordinance,\nor the rules or regulations made thereunder, be deemed to be public servants within the meaning of\nsection 21 of the Pakistan Penal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Power to make rules",
      "content": "_ (1) The Government may, by notification in the official Gazette,\nmake rules for carrying out the purposes of this Ordinance.\n(2) In particular and without prejudice to the generality of the foregoing powers, such rules\nmay provide for⸻\n(a)        the relinquishment of managing agency in favour of any person;\n(b)        the manner of keeping accounts of the Corporation and the companies\nmanaged by it;\n(c)        the recruitment of officers, advisers and employees of the Corporations;\n(d)        the terms and conditions of service of the officers, advisers and employees of\nthe Corporation, including the functions of the advisers;\n(e)        the borrowings by the Corporation;\n(f)        the purchase and sale of goods by the Corporations:\n(g)        the date by which, and the form in which, the annual budget statement shall be\nsubmitted in each year;\n1\nSubs. by F.A.O., 1975, Art. 2 and Sch., for “Provincial Assembly of West Pakistan”. and “Provincial Assembly,\n2\nSection 21A added by Act, 10 of 1967, s. 4.)\n(h)    the procedure for appropriation and re-appropriation of moneys at the credit of\nthe Corporation;\n(i)    the form and manner in which and the authorities to whom returns, reports or\nstatements shall be submitted; and\n(j)    such other matters relating to the administration of the affairs of the\nCorporation as the Government may think fit to regulate by rules."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Power to make regulations",
      "content": "_(1) The Board may, with the previous sanction of the\nGovernment, make regulations to provide for all matters, not provided for in the rules for which\nprovision is necessary or expedient for carrying out the purposes of this Ordinance and the said rules.\n(2) In particular and without prejudice to the generality of the foregoing powers, such\nregulations may provide for the-\n(a)    meetings of the Board;\n(b)    investment of the Corporation’s funds; and\n(c)    sale or transfer of shares under sub-section (11) of section 15."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Power to amend the Schedule. The Government may, from time to time, by notification",
      "content": "in, the official Gazette, amend the Schedule so as to include therein or exclude therefrom any\nindustry or vary the description of any industry included therein."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Cottage and Small Scale Industries",
      "content": "_____________________\n145274                                                               Date: 11-11-2024"
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Board of Directors of the Corporation; 5 * * * * * * *",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Corporation;",
      "source_provision": "sec2"
    },
    {
      "term": "Corporation",
      "definition": "the 6[Pakistan Industrial Development Corporation] established under section 3; 7 * * * * * * *",
      "source_provision": "sec2"
    },
    {
      "term": "Director",
      "definition": "the Director of the Corporation; 1 This Ordinance has been amended in its application to the Province of West Pakistan by West Pakistan Ordinances and Act, (i) W.P. Ord. No. 3 of 1963, s. 2 (with effect from the 26th March, 1963) (ii) W.P. Ord. No. 14 of 1964, s. 2 (with effect from the 8th September, 1964), and (iii) W.P. Ord. No. 29 of 1965 (with effect from the 16th October, 1965) (iv) W.P. Act-No. 10 of 1967, s. 2 (with effect from the 21st July, 1967) 2 The words “for West Pakistan” and “of West Pakistan” were omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3. and Sch., II. 3 Subs. ibid., for “Provincial Industrial Development Corporation (West Pakistan) Ordinance, 1962”. 4 Subs. by F.A.O., 1975, Art. 2 and Sch., for “West Pakistan”. 5 Clauses (aa) omitted by the Provincial Industrial Development Corporation (West Pakistan (Amdt.) Ordinance, 1965 (W.P. Ord. no. 29 of 1965), s. 2, which was previously amended by W.P. Ord. No. 3 of 1963, s. 2.) 6 Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981) s. 3 and sch. II for “Industrial Development Corporation of West Pakistan”. 7 Clause (cc) Omitted by the Provincial Industrial Development Corporation (West Pakistan) (Admt.) Ordinance 1965, (W.P. Ord. No. 29 of 1965) s. 2, which was previously amended by W.P. Ord. No. 3 of 1963, s. 2.)",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the 1[Federal Government];",
      "source_provision": "sec2"
    },
    {
      "term": "Minerals",
      "definition": "all minerals excluding minerals necessary for the generation of nuclear energy and mineral oil and natural gas;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules or regulations;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Ordinance [;]2 3 * * * * * * *",
      "source_provision": "sec2"
    }
  ]
}
