{
  "id": "pk-public-finance-management-act-2019",
  "type": "statute",
  "title": "Public Finance Management Act, 2019",
  "title_en": "Public Finance Management Act, 2019",
  "short_name": "PFMA",
  "status": "in_force",
  "issued_date": "2019-06-29",
  "in_force_date": "2019-06-29",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pjbA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Public Finance Management Act, 2019 (V of 2019) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Budget strategy paper",
      "content": "(l) The Federal Government shall approve the budget strategy\npaper containing quantified macroeconomic and fiscal projections for the medium-term by 1[tenth of\nMay] of each year. It shall be published as well as placed on the Finance Division’s official website.\nThe paper shall indicate strategic priorities of the Government revenue and spending policies and\nspecify indicative levels of spending in various Ministries and Divisions. Upon approval of the paper,\nthe Finance Division shall issue indicative budget ceilings to Ministries and Divisions.\n(2) The Minister for Finance shall 2[also presented discuss the budget strategy paper with the\nStanding Committees] for Finance and Revenue in the Senate and the National Assembly.\n(3) The Federal Government may extend the deadline mentioned in sub-section (1) in case of\nextreme requirement."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Annual Budget Statement",
      "content": "(1) The Federal Government shall, in respect of every financial\nyear, cause to be laid before the National Assembly, Annual Budget Statement consistent with Articles\n80 and 81 of the Constitution including a statement of the purpose and estimates divided into 2[major\nobjects for each demand for grant].\n(2) Each Demand for grant may indicate budget estimates of the ensuing year, initial budget\nestimates and revised estimates of outgoing year and provisional actual expenditure of year prior to\noutgoing year.\n(3) The Annual Budget Statement shall also contain-\n(a)        statement of contingent liabilities of the Federal Government; and\n(b)        statement of fiscal risks.\n2\n[5. Plan based Government’s expenditure.—All government expenditures, whether from a\nrecurrent or development demand for grant, shall be based on well-defined plans and the strategic\npriorities approved in budget strategy paper as per section 3.]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Grant",
      "content": "in-aid.—The Federal Government may approve grant-in-aid for individual, public\nand private institutions, local bodies and other non-political institutions and associations as it may\nconsider appropriate in the manner as may be prescribed."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Receipt of grants by the Government",
      "content": "(1) Grants made to the Government by a foreign\nGovernment or by any other person shall be received by the Economic Affairs Division and Finance\nDivision on behalf of the Government.\n(2) The Finance Division shall, in collaboration with representatives of donors, reach\nagreements and issue instructions concerning the management of such grants.\n1\nSubs. by the Finance Act, 2023 (Act No. XXXIV of 2023), s. 9.\n2\nSubs. by the Finance Act, 2020 (Act No. XIX of 2020), s. 9."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Tax expenditure",
      "content": "The Federal Government shall, in respect of every financial year cause\nto be laid before the National Assembly, Finance Bill consistent with Article 73 of the Constitution\nincluding a statement of estimated tax expenditure of the Federal Government."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Performance based budget",
      "content": "(1) The Federal Government shall, in respect of every\nfinancial year, cause to be laid before the National Assembly a medium-term performance based\nbudget 1[report] along with the Annual Budget Statement.\n(2) For each principal accounting officer, the medium-term performance based budget 1[report]\nmay include policy and goals, past and future expenditure, outputs and outcomes and related\nperformance indicators and targets."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Changes in schedule of authorized expenditure",
      "content": "If in respect of any financial year it is\nfound—\n(a)    that the amount authorized to be expended for a particular service for the current\nfinancial year is insufficient, or that a need has arisen for expenditure upon some\nnew service not included in the Annual Budget Statement for that year; or\n(b)        that any money has been spent on any service during a financial year in excess\nof the amount granted for that service for that year,\nthe Federal Government shall have power, as prescribed, to authorize expenditure from the Federal\nConsolidated Fund, whether the expenditure is charged by the Constitution upon that Fund or not, and\nshall cause to be laid before the National Assembly Supplementary Budget Statement or, as the case\nmay be, an Excess Budget Statement, setting out the amount of that expenditure, and the provisions of\nArticles 80 to 83 shall apply to those statements as they apply to the Annual Budget Statement."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Re",
      "content": "appropriation of funds.—Principal accounting officers may sanction, 1[by thirty-first\nday of May each] year, re-appropriation of funds from one expenditure item to another within a budget\ngrant in the manner as may be prescribed 1[:]\n1\n[Provided that in an exceptional case of exigency, the Finance Division may extend the\nprescribed time limit before the close of the financial year.]"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Surrender of savings",
      "content": "(1) All Ministries and Divisions, their attached departments and\nsub-ordinate offices and autonomous organizations shall surrender to the Finance Division 1[by thirty-\nfirst day of May each year], all anticipated savings in the grants or assignment accounts or grant-in-\naid controlled by them 1[:]\n1\n[Provided that in an exceptional case of exigency, the Finance Division may extend the\nprescribed time limit before the close of the financial year.]\n(2) The Finance Division shall communicate the acceptance of such surrenders before close of\nthe financial year and where requirement is justified, shall provide for equivalent amount in the next\nfinancial year budget.\n1\nIns., subs. and added by the Finance Act, 2020 (Act No. XIX of 2020), s. 9."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Classification of development projects",
      "content": "Projects defined in public sector development\nprogramme shall be classified as:—\n(a)    core projects in national infrastructure requiring complex planning, design and\nimplementation procedures. The Planning Commission shall designate projects\nas such in accordance with the criteria notified in official Gazette; and\n(b)    sectoral projects, projects undertaken by specific sectors, Ministries and\nDivisions which are required to enhance the development of that sector or\nMinistry or Division and do not fall under the above category of core projects."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Preparation of development projects",
      "content": "(1) All development projects shall be prepared\nin conformity with procedures, processes and templates defined by the Planning Commission.\n(2) Cost and benefit analysis and risk assessment of all development project proposals, in\nexcess of a threshold size prescribed by the Planning Commission, shall be undertaken."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Quality assurance",
      "content": "Development project proposals which exceed in their total cost\nthresholds defined by the Planning Commission shall be subject to quality assurance. Such quality\nassurance shall be undertaken by an individual/body which is independent of the\nsector/Ministry/Division that has initiated the preparation of the development project proposal."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Technical approval",
      "content": "(1) All development project proposals shall be subject to a technical\napproval process. Technical approval shall only be granted to projects which are compliant with the\nstandards and procedures set by the Planning Commission.\n(2) Findings and recommendations of the independent quality assurance reports and cost and\nbenefit analysis and risk assessment, where required as per sub-section (2) section 14, shall be taken\ninto account by these forums while considering the development project proposals."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Inclusion of development projects in demands for grants",
      "content": "(1) No development project\nshall be considered for inclusion in demands for grants that has not been granted technical approval.\n(2) No development project shall be considered for inclusion in demands for grants unless it is\nprovided with a budget allocation for the coming year which fully reflects the proposed project cost\nfor each year."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Monitoring and evaluation of development projects",
      "content": "(l) Development projects shall be\nsubject to the following forms of monitoring and evaluation, namely:—\n(a)    monitoring of progress during implementation;\n(b)    evaluation of the project on completion; and\n(c)    in case of the projects with a total cost exceeding a threshold to be set by the\nPlanning Commission, an independent impact assessment within five years after\ncompletion of the projects.\n(2) Timelines, forms and formats and guidance on conducting monitoring and evaluation and\nreporting shall be as may be prescribed."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Budgetary provision for maintenance of assets",
      "content": "(1) Every Ministry and Division shall\ninclude in its demands for grants adequate funds dedicated for operation and maintenance of the\nphysical infrastructure assets under its supervision.\n(2) The Planning Commission shall define adequacy requirements for different categories of\nphysical infrastructure expressed as the ratio of the annual provision for maintenance and the current\nmarket value of the asset."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Utilization of public assets",
      "content": "(1) Principal accounting officers shall ensure that the\nmaximum possible returns are achieved on each and every asset falling under the oversight of the\nMinistry and Division.\n(2) The returns on a public asset may include utilization of the asset for delivery of one or more\npublic services or a financial return accruing to the Government from utilization of the potential of the\nasset.\n(3) With a view to achieving the maximization of returns on public assets, government may\nestablish sovereign wealth funds through an Act of Parliament. The objective of a sovereign wealth\nfund is to act as a holding institution for public assets, which is capable of bringing to bear sound\nmanagement and exploitation of opportunities for the maximization of returns from the public assets."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Federal Consolidated Fund",
      "content": "(1) All Ministries and Divisions, their attached\ndepartments and subordinate offices and all public entities if so required by their statutes, shall arrange\nremittance in the Federal Consolidated Fund, without delay, of all revenues including all grants\nreceived by the Federal Government, all loans raised by the Government and all moneys received by\nit in repayment of any loan and all other moneys into the Public Account of the Federation as required\nunder Article 78 of the Constitution.\n(2) All loans or grants made to the Federal Government by a foreign government or otherwise\nshall be remitted to the Federal Consolidated Fund and the Controller General of Accounts shall be\nresponsible for its proper accounting."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Custody of the Federal Consolidated Fund and Public Account of the Federation",
      "content": "The operation of the Federal Consolidated Fund and the Public Account of the Federation shall vest in\nthe Finance Division under the overall supervision of the Federal Government."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Expenditure from Federal Consolidated Fund 1[and Public Account]",
      "content": "(1) No\nauthority shall incur or commit any expenditure or enter into any liability involving expenditure from\nthe Federal Consolidated Fund and Public Account of the Federation until the same has been\nsanctioned by a competent authority duly empowered and the expenditure has been provided for the\nfinancial year through—\n1\nIns. by the Finance Act, 2020 (Act No. XIX of 2020), s. 9.\n(a)        schedule of authorized expenditure; or\n(b)        supplementary grant and technical supplementary grant as per Article 84 of the\nConstitution; or\n(c)        re-appropriation as per section 1[11].\n(2) No authority shall transfer public moneys for investment or deposit from government\naccount 1[including the assignment accounts] to other bank account without prior approval from the\nFederal Government 1[:]\n1\n[Provided that the principal accounting officer in respect of all the spending units under his\ncontrol shall submit a certificate to the Finance Division on half yearly basis.]\n(3) Every grant approved by the National Assembly for a financial year and every other\nauthority or sanction issued under this Act in respect of a financial year, shall lapse and cease to have\nany effect at the close of that financial year."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Withholding of authorized appropriations",
      "content": "The Finance Division may, with the prior\napproval of the National Assembly, suspend, withdraw, limit or place conditions on any budget\nappropriation or other authority issued by it if the Finance Division is satisfied that such action is\nrequired by reason of a financial exigency or is in the public interest."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Excess expenditure",
      "content": "(1) The expenditure in excess of the amount of budget grant as well\nas the expenditure not falling within the scope or intention of any budget grant, unless regularized by\na supplementary grant, shall be treated as excess expenditure.\n(2) Excess expenditure shall not become a charge against the Federal Consolidated Fund except\nwhen—\n(a)        The National Assembly approves an additional amount equivalent to\noverspending as a direct charge against the Federal Consolidated Fund as voted\nor charged expenditure; or\n(b)        it decides—\n(i)        to recover the excess expenditure from the public servants who are found\nto be involved to incur such an expenditure. In this case, the Finance\nDivision may take appropriate measures; or\n(ii)       to take disciplinary proceedings against the principal accounting officer.\n(3) If the Public Accounts Committee recommends the excess expenditure to stand as a charge\nto Federal Consolidated Fund, then it shall be included in the statement of excess expenditure required\nunder Article 84 of the Constitution.\n1\nSubs., ins. and added by the Finance Act, 2020 (Act No. XIX of 2020), s. 9."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Commitment control system",
      "content": "The Finance Division in consultation with the Auditor\nGeneral shall approve and issue guidelines related to annual and multi-annual commitment control\nsystems."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Delegation of financial powers",
      "content": "The Finance Division shall approve regulations for the\ndelegation of financial powers based on the following principles, namely:—\n(a)        financial powers accorded to the principal accounting officers balance financial\nauthority with responsibility for financial propriety as per the applicable\nfinancial rules and regulations;\n(b)        financial powers are accorded with the view to enhance public service delivery;\nand\n(c)        allowing the principal accounting officers to delegate financial powers to sub-\nordinate officials. The delegation shall not diminish the responsibility and\naccountability of the principal accounting officers.\n1\n[28. Chief finance and accounts officer.— To assist principal accounting officers in financial\nmanagement, there shall be chief finance and accounts officer posted in Ministries and Divisions as\nrecommended by Finance Division to perform functions as notified and financial advisers’\norganization shall stand disbanded.]\n1\n[29. Chief internal auditor.— (l) Within a period not exceeding eighteen months from the\ndate of commencement of this Act, the position of chief internal auditor shall be created who shall\nwork under the direct supervision of principal accounting officer. The appointment and functions of\nchief internal auditor shall be as determined by the Finance Division, from time to time.]\n2\n[(2) There shall be an internal audit policy board for over all policy making and setting scope\nand standards, approving internal audit manuals and charter of internal audit, monitoring the overall\neffectiveness of internal audit function for the Government institutions, comprising—\n(a)      Secretary, Finance Division                                            Chairman;\n(b)      Controller General of Accounts                                         Member;\n(c)      Deputy Auditor General                                                 Member;\n(d)      Additional Secretary, Finance Division                           Member and Secretary);\n(e)      One representative duly appointed by the Member Finance            Member”\nDivision from the Institute of Cost and Management Accountants\nof Pakistan or the Institute of Chartered Accountants of Pakistan or\nInstitute of Internal Auditors\n(3) Finance Division shall provide secretarial support to the board constituted under sub-section\n(2).]\n1\nSubs. by the Finance Act, 2023 (Act No. XXXIV of 2023), s. 9.\n2\nAdded by the Finance Act, 2020 (Act No. XIX of 2020), s. 9."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Cash management",
      "content": "(l) The Finance Division, with the approval of the Federal\nGovernment, shall notify policy and rules under this Act to prescribe an effective cash management\nsystem for all public entities and special purpose funds leading to treasury single account. Fundamental\nprinciples and objectives of such policy and rules shall be—\n(a)        to anticipate cash needs of Government;\n(b)        to ensure availability of cash when it is required;\n(c)        to manage cash balance in the Government bank accounts effectively; and\n(d)        to neutralize impact of the Government’s cash flows on the domestic banking\nsector.\n(2) The policy and rules under this section, inter alia, shall provide for—\n(a)        establishing institutional and administrative arrangements needed to manage an\neffective cash management system;\n(b)        availability of funds in accordance with schedule of authorized expenditure or\nsupplementary grant;\n(c)        availability of foreign exchange, where required, from within the allocation of\nforeign exchange sanctioned for the Ministry and Division concerned;\n(d)        placement of all public moneys into the treasury single account;\n(e)        quarterly revenue, expenditure, cash requirement and debt plan within\nsanctioned budget;\n(f)        gradual expansion of budgetary and accounting framework to all autonomous\nentities, declared as such under clause (b) of sub-section (1) of section 1[36];\n(g)        usage of idle cash of the autonomous entities, declared as such under clause (b)\nof sub-section (1) of section 1[36]; and\n(h)        require all principal accounting officers to provide the information deemed\nnecessary for effective operation of the cash management and treasury single\naccount system.\n[(3) The Finance Division shall exempt “Self Accounting Entities (SAEs)” from adoption of\n2\nNew Accounting System of ASSAAN Assignment Account.]"
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Government banking arrangements",
      "content": "(1) The Federal Government shall maintain its\nFederal Consolidated Fund Account 1[and the Public Account of the Federation] in the State Bank of\n1\nSubs. and ins. by the Finance Act, 2020 (Act No. XIX of 2020), s. 9.\n2\nIns. by the Finance Act, 2021 (Act No. VIII of 2021), s. 9.\nPakistan and it may open its such other bank accounts as may be required by the Finance Division,\nfrom time to time, in accordance with the State Bank of Pakistan Act, 1956 (XXXIII of 1956).\n(2) These accounts shall be operated by such authorized signatories as may be prescribed by\nthe Finance Division.\n(3) For the purpose of effective financial management and taking corrective measures to ensure\nfinancial discipline, all banks in Pakistan shall provide such information of all accounts maintained by\nMinistries and Divisions, attached departments and subordinate offices and public entities as shall be\nrequired by the Finance Division, from time to time, through State Bank of Pakistan."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Special purpose funds",
      "content": "(1) If monies have been appropriated by the National Assembly\n1\n[for a fund established under any law or with the approval of the Federal Government], the Finance\nDivision shall notify rules or regulations and issue directives for the management and control of such\na fund. Any statutory instrument shall—\n(a)        state the purposes for which the special fund has been established;\n(b)        identify the principal accounting officer responsible for its operations; and\n(c)        specify that the cash balances of such funds shall form part of Public Account\nof the Federation.\n(2) Such funds shall be subject to audit by the Auditor-General of Pakistan.\n(3) Where the Federal Government is satisfied that either—\n(a)        the purposes for which any special fund was established have been fully served;\nor\n(b)        it is in the public interest to wind up a special fund,\nit shall notify dissolution of the said special fund and any credit balances in such fund shall be\ntransferred to the Federal Consolidated Fund. An evaluation report and regulation of such funds shall\nbe notified by the Finance Division.\n2\n[(4) The legal framework of pay, allowances and retirement benefits may be promulgated\nthrough an Act of Parliament within a period not exceeding twenty-four months.\n(5) The Finance Division, with the approval of the Government, shall establish pension fund\nby the end of the financial year 2023-24 to help discharge liabilities of the existing defined benefits\npension scheme and new contributory pension scheme.\n(6) The Finance Division, with the approval of the Government, may introduce a contributory\npension scheme for new employees entering the Government service from a date approved by the\nFederal Government.]\n1\nSubs. by the Finance Act, 2020 (Act No. XIX of 2020), s. 9.\n2\nAdded. by the Finance Act, 2023 (Act No. XXXIV of 2023), s. 9."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Controller General of Accounts",
      "content": "The Controller General of Accounts shall perform his\nfunctions in accordance with the provisions of the Controller General of Accounts (Appointment,\nFunctions and Powers) Ordinance, 2001 (XXIV of 2001)."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Mid",
      "content": "year reporting of budget developments.—(1) By twenty-eighth February each year,\nthe Federal Government shall place mid-year review report before the National Assembly. The report\nshall provide budget and actual comparison of revenues, expenditure and financing.\n(2) After placing the mid-year review report in the National Assembly, the Finance Division\nshall publish the report on its official website."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Year",
      "content": "end government performance monitoring report.—Starting from the financial\nyear 2021-22, the Federal Government shall place, within six months of close of financial year, before\nNational Assembly, a government performance monitoring report detailing—\n(a)    budget and expenditure by outputs; and\n(b)    planned and delivered key performance targets."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Public entities",
      "content": "(1) Where—\n(a)    any board, commission, company, corporation, trust or other fund or account is\nestablished by or under any law which is fully or substantially funded either\nfrom the Federal Consolidated Fund or by way of taxes, levies, duties or other\npublic monies accruing to it in terms of any laws; or\n(b)    any entity other than a state enterprise is established by or under any law, the\nactivities of which may result in a financial commitment or other liability being\nincurred by the Government,\nthe Federal Government may declare such entity to be a public entity for the purposes of this\nAct.\n(2) The Federal Government shall, by notification in the official Gazette, classify public entities\nas—\n(a)    Government’s business enterprises, including public limited companies or\nregistered companies under the law regulating companies or banking; or\n(b)    autonomous entities, which include all public entities that are not Government’s\nbusiness enterprises, which have been established to provide regulatory,\nresearch, development and training or are producing goods or services on non-\ncommercial basis.\n(3) The Finance Division shall be responsible for notifying the policy framework and\nguidelines for financial management of Government’s business enterprises and autonomous entities,\nincluding those related to internal controls, borrowing, cash management, accounting, reporting and\nexternal audit."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Self",
      "content": "generated revenues.—(1) Revenues collected by an autonomous entity, which arise\nfrom any Act or statutory instruments of the Federal Government shall be deposited into the treasury\nsingle account.\n(2) The Finance Division shall, with approval of the Federal Government, notify policy and\nguidelines and may issue regulations on the utilization of revenues generated by autonomous entities."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Preparation of accounts",
      "content": "(1) Accounts of Government’s business enterprises shall be\nprepared in accordance with the provisions of the relevant law. Copy of the audited financial statements\nshall be made available to the Finance Division within three months of their certification.\n(2) The accounts of autonomous entities shall be prepared in accordance with instructions\nissued by the Controller General of Accounts with approval of the Auditor General. Copy of annual\naccounts shall be made available to the Finance Division within three months of their finalization.\n(3) Audited financial statements and annual accounts referred to in sub-section (1) and sub-\nsection (2) shall be laid before Parliament by President of Pakistan along with other accounts of Federal\nGovernment not later than one month after the same are submitted by Auditor-General, except that, if\nParliament is not in session, then the accounts shall be laid before it on the first day of the following\nsession.\n(4) Any reports laid before Parliament under sub-section (3) shall be referred to the Public\nAccounts Committee of Parliament."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Audit",
      "content": "(1) The audit of all public business enterprises shall be in accordance with the\nprovisions of the relevant law.\n(2) The audit of autonomous entities classified shall be in accordance with instructions issued\nby the Auditor-General."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Dissolution of public entity",
      "content": "Where the public entity established under any law or legal\ninstrument stands dissolved or has been wound up, any monies or other resources standing to the credit\nof the public entity at the time of dissolution or winding up shall be paid into the Federal Consolidated\nFund.\n1\n[CHAPTER VIII A"
    },
    {
      "provision_ref": "sec40a",
      "section": "40A",
      "title": "Section 40A. Policy and administration",
      "content": "(1) The administrative ministries and divisions shall be\nresponsible for policy formulation and administration of non tax revenue as per the distribution of\nbusiness approved by the Government.\n(2) The Finance Division shall advise ministries and divisions in policy formulation as per the\nstrategic priorities of Government’s revenue policies."
    },
    {
      "provision_ref": "sec40b",
      "section": "40B",
      "title": "Section 40B. Levy and collection",
      "content": "(1) Non tax revenue shall be levied and charged in accordance\nwith the provisions of relevant laws and such other applicable instruments.\n(2) Notwithstanding anything to the contrary contained in any other law for the time being in\nforce, public entities as defined under section 36 shall pay non tax revenue representing—\n1\nIns. by the Finance Act, 2020 (Act No. XIX of 2020), s. 9.\n(a)     mark up on loans lent by the Government, as per the amortization schedule\nattached with the financing agreement;\n(b)     dividend against the Government’s equity investments as declared by the\nrespective board of directors out of accrued profits of the entity:\nProvided that if public entity is wholly or substantially owned by the\nGovernment, proposals with regard to declaration of dividend and allocation for\nreserve fund, capital requirements etc shall be examined by the controlling\nDivision in consultation with the Finance Division before deliberations and\ndecision in the board of directors.\n(c)     surplus profits as per the provisions of relevant laws; and\n(d)     any other amount owed to the Government as accrued:\nProvided that the public entities shall pay accrued amounts of non-tax revenue\nas per clauses (a) to (d) being the first charge on their gross revenues or profits,\nas the case may be.\n(3) Non tax revenue representing foreign grants and payments, receipts from provision of\nservices, rents, recovery of overpayments, sale of property etc shall accrue on completion of the\nprescribed process.\n(4) The revenue collection offices shall be responsible for collection of all the accrued amounts\nof non tax revenue from liable public entities, individuals, firms, companies etc as per the time\nspecified in the relevant laws and rules. Finance Division shall prescribe procedures for monitoring\nand reporting of non tax revenue by the revenue collection offices."
    },
    {
      "provision_ref": "sec40c",
      "section": "40C",
      "title": "Section 40C. Deposit in Federal Consolidated Fund",
      "content": "(1) Subject to section 40B, the revenue\ncollection offices shall deposit the collected amounts in Federal Consolidated Fund promptly without\ndelay in prescribed manner under the head of account specified by the Finance Division in consultation\nwith the Controller General of Accounts.\n(2) The revenue collection offices shall not retain or appropriate the collected amounts to meet\ndepartmental expenditures except through budgetary mechanism as provided under Articles 80 to 83\nof the Constitution."
    },
    {
      "provision_ref": "sec40d",
      "section": "40D",
      "title": "Section 40D. Late payment surcharge",
      "content": "(1) Notwithstanding anything to the contrary contained in\nany other law for the time being in force, an amount equal to monthly weighted financing cost of\nGovernment’s domestic borrowings shall be payable during the period of default, in addition to the\namount due under section 40B if not paid within the stipulated time.\n(2) Finance Division may prescribe procedure for levy and collection of the surcharge under\nsub-section (1)."
    },
    {
      "provision_ref": "sec40e",
      "section": "40E",
      "title": "Section 40E. Recovery of non tax revenue by Commissioner (Inland Revenue)",
      "content": "(1) If the amounts\nas per sections 40B and 40D are not paid within ninety days of having been due, the Finance Division,\nin consultation with the concerned Division may refer any defaulter’s case to the Commissioner\n(Inland Revenue) concerned for recovery as it were an arrear of income tax.\n(2) The Commissioner (Inland Revenue) shall recover the arrear in accordance with the\nprovisions of the Income Tax Ordinance, 2001(XLIX of 2001) and deposit the receipt in the Federal\nConsolidated Fund as per section 40C.]"
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Removal of difficulty",
      "content": "If any difficulty arises in giving effect to the provisions of this\nAct, Government may make such order, not inconsistent with the provisions of this Act, as it may\nconsider necessary for removal of such difficulty."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Power to make rules",
      "content": "(1) The Federal Government may, by notification in the official\nGazette, make rules for carrying out the purposes of this Act.\n(2) All existing instruments shall continue in force until altered, amended or repealed by such\nauthority competent to alter, amend or repeal the same 1[:]\n1\n[Provided that existing instruments, contrary to the provisions of this Act and the rules made\nthereunder, shall have no legal effect.]\n(3) The existing instruments shall include—\n(a)       The General Financial Rules;\n(b)       Federal Treasury Rules;\n(c)       Fundamental Rules and Supplementary Rules;\n(d)       Civil Service Regulations;\n(e)       Provident Fund Rules;\n(f)       Civil Pension Rules;\n(g)       Methods and procedures prescribed by the Auditor-General of Pakistan with\nreference to deposit and withdrawal of public money;\n(h)       Public Works Department Code;\n(i)       the New System of Financial Control and Budgeting, 2018;\n(j)       the Central Public Works Account Code;\n(k)       the Accounting Policies and Procedures Manual;\n(l)       other Financial Regulations consistent with the above rules; and\n1\nSubs. and added by the Finance Act, 2020 (Act No. XIX of 2020), s. 9.\n(m)     all amendments, schedules, manuals, notifications, forms, appendixes, orders,\ncirculars, codes, instructions, directives, guidelines, clarifications and any other\nsupplementary legal instruments relating to any of those rules, in each case as\nin force in the Federal Government before commencement of this Act.\n(4) All the existing public finance management and administration including the rules,\nregulations and all amendments, schedules, manuals, notifications, forms, appendixes, orders,\ncirculars, codes, instructions, directives, guidelines, clarifications and any other supplementary legal\ninstruments relating to any of those rules, in each case as in force in the Federal Government before\ncommencement of this Act shall be made consistent with this Act through appropriate amendments\nwhere required."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Budget manual",
      "content": "Within a period of six months from commencement of this Act, the\nFinance Division shall approve a budget manual, to be published as well as placed on the Federal\nGovernment’s website."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Implementation and improvement",
      "content": "The Federal Government shall constitute a\ncommittee to oversee implementation of this Act and its secondary legislation. The committee shall\nalso enlist global best practices of the public finance management and shall recommend improvements\nin this Act and its secondary legislation from time to time."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Overriding effect",
      "content": "This Act shall have overriding effect over all other laws and any law\ninconsistent with this Act in contradiction with this Act shall be amended to the extent of the\ninconsistency.\n___________\nRGN Date: 24-11-2025"
    }
  ],
  "definitions": []
}
