{
  "id": "pk-public-gambling-act-1867",
  "type": "statute",
  "title": "Public Gambling Act, 1867",
  "title_en": "Public Gambling Act, 1867",
  "short_name": "PGA",
  "status": "in_force",
  "issued_date": "1867-01-24",
  "in_force_date": "1867-01-24",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap4%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Public Gambling Act, 1867 (III of 1867) published by The Pakistan Code (Criminal Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Interpretation clause. In this Act",
      "content": "_\n5\n*      *           *            *         *            *           *\n“Common gaming-house”. “Common gaming-house means any house, walled enclosure,\nroom or place in which cards, dice, tables or other instruments of gaming are kept or used for the\nprofits or gain of the person owning, occupying, using or keeping such house, enclosure, room or\nplace, whether by way of charge for the use of the instruments of gaming, or of the house, enclosure,\nroom or place, or otherwise howsoever:\n6\n*      *           *           *          *"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Power to extend Act. 7[Sections 13 and 17] of this Act shall extend to the whole of the",
      "content": "8\n[Punjab]; and it shall be competent to the 9[Provincial Government] whenever 10[it] may think fit, to\nextend by a 11[notification to be published in three successive numbers of the official Gazette, all or\n1\nShort title given by the Repealing and Amending Act, 1897 (5 of 1897).\nThis Act has been repealed to the extent of Islamabad Capital Territory, see Ordinance No. 27 of 1981 , s. 4 and 3rd Sch.\n*The Public Gambling Act, 1867, (III of 1867) has been repealed in its application in the Province of Punjab. See Punjab Act, II of 1985,\ns.2.\n2\nFor Statement of Objects and Reasons, see Gazette of India, 1866, p. 976; for Report of the Select Committee, see Gazette of India, 1867,\nSupplement, p. 44; and for Proceedings in Council, see Gazette of India, 1866, p. 662, and Gazette of India, 1867, pp. 48 and 52.\nThe Act was declared to be in force in Baluchistan by the British Baluchistan Laws Regulation, 1913 (2 of 1913), s. 3.\nIt has been applied to phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.W.F.P. subject to certain\nmodifications, see N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950.\nIt has been extended to the Excluded Area of Upper Tanawal other than Phulera by the N.W.F.P. (Upper Tanawal) (Excluded Area) Laws\n___\nRegulation, 1950 and declared to be in force in that area with effect from the 1st June, 1951, See N. W.F.P. Gazette Extraordinary, dated\nthe 1st June, 1951.\n___\nIt has been amended in its application to their :\n(i)        N.W.F.P. by N.W.F.P. Act 5 of 1947 and N.W.F.P. Act 28 of 1950; and\n(ii)         Punjab, by Punjab Act 1 of 1929.\nIt has also been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950); and applied in\nthe Federated Areas of Baluchistan, see Gazette of India, 1937, Pt. I. p. 1499.\nSections 1,2,3,4,5,6,7,8,9,10,14,15 and 16 of this Act, have been extended to the Districts of Peshawar, Hazara and Mardan with effect from\nthe 5th December, 1957, vide Police Notification No. 3(5)-HP-I/57 (7385)/26110, dated the 5th December, 1957.\nThis Act has been repealed to the extent of Islamabad Capital Territory, see Ordinance No. 27 of 1981, s. 4 and 3rd Sch.\n3\nCertain original words have successively been amended by the Repealing and Amending Act, 1903 (1 of 1903), A. 0, 1949, Sch., and the\nCentral Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), to read as above.\n4\nCertain original words have successively been amended by the Amending Act, 1891 (12 of 1891), Sch II, Act 1 of 1903. A.O. 1949 and\nOrdinance 21 of 1960, s. 3 and 2nd Sch., (with effect from the 14th October, 1955) to read as above.\n5\nDefinitions of \"Lieutenant-Governor \"and \"Chief Commissioner\" rep. by A. O., 1937.\n6\nThe clauses relating to “Number” and “Gender” rep. by the Second Repealing and Amending Act 1914 (17 of 1914), s. 3 and II Sch.\n7\nSubs. by the Amending Act, 1891 (12 of 1891), for “ss. 13, 17 and 18,”\n8\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960) s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for\n“Province. which had been subs. for “said territories”, by A.O., 1949, Sch.\n9\nSubs. by A.O., 1937, for “Lieutenant-Governor or the Chief-Commissioner, as the case may be.”\n10\nSubs., ibid., for “he”.\n11\nFor notification extending the remaining sections of this Act to the town of Kallarkot and certain villages in Mianwali District, see Gaz. of\nWest Pakistan 1958,Pt.I, pp.182-83.\nFor notification extending the provisions of all the remaining sections of this act to the local limits of the revenue states ( as specified in the\nland revenue record for the time being inforce) of Taxila in the Distrct of Rawalpindi, see West Pakistan Gazette, 1959, Pt. I p. 447.\nany of the remaining sections of this Act to any city, town, suburb, railway-station house and place\nbeing not more than three miles distant from any part of such station-house within the 1[Punjab], and\nin such notification to define, for the purposes of this Act, the limits of such city, town, suburb or\nstation-house, and from time to time alter the limits so defined.\nFrom the date of any such extension, so much of any rule having the force of law which shall\nbe in operation in the territories to which such extension shall have been made, as shall be\ninconsistent with or repugnant to any section so extended, shall cease to have effect it such\nterritories."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Penalty for owning or keeping, or having charge of gaming",
      "content": "house. Whoever, being the\nowner or occupier, or having the use, of any house, walled enclosure, room or place situate within\nthe limits to which this Act applies, opens, keeps or uses the same as a common gaming-house; and.\nWhoever, being the owner or occupier of any such house, walled enclosure, room of place as\naforesaid, knowingly or willfully permits the same to be opened, occupied used or kept by any other\npersons as a common gaming-house; and\nWhoever has the care or management of, or in any manner assists in conducting, the business\nof any house, walled enclosure, room or place as aforesaid, opened, occupied, used or kept for the\npurpose aforesaid; and.\nWhoever advances or furnishes money for the purpose of gaming with persons frequenting\nsuch house, walled enclosure, room or place,\nshall be liable to a fine not exceeding two hundred rupees, or to imprisonment of either\ndescription, 2as defined in the Pakistan Penal Code, (XLV of 1860) for any term not exceeding three\nmonths.3"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Penalty for being found in gaming",
      "content": "house. Whoever is found in any such house, walled\nenclosure, room or place, playing or gaming with cards, dice, counters, money or other instruments\nof gaming, or is found there present for the purpose of gaming, whether playing for any money,\nwager, stake or otherwise, shall be liable to a fine not exceeding one hundred rupees, or to\nimprisonment of either description, 2as defined in the Pakistan Penal Code (XLV of 1860), for any\nterm not exceeding one month,3\nand any person found in any common gaming-house during any gaming or playing therein\nshall be presumed, until the contrary be proved, to have been there for the purpose of gaming."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Powers to enter and authorise police to enter and search. If the Magistrate of a district3",
      "content": "or other officer invested with the full powers of a Magistrate4, or the District Superintendent of\nPolice, upon credible information, and after such enquiry as he may think necessary, has reason to\nbelieve that any house, walled enclosure, room or place, is used as a common gaming-house,\n1\nThe Original words “territories subject to his government or administration” have successively been amended by A. O., 1937, A.O., 1949\nSch., and Ordinance 21 of 1960, s. 3 and 2nd Sch. (with effect from the 14th October, 1955) to read as above.\n2\nSee s. 53 of the Code.\n3\nAs to enhanced punishment for a second conviction of an offence under section 3 or section 4, see section 15 of this Act.\n4\nRead District Magistrate and Magistrate of the first class, respectively, see Code of Criminal Procedure, 1898 (5 of 1898), s. 3.\nhe may either himself enter, or by his warrant authorise any officer of police, not below such\nrank as the 1[provincial Government] shall appoint in this behalf to enter with such assistance as may\nbe found necessary, by night or by day, and by force if necessary, any such house, walled enclosure,\nroom or place,\nand may either himself take into custody, or authorise such officer to take into custody, all\npersons whom he or such officer finds therein, whether or not then actually gaming;\nand may seize or authorise such officer to seize all instruments of gaming, and all moneys\nand securities for money, and articles of value, reasonably suspected to have been used or intended to\nbe used for the purpose of gaming which are found therein;\nand may search or authorise such officer to search all parts of the house, walled enclosure,\nroom or place which or such officer shall have so entered when he or such officer has reason to\nbelieve that any instruments of gaming are concealed therein, and also the persons of those whom he\nor such officer so takes into custody;\nand may seize or authorise such officer to seize and take possession of all instruments of\ngaming found upon such search."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Finding cards, etc., in suspected houses, to be evidence that such houses are common",
      "content": "gaming-houses. When any cards, dice, gaming-tables, cloths, boards or other instruments of gaming\nare found in any house, walled enclosure, room or place entered or searched under the provisions of\nthe last preceding section, or about the person of any of those who are found therein, it shall be\nevidence, until the contrary is made to appear, that such house, walled enclosure, room or place, is\nused as a common gaming-house, and that the persons found therein were there present for the\npurpose of gaming, although no play was actually seen by the Magistrate or police-officer, or any of\nhis assistants."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Penalty on persons arrested for giving false names and addresses. If any person found",
      "content": "in any common gaming-house entered by any Magistrate or officer of police under the provisions of\nthis Act, upon being arrested, by any such officer or upon being brought before any Magistrate, on\nbeing required by such officer or Magistrate to give his name and address, shall refuse or neglect to\ngive the same, or shall give any false name or address, he may upon conviction before the same or\nany other Magistrate be adjudged to pay any penalty not exceeding five hundred rupees, together\nwith such costs, as to such Magistrate shall appear reasonable, and on the non-payment of such\npenalty and costs, or in the first instance, if to such Magistrate it shall seem fit, may be imprisoned\nfor any period not exceeding one month."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. On conviction for keeping a gaminghouse, instruments of gaming to be destroyed. On",
      "content": "conviction of any person for keeping or using any such common gaming- house, or being present\ntherein for the purpose of gaming, the convicting Magistrate may order all the instruments of gaming\nfound therein to be destroyed, and may also order all or any of the securities for money and other\narticles seized, not being instruments of gaming, to be sold and converted into money, and the\nproceeds thereof with all moneys seized therein to be forfeited or, in his discretion, may order any\npart thereof to be returned to the persons appearing to have been severally thereunto entitled.\n1\nSubs. by A.O., 1937, for “Lieutenant-Governor or Chief-Commissioner”."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Proof of playing for stake unnecessary. It shall not be necessary, in order to convict any",
      "content": "person of keeping a common gaming-house, or of being concerned in the management of any\ncommon gaming-house, to prove that any person found playing at any game was playing for any\nmoney, wager or stake."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Magistrate may require any person apprehended to be sworn and give evidence. It",
      "content": "shall be lawful for the Magistrate before whom any persons shall be brought, who have been found\nin any house, walled enclosure, room or place entered under the provisions of this Act, to require any\nsuch persons to be examined on oath or solemn affirmation, and give evidence touching any\nunlawful gaming in such house, walled enclosure, room or place, or touching any act done for the\npurpose of preventing, obstructing or delaying the entry into such house, walled enclosure, room or\nplace or any part thereof, of any Magistrate or officer authorised as aforesaid.\nNo person so required to be examined as a witness shall be excused from being so examined\nwhen brought before such Magistrate as aforesaid, or from being so examined at any subsequent time\nby or before the same or any other Magistrate, or by or before any Court on any proceeding or trial in\nany ways relating to such unlawful gaming or any such acts as aforesaid, or from answering any\nquestion put to him touching the matters aforesaid, on the ground that his evidence will tend to\ncriminate himself.\nAny such person so required to be examined as a witness, who refuses to make oath or take\naffirmation accordingly or to answer any such question as aforesaid, shall be subject to be dealt\nwithin all respects as any person committing the offence described in section 178 or section 179 (as\nthe case may be) of the Pakistan Penal Code (XLV of 1860)."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Witnesses indemnified. Any person who shall have been Concerned in gaming contrary",
      "content": "to this Act, and who shall be examined as a witness before a Magistrate on the trial of any person for\na breach of any of the provisions of this Act relating to gaming, and who, upon such examination,\nshall in the opinion of the Magistrate make true and faithful discovery, to the best of his knowledge,\nof all things as to which he shall be so examined, shall thereupon receive from the said Magistrate a\ncertificate. in writing to that effect, and shall be free from all prosecutions under this Act for\nanything done before that time in respect of such gaming."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Act not to apply to certain games. Nothing in the foregoing provisions of this Act",
      "content": "contained shall be held to apply to any game of mere skill wherever played."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Gaming and setting birds and animals to fight in public streets. A police",
      "content": "officer may\napprehend without warrant any person found playing for money or other valuable thing with cards,\ndice, counters or other instruments of gaming, used in playing any game not being a game of mere\nskill in any public street, place or thoroughfare situated within the limits aforesaid, or\nany person setting any birds or animals to fight in any public street, place or thoroughfare\nsituated within the limits aforesaid, or\nany person there present aiding and abetting such public fighting of birds and animals.\nSuch person when apprehended shall be brought without delay before a Magistrate, and shall\nbe liable to a fine not exceeding fifty rupees, or to imprisonment, either simple or rigorous for any\nterm not exceeding one calendar month;\n1\nSee now the Code of Criminal Procedure, 1898 (5 of 1898).\nDestruction of instruments of gaming found in public streets. and such police-officer may\nseize all instruments of gaming found in such public place or on the person of those whom he shall\nso arrest, and the Magistrate may on the conviction of the offender order such instruments to be\nforthwith destroyed."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Offences, by whom triable. Offences punishable under this Act shall be triable by any",
      "content": "Magistrate having jurisdiction in the place where the offence is committed.\nBut such Magistrate shall be restrained within the limits of his jurisdiction under the lCode of\nCriminal Procedure, as to the amount of fine or imprisonment he may inflict."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Penalty for subsequent offence. Whoever, having been convicted of an offence punish",
      "content": "able under section 3 or section 4 of this Act, shall again be guilty of any offence punishable under\neither of such sections, shall be subject for every such subsequent offence to double the amount of\npunishment to which he would have been liable for the first commission of an offence of the same\ndescription:\nProvided that he shall not be liable in any case to a fine exceeding six hundred rupees, or to\nimprisonment for a term exceeding one year."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Portion of fine may be paid to informer. The Magistrate trying the case may direct any",
      "content": "portion of any fine which shall be levied under section 3 and 4 of this Act, or any part of the moneys\nor proceeds of articles seized and ordered to be forfeited under this Act, to be paid to an informer."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Recovery and application of fines. All fines imposed under this Act may be recovered",
      "content": "in the manner prescribed by section 61 of the lCode of Criminal Procedure 2* * *."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. 3[Repealed]",
      "content": "______________\nDate: 13-09-2024\n1\nSee now the Code of Criminal Procedure, 1898 (5 of 1898).\n2\nThe words “and such fines shall (subject to the provisions contained in the last preceding section) be applied as the Lieutenant-Governor or\nChief Commissioner, as the case may be, shall from time to time direct” rep. by A. O., 1937.\n3\nRep. by the Repealing Act, 1874 (XVI of 1874), s. 1 and Sch., Pt. I."
    }
  ],
  "definitions": []
}
