{
  "id": "pk-competition-act-2010",
  "type": "statute",
  "title": "Competition Act, 2010",
  "title_en": "Competition Act, 2010",
  "short_name": "Competition Act 2010",
  "status": "in_force",
  "issued_date": "2010-10-13",
  "in_force_date": "2010-10-13",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FsbJk%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Competition Act, 2010 (XIX of 2010) published by The Pakistan Code.",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, application and commencement",
      "content": "(1) This Act may be called the\nCompetition Act, 2010.\n(2) It extends to the whole of Pakistan.\n(3) It shall apply to all undertakings and all actions or matters that take place in Pakistan and\ndistort competition within Pakistan.\n(4) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the subject or context;__\n(a)     “acquisition” means any change of control of any undertaking by way of\nacquisition of Shares, assets or any other means;\n(b)     “agreement” includes any arrangement, understanding or practice, whether or\nnot it is in writing or intended to be legally enforceable;\n(c)     “Chairman” means the Chairman of the Commission and includes the Acting\nChairman;\n(d)     “Commission” means the Competition Commission of Pakistan established\nunder section 12;\n(e)     “dominant position” of one undertaking or several undertakings in a relevant\nmarket shall be deemed to exist if such undertaking or undertakings have the\nability to behave to an appreciable extent independently of competitors,\ncustomers, consumers and suppliers and the position of an undertaking shall\nbe presumed to be dominant if its share of the relevant market exceeds forty\npercent;\n(f)    “goods” includes any item, raw material, product or by-product which is sold\nfor consideration;\n(g)    “Member” means a member of the Commission;\n(h)    “merger” means the merger, acquisition, amalgamation, combination or\njoining of two or more undertakings or part thereof into an existing\nundertaking or to form a new undertaking; and expression “merge” means to\nmerge, acquire, amalgamate, combine or join, as the context may require;\n(i)    “Minister” means the Federal Minister for Finance and in his absence, the\nAdviser to the Prime Minister on Finance;\n(j)    “Ordinance” means the Companies Ordinance, 1984 (XLVII of 1984);\n(k)    “relevant market” means the market which shall be determined by the\nCommission with reference to a product market and a geographic market and a\nproduct market comprises all those products or services which are regarded as\ninterchangeable or Substitutable by the consumers by reason of the products'\ncharacteristics, prices and intended uses. A geographic market comprises the\narea in which the undertakings concerned are involved in the supply of\nproducts or services and in which the conditions of competition are\nsufficiently homogeneous and which can be distinguished from neighboring\ngeographic areas because, in particular, the conditions of competition are\nappreciably different in those areas;\n(l)    “retailer”, in relation to the sale of any goods, means a person who sells the\ngoods to any other person other than for re-sale;\n(m)    “regulations” means the regulations made by the Commission under this Act;\n(n)    “rules” means the rules made by the Federal Government under this Act;\n(o)    “services” means a service of any description whether industrial, trade,\nprofessional or otherwise;\n(p)    “Tribunal” means Competition Appellate Tribunal under section 43 of the Act;\n(q)    “undertaking” means any natural or legal person, governmental body\nincluding a regulatory authority, body corporate, partnership, association, trust\nor other entity in any way engaged, directly or indirectly, in the production,\nsupply, distribution of goods or provision or control of services and shall\ninclude an association of undertakings; and\n(r)    “wholesaler”, in relation to the sale of any goods, means a person who\npurchases goods and sells them to any other person for re-sale.\n(2) The words and expressions used but not defined in this Act shall have the same meanings\nrespectively assigned to them in the Ordinance.\nPROHIBITION OF ABUSE OF DOMINANT POSITION, CERTAIN AGREEMENTS,"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Abuse of dominant position",
      "content": "(1) No person shall abuse dominant position.\n(2) An abuse of dominant position shall be deemed to have been brought about, maintained or\ncontinued if it consists of practices which prevent, restrict, reduce or distort competition in the\nrelevant market.\n(3) The expression “practices referred to in sub-section (2) shall include, but are not limited\nto___\n(a)     limiting production, sales and unreasonable increases in price or other unfair\ntrading conditions;\n(b)     price discrimination by charging different prices for the same goods or\nservices from different customers in the absence of objective justifications that\nmay justify different prices;\n(c)     tie-ins, where the sale of goods or service is made conditional on the purchase\nof other goods or services;\n(d)     making the conclusion of contracts subject to acceptance by the other parties\nof supplementary obligations which by their nature or according to\ncommercial usage, have no connection with the subject of the contracts;\n(e)     applying dissimilar conditions to equivalent transactions on other parties,\nplacing them at a competitive disadvantage;\n(f)     predatory pricing driving competitors out of a market, prevent new entry, and\nmonopolize the market;\n(g)     boycotting or excluding any other undertaking from the production,\ndistribution or sale of any goods or the provision of any service; or\n(h)     refusing to deal."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Prohibited agreements",
      "content": "(l) No undertaking or association of undertakings shall enter\ninto any agreement or, in the case of an association of undertakings, shall make a decision in respect\nof the production, supply, distribution, acquisition or control of goods or the provision of services\nwhich have the object or effect of preventing, restricting, or reducing competition within the relevant\nmarket unless exempted under section 5.\n(2) Such agreements include, but are not limited to___\n(a)     fixing the purchase or selling price or imposing any other restrictive trading\nconditions with regard to the sale or distribution of any goods or the provision\nof any service;\n(b)     dividing or sharing of markets for goods or services, whether by territories, by\nvolume of sales or purchases, by type of goods or services sold or by any other\nmeans;\n(c)     fixing or setting the quantity of production, distribution or sale with regard to\nany goods or the manner or means of providing any services;\n(d)     limiting technical development or investment with regard to the production,\ndistribution or sale of any goods or the provision of any service; or\n(e)     collusive tendering or bidding for sale, purchase or procurement of any goods\nor services.\n(f)     applying dissimilar conditions to equivalent transactions with other trading\nparties, thereby placing them at a disadvantage; and\n(g)     make the conclusion of contracts subject to acceptance by the other parties of\nsupplementary obligations which, by their nature or according to commercial\nusage, have no connection with the subject of such contracts.\n(3) Any agreement entered into in contravention of the provision in sub-section (1) shall be\nvoid."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Individual exemption",
      "content": "_ (1) The Commission may grant an exemption from section 4\nwith respect to a particular practice or agreement, if a request for an exemption has been made to it\nby a party to the agreement or practice and the agreement is one to which section 9 applies.\n(2) The exemption under sub-section (1) may be granted subject to such conditions as the\nCommission considers it appropriate to impose and has effect for such period as the Commission\nconsiders appropriate.\n(3) That period must be specified in the grant of the exemption.\n(4) An individual exemption may be granted so as to have effect from a date earlier than that\non which it is granted.\n(5) On an application made in such a way as may be specified by the rules made under\nsection 55, the Commission may extend the period for which an exemption has effect; but, if the\nrules so provide, the Commission may do so only in specified circumstances."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Cancellation, etc., of individual exemptions",
      "content": "(1) If the Commission has reasonable\ngrounds for believing that there has been a material change of circumstances since it granted an\nindividual exemption, it may by notice in writing__\n(a)     cancel the exemption;\n(b)     vary or remove any condition or obligation; or\n(c)     impose one or more additional conditions or obligations.\n(2) If the Commission has reasonable suspicion that the information on which it based its\ndecision to grant an individual exemption was incomplete, false or misleading in a material\nparticular, the Commission may by notice in writing take any of the steps mentioned in sub-section\n(1).\n(3) Breach of a condition has the effect of cancelling the exemption.\n(4) Failure to comply with an obligation allows the Commission, by notice in writing to take\nany of the steps mentioned in sub-section (1).\n(5) The Commission may act under this section on its own initiative or on complaint made by\nany person."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Block exemption",
      "content": "(1) If agreements which fall within a particular category of\nagreements are, in the opinion of the Commission, likely to be agreements to which section 9\napplies, the Commission may make a block exemption order giving exemption to such agreements.\n(2) A block exemption order may impose conditions or obligations subject to which a block\nexemption is to have effect.\n(3) A block exemption order may provide__\n(a)    that breach of a condition imposed by the order has the effect of canceling the\nblock exemption in respect of an agreement;\n(b)    that if there is a failure to comply with an obligation imposed by the order, the\nCommission may, by notice in writing, cancel the block exemption in respect\nof the agreement;\n(c)    that if the Commission considers that a particular agreement is not one to\nwhich section 9 applies, the Commission may cancel the block exemption in\nrespect of that agreement.\n(4) A block exemption order may provide that the order is to cease to have effect at the end of\na period specified in the block exemption order."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Block exemption procedure",
      "content": "(1) Before making a block exemption order, the\nCommission must__\n(a)    publish details of its proposed order in such a way as the Commission thinks\nmost suitable for bringing it to the attention of those likely to be affected; and\n(b)    consider any representations about it which are made to the Commission.\n(2)     A block exemption order may provide for a block exemption to have effect from a\ndate earlier than that on which the order is made."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. The criteria for individual and block exemptions",
      "content": "(1) The Commission may grant\nindividual or block exemption in respect of an agreement, which substantially contributes to___\n(a)    improving production or distribution;\n(b)    promoting technical or economic progress, while allowing consumers a fair\nshare of the resulting benefit; or\n(c)     the benefits of that clearly outweigh the adverse effect of absence or lessening\nof competition.\n(2) The onus of claiming an exemption under this Act shall lie on the undertaking seeking\nexemption."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Deceptive marketing practices",
      "content": "(1) No undertaking shall enter into deceptive\nmarketing practices.\n(2) The deceptive marketing practices shall be deemed to have been resorted to or continued\nof an Undertaking resorts to__\n(a)     the distribution of false or misleading information that is capable of harming\nthe business interests of another undertaking;\n(b)     the distribution of false or misleading information to consumers, including the\ndistribution of information lacking a reasonable basis, related to the price,\ncharacter, method or place of production, properties, suitability for use, or\nquality of goods;\n(c)     false or misleading comparison of goods in the process of advertising; or\n(d)     fraudulent use of another's trademark, firm name, or product labeling or\npackaging."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Approval of mergers",
      "content": "(1) No undertaking shall enter into a merger which substantially\nlessens competition by creating or strengthening a dominant position in the relevant market.\n(2) Notwithstanding the provisions contained in the Act where an undertaking, intends to\nacquire the shares or assets of another undertaking, or two or more undertakings intend to merge the\nwhole or part of their businesses, and meet the pre-merger notification thresholds stipulated in\nregulations prescribed by the Commission, such undertaking or undertakings shall apply for\nclearance from the Commission of the intended merger.\n(3) The concerned undertakings shall submit a pre-merger application to the Commission as\nsoon as they agree in principle or sign a non-binding letter of intent to proceed with the merger.\n(4) Application referred to in sub-section (3) shall be in the form and accompanied by a\nprocessing fee as may be prescribed by the Commission. The concerned undertakings shall not\nproceed with the intended merger until they have received clearance from the Commission.\n(5) The Commission shall by way of an order reffered to in section 31, decide on whether the\nintended merger meets the thresholds and the presumption of dominance as determined in section 3.\nSuch order shall be made within thirty days of receipt of the application.\n(6) If so determined, the Commission shall initiate a second phase review and for that\npurpose the Commission may require the concerned undertakings to provide such information as it\nconsiders necessary to enable the Commission to make the necessary determination.\n(7) Failure to make a determination within the prescribed period of thirty days for the first\nphase review shall mean that the Commission has no objection to the intended merger.\n(8) On initiation of the second phase review the Commission shall, within ninety days of\nreceipt of the requested information under sub-section (6), review the merger to assess whether it\nsubstantially lessens competition by creating or strengthening a dominant position in the relevant\nmarket, and shall give its decision on the proposed transaction. In case concerned undertakings fail to\nprovide the information requested, the Commission may reject the application.\n(9) Failure to render a decision within ninety days shall be deemed to mean that the\nCommission has no objection to the intended merger.\n(10) If after the second phase review the Commission determines that the intended merger\nsubstantially lessens competition by creating or strengthening a dominant position, it may\nnonetheless approve the transaction, if it is shown that__\n(a)    it contributes substantially to the efficiency of the production or distribution of\ngoods or to the provision of services;\n(b)    such efficiency could not reasonably have been achieved by a less restrictive\nmeans of competition;\n(c)    the benefits of such efficiency clearly outweigh the adverse effect of the\nabsence or lessening of competition; or\n(d)    it is the least anti-competitive option for the failing undertaking's assets, when\none of the undertakings is faced with actual or imminent financial failure:\nProvided that the burden of proof shall lie with the undertaking seeking the approval.\n(11) In case the Commission determines that the transaction under review does not qualify\nthe criteria specified in sub-section (10), the Commission may;\n(a)    prohibit the consummation of the transaction;\n(b)    approve such transaction subject to the conditions laid by the Commission in\nits order;\n(c)    approve such transaction on the condition that the said undertakings enter into\nlegally enforceable agreements specified by the Commission in its order.\n(12) Where an undertaking has consummated the merger without complying with the\nprovisions of sub-section (1) to sub-section (4), the Commission shall, after giving the undertaking\nan opportunity of being heard, make appropriate orders under section 31.\n(13) Where the Commission has granted approval subject to conditions, the Commission\nmay, within one year, review the order of approval of merger on its own or on the application of the\nundertakings concerned on the ground that it is satisfied that the circumstances of the relevant market\nor the undertakings have so changed as to warrant review of the conditions imposed.\n(14) If the Commission determines that the approval was based on false or misleading\ninformation submitted by the undertaking, or the conditions prescribed in the relevant order of the\nCommission have not been fully complied with, the Commission may after affording the\nundertakings concerned an opportunity of being heard___\n(a)    undo such merger or acquisition; or\n(b)    prescribe modifications or additions in the original order."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Establishment of Commission",
      "content": "_ (1) There is hereby established a Commission to be\ncalled the Competition Commission of Pakistan.\n(2) The Commission shall be a body corporate with perpetual succession and common seal,\nand may sue and be sued in its own name and, subject to and for the purpose of this Act, may enter\ninto contracts and may acquire, purchase, take, hold and enjoy moveable and immovable property of\nevery description and may convey, assign, surrender, yield up, charge, mortgage, demise, reassign,\ntransfer or otherwise dispose of or deal with any moveable or immovable property or any interest\nvested in it, upon such terms as it deems fit.\n(3) The Commission shall be administratively and functionally independent, and the Federal\nGovernment shall use its best efforts to promote, enhance and maintain the independence of the\nCommission."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Head Office",
      "content": "The head office of the Commission shall be in Islamabad and the\nCommission may establish and close down offices at such other places in Pakistan as it considers\nnecessary."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Composition of Commission",
      "content": "(1) The Commission shall consist of not less than five\nand not more than seven members:\nProvided that the Federal Government may increase or decrease the number of Members,\nfrom time to time, as it may consider appropriate.\n(2) The Members shall be appointed by the Federal Government and from amongst the\nMembers of the Commission, the Federal Government shall appoint the Chairman.\n(3) All Members of the Commission shall serve on a full-time basis.\n(4) Not more than two Members of the Commission shall be employees of the Federal\nGovernment.\n(5) No person shall be recommended for appointment as a Member unless that person is\nknown for his integrity, expertise, eminence and experience for not less than ten years in any relevant\nfield including industry, commerce, economics, finance, law, accountancy or public administration:\nProvided that the Federal Government may prescribe qualifications and experience and mode\nof appointment of such Members in such manner as it may prescribe.\n(6) No person shall be appointed or continued as a Member if he__\n(a)    has been convicted of an offence involving moral turpitude;\n(b)    has been or is adjudged insolvent;\n(c)    is incapable of discharging his duties by reason of physical, psychological or\nmental unfitness and has been so declared by a registered medical practitioner\nappointed by the Federal Government;\n(d)    absents himself from three consecutive meetings of the Commission, without\nobtaining leave of the Commission;\n(e)    fails to disclose any conflict of interest at or within the time provided for such\ndisclosure under this Act or contravenes any of the provisions of this Act\npertaining to unauthorized disclosure of information; or\n(f)    deemed incapable of carrying out his responsibilities for any other reason.\n(7) No act or proceeding of the Commission shall be invalid by reason of absence of a\nmember or existence of vacancy among its members or any defect in the constitution thereof.\n(8) No Member or officer of the Commission shall assume his office until he has made such\ndeclaration affirming secrecy and fidelity."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. The Chairman",
      "content": "(l) The Chairman shall be the chief executive of the Commission and\nshall, together with the other Members, be responsible for the administration of the affairs of the\nCommission.\n(2) The Chairman may subject to such conditions as he may deem fit, from time to time\ndelegate all or any of his powers and functions to any of the Members."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. The Acting Chairman",
      "content": "At any time when the position of the Chairman is vacant, or the\nChairman is unable to perform his functions due to any cause, the Federal Government shall appoint\nappointment of a Chairman on a regular basis."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Term of office",
      "content": "The Chairman and Members of the Commission shall be appointed for a\nterm of three years on such salary, terms and conditions of service as the Federal Government may\nby rules prescribe:\nProvided that the Chairman and Members shall be eligible for re-appointment for such term\nor terms but shall cease to hold office on attaining the age of sixty-five years or the expiry of the\nterm whichever is earlier."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Restriction on employment of the Chairman and other Members in certain cases",
      "content": "The Chairman and other Members shall not, for a period of one year from the date on which they\ncease to hold office, accept any employment in, or connected with the management or administration\nof, any undertaking with has been a party to any investigation before the Commission under this Act."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Termination of appointment of Members.__ (1) Subject to sub",
      "content": "section (2), the\nappointment of any Member or the Chairman may, at any time, be revoked and he may be removed\nfrom his office by order of the Federal Government if it is found that such person has become\ndisqualified under sub-section (6) of section 14.\n(2) Unless a disqualification referred to in section (1) arises from the judgment or order of a\nCourt or tribunal of competent jurisdiction under any relevant provision of applicable law, a Member\nor the Chairman shall not be removed or his appointment revoked without an enquiry by an impartial\nperson or body of persons constituted in accordance with such procedure as may be prescribed by\nrules made by the Federal Government and such rules shall provide for a reasonable opportunity for\nthe Member or the Chairman to be heard in defence.\n(3) A Member or the Chairman may resign his office at any time by notice in writing\naddressed to the Federal Government.\n(4) A vacancy in the Commission caused by the death, resignation or removal of any Member\nor the Chairman shall be filled by the Federal Government within thirty days of the occurrence of\nsuch vacancy."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Commission Fund",
      "content": "(l) There shall be established a fund to be known as the “CCP\nFund” which shall vest in the Commission and shall be utilized by the Commission to meet charges\nin connection with the functioning of the Commission including payment of salaries and other\nremuneration to the Chairman, Members, officers, officials, experts, advisers, and consultants of the\nCommission.\n(2) The Fund shall consist of,\n(a)     allocations or grants by the Federal Government;\n(b)     charges and fees levied by the Commission;\n(c)     contributions from local and foreign donors or agencies with the approval of\nthe Federal Government;\n(d)     returns on investments and income from assets of the Commission; and\n(e)     all other sums which may in any manner become payable to or vested in the\nCommission;\n(f)     a percentage of the fees and charges levied by other regulatory agencies in\nPakistan as prescribed by the Federal Government in consultation with the\nCommission and the percentage so prescribed shall not be varied to the\ndisadvantage of the Commission.\n(3) The Commission shall make regulations for incurring expenditures as well as investments\nfrom the Fund.\n(4) The Commission may open and maintain accounts at such scheduled banks as it may from\ntime to time determine. The Commission may with the approval of the Federal Government, open\nand maintain foreign currency accounts."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Accounts and audits",
      "content": "(1) The Commission shall cause proper accounts to be kept and\nshall as soon as practicable after the end of each financial year cause to be prepared for that financial\nyear a statement of accounts of the Commission which shall include a balance sheet and an account\nof income and expenditure.\n(2) Within sixty days after the end of each financial year, the annual financial statements of\nthe Commission shall be audited by the Auditor-General of Pakistan or by a firm of chartered\naccountants nominated by the Auditor-General of Pakistan.\n(3) The auditors shall make a report to the commission upon the balance sheet and accounts\nand in such report they shall state whether in their opinion the balance sheet is a full and fair balance\nsheet containing all necessary particulars and properly drawn up so as to exhibit a true and correct\nview of the affairs of the Commission and, in case they have called for any explanation or\ninformation from the Commission, whether it has been given and whether it is satisfactory."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Annual report",
      "content": "(1) Within ninety days from the end of each financial year, the\nCommission shall cause a report to be prepared on the activities of the Commission (including\ninvestigations, advocacy activities, enquiries and merger reviews made by the Commission) during\nthat financial year.\n(2) The Commission shall, within one hundred and twenty days of the end of each financial\nyear send a copy of the annual report of the Commission under sub-section (1) together with a copy\nof the statement of accounts of the Commission certified by the auditors and a copy of the auditors'\nreport to the Federal Government which shall cause them to be published in the official Gazette and\nlaid before both Houses of the Majlis-e-Shoora (Parliament) within two months of their receipt."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Appointments by Commission",
      "content": "(1) The Commission may appoint such officers,\nofficials, experts, advisers and consultants as it considers necessary to carry out such functions as\nmay be prescribed by the Commission with such powers and on such terms and conditions as it may\ndetermine from time to time.\n(2) The Commission may, by notification in the official Gazette, make regulations in respect\nof the terms and conditions of service of its employees."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Meetings of Commission",
      "content": "(1) Subject to this section, the Chairman may convene such\nmeetings of the Commission at such times and places as he considers necessary for the efficient\nperformance of the functions of the Commission.\n(2)    The Chairman shall preside at every meeting of the Commission, and in the absence\nof Chairman, the Members may elect a Member to preside at the meeting.\n(3)     At any meeting of the Commission the quorum shall be three Members.\n(4)     All questions arising at any meeting of the Commission shall be determined by a\nmajority of votes of the Members present and voting.\n(5)     In the event of an equality of votes, the Chairman shall have a casting vote.\n(6)     Subject to the provisions of this Act, the Chairman may give directions regarding the\nprocedure to be followed at or in connection with any meeting of the Commission."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Disclosure of interest by Members",
      "content": "_ (1) For the purpose of this and the next following\nsection, a person shall be deemed to have an interest in a matter if he has any interest, pecuniary or\notherwise, in such matter which could reasonably be regarded as giving rise to a conflict between his\nduty to honestly perform his functions under this Act and such interest, so that his ability to consider\nand decide any question impartially or to give any advice without bias, may reasonably be regarded\nas impaired.\n(2) A Member having any interest in any matter to be discussed or decided by the\nCommission shall, prior to any discussion of the matter, disclose in writing, to the Commission, the\nfact of his interest and the nature thereof.\n(3) A disclosure of interest under sub-section (2) shall be recorded in the minutes of the\nCommission, prior to any discussion of, or decision on, the matter and, after the disclosure, the\nMember:___\n(a)     shall not, save in the cases provided in sub-sections (4) to (6), take part nor be\npresent in any deliberation or decision of the Commission; and\n(b)     shall be disregarded for the purpose of constitution of a quorum of the\nCommission.\n(4) If a Member is not the Chairman and the Chairman becomes aware that a Member has a\nconflict of interest, the Chairman shall:__\n(a)     if the Chairman considers that the Member should not take part, or continue to\ntake part, as the case may require, in determining the matter, direct the\nMember accordingly; or\n(b)     in any other case, cause the Member's interest to be disclosed to the persons\nconcerned in the matter including any person whose application is pending\ndecision or adjudication by the Commission, the Member in respect of whom\na direction has been given under clause (a) shall comply with the direction.\n(5) If the Member is the Chairman, he shall disclose his interest to the persons concerned in\nthe matter including any person whose application is pending decision or adjudication by the\nCommission.\n(6) Subject to sub-section (4), the Chairman or the Member who has any interest in any\nmatter referred to in this section shall not take part, or continue to take part, as the case may require,\nin determining the matter unless everyone concerned in it consents to the Chairman or, as the case\nmay be, the Member so taking part."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Notification of interest by staff of Commission",
      "content": "(1) Where a person who, in the\ncourse of___\n(a)     performing a function, or exercising a power, as an officer of the Commission,\n(b)     performing functions or service as an employee, or\n(c)     performing a function or services in any capacity by way to assisting or\nadvising the Commission, or any officer of the Commission, is required to\nconsider a matter in which he has an interest, such person shall forthwith give\nto the Commission a written notice stating that he is required to consider the\nmatter and has an interest in it and setting out particulars of the interest.\n(2) The person referred to in sub-section (1) shall also declare his interest in accordance with\nthe said sub-section whenever it is necessary to avoid the conflict of interest."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Officers and employees, etc., to be public servants",
      "content": "The Chairman, Members,\nemployees, experts, consultants and advisers of the Commission authorized to perform any function\nor exercise any power under this Act shall be deemed to be public servants within the meaning of\nsection 21 of the Pakistan Penal Code, 1860 (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Functions and powers of the Commission",
      "content": "(1) The functions and powers of the\nCommission shall be___\n(a)    to initiate proceedings in accordance with the procedures of this Act and make\norders in cases of contravention of the provisions of the said Act;\n(b)    to conduct studies for promoting competition in all sectors of commercial\neconomic activity;\n(c)    to conduct enquiries into the affairs of any undertaking as may be necessary\nfor the purposes of this Act;\n(d)    to give advice to undertakings asking for the same as to whether any action\nproposed to be taken by such undertakings is consistent with the provisions of\nthis Act, rules or orders made thereunder;\n(e)    to engage in competition advocacy; and\n(f)    to take all other actions as may be necessary for carrying out the purposes of\nthis Act.\n(2)      The Commission may, subject to such conditions as it may think fit to impose,\ndelegate all or any of its functions and powers to any of its Members or officers as it deems fit."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Competition advocacy",
      "content": "The Commission shall promote competition through advocacy\nwhich, among others, shall include__\n(a)    creating awareness and imparting training about competition issues and taking\nsuch other actions as may be necessary for the promotion of a competition\nculture;\n(b)    reviewing policy frameworks for fostering competition and making suitable\nrecommendations for amendments to this Act and any other laws that affect\ncompetition in Pakistan to the Federal Government and Provincial\nGovernments;\n(c)    holding open hearings on any matter affecting the state of competition in\nPakistan or affecting the country's commercial activities and expressing\npublicly an opinion with respect to the issues; and\n(d)    posting on its website all decisions made, inquiries under review and\ncompleted, merger guidelines, educational material and the like."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Proceedings in cases of contravention",
      "content": "(1) Where the Commission is satisfied that\nthere has been or is likely to be, a contravention of any provision of Chapter II, it may make one or\nmore of such orders specified in section 31 as it may deem appropriate. The Commission may also\nimpose a penalty at rates prescribed in section 38, in all cases of contravention of the provisions of\nChapter II.\n(2) Before making an order under sub-section (1), the Commission shall___\n(a)     give notice of its intention to make such order stating the reasons therefore to\nsuch undertaking as may appear to it to be in contravention; and\n(b)     give the undertaking an opportunity of being heard on such date as may be\nspecified in the notice and of placing before the Commission facts and\nmaterial in support of its contention:\nProvided that in case the undertaking does not avail the opportunity of being heard, the\nCommission may decide the case ex parte.\n(3) The Commission shall publish its Orders in the official Gazette, for the information of the\npublic.\n(4) An order made under sub-section (1) shall have effect notwithstanding anything to the\ncontrary contained in any other law for the time being in force or in any contract or memorandum or\narticles of association.\n(5) Any order issued under this section shall include the reasons on which the order is based."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Orders of the Commission",
      "content": "The Commission may in the case of___\n(a)     an abuse of dominant position, require the undertaking concerned to take such\nactions specified in the order as may be necessary to restore competition and\nnot to repeat the prohibitions specified in Chapter II or to engage in any other\npractice with similar effect; and\n(b)     prohibited agreements, annul the agreement or require the undertaking\nconcerned to amend the agreement or related practice and not to repeat the\nprohibitions specified in section 4 or to enter into any other agreement or\nengage in any other practice with a similar object or effect; or\n(c)     a deceptive marketing practice, require___\n(i)     the undertaking concerned to take such actions specified in the order as\nmay be necessary to restore the previous market conditions and not to\nrepeat the prohibitions specified in section 10; or\n(ii)    confiscation, forfeiture or destruction of any goods having hazardous\nor harmful effect.\n(d)     A merger, in addition to the provisions contained in section 11__\n(i)     authorize the merger, possibly setting forth the conditions to which the\nacquisition is subject, as prescribed in regulations;\n(ii)    decide that it has doubts as to the compatibility of the merger with\nChapter II, thereby opening a second phase review; or\n(iii)   undo or prohibit the merger, but only as a conclusion of the second\nphase review."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Power to issue interim orders",
      "content": "(1) Where, during the course of any proceeding under\nsection 30, the Commission is of opinion that the issuance of a final order in the proceedings is likely\nto take time and that, in the situation that exists or is likely to emerge, serious or irreparable damage\nmay occur and an interim Order is necessary in the public interest, it may, after giving the\nundertaking concerned an opportunity of being heard, by order, direct such undertaking to do or\nrefrain from doing or continuing to do any act or thing specified in the order.\n(2) An order made under sub-section (1) may, at any time, be reviewed, modified or\ncancelled by the Commission and, unless so cancelled, shall remain in force for such period as may\nbe specified therein but not beyond the date of the final order made under section 31."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Powers of the Commission in relation to a proceeding or enquiry",
      "content": "(1) The\nCommission shall, for the purpose of a proceeding or enquiry under this Act, have the same powers\nas are vested in a civil court under the Code of Civil Procedure, 1908 (Act V of 1908), while trying a\nsuit, in respect of the following matters, namely:\n(a)     summoning and enforcing the attendance of any witness and examining him\non oath;\n(b)     discovery and production of any document or other material object producible\nas evidence;\n(c)     accept evidence on affidavits;\n(d)     requisitioning of any public record from any court or office; and\n(e)     issuing of a commission for the examination of any witness, document or both.\n(2) Any proceeding before the Commission shall be deemed to be a judicial proceeding\nwithin the meaning of sections 193 and 228 of the Pakistan Penal Code (Act XLV of 1860), and the\nCommission shall be deemed to be civil court for the purposes of section 195 and Chapter XXXV of\n(3) The Commission may, for the purpose of a proceeding or enquiry under this Act, require\nany undertaking:\n(a)     to produce before, and to allow to be examined and kept by, an officer of the\nCommission specified in this behalf, any books, accounts, or other documents\nin the custody or under the control of the undertaking so required, being\ndocuments relating to any matter the examination of which may be necessary\nfor the purposes of this Act; and\n(b)     to furnish to an officer so specified such information in its possession, relating\nto any matter as may be, necessary for the purpose of this Act."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Power to enter and search premises",
      "content": "(1) Notwithstanding anything contained in any\nother law for the time being in force, the Commission for reasonable grounds to be recorded in\nwriting shall have the power to authorize any officer to enter and search any premises for the purpose\nof enforcing any provision of this Act.\n(2) For the purpose of sub-section (1), the Commission__\n(a)    shall have full and free access to any premises, place, accounts, documents or\ncomputer;\n(b)    may stamp, or make an extract or copy of any accounts, documents or\ncomputer-stored information to which access is obtained under clause (a);\n(c)    may impound any accounts or documents and retain them for as long as may\nbe necessary for the purposes of the Act;\n(d)    may where a hard copy or computer disk of information stored on a computer\nis not made available, impound and retain the computer for as long as is\nnecessary to copy the information required; and\n(e)    may make an inventory of any article found in any premises or place to which\naccess is obtained under clause (a).\n(3) Any officer of the Commission who seeks to exercise the right to enter and search\npremises shall be required to provide evidence of his authority to act on behalf of the Commission.\n(4) The Commission may authorize any valuer to enter any premises or place to inspect such\naccounts and documents as may be necessary to enable the valuer to make a valuation of an asset for\n(5) The occupier of any premises or place to which access is sought under sub-section (1)\nshall provide all reasonable facilities and assistance to ensure the effective exercise of the right of\naccess.\n(6) Any accounts, documents or computer impounded and retained under sub-section (2) and\n(3) shall be signed for by the Commission or an authorized officer.\n(7) An undertaking whose accounts, documents or computer have been impounded and\nretained under sub-section (2) may examine them and make an extract or copy from them during\nregular office hours under such supervision as the Commission may determine.\nExplanation.__ In this section, the expression “Occupier”, in relation to any premises or place,\nincludes the owner, manager or any other person found present on the premises or place."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Forcible entry",
      "content": "(l) In the event that an undertaking refuses without reasonable cause\nto allow the Commission to exercise the powers contained in section 34, an investigating officer of\nthe Commission may by written order, signed by any two Members enter any place or building by\nforce, if necessary.\n(2) Notwithstanding anything contained in sub-section (1), no investigating officer of the\nCommission shall enter any premises by the use of force without a written order of the Commission\nsigned by two Members.\n(3) If, on enquiry conducted in accordance with the rules it is found that the exercise by an\ninvestigating officer of his power under sub-section (2) was vexatious, excessive or with mala fide\nintent such officer shall be dismissed from service, and shall be guilty of an offence and shall be\nliable on conviction to a fine which may extend to five hundred thousand rupees or to imprisonment\nfor a term not exceeding one year or both.\n(4) Whenever a criminal court imposes a fine under sub-section (3) it shall, when passing\njudgment, order that a sum equal to the whole or any part of the fine recovered, be paid to the person\non whose complaint the investigating officer was convicted, and in case the fine is not recovered the\nsum shall be paid out of the Fund.\n(5) Any sum paid under sub-section (4) shall be without prejudice to the right of the\naggrieved person to avail any other remedies available to him under the law but at the time of\nawarding compensation in any subsequent proceedings relating to the, same matter the court shall\ntake into account any sum recovered from the convict and paid to the aggrieved person."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Power to call for information relating to undertaking",
      "content": "Notwithstanding anything\ncontained in any other law for the time being in force, the Commission may, by general or special\norder, call upon an undertaking to furnish periodically or as and when required any information\nconcerning the activities of the undertaking, including information relating to its organization,\naccounts, business, trade practices, management and connection with any other undertaking, which"
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Enquiry and studies",
      "content": "(1) The Commission may, on its own, and shall upon a reference\nmade to it by the Federal Government, conduct enquiries into any matter relevant to the purposes of\nthis Act.\n(2) Where the Commission receives from an undertaking or a registered association of\nconsumers a complaint in writing of such facts as appear to constitute a contravention of the\nprovisions of Chapter II, it shall, unless it is of opinion that the application is frivolous or vexatious\nor based on insufficient facts, or is not substantiated by prima facie evidence, conduct an enquiry into\nthe matter to which the complaint relates.\n(3) The Commission may outsource studies by hiring consultants on contract.\n(4) If upon the conclusion of an inquiry under sub-section (1) or sub-section (2), the\nCommission is of opinion that the findings are such that it is necessary in the public interest so to do,\nit shall initiate proceedings under section 30."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Penalty",
      "content": "(1) The Commission may by order direct any undertaking or any director,\nofficer or employee of an undertaking, to pay by way of penalty such sum as may be specified in the\norder if, after giving the undertaking concerned an opportunity of being heard, it determines that\nsuch undertaking:___\n(a)     has been found engaged in any activity prohibited under this Act;\n(b)     has failed to comply with an order of the Commission made under this Act;\n(c)     has failed to supply a copy of the agreement or any other documents and\ninformation as required under this Act or requisitioned by the Commission;\n(d)     has furnished any information or made any statement to the Commission\nwhich such undertaking knows or has reason to believe to be false or found by\nthe Commission to be inaccurate; or\n(e)    knowingly abuses, interferes with, impedes, imperils, or obstructs the process\nof the Commission in any manner:\nProvided that fair comments made in good faith and in the public interest on the working of\nthe Commission or on any order of the Commission issued after the completion of any proceedings,\nshall not be subject to the imposition of a penalty.\n(2) The Commission may impose penalties at the following rates, namely:___\n(a)    for a contravention of any provision of Chapter II of the Act, an amount not\nexceeding seventy-five million rupees or an amount not exceeding ten percent\nof the annual turnover of the undertaking, as may be decided in the\ncircumstances of the case by the Commission; or\n(b)    for non-compliance of any order, notice or requisition of the Commission an\namount not exceeding one million rupees, as may be decided in the\ncircumstances of the case by the Commission; and\n(c)    for clause (e) in sub-section (1), an amount not exceeding one million rupees\nas may be decided in the circumstances of the case by the Commission.\n(3) If the violation of the order of the Commission is a continuing one, the Commission may\nalso direct the undertaking guilty of such violation shall pay by way of penalty a further sum which\nmay extend to one million rupees for every day after the first such violation.\n(4) Any penalty imposed under this Act shall be recoverable as provided in section 40.\n(5) Notwithstanding anything contained in this Act or any other law for the time being in\nforce, failure to comply with an order of the Commission shall constitute a criminal offence\npunishable with imprisonment for a term which may extend to one year or with fine which may\nextend to twenty five million rupees and the Commission may, in addition to, or in lieu of, the\npenalties prescribed in this Act, initiate proceedings in a Court of competent jurisdiction."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Leniency",
      "content": "(l) The Commission may, if it is satisfied that any undertaking which is a\nparty to a prohibited agreement and is alleged to have violated Chapter II prohibitions, has made a\nfull and true disclosure in respect of the alleged violation, impose on such undertaking a lesser\npenalty as it may deem fit, than that provided in section 38.\n(2) Any exemption from a penalty or imposition of a lesser penalty shall be made only in\nrespect of an undertaking that is a party to a prohibited agreement which first made the full and true\ndisclosure under this section.\n(3) The Commission may, if it is satisfied that any undertaking which has been granted\nlenient treatment under sub-section (1) failed to comply with the conditions on which a lesser penalty\nwas imposed had given false evidence, revoke the leniency provision and impose on the undertaking\nthe penalty provided under section 38."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Recovery of penalties",
      "content": "(1) For the recovery of any amount from an undertaking, the\nCommission may serve upon the concerned person or the chief executive or director of the said\nundertaking, a copy of a notice in the prescribed form requiring such person to pay the said amount\nwithin the time specified in the notice.\n(2) If the amount referred to in the notice under sub-section (1) is not paid within the\nprescribed time, the Commission may proceed to recover the said amount from the person or\nundertaking in default in any one or more of the following manners, namely:__\n(a)    attachment of immovable or sale of any movable property, including bank\naccount of the person or undertaking;\n(b)    appointment of a receiver for the management of the movable or immovable\nproperty of the person or undertaking;\n(c)    recovery of the amount as arrears of land revenue through the District\nRevenue Officer;\n(d)    require any of the following, by notice in writing, the person to deduct and pay\nthe sum specified in the notice on or before such date as may be so specified,\nnamely:__\n(i)     from whom any money is due or may become due to the undertaking;\n(ii)   who holds, or controls the receipt or disposal of or may subsequently\nhold, or control the receipt or disposal of, any money belonging to the\nundertaking or on account of the undertaking; or\n(iii)   who is responsible for the payment of any sum to the undertaking.\n(3) Any bank, receiver, District Revenue Officer or undertaking who has paid any sum in\ncompliance with a notice under sub-section (2) shall be deemed to have paid such sum to the\nCommission in respect of the undertaking, and the receipt of the Commission shall constitute a good\nand sufficient discharge of the liability of such bank, receiver, District Revenue Officer or\nundertaking to the extent of the sum referred to in such receipt.\n(4) If any bank, receiver, District Revenue Officer or undertaking on whom a notice is served,\nfails to attach, receive, recover, deduct and pay, as the case may be, the amount specified in the said\nnotice, such bank, receiver, District Revenue Officer or undertaking shall be treated as a defaulter\nand the amount specified in the said notice shall be recoverable from him or it, as the case may be,\nby the Commission in accordance with the provisions of this Act.\n(5) The Commission may, by order, direct any bank, receiver, District Revenue Officer or\nundertaking which is a defaulter as referred to in sub-section (4), to pay by way of penalty, such sum\nas specified in the order, after giving to the bank, receiver, District Revenue Officer or undertaking\nan opportunity of being heard, it determines that such bank, receiver, District Revenue Officer or\nundertaking has wilfully failed to comply with the order of the Commission.\n(6) For the purposes of the recovery of the amount under sub-section (2), the Commission\nshall have the same powers as a civil court has under the Code of Civil Procedure 1908 (Act V of\n1908).\n(7) The Commission may make rules regulating the procedure for the recovery of amounts\nunder this section and any other matters connected with or incidental to the operation of this section.\n(8) All penalties and fines recovered under this Act shall be credited to the Public Account of\nthe Federation."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Appeal to the Appellate Bench of the Commission",
      "content": "(1) An appeal shall lie to an\nAppellate Bench of the Commission in respect of an order made by any Member or authorized\nofficer of the Commission. The person aggrieved by such order may, within thirty days of the\npassing of the order submit an appeal, to the Appellate Bench of the Commission.\n(2) The Commission shall constitute Appellate Benches comprising not less than two\nMembers to hear appeals under sub-section (1).\n(3) The decisions of the Appellate Bench shall be made unanimously or by a majority of\nvotes if the Appellate Bench comprises of more than two members. In the event of a split verdict, the\noriginal order appealed against shall hold and have effect as the final order of the Commission.\n(4) No Member shall be included in an Appellate Bench who has participated or been\ninvolved in the decision being appealed against.\n(5) The form in which an appeal is to be filed and the fees to be paid therefore and other\nrelated matters shall be prescribed by rules."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Appeal to the Court",
      "content": "Any person aggrieved by an order of the Commission comprising\ntwo or more Members or of the Appellate Bench of the Commission may within sixty days of the\ncommunication of the order, prefer appeal to the Competition Appellate Tribunal."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Competition Appellate Tribunal",
      "content": "(1) As soon as may be within thirty days of he\ncommencement of this Act, the Federal Government shall constitute the Competition Appellate\nTribunal which shall consist of a Chairperson who shall be a person who has been a judge of the\nSupreme Court or is a retired Chief Justice of a High Court and two technical members who shall be\npersons of ability, integrity and have special knowledge and professional experience of not less than\nten years in international trade, economics, law, finance and accountancy.\n(2) The Chairperson and members shall hold office for a period of three years and shall be\neligible for reappointment for a similar term and shall cease to hold office on attaining the age of\nsixty-eight years or the expiry of the term whichever is earlier.\n(3) The Chairperson and the members shall be entitled to such salary and other terms and\nconditions of service as the Federal Government may by rules prescribe.\n(4) The Competition Appellate Tribunal may, in consultation with the Federal Government,\nmake rules governing procedure in proceedings before the Tribunal.\n(5) The Competition Appellate Tribunal shall decide an appeal expeditiously within six\nmonths of its presentation to the Tribunal."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Appeal to Supreme Court",
      "content": "Any person aggrieved by an order of the Competition\nAppellate Tribunal may prefer an appeal to Supreme Court within sixty days."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Common seal",
      "content": "(l) The Commission shall have a common seal which shall be kept in the\ncustody of the Chairman or such other person as may be authorized by the Chairman by regulations\nmade by the Commission.\n(2) Documents required or permitted to be executed under the seal shall be specified and\nauthenticated in such manner as shall be authorized by regulations."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Service of notices and other documents",
      "content": "For the purpose of this Act any notice,\nrequisition, letter or order required to be served on an undertaking shall be treated as properly served\non the undertaking, if such service is made in the manner prescribed for the service of a summons\nunder the Code of Civil Procedure, 1908 (V of 1908) or as may be prescribed by the Commission."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Compensation",
      "content": "(1) No undertaking shall be entitled to or be paid any compensation or\ndamages by the Commission for any loss or injury suffered on account of the termination of any\nagreement or employment or the divestment of any share or property or any other action taken in\npursuance of any order made under this Act.\n(2) Nothing in sub-section (1) shall prevent an undertaking from recovering compensation or\ndamages from any other party for any loss or injury suffered on account of the termination of any\nagreement or employment or the divestment of any share or property or any other action taken in\npursuance of any order made under this Act."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Indemnity.__ Subject to sub",
      "content": "section (3) of section 35 no suit, prosecution or other legal\nproceeding shall lie against the commission or any Member, officer or servant of the Commission for\nanything in good faith done or intended to be done under this Act or any regulations or order made\nthereunder."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Agreement for exchange of information",
      "content": "The Commission may, with approval of the\nFederal Government, enter into agreement with competition agencies in any part of the world for the\nexchange and assistance in performance of its function under this Act."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Sharing and supply of information",
      "content": "In order that information relevant to the\nperformance of its functions is available to the Commission and for carrying out the purposes of this\nAct,___\n(a)     all offices and agencies of the Federal Government and Provincial\nGovernment shall supply free of cost or charges information requested by the\nCommission in the discharge of its functions under this Act; and\n(b)     the State Bank of Pakistan, Security and Exchange Commission of Pakistan,\nthe Central board of Revenue, the Federal Bureau of Statistics and all\nregulatory authorities shall arrange to provide requisite information as\npermissible under their own laws to the Commission, from time to time, at its\nrequest in the discharge of its functions under this Act."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Obligation of confidentiality",
      "content": "_ (1) Subject to this section, any person who is or was at\nany time,___\n(a)     acting as a Member of the Commission, or\n(b)     engaged as an officer or employee of the Commission, or\n(c)     authorized to perform or exercise any function or power of the Commission or\nany function or power on behalf of the Commission or to render services to the\nCommission in the capacity of a consultant or adviser;\nshall not, except to the extent necessary to perform his official duties, or in the performance or\nexercise of such a function or power, either directly or indirectly, make a record of, or disclose to any\nperson, any information that is or was acquired by him because of having been so appointed,\nengaged or authorized, or make use of any such information, for any purpose other than the\nperformance of his official duties or the performance or exercise of that function or power.\n(2) Any person who contravenes sub-section (1) shall be guilty of an offence which shall be\npunishable with imprisonment for a term which may extend to one year, or with fine which may\nextend to one million rupees or with both.\n(3) The Commission shall take all reasonable measures to protect from unauthorized use or\ndisclosure of the information given to it in confidence in connection with the performance of its\nfunctions or the exercise of its powers.\n(4) For the purpose of sub-section (1) the disclosure of information as required or permitted\nby any law for the time being in force in Pakistan or any other jurisdiction shall be taken to be\nauthorized use and disclosure of the information.\n(5) For the purposes of sub-section (1), the disclosure of information by a person for the\npurposes of:__\n(a)     performing his functions as,____\n(i)     a Member or employee of the Commission;\n(ii)    an officer, or employee or who is authorized to perform or exercise a\nfunction or power of, or on behalf of, the Commission; or\n(b)     the performance of functions or service by the person by way of assisting a\nMember or an officer of the Commission,\nshall be taken to be authorized use and disclosure of the information.\n(6) Where the Chairman is satisfied that any particular information,___\n(a)     may enable or assist the Commission to perform or exercise any of its\nfunctions or powers;\n(b)     may enable or assist the Federal Government, or an agency of the Federal\nGovernment to perform a function or exercise a power; or\n(c)     may enable or assist the Federal Government, an agency of the Federal\nGovernment, or of a foreign country to perform a function, or exercise a\npower, conferred by a law in force in that foreign country,\nthe disclosure of the information to such persons by a person whom the Chairman authorizes for the\npurpose shall be taken to be authorized use and disclosure of the information.\n(7) The Chairman may impose conditions to be complied with in relation to information\ndisclosed under sub-section (6).\n(8) The Chairman may delegate all or any of his functions and powers under sub-sections (6)\nand (7) to a Member or an officer of the Commission.\n(9) Nothing in any of sub-sections (4), (5), (7) and (8) shall limit what may otherwise\nconstitute, for the purposes of sub-section (1), authorized use or disclosure of information."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Permitted disclosure",
      "content": "Nothing in section 49 shall preclude a person from,__\n(a)    producing a document to a court in the course of criminal proceedings or in\ntime being in force;\n(b)    disclosing to a court in the course of any proceedings referred to in clause (a)\nany matter or thing, that came under his or her notice in the performance of his\nor her official duties or in the performance of a function or the exercise of a\npower referred to in that section;\n(c)    producing a document or disclosing information to a person to whom, in the\nopinion of the Commission, it is in the public interest that the document be\nproduced or the information be disclosed;\n(d)    producing a document or disclosing information that is required or permitted\nby any law for the time being in force in Pakistan or any other jurisdiction to\nbe produced or disclosed, as the case may be; or\n(e)    producing a document or disclosing information to the Commission."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Assistance and advice to the Commission",
      "content": "(1) The Commission may seek the\nassistance of any person, authority or agency for the performance of its functions under this Act.\n(2) All officers of an agency and any person whose assistance has been sought by the\nCommission in the performance of its functions shall render such assistance to the extent it is within\ntheir power or capacity.\n(3) Subject to sub-section (3) of section 35, no statement made by a person or authority in the\ncourse of giving evidence before the Commission or its staff shall use against him or subject such\nperson or authority to civil or criminal proceedings except for prosecution of such person or\nauthority for giving false evidence."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Power to exempt",
      "content": "The Federal Government may, by notification in the official Gazette,\nexempt from the application of this Act or any provision thereof and for such period as it may\nspecify in such notification,__\n(a)    any class of undertaking if such exemption is necessary in the interest of\nsecurity of the State or public interest;\n(b)    any practice or agreement arising out of and in accordance with any obligation\nassumed by Pakistan under any treaty, agreement or convention with any other\nState or States; or\n(c)    any undertaking Which performs a sovereign function on behalf of the Federal\nGovernment or a Provincial Government."
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Act not to apply to trade unions",
      "content": "Nothing in the Act shall apply to trade unions or its\nmember functioning in accordance with any law pertaining to trade unions for the time being in\nforce."
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. Powers of the Federal Government to issue directives",
      "content": "The Federal Government may,\nas and when it considers necessary, issue policy directives to the Commission, not inconsistent with"
    },
    {
      "provision_ref": "sec57",
      "section": "57",
      "title": "Section 57. Power to make rules.__ (1) Subject to sub",
      "content": "section (2), the Commission may, by\nnotification in the official Gazette and with the approval of Federal Government, make rules for all\nor any of the matters in respect of which it is required to make rules or to carry out the purposes of\nthis Act.\n(2) The power to make rules conferred by this section, except for the first occasion, shall be\nsubject to the condition of previous publication and before making any rules the draft thereof shall be\npublished in the official Gazette for eliciting public opinion thereon within a period of not less than\nthirty days from the date of publication."
    },
    {
      "provision_ref": "sec58",
      "section": "58",
      "title": "Section 58. Power to make regulations.__ (1) Subject to sub",
      "content": "section (2), the Commission may, by\nnotification in the official Gazette, make such regulations as may be required to carry out the\npurposes of this Act.\n(2) The power to make regulations conferred by this section, except for the first occasion,\nshall be subject to the condition of previous publication and before making any regulations the draft\nthereof shall be published in two newspapers of wide circulation for eliciting public opinion thereon\nwithin a period of not less than thirty days from the date of publication."
    },
    {
      "provision_ref": "sec59",
      "section": "59",
      "title": "Section 59. Act to override other laws",
      "content": "The provisions of this Act shall have effect\nnotwithstanding anything to the contrary contained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec60",
      "section": "60",
      "title": "Section 60. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to the provisions of this\nAct, the Commission may make such order, not inconsistent with the provisions of this Act, as may\nappear to it to be necessary for the purpose of removing the difficulty."
    },
    {
      "provision_ref": "sec61",
      "section": "61",
      "title": "Section 61. Repeals and savings",
      "content": "On the commencement of this Act__\n(a)     the Monopolies and Restrictive Trade Practices (Control and Prevention)\nOrdinance, 1970 (V of 1970), hereinafter referred to as the repealed Act, shall\nstand repealed;\n(b)     the Monopoly Control Authority established under the repealed Act shall stand\ndissolved;\n(c)     all assets, rights, powers, authorities and privileges and property, movable and\nimmovable, cash and bank balances, reserve funds, investments and all other\ninterests and rights in, or arising out of such property and all debts, liabilities\nand obligations of whatever kind of the Monopoly Control Authority\nsubsisting immediately before its dissolution shall stand transferred to and vest\nin the Competition Commission of Pakistan established under this Act;\n(d)     no officer, employee, servant, or any other person holding any post in\nconnection with the affairs of the Monopoly Control Authority shall have any\nright or lien to appointment to any post in the Competition Commission of\nPakistan established under this Act;\n(e)     officers, employees, servants, or any other person holding any post in\nconnection with the affairs of the Monopoly Control Authority, not considered\nfor appointment in the Commission shall have the option to be discharged\nfrom service on payment of admissible relieving benefits, or alternatively,\ntheir services shall be placed at the disposal of the Finance Division for\nabsorption on the terms and conditions to be determined by that Division but\nnot less favorable than those which they were entitled to in Monopoly Control\nAuthority, and unless sooner they are absorbed elsewhere they shall continue\nto draw their pay, allowances, privileges or other benefits from the\nCommission as they were drawing while holding their posts in the Authority;\n(f)     save as otherwise provided in clause (c), all the debts and obligations incurred\nor contracts entered into or rights acquired and all matters and things engaged\nto be done by, with or for the Monopoly Control Authority before the\nenforcement of this Act shall be deemed to have been incurred, entered into,\nacquired or engaged to be done by with or for the Commission, established\nunder this Act, as the case may be; and\n(g)     all suits and other legal proceedings instituted by or against the Monopoly\nControl Authority before the commencement of this Act shall be deemed to be\nsuits and proceedings by or against the Competition Commission of Pakistan\nas the case may be and may proceed and be dealt with accordingly."
    },
    {
      "provision_ref": "sec62",
      "section": "62",
      "title": "Section 62. Validation of actions, etc",
      "content": "Anything done, actions taken, orders passed, instruments\nmade, notifications issued, agreements made, proceedings initiated, processes or communication\nissued, power conferred, assumed or exercised, by the Commission or its officers on or after the 2nd\nOctober, 2007 and before the commencement of this Act, shall be deemed to have been validly done,\nmade, issued, taken, initiated, conferred, assumed, and exercised and provisions of the Act shall\nhave, and shall be deemed always to have had, effect accordingly.\n________\nLast Uploaded on 20.11.2023"
    }
  ],
  "definitions": [
    {
      "term": "acquisition",
      "definition": "any change of control of any undertaking by way of acquisition of Shares, assets or any other means;",
      "source_provision": "sec2"
    },
    {
      "term": "agreement",
      "definition": "any arrangement, understanding or practice, whether or not it is in writing or intended to be legally enforceable;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Commission and includes the Acting Chairman;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the Competition Commission of Pakistan established under section 12;",
      "source_provision": "sec2"
    },
    {
      "term": "goods",
      "definition": "any item, raw material, product or by-product which is sold for consideration;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "a member of the Commission;",
      "source_provision": "sec2"
    },
    {
      "term": "merger",
      "definition": "the merger, acquisition, amalgamation, combination or joining of two or more undertakings or part thereof into an existing undertaking or to form a new undertaking; and expression “merge” means to merge, acquire, amalgamate, combine or join, as the context may require;",
      "source_provision": "sec2"
    },
    {
      "term": "Minister",
      "definition": "the Federal Minister for Finance and in his absence, the Adviser to the Prime Minister on Finance;",
      "source_provision": "sec2"
    },
    {
      "term": "Ordinance",
      "definition": "the Companies Ordinance, 1984 (XLVII of 1984);",
      "source_provision": "sec2"
    },
    {
      "term": "relevant market",
      "definition": "the market which shall be determined by the Commission with reference to a product market and a geographic market and a product market comprises all those products or services which are regarded as interchangeable or Substitutable by the consumers by reason of the products' characteristics, prices and intended uses. A geographic market comprises the area in which the undertakings concerned are involved in the supply of products or services and in which the conditions of competition are sufficiently homogeneous and which can be distinguished from neighboring geographic areas because, in particular, the conditions of competition are appreciably different in those areas;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "the regulations made by the Commission under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "the rules made by the Federal Government under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "services",
      "definition": "a service of any description whether industrial, trade, professional or otherwise;",
      "source_provision": "sec2"
    },
    {
      "term": "Tribunal",
      "definition": "Competition Appellate Tribunal under section 43 of the Act;",
      "source_provision": "sec2"
    },
    {
      "term": "undertaking",
      "definition": "any natural or legal person, governmental body including a regulatory authority, body corporate, partnership, association, trust or other entity in any way engaged, directly or indirectly, in the production, supply, distribution of goods or provision or control of services and shall include an association of undertakings; and",
      "source_provision": "sec2"
    }
  ]
}
