{
  "id": "pk-public-health-emergency-provision-ordinance-1944",
  "type": "statute",
  "title": "Public Health (Emergency Provision) Ordinance, 1944",
  "title_en": "Public Health (Emergency Provision) Ordinance, 1944",
  "short_name": "PHPO",
  "status": "in_force",
  "issued_date": "1944-05-19",
  "in_force_date": "1944-05-19",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJmY-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Public Health (Emergency Provision) Ordinance, 1944 (XXI of 1944) published by The Pakistan Code (Health/Medical Laws).",
  "provisions": [
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Effect of other laws",
      "content": "ORDINANCE No. XXI OF 1944\n[20th May, 1944]\nAn Ordinance to make special provisions in regard to public health.\nWHEREAS an emergency has arisen which renders it necessary to make special provision\nfor preventing the spread of human disease, safeguarding the public health and providing and\nmaintaining adequate medical services and other services essential to the health of the community;\nNow, THEREFORE, in exercise of the powers conferred by section 72 of the Government of\nIndia Act (26) Geo 5,c. 2.), as set out in the Ninth Schedule to the Government of India Act, 1935,\nthe Governor General is pleased to make and promulgate the following Ordinance :—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Ordinance may be called the Public\nHealth (Emergency Provisions) Ordinance, 1944.\n1\n[(2) It extends to the whole of Pakistan].\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context,",
      "content": "(a)       “appropriate Government” means in relation to cantonment authorities and to\nport authorities in major ports, the 3[Federal Government], and in relation to\nall other local authorities, the Provincial Government;\n(b)       “local area” means the area within which a local authority exercises its\nfunctions ;\n(c)       “local authority” in this section and sections 7 to 10 and 14 includes, any\nbody, whether incorporated or not, engaged in providing a supply of water;\n(d)       “medical establishment” means establishment employed in connection with\nthe provision of medical services;\n(e)       “public health services” and “public health establishment” include respectively\nsanitary, water-supply, vaccination, sewage disposal, drainage and\nconservancy services and establishment maintained for the purposes of such\nservices, and any other service or establishment of a local authority which the\nappropriate Government may by notification in the official Gazette declare to\nbe a public health service or public health establishment for any purpose of\nthis Ordinance;\n(f)       “purpose of this Ordinance” includes the purposes of ensuring the provision of\nadequate medical services, of preventing the spread of human disease, of\nsafeguarding the public health and of providing or maintaining services\nessential to the health of the community.\n___________________________________________________________________________\n1\nSubs. by the Central Laws (Statute Reform) Ordinance No XX1 of 1960, s. 3 and 2nd Sch. (with effect from the 14th October, 1955).\n2\nSubs. by F.A.O., 1975, Art.2 and Table."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Power to require local authorities to take health measures",
      "content": "(1) The appropriate\nGovernment may by order in writing require any local authority to take within such period as may be\nspecified in the order such measures as may be so specified, being measures which are in the opinion\nof that Government necessary for any purpose of this Ordinance; and thereupon it shall be the duty\nof the local authority to comply with the order within the specified period.\n(2) If in the opinion of the appropriate Government a local authority which has been ordered\nunder sub-section (1) to take any measures has failed to take, or is unlikely to complete, such\nmeasures within the period specified in the order, the appropriate Government may, without\nprejudice to any other action which may be taken under this Ordinance, authorise any person to take\nor complete, as the case may be, the said measures; and the person so authorised may for the purpose\nexercise all or any of the powers of the local authority or of any committee or officer of the local\nauthority conferred by or under any law for the time being in force, issue such directions as he thinks\nfit to the officers or servants of the local authority, and if he finds it necessary or expedient so to do,\nemploy any outside agency.\n(3) All charges and expenses incurred by a local authority in complying with an order under\nsub-section (1) or by a person authorised under sub-section (2) shall, except to such extent, if any, as\nthe appropriate Government may direct to be paid out of its revenues, be paid out of the funds of the\nlocal authority."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers to appoint additional health staff",
      "content": "(1) The appropriate Government may, it if\nconsiders it necessary for any purpose of this Ordinance, appoint in any local area additional medical\nor public health establishment to perform such duties and exercise such functions as the appropriate\nGovernment may direct.\n(2) Such additional establishment shall, unless and to such extent as the appropriate\nGovernment otherwise directs, be under the control of the appropriate Government, but its salaries\nand allowances or any specified portion thereof shall, if the appropriate Government so orders, be\npaid out of the funds of the local authority."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power of superintendence",
      "content": "(1) The appropriate Government may, if it considers it\nnecessary for any purpose of this Ordinance, by order in writing assume the superintendence of all or\nany of the medical and public health services of any local authority.\n(2) Upon the assumption of superintendence under sub-section (1),—\n(a)     the appropriate Government may by order in writing specify the scale of the\nmedical or public health establishment concerned to be maintained by the\nlocal authority, the qualifications to be required for appointment to posts in\nsuch establishment, and the pay and other conditions of service of such\nestablishment;\n(b)     the powers of appointment, dismissal and punishment of, and grant of leave to,\nmembers of such establishment shall vest in such authority as the appropriate\nGovernment may appoint in this behalf;\n(c)     the appropriate Government may by order in writing specify the powers to be\nexercised by Health Officers employed under the local authority;\n(d)     the appropriate Government shall have power to inspect, superintend and\ncontrol the operations of the local authority in regard to any purpose of this\nOrdinance, and may by order in writing authorise persons to carry out such\ninspection, superintendence and control and define their powers and duties\nwhen so acting;\n(e)     the costs of and incidental to the services and establishments concerned shall\ncontinue to be paid out of the funds of the local authority."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to take over administration of services. The appropriate Government may, if it",
      "content": "considers it necessary for any purpose of this Ordinance, authorise by order in writing any person to\ntake over from any local authority the administration of all or any of its medical and public health\nservices or of any medical institution maintained by the local authority; and the person so authorised\nmay for the purposes of such administration exercise all the powers specified in sub-section (2) of\nsection 3 of a person authorised under that sub-section; and all charges and expenses incurred by the\nperson authorised under this section shall, except to such extent, if any, as the appropriate\nGovernment may direct to be paid out of its revenues, be paid out of the funds of the local authority."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Water supply",
      "content": "(1) A local authority may, with the previous sanction of the appropriate\nGovernment, supply water to any other local authority or to any other authority or person within or\nwithout its local area upon such terms as may be agreed, notwithstanding any provision prohibiting\nor restricting such supply contained in any other law.\n(2) The appropriate Government may by order in writing direct any local authority to supply\nwater to any area or to any authority or person within or without its local area at such places and in\nsuch quantities as may be specified in the order, subject to such payment being made therefore and to\nsuch other conditions as the appropriate Government may consider reasonable."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Power to give directions. For the purpose of carrying into effect any of the foregoing",
      "content": "provisions of this Ordinance or any order made thereunder, the appropriate Government may in\nwriting give to any local authority such directions as it thinks fit, and it shall be the duty of the local\nauthority to comply therewith."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Power to supersede local authorities",
      "content": "(1) If the appropriate Government is of opinion\nthat any local authority has failed to comply, or has delayed in complying, with any order or rule\nmade or direction given under this Ordinance or has failed to act in accordance with or give effect to\nany notification issued under section 10, the appropriate Government may by order in writing\nsupersede the local authority for such period as may be specified in the order.\n(2) When an order of supersession has been made under sub-section (1),—\n(a)     all the members of the local authority shall, as from the date of supersession,\nvacate their offices as such members;\n(b)     all the powers and duties which may by or under any law for the time being in\nforce be exercised or performed by or on behalf of the local authority shall,\nduring the period of supersession, be exercised and performed by such person\nas the appropriate Government may authorise in this behalf;\n(c)     all property vested in the local authority shall, during the period of\nsupersession, vest in the appropriate Government.\n(3) On the expiration of the period of supersession specified in the order under sub-section\n(1), the appropriate Government may by order in writing,—\n(a)     extend the period for such further term as it may consider necessary; or\n(b)     direct that the local authority shall be reconstituted in the manner provided for\nits constitution by or under the law relating thereto, and in such case any\npersons who vacated their offices under clause (a) of sub-section (2) shall not\nbe deemed to be disqualified thereby for election, appointment or nomination;\nor\n(c)     direct that the local authority shall be reconstituted by the persons who vacated\ntheir offices under clause (a) of sub-section (2) and shall recommence func-\ntioning as if it had not been superseded:\nProvided that the appropriate Government may at any time before the expiration of the period\nof supersession whether as originally specified under sub-section (1) or as extended under this\nsub-section, make an order under clause (b) or clause (c) of this sub-section."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Power to modify rules, bye",
      "content": "laws, etc. In relation to any local area the appropriate\nGovernment may by notification in the official Gazette make any rules, bye-laws, regulations or\norders connected with any purpose of this Ordinance which the local authority would under any law\nfor the time being in force be competent to make, and may in like manner amend or suspend the\noperation of any such rule, bye-law, regulation or order made by the local authority:\nProvided that, notwithstanding anything to the contrary in any other law, it shall not be\nnecessary when issuing any such notification to comply with the provisions of section 23 of the\nGeneral Clauses Act, 1897 (X of 1897) or the similar provisions of any local law or with any law\nproviding for any procedure preliminary to the making of any such rule, bye-law, regulation or order:\nProvided further that it shall be sufficient for the purpose of__\n(a)     cancelling any rule, bye-law, regulation or order made by the appropriate\nGovernment by notification under this section, or\n(b)     restoring to its form immediately prior to its amendment by notification under\nthis section any rule, bye-law, regulation or order so amended,\nto rescind the notification."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Power to make rules",
      "content": "(1) The appropriate Government may make rules for carrying\nout the purposes of this Ordinance, and in particular and without prejudice to the generality of the\nforegoing power, such rules may—\n(a)     prescribe any disease against the spread of which special precautions are\nconsidered by the appropriate Government to be necessary;\n(b)     prohibit any act which in the opinion of the appropriate Government is likely\nto lead to or facilitate the spread of any disease prescribed under clause (a);\n(c)     provide for the restraint, segregation and restriction of movement of persons\nsuffering or suspected to be suffering from any such disease;\n(d)     provide for the temporary transfer of members of the medical and public\nhealth establishments of any local authority to service in another local area\nunder the appropriate Government or another local authority.\n(2) In making rules under this section, the appropriate Government may provide that a breach\nof any of the rules shall be punishable with imprisonment which may extend to three months or with\nfine or with both."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Certain persons deemed to be public servants. All persons authorised under",
      "content": "sub-section (2) of section 3, clause (d) of sub-section (2) of section 5, section 6 or clause (b) of\nsub-section (2) of section 9 shall be deemed to be public servants within the meaning of the Pakistan\nPenal Code (XLV of 1860)."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Protection of action taken under this Ordinance. No suit, prosecution or other legal",
      "content": "proceeding shall lie against any person for anything in good faith done or intended to be done under\nthis Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "appropriate Government",
      "definition": "in relation to cantonment authorities and to port authorities in major ports, the 3[Federal Government], and in relation to all other local authorities, the Provincial Government;",
      "source_provision": "sec2"
    },
    {
      "term": "local area",
      "definition": "the area within which a local authority exercises its functions ;",
      "source_provision": "sec2"
    },
    {
      "term": "medical establishment",
      "definition": "establishment employed in connection with the provision of medical services;",
      "source_provision": "sec2"
    },
    {
      "term": "purpose of this Ordinance",
      "definition": "the purposes of ensuring the provision of adequate medical services, of preventing the spread of human disease, of safeguarding the public health and of providing or maintaining services essential to the health of the community. ___________________________________________________________________________ 1 Subs. by the Central Laws (Statute Reform) Ordinance No XX1 of 1960, s. 3 and 2nd Sch. (with effect from the 14th October, 1955). 2 Subs. by F.A.O., 1975, Art.2 and Table.",
      "source_provision": "sec2"
    }
  ]
}
