{
  "id": "pk-public-order-meetings-ordinance-1958",
  "type": "statute",
  "title": "Public Order (Meetings) Ordinance, 1958",
  "title_en": "Public Order (Meetings) Ordinance, 1958",
  "short_name": "POO",
  "status": "in_force",
  "issued_date": "1958-06-30",
  "in_force_date": "1958-06-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-a5aXYw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Public Order (Meetings) Ordinance, 1958 (IX of 1958) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Penalty",
      "content": "ORDINANCE NO. IX OF 1958\n[1st July, 1958]\nAn Ordinance to make provision for the preservation of public order on the occasion of public\nmeetings and to prevent disturbance thereat.\nWHEREAS it is expedient to make provision for the preservation of public order on the\noccasion of public meetings and to prevent disturbance thereat;\nAND WHEREAS the National Assemble is not in session and the President is satisfied that\ncircumstances exist which render immediate action necessary;\nNOW, THEREFORE, in exercise of the powers conferred by Article 69 of the Constitution\nand of all other powers enabling him in that behalf, the President is pleased to make and promulgate\nthe following Ordinance, namely:___"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_ (1) This Ordinance may be called the Public\nOrder (Meetings) Ordinance, 1958.\n(2) It extends to the 1[Karachi Division].\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_ In this Ordinance,___\n(a)        “meeting” means a meeting held for the purpose of the discussion of matters\nof public interest or for the purpose of the expression of views on such\nmatters;\n(b)        “public meeting” includes any meeting in a public place and any meeting\nwhich the public or any section thereof are permitted to attend, whether on\npayment or otherwise;\n(c)        “public place” means any highway, public park or garden, any sea beach, and\nany public bridge, road, lane, footway, square, court, alley or passage, whether\na thoroughfare or not; and includes any open space to which, for the time\nbeing, the public have or are permitted to have access, whether on payment or\notherwise;\n(d)       “public servant” has the same meaning as assigned to it in section 21 of the\nPakistan Penal Code (Act XLV of 1860).\n1\nSubs. by A.O., 1964, Art. 2 and Sch., for “Federal Territory of Karachi” which had been subs. by the Repealing and Amending Ordinance, 1961\nOrdinance No. I of 1961), s. 3 and 2nd Sch., for “Federal Capital”."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Disorderly conduct at public meeting",
      "content": "_(1) Any person who at a public meeting acts in a\ndisorderly manner for the purpose of preventing the transaction of the business for which the meeting\nwas called together shall be guilty of an offence.\n(2) Any person who incites others to commit an offence under this section shall be guilty of a\nlike offence."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Carrying of offensive weapons",
      "content": "_ Any person, not being a public servant acting in his\ncapacity as such, who, while present in a public meeting, has with him any offensive weapon shall be\nguilty of an offence."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Insulting language and incitement",
      "content": "_ Any person who in any public place or at any\npublic meeting uses threatening, abusive or insulting words or behaviour with intent to provoke a\nbreach of the peace or whereby a breach of the peace is likely to be occasioned shall be guilty of an\noffence under this Ordinance."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Offences to be cognizable and non",
      "content": "bailable.___ Notwithstanding anything in the Code of\nCriminal Procedure, 1898 (Act V of 1898), an offence under this Ordinance shall be cognizable and\nnon-bailable."
    }
  ],
  "definitions": [
    {
      "term": "meeting",
      "definition": "a meeting held for the purpose of the discussion of matters of public interest or for the purpose of the expression of views on such matters;",
      "source_provision": "sec2"
    },
    {
      "term": "public meeting",
      "definition": "any meeting in a public place and any meeting which the public or any section thereof are permitted to attend, whether on payment or otherwise;",
      "source_provision": "sec2"
    },
    {
      "term": "public place",
      "definition": "any highway, public park or garden, any sea beach, and any public bridge, road, lane, footway, square, court, alley or passage, whether a thoroughfare or not; and includes any open space to which, for the time being, the public have or are permitted to have access, whether on payment or otherwise;",
      "source_provision": "sec2"
    }
  ]
}
