{
  "id": "pk-public-order-political-uniforms-ordinance-1958",
  "type": "statute",
  "title": "Public Order (Political Uniforms) Ordinance, 1958",
  "title_en": "Public Order (Political Uniforms) Ordinance, 1958",
  "short_name": "POUO",
  "status": "in_force",
  "issued_date": "1958-09-18",
  "in_force_date": "1958-09-18",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-a5aXZA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Public Order (Political Uniforms) Ordinance, 1958 (XV of 1958) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Punishment",
      "content": "ORDINANCE NO. XV OF 1958\n[19th September, 1958]\nAn Ordinance to prohibit the wearing of uniforms in connection with political purposes and the\nmaintenance by private persons of associations of a military or semi-military character, and matters\nconnected therewith.\nWHEREAS it is expedient to prohibit the wearing of uniforms in connection with political\npurposes and the maintenance by private persons of associations of a military or semi-military\ncharacter, and matters connected therewith ;\nAND WHEREAS the National Assembly is not in session and the President is satisfied that\ncircumstances exist which render immediate action necessary ;\nNOW, THEREFORE, in exercise of the powers conferred by Article 69 of the Constitution\nand of all other powers enabling him in that behalf, the President is pleased to make and promulgate\nthe following Ordinance, namely :___"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Ordinance may be called the Public\nOrder (Political Uniforms) Ordinance, 1958.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Interpretation",
      "content": "_In this Ordinance, unless there is anything repugnant in the subject or\ncontext,___\n“ Meeting ” means a meeting held for the purpose of the discussion of matters of public\ninterest or for the purpose of the expression of views on such matters ;\n“ Private premises ” means premises to which the public have access (whether on payment or\notherwise) only by permission of the owner, occupier, or lessee of the premises ;\n“ Public meeting ” includes any meeting in a public place and any meeting which the public\nor any section thereof are permitted to attend, whether on payment or otherwise."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Prohibition of uniforms in connection with political objects",
      "content": "_Subject as hereinafter\nprovided, any person who in any public place or at any public meeting marches or parades in military\norder or wears uniform signifying his association with any political organization or with the\npromotion of any political object shall be guilty of an offence :\nProvided that if the District Magistrate is satisfied that the wearing of any such uniform as\naforesaid on any ceremonial, anniversary, or other special occasion will not be likely to involve risk\nof public disorder, he may, with the previous consent of the 1[Provincial Government], by written\norder permit the wearing of such uniform on that occasion either absolutely or subject to such\nconditions as may be specified in the order.\n1\nSubs. by the Central Adaptation of Laws Order, 1964 (President’s Order No. 1 of 1964), Art. 2 and Schedule."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Prohibition of quasi",
      "content": "military organisations.—(1) If the members of adherents of any\nassociation of persons, whether incorporated or not, are___\n(a)    organised or trained or equipped for the purpose of enabling them to be\nemployed in usurping the functions of the police or of the armed forces of\nPakistan ; or\n(b)    organised and trained or organised and equipped either for the purpose of\nenabling them to be employed for the use or display of physical force in\npromoting any political object, or in such manner as to arouse reasonable\napprehension that they are organised and either trained or equipped for that\npurpose ;\nthen any person who takes part in the control and management of the association, or in so\norganising or training as aforesaid any members or adherents thereof, shall be guilty of an offence\nunder this section :\nProvided that in any proceedings against a person charged with the offence of taking part in\nthe control or management of such an association as aforesaid it shall be a defence to that charge to\nprove that he neither consented to nor connived at the organisation, training or equipment of\nmembers or adherents of the association in contravention of the provisions of this section.\n(2) In any criminal proceedings under this section proof of things done or of words written,\nspoken or published (whether or not in the presence of any party to the proceedings) by any person\ntaking part in the control or management of an association or in organising, training or equipping\nmembers or adherents of an association shall be admissible as evidence of the purposes for which, or\nthe manner in which, members or adherents of the association (whether those persons or others) were\norganised, or trained, or equipped.\n(3) Nothing in this section shall prohibit employment of a reasonable number of persons as\nstewards without any distinctive uniforms to assist in the preservation of order at any public meeting\nheld upon private premises, or the making of arrangements for that purpose or the instruction of the\npersons to be so employed in their lawful duties as such stewards, or their being furnished with\nbadges or other distinguishing signs."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Offences to be cognizable and non",
      "content": "bailable.___Offences under this Ordinance shall be\ncognizable and non-bailable."
    }
  ],
  "definitions": []
}
