{
  "id": "pk-public-private-partnership-authority-act-2017",
  "type": "statute",
  "title": "Public Private Partnership Authority Act, 2017.",
  "title_en": "Public Private Partnership Authority Act, 2017.",
  "short_name": "PPPAA",
  "status": "in_force",
  "issued_date": "2017-03-28",
  "in_force_date": "2017-03-28",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NpapZn-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Public Private Partnership Authority Act, 2017. (VIII of 2017) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, application and commencement",
      "content": "(1) This Act may be called the\nPublic Private Partnership Authority Act, 2017.\n(2)        It extends to the whole of Pakistan.\n(3)        It shall come into force at once.\n3\n[*      *         *          *          *          *          *]\n4\n[2. Definitions. — In this Act, unless there is anything repugnant in the subject or context,\n—\n(a)        “Authority” o r “ P3A” means the Public Private Partnership Authority established\nunder section 3;\n(b)        “Board” means the Board constituted in accordance with section 6;\n(c)        “CDWP” means the central development working party.\n(d)        “company” or “IPDF” means Infrastructure Project Development Facility a\ncorporate entity registered and operating under the provisions of the Companies\nAct, 2017 (XIX of 2017);\n1\nSubs. by Act VI of 2021, s. 2.\n2\nSubs. by Act No. XVIII of 2022, s.2. which was previously Subs. by Act VI of 2021 s.2.\n3\nOmitted Sub-sec (4) by Act No. XVIII of 2022, s.3.\n4\nSubs. by Act VI of 2021, s. 3.\n(e)          “dispute” means any monetary claim or contractual dispute between a private\nparty and an implementing agency under a public private partnership agreement;\n(f)          “ECNEC” means the executive committee of the National Economic Council;\n(g)          “implementing agency” means any of the line ministries, attached departments,\nbody corporate, autonomous body of the Federal Government or any\norganization or corporation owned or controlled by the Federal Government;\n(h)          “lender” means a financial institution that provides loan to a private party for\nimplementation of a project;\n(i)          “P3A fund” means the fund established under section 10;\n(j)          “P3WP” means the public private partnership working party established under\nsection 13A;\n(k)          “person” includes an individual, a company, a statutory body corporate, an\nassociation of persons whether incorporated or not, a trust and a partnership;\n(l)          “prescribed” means prescribed by rules or regulations made under this Act;\n(m)          “private party” means a person who is eligible to bid for a project with an\nimplementing agency in accordance with the rules and regulations prescribed\nunder this Act;\n(n)          “project” means a development project, provision of related services or both,\nunder a public private partnership arrangement;\n(o)          “project qualification 1[proposal]”, in each case, in the form and in the manner\nand meeting such requirements as are prescribed from time to time, means —\n(i)         a proposal received by the Authority from an implementing agency for a\nqualified project;\n(ii)        a proposal received by the Authority from an implementing agency for a\nqualified project that is prepared and submitted on the basis of a proposal\nfrom a private party for a project on an unsolicited basis; or\n(iii)       a proposal forwarded to the Authority from CDWP for a qualified project;\n(p)          “project concept proposal”, in each case, in the form and in the manner and\nmeeting such requirements as are prescribed from time to time, means a\nconceptual proposal—\n(i)       received by the Authority from an implementing agency for a qualified\nproject;\n1\nSubs. by Act No. XVIII of 2022, s. 4.\n(ii)    received by the Authority from a private party for a qualified project on an\nunsolicited basis; or\n(iii)   forwarded to the Authority from CDWP for a qualified project;\n(q)   “project development facility” means the facility established under section 12;\n(r)   “project proposal” shall mean the detailed proposal submitted by the\nimplementing agency to the Authority after it has received approval of the project\nqualification proposal prepared in respect of a qualified project, to be submitted in\nthe form and in the manner and meeting such requirements as are prescribed from\ntime to time;\n(s)   “project support” means the financial or non-financial support for the project that\nmay include the following, namely: —\n(i)     administrative support to the private party consistent with the private\nparty’s responsibilities under the public private partnership agreement and\napplicable laws for obtaining licenses and clearances from the\ngovernment, a public sector organization or an implementing agency, for\nthe purposes of the project on such terms and conditions as may be\nprescribed; provision of utility connections for power, gas and water at the\nproject site, acquisition of land or rights of way necessary for the project\nand rehabilitation and resettlement of displaced persons directly required\nto execute the project, environmental impact assessment, safeguards and\napprovals and any other local permitting and approvals;\n(ii)    asset-based support such as leasing, licensing or grant of right to\nmortgage and use land / or infrastructure facilities owned by the\ngovernment or on implementing agency to the private party;\n(iii)    financial assistance through the viability gap fund;\n(iv)     sovereign guarantees for political or other risks; and\n(v)     any other support prescribed in respect of a qualified project:\nProvided that any funding or financial support provided through the\nproject development facility shall not form part of project support;\n(t)   “public private partnership” means a commercial transaction between an\nimplementing agency and a private party in terms of which the private party—\n(i)     performs part of an implementing agency’s functions on behalf of it;\n(ii)    assumes the responsible use of public property for a project;\n(iii)   assumes substantial financial, technical and operational risks in\nconnection with performance of certain functions of the implementing\nagency or the responsible use of public property; or\n(iv)    receives a benefit for performing the implementing agency’s functions or\nfrom utilizing the public property, either by way of —\n(a)    consideration to be paid by the implementing agency from its\nbudget or revenue; or\n(b)    charges or fees to be collected by the private party from users or\ncustomers of a service provided to them; or\n(c)    a combination of such consideration and such charges or fees.\n(u)    “public private partnership agreement” means a written agreement between an\nimplementing agency and a private party for implementation of a project and any\nother agreement subsidiary or incidental to it;\n(v)   “qualified project” means a project undertaken on public private partnership basis\nthat meets any of the following criteria, namely: —\n(i)     support is required for the project in the form of funding from any\nfacility established by the government for the purpose, including the\nviability gap fund;\n(ii)    a sovereign guarantee is required for the project in accordance with any\nrules or regulations that may be prescribed under this Act;\n(iii)   project receives funding through the project development facility;\n(iv)    any additional criteria for qualifying projects, as prescribed from time to\ntime:\nProvided that a project not fulfilling the aforementioned criteria may be\ndeemed as a qualified project if so designated by the P3WP for reasons to\nbe recorded in writing;\n(w)    “request for proposal” means a publicly advertised tender, inviting proposals for\na qualified project prepared in accordance with the provisions of this Act and the\nrules and regulations made thereunder;\n(x)    “risk management unit” means the unit established under section 12A;\n(y)    “users” means users of a project, whether upon payment of charges, fee or\notherwise; and\n(z)    “ viability gap fund” means the fund established under section 11.]\n1\n[CHAPTER II\nInstitutional Framework\nAuthority and its Board]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Authority",
      "content": "(1) As soon as it deems appropriate after the\ncommencement of this Act, the Federal Government shall establish 1[the] Public Private Partnership\nAuthority for carrying out the purposes and objectives of this Act.\n(2) The Authority shall be an independent body corporate having perpetual succession and\ncommon seal, subject to the provisions of this Act, to acquire and hold property, both moveable and\nimmovable, and shall by its name and sue and be sued.\n(3) The headquarters of the Authority shall be at Islamabad and it may establish its offices at\nsuch other place or places as it may consider appropriate.\n(4) Notwithstanding anything contained in the Companies 1[Act, 2017 (XIX of 2017)] and any\nother law for the time being in force, on the date of commencement of this Act, the Company shall\ncease to exist and —\n(a)         all assets, rights, powers, authorities and privileges and all property, movable\nand immovable, cash and bank balance, reserve funds, investments and all other\ninterest and rights in, or arising out of, such property and all debts, liabilities and\nobligations of whatever kind of the Company subsisting immediately before the\ncommencement of this Act, shall stand transferred to and vest in the Authority;\n(b)         all contract entered into or rights acquired and all matters and things engaged\nto be done by, with or for the Company before the commencement of\nthis Act shall be deemed to have been incurred, entered into, acquired or engaged\nto be done by, with or for the Authority, as the case may be;\n(c)         all suits and other legal proceedings instituted by or against the Company\nbefore the commencement of this Act shall be deemed to be suits and proceedings\nby or against the Authority as the case may be and may proceed and be dealt with\naccordingly; and\n(d)         all employees of the Company shall be deemed to be employees of the Authority\non not less favorable than the existing terms and conditions of the service, rights\nand privileges and other matters as were applicable to them before the conversion."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Functions and powers of the Authority",
      "content": "(1) Subject to the provisions of this Act,\nthe Authority may take such measures and exercise such powers as may be necessary for promoting\nand 1[facilitating] realization of the concept and methods of public private partnership.\n1\nSubs. & Ins. by Act VI of 2021, ss. 4, 5 & 6.\n(2) Without prejudice to the generality of the powers conferred by sub- section (1), the\nAuthority may—\n1\n[(a) provide advisory services in the manner prescribed, either directly or by engaging\nsuch international or local consultants as may be deemed appropriate, to\nimplementing agencies, provincial or other governments within Pakistan and\nentities owned or controlled by such governments, or to such other entities as may\nbe determined by the Board, and may charge fees for the provision of the aforesaid\nservices;]\n2\n[(b)   ensure value for money by conducting an analysis to evaluate qualified projects in\nthe manner prescribed;\n(c)        conduct appraisal and project risk analysis for qualified projects, including\nwith respect to legal risk and receive and take into consideration the overall fiscal\nrisk assessment and view submitted by the risk management unit for qualified\nprojects;\n(d)        assess funding requirements, excluding the project development facility, taking\ninto account such assessment undertaken by the risk management unit;\n(e)        assess funding                requirements    with   respect   to   the   project development\nfacility;\n1\n[(f)      subject to any rules or regulations made hereunder, advise, facilitate and support,\nas needed, implementing agencies to develop and structure qualified projects;]\n(g)         prescribe and receive fees and charges;\n(h)        standardize contractual provisions and develop sector specific provisions and\ntemplates including a model public private partnership agreement for projects;\n3\n[*     *         *      *            *     *        *]\n3\n[*     *         *      *            *     *        *]\n(k)        interact, collaborate and liaise with international agencies.]"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Appointment of officers and staff of the Authority",
      "content": "(1) The Authority may appoint\nsuch officers, experts, advisers, consultants and members of staff as it may consider necessary for\nthe efficient performance of its functions in the 1[manner and on such terms and conditions as the\nBoard may prescribe by regulations].\n(2) The officers, members of staff, advisers, consultants and experts and other persons\nappointed by the Authority shall not be civil servants within the meaning of the Civil Servants Act,\n1973 (LXXI of 1973).\n1\nSubs. by Act No. XVIII of 2022, ss.5 & 6.\n2\nSubs. by Act No. VI of 2021, s. 6.\n3\nOmitted ibid.\n(3) The officers, advisers, consultants, employees and staff of the Authority when acting or\npurporting to act under any of the provisions of this Act or rules made there under shall be deemed\nto be public servants within the meaning of section 21 of the Pakistan Penal Code (Act XLV of\n1860)."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Board of the Authority",
      "content": "1[(1) There shall be a Board of Directors of the Authority\ncomprising the following, namely: —"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Chief Executive Officer of the Authority Member/Cum",
      "content": "Secretary\n(2) The Chief Executive Officer shall also act as Secretary of the Board 1[or an officer of\nthe Authority authorized in this behalf by the Authority].\n(3) The members from the private sector shall be appointed by the Federal Government for\na period of three years 1[subject] to such terms and conditions as 1[may be prescribed].\n1\n[(4)The Board shall meet at least once in a-quarter in a meeting convened by the\nChairperson, provided that the Chairperson may convene a meeting at any time as deemed\nnecessary. The Secretary of the Board may, in accordance with the prescribed regulation, take\napproval of the Board through circulation among members of the Board, which shall be\nsubsequently placed for ratification in the first Board’s meeting occurring immediately after such\napproval.]\n(5) The meetings of the Board shall be presided over by the Chairperson and in his absence\nby the vice-Chairperson.\n1\nSubs. & ins. by Act VI of 2021.s. 7.\n1\n[(6) The quorum for a meeting of the Board shall be five members with at least two\nmembers from the private sector and the member from the Finance Division and the decisions of the\nBoard shall be made with the majority of members of the Board present. In case of a tie, the\nChairperson or Vice-Chairperson, as the case may be, shall have a casting vote.]\n(7) The Board may co-opt such members, as it deems appropriate, for rendering advice on\ncase-to-case basis. 1[In respect of a Board meeting where a project proposal or matters relating to a\nqualified project are being considered by the Board, the Secretary of the concerned line ministry (or\nsuch nominee of the same that meets any prescribed requirements) shall be required to be present in\nsuch Board meeting as an observer to perform such roles and functions as are prescribed.]\n(8)The Board may, for carrying out its functions, constitute such committees, from time to\ntime, as may be considered appropriate and delegate its powers as 1[may be prescribed.]"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Functions and powers of the Board",
      "content": "(1) The general directions and\nsuperintendence of the Authority and its affairs shall vest in the Board which may exercise all\npowers, perform all functions and do all acts which may be exercised, performed or done by the\nAuthority.\n(2) Without prejudice to the generality of powers given in sub-section (1), the Board\nshall perform, inter-alia 1[***] the following 1[functions], namely:—\n1 3\n[ [(a) formulating the investment policy, establishing standards and procedures for\ninvestment of any amounts from the P3A Fund, the viability gap fund and the\nproject development facility, including investment in bonds or other financial\ninstruments issued by the Federal Government;]\n(b)     Allowing renegotiation, if necessary in respect of qualified projects, of public\nprivate partnership agreements or contracts to the extent prescribed;\n3\n[(c)   considering the project proposal for a qualified project for purposes of according\nits approval or otherwise with respect to the transaction structure of the project;]\n1\nSubs., added, ins and omitted by Act VI of 2021, ss.7 & 8.\n2\nSubs. by Act No. XVIII of 2022, s.7. (The word “Ward” amended by the Act VI of 2021, s. 8, but in the original text of sub-sect. (2) such\nword is not found.)\n3\nSubs. by Act No. XVIII of 2022, s.8, which was previously Subs. by Act VI of 2021 s.9.\n(d)        Reviewing and strengthening the institutional and regulatory framework for the\neffective implementation and operation of the public private partnership\narrangements by implementing agencies;\n(e)        Approving the yearly budget of the Authority;\n(f)       Establishing viability gap fund to perform such functions as may be prescribed;\n(g)        Establishing project development facility to perform such functions as are\nprescribed;\n(h)        Approving funding for support provided through the project development facility\nfor qualified projects in the manner prescribed; and\n(i)        subject to applicable laws, and as may be prescribed, establishing such other\nfunds, trusts, schemes, companies or facilities for the purpose of carrying out the\nmandate under this Act.]\n1\n[9. Disqualification to become a member and conflict.— (1) The disqualifications of\ncertain persons to become or hold office in any corporate entity under the provisions of the\nCompanies Act, 2017 (XIX of 2017) shall, ipso facto, apply to the members of the Board. In\naddition, a person shall be disqualified from acting as a member of the Board, if he—\n(a)        has become physically or mentally incapable of acting as a member of the Board;\n(b)        has engaged in gross misconduct;\n(c)        has been involved in corruption or malpractices;\n(d)        receives any illegal gratification from a private party; or\n(e)        fails to meet any other criteria as may be prescribed.\n(2) To the extent that any member of the Board has any interest, either monetary or otherwise,\ndirectly or indirectly, in any private party that is tendering for a project or that is involved in the\nprocess in any way for a qualified project, such member of the Board shall, to the extent of that\nproject, not be eligible to participate in the following, namely: —\n(a)        any decision making of the Board;\n(b)        in any discussions of the Authority or the Board; or\n(c)        other relevant matters of the Authority, the Board and the relevant implementing\nagency."
    },
    {
      "provision_ref": "sec9a",
      "section": "9A",
      "title": "Section 9A. Accounts and audit",
      "content": "(1) The Authority shall prepare its own budget in respect of\neach financial year and shall maintain complete and accurate books of accounts of its actual\nexpenses in the prescribed manner.\n1\nSubs. by the Act No. VI of 2021, s. 10\n(2) The management, operation and maintenance of the accounts of the Authority shall be\ndone by such officers of the Authority and in such manner as may be prescribed. The accounts of the\nAuthority shall be maintained in such forms as may be prescribed and shall be consistent with the\nrequirements of the applicable provisions of the Constitution and laws for the time being in force.\n(3) The accounts of the Authority shall be audited in the manner prescribed in accordance\nwith the provisions of the (constitution and the laws in that behalf for the time being in force.\nPart II\nP3A Fund, Viability Gap Fund and Project Development Facility]"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. 1[P3A F u n d ]",
      "content": "(1) There i s hereby established a 1[non-lapsable] fund 1[through\nupfront grant-in-aid in the amount to be recommended by the Board], to be called the 1[P3A Fund]\nwhich shall vest in the Authority and shall be utilized by the Authority 1[****] in connection with its\nfunctions under this Act.\n(2) The 1[P3A fund] shall comprise of the following, namely:—\n(a)        such sum as the Federal Government may, from time to time, allocate to it in the\nannual budget;\n(b)       1[grants-in-aid] from the Federal Government;\n(c)       donations and grants from the international donor agencies;\n(d)       income from 1[*] investment;\n(e)       fees; and\n(f)       any 1[other] sources 1[as may be prescribed from time to time].\n(3) The management, operation and maintenance of the 1[P3A Fund] shall be done\nby 1[such officers of the Authority and in such manner as may be prescribed].\n(4) 1[*                  *                     *                    *       *       *          *]\n1[11.Viability gap fund.— (1) There shall be established a non-lapsable fund through\nupfront grant-in-aid vested in the Authority known as the “viability gap fund” which shall be\nmanaged, controlled and administered by the Authority in the prescribed manner.\n(2) The viability gap fund shall be established by an amount specified by the Board and the\nfund may be replenished from time to time in the prescribed manner.\n(3) The viability gap fund shall be utilized, inter alia, to provide support to those qualified\nprojects for which a feasibility study has found them to be economically or socially justified but not\nfinancially viable.]\n1\nSubs., ins. & Omitted by Act VI of 2021, ss. 11 & 12.\n1[12. Project development facility.—(1) There shall be established a non-lapsable facility\nthrough upfront grant-in-aid vested in the Authority known as the “project development facility”\nwhich shall be managed, controlled and administered by the Authority in the prescribed manner.\n(2) The project development facility shall be a pool of funds, including contributions from\ninternational donor agencies, which shall be utilized, inter alia, to support the preparation of any\nproposals for qualified projects.\n(3) The project development fund shall be established by an amount specified by the Board\nand the fund may be replenished from time to time in the prescribed manner.]\n1[CHAPTER III\nPart I\nRisk Management Unit"
    },
    {
      "provision_ref": "sec12a",
      "section": "12A",
      "title": "Section 12A. Risk management Unit",
      "content": "(1) There shall be established a risk management unit which\nshall be managed, controlled and administered by the Finance Division of the Federal Government\n2\n[***].\n(2) The risk management unit shall be responsible for fiscal oversight and for evaluation of\nfiscal and contingent liability exposure for all qualified projects. The evaluation shall be required to\nbe undertaken as may be determined by Finance Division in consultation with the Authority.\n(3) In respect of any project that is not a qualified project, each implementing agency shall\nprovide the risk management unit all such information about such project as may be prescribed by\nthe Authority in consultation with the Finance Division.\n“PART II\nImplementing Agencies]\n1"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. [Responsibility] of an implementing agency",
      "content": "(1) The responsibilities of the\n1[implementing agency]    in relation to the planning, development, procurement, implementation,\nexecution and monitoring of a 1[qualified project] shall be such as may be prescribed 1[by rules or\nregulations under this Act].\n1\n[(2) Without prejudice to the generality of sub-section (1) in respect of qualified projects,\nthe implementing agency shall, inter alia, for the purpose of this Act,—\n(a)        identify, conceptualize and develop the project and, in case of a project that is\nnot a qualified project, appraise the same;\n(b)        undertake or cause to be undertaken a feasibility study for a project;\n(c)        develop and issue or cause to be developed and issued a request for proposal\nincluding draft of the public private partnership agreement;\n1\nSubs. & Ins. by Act VI of 2021, ss.13-15.\n2\nOmitted by Act XVIII of 2022, s.9.\n(d)       if deemed necessary or appropriate by the implementing agency, develop and\nsubmit to the Authority a project concept proposal for the P3WP’s approval or\notherwise, prior to developing and submitting the project qualification proposal for\napproval to the Authority, provided, that it shall not be a requirement to submit a\nproject concept proposal before submitting the project qualification proposal for\napproval to the Authority;\n(e)       solicit approval for a project and its related project qualification proposal from\nP3WP, in the manner prescribed and, subsequent to receipt of approval, undertake\nregulations made thereunder;\n(f)       subject to requisite approvals, procure and conduct competitive bidding for a\nproject in accordance with the provisions of this Act and the rules and regulations\nmade hereunder;\n(g)       monitor and implement the project in accordance with the public private\npartnership agreement; and\n(h)       provide such information to the authority as may be prescribed from time to\ntime in respect of projects of the implementing agency, whether qualified or not\nqualified.]\n(3) 1[*             *                   *                   *       *          *               *]\n(4) 1[*             *                   *                   *       *          *               *]\nPUBLIC PRIVATE PARTNERSHIP (P3) WORKING PARTY (P3WP)"
    },
    {
      "provision_ref": "sec13a",
      "section": "13A",
      "title": "Section 13A. P3WP",
      "content": "(1) There shall be established a ‘Public Private Partnership Working Party’ to\nbe called the “P3WP” comprising such members as may be prescribed by rules under this Act.\n(2) The quorum requirements, manner of conduct of the P3WP meetings and the eligibility\nrequirements to be a member of the P3WP shall be, in each case, as are prescribed from time to\ntime.\n(3) The P3WP shall be responsible for—\n(a)       granting approval of the project concept proposal submitted to it by the\nAuthority;\n1\n[(b) considering the project qualification proposal for a qualified project for\npurposes of according its approval or otherwise with respect to the\ntransaction structure of the project;]\n(c)       performing such other functions as may be prescribed from time to time.\n1\nOmitted & Subs. by Act XVIII of 2022, s.10 & 11.\n(4) Subject to the rules and regulations prescribed under this Act, the P3WP may, for\ncarrying out its functions, constitute such committees, from time to time and delegate its powers, as\nmay be considered appropriate.\nApprovals and Process Flow For Qualified Projects]\n1\n[14. Approval of qualified projects and related matters.—(1) For all qualified\nprojects, subject to the rules and regulations made under this Act, the following approvals shall be\nrequired prior to the execution of the public private partnership agreement by the implementing\nagency, namely: —\n(a)     the project qualification proposal shall require approval of the P3WP;\n2\n[(b)    the project shall require approval of the CDWP;]\n(c)     the project proposal shall require approval of the Board;\n(d)     in the event the qualified project meets certain prescribed criteria, the project\nproposal shall also require approval of ECNEC; and\n(e)     any other approvals as may be prescribed from time to time 2[:]\n2\n[Provided that the evaluation by the risk management unit pursuant to sub-section (2) of\nsection 12A shall be provided as part of the approvals process in the manner prescribed.]\n2\n[(1A) For the avoidance of doubt , where, prior to the commencement of the Public Private\nPartnership Authority (Amendment) Act, 2022, any approvals had been granted with respect to any\nproject qualification proposals and project proposals, such approvals shall continue to be in force\nunless amended withdrawn or rescinded by an authority competent to do so under this Act.]\n(2) During any stage of the process leading to the execution of the public private\npartnership agreement, in the event there is a deviation from any of the terms of the proposals or\ndocuments approved in terms of sub-section (1) or from any conditions that the approving entity\nmay have placed in respect of the qualified project, the implementing agency shall be required to re-\nobtain such approvals as may be prescribed.\n(3) The process flow for approvals, bidding and contract award shall be as may be\nprescribed from time to time,]\n2\n[(4) Notwithstanding anything contained in this Act, where prior to the commencement of\napproved a project or proposal with regard to a project, any subsequent process with respect to the\napproval of such project or proposal thereof shall continue to be dealt with as if the Public Private\nPartnership Authority (Amendment) Act, 2021 (VI of 2021) was not in force.]\n1\n[CHAPTER V\nLegal and Contractual Framework"
    },
    {
      "provision_ref": "sec14a",
      "section": "14A",
      "title": "Section 14A. Private sector participation",
      "content": "(1) Notwithstanding anything to the contrary contained\nin any other laws for the time being in force, the implementing agencies shall be authorized to seek\nparticipation from the private sector in appropriate projects in accordance with this Act.\n1\nSubs. by Act VI of 2021, ss. 16 & 17.\n2\nSubs., Added & Ins. by Act No. XVIII of 2022, s.12.\n(2) Subject to the provisions of this Act and the rules and regulations made thereunder, the\nimplementing agencies shall be fully empowered to enter into public private partnership agreements\nand arrangements with private parties under mutually agreed terms and conditions in one or several\nprojects and may provide project support to private parties on such conditions as deemed mutually fit\nfor the purposes of such projects.\n(3) The implementing agencies shall be competent to pay any fees for services performed\nby private parties under duly authorized public private partnership agreements.\n(4) A private party may submit a proposal for a project on an unsolicited basis to the\nAuthority or an implementing agency in the manner meeting such requirements as prescribed,\nwhich shall be subject to the procurement procedures prescribed from time to time.]"
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Contents of public private partnership agreements",
      "content": "(l) The contents of a public\nprivate partnership agreement 1[relating to projects] shall be such as may be prescribed.\n1\n[(2) Unless otherwise provided in the public private partnership agreement, every\nagreement shall be governed, construed and interpreted in accordance with the laws of\nPakistan.]\n(3) 1[*                    *                   *                 *       *   *     *]"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Contractual relationship",
      "content": "(l) For the purposes of implementation of the\n1\n[qualified] project,1[unless otherwise approved by the Board,] the private party shall, with or\nwithout the participation of the implementing agency, incorporate a company as 1[a] special purpose\nvehicle to undertake the 1[qualified] project 1[in accordance with the rules and regulations\nprescribed under this Act].\n(2) Without prejudice to the generality of the foregoing provision and subject to the decision\nof the Board, the implementing agency and private party may enter into any contractual relationship\nthat is capable of providing value for money and affordability for the implementing agency and the\nusers of the 1[qualified project].\n1\n[(3) Subject to laws applicable to the implementing agency, the implementing agency and a\nprivate party may, in respect of projects that are not qualified projects, enter into any contractual\nrelationship that is capable of providing value for money and affordability for the implementing\nagency and the users of the project.]"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Protection of interests",
      "content": "Notwithstanding anything contained in any other law for the\ntime being in force and subject to compliance with the provisions of this Act and the rules 1[and\nregulations] made there under, 1[the] implementing agency may, in respect of a project to which this\nAct applies, —\n(a)        transfer an interest, or part of an interest, of the implementing agency in any\npresent or future assets comprised in the project to the private party:\nProvided that title of 1[any] immovable property of an implementing\nagency shall not be transferred to the private party;\n1\nSubs., Omitted, Ins. & Added by Act VI of 2021, ss.18-20.\n(b)        transfer to the private party the right to receive directly revenues or receivables of\nthe project during the subsistence of public private partnership agreement 1[and\nas provided in the said agreement];\n(c)        permit the private party to create security interests over or in respect of the\npresent or future assets created by it, revenues, or receivables, comprised in or\nexpected, in connection with the 1[project] in favour of any lender providing\nloans for the project 1[as provided in the public private partnership agreement];\n1\n[and]\n(d)        enter into agreements with lenders to the project 2[in accordance with applicable\nlaw]1[.]1[*]\n1\n(e)            [*           *                     *                     *               *   *   *]\n1\n[18. Settlement of disputes.—(1) All disputes arising between an implementing agency and\na private party shall be decided in accordance with the terms and conditions of the public private\npartnership agreement:\nProvided that the Federal Government may, subject to such conditions as it may deem\nappropriate to prescribe, including with respect to any time limit, require that the private party\nsubmit its claim before the relevant domestic courts or administrative bodies in order to exhaust\ndomestic remedies before seeking recourse to international arbitration:\nProvided further that the aforesaid requirement shall be applicable only to public\nprivate partnership agreements executed after the Federal Government has prescribed the\nrequirement.\n(2) Dispute may also be referred to the Authority to facilitate their resolution and settlement\nby mediation. Recourse to such mediation be governed by prescribed rules or regulations.\n(3) Neither the private or its agents, its contractor or sub-contractors, shall stop, impede,\nsuspend, either in whole or in part, or cause the suspension of or otherwise delay the provision of,\nthe service to the users on account of pendency of any dispute under public private partnership\nagreement.]\n1\n[CHAPTER VI]\nPublic Private Partnership Project Procurement\n3\n[19. Negotiation of the agreement.—The implementing agency shall, after obtaining\napplicable approvals and subject to terms and conditions of such approvals, invite the successful\nprivate party bidder for negotiation of the public private partnership agreement.]\n1\n[20. Negotiated procurement of project.—Subject to the rules and regulations prescribed\nunder this Act, an implementing agency may enter into a negotiated procurement of a project in case\nthe Federal Government authorizes such an exception, for reasons to be recorded in writing, in the\npublic interest.]\n1\nIns., Subs. and Omitted by Act VI of 2021, ss. 20-23.\n2\nSubs. by Act No. XVIII of 2022, s. 13 which was previously Ins. by Act VI of 2021 s.20.\n3\nSubs. by Act No. XVIII of 2022, s. 14 which was previously Subs. by Act VI of 2021 s.22."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Vesting of project",
      "content": "(1) Subject to the public private partnership agreement, the project\nalong with all the movable and immovable properties 1[the], project’s physical assets, licenses,\ngoodwill, trademarks, patents, leases, all rights including intellectual property rights and interests\nassociated with the project shall vest in the private party 1[or the implementing agency] during the\ntenure of the public private partnership agreement 1[as provided for in the said agreement]:\nProvided 1[*] that 1[in respect of a qualified project] the private party shall not create any\nlien, charge or encumbrance, in favor of the lenders, over the immovable properties of the\nimplementing agency as collateral, except with the prior 1[consent and] approval of the\n1\n[implementing agency and the] Board 1[or except as may have been approved as part of the\nproject proposal]:\nProvided further that after 1[the] expiry of the public private partnership agreement all the\nproperties as aforesaid shall stand transferred, without any lien, charge or encumbrance, to the\nimplementing agency 1[or the private party] in accordance with the provisions of the public private\npartnership agreement.\n(2) 1[*                   *                    *                     *                     *    *   *]\n1\n[CHAPTER VII]\nMiscellaneous Provisions"
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. No compensation for risks not covered",
      "content": "The Federal Government 1[the Authority, the\nBoard] or the implementing agency shall not be held liable for any claim of the private party for a\nrisk, which is not specified in the public private partnership agreement."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Compensation and recovery of costs, dues and fees",
      "content": "Notwithstanding anything\ncontained in public private partnership agreement or in any other law for the time being in force, the\nFederal Government or the implementing agency may recover 1 [any sums] due from a private party\n1\n[******] as arrears of land revenue under the provisions of the West Pakistan Land Revenue Act,\n1967 (W. P. Act No. XVII of 1967)."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Transparency and public disclosure",
      "content": "The public private partnership agreement shall\nbe a public document. Any interested person shall be entitled to obtain a copy of it in accordance with\nthe applicable laws.\n1\n[25. Power to make rules.—The Federal Government may, by notification in the Gazette\nand with the recommendation of the Board, make rules for carrying out the purposes of, this Act.\n2\n[25A. Power to make regulations.—The Board may, by notification in the official\nGazette, make regulations for carrying out purposes of this Act which shall not be inconsistent\nwith the provisions of this Act and, if prescribed, any rules made thereunder.]]"
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Indemnity",
      "content": "Without prejudice to the obligations incurred by an implementing agency\nunder a public private partnership agreement, no 1[suits], prosecution or other legal proceedings\nshall lie against the Federal Government, the Board, the Authority or any of its officers acting\nfor and on its behalf in furtherance of the functions of the Authority or Board, as the case may be,\nwhich is in good faith done or 1[*] to be done under this Act or rules 1[or regulations] made\nthereunder.\n1\nIns., Omitted and subs. by Act VI of 2021, ss. 24-28.\n2\nSubs. by Act No. XVIII of 2022, s. 15, which was previously Subs. by Act VI of 2021 s.27."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Removal of difficulties",
      "content": "If any difficulty arises in giving effect to any provision of this\nAct, the Federal Government may, by notification in the official Gazette, make such provisions as may\nappear to it to be necessary for the purpose of removing such difficulty."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Annual Report",
      "content": "Within one hundred and twenty days from the end of each financial\nyear, the Authority shall cause a report to be prepared on its activities including public private\npartnership agreements 1[for qualified projects], progress on 1[qualified] projects, utilization of\nfunds under this Act during that financial year and shall be laid before the Parliament.\n1\n[29. Overriding effect.—Except as provided in this Act, the provisions of this Act and the\nrules and regulations made hereunder shall have effect 2[***] notwithstanding anything to the\ncontrary contained in any other law, including but not limited to the Public Procurement Regulatory\nAuthority Act, 2002 (XXII of 2002) and the rules and regulations made 2[thereunder].]\n1[30. Authority to be exempted from taxation.—(1) Notwithstanding anything contained\nin any other law, for a period of five years starting from the commencement of the Public Private\nPartnership Authority (Amendment) Act, 2021, the Authority shall be exempted from income tax.\n(2) The Federal Government may, by notification in the Official Gazette, extend the\nexemption mentioned in sub-section (1) to such extent and on such terms and conditions as it may\ndeem appropriate.]\n2\n[31. Hiring of consultants and experts.— Notwithstanding anything contained in the\nPublic Procurement Regulatory Authority Ordinance, 2002 (XXII of 2002), any rules and\nregulations made thereunder or any similar laws, the Board may, by regulations, prescribe the\nmanner, method and procedures for—\n(a)        the hiring of transaction advisers by implementing agencies in connection with\npublic private partnership projects or certain classes thereof, and such prescribed\nconditions, once notified, shall govern the hiring of consultants by implementing\nagencies for providing such transactional advisory services to the extent\nprescribed therein, including with respect to the direct contracting of international\nfinancial institutions as transaction advisers for certain public private partnership\nprojects or classes of public private partnership projects, to the extent and on such\nterms and conditions as prescribed therein; and\n(b)        the hiring of international and local consultants and experts by the Authority, and\nsuch prescribed conditions, once notified, shall exclusively govern the hiring of\nconsultants and experts by the Authority."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Prior consent of the Board with respect to certain legal actions",
      "content": "Notwithstanding\nanything contained in any law for the time being in force, no legal action shall be initiated against\nany member, officer or official by any government agency for acts of omission or commission in his\nofficial capacity, pertaining to this Act, or the rules or regulation made thereunder, unless the said\nagency obtains prior consent of the Board by an intimation in writing to the Board along-with\nsupporting evidence to the charges. The Board shall constitute an inquiry committee for the purpose,\nwhich shall determine whether there is prima facie cause for the legal action on the charges. The\ncommittee shall give its findings and recommendations to the Board and the decision of the Board on\nthe matter, whether to allow the proposal legal action or not shall be deemed to final.]\n1\nIns. & added by Act VI of 2021, ss. 29 to 31.\n2\nOmitted, Ins. and added by Act No. XVIII of 2022, ss. 16-17."
    }
  ],
  "definitions": []
}
