{
  "id": "pk-public-procurement-regulatory-authority-ordinance-ppra-2002",
  "type": "statute",
  "title": "Public Procurement Regulatory Authority Ordinance (PPRA), 2002",
  "title_en": "Public Procurement Regulatory Authority Ordinance (PPRA), 2002",
  "short_name": "PPRAO",
  "status": "in_force",
  "issued_date": "2002-03-14",
  "in_force_date": "2002-03-14",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Frbps%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Public Procurement Regulatory Authority Ordinance (PPRA), 2002 (XXII of 2002) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Power of the Authority to make regulations",
      "content": "ORDINANCE NO. XXII OF 2002\n[15th May, 2002]\nAn\nOrdinance\nto provide for the establishment of Public Procurement Regulatory Authority for regulating public\nprocurement of goods, services 1[,] works 1[and disposal of public assets] in the public sector\nWHEREAS it is expedient to provide for the establishment of a Public Procurement\nRegulatory Authority for regulating procurement of goods, services 1[,] works 1[and disposal of\npublic assets] in the public sector and for matters connected therewith or ancillary thereto;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day\nof October, 1999, and the Provisional Constitution Order No. 1 of 1999, read with the Provisional\nConstitution (Amendment) Order No. 9 of 1999, and in exercise of all powers enabling him in that\nbehalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the\nfollowing Ordinance:⸻\nCHAPTER I.-PRELIMINARY"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.⸻(1) This Ordinance may be called the Public",
      "content": "Procurement Regulatory Authority Ordinance, 2002.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.⸻ In this Ordinance, unless there is anything repugnant in the subject or",
      "content": "context,⸻\n(a)         “Authority” means the Public Procurement Regulatory Authority established\nunder section 3;\n(b)         “Board” means the Board constituted under section 6;\n(c)         “Chairperson” means the Chairperson of the Board;\n1\n[(ca) “disposal” means auction, rental, lease, donations, destruction and recycling of\npublic assets or any combination thereof;]\n(d)         “Fund” means the fund established under section 9;\n1\n[(e) “goods” means articles and objects of every kind and description\nincluding raw materials, products, equipment, machinery, spares, scraps,\n1\nSubs. and Ins. by Act. No II of 2023, ss. 2, 3 and 4.\nwaste material and commodities in any form and includes all type of assets\nsuch as immovable property, physical objects in any form or matter, intangible\nassets, goodwill, intellectual property and proprietary right, as well as service\nincidental thereto if the value of these services does not exceed the value of\nsuch goods;]\n(f)         “Managing Director” means the Managing Director appointed under section 8;\n(g)         “member” means a member of the Authority;\n(h)         “misprocurement” means public procurement in contravention of any\nprovision of this Ordinance, any rules, regulations, orders or instructions made\nthereunder or any other law in respect of, or relating to, public procurement;\n(i)         “prescribed” means prescribed by rules made under this Ordinance;\n(j)         “procuring agency” means⸻\n(i)         any Ministry, Division, Department or any Office of the Federal\nGovernment;\n(ii)        any authority, corporation, body or organization established by or\nunder a Federal law or which is owned or controlled by the Federal\nGovernment.\n1\n[(ja) “public asset” means all types of goods owned and possessed by the procuring\nagency,]\n(k)         “Public Fund” means the Federal Consolidated Fund and the Public Account\nof the Federation and includes funds of enterprises which are owned or\ncontrolled by the Federal Government.\n1\n[(l) “public procurement” means acquisition of goods, services or construction of\nany works financed wholly or partly out of the public fund and includes\ndisposal of public assets and commercial transactions between procuring\nagency and private party, in terms of which the private party is allowed\nto:⸻\n(i)         perform a procuring agency’s assigned functions, including operations\nand management, on its behalf;\n(ii)        assume the use of public asset; or\n(iii)       receive a benefit either from budget or revenue of the Federal\nGovernment or from fees or charges to be collected by the private\nparty for performing the procuring agency’s function or any\ncombination thereof;]\n(m)         “regulations” means regulations made under this Ordinance;\n(n)         “rules” means rules made under this Ordinance;\n1\nIns. and Subs. by Act. No II of 2023, s. 4.\n(o)    “service” means any object of procurement other than goods or works; and\n(p)    “works” means any construction work consisting of erection, assembly, repair,\nrenovation or demolition of a building or structure or part thereof, such as site\npreparation, excavation, installation of equipment or materials and decoration,\nfinishing and includes incidental services such as drilling, mapping, satellite\nphotography, seismic investigations and similar activities, if the value of those\nservices does not exceed that of the works themselves.\nCHAPTER II.-ESTABLISHMENT OF AUTHORITY"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of Authority.⸻(1) There is hereby established an Authority to be called",
      "content": "(2) The Authority shall be a body corporate, having perpetual succession and a common seal,\nwith powers subject to the provisions of this Ordinance, to acquire and hold property, both movable\nand immovable, and, sue and be sued by the name assigned to it by subsection (1).\n(3) The headquarters of the authority shall be at Islamabad and it may establish its offices at\nsuch other place or places in Pakistan as it may consider appropriate."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power of the Federal Government to issue directives.⸻ The Federal Government may,",
      "content": "as and when it considers necessary, issue directives to the Authority on matters of policy, and such\ndirectives shall be binding on the Authority."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Functions and powers of the Authority.⸻(1) Subject to other provisions of this",
      "content": "Ordinance, the authority may take such measures and exercise such powers as may be necessary for\nimproving governance, management, transparency, accountability and quality of public procurement\nof goods, services and works in the public sector.\n(2) Without prejudice to the generality of the powers conferred by sub-section (1), the\nAuthority may⸻\n(a)    monitor application of the laws, rules, regulations, policies and procedures in\nrespect of, or relating to, procurement;\n(b)    monitor the implementation of and evaluate laws, rules, regulations, policies\nand procedures in respect of, or relating to, inspection or quality of goods,\nservices and works and recommend reformulation thereof or revisions therein\nas it deems necessary;\n(c)    recommend to the Federal Government revisions in or formulation of new\nlaws, rules and policies in respect of or related to public procurement;\n(d)    make regulations and lay down codes of ethics and procedure for procurement,\ninspection or quality of goods, services and works;\n(e)    monitor public procurement practices and make recommendations to improve\ngovernance, transparency, accountability and quality of public procurement;\n(f)    monitor overall performance of procuring agencies                   and    make\nrecommendations for improvements in their institutional set up;\n(g)      provide and coordinate assistance to procuring agencies for developing and\nimproving their institutional framework and public procurement activities;\n(h)      submit reports to the Government in respect of public procurement activities\nof procuring agencies;\n(i)      call any functionary of procuring agencies to provide assistance in its\nfunctions and call for any information from such agencies in pursuance of its\nobjectives and functions; and\n(j)      perform any other function assigned to it by the Federal Government or that is\nincidental or consequential to any of the aforesaid functions.\nCHAPTER III.-MANAGEMENT AND ADMINISTRATION OF THE AUTHORITY"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Board.⸻(1) General directions and administration of the Authority and its affairs shall",
      "content": "vest in a Board which may exercise all powers, perform all functions and do all acts and things\nwhich may be exercised, performed or done by the Authority.\n(2) The Board shall consist of the following Members, namely:⸻\n(1)     Secretary, Finance Division.                               Chairperson\n(2)     Secretary, Ministry of Industries and Production.            Member\n(3)     Secretary, Defence Production Division.                      Member\n(4)     Secretary Ministry of Water and Power.                       Member\n(5)     Secretary, Ministry of Housing and Works.                    Member\n(6)     Secretary, Ministry of Communications.                       Member\n(7)     Three Members from private sector to be nominated by         Members\nthe Federal Government.\n(8)     Managing Director.                                           Member\n(3) The Managing Director shall act as Secretary to the Board.\n(4) A member appointed from the private sector shall hold office for a period of three years\nand shall be entitled to such terms and conditions as the Federal Government may determine.\n(5) A member from the private sector may, by writing in his hand addressed to the Federal\nGovernment, resign his office.\n(6) A casual vacancy in the office of a private sector member shall be filled by appointment\nof another member from the private sector for the residue of the terms of his predecessor."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Meeting of the Board.⸻(1) The meeting of the Board shall be presided over by the",
      "content": "Chairperson or, in his absence the member elected by the members, shall preside at the meeting of\nthe Board.\n(2) Five members shall constitute a quorum for a meeting of the Board requiring a decision\nby the Board.\n(3) The meeting of the Board shall be held at such times, places and in such manner as may\nbe prescribed by regulation.\n(4) The members shall have reasonable notice of the time and place of the meeting and\nmatters on which a decision by the Board shall be taken in such meeting.\n(5) The decision of the Board shall be taken by the majority of its members present and, in\ncase of a tie, the member presiding a meeting shall have a casting vote.\n(6) All orders, determination and decision of the Board shall be taken in writing and shall be\nsigned by the Managing Director."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Managing Director.⸻(1) The Federal Government shall select and appoint a whole time",
      "content": "Managing Director to serve as member of the Board and shall be responsible for day to day\nadministration of the Authority for such period and on such terms and conditions as the Federal\nGovernment may, determine.\n(2) The Managing Director shall be appointed for three years and he shall be eligible for re-\nappointment but his total tenure shall in no case exceed six years.\n(3) No person shall be appointed or continue as Managing Director, if he⸻\n(a)     has been convicted of an offence involving moral turpitude;\n(b)     has been removed from service for misconduct;\n(c)     has been adjudicated as insolvent;\n(d)     is incapable of discharging his duties by reasons of physical or mental\nincapacity and has been so declared by a Medical Board appointed by the\nFederal Government; or\n(e)     fail to disclose any conflict of interest at or within the time provided for such\ndisclosure by or under this Ordinance or contravene any of the provisions of\nthis Ordinance.\n(4) The Managing Director may, at any time, resign his office by writing under his hand\naddressed to the Federal Government.\n(5) The Managing Director shall be paid such salary and allowances as the Federal\nGovernment may determine but his salary and allowances shall not be varied to his disadvantage\nduring his term of office.\n(6) The Managing Director shall not, during the term of his office, engage himself to any\nother service, business, vocation or employment nor shall he before the expiration of one year\nthereof enter into employment or accept any advisory or consult relationship with any person\nengaged in public procurement activity:\nProvided that where the Managing Director is a Government servant there shall be no such\nrestrictions on his employment after he has retired or transferred from the post of Managing Director\nand where he is from private sector he shall not have any direct or indirect financial interest or have\nany connection with any company engaged in public procurement activity for so long as he holds\noffice and for a period of one year thereafter.\n(7) The Managing Director shall have power and responsibility to⸻\n(a)    exercise administrative control over the personnel of the Authority;\n(b)    exercise, in respect of the Authority, such other management, administrative\nand financial powers as deemed appropriate by the Authority.\n(c)    submit the annual budget proposals of the Authority to the Board;\n(d)    prepare the annual report of the Authority for the Board and the Federal\nGovernment;\n(e)    exercise such powers as the Board may delegate to him; and\n(f)    act on behalf of the Authority, in any emergency, subject to the obligation to\nreport such action to the Board at its next meeting and to seek the Board’s\nratification of any action so taken.\nCHAPTER IV.-FINANCIAL PROVISIONS"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Fund.⸻(1) There is hereby established a Fund to be known as the Public Procurement",
      "content": "Regulatory Authority Fund which shall vest in the Authority and shall be utilized by the Authority to\nmeet the charges in connection with its functions under this Ordinance.\n(2) To the credit of the Public Procurement Authority, a fund shall be placed comprising⸻\n(a)    such sums as the Federal Government may, from time to time, allocate to it in\nthe annual budget;\n(b)    grants;\n(c)    income from investment by the Authority; and\n(d)    all other sums or properties which may in any manner become payable to or\nvest in, the Authority in respect of any matter.\n(3) The Authority, while performing its functions and exercising its powers under the\nOrdinance, shall exercise highest sense of prudence as far as expenditures are concerned."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Expenditure to be charged on the Fund.⸻ The Fund shall be expended for the purpose",
      "content": "of⸻\n(a)    paying any expenditure lawfully incurred by the Authority, relating to\nremuneration of its members, employees, advisers, and consultants of the\nAuthority, including provident fund contributions, superannuating allowances\nor gratuities, legal fees and costs as well as other fees and costs;\n(b)    paying any other expenses, costs or expenditure properly incurred or accepted\nby the Authority in the performance of its functions or the exercise of its\npowers under this Ordinance;\n(c)    purchasing or hiring equipment, machinery and any other work and\nundertakings in the performance of its functions or the exercise of its powers\nunder this Ordinance;\n(d)    repaying any financial accommodation received; and\n(e)    generally, paying any expenses for carrying into effect the provisions of this\nOrdinance."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Power to obtain finances and receive grants.⸻ The Authority may, from time to time",
      "content": "and with the approval of the Federal Government, accept grants from entities both domestic and\ninternational, including multilateral agencies for meeting any of its obligations or performing of any\nof its functions."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Budget and accounts.⸻ The Authority shall cause its accounts to be maintained",
      "content": "properly and in respect of each financial year submit for approval of the Federal Government by such\ndate and in such form as may be specified by the Federal Government a statement showing the\nestimated receipts and current expenditure and the sums to be required from the Government during\nthe next financial year."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Maintenance of accounts.⸻ The Authority shall cause proper accounts to be kept and",
      "content": "shall after the end of each financial year cause to be prepared for that financial year a statement of\naccounts of the Authority which shall include a balance sheet and an account of receipt and\nexpenditure."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Audit.⸻ The accounts of the Authority, shall be audited every year by the Auditor",
      "content": "General of Pakistan.\nCHAPTER V.-REGULATORY AND OTHER PROVISIONS."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Information.⸻(1) The Authority may call for any information required by it for carrying",
      "content": "out the purposes of this Ordinance, from any person or any institution in public procurement\nactivities and any such person or institution shall provide the required information called by the\nAuthority.\n(2) The Authority shall furnish to the Federal Government such information with respect to\nthe policies and procedures it is pursuing or proposes to pursue in the performance of any of its\nfunctions under this Ordinance as the Federal Government may, from time to time, require."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Annual report.⸻ Within one hundred and twenty days from the end of each financial",
      "content": "year, the Authority shall cause a report to be prepared on its activities including inquiries and\ninvestigations made by the Authority under this Ordinance during that financial year and release to\nthe public after it has been seen by the Cabinet.\nCHAPTER VI.-MISCELLANEOUS"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Appointment of officers and staff, etc.⸻(1) The Authority may, from time to time and",
      "content": "within its resources, appoint such officers, servants, advisers, consultants and experts as it may\nconsider necessary for performance of its functions.\n(2) The Authority shall by regulations prescribe the procedure for appointment of its officers,\nservants, advisers, consultants and experts and the terms and conditions of their service."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Members, officers, etc. to be public servants.⸻ The Chairperson, members, Director",
      "content": "General, officers, servants, advisers, consultants and experts of the Authority shall, when acting or\npurporting to act in pursuance of any of the provisions of this Ordinance or the rules and regulations\nmade thereunder, be deemed to be public servants within the meaning of section 21 of the Pakistan\nPenal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Delegation.⸻ The Authority may, by such conditions and limitations as it may deem fit",
      "content": "to impose, delegate any of its functions or powers to the Managing Director, or one or more\nmembers or any of its officers except the power to⸻\n(a)        approve audited accounts;\n(b)        recommend exemption under section 21; and\n(c)        make or repeal regulation made under this Ordinance.\n1\n[20A. Mechanism for grievance redressal.⸻ The procuring agency shall, by rules and\nregulations made under this Ordinance, have a mechanism for grievance redressal of bidder during\nprocurement.]"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Power to exempt.⸻ The Authority may, for reasons to be recorded in writing,",
      "content": "recommend to the Federal Government that the procurement of an object or class of objects in the\nnational interest be exempted from the operation of this Ordinance or any rule or regulation made\nthereunder or any other law regulating public procurement and the Federal Government on such\nrecommendations shall exempt the aforesaid objects or class of objects from the operation of the\nlaws and rules and regulations made thereunder.\n[21A. Ordinance not to apply to certain bodies corporate, etc.⸻(1) Notwithstanding\nanything contained in this Ordinance the provisions thereof shall not apply to a body corporate,\ncompany, institution undertaking or establishment specified in the Schedule to this Ordinance, which\nhas been privatized pursuant to the Privatization Commission Ordinance, 2000 (LII of 2000).\n(2) The Federal Government may, by notification in the official Gazette, amend the Schedule\nso as to add any entry thereto, modify or omit any entry therein.]"
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Validity of proceedings.⸻ No act or proceedings of the Authority or the Board, shall be",
      "content": "invalid by reason only of the existence of a vacancy in, or defect in the constitution of, the Authority\nor the Board.\n1\nIns. new section 20A by Act. No II of 2023, s. 5.\n2\nIns. new section 21A by Act. No III of 2006, s. 19."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Indemnity.⸻ No suit, prosecution, or other legal proceedings shall lie against the",
      "content": "Authority, the Board, the Chairperson or any member, officer, servants, advisers or consultants of the\nAuthority in respect of anything in good faith done or intended to be done under this Ordinance or\nthe rules and regulations made thereunder."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Common seal.⸻(1) The Authority shall have a common seal and such seal shall be kept",
      "content": "by the Managing Director or such other person as the Chairperson may authorise.\n(2) The seal shall be authenticated in the same manner as may be prescribed by regulation\nand any document purported to be sealed with the seal so authenticated shall be receivable as\nevidence of the particular stated in the document."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Winding up.⸻ No provision of law relating to winding up of bodies corporate shall",
      "content": "apply to the Authority and the Authority shall not be wound up except by the orders of the Federal\nGovernment in the same manner as the Federal Government may direct."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Power of the Federal Government to make rules.⸻ The Federal Government may, by",
      "content": "notification in the official Gazette, make rules for carrying out the purposes of this Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "Authority",
      "definition": "the Public Procurement Regulatory Authority established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board constituted under section 6;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairperson",
      "definition": "the Chairperson of the Board; 1 [(ca) “disposal” means auction, rental, lease, donations, destruction and recycling of public assets or any combination thereof;]",
      "source_provision": "sec2"
    },
    {
      "term": "Fund",
      "definition": "the fund established under section 9; 1 [(e) “goods” means articles and objects of every kind and description including raw materials, products, equipment, machinery, spares, scraps, 1 Subs. and Ins. by Act. No II of 2023, ss. 2, 3 and 4. waste material and commodities in any form and includes all type of assets such as immovable property, physical objects in any form or matter, intangible assets, goodwill, intellectual property and proprietary right, as well as service incidental thereto if the value of these services does not exceed the value of such goods;]",
      "source_provision": "sec2"
    },
    {
      "term": "Managing Director",
      "definition": "the Managing Director appointed under section 8;",
      "source_provision": "sec2"
    },
    {
      "term": "member",
      "definition": "a member of the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "misprocurement",
      "definition": "public procurement in contravention of any provision of this Ordinance, any rules, regulations, orders or instructions made thereunder or any other law in respect of, or relating to, public procurement;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "public asset",
      "definition": "all types of goods owned and possessed by the procuring agency,]",
      "source_provision": "sec2"
    },
    {
      "term": "Public Fund",
      "definition": "the Federal Consolidated Fund and the Public Account of the Federation and includes funds of enterprises which are owned or controlled by the Federal Government. 1 [(l) “public procurement” means acquisition of goods, services or construction of any works financed wholly or partly out of the public fund and includes disposal of public assets and commercial transactions between procuring agency and private party, in terms of which the private party is allowed to:⸻ (i) perform a procuring agency’s assigned functions, including operations and management, on its behalf; (ii) assume the use of public asset; or (iii) receive a benefit either from budget or revenue of the Federal Government or from fees or charges to be collected by the private party for performing the procuring agency’s function or any combination thereof;]",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Ordinance; 1 Ins. and Subs. by Act. No II of 2023, s. 4.",
      "source_provision": "sec2"
    },
    {
      "term": "service",
      "definition": "any object of procurement other than goods or works; and",
      "source_provision": "sec2"
    },
    {
      "term": "works",
      "definition": "any construction work consisting of erection, assembly, repair, renovation or demolition of a building or structure or part thereof, such as site preparation, excavation, installation of equipment or materials and decoration, finishing and includes incidental services such as drilling, mapping, satellite photography, seismic investigations and similar activities, if the value of those services does not exceed that of the works themselves. CHAPTER II.-ESTABLISHMENT OF AUTHORITY",
      "source_provision": "sec2"
    }
  ]
}
