{
  "id": "pk-publication-of-the-holy-quran-elimination-of-printing-errors-act-1973",
  "type": "statute",
  "title": "Publication of the Holy Quran (Elimination of Printing Errors) Act, 1973",
  "title_en": "Publication of the Holy Quran (Elimination of Printing Errors) Act, 1973",
  "short_name": "POTHQ",
  "status": "in_force",
  "issued_date": "1973-07-27",
  "in_force_date": "1973-07-27",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpuUZWJo-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Publication of the Holy Quran (Elimination of Printing Errors) Act, 1973 (LIV of 1973) published by The Pakistan Code (Islamic/Religious Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Publication of\nthe Holy Quran (Elimination of Printing 1[and Recording] Errors) Act, 1973.\n(2) It extends to the whole of 2[Islamabad Capital Territory.]\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,___\n3\n[(a)         “Ayah” means a sentence, clause or verse of the Holy Quran at the end of\nwhich the sign “O” is given in the standard copy;\n2\n[(b)]        “Committee” means the Committee of Ulema appointed under section 4;]\n2\n[(c)         “damaged or Shaheed copy of the Holy Quran” includes:\n(i)   a sub-standard copy of the Quran, damaged or worn-out pages of the\nHoly Quran;\n(ii) any other material in the form of book, magazine, card, bill, flex etc.\nthat contains Arabic Text of the Holy Quran;\n(d)              “disposal” means collection and storage of demaged or shaheed copy of\nthe Holy Quran and includes its burial under the ground or its disposal in\nthe sea or river or re-cycling it in such manner as conforms to its holiness\nand sanctity;]\n2\n[(e)]        “Holy Quran” means the Holy Quran in the Arabic text, published in\ncomplete form, or in the form of parts (Paras) or Chapters (Surahs), but\ndoes not include extracts published in text-books or prayer-books or\nreligious treaties;\n2\n[(f)]        “prescribed” means prescribed by rules made under this Act;\n2\n[(g)         “Quran Board” means the Board constituted under section 4;]\n1 2\n[ [(h)]      “record of the Holy Qur’an” means the Holy Qur’an recited in human\nvoice and recorded by any modern means of recording conforming to the\ntext thereof contained in the standard copy;\n2\n[(i)]        “recording company” means a person, or an association of persons,\nregistered under section 3 as a recording company;]\n2\n[(j)]        “standard copy” means a copy of the Holy Quran authenticated by the\n2\n[Quran Board] as correct and free from errors of printing.\n1\nIns. by Act No. X of 1987, ss. 2-3.\n2\nSubs., re-numbered and ins. by Act No. II of 2024, ss. 2-3.\n3\nSubs. by Act No. XXXVIII of 1976, s. 2."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Registration of publishers 1[and recording companies]",
      "content": "_Any publisher who intends to\npublish 1[, and any recording company which intends to record, the Holy Qur’an shall get himself or\nitself] registered with the Auqaf 2[Directorate, Islamabad Capital Territory,] 2[***], on payment of\nsuch fee and on such terms and conditions as may be prescribed."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. 2[Quran Board]",
      "content": "_(1) The Federal Government shall 2[constitute a Quran Board]\ncomprising prominent Ulema, Huffaz and Qaris of all schools of thought amongst Muslims.\n2\n[(2) The Federal Government shall in the prescribed manner cause a copy of the Holy Quran\nto be prepared and shall forward it to the Quran Board for authentication as a standard copy.\n(3) The Federal Government shall in the prescribed manner keep the standard copy in the\nGovernment archives for safe custody including to upload it on website of the Division to which\nbusiness of religious affairs stands allocated.]\n2\n[(4) The Quran Board shall recommend steps for error-free printing and publication or\nrecording of the Holy Quran and shall, subject to the direction of the Government, supervise the\nwork of error-free printing and publication and recording of the Holy Quran including uploading the\ncopies on the Internet.\n(5) The Quran Board shall perform such other functions as may be prescribed.]"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Publishing of the Holy Quran.___(1) A publisher may print the Holy Quran in off",
      "content": "set,\nphotostate, photo-block or any other modern system of printing but he shall not print it in litho\nprocess.\n(2) In printing the Holy Quran, a publisher shall use paper the use of which is not prohibited\nby the Federal Government.\n(3) Every publisher shall get his specimen copy 1[, and every recording company shall get its\nspecimen record,] of the Holy Quran compared with the text of the standard copy by a person\nholding a diploma from a religious institution or a certificate of Moulvi Fazil or a qualified Qari who\nis also a Hafiz or a person trained in the job of proof reading in Arabic and have a certificate\nrecorded by such person at the end to the effect that the text and references do not contain any error.\n(4)        The publisher shall ensure—\n(a) that the serial number of every Chapter (Surah) is printed on every page and the serial\nnumber of every 3[Ayah] is inserted within the sign of conclusion (o) of every\n3\n[Ayah];\n(b) that the cover page of every edition of the Holy Quran clearly bears the name of the\npublisher, the name of the printing press, and the year of publication;\n(c) that every page of the Holy Quran bears the indication given in the illustration in the\nSchedule; and\n(d) that on detection of any error or omission in the printed Holy Quran the leaf on which\nit occurs is replaced by a fresh leaf free from such error and omission in each copy:\n1\nIns. and subs. by Act No. X of 1987, ss. 4-5.\n2\nSubs., omitted and added by Act No. II of 2024, ss. 4-5.\n3\nIns. and subs. by Act No. XXXVIII of 1976, s. 3.\nProvided that he shall not be penalized for non-compliance with the provisions of\nparagraphs (a) and (c) 1[unless he is found negligent in the performance of his duty].\n(5) No translation of the Holy Quran shall be published 2[or recorded] without its Arabic\ntext.\n1\n[(5a) Arabic text of the Holy Quran shall not be printed on newspapers, flexes, cards, hand\nbills, brochures or on any other such disposable forms, and only its translation shall be printed in\nsuch forms where required.]\n2\n[(6) No record of the Holy Qur’an which injuries its sanctity in any form shall be prepared].\n3\n[5A. Literal distortion of the text of Ayah.—Where, in a copy 2[or record] of the Holy\nQuran or in any extract thereof published in a text-book, prayerbook, religious treatise or otherwise,\nan Ayah has been so literally distorted, either by change of a word, or of sequence, or of Aarab, as to\nalter its meaning, the printer or publisher thereof 2[or, as the case may be, recording company],\nwhether registered under this Act or not, shall, unless he 2[or it] can prove that such distortion\noccurred only due to a printing 2[or mechanical] error, be liable to the punishment provided for in\nsection 6.]\n[5B. Translation or interpretation of the Holy Qur’an contrary to belief of Muslims.—\n2\nWhere, in a copy or record of the Holy Qur’an, or in any extract thereof published in a text book,\nprayer book, religious treatise or other book, an Ayah of the Holy Qur’an is translated, interpreted or\ncommented upon by a non Muslim contrary to the belief of Muslims, the author, printer or publisher,\nor the person who prepared the record, whether registered under this Act or not, shall, unless he can\nprove that such translation, interpretation or commentary occurred only due to a printing or\nmechanical error, be liable to the punishment provided for in section 6.]\n1\n[5C. Disposal of damaged or shaheed copies. ___A publisher or a recording company shall\nmake suitable arrangements in the prescribed manner for disposal of damaged or shaheed copy of the\nHoly Quran.]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Penalty",
      "content": "_2[(1) A printer or publisher who, or a recording company which, contravenes\nany provision of this Act or the rules made thereunder, or a person in whose voice a record is\nprepared, or a person who has certified, under sub-section (3) of section 5, a specimen copy, or\nrecord, of the Holy Qur’an which is not in conformity with the provisions of this Act shall be liable\nto imprisonment for a term which may extend to three years, or with fine amounting to not less than\n1\n[twenty] thousand rupees, or with both.]\n(2) The registration under section 3 of a publisher who 2[, or recording company which,] is\nconvicted of an offence under sub-section (1) may be cancelled."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Offences by corporations",
      "content": "If the person guilty of an offence under sub-section (1) of\nsection 6 is a company or other body corporate, every director, manager, secretary or other officer\nthereof shall, unless he proves that the offence was committed without his knowledge or that he\nexercised all due diligence to prevent the commission thereof, be deemed to be guilty of such\noffence."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Power to make rules",
      "content": "_(1) The Federal Government may, by notification in the official\nGazette, make rules for carrying out the purposes of this Act.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules\nmay provide for__\n________________________________________________________________________________________________________________________\n1\nIns. added and subs. by Act No. II of 2024, sss. 6-8.\n2\nIns. and added by Act No. X of 1987, ss. 5-8.\n3\nIns. by Act No. XXXVIII of 1976, s. 4.\n1\n[(a)       the inspection of the copies and records of the Holy Qur’an printed or, as\nthe case may be, prepared before the commencement of this Act;]\n(b)            the prohibition of the sale of copies 1[and records] containing errors 2[;]\n2\n[(c)       the checking of all such copies 1[and records] of the Holy Quran as have not\nbeen certified under this Act as free from errors, at the expense of the\npublisher 1[or recording company]; 3[*]\n(d)            the seizure of such copies 1[or records] of the Holy Quran in which there\nexist errors which cannot, in the opinion of the prescribed authority, easily\nbe corrected in print 1[or record] 3[;]]\n3\n[(e)       the constitution and functions of the Quran Board; and\n(f)            the disposal of damaged and shaheed copies of the Holy Quran.]\n–––––––––––\n[See section 5(4) (c)]\nIllustration\nUpper side of the page\nSerial number of Surah                                         Page number         Serial number of Para with\nwith caption as                                                               opening words as\nLower side of the page\nSerial number of Surah with                                Manzil            Serial Number of\nserial number of the concluding                                              Surah with opening Ayah\nAyah on the page as                                                          on the page as\n_____________\nRGN Date: 03-09-2024\n1\nSubs., ins. and added by Act No. X of 1987, s. 9.\n2\nSubs. by Act No. XXXVIII of 1976, s. 5.\n3\nOmitted, subs. and added by Act No. II of 2024, s. 9."
    }
  ],
  "definitions": [
    {
      "term": "Ayah",
      "definition": "a sentence, clause or verse of the Holy Quran at the end of which the sign “O” is given in the standard copy; 2 [(b)] “Committee” means the Committee of Ulema appointed under section 4;] 2 [(c) “damaged or Shaheed copy of the Holy Quran” includes: (i) a sub-standard copy of the Quran, damaged or worn-out pages of the Holy Quran; (ii) any other material in the form of book, magazine, card, bill, flex etc. that contains Arabic Text of the Holy Quran;",
      "source_provision": "sec2"
    },
    {
      "term": "disposal",
      "definition": "collection and storage of demaged or shaheed copy of the Holy Quran and includes its burial under the ground or its disposal in the sea or river or re-cycling it in such manner as conforms to its holiness and sanctity;] 2 [(e)] “Holy Quran” means the Holy Quran in the Arabic text, published in complete form, or in the form of parts (Paras) or Chapters (Surahs), but does not include extracts published in text-books or prayer-books or religious treaties; 2 [(f)] “prescribed” means prescribed by rules made under this Act; 2 [(g) “Quran Board” means the Board constituted under section 4;] 1 2 [ [(h)] “record of the Holy Qur’an” means the Holy Qur’an recited in human voice and recorded by any modern means of recording conforming to the text thereof contained in the standard copy; 2 [(i)] “recording company” means a person, or an association of persons, registered under section 3 as a recording company;] 2 [(j)] “standard copy” means a copy of the Holy Quran authenticated by the 2 [Quran Board] as correct and free from errors of printing. 1 Ins. by Act No. X of 1987, ss. 2-3. 2 Subs., re-numbered and ins. by Act No. II of 2024, ss. 2-3. 3 Subs. by Act No. XXXVIII of 1976, s. 2.",
      "source_provision": "sec2"
    }
  ]
}
