{
  "id": "pk-punjab-laws-act-1872",
  "type": "statute",
  "title": "Punjab Laws Act, 1872",
  "title_en": "Punjab Laws Act, 1872",
  "short_name": "PLA",
  "status": "in_force",
  "issued_date": "1872-03-27",
  "in_force_date": "1872-03-27",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-a5w%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Punjab Laws Act, 1872 (IV of 1872) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. [Repealed]",
      "content": "22 to 33.. [Repealed]\n34 to 38. [Repealed]."
    },
    {
      "provision_ref": "sec39a",
      "section": "39A",
      "title": "Section 39A. Power to establish a system of village",
      "content": "watchmen and municipal watchmen, and to make\nrule."
    },
    {
      "provision_ref": "sec39b",
      "section": "39B",
      "title": "Section 39B. Obligation to assist watchman and headman",
      "content": "Person obstructing watchman or headman may be arrested without warrant."
    },
    {
      "provision_ref": "sec39d",
      "section": "39D",
      "title": "Section 39D. Notice of taxes proposed to be levied",
      "content": "Objections to taxation.\nProcedure thereon."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Penalty for withholding assistance or conniving at offence or escape",
      "content": "Limit to fine.\nAppeal to High Court\nFine may be awarded to injured parties, and fee to tracker."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. [Repealed]",
      "content": "Act No IV OF 1872\n[28th March, 1872]\nAn Act for declaring which of certain rules, laws and regulations have the force of law in the\nPunjab and for other purposes.\nPreamble. WHEREAS certain rules, laws and regulations, made heretofore for the Punjab,\nacquired the force of law under the provisions of section 25 of the lIndian Councils Act, 1861; and\nwhereas it is expedient to declare which of the said rules, laws and regulations shall henceforth be in\nforce in the Punjab, and to amend, consolidate or repeal others of the said rules, orders and\nregulations; It is hereby enacted as follows:—"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Local extent. It extends to the 2territories 3[comprised in the Punjab], but not so as to alter",
      "content": "the effect of any regulations made for any parts of the said territories under the 1Statute 33 Vict., cap.\n3, section 1;\nCommencement, and it shall come into force on the first day of June, 1872."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Enactments in force. The Regulations, Acts and Orders specified in the First Schedule",
      "content": "hereto annexed are in force in 4[the Punjab] to the extent specified in the third column of the said\nSchedule."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. [Enactments repealed.] Rep. by the Second Repealing and Amending Act, 1914 (XVII of",
      "content": "1914), s. 3 and Sch. II.\n5\n[5. Decisions in certain cases to be according to Native law.—In questions regarding\nsuccession, special property of females betrothal, marriage, divorce, dower, adoption, guardianship,\nminority, bastardy, family relations, wills, legacies, gifts, partitions, or any religious usage or\ninstitution, the rule of decision shall be—\n6\n(a)          [Where the parties are not Muslims, any custom] applicable to the parties\nconcerned, which is not contrary to justice, equity or good conscience, and has\nnot been by this or any other enactment altered or abolished, and has not been\ndeclared to be void by any competent authority;\n7\n(b)             ***\n1\nRep. by the Government of India Act.\n2\nRep. in the territories now forming the N.W.F.P. by the N.W.F.P. Law and Justice Regulation, 1901 (7 of 1901), s. 5.\n3\nThe original words “now under the administration of the Lieutenant Governor of the Punjab” were first subs. by A. O., 1949, Sch. and then amended\nby the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 8, to read as above.\n4\nSubs. by Act 26 of 1951, s. 8, for” West Punjab” which had been subs. by A.O., 1949, for” the Punjab”.\n5\nSubs. by the Punjab Laws (Amdt) Act, 1878 (12 of 1878), s. 1, for the original section 5. The provisions of this section have been rep. in so far as they\nare inconsistent with those of the Muslim Personal Law (Shariat) Application Act, 1937 (26 of 1937), see ibid., s. 6.\n6\nSubs. by the Federal Laws, (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2nd Sch., for “Any custom”.\n7\nCertain words omitted ibid.\nthe Hindu law, in cases where the parties are Hindus, except in so far as such law has been\naltered or abolished by legislative enactment, or is opposed to the provisions of this Act, or has been\nmodified by any such custom as is above referred to.]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Decisions in cases not specially provided for",
      "content": "In cases not otherwise specially provided\nfor, the Judges shall decide according to justice, equity and good conscience."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Local customs and mercantile usages when valid",
      "content": "All local customs and mercantile\nusages shall be regarded as valid, unless they are contrary to justice, equity or good conscience, or\nhave, before the passing of this Act, been declared to be void by any competent authority.\n1\n*     *         *        *         *\n18, 8A, 8B and 8C. [Regarding descent of Jaghirs] Rep. by the Punjab Jaghirs Act, 1941\n(Punjab Act V of 1941), s. 13.\n9 to 20. Rep. by the Punjab Pre-emption Act, 1905 (Punjab Act II of 1905), s. 2 (I)."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. [Saving of previous insolvency Proceedings.] Rep. by the Amending Act, 1891 (XII of",
      "content": "1891).\n34 to 38. Rep. by the Punjab Court of Wards Act, 1903 (Punjab Act II of 1903), s. 2 (I).\n2"
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. [Pakistan Penal Code to apply to offences committed previous to 1st January, 1862",
      "content": "Saving of privileges conferred on certain Chiefs.] Omitted by the Federal Laws (Revision and\nDeclaration) Ordinance, 1981 (XXVII of1981), s. 3 and IInd Sch.\n3[39A. Power to establish a system of village-watchmen and municipal watchmen, and to\nmake rules.—4[The Provincial Government] may establish a system of village-watchmen or\nmunicipal watchmen in any part of the 5[Punjab], and in furtherance of this object may, from time to\ntime, make rules to provide for the following matters:—\n1\nThe heading “Descent of Jaghirs” preceding Ss. 8, 8A, 8B and 8C which were subs. by the Punjab Descent of Jaghirs Act, 1900 (Punjab Act 4 of\n1900), s. 2, for the original section 8, was subsequently repealed, together with the said sections, by the Punjab Jaghirs Act, 1941    (Punjab Act 5 of\n1941), s. 13.\n2\nThis section was previously amended by A.O.,1937.\n3\nSs. 39A and 39B were subs. by the Punjab Laws (Amdt) Act, 1881 (24 of 1881), s. 2, for the ss. 39A and 39B which had been ins. by the Punjab Laws\nAmdt Act, 1875 (15 of 1875), s. 2.\n4\nSubs. by A. O. 1937, for “The L.G.”.\n5\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. for “territories under its administration” (with effect from\nthe 14th October, 1955).\n(a)       the definition of the limits of watchmen’s beats;\n(b)       the determination of the several grades of watchmen, and the number of each\ngrade to be appointed to each beat;\n(c)       the appointment, suspension, dismissal and resignation of watchmen of each\ngrade;\n(d)       the equipment and discipline of, and the control and supervision over, such\nwatchmen;\n(e)       the conferring upon them, and the exercise by them, of any powers and the\nenjoyment by them of any protection or privilege, which may be exercised and\nenjoyed by a police-officer under any law for the time being in force;\n(f)       the performance by them of such duties relating to police, sanitation or\nstatistics, or for the benefit of the village communities or municipalities within\ntheir respective beats, as 1[the Provincial Government] thinks fit;\n(g)       the exercise of authority over, and the rendering of aid to, such watchmen by\nheadmen of the villages or members of the Municipal Committees of the\ntowns comprised in their respective beats;\n(h)       the performance, by the headmen of villages comprised in the beat, of any\nwatchman, of any of the duties of a village-watchman in aid of, or substitution\nfor, such watchman;\n(i)       the exercise, by such village-headmen for the purposes referred to in clauses\n(g) and (h), or by members of Municipal Committees for the purposes referred\nto in clause (g) of this section, of any of the powers, and the enjoyment by\nsuch headmen or members of any privilege or protection, of a village-\nwatchman, or a municipal watchman, as the case may be;\n(j)       the determination of the rate at which, and the mode in which, watchmen shall be\npaid, and, in the case of village watchmen, of the mode in which their pay, the\nexpenses of their equipment, and other charges connected with the village-\nwatchman-system shall be provided for, whether out of cesses or funds already\nleviable or available in the vi1lages comprised in the beat, or by a special tax in\nmoney or kind to be imposed on any class of persons residing or owning\nproperty in, or resorting to, such villages, or partly in one of these ways and\npartly in the other;\n(k)       the collection with or without the aid of the village-headmen, and by any\nprocess available for the realisation of the land-revenue, of any tax imposed\nunder clause (j) of this section, and the application of, and the mode of\naccounting for, the same; and generally for\n1\nSubs. by A. O. 1937, for “The L.G.”.\n(l)        the efficient working of the system of village-watchmen or municipal\nwatchmen;\nProvided—\nfirst, that the rules to be made regarding the appointment of village-watchmen shall allow to\nthe headmen of the villages comprised in the beat to which such a watchman is to be appointed a\npower of nomination, to be exercised in such a manner and subject to such reasonable conditions as\nmay be prescribed by such rules:\nsecondly, that the rules to be made under clause (j) of the section with regard to village-\nwatchmen shall include provisions for recording and securing due consideration of the views and\nopinions on the matters therein referred to of the headmen of the villages comprised in each beat."
    },
    {
      "provision_ref": "sec39e",
      "section": "39E",
      "title": "Section 39E. Power to fix rates of tax",
      "content": "When any such tax has been so approved by l[the\nProvincial Government], the Deputy Commissioner may from time to time, subject to such rules\nconsistent with this Act as 1[the Provincial Government] may from time to time prescribe, determine\nthe rates at which it is to be levied."
    },
    {
      "provision_ref": "sec39f",
      "section": "39F",
      "title": "Section 39F. Power to make rules for collection of taxes",
      "content": "l[The Provincial Government] may from\ntime to time make rules to provide for the collection of such taxes by any process available for the\nrealisation of the land-revenue and to regulate the application and mode of accounting for the same."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Provincial Government may confer powers of Police",
      "content": "officer. 1[The Provincial\nGovernment] may, if it thinks fit, confer on any person any of the powers which may be exercised by\na Police-officer under any Act for the time being in force, 2[and may withdraw any powers so\nconferred]."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Trackers may call for assistance in carrying on tracks. When an offence is, has been,",
      "content": "or may reasonably be supposed to have been committed, and the tracks of the persons who may\nreasonably be supposed to have committed such offence, or of any animal or other property\nreasonably supposed to be connected with such offence, are followed to a spot within the immediate\nvicinity of a village, the person following such tracks may call upon any headman or village-\nwatchman in such village to assist in carrying on the tracks."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Control of slaughter of kine and sale of beef",
      "content": "The slaughter of kine and the sale of\nbeef shall not take place except 1* * * subject to rules to be from time to time, either generally or in\nany particular instance, prescribed by 2[the Provincial Government]."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. 3[Control of entry into towns of bands of armed men.] Omitted by the Federal Laws",
      "content": "(Revision and Declaration) Ordinance, 1981 (XXVII of1981), s. 3 and IInd Sch."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. 4[Powers of Magistrate of District as to foreign vagrants.] Omitted by the Federal Laws",
      "content": "(Revision and Declaration) Ordinance, 1981 (XXVII of 1981) s. 3 and IInd Sch."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. 4[Surveillance, etc., of band failing to comply with Magistrate’s Order.] Omitted by the",
      "content": "Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and IInd Sch."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Crossing of streams on buoys or skins",
      "content": "No person shall cross any river or\nstream on a buoy or inflated skin, nor shall have in his possession or custody any buoy or\nskin for the purpose of being used in crossing any river or stream, except 5* * * subject to rules\nto be from time to time either generally or in any particular instance, prescribed by 2[the Provincial\nGovernment]."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Use of pasturage or natural product of Government land",
      "content": "No person shall make use\nof the pasturage or other natural product of any land being the property of 6[the Government], except\nwith the consent and subject to rules to be from time to time, either generally or in any particular\ninstance, prescribed by 7[the government concerned]."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. [Growing, selling or keeping opium.] Rep. by the Opium Act, 1878 (I of 1878), s. 2 and",
      "content": "Sch.\n8\n[50. Power to make rules as to matters mentioned in sections 43 to 48.—2[The Provincial\nGovernment] may from time to time make rules as to the matters mentioned in 9[sections 43,47 and\n48] inclusive.\nExisting rules.—All existing rules upon-such matters, which-might have-been made under\nthis section had it been in force, shall be deemed to have been made hereunder."
    },
    {
      "provision_ref": "sec50a",
      "section": "50A",
      "title": "Section 50A. Conditions of validity of rules hereafter made under this Act",
      "content": "10[Rules made under\nthis Act shall not be valid unless]:\n1\nThe words “with the consent and” rep. by the Punjab Laws (Amdt.) Act, 1878 (12 of 1878), s. 6.\n2\nSubs. by A.O., 1937, for “the L.G.”.\n3\nThis section was previously amended by Act, 12 of 1878, s. 6 and A.O., 1937.\n4\nThis section was amended by A.O., 1937.\n5\nThe words “with the consent and” rep. by the Punjab Laws (Amdt.) Act, 1878 (12 of 1878), s. 6.\n6\nThe original words “the Government”. were first subs. .by, A.O., 1937 and then amended by A.O.,1961, Art. 2 (with effect from the 23rd March, 1956),\nto read as above.\n7\nThe original words the L,G.” were first subs. by A.O., 1937 and then amended by A.O., 1961, Art.2 and Sch.(with effect from the 23rd March, 1956),\nto read as above.\n8\nSs 50, 50A and 50B were subs. by the Punjab Laws Amdt. Act, 1875 (15 of 1875), s. 3, for the original s. 50.\n9\nSubs. by “the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and. IInd Sch. for “sections 43 to.48” which had been subs.\nby the Amending Act, 1891 (12 of 1891), s. 2 and Sch. II, for “sections forty three to forty-nine”.\n10\nSubs. by A.O., 1937, for the words “[All] rules hereafter made by the L.G. under any power conferred by this Act shall be [subject to the control of\nthe G.G. in C. and no such rules shall be valid] unless”. The words in crotchets were subs. by the Decentralization Act, 1914 (4 of  1914), for the\nwords “No” and” valid “, respectively.\n(a)        they are consistent with the laws for the time being in force in 1[the Punjab];\n(b)       they are published in the official Gazette;\n2\n*******\n3\n[50B. Penalties for beach of rules.—Whoever breaks any rule made by the Provincial\nGovernment under this Act shall be punished with imprisonment for a term which may extend to six\nmonths, or with fine which may extend to fifty rupees, or with both.]"
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. [Republication of rules and orders] Omitted by the Federal Laws (Revision and",
      "content": "Declaration) Ordinance, 1981 (XXVII of 1981), s.3 and IInd Sch."
    }
  ],
  "definitions": []
}
