{
  "id": "pk-qanun-e-shahadat-order-1984-qso",
  "type": "statute",
  "title": "Qanun-e-Shahadat Order, 1984 (QSO)",
  "title_en": "Qanun-e-Shahadat Order, 1984 (QSO)",
  "short_name": "Qanun-e-Shahadat Order, 1984 (QSO)",
  "status": "in_force",
  "issued_date": "1984-10-27",
  "in_force_date": "1984-10-27",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5plaw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Qanun-e-Shahadat Order, 1984 (QSO) (X of 1984) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec61",
      "section": "61",
      "title": "Section 61. Opinion as to hand",
      "content": "writing when relevant.— When the Court has to form an opinion as\nto the person by whom any document was written or signed, the opinion of any parson acquainted with\nthe hand-writing of the person by whom it is supposed to be written or signed that it was or it was not\nwritten or signed by that person, is a relevant fact.\nExplanation.—A person is said to be acquainted with the hand-writing of another person when\nhe has seen that person write, or when he has received documents purporting to be written by that\nperson in answer to documents written by himself or under his authority and addressed to that person,\nor when, in the ordinary course of business, documents purporting to be written by that person have\nbeen habitually submitted to him.\nIllustrations\nThe question is, whether a given letter is in the hand-writing of A, a merchant in\nLondon.\nB is a merchant in Peshawar, who has written letters addressed to A and received letters\npurporting to be written by him, C is B’s clerk, whose duty it was to examine and file\nB’s correspondence. D is B’s broker, to whom B habitually submitted the letters\npurporting to be written by A for the purpose of advising him thereon.\nThe opinion of B, C and D on the question whether the letter is in the hand-writing of\nA\nare relevant, though neither B, C or D ever saw A write."
    },
    {
      "provision_ref": "sec62",
      "section": "62",
      "title": "Section 62. Opinion as to existence of right or custom, when relevant",
      "content": "When the Court has to\nform an opinion as to the existence of any general custom or right, the opinion, as to the existence of\nsuch custom or right, of persons who would be likely to know of its existence if it existed, are relevant.\nExplanation.—The expression “general custom or right” includes customs or rights common\nto any considerable class of persons.\nIllustrations\nThe right of the villagers of a particular village to use the water of a particular well is a general right\nwithin the meaning of this Article."
    },
    {
      "provision_ref": "sec63",
      "section": "63",
      "title": "Section 63. Opinion as to usages, tenets, etc., when relevant",
      "content": "When the Court has to form an\nopinion as to—\nthe usages and tenets of any body of man or family,\nthe constitution and government of any religious or charitable foundation, or\nthe meaning of words or terms used in particular districts or by particular classes of people,"
    },
    {
      "provision_ref": "sec64",
      "section": "64",
      "title": "Section 64. Opinion on relationship when relevant",
      "content": "When the Court has to form an opinion as to\nthe relationship of one person to another, the opinion, expressed by conduct, as to the existence of such\nrelationship, of any person who, as a member of the family or otherwise, has special means of\nknowledge on the subject, is a relevant fact:\nProvided that such opinion shall not be sufficient to prove a marriage in proceedings under the\nDivorce Act, 1869 (IV of 1869), or in prosecutions under Section 494 or 495 of the Pakistan Penal\nCode (Act XLV of 1860).\nIllustrations\n(a)     The question is, whether A and B were married.\nand wife, is relevant.\n(b)     The question is, whether A was the legitimate son of B. The fact that A was\nalways treated as such by members of the family, is relevant."
    },
    {
      "provision_ref": "sec65",
      "section": "65",
      "title": "Section 65. Grounds of opinion when relevant",
      "content": "Whenever the opinion of any living person is\nrelevant, the grounds on which such opinion is based are also relevant.\nIllustration\nAn expert may give an account of experiments performed by him for the purpose of forming his\nopinion."
    },
    {
      "provision_ref": "sec66",
      "section": "66",
      "title": "Section 66. In civil cases character to prove conduct imputed irrelevant",
      "content": "In civil cases the fact\nthat the character of any person concerned is such as to render probable or improbable any conduct\nimputed to him is irrelevant, except in so far as such character appears from facts otherwise relevant."
    },
    {
      "provision_ref": "sec67",
      "section": "67",
      "title": "Section 67. In criminal cases previous good character relevant",
      "content": "In criminal proceedings the fact\nthat the person accused is of a good character is relevant."
    },
    {
      "provision_ref": "sec68",
      "section": "68",
      "title": "Section 68. Previous bad character not relevant, except in reply",
      "content": "In criminal proceedings the fact\nthat the accused person has a bad character is irrelevant, unless evidence has been given that he has a\ngood character, in which case it become relevant.\nExplanation 1.— This Article does not apply to cases in which the bad character of any person\nis itself a fact in issue.\nExplanation 2.—A previous conviction is relevant as evidence of bad character."
    },
    {
      "provision_ref": "sec69",
      "section": "69",
      "title": "Section 69. Character as affecting damages",
      "content": "In civil cases the fact that the character of any person\nis such as to affect the amount of damages which he ought to receive, is relevant.\nExplanation:— In Articles 66, 67, 68 and 69, the word “character” includes both reputation\nand disposition; but, except as provided in Article 68, evidence may be given only of general reputation\nand general disposition, and not of particular acts by which reputation or disposition were shown."
    },
    {
      "provision_ref": "sec70",
      "section": "70",
      "title": "Section 70. Proof of facts by oral evidence",
      "content": "All facts, except the contents of documents, may be\nproved by oral evidence."
    },
    {
      "provision_ref": "sec71",
      "section": "71",
      "title": "Section 71. Oral evidence must be direct",
      "content": "Oral evidence must, in all cases whatever be direct, that\nis to say—\nIf it refers to a fact which could be seen, it must be the evidence of a witness who says he saw\nit;\nIf it refers to a fact which could be heard, it must be the evidence of a witness who says he\nheard it;\nIf it refers to a fact which could be perceived by any other sense or in any other manner, it must\nbe the evidence of a witness who says he perceived it by that sense or in that manner;\nIf it refers to an opinion or to the grounds on which that opinion is held, it must be the evidence\nof the person who holds that opinion on those grounds:\nProvided that the opinions of experts expressed in any treaties commonly offered for sale, and\nthe grounds on which such opinions are held, may be proved by the production of such treaties if the\nauthor is dead, or cannot be found, or has become incapable of giving evidence, or cannot be called as\na witness without an amount of delay or expense which the Court regards as unreasonable:\nProvided further that, if oral evidence refers to the existence or condition of any material thing\nother than a document, the Court may, if it thinks fit, require the production of such material thing for\nits inspection:\nProvided further that, if a witness is dead, or cannot be found or has become incapable of giving\nevidence, or his attendance cannot, be procured without an amount of delay or expense which under\nthe circumstances of the case the Court regards as unreasonable, a party shall have the right to produce,\nshahada ala al-shahadah ‫ شہادہ اال الشہداء‬by which a witness can appoint two witnesses to depose on\nhis behalf, except in the case of Hudood."
    },
    {
      "provision_ref": "sec72",
      "section": "72",
      "title": "Section 72. Proof of contents of documents",
      "content": "The contents of documents may be proved either by\nprimary or by secondary evidence."
    },
    {
      "provision_ref": "sec73",
      "section": "73",
      "title": "Section 73. Primary evidence",
      "content": "“Primary evidence” means the document itself produced for the\ninspection of the Court.\nExplanation 1.—Where a document is executed in several parts, each part is primary evidence\nof the document.\nWhere a document is executed in counterpart, each counterpart being executed by one or some\nof the parties only, each counterpart is primary evidence as against the parties executing it.\nExplanation 2. —Where a number of documents are all made by one uniform process, as in\nthe case of printing, lithography or photography, each is primary evidence of the contents of the rest;\nbut where they are all copies of a common original, they are not primary evidence of the contents of\nthe original.\n1\n[Explanation 3.—A printout or other form of output of an automated information system shall\nnot be denied the status of primary evidence solely for the reason that it was generated, sent, received\nor stored in electronic form if the automated information system was in working order at all material\ntimes and, for the purposes hereof, in the absence of evidence to the contrary, it shall be presumed that\nthe automated information system was in working order at all material times.\nExplanation 4.—A printout or other form of reproduction of an electronic documents, other\nthan a document mentioned in Explanation 3 above, first generated, sent, received or stored in\nelectronic form, shall be treated as primary evidence where a security procedure was applied thereto\nat the time it was generated, sent, received or stored.]\nIllustration\nA person is shown to have been in possession of a number of placards, all printed at one time from\none original. Any one of the placards is primary evidence of the contents of any other, but no one of\nthem is primary evidence of the contents of the original."
    },
    {
      "provision_ref": "sec74",
      "section": "74",
      "title": "Section 74. Secondary evidence",
      "content": "“Secondary evidence” means and includes—\n(1) certified copies given under the provisions hereinafter contained ;\n(2) copies made from the original by mechanical processes which in themselves insure the\naccuracy of the copy, and copies compared with such copies ;\n(3) copies made from or compared with the original;\n(4) counterparts of documents as against the parties who did not execute them ;\n(5) oral accounts of the contents of a document given by some person who has himself seen it.\n1\nAdded “Explanations 3 and 4 in Article 73” by Ord. No. L1 of 2002, s. 29 and schedule.\nIllustrations\n(a)     A photograph of an original is secondary evidence of its contents though the\ntwo have not been compared, if it is proved that the thing photographed was the\noriginal.\n(b)     A copy, compared with a copy of a letter made by a copying machine is\nsecondary evidence of the contents of the letter, if it is shown that the copy made\nby the copying machine was made from the original.\n(c)     A copy transcribed from a copy, but afterwards compared with the original, is\nsecondary evidence; but the copy not so compared is not secondary evidence of\nthe original, although the copy from which it was transcribed was compared\nwith the original.\n(d)     Neither an oral account of a copy compared with the original, nor an oral\naccount of a photograph or machine-copy of the original, is secondary evidence\nof the original."
    },
    {
      "provision_ref": "sec75",
      "section": "75",
      "title": "Section 75. Proof of documents by primary evidence",
      "content": "Documents must be proved by primary\nevidence except in the cases hereinafter mentioned."
    },
    {
      "provision_ref": "sec76",
      "section": "76",
      "title": "Section 76. Cases in which secondary evidence relating to documents may be given",
      "content": "Secondary\nevidence may be given of the existence, condition or contents of a document in the following cases:—\n(a)     when the original is shown or appears to be in the possession or power of the\nperson against whom the document is sought to be proved, or of any person out\nof reach of, or not subject to, the process of the Court, or of any person legally\nbound to produce it, and when, after the notice mentioned in Article 77 such\nperson does not produce it;\n(b)     when the existence, condition or contents of the original have been proved to be\nadmitted in writing by the person against whom it is proved or by his\nrepresentative in interest;\n(c)     when the original has been destroyed or lost, or when the party offering\nevidence of its contents cannot, for any other reason not arising from his own\ndefault or neglect, produce it in reasonable time ;\n(d)     when, due to the volume or bulk of the original, copies thereof have been made\nby means of microfilming or other modern devices ;\n(e)     when the original is of such a nature as not to be easily movable ;\n(f)     when the original is public document within the meaning of Article 85 ;\n(g)     when the original is a document of which a certified copy is permitted by this\nOrder, or by any other law in force in Pakistan, to be given in evidence ;\n(h)     when the originals consist of numerous accounts or other documents which\ncannot conveniently be examined in Court, and the fact to be proved is the\ngeneral result of the whole collection ;\n(i)     when an original document forming part of a judicial record is not available and\nonly a certified copy thereof is available, certified copy of that certified copy\nshall also be admissible as a secondary evidence.\nIn cases (a), (c), (d) and (e), any secondary evidence of the contents of the\ndocument is admissible.\nIn case (b), the written admission is admissible.\nIn case (f) or (g), certified copy of the document, but no other kind of secondary\nevidence, is admissible.\nIn case (h), evidence may be given as to the general result of the documents by\nany person who has examined them, and who is skilled in the examination of\nsuch document."
    },
    {
      "provision_ref": "sec77",
      "section": "77",
      "title": "Section 77. Rules as to notice to produce",
      "content": "Secondary evidence of the contents of the documents\nreferred to in Article 76, paragraph (a), shall not be given unless the party proposing to give such\nsecondary evidence has previously given to the party in whose possession or power the document is,\nor to his advocate, such notice to produce it as is prescribed by Law; and, if no notice is prescribed by\nlaw, then such notice as the Court considers reasonable under the circumstances of the case:\nProvided that such notice shall not be required in order to render secondary evidence admissible\nin any of the following cases, or in any other case in which the Court thinks fit to dispense with it: —\n(1) when the document to be proved is itself a notice ;\n(2) when, from the nature of the case, the adverse party must know that he will be required to\nproduce it;\n(3) when it appears or is proved that the adverse party has obtained possession of the original\nby fraud or force ;\n(4) when the adverse party or his agent has the original in Court ;\n(5) when the adverse party or his agent has admitted the loss of the document ;\n(6) when the person in possession of the document is out of reach of, or not subject to, the\nprocess of the Court."
    },
    {
      "provision_ref": "sec78",
      "section": "78",
      "title": "Section 78. Proof of signature and handwriting of person alleged to have signed or written",
      "content": "document produced.— If a document is alleged to be signed or to have been written wholly or in part\nby any person, the signature or the handwriting of so much of the document as is alleged to be in that\nperson’s handwriting must be proved to be in his handwriting.\n1\n[78-A. Proof of electronic signature and electronic document.— If an electronic document\nis alleged to be signed or to have been generated wholly or in part by any person through the use of an\ninformation system, and where such allegation is denied, the application of a security procedure to the\nsignature or the electronic document must be proved.]"
    },
    {
      "provision_ref": "sec79",
      "section": "79",
      "title": "Section 79. Proof of execution of document required by law to be attested",
      "content": "If a document is\nrequired by law to be attested, it shall not be used as evidence until two attesting witnesses at least\nhave been called for the purpose of proving its execution, if there be two attesting witnesses alive, and\nsubject to the process of the Court and capable of given evidence:\nProvided that it shall not be necessary to call an attesting witness in proof of the execution of\nany document, not being a will, which has been registered in accordance with the provisions of the\nRegistration Act, 1908 (XVI of 1908), unless its execution by the person by whom it purports to have\nbeen executed is specifically denied."
    },
    {
      "provision_ref": "sec80",
      "section": "80",
      "title": "Section 80. Proof where no attesting witness found",
      "content": "If no such attesting witness can be found, it\nmust be proved that the witnesses have either died, or cannot be found and that the document was\nexecuted by the person who purports to have done so."
    },
    {
      "provision_ref": "sec81",
      "section": "81",
      "title": "Section 81. Admission of execution by party to attested document",
      "content": "The admission of a party to\nan attested document of its execution by himself shall be sufficient proof of its execution as against\nhim, though it be a document required by law to be attested."
    },
    {
      "provision_ref": "sec82",
      "section": "82",
      "title": "Section 82. Proof when attesting witness denies the execution",
      "content": "If the attesting witness denies or\ndoes not recollect the execution of the document, its execution may be proved by other evidence."
    },
    {
      "provision_ref": "sec83",
      "section": "83",
      "title": "Section 83. Proof of document not required by law to be attested",
      "content": "An attested document not\nrequired by law to be attested may be proved as if it was unattested."
    },
    {
      "provision_ref": "sec84",
      "section": "84",
      "title": "Section 84. Comparison of signature, writing or seal with others admitted or proved",
      "content": "(1) In order\nto ascertain whether a signature, writing or seal is that of the person by whom it purports to have been\nwritten or made any signature, writing or seal admitted or proved to the satisfaction of the Court to\nhave been written or made by that person may be compared with the one which is to be proved,\nalthough that signature, writing or seal has not been produced or proved for any other purpose.\n(2) The Court may direct any person present in Court to write any words or figures for the\npurpose of enabling the Court to compare the words or figures so written with any words or figures\nalleged to have been written by such person.\n(3) This Article applies also, with any necessary modifications, to finger-impressions."
    },
    {
      "provision_ref": "sec85",
      "section": "85",
      "title": "Section 85. Public documents",
      "content": "The following documents are public documents: —\n(1) documents forming the acts or records of the acts —\n(i)        of the sovereign authority ;\n(ii)       of official bodies and tribunals, and\n1\nIns. new article 78A by Ord. No. L1 of 2002, s. 29 and schedule.\n(iii)      of public officers, legislative, Judicial and executive, of any part of Pakistan, or\nof a foreign country;\n(2) public records kept in Pakistan of private documents;\n(3) documents forming part of the records of judicial proceedings ;\n(4) documents required to be maintained by a public servant under any law ; and\n(5) registered documents the execution whereof is not disputed.\n1\n[(6) certificates deposited in a repository pursuant to the provisions of the Electronic\nTransactions Ordinance, 2002.]"
    },
    {
      "provision_ref": "sec87",
      "section": "87",
      "title": "Section 87. Certified copies of public documents",
      "content": "Every public officer having the custody of a\npublic document, which any person has a right to inspect, shall give that person on demand a copy of\nit on payment of the legal fees therefor, together with a certificate written at the foot of such copy that\nit is a true copy of such document or part thereof, as the case may be, and such certificate shall be\ndated and subscribed by such officer with his name and his official title, and shall be sealed, whenever\nsuch officer is authorized by law to make use of a seal, and such copies so certified shall be called\ncertified copies.\nExplanation.—Any officer, who, by the ordinary course of official duty, is authorized to\ndeliver such copies, shall be deemed to have the custody of such documents within the meaning of this\nArticle."
    },
    {
      "provision_ref": "sec88",
      "section": "88",
      "title": "Section 88. Proof of documents by production of certified Copies",
      "content": "Such certified copies may be\nproduced in proof of the contents of the public documents or parts of the public documents of which\nthey purport to be copies."
    },
    {
      "provision_ref": "sec89",
      "section": "89",
      "title": "Section 89. Proof of other public documents",
      "content": "The following public documents may be proved as\nfollows: —\n(1) Acts, orders or notifications of the Federal Government in any of its departments, or of any\nProvincial Government or any department of any Provincial Government—by the records of the\ndepartments, certified by the heads of those departments respectively, or by any document purporting\nto be printed by order of any such Government;\n(2) the proceedings of the Legislatures,—by the journal of those bodies respectively, or by\npublished Acts or abstracts, or by copies purporting to be printed by order of the Government\nconcerned ;\n(3) the Acts of the Executive or the proceedings of the Legislature of a foreign country,— by\njournals published by their authority, or commonly received in that country as such or by a copy\ncertified under the seal of the country or sovereign, or by a recognition thereof in some Federal Act;\n1\nAdded new “Clause (6) in Article 85” by Ord. No. LI of 2002, s. 29 and schedule.\n(4) the proceedings of a municipal body in Pakistan,—by a copy of such proceedings, certified\nby the legal keeper thereof, or by a printed book purporting to be published by the authority of such\nbody ;\n(5) public documents of any other class in a foreign country,—by the original, or by a copy\ncertified by the legal keeper thereof, with a certificate under the seal of a notary public, or of a Pakistan\nConsul or diplomatic agent, that the copy is duly certified by the officer having the legal custody of\ncountry."
    },
    {
      "provision_ref": "sec90",
      "section": "90",
      "title": "Section 90. Presumption as to genuineness of certified copies",
      "content": "(1) The Court shall presume every\ndocument purporting to be a certificate, certified copy or other document, which is by law declared to\nbe admissible as evidence of any particular fact and which purports to be duly certified by any officer\nof the Federal Government or a Provincial Government to be genuine:\nProvided that such document is substantially in the form and purports to be executed in the\nmanner directed by law in that behalf.\n(2) The Court shall also presume that any officer by whom any such document purports to be\nsigned or certified, held, when he signed it, the official character which he claims in such document."
    },
    {
      "provision_ref": "sec91",
      "section": "91",
      "title": "Section 91. Presumption as to documents produced as record of evidence",
      "content": "Whenever any\ndocument is produced before any Court, purporting to be a record or memorandum of the evidence, or\nof any part of the evidence, given by a witness in a judicial proceeding or before any officer authorized\nby law to take such evidence or to be a statement or confession by any prisoner or accused person,\ntaken in accordance with law, and purporting to be signed by any Judge or Magistrate or by any such\nofficer as aforesaid, the Court shall presume—\nthat the document is genuine; that any statements as to the circumstances under which\nit was taken, purporting to be made by the person signing it, are true, and that such\nevidence, statement or confession was duly taken."
    },
    {
      "provision_ref": "sec92",
      "section": "92",
      "title": "Section 92. Presumption as to genuineness of documents kept under any law",
      "content": "The Court shall\npresume the genuineness of every document purporting to be a document directed by any law to be\nkept by any person, if such document is kept substantially in the form required by law and is produced\nfrom proper custody."
    },
    {
      "provision_ref": "sec93",
      "section": "93",
      "title": "Section 93. Presumptions as to maps or plans made by authority of Government",
      "content": "The Court\nshall presume that map or plans purporting to be made by the authority of the Federal Government or\nany Provincial Government were so made, and are accurate; but maps or plans made for the purposes\nof any cause must be proved to be accurate."
    },
    {
      "provision_ref": "sec94",
      "section": "94",
      "title": "Section 94. Presumption as to collections of laws and reports of decision",
      "content": "The Court shall\npresume the genuineness of every book purporting to be printed or published under the authority of\nthe Government of any country, and to contain any of the laws of that country, and of every book\npurporting to contain reports of decisions of the Courts of such country."
    },
    {
      "provision_ref": "sec95",
      "section": "95",
      "title": "Section 95. Presumption as to powers",
      "content": "of-attorney.— The Court shall presume that every document\npurporting to be a power-of -attorney, and to have been executed before, and authenticated by, a notary\npublic, or any Court, Judge, Magistrate, Pakistan Consul or Vice-Consul, or representative of the\nFederal Government, was so executed and authenticated."
    },
    {
      "provision_ref": "sec96",
      "section": "96",
      "title": "Section 96. Presumption as to certified copies of foreign judicial records",
      "content": "(1) The Court may\npresume that any document purporting to be a certified copy of any judicial record of any country not\nforming part of Pakistan is genuine and accurate, if the document purports to be certified in any manner\nwhich is certified by any representative of the Federal Government in or for such country to be the\nmanner commonly in use in that country for the certification of copies of judicial records.\n(2) An officer who, with respect to any territory or place not forming part of Pakistan, is a\npolitical Agent therefor, as defined in section 3, clause (40), of the General Clauses Act, 1897(X of\n1897), shall for the purposes of clause (1), be deemed to be a representative of the Federal Government\nin or for the country comprising that territory or place."
    },
    {
      "provision_ref": "sec97",
      "section": "97",
      "title": "Section 97. Presumption as to books, maps and charts",
      "content": "The Court may presume that any book to\nwhich it may refer for information on matters of public or general interest, and that any published map\nor chart, the statements of which are relevant facts and which is produced for its inspection, was written\nand published by the person, and at the time and place, by whom or at which it purports to have been\nwritten or published."
    },
    {
      "provision_ref": "sec98",
      "section": "98",
      "title": "Section 98. Presumption as to telegraphic messages",
      "content": "The Court may presume that message,\nforwarded from a telegraph office to the person to whom such message purports to be addressed,\ncorresponds with a message delivered for transmission at the office from which the message purports\nto be sent; but the Court shall not make any presumption as to the person by whom such message was\ndelivered for transmission."
    },
    {
      "provision_ref": "sec99",
      "section": "99",
      "title": "Section 99. Presumption as to due execution, etc., of documents not produced",
      "content": "The Court shall\npresume that every document, called for and not produced after notice to produce, was attested,\nstamped and executed in the manner required by law."
    },
    {
      "provision_ref": "sec100",
      "section": "100",
      "title": "Section 100. Presumption as to documents thirty years old",
      "content": "Where any document, purporting or\nproved to be thirty years old, is produced from any custody which the Court in the particular case\nconsiders proper, the Court may presume that the signature and every other part of such document,\nwhich purports to be in the handwriting of any particular person, is in that person’s handwriting, and,\nin the case of a document executed or attested, that it was duly executed and attested by the persons\nby whom it purports to be executed and attested.\nExplanation.— For the purposes of this Article and Article 92, documents are said to be in\nproper custody if they are in the place in which, and under the care of the person with whom, they\nwould naturally be; but no custody is improper if it is proved to have had a legitimate origin, or if the\ncircumstances of the particular case are such as to render such an origin probable.\nIllustrations\n(a)     A has been in possession of landed property for a long time. He produces from\nhis custody deeds relating to the land, showing his titles to it. The custody is\nproper.\n(b)     A produces deeds relating to landed property of which he is the mortgagee. The\nmortgagor is in possession. The custody is proper.\n(c)     A, a connection of B, produces deeds relating to lands in B’s possession which\nwere deposited with him by B for safe custody. The custody is proper."
    },
    {
      "provision_ref": "sec101",
      "section": "101",
      "title": "Section 101. Certified copies of documents thirty years old",
      "content": "The provisions of Article 100 shall\napply to such copy of a document referred to in that Article as is certified in the manner provided in\nArticle 87 and is not less than thirty years old; and such certified copy may be produced in proof of\nthe contents of the document or part of the document of which it purports to be a copy.\n__________"
    },
    {
      "provision_ref": "sec102",
      "section": "102",
      "title": "Section 102. Evidence of terms of contracts, grants and other disposition of property reduced to",
      "content": "form of document.— When the terms of a contract, or of a grant, or of any other disposition of\nproperty, have been reduced to the form of a document, and in all cases in which any matter is required\nby law to be reduced to the form of a document, no evidence shall be given in proof of the terms of\nsuch contract, grant or other disposition of property, or of such matter, except the document itself, or\nsecondary evidence of its contents in cases in which secondary evidence is admissible under the\nprovisions hereinbefore contained.\nException 1. —When a public officer is required by law to be appointed in writing, and when\nit is shown that any particular person has acted as such officer, the writing by which he is appointed\nneed not be proved.\nException 2.— Wills admitted to probate in Pakistan may be proved by the probate.\nExplanation 1.— This Article applies equally to cases in which the contracts, grants or\ndispositions of property referred to are contained in one document and to cases in which they are\ncontained in more documents than one.\nExplanation 2.—Where there are more originals than one, one original only need be proved.\nExplanation 3.—The statement, in any document whatever, of a fact other than the facts\nreferred to in this Article, shall not preclude the admission of oral evidence as to the same fact.\nIllustrations\n(a)     If a contract be contained in several letters, all the letters in which it is contained\nmust be proved.\n(b)     If a contract is contained in a bill of exchange, the bill of exchange must be\nproved.\n(c)     If a bill of exchange is drawn in a set of three, one only need be proved.\n(d)     A contracts, in writing with B, for the delivery of indigo upon certain terms.\ncontracted for verbally on another occasion.\nOral evidence is offered that no payment was made for the other indigo. The\nevidence is admissible.\n(e)     A gives B a receipt for money paid by B. Oral evidence is offered of the\npayment. The evidence is admissible."
    },
    {
      "provision_ref": "sec103",
      "section": "103",
      "title": "Section 103. Exclusion of evidence of oral agreement",
      "content": "When the terms of any such contract, grant\nor other disposition of property, or any matter required by law to be reduced to the form of a document,\nhave been proved according to the last Article, no evidence of any oral agreement or statement shall\nbe admitted, as between the parties to any such instrument or their representatives in interest, for the\npurpose of contradicting, varying adding to, or subtracting from, its terms :\nProviso (1) .— Any fact may be proved which would invalidate any document, or which would\nentitle any person to any decree or order relating thereto; such as fraud, intimidation, illegality, want\nof due execution, want of capacity in any contracting party, want or failure of consideration, or mistake\nin fact or law.\nProviso (2) . —The existence of any separate oral agreement as to any matter on which a\ndocument is silent, and which is not inconsistent with its terms may be proved. In considering whether\nor not this proviso applies, the Court shall have regard to the degree of formality of the document.\nProviso (3) . —The existence of any separate oral agreement, constituting a condition\nprecedent to the attaching of any obligation under any such contract, grant or disposition of property,\nmay be proved.\nProviso (4) .—The existence of any distinct subsequent oral agreement to rescind or modify\nany such contract, grant, or disposition of property, may be proved, except in cases in which such\ncontract, grant or disposition of property is by law required to be in writing, or has been registered\naccording to the law in force for the time being as to the registration of documents.\nProviso (5) . —Any usage or custom by which incidents not expressly mentioned in any\ncontract are usually annexed to contracts of that description, may be proved:\nProvided that the annexing of such incident would not be repugnant to, or inconsistent with,\nProviso (6) .— Any fact may be proved which shows in what manner the language of a\ndocument is related to existing facts.\nIllustrations\n(a)     A policy of insurance is effected on goods “in ships from Karachi to London”.\nparticular ship was orally excepted from the policy cannot be proved.\n(b)     A agrees absolutely in writing to pay B, Rs. 1,000 on the first March, 1984. The\nfact that, at the same time, an oral agreement was made that the money should\nnot be paid till the thirty-first March cannot be proved.\n(c)     An estate called “the Khanpur estate” is sold by a deed, which contains a map\nof the property sold. The fact that land not included in the map had always been\nregarded as part of the estate and was meant to pass by the deed cannot be\nproved.\n(d)     A enters into a written contract with B to work certain mines, the property of B,\nupon certain terms. A was induced to do so by a misrepresentation of B’s as to\ntheir value. This fact may be proved.\n(e)     A institutes a suit against B for the specific performance of a contract, and also\nprays that the contract may be reformed as to one of its provisions, as that\nprovision was inserted in it by mistake. A may prove that such a mistake was\nmade as would by law entitle him to have the contract reformed.\n(f)     A orders goods of B by a letter in which nothing is said as to the time of\npayment, and accepts the goods on delivery. B sues A for the price. A may show\nthat the goods were supplied on credit for a term still unexpired.\n(g)     A sells B a horse and verbally warrants him sound. A gives B a paper in these\nwords “Bought of A a horse for Rs. 500”. B may prove the verbal warranty.\n(h)     A hires lodging of B, and gives a card on which is written “Rooms, Rs. 200 a\nmonth.” A may prove a verbal agreement that these terms were to include partial\nboard.\nA hires lodgings of B for a year, and regularly stamped agreement, drawn up by\nan advocate, is made between them. It is silent on the subject of board. A may\nnot prove that board was included in the terms verbally.\n(i)     A applies to B for a debt due to A by sending a receipt for the money. B keeps\nthe receipt and does not send the money. In a suit for the amount A may prove\nthis.\n(j)     A and B make a contract in writing to take effect upon the happening of a certain\ncontingency. The writing is left with B, who sues A upon it. A may show the\ncircumstances under which it was delivered."
    },
    {
      "provision_ref": "sec104",
      "section": "104",
      "title": "Section 104. Exclusion of evidence against application of document to existing facts",
      "content": "When\nlanguage used in a document is plain in itself, and when it applied accurately to existing facts, evidence\nmay not be given to show that it was not meant to apply to such facts.\nIllustrations\nA sells to B, by deed, “my estate at Rangpur containing 100 bighas”. A has an estate at Rangpur\ncontaining 100 bighas. Evidence may not be given of the fact that the estate meant to be sold was one\nsituated at a different place and of a different size."
    },
    {
      "provision_ref": "sec105",
      "section": "105",
      "title": "Section 105. Evidence as to document unmeaning in reference to existing facts",
      "content": "When language\nused in a document is plain in itself, but is unmeaning in reference to existing facts, evidence may be\ngiven to show that it was used in a peculiar sense.\nIllustrations\nA sells to B, by deed, “my house in Karachi”.\nA had no house in Karachi, but it appears that he had a house at Keamari, of which B had been\nin possession since the execution of the deed.\nThese facts may be proved to show that the deed related to the house at Keamari."
    },
    {
      "provision_ref": "sec106",
      "section": "106",
      "title": "Section 106. Evidence as to application of language which can apply to one only of several",
      "content": "persons.— When the facts are such that the language used might have been meant to apply to any one,\nand could not have been meant to apply to more than one, of several persons or things, evidence may\nbe given of facts which show which of those persons or things it was intended to apply to.\nIllustrations\n(a)     A agrees to sell to B, for Rs. 1,000, “my white horse”. A has two white horses.\nEvidence may be given of facts which show which of them was meant.\n(b)     A agrees to accompany B to Hyderabad. Evidence may be given of facts\nshowing whether Hyderabad in the Dekkhan or Hyderabad in Sind was meant."
    },
    {
      "provision_ref": "sec107",
      "section": "107",
      "title": "Section 107. Evidence as to application of language to one of two sets of facts to neither of which",
      "content": "the whole correctly applies.— When the language used applies partly to one set of existing facts, and\npartly to another set of existing facts, but the whole of it does not apply correctly to either, evidence\nmay be given to show to which of the two it was meant to apply.\nIllustrations\nA agrees to sell to B “my land at X in the occupation of Y”. A has land at X, but not in the\noccupation of Y, and he has land in the occupation of Y, but it is not at X. Evidence may be given of\nfacts showing which he meant to sell."
    },
    {
      "provision_ref": "sec108",
      "section": "108",
      "title": "Section 108. Evidence as to meaning of illegible characters, etc",
      "content": "Evidence may be given to show\nand provincial expressions, of abbreviations and of words used in a peculiar sense.\nIllustrations\nA, a sculptor, agrees to sell to B, “All may mods.”\nA has both models and modelling tools. Evidence may be given to show which he meant to\nsell."
    },
    {
      "provision_ref": "sec109",
      "section": "109",
      "title": "Section 109. Who may give evidence of agreement varying terms of document",
      "content": "Persons who are\nnot parties to a document, or their representatives in interest, may give evidence of any facts tending\nto show a contemporaneous agreement varying the terms of the document.\nIllustrations\nA and B make a contract in writing that B shall sell A certain cotton, to be paid for on delivery.\nAt the same time they make an oral agreement that three months’ credit shall be given to A. This could\nnot be shown as between A and B, but it might be shown by C, if it affected his interest."
    },
    {
      "provision_ref": "sec110",
      "section": "110",
      "title": "Section 110. Saving of provisions of Succession Act relating to wills",
      "content": "Nothing in this Chapter\ncontained shall be taken to affect any of the provisions of the Succession Act, 1925 (XXXIX of 1925),\nas to the construction of wills.\n___________"
    },
    {
      "provision_ref": "sec111",
      "section": "111",
      "title": "Section 111. Fact judicially noticeable need not be proved",
      "content": "No fact of which the Court will take\njudicial notice need be proved."
    },
    {
      "provision_ref": "sec112",
      "section": "112",
      "title": "Section 112. Facts of which Court must take judicial notice",
      "content": "(1) The Court shall take judicial notice\nof the following facts: —\n(a)     All-Pakistan laws;\n(b)     Articles of War for the Armed Forces;\n(c)     The course of proceeding of the Central Legislature and any Legislature\nestablished under any law for the time being in force in Pakistan;\n(d)     The seals of all the Courts in Pakistan and of all Courts out of Pakistan\nestablished by the authority of the Federal Government or the Government\nrepresentative, the seals of Courts of Admiralty and Maritime Jurisdiction and\nof Notaries Public and all seals which any person is authorised to use by any\nAct or Regulation having the force of law in Pakistan ;\n(e)     The accession to office, names, titles, functions and signatures of the persons\nfilling for the time being any public office in Pakistan, if the fact of their\nappointment to such office is notified in the official Gazette;\n(f)     The existence, title and national flag of every State or Sovereign recognised by\nthe Federal Government;\n(g)        The divisions of time, the geographical divisions of the world, and public\nfestivals, fasts and holidays notified in the official Gazette;\n(h)        The territories under the dominion of Pakistan;\n(i)        The commencement, continuance and termination of hostilities between\nPakistan and any other State or body of persons;\n(j)        The names of the members and officers of the Court and of their deputies and\nsubordinate officers and assistants, and also of all officers acting in execution\nof its process, and of all advocates and other persons authorized by law to appear\nor act before it;\n(k)        The rule of the road on land or at sea.\n(2) In all cases referred to in clause (1), and also on all matters of public history, literature,\nscience or art, the Court may resort for its aid to appropriate books or documents of reference.\n(3) If the Court is called upon by any person to take judicial notice of any fact, it may refuse to\ndo so unless and until such person produces any such book or document as it may consider necessary\nto enable it to do so."
    },
    {
      "provision_ref": "sec113",
      "section": "113",
      "title": "Section 113. Facts admitted need not be proved",
      "content": "No fact need be proved in any proceeding which\nthe parties thereto or their agents agree to admit at the hearing, or which, before the hearing, they agree\nto admit by any writing under their hands, or which by any 1[rule of pleading] in force at the time they\nare deemed to have admitted by their pleadings:\nProvided that the Court may, in its discretion, require the facts admitted to be proved otherwise\nthan by such admissions."
    },
    {
      "provision_ref": "sec114",
      "section": "114",
      "title": "Section 114. Estoppel",
      "content": "When one person has, by his declaration, act or omission, intentionally\ncaused or permitted another person to believe a thing to be true and to act upon such belief, neither he\nnor his representative shall be allowed, in any suit or proceeding between himself and such person or\nhis representative, to deny the truth of that thing.\nIllustration\nA intentionally and falsely leads B to believe that certain land belongs to A, and thereby induces\nB to buy and pay for it.\nThe land afterwards becomes the property of A, and A seeks to set aside the sale on the ground\nthat, at the time of the sale, he had no title. He must not be allowed to prove his want of title."
    },
    {
      "provision_ref": "sec115",
      "section": "115",
      "title": "Section 115. Estoppel of tenant and of licensee of person in possession",
      "content": "No tenant of immovable\nproperty, or person claiming through such tenant, shall, during the continuance of the tenancy, be\npermitted to deny that the landlord of such tenant had, at the beginning of the tenancy, a title to such\nimmovable property; and no person who came upon any immovable property by the license of the\nperson in possession thereof shall be permitted to deny that such person had a title to such possession\nat the time when such license was given.\n1\nSubs. by Act No. XLI of 2025, s.2."
    },
    {
      "provision_ref": "sec116",
      "section": "116",
      "title": "Section 116. Estoppel of acceptor of bill of exchange bailee or licensee",
      "content": "No acceptor of a bill of\nexchange shall be permitted to deny that the drawer had authority to draw such bill or to endorse it;\nnor shall any bailee or licensee be permitted to deny that his bailor or licenser had, at the time when\nthe bailment or license commenced, authority to make such bailment or grant such license.\nExplanation 1.—The acceptor of a bill of exchange may deny that the bill was really drawn by\nthe person by whom it purports to have been drawn.\nExplanation 2.— If a bailee delivers the goods bailed to a person other than the bailor, he may\nprove that such person had a right to them as against the bailor."
    },
    {
      "provision_ref": "sec117",
      "section": "117",
      "title": "Section 117. Burden of proof",
      "content": "(1) Whoever desires any Court to give judgment as to any legal right\nor liability dependent on the existence of facts which he asserts, must prove that those facts exist.\n(2) When a person is bound to prove the existence of any fact, it is said that the burden of proof\nlies on that person.\nIllustrations\n(a)     A desires a Court to give judgment that B shall be punished for a crime which\nA says B has committed.\nA must prove that B has committed the crime.\n(b)     A desires a Court to give judgment that he is entitled to certain land in the\npossession of B by reason of facts which he asserts, and which B denies to be\ntrue.\nA must prove the existence of those facts."
    },
    {
      "provision_ref": "sec118",
      "section": "118",
      "title": "Section 118. On whom burden of proof lies",
      "content": "The burden of proof in a suit or proceeding lies on\nthat person who would fail if no evidence at all were given on either side.\nIllustrations\n(a)     A sues B for land of which B is in possession, and which, as A asserts, was left\nto A by the will of C, B’s father.\nIf no evidence were given on either side, B would be entitled to retain his\npossession.\nTherefore the burden of proof is on A.\n(b)    A sues B for money due on a bond.\nThe execution of the bond is admitted, but B says that it was obtained by fraud,\nwhich A denies.\nlf no evidence were given on either side, A would succeed as the bond is not\ndisputed and the fraud is not proved.\nTherefore the burden of proof is on B."
    },
    {
      "provision_ref": "sec119",
      "section": "119",
      "title": "Section 119. Burden of proof as to particular fact",
      "content": "The burden of proof as to any particular fact\nlies on that person who wishes the Court to believe in its existence, unless it is provided by any law\nthat the proof of that fact shall lie on any particular person.\nIllustrations\n(a)    A prosecutes B for theft, and wishes the Court to believe that B admitted the\ntheft, to C. A must prove the admission.\n(b)    B wishes the Court to believe that, at the time in question, he was elsewhere.\nHe must prove it."
    },
    {
      "provision_ref": "sec120",
      "section": "120",
      "title": "Section 120. Burden of proving fact to be proved to make evidence admissible",
      "content": "The burden of\nproving any fact necessary to be proved in order to enable any person to give evidence of any other\nfact is on the person who wishes to give such evidence.\nIllustrations\n(a)    A wishes to prove a dying declaration by B. A must prove B’s death.\n(b)    A wishes to prove, by secondary evidence, the contents of a lost document.\nA must prove that the document has been lost."
    },
    {
      "provision_ref": "sec121",
      "section": "121",
      "title": "Section 121. Burden of proving that case of accused comes within exceptions",
      "content": "When a person is\naccused of any offence the burden of proving the existence of circumstances bringing the case within\nany of the General Exceptions in the Pakistan Penal Code (Act XLV of 1860), or within any special\nexception or proviso contained in any other part of the same Code, or in any law defining the offence,\nis upon him, and the Court shall presume the absence of such circumstances.\nIllustrations\n(a)    A accused of murder, alleges that by reason of unsoundness of mind, he did not\nknow the nature of the act.\nThe burden of proof is on A.\n(b)    A, accused of murder, alleges that, by grave and sudden provocation, he was\ndeprived of the power of self-control.\nThe burden of proof is on A.\n(c)     Section 325 of the Pakistan Penal Code (Act XLV of 1860) ,provides that\nwhoever, except in the case provided for by section 335, voluntarily causes\ngrievous hurt, shall be subject to certain punishments.\nA is charged with voluntarily causing grievous hurt under section 325.\nThe burden of proving the circumstances bringing the case under section 335\nlies on A."
    },
    {
      "provision_ref": "sec122",
      "section": "122",
      "title": "Section 122. Burden of proving fact especially within knowledge",
      "content": "When any fact is especially\nwithin the knowledge of any person, the burden of proving that fact is upon him.\nIllustrations\n(a)     When a person does an act with some intention other than that which the\ncharacter and circumstances of the act suggest, the burden of proving that\nintention is upon him.\n(b)     A is charged with travelling on a railway without a ticket. The burden of proving\nthat he had a ticket is on him."
    },
    {
      "provision_ref": "sec123",
      "section": "123",
      "title": "Section 123. Burden of proving death of person known to have been alive within thirty years",
      "content": "Subject to Article 124, when the question is whether a man is alive or dead, and it is shown that he\nwas alive within thirty years, the burden of proving that he is dead is on the person who affirms it."
    },
    {
      "provision_ref": "sec124",
      "section": "124",
      "title": "Section 124. Burden of proving that person is alive who has not been heard of for seven years",
      "content": "When the question is whether a man is alive or dead, and it is proved that he has not been heard of for\nseven years by those who would naturally have heard of him if he had been alive, the burden of proving\nthat he is alive is shifted to the person who affirms it."
    },
    {
      "provision_ref": "sec125",
      "section": "125",
      "title": "Section 125. Burden of proof as to relationship in the cases of partners, landlord and tenant,",
      "content": "principal and agent.— When the question is whether persons are partners, landlord and tenant, or\nprincipal and agent, and it has been shown that they have been acting as such, the burden of proving\nthat they do not stand, or have ceased to stand, to each other in those relationships respectively, is on\nthe person who affirms it."
    },
    {
      "provision_ref": "sec126",
      "section": "126",
      "title": "Section 126. Burden of proof as to ownership",
      "content": "When the question is whether any person is owner\nof anything of which he is shown to be in possession, the burden of proving that he is not the owner is\non the person who affirms that he is not the owner."
    },
    {
      "provision_ref": "sec127",
      "section": "127",
      "title": "Section 127. Proof of good faith in transactions where one party is in relation of active",
      "content": "confidence.— When there is a question as to the good faith of a transaction between parties, one of\nwhom stands to the other in a position of active confidence, the burden of proving the good faith of\nIllustrations\n(a)     The good faith of a sale by a client to an advocate is in question in a suit brought\nby the client. The burden of proving the good faith of the transaction is on the\nadvocate.\n(b)     The good faith of a sale by a son just come of age to a father is in question in a\nsuit brought by the son. The burden of proving the good faith of the transaction\nis on the father."
    },
    {
      "provision_ref": "sec128",
      "section": "128",
      "title": "Section 128. Birth during marriage conclusive proof of legitimacy",
      "content": "(1) The fact that any person\nwas born during the continuance of a valid marriage between his mother and any man and not earlier\nthan the expiration of six lunar months from the date of the marriage, or within two years after its\ndissolution, the mother remaining unmarried, shall be conclusive proof that he is the legitimate child\nof that man, unless—\n(a)     the husband had refused, or refuses, to own the child ; or\n(b)     the child was born after the expiration of six lunar months from the date on\nwhich the woman had accepted that the period of iddat had come to an end.\n(2) Nothing contained in clause (1) shall apply to a non-Muslim if it is inconsistent with his\nfaith."
    },
    {
      "provision_ref": "sec129",
      "section": "129",
      "title": "Section 129. Court may presume existence of certain facts",
      "content": "The Court may presume the existence\nof any fact which it thinks likely to have happened, regard being had to the common course of natural\nevents, human conduct and public and private business, in their relation to the facts of the particular\ncase.\nIllustrations\nThe Court may presume—\n(a)     that a man who is in possession of stolen goods soon after the theft is either the\nthief or has received the goods knowing them to be stolen, unless he can account\nfor his possession ;\n(b)     that an accomplice is unworthy of credit, unless he is corroborated in material\nparticulars ;\n(c)     that a bill of exchange, accepted or endorsed, was accepted or endorsed for good\nconsideration ;\n(d)     that a thing or state of things which has been shown to be in existence within a\nperiod shorter than that within which such things or states of things usually\ncease to exist, is still in existence ;\n(e)     that judicial and official acts have been regularly performed ;\n(f)     that the common course of business has been followed in particular cases;\n(g)     that evidence which could be and is not produced would, if produced, be\nunfavourable to the person who withholds it ;\n(h)     that, if a man refuses to answer a question which he is not compelled to answer\nby law, the answer, if given, would be unfavourable to him;\n(i)     that when a document creating an obligation is in the hands of the obligor, the\nobligation has been discharged.\nBut the Court shall also have regard to such facts as the following, in considering whether such\nmaxims do or do not apply to the particular case before it;\nas to illustration (a).—a shopkeeper has in his till marked rupee soon after it was stolen, and\ncannot account for its possession specifically, but is continually receiving rupees in the course\nof his business;\nas to illustration (b).—A, person of the highest character, is tried for causing a man’s death by\nan act of negligence in arranging certain machinery, B, a person of equally good character, who\nalso took part in the arrangement, describes precisely what was done, and admits and explains\nthe common carelessness of A and himself ;\nas to illustration (b).—a crime is committed by several persons. A, B and C, three of the\ncriminals, are captured on the shop and kept apart from each other. Each gives an account of\nthe crime implicating D, and the accounts corroborate each other in such a manner as to render\nprevious concert highly improbable;\nas to illustration (c).—A, the drawer of a bill of exchange, was a man of business. B, the\nacceptor, was a young and ignorant person, completely under A’s influence;\nas to illustration (d).— It is proved that a river ran in a certain course five years ago, but it is\nknown that there have been floods since that time which might change its course ;\nas to illustration (e).—a judicial act, the regularity of which is in question, was performed under\nexceptional circumstances ;\nas to illustration (f).—the question is, whether a letter was received. It is shown to have been\nposted, but the usual course of the post was Interrupted by disturbances;\nas to illustration (g).—a man refuses to produce a document which would bear on a contract\nof small importance on which he is sued, but which might also injure the feelings and reputation\nof his family;\nas to illustration (h). —a man refuses to answer a question which he is not compelled by law\nto answer, but the answer to it might cause loss to him in matters unconnected with the matter\nin relation to which it is asked ;\nas to illustration (i).— a bond is in possession of the obligor, but the circumstances of the case\nare such that he may have stolen it."
    },
    {
      "provision_ref": "sec130",
      "section": "130",
      "title": "Section 130. Order of production and examination of witnesses",
      "content": "The order in which witnesses are\nproduced and examined shall be regulated by the law and practice for the time being relating to civil\nand criminal procedure respectively, and, in the absence of any such law, by the discretion of the Court."
    },
    {
      "provision_ref": "sec131",
      "section": "131",
      "title": "Section 131. Judge to decide as to admissibility of evidence",
      "content": "(1) When either party proposes to give\nevidence of any fact, the Judge may ask the party proposing to give the evidence in what manner the\nalleged fact, if proved, would be relevant, and the Judge shall admit the evidence if he thinks that the\nfact, if proved, would be relevant and not otherwise.\n(2) If the fact proposed to be proved is one of which evidence is admissible only upon proof of\nsome other fact, such last-mentioned fact must be proved before evidence is given of the fact first-\nmentioned, unless the party undertakes to give proof of such fact, and the Court is satisfied with such\nundertaking.\n(3) If the relevancy of one alleged fact depends upon another alleged fact being first proved,\nfact is proved, or require evidence to be given of the second fact before evidence is given of the first\nfact.\nIllustrations\n(a)     It is proposed to prove a statement about a relevant fact by a person alleged to\nbe dead, which statement is relevant under Article 46.\nthe statement, before evidence is given of the statement.\n(b)     It is proposed to prove, by a copy, the contents of a document said to be lost.\nproduce the copy, before the copy is produced.\n(c)     A is accused of receiving stolen property knowing it to have been stolen.\nIt is proposed to prove that he denied the possession of the property.\nThe relevancy of the denial depends on the identity of the property. The Court\nmay, in its discretion, either require the property to be identified before the\ndenial of the possession is proved or permit the denial of possession to be proved\nbefore the property is identified.\n(d)     It is proposed to prove a fact (A) which is said to have been the cause or effect\nof a fact- in-issue. There are several intermediate facts (B, C and D) which must\nbe shown to exist before the fact (A) can be regarded as the cause or effect of\nis proved, or may require proof of B, C and D before permitting proof of A."
    },
    {
      "provision_ref": "sec132",
      "section": "132",
      "title": "Section 132. Examination",
      "content": "in-chief, etc.—(1) The examination of a witness by the party who calls him\nshall be called his examination-in-chief.\n(2) The examination of a witness by the adverse party shall be called his cross-examination.\n(3) The examination of a witness, subsequent to the cross-examination by the party who called\nhim, shall be called his re-examination."
    },
    {
      "provision_ref": "sec133",
      "section": "133",
      "title": "Section 133. Order of examinations",
      "content": "(1) Witnesses shall be first examined-in-chief, then (if the\nadverse party so desires) cross-examined, then (if the party calling him so desires) re-examined.\n(2) The examination and cross-examination must relate to relevant facts but the cross-\nexamination need not be confined to the facts to which the witness testified on his examination-in-\nchief.\n(3) The re-examination shall be directed to the explanation of matters referred to in cross-\nexamination; and, if new matter is, by permission of the Court, introduced in re-examination, the\nadverse party may further cross-examine that matter."
    },
    {
      "provision_ref": "sec134",
      "section": "134",
      "title": "Section 134. Cross",
      "content": "examination of person called to produce a document.— A person summoned to\nproduce a document does not become a witness by the mere fact that he produces it and cannot be\ncross-examined unless and until he is called as a witness."
    },
    {
      "provision_ref": "sec135",
      "section": "135",
      "title": "Section 135. Witnesses to character",
      "content": "Witnesses to character may be cross-examined and re-\nexamined."
    },
    {
      "provision_ref": "sec136",
      "section": "136",
      "title": "Section 136. Leading questions",
      "content": "Any question suggesting the answer which the person putting it\nwishes or expects to receive is called a leading question."
    },
    {
      "provision_ref": "sec137",
      "section": "137",
      "title": "Section 137. When leading questions must not be asked",
      "content": "(1) Leading questions must not, if\nobjected to by the adverse party, be asked in an examination-in-chief, or in a re-examination, except\nwith the permission of the Court.\n(2) The Court shall permit leading questions as to matters which are introductory or undisputed,\nor which have, in its opinion, been already sufficiently proved."
    },
    {
      "provision_ref": "sec138",
      "section": "138",
      "title": "Section 138. When leading questions may be asked",
      "content": "Leading questions may be asked in\ncross-examination."
    },
    {
      "provision_ref": "sec139",
      "section": "139",
      "title": "Section 139. Evidence as to matters in writing",
      "content": "Any witness may be asked, whilst under\nexamination, whether any contract, grant or other disposition of property, as to which he is giving\nevidence, was not contained in a document, and if he says that it was, or if he is about to make any\nstatement as to the contents of any document, which, in the opinion of the Court, ought to be produced,\nthe adverse party may object to such evidence being given until such document is produced, or until\nfacts have been proved which entitle the party who called the witness to give secondary evidence of\nit.\nExplanation.— A witness may give oral evidence of statements made by other persons about the\ncontents of documents if such statements are in themselves relevant facts.\nIllustration\nThe question is, whether A assaulted B.\nC deposes that he heard A say to D—“B wrote a letter accusing me of theft, and I will be\nrevenged on him”. This statement is relevant, as showing A’s motive for the assault, and evidence may\nbe given of it, though no other evidence is given about the letter."
    },
    {
      "provision_ref": "sec140",
      "section": "140",
      "title": "Section 140. Cross",
      "content": "examination as to previous statements in writing.— A witness may be cross-\nexamined as to previous statements made by him in writing or reduced into writing, and relevant to\nmatters in question, without such writing being shown to him, or being proved; but, if it is intended to\ncontradict him by the writing, his attention must, before the writing can be proved, be called to those\nparts of it which are to be used for the purpose of contradicting him."
    },
    {
      "provision_ref": "sec141",
      "section": "141",
      "title": "Section 141. Questions lawful in cross",
      "content": "examination.— When a witness is cross-examined, he may,\nin addition to the questions hereinbefore referred to, be asked any questions which tend—\n(1) to test his veracity,\n(2) to discover who he is and what is his position in life, or\n(3) to shake his credit, by injuring his character, although the answer to such questions might\ntend directly or indirectly to criminate him or might expose or tend directly or indirectly to expose him\nto a penalty or forfeiture."
    },
    {
      "provision_ref": "sec142",
      "section": "142",
      "title": "Section 142. When witness to be compelled to answer",
      "content": "If any such question relates to a matter\nrelevant to the suit or proceeding, the provisions of Article 15 shall apply thereto."
    },
    {
      "provision_ref": "sec143",
      "section": "143",
      "title": "Section 143. Court to decide when question shall be asked and when witness compelled to",
      "content": "answer.— If any such question relates to a matter not relevant to the suit or proceeding, except in so\nfar as it affects the credit of the witness by injuring his character, the Court shall decide whether or not\nthe witness shall be compelled to answer it, and may, if it thinks fit, warn the witness that he is not\nobliged to answer it. In exercising its discretion, the Court shall have regard to the following\nconsiderations:—\n(1) such questions are proper if they are of such a nature that the truth of the imputation\nconveyed by them would seriously effect the opinion of the Court as to the credibility of the witness\non the matter to which he testifies ;\n(2) such questions are improper if the imputation which they convey relates to matters so\nremote in time, or of such a character, that the truth of the imputation would not affect, or would affect\nin slight degree, the opinion of the Court as to the credibility of the witness on the matter to which he\ntestifies;\n(3) such questions are improper if there is a great disproportion between the importance of the\nimportation made against the witness’s character and the importance of his evidence;\n(4) the Court may, if it sees fit, draw, from the witness’s refusal to answer, the inference that\nthe answer if given would be unfavourable."
    },
    {
      "provision_ref": "sec144",
      "section": "144",
      "title": "Section 144. Question not to be asked without reasonable grounds",
      "content": "No such question as is\nreferred to in Article 143 ought to be asked, unless the person asking it has reasonable grounds for\nthinking that the imputation which it conveys is well founded.\nIllustrations\n(a)     An advocate is instructed by an attorney that an important witness is a dakait.\nThis is a reasonable ground for asking the witness whether he is a dakait.\n(b)     An advocate is informed by a person in Court that an important witness is a\ndakait. The informant, on being questioned by the advocate, given satisfactory\nreasons for his statement. This is a reasonable ground for asking the witness\nwhether he is a dakait.\n(c)     A witness, of whom nothing whatever is known, is asked at random whether he\nis a dakait. There are here no reasonable grounds for the question.\n(d)     A witness, of whom nothing whatever is known, being questioned as to his\nmode of life and means of living, gives unsatisfactory answers. This may be a\nreasonable ground for asking him if he is a dakait."
    },
    {
      "provision_ref": "sec145",
      "section": "145",
      "title": "Section 145. Procedure of Court in case of question being asked without reasonable grounds",
      "content": "If the Court is of opinion that any such question was asked without reasonable grounds, it may, if it\nwas asked by any advocate, report the circumstances of the case to the High Court or other authority\nto which such advocate is subject in the exercise of his profession."
    },
    {
      "provision_ref": "sec146",
      "section": "146",
      "title": "Section 146. Indecent and scandalous question",
      "content": "The Court may forbid any question or inquiries\nwhich it regards as indecent or scandalous, although such questions or inquiries may have some\nbearing on the questions before the Court, unless they relate to facts in issue, or to matters necessary\nto be known in order to determine whether or not the facts in issue existed."
    },
    {
      "provision_ref": "sec147",
      "section": "147",
      "title": "Section 147. Procedure of Court in cases of defamation, libel and slander",
      "content": "When a person is\nprosecuted or sued for making or publishing an imputation of a defamatory, libellous or slanderous\nnature, the Court shall not, before it has recorded its findings on the issues whether such person did\nmake or publish such imputation, and whether such imputation is true, permit any question to be put\nto any witness for the purpose of injuring the character of the person in respect of whom such\nimputation has, or is alleged to have, been made, or any other person, whether dead or alive, in whom\nhe is interested, except in so far as any such question may be necessary for the purpose of determining\nthe truth of the imputations alleged to have been made or published."
    },
    {
      "provision_ref": "sec148",
      "section": "148",
      "title": "Section 148. Questions intended to insult or annoy",
      "content": "The Court shall forbid any question which\nappears to it to be intended to insult or annoy, or which, though proper in itself, appears to the Court\nneedlessly offensive in form."
    },
    {
      "provision_ref": "sec149",
      "section": "149",
      "title": "Section 149. Exclusion of evidence to contradict answers to questions testing veracity",
      "content": "When a\nwitness has been asked and has answered any question which is relevant to the inquiry only in so far\nas it tends to shake his credit by injuring his character, no evidence shall be given to contradict him;\nbut, if he answers falsely, he may afterwards be charged with giving false evidence.\nException 1.—If a witness is asked whether he has been previously convicted of any crime\ndenies it, evidence may be given of his previous conviction.\nException 2.—If a witness is asked any question tending to impeach his impartiality and\nanswers it by denying the facts suggested, he may be contradicted.\nIllustrations\n(a)     A claim against an underwriter is resisted on the ground of fraud.\nfraudulent claim. He denies it.\nEvidence is offered to show that he did make such a claim. The evidence is\ninadmissible.\n(b)        A witness is asked whether he was not dismissed from a situation for dishonesty.\nHe denies it.\nEvidence is offered to show that he was dismissed for dishonesty.\nThe evidence is not admissible.\n(c)        A affirms that on a certain day he saw B at Lahore.\nA is asked whether he himself was not on that day at Faisalabad. He denies it.\nEvidence is offered to show that A was on that day at Faisalabad.\ncredit, but as contradicting the alleged fact that B was seen on the day in\nquestion in Lahore.\nIn each of these cases the witness might, if his denial was false, be charged with\ngiving false evidence.\n(d)        A is asked whether his family has not had a bloodfeud with the family of B\nagainst whom he gives evidence.\nHe denies it. He may be contradicted on the ground that the question tends to\nimpeach his impartiality."
    },
    {
      "provision_ref": "sec150",
      "section": "150",
      "title": "Section 150. Question by party to his own witness",
      "content": "The Court may, in its discretion, permit the\nperson who calls a witness to put any questions to him which might be put in cross-examination by\nthe adverse party."
    },
    {
      "provision_ref": "sec151",
      "section": "151",
      "title": "Section 151. Impeaching credit of witness",
      "content": "The credit of a witness may be impeached in the\nfollowing ways by the adverse party, or, with the consent of the Court, by the party who calls him:\n(1) by the evidence of persons who testify that they, from their knowledge of the witness,\nbelieve him to be unworthy of credit;\n(2) by proof that the witness has been bribed, or has accepted the offer of a bribe, or has\nreceived any other corrupt inducement to give his evidence ;\n(3) by proof of former statements inconsistent with any part of his evidence which is liable to\nbe contradicted ;\n1\n[*        *           *         *          *          *          *]\n1\nOmitted clause (4) of Article 151, by Act No. XLIV of 2016, s. 16.\nExplanation.—A witness declaring another witness to be unworthy of credit may not, upon his\nexamination-in-chief, give reasons for his belief, but he may be asked his reasons in cross-\nexamination, and the answers which he gives cannot be contradicted, though, if they are false, he may\nafterwards be charged with giving false evidence.\nIllustrations\n(a)     A sues B for the price of goods sold and delivered to B. C says that A delivered\nthe goods to B.\nEvidence is offered to show that, on a previous occasion, he said that he had not\ndelivered the goods to B.\nThe evidence is admissible.\n(b)     A is indicted for the murder of B.\nC says that B, when dying, declared that A had given B the wound of which he\ndied.\nEvidence is offered to show that, on a previous occasion, C said that the wound\nwas not given by A or in his presence.\nThe evidence is admissible."
    },
    {
      "provision_ref": "sec152",
      "section": "152",
      "title": "Section 152. Questions tending to corroborate evidence of relevant fact admissible",
      "content": "When a\nwitness whom it is intended to corroborate gives evidence of any relevant fact, he may be questioned\nas to any other circumstances which he observed at or near to the time or place at which such relevant\nfact occurred if the Court is of opinion that such circumstances, if proved, would corroborate the\ntestimony of the witness as to the relevant fact which he testifies.\nIllustration\nA, an accomplice, gives an account of robbery in which he took part. He describes various\nincidents unconnected with the robbery which occurred on his way to and from the place where it was\ncommitted.\nIndependent evidence of these facts may be given in order to corroborate his evidence as to the\nrobbery itself."
    },
    {
      "provision_ref": "sec153",
      "section": "153",
      "title": "Section 153. Former statements of witness may be proved to corroborate later testimony as to",
      "content": "same fact.— In order to corroborate the testimony of a witness, any former statement made by such\nwitness relating to the same fact at or about the time when the fact took place, or before any authority\nlegally competent to investigate the facts, may be proved."
    },
    {
      "provision_ref": "sec154",
      "section": "154",
      "title": "Section 154. What matters may be proved in connection with proved statement relevant under",
      "content": "Article 46 or 47.— Whenever any statement, relevant under Article 46 or 47, is proved, all matters\nmay be proved either in order to contradict or corroborate it, or in order to impeach or confirm the\ncredit of the person by whom it was made, which might have been proved if that person had been\ncalled as a witness and had denied upon cross-examination the truth of the matter suggested."
    },
    {
      "provision_ref": "sec155",
      "section": "155",
      "title": "Section 155. Refreshing memory",
      "content": "(1) A witness may, while under examination, refresh his memory\nby referring to any writing made by himself at the time of the transaction concerning which he is\nquestioned, or so soon afterwards that the Court considers it likely that the transaction was at that time\nfresh in his memory.\n(2) The witness may also refer to any such writing made by any other person, and read by the\nwitness within the time aforesaid, if when he read it he knew it to be correct.\n(3) Whenever a witness may refresh his memory by reference to any document, he may, with\nthe permission of the Court, refer to a copy of such document:\nProvided the Court be satisfied that there is sufficient reason for the non-production of the\noriginal.\n(4) An expert may refresh his memory by reference to professional treaties."
    },
    {
      "provision_ref": "sec156",
      "section": "156",
      "title": "Section 156. Testimony to facts stated in document mentioned in Article 155",
      "content": "A witness may\nalso testify to facts mentioned in any such document as is mentioned in Article 155, although he has\nno specific recollection of the facts themselves, if he is sure that the facts were correctly recorded in\nthe document.\nIllustration\nA book-keeper may testify to facts recorded by him in books regularly kept in the course of\nbusiness, if he knows that the books were correctly kept, although he has forgotten the particular\ntransactions entered."
    },
    {
      "provision_ref": "sec157",
      "section": "157",
      "title": "Section 157. Right of adverse party as to writing used to refresh memory",
      "content": "Any writing referred\nto under the provisions of the two last preceding Articles must be produced and shown to the adverse\nparty if he requires it, such party may, if he pleases, cross-examine the witness thereupon."
    },
    {
      "provision_ref": "sec158",
      "section": "158",
      "title": "Section 158. Production of documents",
      "content": "(1) A witness summoned to produce a document shall, if it\nis in his possession or power, bring it to Court, notwithstanding any objection which there may be to\nits production or to its admissibility. The validity of any objection shall be decided on by the Court.\n(2) The court, if it sees fit, may Inspect the document, unless it refers to matters of State, or\ntake other evidence to enable it to determine on its admissibility.\n(3) If for such a purpose it is necessary to cause any document to be translated, the Court may,\nif it thinks fit, direct the translator to keep the contents secret, unless the document is to be given in\nevidence; and, if the translator disobeys such direction, he shall be held to have committed an offence\nunder section 166 of the Pakistan Penal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec159",
      "section": "159",
      "title": "Section 159. Giving, as evidence, of document called for and produced on notice",
      "content": "When a party\ncalls for a document which he has given the other party notice to produce, and such document is\nproduced and inspected by the party calling for its production, he is bound to give it as evidence if the\nparty producing it requires him to do so."
    },
    {
      "provision_ref": "sec160",
      "section": "160",
      "title": "Section 160. Using, as evidence, of document production of which was refused on notice",
      "content": "When\na party refuses to produce a document which he has had notice to produce, he cannot afterwards use\nthe document as evidence without the consent of the other party or the order of the Court.\nIllustration\nA sues B on an agreement and gives B notice to produce it. At the trial A calls for the document\nand B refuses to produce it. A gives secondary evidence of its contents. B seeks to produce the\ndocument itself to contradict the secondary evidence given by A, or in order to show that the agreement\nis not stamped. He cannot do so."
    },
    {
      "provision_ref": "sec161",
      "section": "161",
      "title": "Section 161. Judge’s power to put questions or order production",
      "content": "The Judge may, in order to\ndiscover or to obtain proper proof of relevant facts, ask any question he pleases, in any form, at any\ntime, of any witness, or of the parties about any fact relevant or irrelevant; and may order the\nproduction of any document or thing; and neither the parties nor their agents shall be entitled to make\nany objection to any such question or order, nor, without the leave of the Court, to cross-examine any\nwitness upon any answer given in reply to any such question:\nProvided that the judgment must be based upon facts declared by this Order to be relevant, and\nduly proved:\nProvided also that this Article shall not authorise any Judge to compel any witness to answer\nany question or to produce any document which such witness would be entitled to refuse to answer or\nproduce under Articles 4 to 14, both inclusive, if the question were asked or the document were called\nfor by the adverse party; nor shall the judge ask any question which it would be improper for any other\nperson to ask under Article 143 or 144; nor shall he dispense with primary evidence of any document,\nexcept in the cases hereinbefore excepted.\n_________"
    },
    {
      "provision_ref": "sec162",
      "section": "162",
      "title": "Section 162. No new trial for improper admission or rejection of evidence",
      "content": "The improper\nadmission or rejection of evidence shall not be ground of itself for a new trial or reversal of any\ndecision in any case, if it shall appear to the Court before which such objection is raised that,\nindependent of the evidence objected to and admitted, there was sufficient evidence to justify the\ndecision, or that, if the rejected evidence had been received, it ought not to have varied the decision.\n__________"
    },
    {
      "provision_ref": "sec163",
      "section": "163",
      "title": "Section 163. Acceptance or denial of claim on oath",
      "content": "(1) When the plaintiff takes oath in support of\nhis claim, the Court shall, on the application of the plaintiff, call upon the defendant to deny the claim\non oath.\n(2) The Court may pass such orders as to costs and other matters as it may deem fit.\n(3) Nothing in this Article applies to laws relating to the enforcement of Hudood or other\ncriminal cases.\n___________\n1[164. Production of evidence that has become available because of modern devices or\ninformation system etc.— Depending on the nature of case and circumstances, the Court may, if\ndeem appropriate, allow to be produced any evidence or witnesses recorded by the Court through the\nmodern devices or techniques including video call, viber, skype, imo, whatsapp, facebook messenger,\nline caller and video conference, etc.]"
    },
    {
      "provision_ref": "sec165",
      "section": "165",
      "title": "Section 165. Order to override other laws",
      "content": "The provisions of this Order shall have effect\nnotwithstanding anything contained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec166",
      "section": "166",
      "title": "Section 166. Repeal",
      "content": "The Evidence Act, 1872 (I of 1872), is hereby repealed.\n______________\nRGN Dated. 08-01-2026\n1\nSubs. by the XXXVII of 2023, s.12."
    }
  ],
  "definitions": []
}
