{
  "id": "pk-quaid-e-azam-s-mazar-protection-and-maintenance-ordinance-1971",
  "type": "statute",
  "title": "Quaid-e-Azam's Mazar (Protection and Maintenance) Ordinance, 1971",
  "title_en": "Quaid-e-Azam's Mazar (Protection and Maintenance) Ordinance, 1971",
  "short_name": "QMAMO",
  "status": "in_force",
  "issued_date": "1971-10-13",
  "in_force_date": "1971-10-13",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npbps%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Quaid-e-Azam's Mazar (Protection and Maintenance) Ordinance, 1971 (XXVII of 1971) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Penalty, etc",
      "content": "The Schedule\n1\nTHE QUAID-I-AZAM’S MAZAR (PROTECTION AND MAINTENANCE)\nORDINANCE, 1971\nORDINANCE NO. XXVII of 1971\n[14th October, 1971]\nAn Ordinance to provide for the protection and maintenance of the Quaid-i-Azam’s Mazar.\nWHEREAS it is expedient to provide for the protection and maintenance of the Quaid- i-\nAzam’s Mazar and for the prevention of acts derogatory to the sanctity thereof;\nNOW, THEREFORE in pursuance of the Proclamation of the 25th day of March, 1969, read\nwith the Provisional Constitution Order, and in exercise of all powers enabling him in that behalf,\nthe President is pleased to make and promulgate the following Ordinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Ordinance may be called the Quaid-i- Azam’s\nMazar (Protection and Maintenance) Ordinance, 1971.\n(2) It shall come into force at once.\n2\n[2. Definitions.— In this Ordinance, unless there is anything repugnant in the subject or\ncontext,—\n(a)   “Peripheral Area” means the land admeasuring seventy-one acres\nor thereabout sitrated outside the grilled boundary wall referred to in clause\n(b), as described in the plan set out in the Schedule; and\n(b)   “Quaid-i-Azam’s Mazar” means the Quaid-i-Azam’s Mazar at Karachi and the\nplots of land and structures appurtenant thereto admeasuring sixty-one acres or\nthereabout surrounded by a grilled boundary wall]."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Declaration of Mazar as historical monument. It is hereby declared that the",
      "content": "Quaid-i-Azam’s Mazar is an historical monument of national importance."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Mazar to vest in Federal Government. Notwithstanding anything contained in any",
      "content": "other law for the time being in force or in any trust deed or other instrument, the Quaid-i- Azam’s\nMazar 3[and the Peripheral Area] shall vest in the 4[Federal Government]."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Maintenance of Mazar",
      "content": "(1) The Quaid-i-Azam’s Mazar 3[and the Peripheral Area]\nshall, on and from such date as the 4[Federal Government] may, by notification in the official\nGazette, specify in this behalf, be maintained 3 [, and the affair relating thereto shall be managed,]\nby such person, or body or authority as may be specified in the notification, in\naccordance with such general or special instructions as the 4[Federal Government] may issue from\ntime to time.\n(2) All expenditure on the maintenance of the Quaid-i-Azam’s Mazar shall be met from\nout of the Quaid-i-Azam’s Mazar Fund which shall consist of—\n(a)   the balance in the Quaid-i-Azam’s Memorial Fund in existence immediately\nbefore the commencement of this Ordinance which shall upon such\ncommencement be transferred to that Fund;\n(b)   such donations or grants as the 4 [Federal Government] may make to it from\ntime to time;\n1Validated by the Validation of Laws Act, I975 (63 of 1975), s. 2 and Sch., .\n2Subs, by the Quaid-i-Azam’s Mazar (Protection and Maintenance) (Amdt.) Act, 1976 (46 of 1976), s. 2 for section 2.\n3Ins.ibid., ss. 3 and 4.\n4Sub by F.A.O., 1975 (P.O.No 4 of 1975), Art. 2and Table, for “Central Government”.\n(c)       such contributions or donations as may be made to it by any person;\n(d)        any income derived from any property belonging to, or forming part of, the\nQuaid-i-Azam’s Mazar or from any investment of moneys in the Fund 1[; and]\n2\n[(e) any income, profit of gain realised, accrued or derived from the Peripheral\nArea and any property thereon vesting in the Federal Government.]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Meetings, etc. prohibited. No person shall organise, convene or take part in any meeting",
      "content": "or demonstration or procession or engage in political activity of any kind within the Quaid-i-Azam’s\nMazar or within a distance of ten feet from the outer boundary thereof."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Entry into Mazar with weapon, etc. No person shall enter the Quaid",
      "content": "i-Azam’s Mazar\nwith any weapon, instrument or other article which can be used as a weapon of offence or for\ncausing injury or damage to any person or property."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Sanctity of Mazar. No person shall do any act or behave in any manner which is or",
      "content": "tends to be derogatory to the sanctity and dignity of the Quaid-i-Azam’s Mazar."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Causing damage to Mazar. No person shall, except for carrying out any repair or",
      "content": "improvement in the Quaid-i-Azam’s Mazar under property, authority, destroy, damage, alter, injure,\ndeface or multilate the Quaid-i-Azam’s Mazar or any part thereof or scribble, write, or engrave any\ninscription or sign on any part of the Mazar."
    }
  ],
  "definitions": []
}
