{
  "id": "pk-railway-regulatory-authority-ordinance-2002",
  "type": "statute",
  "title": "Railway Regulatory Authority Ordinance, 2002",
  "title_en": "Railway Regulatory Authority Ordinance, 2002",
  "short_name": "RRAO",
  "status": "in_force",
  "issued_date": "2002-10-25",
  "in_force_date": "2002-10-25",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FtbZk%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Railway Regulatory Authority Ordinance, 2002 (XCII of 2002) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Removal of difficulties",
      "content": "(See subsection (3) of section 1)\n(See section 44)\nORDINANCE NO. XCII OF 2002\n[26, October, 2002]\nAn Ordinance to provide for the Establishment of the Railway Regulatory Authority\nWHEREAS it is expedient to foster competition, encourage and facilitate private sector\ninvestment and participation in the development and operation of passenger and goods trains on the\nRailway network, protect the public interest while respecting individual rights and provide effective\nand efficient regulations and for matters connected therewith or incidental thereto;\nAND WHEREAS the President is satisfied that circumstances exist which render it\nnecessary to take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day\nof October, 1999, and the Provisional Constitution Order No. 1 of 1999, read with the Provisional\nConstitution (Amendment) Order No.9 of 1999, and in exercise of all powers enabling him in that\nbehalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the\nfollowing Ordinance:―\n_____________"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Ordinance may be called the Railway\nRegulatory Authority Ordinance, 2002.\n(2) It extends to whole of Pakistan.\n(3) It shall, other than the provisions referred to in the First Schedule, come into force at once.\nThe provisions of the First Schedule shall come into force together or separately on such date\nor dates as the Federal Government may, on the advice of Authority, by order in the official Gazette\nappoint."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.― In this Ordinance, unless there is anything repugnant in the subject or",
      "content": "context,___\n(a)     “accident” means an abnormal happening whether involving a train or not\nwhich results in the disruption or likely disruption of the running of a rolling\nstock, whether attended or not with loss of human lives or serious injury to\nproperty or persons;\n(b)     “Act” means the Railways Act, 1890 (Act IX of 1890);\n(c)     “Authority” means the- Railway Regulatory Authority established under\nsection 3;\n(d)   “Chairman” means the Chairman of the authority and includes the Vice-\nChairman when acting in substitution thereof;\n(e)   “decision” means an order, determination, direction or decision of the authority\nmade pursuant to this Ordinance, rules or regulations, and “decide” shall mean\nthe action taken by the Authority to arrive at such decision;\n(f)   “emergency” means any situation, which requires the adoption of extraordinary\nmeasures by the Federal Government to ensure the continuity of the railway\nservices;\n(g)   “goods” include in animate thing of every kind .and shall be construed\nas synonymous with the terms cargo, consignment, articles and substances;\n(h)   “integrated license” means a license which includes obligations on the licensee\nto maintain, improve or upgrade railway infrastructure in terms of the relevant\nlicense;\n(i)   “license” means, in relation to a licensed section, the grant by the Authority of\nexclusive or non-exclusive operating rights for the carriage of passengers and\ngoods by railway includes integrated licenses;\n(j)   “licensed section” means the section of railway identified in the license within\nthe boundaries of which railway services may be offered by a licensee on an\nexclusive or non-exclusive basis;\n(k)   “licensee” means a person in whose favour a license is granted or deemed to\nhave been granted, by the Authority;\n(l)   “license fee” means a fee to be paid by the licensee to the Authority in\naccordance with the rules;\n(m)   “Member” means a Member of the Authority, including the Chairman;\n(n)   “policy guidelines” means policies of the Federal Government covering or\nrelated to any or all of the regulated activities which are issued in writing\npursuant to a decision of the Cabinet of the Federal Government or any\ncommittee thereof;\n(o)   “prescribed” means prescribed by rules made under this Ordinance;\n(p)   “person” includes any individual or any legal entity including any partnership,\nfirm, company, joint venture, trust or corporation;\n(q)   “railway” has the same meaning as assigned to it under the Act and includes\nrailway infrastructure;\n(r)   “railway administration” in the case of railway administered and operated by\nthe Federal Government, means the manager of the railway and includes\nthe Federal Government;\n(s)    “railway employee” means any person engaged by a licensee for the purpose of\nworking the railway;\n(t)    “railway infrastructure” means:\n(i)     all the land within the fences or other boundary marks indicating the\nlimits of the land appurtenant to a railway;\n(ii)    all lines of rails, sidings or branches worked over for the purposes of, or\nin connection with, a railway;\n(iii)   all stations, offices, warehouses, wharves, workshops, factories,\nfixed plant and machinery and other works constructed for the\npurposes of, or in connection with, a railway;\n(iv)    water supply, sewerage, drainage, electrical, sui gas, signal and\ntelecommunication services and installations used for the purpose\nof the railway whether these belong to or are hired or worked by a\nlicensee;\n(v)     residential colonies, dwelling houses, barracks, running rooms, rest\nhouses or any other structure used for the residence;\n(vi)    the railway network; and\n(vii)   all moveable and immovable property in relation to the foregoing;\n(u)    “railway infrastructure fund” means 'a fund established by the railway\nadministration consisting of track access charges, applied to the\nmaintenance and upgradation of the railway infrastructure in accordance with\npriorities determined by the Authority;\n(v)    “railway services” means services offered by a licensee in terms of the license\nor otherwise;\n(w)    “railway network” means the entire lines of rails, branches and sidings\nin Pakistan;\n(x)    “rate” means as defined in the Act;\n(y)    “regulated activity” means any activity that is within the powers and functions\nof the Authority;\n(z)    “regulations” means the regulations made under this Ordinance;\n(za)   “rolling stock” includes locomotives, tenders, railcars, diesel or electric\nmultiple units, coaches, passenger carriages, wagons, goods, cars, trucks,\ncranes, track machinery, track recording and inspection cars, and trolleys;\n(zb)   “rules” means the rules made under this Ordinance;\n(zc)   “terminal” means as defined in the Act;\n(zd)    “track access agreement” means an agreement between the railway\nadministration in its capacity as the railway infrastructure owner and a licensee\nfor access to railway Infrastructure, such agreement being based on the model\ntrack access agreement prepared and published by the Authority following\ndiscussions with the railway administration; and\n(ze)    “track access charge” means the amount, set out in the track access agreement,\nto be paid by a licensee to the railway administration for access to railway\ninfrastructure.\n___________\nCHAPTER – II"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of Railway Regulatory Authority.―(1) As soon as may be, but not later",
      "content": "than two months after the commencement of this Ordinance, the Federal Government shall, by\nnotification in the official Gazette, establish a regulatory authority, which shall be known as the\n“Railway Regulatory Authority”.\n(2) Subject to the provisions of this Ordinance, the Authority shall be independent in the\nperformance of its functions. The Authority shall be a body corporate, having perpetual succession\nand a common seal with powers to acquire and hold property, both moveable and immovable, and to\nsue and be sued by its name.\n(3) The Authority shall consist of a Chairman and three Members, out of whom one shall be\ndesignated as Member Technical, one as Member Licensing and one as Member Finance.\n(4) The Chairman shall be an eminent person of known integrity and competence with a\nminimum of twenty-five years of experience in business, engineering, management or Railways. The\nChairman should also be well versed in licensing procedures and regulatory matters.\n(5) The Member Technical shall be a person who holds an appropriate degree in the relevant\nfield and is an experienced and eminent professional of known integrity and competence with a\nminimum twenty years of related professional experience in the maintenance of railway infrastructure,\nits safety and strategic planning and dealing with accidents.\n(6) The Member Licensing shall be a person who holds an appropriate degree in the relevant\nfield and is an experienced and eminent professional of known integrity and competence with a\nminimum of twenty years of relevant professional experience in the field of railway engineering,\nrailway operations, transport engineering or transport economics.\n(7) The Member Finance shall be a person who holds an appropriate degree in the relevant\nfield, experienced, eminent professional of known integrity and competence with a minimum of\ntwenty years of related experience in the field of corporate financing or accounting.\n(8) Subject to sub-section (9),―\n(a)     the Chairman shall be appointed, by the Federal Government for an initial term\nof five years and shall be eligible for reappointment for a similar term;\n(b)     the Member Licensing shall be appointed by the Federal Government for\nan initial term of four years and shall be eligible for reappointment for a term\nof five years;\n(c)     the Member Technical shall be appointed by the Federal Government for an\ninitial term of three years and shall be eligible for reappointment for a term of\nfive years; and\n(d)     the Member Finance shall be appointed by the Federal Government for an initial\nterm of two years and shall be eligible for reappointment for a similar term.\n(9) The Chairman and other Members shall retire on attaining the age of sixty-five years.\n(10) In case of a vacancy occurring due to the death, resignation, retirement or removal\nof any Member, the Federal Government shall appoint another qualified person within a period\nnot exceeding three months from the date the vacancy occurred.\n(11) Any Member may resign from his office by writing under his hand addressed to the\nFederal Government. The Federal Government may remove a Member from his office if, on an inquiry\nby the Federal Public Service Commission, he is found unable to perform the functions of his office\ndue to mental or physical disability or to have committed misconduct.\n(12) Any Member may serve a maximum of two terms.\n(13) The Federal Government shall designate one of the Members as Vice-Chairman, who\nshall act as Chairman at any time during which the Chairman for any reason is incapable of exercising\nshall exercise the powers and perform the duties imposed on the Chairman by this Ordinance."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Meetings of the Authority",
      "content": "(1) The Chairman and two other Members shall constitute\na quorum for a meeting of the Authority requiring a decision by the Authority.\n(2) The decisions of the Authority shall be taken by the majority of its Members and in case of\na tie, the Member presiding shall have an additional vote.\n(3) All decisions of the Authority shall be in writing and shall identify the decision of the\nChairman and other members separately.\n(4) No act, proceeding or decision of the Authority shall be invalid by reason only of the\nexistence of a vacancy or defect in, the constitution of the Authority.\n(5) The Chairman shall call all meetings of the Authority. The Chairman shall also call\nmeetings of the Authority immediately on being requested in writing to do so by another Member of\nthe Authority.\n(6) Each Member shall have reasonable notice of the time, place and matter on which a decision\nshall be taken."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Remuneration and conflict of interest",
      "content": "_(1) The Members shall be paid such remuneration\nand allowances and shall be entitled to such privileges and facilities for their respective terms of office\nas may be determined by the Federal Government in advance of their appointment which shall not be\nvaried to their disadvantage during their term in office.\n(2) No person shall be appointed by the Federal Government as a Member if such person has\nany direct or indirect financial interest in, or has any connection which might reasonably be viewed as\ngiving rise to a conflict of interest with, any person involved in any regulated activity. No person\nappointed as a Member shall during his term in office have or maintain any direct or indirect financial\ninterest in any person involved in any regulated activity. Members shall not at any time during their\nterm of office engage themselves in any other services, business, vocation or employment with, any\nother person.\n(3) No Member shall take part in any decision, if such Member is in any way, whether directly\nor indirectly, concerned or interested in the decision, nor shall such Member's presence count for the\npurpose of forming a quorum at the time of any such decision.\n(4) Every Member who knowingly contravenes any of the provisions of subsections (2) and\n(3) shall, on inquiry by the Federal Public Service Commission, be guilty of misconduct.\n(5) Subject to subsection (6), it shall not be lawful for any Member, for so long as he holds\noffice and for a period of two years thereafter, to seek or hold any office or employment nor to\nacquire or purchase (whether in his name or otherwise) any interest in any corporation,\npartnership, trust, firm or company carrying on,―\n(a)    business in any regulated activity; or\n(b)    the business of providing professional or advisory services to any person\nundertaking any regulated activity.\n(6) A Member may, before the expiration of two years after he has ceased to hold that office,\nenter into the employment of or accept any professional or advisory relationship with any\ncorporation, partnership, trust, or company, carrying on business in any phase of a regulated activity,\nprovided he has obtained written approval of the Federal Government which shall not be unduly\ndenied.\n(7) A Member shall not be in contravention of subsections (2) and (3), if he is receiving\nany pension benefits, while serving the Authority, due to him from a prior employment with any\nperson."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Recruitment of employees",
      "content": "(1) The Authority may; from time to time, employ officers,\nmembers of its staff, experts, consultants, advisors, and other employees on such terms and conditions,\nas it may deem fit.\n(2) The Authority shall make regulations for appointment, promotion, termination and other\nterms and conditions of employment of persons employed under subsection (1)."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Chairman, Members, employees, experts, consultants and advisers not to be civil",
      "content": "servants.― The Chairman, Members, employees of the Authority or experts, consultants or advisers\nemployed by the Authority shall be governed by the terms and conditions of their appointment and\nshall not be deemed to be civil servants within the meaning of the Civil Servants Act, 1973 (Act LXXI\nof 1973)."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Chairman, etc., to be public servants",
      "content": "_ The Chairman, members, employees, experts,\nconsultants and advisers of the Authority shall, when acting or purporting to act in pursuance of any\nof the provisions of this Ordinance or the rules or regulations be deemed to be public servants within"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. General powers and functions of the Authority.― (1) In addition to such other powers",
      "content": "and functions as may be imposed on it or transferred under or by virtue of this Ordinance, the Authority\nshall be exclusively responsible for granting licences and for the carrying out of regulated activities\nand regulating such activities.\n(2) Without prejudice to the generality of the foregoing, the Authority shall, __\n(a)     promote and protect the interests of railway users through fair competition;\n(b)     promote the provision of efficient and competitive railway services;\n(c)     approve the terms of track access agreements;\n(d)     ensure that the terms and conditions of licenses are being strictly complied with\nby the licensees;\n(e)     approve the railway infrastructure usage plan (time-tabling) to be submitted by\nthe railway administration keeping due margins for maintenance and\nrehabilitation works;\n(f)     carry out periodic inspections of the railway infrastructure for ensuring safety\nof train operations;\n(g)     in the case of a license that is not an integrated license, in consultation with the\nrailway administration, carry out strategic planning for improvement,\nupgradation and modernization of the railway infrastructure for implementation\nby railway administration and monitoring the progress thereof;\n(h)     in the case of an integrated licence, in consultation with the railway\nadministration, carry out strategic planning for improvement, upgradation and\nmodernization of the railway infrastructure for implementation by the licensee\nand monitoring the progress thereof;\n(i)     determine the limitation of employment, of railway employees to ensure the\nsafe running of trains;\n(j)     subject to section 13, determine rates;\n(k)     approve terminals;\n(l)     recommend to the Federal Government, any or all measures necessary for\nenhancing the role of the railway in the national transportation;\n(m)     prescribe technical standards for the railway infrastructure and the rolling stock\nand for the testing thereof;\n(n)     review the parameters of the rolling stock and approve the same or direct such\nmodifications as may be necessary from a safety point of view;\n(o)    resolve disputes between parties to track access agreements and disputes\nbetween licensees;\n(p)    subject to section 40, make rules;\n(q)    subject to section 41, make regulations;\n(r)    prescribe a uniform form of accounts and accounting practices to be complied\nwith by licensees;\n(s)    sanction the opening or re-opening of a section of the railway network after\nascertaining the fulfilment of prescribed pre-conditions;\n(t)    direct the closing of a section of the railway network or the discontinuation of\na particular rolling stock or restoration of the same;\n(u)    sanction the use of any rolling stock on the railway network after ascertaining\ntheir suitability and conformance to the prescribed standards;\n(v)    make such periodic or other inspections of the railway network or of any\nrolling- stock used thereon as it may deem necessary;\n(w)    require licensees to furnish, on a periodical basis, not less than one year,\noperating and financial results and such other information as may be necessary;\n(x)    prescribe fines for contravention of the provisions of this Ordinance, rules,\nregulations, decisions and terms and conditions of a license;\n(y)    make inquiry into the cause of any accident on a railway;\n(z)    by an order in writing require the attendance before the Authority of any person\nand to require answers or returns to such inquiries as the Authority thinks fit;\n(za)   where the Authority deems it appropriate, obtain loans, grants and make\ninvestments;\n(zb)   where the Authority deems it appropriate, form and hold interests in companies\nfor the purpose of facilitating the performance of any power and functions as\nmay be imposed on it or transferred under or by, virtue of this Ordinance; and\n(zc)   perform any other function or exercise power as may be incidental or\nconsequential to the performance of any of its functions or the exercise of any\nof its powers.\n(3) The Authority shall impose and collect such fees and other charges in respect of its\nfunctions as may be determined, from time to time, by the Authority in accordance with the rules."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Delegation of powers.― The Authority may, by general or special order, delegate to any",
      "content": "officer of the Authority the power to exercise on behalf of the Authority any of its powers, duties or\nfunctions under this Ordinance subject to such conditions as it may think fit to impose:\nProvided that the powers of the Authority to grant licenses and to issue orders pursuant\nto section 22, shall only be exercised in a meeting of the Authority.\n___________"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Exclusive power to grant licenses.___The Authority shall have the exclusive",
      "content": "power, to be\nexercised in the manner prescribed in the rules, to,\n(a)    determine the licensed section; and\n(b)    grant, issue, renew, extend, modify, amend, transfer, suspend review, cancel\nand reissue, revoke or terminate, a license.\n(2) The Authority shall from time to time designate as eligible for provision under a license\nsuch services for the carriage of passengers and goods by railway as it may consider appropriate."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Bidding for license",
      "content": "_ The person in whose favour a license is to be granted shall be\nselected by the Authority following a transparent and competitive bidding process carried out by the\nAuthority in accordance with the rules."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Rates and approved discount schemes",
      "content": "(1) A license may include provision with respect\nto rates to be charged for railway services.\n(2) The Authority shall ensure that in the case of a licensee enjoying a monopolistic position,\nthe license contains such provisions necessary for the purpose of securing that any rates which are to\nbe charged are, in the opinion of the Authority, reasonable in all the circumstances of the case."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. General terms and conditions of licenses",
      "content": "(1) A license may include such conditions\nas appear to the Authority to be requisite or expedient having regard to the powers and functions\nimposed on or transferred to the Authority under or by virtue of this Ordinance.\n(2) Without prejudice to the generality of subsection (1), a license may provide for. __\n(a)    the rendering to the Authority by the licensee of payments of such amounts and\nat such intervals as may be specified in, or determined by or under, the license;\nor\n(b)    the payment, from the railway infrastructure fund, to the licensee of such\namounts and at such intervals as may be specified in, or determined by or under,\nthe license.\n(3) All licensees shall pay to the Authority a license fee."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Failure to secure subsequent license",
      "content": "In any case where,―\n(a)    a license is terminated or comes to an end; and\n(b)     no further license has been entered into in respect of the railway services\nformerly provided under that license, the Authority shall have the power to\nsecure .the operation of those railway services until such time as it again begins\nto be operated under or by virtue of a license."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Railway administration as deemed licensee.―The railway administration shall be",
      "content": "deemed to have been granted by the Authority, on a non-exclusive basis, licenses on terms and\nconditions to be notified from time to time, by the Authority, in relation to all licensed sections unless\na license provides otherwise."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Transfer and assignments of licenses.―(1) No license shall be transferred or assigned",
      "content": "without the consent in writing of the Authority. The Authority may consent or refuse the transfer or\nassignment of a license.\n(2) Any consent under subsection (1) may be subject to such conditions, restrictions and\nstipulations as the Authority thinks fit to impose, which may include conditions modifying, or\nrequiring or otherwise providing for the making of modifications to, the conditions of the license.\n(3) An application for the Transfer or assignment of a license shall be submitted to the\nAuthority on the prescribed form and in accordance with the regulations.\n(4) An application under subsection (3) shall be accompanied by the prescribed fee, if any.\n(5) A transfer or assignment of a license shall have no effect until the Authority has consented\nto such transfer or assignment.\n___________"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Directions by the Authority.― (1) The Authority may, on application of a, licensee,",
      "content": "give directions to the railway administration requiring it to enter into a track access agreement, but no\nsuch directions shall be given if and to the extent that,-\n(a)     performance of the track access agreement, if entered into, would involve the\nrailway administration in being in breach of a track access agreement; or\n(b)     as a result of an obligation or duty owed by the railway administration which\narose before the coming into force of this Ordinance, the consent of some other\nperson is required by the railway administration before entering into the track\naccess agreement"
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Approval of track access agreements.―The railway administration shall not enter into",
      "content": "a track access agreement unless it does so pursuant to directions issued under section 18 and such\ntrack access agreement has been approved by the Authority."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Amendments to track access agreements",
      "content": "(1) Any amendment, or purported\namendment, of a track access agreement shall be void unless the amendment has been approved\nby the Authority.\n(2) Subject to subsection (1), the Authority shall have the power to direct or otherwise require\namendments to be made to a track access agreement.\n___________"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Facilities to be afforded to the Authority.―The licensees shall afford to the Authority",
      "content": "all reasonable facilities for performing the duties and exercising the powers imposed and conferred\nupon it under or by virtue of this Ordinance."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Securing compliance with decisions etc.―(1) Where the licensee is contravening or",
      "content": "likely to contravene any decision, the Authority shall make such order as is requisite for the purpose\nof securing compliance with that decision, including but not limited to an order terminating the\nlicensee's license or appointing one or ~nore competent persons to manage the affairs of the licensee\nfor purposes of ensuring compliance with the Authority's order.\n(2) Before making any order under subsection (1), the Authority shall give notice to the person\nagainst whom the order may be directed,-\n(a)    stating that it proposes to make the order and setting out its effects;\n(b)    setting out the acts or omissions which constitute or would constitute\ncontraventions of the decision;\n(c)    setting out any other facts which justify the making of the order; and.\n(d)    specifying the period within which representations or objections with respect to\nthe proposed order may be made, and shall consider any such representations\nor objections which are duly made and not withdrawn.\n(3) Any person appointed by the Authority pursuant to subsection (I) shall not be liable for\nany loss or damages caused by any act or omission where such act or omission occurs in the\nperformance of his duties.\n___________"
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Emergency",
      "content": "In the event of any emergency, the Federal Government may, by an order\nin writing issued by a Federal Secretary, require the Authority and Authority shall thereby be\nempowered to issue directions to any licensee to provide specified number of train services or suspend\nthe same, provided that appropriate compensation shall be paid to the respective licensee by the\nFederal Government through the Authority."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Keeping of registers.―The Authority shall, at such premises and in such form as it may",
      "content": "determine, maintain a register or registers setting out therein,-\n(a)    every licence;\n(b)    every track.access agreement, and\n(c)    every amendment or modification made to a license or track access agreement."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Submission of yearly report, returns, etc",
      "content": "_The Authority shall submit to the Federal\nGovernment, and publish, as soon as possible after the end of every financial year but before the last\nday of December the next following year,-\n(a)    a report on the conduct of its affairs for that financial year, including anticipated\ndevelopments for the following financial year; and\n(b)    a report on the railway industry in Pakistan, insofar as it relates to regulated\nactivities, identifying the ownership, operation, management, control,\nefficiency and cost of regulated activities and other matters related to regulated\nactivities.\n__________"
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Budget and accounts.―(1) The Authority, in respect of each financial year, shall prepare",
      "content": "its own budget in accordance with prescribed procedures and shall maintain complete and accurate\nbooks of accounts of its actual expenses and receipts, and of the Railway Regulatory Authority Fund.\n(2) The accounts of the Authority shall be audited annually by the Auditor-General of Pakistan\nand one or more auditors who are chartered accountants within the meaning of the Chartered\nAccountants Ordinance, 1961 (Ordinance X of 1961); appointed by the Authority in consultation with\nthe Auditor-General of Pakistan."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Railway Regulatory Authority Fund",
      "content": "_(1) There shall be a fund to be known as the\n“Railway Regulatory Authority Fund” which shall vest in the Authority and shall be utilized by the\nAuthority, to meet its expenses and charges properly incurred in connection with the carrying out of\nits functions and duties imposed or transferred to it under or by virtue of this Ordinance, including\nwithout limitation the payment of salaries and other remuneration to the Chairman, Members,\nemployees, experts, consultants and advisors of the Authority.\n(2) The Railway Regulatory Authority Fund shall consist of:\n(a)    seed money of rupees fifty millions by the Federal Government;\n(b)    charges and fees including license fees assessed and collected by the Authority\nto recover the reasonable costs of regulated activities under this Ordinance;\n(c)     fines and other penalties imposed and collected by the Authority as\nspecified under this Ordinance;\n(d)     proceeds received by the Authority from the sale of data, publications,\nreports,maps, and other information;\n(e)     loans obtained by the Authority, with the prior written approval of the Federal\nGovernment; and\n(f)     proceeds of any investments made by the Authority in utilising any amounts of\nthe Railway Regulatory Authority Fund which are not required for immediate\nuse.\n___________"
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Powers of the Federal Government to issue policy guidelines.",
      "content": "_(1) The Federal\nGovernment may, as and when it considers necessary, issue policy guidelines to the Authority on\nmatters of policy not inconsistent with the provisions of this Ordinance or the rules. The Authority\nshall comply with the policy guidelines in the exercise of its powers and functions and in making\ndecisions.\n(2) Without prejudice to the generality of the foregoing, the Federal Government may issue\npolicy guidelines in relation to,-\n(a)     defence traffic. to be carried over the railway network;\n(b)     restriction on the grant of licenses on considerations of national security; and\n(c)     continuation of a minimum number of passenger and goods services on certain\nsections of the railway on socio-economic considerations provided that the\nFederal Government will pay appropriate compensation through the\nAuthority for running such unremunerative trains to the licensee.\n___________"
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Offences",
      "content": "_ (1) Any person who,___\n(a)     undertakes any regulated activity in contravention of this Ordinance, rule,\nregulation or terms of a license;\n(b)     prevents or obstructs the smooth and efficient running of trains;\n(c)     prevents, obstructs or interferes with the working of the Authority or any of its\nemployees;\n(d)     commits mischief;\n(e)     damages, removes, interferes or tampers with any rolling stock, railway infra\nstructure, or installation; .\n(f)     other than railways employee or a another person authorised in this behalf by a\nlicensee, opens any gate or chain or barrier set up on either side of a level\ncrossing, which is closed for the time being to road traffic;\n(g)     breaks any gate or chain or barrier set up on either side of a level crossing;\n(h)     is driving a vehicle fails to stop when required to do so or take due care when\ncrossing a level crossing;\n(i)     crosses a railway network at place other than a manned or unmanned\nlevel crossing;\n(j)     sells articles of whatsoever description on any train without the prior\nwritten consent of the relevant licensee;\n(k)     assaults or intentionally obstructs a licensee from carrying out its\nobligations under a license;\n(l)     endangers the safety of any person,-\n(i)     by contravening any provision of this Ordinance or any rule or\nregulation notified hereunder; or\n(ii)    by contravening or not complying with any decision;\n(m)     provides any information, recorded or documents to the Authority pursuant to\na decision of the Authority or otherwise, which information, record or document\nis false to the knowledge of the person providing the same;\n(n)     intentionally obstructs an officer of the Authority in exercise of his functions or\npowers under this Ordinance in relation to the inspection of any equipment or\nany premises or' enquiry into the causes of an accident; and\n(o)     aids, abets, counsels, conspires, incites or attempts the commission or omission\nof any offences referred to in clauses (a) to (n) above, shall be guilty of an\noffence under this Ordinance and shall be punishable with imprisonment which\nmay extend to five years or a fine of rupees twenty thousand or with both.\n(2) If a licensee fails to comply with any provision of this Ordinance, it shall pay the Authority\na sum of rupees, twenty thousand and in case of continued default, rupees one thousand for every day\nthe default continues.\n(3) If a licensee refuses or neglects to comply with any decision of the Authority, it shall pay\nthe Authority a sum of rupees twenty thousand and in case of continued default, rupees one thousand\nfor every day the default continues.\n(4) No Court shall take cognizance of any offence punishable under subsection (1) except on\na complaint filed in writing by an officer authorised by the Authority.\n(5) Where the accused is a company incorporated or registered under the Companies\nOrdinance, 1984 (Ordinance XLVII of 1984), every director, chief executive and officer of such\ncompany who knowingly allows the commission of any offence under this Ordinance, shall be liable\nto the punishment specified in subsection (1).\n(6) Nothing contained herein shall authorise punishment of any person for,-\n(a)      an act or omission that was not punishable by law at the time of the act\nor omission; or\n(b)      an offence by a penalty greater than or of a kind different from, the penalty\nprescribed by law for that offence at the time the offence was committed.\n___________"
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Power to call for information",
      "content": "_(1) The Authority may call for any pertinent information\nrequired by it for carrying out the purposes of this Ordinance from any person involved, directly or\nindirectly in the provision of any regulated activity or any matter incidental or consequential thereto.\nAny person called upon to provide such information shall do so within the period prescribed by the\nAuthority and his failure to do so shall be punishable by the imposition of such penalty as may be\nprescribed."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Inspection by public",
      "content": "_ (1) Subject to section 37, the Authority shall maintain public\nfiles that shall be kept open in convenient form for public inspection and examination during\nreasonable business hours, on payment of such reasonable fees as the Authority may prescribe.\n(2) Subject to procedures and standards for confidentiality prescribed by the Authority,\nthe Authority's files shall include all relevant documents to be maintained and indexed as the Authority\ndeems fit."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Authority hearing.― (1) Unless otherwise expressly provided in this Ordinance or any",
      "content": "rule or regulation, any decision that the Authority has the power to make may be made on its own\nmotion or initiative after the holding of a meeting of the Authority, and without giving of notice to the\npublic and without holding a hearing:\nProvided that, if it appears to the Authority that its decision relating to a regulated activity may\ndirectly and adversely affect the rights of a person, the Authority shall, prior to reaching the decision,\ngive the person an opportunity of being heard, including presentation of evidence relevant to the\ndecision."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Complaints",
      "content": "_(1) Any interested person may file a written complaint with the Authority\nagainst a licensee, for contravention of any provision of this Ordinance, rule, regulation, license or\ntrack access agreement.\n(2) The Authority shall, on, receipt of a complaint, provide an opportunity to the complainant\nas well as to the person against whom such complaint has been made to state its ease before\nmaking a decision thereon."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Appeals against order of a delegate.― Any person aggrieved by any order or decision of",
      "content": "the delegatee of a power delegated by the Authority under section 10 may appeal, within thirty days\nof the receipt of such decision or order, to the Authority and the Authority shall hear and decide on\nthe appeal within ninety days from the date of its presentation."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Review of Authority decision.― The Authority may review, rescind, change, alter or vary",
      "content": "any decision, or may rehear an application before deciding it in the event of a change in circumstances\nor the discovery of evidence which in the opinion of the Authority, could not have reasonably been\ndiscovered at the time of the decision, or (in the case of a rehearing) at the time of the original hearing\nif consideration of the change in circumstances or of the new evidence would materially alter the\ndecision."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Recovery of arrears",
      "content": "_ All fees, fines or other amounts due or payable to the\nAuthority may be recovered as arrears of land revenue."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Confidential information.― (1) Except as provided under the regulations, no person shall",
      "content": "communicate or allow to be communicated any record, return or information obtained under this\nOrdinance to a person not legally entitled to that information or allow any person not legally entitled\nto that record, return or information to have access to any record, return or information obtained under\nthis Ordinance.\n(2) A person who knowingly receives the record, return or information obtained under this\nOrdinance shall hold the record, return, or information subject to the same restrictions under\nsubsection (1) as apply to the person from whom the record, return or information was received."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Immunity.― Except as expressly provided in this Ordinance, no suit, prosecution or other",
      "content": "legal proceedings shall lie against the Authority, the Chairman or any member, employee, expert,\nconsultant or advisor of the Authority in respect of anything done or intended to be done in good faith\nunder this Ordinance, the rules or regulations."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Winding",
      "content": "up of the Authority.―No provision of any law relating to winding-up of body\ncorporates shall apply to the Authority. The Authority shall only be wound up by Ordinance or Act of\nParliament."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Power to make rules.―(1) The Authority may, with the approval of the Federal",
      "content": "Government, which approval shall not be unduly delayed or unreasonably withheld, make rules for\ncarrying out the purposes of this Ordinance. On approval of rules by the Federal Government, the\nFederal Government shall notify the same in the official Gazette.\n(2) Without prejudice to the generality of the foregoing powers, such rules may provide\nfor all or any of the following matters, namely:-\n(a)     determination (where applicable) of rates, terminals and tariffs for\nregulated activities.\n(b)    the terms and conditions for the grant, extension, modification, amendment,\nissuance, renewal, suspension, review, cancellation and reissue, revocation\ntermination or transfer of a licence and including provision of information or\nrecords;\n(c)    provision of fines and penalties for offences and contravention of this\nOrdinance, the rules, the regulations and terms and conditions of licenses;\n(d)    promoting fair competition;\n(e)    inspection and audit of regulated activities; (f) review of the decisions of the\nAuthority;\n(g)    abandonment of a regulated activity;\n(h)    access and inspection by the Authority of the regulated activities and provision\nof penalties for preventing the Authority to carry out inspection;\n(i)    levy of fees;\n(j)    enforcing the terms and conditions of licences and decisions of the Authority;\nand\n(k)    any other matter incidental or consequential to the implementation of the\npurposes of the Ordinance.\n(3) The power to make rules conferred by this section, except for the first occasion, shall be\nsubject to the condition of previous publication."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Power to make regulations",
      "content": "_ (1) The Authority may, by notification in the official\nGazette, make regulations, consistent with the provisions of this Ordinance or the rules, for the\ncarrying out of its functions under this Ordinance.\n(2) In particular and without prejudice to the generality of the foregoing powers, such\nregulations may provide for all or any of the following matters, namely:-\n(a)    maintenance and submission of records by any person involved directly\nor indirectly in a regulated activity and the inspection of the records by the\nAuthority;\n(b)    establishment of technical standards and their monitoring for the design,\nconstruction, testing, operation, maintenance and abandonment of a regulated\nactivity;\n(c)    administration of the Railway Regulatory Authority Fund; (d) procedure for\ncarrying out bidding for licenses;\n(e)    procedure for closing and opening a section of the railway network;\n(f)    establishment of terms and conditions of employment and remuneration\npolicies for staff, consultants and advisors of the Authority;\n(g)     procedure for resolving disputes amongst the licenses and the signatories to the\ntrack access agreement;\n(h)     rules of practice, processes and procedures for carrying out the functions of the\nAuthority;\n(i)     limitation of employment of railway employees;\n(j)     procedure for appeal of decision or order made by delegatees pursuant to\nsection10:\n(k)     prescription of forms and procedures for an application for a regulated activity\nand the time for submission;\n(l)     procedure for sanctioning the use of rolling stock on the railway network; and\n(m)     any other matter incidental or consequential to the implementation of the\nfunctions of the Authority."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Ordinance to override other laws.― (1) The provisions of this Ordinance, the rules and",
      "content": "the regulations, and any licences issued hereunder shall have effect notwithstanding anything to the\ncontrary contained in any other law, rule or regulation, for the time being in force, and any such\nlaw, rule or regulation shall, to the extent of any inconsistency, cease to have any effect on the\ncommencement of this Ordinance and the Authority shall, subject to the provisions of this Ordinance,\nbe exclusively empowered to determine the matters in its jurisdiction as set out in this Ordinance.\n(2) Nothing in this Ordinance, or any repeal or amendment effected thereby, shall affect or\nbe deemed to affect anything done, action taken, proceedings commenced, directions given,\ninstruments executed or orders, rules or regulations issued under or in pursuance of any law repealed\nor amended by this Ordinance and any such things, actions, proceedings, directions, instruments or\norders shall, if in force on the commencement of this Ordinance, continue to be in force and have\neffect as if the same were respectively done, taken, commenced, given executed or issued under this\nOrdinance."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Certification of public purpose for compulsory acquisition of land.― The Authority",
      "content": "may in the manner and on such terms and conditions, as may be prescribed in the rules, on an\napplication by a licensee, certify that the requirement of a licensee to acquire a property is for a public\npurpose. For the purposes of the Land Acquisition Act, 1894 (Act I of 1894), the certificate of the\nAuthority shall be conclusive proof that the proposed acquisition for such licensee is for a public\npurpose.\n____________\nAMENDMENTS, SAVINGS etc."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Amendment of laws and savings.―(1) The provisions of the laws mentioned in the",
      "content": "Second Schedule shall stand amended to the extent specified therein.\n(2)    The Federal Government may from time to time, by notification in the official Gazette,\ndeem such rules and regulations made and notified under the Act as rules and regulations made and\nnotified under this Ordinance:"
    }
  ],
  "definitions": [
    {
      "term": "accident",
      "definition": "an abnormal happening whether involving a train or not which results in the disruption or likely disruption of the running of a rolling stock, whether attended or not with loss of human lives or serious injury to property or persons;",
      "source_provision": "sec2"
    },
    {
      "term": "Act",
      "definition": "the Railways Act, 1890 (Act IX of 1890);",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "the- Railway Regulatory Authority established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the authority and includes the Vice- Chairman when acting in substitution thereof;",
      "source_provision": "sec2"
    },
    {
      "term": "decision",
      "definition": "an order, determination, direction or decision of the authority made pursuant to this Ordinance, rules or regulations, and “decide” shall mean the action taken by the Authority to arrive at such decision;",
      "source_provision": "sec2"
    },
    {
      "term": "emergency",
      "definition": "any situation, which requires the adoption of extraordinary measures by the Federal Government to ensure the continuity of the railway services;",
      "source_provision": "sec2"
    },
    {
      "term": "integrated license",
      "definition": "a license which includes obligations on the licensee to maintain, improve or upgrade railway infrastructure in terms of the relevant license;",
      "source_provision": "sec2"
    },
    {
      "term": "licensed section",
      "definition": "the section of railway identified in the license within the boundaries of which railway services may be offered by a licensee on an exclusive or non-exclusive basis;",
      "source_provision": "sec2"
    },
    {
      "term": "licensee",
      "definition": "a person in whose favour a license is granted or deemed to have been granted, by the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "license fee",
      "definition": "a fee to be paid by the licensee to the Authority in accordance with the rules;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "a Member of the Authority, including the Chairman;",
      "source_provision": "sec2"
    },
    {
      "term": "policy guidelines",
      "definition": "policies of the Federal Government covering or related to any or all of the regulated activities which are issued in writing pursuant to a decision of the Cabinet of the Federal Government or any committee thereof;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "person",
      "definition": "any individual or any legal entity including any partnership, firm, company, joint venture, trust or corporation;",
      "source_provision": "sec2"
    },
    {
      "term": "railway employee",
      "definition": "any person engaged by a licensee for the purpose of working the railway;",
      "source_provision": "sec2"
    },
    {
      "term": "railway infrastructure fund",
      "definition": "'a fund established by the railway administration consisting of track access charges, applied to the maintenance and upgradation of the railway infrastructure in accordance with priorities determined by the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "railway services",
      "definition": "services offered by a licensee in terms of the license or otherwise;",
      "source_provision": "sec2"
    },
    {
      "term": "railway network",
      "definition": "the entire lines of rails, branches and sidings in Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "rate",
      "definition": "as defined in the Act;",
      "source_provision": "sec2"
    },
    {
      "term": "regulated activity",
      "definition": "any activity that is within the powers and functions of the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "the regulations made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "rolling stock",
      "definition": "locomotives, tenders, railcars, diesel or electric multiple units, coaches, passenger carriages, wagons, goods, cars, trucks, cranes, track machinery, track recording and inspection cars, and trolleys;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "the rules made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "terminal",
      "definition": "as defined in the Act;",
      "source_provision": "sec2"
    },
    {
      "term": "track access agreement",
      "definition": "an agreement between the railway administration in its capacity as the railway infrastructure owner and a licensee for access to railway Infrastructure, such agreement being based on the model track access agreement prepared and published by the Authority following discussions with the railway administration; and",
      "source_provision": "sec2"
    },
    {
      "term": "track access charge",
      "definition": "the amount, set out in the track access agreement, to be paid by a licensee to the railway administration for access to railway infrastructure. ___________ CHAPTER – II",
      "source_provision": "sec2"
    }
  ]
}
