{
  "id": "pk-railways-order-1962",
  "type": "statute",
  "title": "Railways Order, 1962",
  "title_en": "Railways Order, 1962",
  "short_name": "Railways Order, 1962",
  "status": "in_force",
  "issued_date": "1962-06-08",
  "in_force_date": "1962-06-08",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tpZg%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Railways Order, 1962 (33 of 1962) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers and functions of 1[Board], etc",
      "content": "(1) Upon the constitution of a Board in a Province,\nshall stand repealed in its application to that Province.\n(2) Upon the repeal of the said Ordinance in a Province, all powers and functions of the\n2\n[Federal Government] under the Railway Act, 1890 (IX of 1890), exercisable by the Railway Board\nconstituted under the said Ordinance, other than those under Chapters II and IV of the said Act, and\nthe power to make general rules under section 47 thereof, shall, in relation to that Province, subject to\nthe other provisions of this Order, vest in the Board.\n1\n[(3) All actions taken by the Board in the discharge of its functions shall be expressed in\nwriting and signed by the Secretary of the Board.]\n1\n[(4) The Board shall take decision on the construction of new railway lines or the modification,\nclosing or dismantling of any railway line and shall coordinate on rail movements into and from ports:\nProvided that the Board shall not alter the terms and conditions of any contract relating to the\nconveyance of defence traffic, alter the priority of movement in respect of defence traffic and close or\ndismantle any railway line or make any modifications in the defence lines except with the approval of\nMinistry of Defence.]\n1\nSubs. and added by Act No. VIII of 2026, s. 5.\n2\nSubs. by Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), s. 2 and Table.\n[4A. Track access and rail development.—(1) For the purposes of this Article, a ‘track\n1\naccess agreement’ means a track access agreement pursuant to which a party is granted, in\nconsideration for track access charges, a right to access the Pakistan Railways network and\ninfrastructure and to operate rolling-stock on the Pakistan Railways network, in accordance with the\nterms of such track access agreement as amended from time to time and a ‘rail development agreement’\nmeans an agreement for the purposes of developing the railway infrastructure and network associated\nwith it.\nExplanation.—A party may enter into only track access agreement, or only a rail development\nagreement, or both of these through a single agreement of track access and rail development or separate\nagreements each for track access and rail development.\n(2) Notwithstanding anything contained in the Railway Regulatory Authority Ordinance, 2002\n(XCII of 2002), hereinafter referred to as ‘Ordinance XCII of 2002’,\n(a)        subject to sub-clauses (b) and (c), until the Railway Regulatory Authority is\nconstituted under Ordinance XCII of 2002, the Board shall exercise overall\nregulatory oversight and ensure compliance of track access and rail\ndevelopment by parties, both local and foreign, for freight and passenger\nservices;\n(b)        Ordinance XCII of 2002 shall not apply to any track access and rail development\nagreement, including amendments thereto, executed under this Order, prior to\nor subsequent to the establishment of the Railway Regulatory Authority; and\n(c)        the Railway Regulatory Authority, whenever constituted, shall have no\njurisdiction to cancel, amend, or otherwise modify any such agreement or\namendments thereto, approved and entered into before or after its establishment.\n(3) Subject to clauses (4) and (5), the Board is authorized to approve track access and rail\ndevelopment agreements for the access to and use of Pakistan Railways network and infrastructure and\nRailways Division is authorized to enter into such track access and rail development agreements as\napproved by the Board.\n(4) The Railways Division may enter into track access and rail development agreements with\na party,—\n(a)        pursuant to and in accordance with the Inter-Governmental Commercial\nTransactions law or under the International and Inter-Governmental\ncommitments of the Federal Government; or\n(b)        who is an investor that has invested in a qualified investment duly notified in\n2022 (XXXV of 2022); or\n1\nIns. by Act No. VIII of 2026, s. 6 (The newly inserted section 4A shall apply to any agreement signed immediately before the commencement of this Act.\nFor further assistance, see section 2 of Act No. VIII of 2026).\n(c)    who may be a Federal Government Division, Department or subordinate office\nor any company, corporation or statutory body fully owned, controlled or\nmanaged by Federal Government, or a Provincial Government or a Local\nGovernment through its respective Department, or any company, corporation or\nstatutory body fully owned, controlled or managed by a Provincial Government;\nor\n(d)    who may be approved by the Federal Government or notified under any other\nlaw for the time being in force; or\n(e)    selected through a competitive bidding.\nExplanation.—For removal of doubt, it is stated that public procurement laws\nshall apply only in respect of sub-clause (e) of this clause.\n(5) The party executing the track access and rail development agreement shall be required to\nmeet the qualification criterion approved and notified by the Board from time to time, and\ncommunicated to the party, prior to the entry into such track access and rail development agreement:\nProvided that any party that meets the criteria of sub-clause (b) of clause (4) shall be deemed\nto meet the qualification criteria necessary for track access and rail development agreements.\n(6) The track access and rail development agreements entered in pursuance to this Order shall\nbe governed solely by the provisions of this Order and applicable rules and regulations made under to\nthis Order.\n(7) Track access shall be materialized by offering Pakistan Railways network and infrastructure\nto the parties for its efficient use, facilitating competition, revenue generation, improving safety,\nstrategic planning and investments, through operations of freight and passenger train services with\ntheir own locomotives and rolling stock.\n(8) Any amendment, or purported amendment, of a track access and rail development\nagreement shall be made with the consent of parties and shall not be effective unless that amendment\nhas been approved by the Board.\n(9) The charges, fee, revenue sharing, etc., from parties shall be approved by the Board and\nincluded in the relevant track access agreement.\n(10) Pakistan Railways may provide train crew or other requisite personnel on mutually agreed\nterms and, if required, also offer maintenance facilities for locomotives and rolling stock.\n(11) The Board shall approve the railway network and infrastructure usage plan (time-tabling)\nto be submitted by Pakistan Railways keeping due margins for maintenance and rehabilitation works.\n(12) The Federal Government Inspector of Railways (FGIR) shall carry out periodic\ninspections of the railway network for ensuring safety of train operations.\n(13) The Board shall sanction the use of any rolling stock on the railway network after\nascertaining its suitability and conformance to the prescribed standards.\n(14) The Board shall require the parties and Pakistan Railways to furnish periodically, but not\nlater than one year, the operating and financial results and any other information that may be necessary.\n(15) Pakistan Railways shall maintain detailed records of all track access requests, the\nallocations and capacity usage. An annual report shall be submitted to the Board detailing volume of\ntrack access requests and approvals, utilization of network capacity, track access charge revenues,\nperformance matrix, and any incident of non-compliance.\n(16) The Board shall oversee the implementation of track access and rail development\nagreements and investigate complaints and disputes regarding unfair treatment, capacity denial or\ndiscriminatory practices.\n(17) Any dispute between the parties to a track access and rail development agreement shall\nbe settled in accordance with the terms of the agreement.\n(18) The Board, keeping in view the best International practices, may perform any other\nfunction or exercise any power that may be incidental or consequential to the performance of any of\nits functions or the exercise of any of its powers.\n(19) The agreements which were signed under the Track Access (2005) and are still valid\nshall continue to be in force subject to fulfillment of conditions precedent and revision of clauses,\nrates, charges, fee, etc., as may be mutually agreed between the parties.\n(20) The Federal Government may, in the national interest and by notification in the official\nGazette, exempt any party or a project from all or any of the provisions of this Order or any other\nlaw governing the track access and rail development, for the time being in force.]"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Principles to be observed by Board, etc",
      "content": "In discharging its functions, the Board shall__\n(a)     act on business principles, due regard being had to the interests of agriculture,\nindustry, commerce and the general public, and shall, in particular, make proper\nprovision for meeting out of its receipts on revenue accounts all such\nexpenditure as is prescribed by the existing rules;\n(b)     be guided by such directions as the Provincial Government may, from time to\ntime, give on main questions of policy and major financial issues;\n(c)     obtain the prior approval of the Provincial Government in respect of__\n(i)     the Capital and Revenue Budget of the Railway;\n(ii)    the construction of new railway lines or the modification, closing or\ndismantling of any railway line;\n(iii)   changes in the general conditions of service and methods of recruitment\nof Class I officers of the Railway Services;\n(iv)    changes in the pay structure and allowances of persons in the service of\nthe railway; and\n(v)     the appointment of officers in the Senior Administrative Grade; and\n(d)        not, except with the prior approval of the 1[Federal Government] in the Ministry\nof Defence, alter the terms and conditions of any contract relating to the\nconveyance of Defence traffic."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Powers and functions of 1[Federal Government]",
      "content": "(1) Notwithstanding anything in this\nOrder, the following functions, shall be exclusive responsibility of the 1[Federal Government],\nnamely__\n(a)        dealing with international organisations and foreign countries and\nimplementation of agreements entered into with any such organisation or\ncountry; 2[and]\n2\n(b)            [*     *          *          *          *            *   *]\n(c)        consolidation of the Development Programme of the Railways as a part of the\nNational Development Programme;\n(2) The Provincial Government shall not, except with the prior approval of the 1[Federal\nGovernment],__\n(a)        alter the priority of movement in respect of defence traffic; or\n(b)        close or dismantle any railway line or make any modifications in the Ministry\nof Defence lines.\n(3) 2[*                *                    *                     *                *    *           *]\n(4) The 1[Federal Government] may from time to time issue such directions to the Provincial\nGovernments with regard to questions of policy and the running, operation and maintenance of the\nRailways and in particular directions to meet the requirements of the defence of the country as may be\ndeemed necessary, and it shall be the duty of Provincial Governments to comply with any directions\nso issued.\n(5) If at any time it is found that Railways are regulated, maintained or operated in a manner\nprejudicial to the defence of Pakistan or any part thereof or in contravention of the terms and conditions\nunder which the transfer of Railways was made, it shall be lawful for the 1[Federal Government] to\ntake over control of the Railways from the Provincial Governments and exercise executive authority\nin respect thereof for such period as the President may determine."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Assets and liabilities, etc",
      "content": "Upon the repeal of the said Ordinance,__\n(a)        all rights and privileges, all assets and liabilities, debts and obligations of the\nRailway Board constituted under the said Ordinance, subsisting immediately\nbefore the date of such repeal, shall, as from such date,__\n1\nSubs. by Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), s. 2 and Table.\n2\nAdded and omitted by Act No. VIII of 2026, s. 7.\n(i)        if the rights, privileges, assets, liabilities, debts and obligations relate to\nthe Pakistan Eastern Railway, be the rights, privileges, assets, liabilities,\ndebts and obligations of the Government of East Pakistan; and\n(ii)       if the rights, privileges, assets, liabilities, debts and obligations relate to\nthe Pakistan Western Railway, be the rights, privileges, assets,\nliabilities, debts and obligations of the Government of West Pakistan;\n(b)        any contract made on behalf of the President before the date of the repeal of the\nsaid Ordinance shall, as from such date,__\n(i)        if the contract is for purposes which as from such date are exclusively\npurposes of the Pakistan Eastern Railway, be deemed to have been made\non behalf of the Governor of East Pakistan; and\n(ii)       if the contract is for purposes which as from such date are exclusively\npurposes of the Pakistan Western Railway, be deemed to have been\nmade on behalf of the Governor of West Pakistan;\nand all rights and liabilities which have accrued or may accrue under any such\ncontract shall, to the extent to which they would have been rights or liabilities\nof the President; be rights or liabilities of the Governor of the Province con-\ncerned;\n(c)        all suits and other legal proceedings instituted by or against the Railway Board\nconstituted under the said Ordinance before the date of the repeal of the said\nOrdinance shall, as from such date,__\n(i)        if the suits and other legal proceedings relate to the Pakistan Eastern\nRailway, be deemed to be suits and proceedings by or against the\nGovernment of East Pakistan; and\n(ii)       if the suits and other legal proceedings relate to the Pakistan Western\nRailway, be deemed to be suits and proceedings by or against the\nGovernment of West Pakistan."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Financial agreements",
      "content": "(1) The provisions of the Separation Convention shall, until\nmodified by the Provincial Government, apply mutatis mutandis to regulate the separation of the\nRailway finances from the General finances of the Province, and the Provincial Government shall,\nbefore the commencement of a financial year, present to the Provincial Assembly a separate Railway\nBudget of the estimated receipts and expenditure of the Railway for that year.\n(2) The Provincial Government shall pay to the 1[Federal Government] every year in respect\nof the Railway transferred to it a return at the rate of four per cent per annum on the 1[Federal]\nGovernment’s investments made up to the 30th day of June, 1962.\n1\nSubs. by Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), s. 2 and Table.\n(3) Investment in clause (2) includes__\n(a)        the book value of the Railway assets taken over from the Government of India\nas it stood on the 14th day of August, 1947, and\n(b)        such expenditure of the 1[Federal Government] as may have been actually\nincurred by it up to 30th June, 1962, but may not have been included as\ninvestment in the 1[Federal] Government’s accounts up to that date.\n(4) The Provincial Government shall, as and when due, pay to the 1[Federal Government] the\nactual interest charges on all foreign loans, including foreign loans which exist at the time of the\npromulgation of this Order obtained by the 1[Federal Government] for the Railways.\n(5) The 1[Federal Government] shall be liable for repayment of the principal of such foreign\nloans or parts of foreign loans as have been raised by it on or before 30th day of June, 1962 or in\nrespect of which negotiations have been finalized up to that day for Capital additions to and\ndevelopment of the Railway.\n(6) As and when an instalment towards repayment of a loan is paid by the 1[Federal\nGovernment], the Provincial Government shall cease to pay interest on the loan to that extent.\n(7) The amount of the instalment paid under clause (6) by the 1[Federal Government] shall, as\nfrom the date of such payment, form part of the 1[Federal] Government’s investment in the Railways\nand the Provincial Government shall pay to the 1[Federal Government] a return at the rate of four per\ncent, per annum on the amount so forming part of the 1[Federal] Government’s investment,\n(8) The Provincial Government shall be liable for repayment of the principal of such foreign\nloan or parts of foreign loans as may have been raised for financing other than Capital investment in\nthe Railways.\n(9) The subscriptions made by the employees to the Defence Savings, Provident Fund, the State\nRailway Provident Fund, and the General Provident Fund, including optional of voluntary\nsubscriptions, and, in the case of the State Railway Provident Fund, the contributions made by the\nRailways to that Fund,__\n(a)        prior to the date of the repeal of the said Ordinance, or\n(b)        subsequent to such date,\nshall remain with, or, as the case may be, be transferred to the credit of the 1[Federal Government],\nand that Government shall be liable to make payment to the employees out of those Funds.\n(10) The Provincial Government shall, as from the first day of July, 1962, constitute a\nProvincial Railway Provident Fund to be subscribed by such of its employees as enter the service of\nthe Railways on or after that late, and as may be eligible for subscribing to it. Such subscriptions shall\nbe credited to the Provincial Government, and that Government shall be liable to make payment to the\nemployees out of the Fund.\n1\nSubs. by Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), s. 2 and Table."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Transfer of Railway servants to Provinces",
      "content": "(1) Notwithstanding anything to the contrary\nin any contract or agreement or in the conditions of service, the 1[Federal Government] may, subject\nto the provisions of clause (2), transfer the services of persons serving the Railways immediately before\nthe commencement of this Order,__\n(a)        to the office of the Comptroller and Auditor General of Pakistan, if they belong\nto Accounts Service Class I; and\n(b)        to the Provincial Governments in any other case.\n(2) In transferring persons mentioned in sub-clause (b) of clause (1) the following rule shall be\nobserved, namely:__\n(a)        all Class I officers appointed before the fourteenth day of August 1947 and all\nClass I officers appointed after that date not against any Provincial quota on the\nbasis of their domicile; and\n(b)        such of the persons in Class II, Class III and Class IV as were immediately\nbefore the commencement of this Order, in receipt of the Expatriation\nAllowance.\nshall be given the right to opt for service in either of the two Provinces;\nProvided that, if, as a result of the options exercised by the officers mentioned in paragraph (a)\nof this clause it appears that the cadre for any one of the Railways is incomplete for shortage of\nofficers, or because officers possessing requisite experience for manning the posts on that Railway\nhave not opted for it, the services of any officer mentioned in this clause may be transferred to the\nProvince other than the Province for which he had opted, for such period and on such terms and\nconditions as may be agreed upon by the two Boards or, pending the constitution of the Boards as may\nbe determined by the Railway Board constituted under the said Ordinance.\n(3) The transfer of Class I officers of the Railway Services, other than those mentioned in\nparagraph (a) of clause (1), shall be subject to the conditions,__\n(a)        that they shall continue to remain as members of the Pakistan Railway Service\nClass I;\n(b)        that they shall not be dismissed or removed from service or reduced in rank\nexcept under the orders of the President; and\n(c)        that the terms and conditions of service applicable to them immediately before\nsuch transfer shall not be altered to their disadvantage without the prior approval\nof the President.\n(4) The Provincial Governments and the Boards shall, in relation to persons belonging to Class\nII, Class III or Class IV of the Railway Services whose services are transferred under Clause (1) have\nthe same disciplinary powers as were, immediately before such transfer, exercisable respectively by\nthe 1[Federal Government] and the Railway Board constituted under the said Ordinance.\n1\nSubs. by Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), s. 2 and Table.\n(5) Subject to the provisions of clauses (3) and (4), the 1[Federal Government] may lay down\nthe terms and conditions of service applicable to persons after their services are transferred under this\narticle.\n(6) No such person as aforesaid shall, notwithstanding anything contained in any law, be\nentitled to any compensation because of such transfer."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Removal of difficulties",
      "content": "The 1[Federal Government] may, for the purpose of removing\nany difficulty that may arise in bringing into operation, or giving effect to, any provision of this Order,\nmake such orders as it considers necessary."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Power to make rules",
      "content": "The 1[Federal Government] may, by notification in the official\nGazette, make rules to carry out the purposes of this Order.\n2\n[*                *                     *                     *            *           *           *]\nRGN Dated: 13-02-2026\n1\nSubs. by Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), s. 2 and Table.\n2\nOmitted by Act No. VIII of 2026, s. 8."
    }
  ],
  "definitions": []
}
