{
  "id": "pk-recognition-and-enforcement-arbitration-agreement-and-foreign-arbitral-act-2011",
  "type": "statute",
  "title": "Recognition and Enforcement (Arbitration Agreement and Foreign Arbitral) Act, 2011",
  "title_en": "Recognition and Enforcement (Arbitration Agreement and Foreign Arbitral) Act, 2011",
  "short_name": "RAEAA",
  "status": "in_force",
  "issued_date": "2011-07-18",
  "in_force_date": "2011-07-18",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FsaJg%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Recognition and Enforcement (Arbitration Agreement and Foreign Arbitral) Act, 2011 (XVII of 2011) published by The Pakistan Code (International Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, application and commencement.⸻(1) This Act may be called the",
      "content": "Recognition and Enforcement (Arbitration Agreements and Foreign Arbitral Awards) Act, 2011.\n(2) It extends to the whole of Pakistan.\n(3) It shall apply to arbitration agreements made before, on or after the date of commencement\nof this Act.\n(4) It shall not apply to foreign arbitral awards made before the 14th day of July, 2005.\n(5) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.⸻ In this Act, unless there is anything repugnant in the subject or context,⸻",
      "content": "(a)    “Article” means an Article of Convention;\n(b)    “Contracting State” means a State which is a Party to the Convention;\n(c)    “Convention” means the United Nations Convention on the Recognition and\nEnforcement of Foreign Arbitral Awards, done at New York on 10th June,\n1958, set forth in the Schedule to this Act;\n(d)    “Court” means a High Court and such other superior court in Pakistan as may\nbe notified by the Federal Government in the official Gazette; and\n(e)    “foreign arbitral award” means a foreign arbitral award made in a Contracting\nState and such other State as may be notified by the Federal Government, in the\nofficial Gazette."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Jurisdiction of Court.⸻ (1) Notwithstanding anything contained in any other law for the",
      "content": "time  being  in force, the Court shall exercise exclusive jurisdiction to adjudicate and settle matters\nrelated to or arising from this Act.\n(2) An application to stay legal proceedings pursuant to the provisions of Article II of the\nConvention may be filed in the Court, in which the legal proceedings are pending.\n(3) In the exercise of its jurisdiction, the Court shall,⸻\n(a)     follow the procedure as nearly as may be provided for the Code of Civil\nProcedure, 1908 (Act V of 1908); and\n(b)     have all the powers vested in a civil court under the Code of Civil Procedure,\n1908 (Act V of 1908)"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Enforcement of arbitration agreements",
      "content": "(1) A party to an arbitration agreement\nagainst whom legal proceedings have been brought in respect of a matter which is covered by the\narbitration agreement may, upon notice to the other party to the proceedings, apply to the court in\nwhich the proceedings have been brought to stay the proceedings in so far as they concern that matter.\n(2) On an application under sub-section (1), the court shall refer the parties to arbitration,\nunless it finds that the arbitration agreement is null and void, in operative or incapable of being\nperformed."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Furnishing of documents.⸻(1) The party applying for recognition and enforcement of",
      "content": "foreign arbitral award under this Act shall, at the time of the application, furnish documents to the Court\nin accordance with Article IV of the Convention."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Enforcement of foreign arbitral award.⸻(1) Unless the Court pursuant to section 7,",
      "content": "refuses the application seeking recognition and enforcement of a foreign arbitral award, the Court\nshall recognise and enforce the award in the same manner as a judgment or order of a court in Pakistan.\n(2) A foreign arbitral award which is enforceable under this Act, shall be treated as binding\nfor all purposes on the persons as between whom it was made, and may accordingly be relied on by\nany of those persons by way of defence, set off or otherwise in any legal proceedings in Pakistan."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Unenforceable foreign arbitral awards.⸻ The recognition and enforcement of a foreign",
      "content": "arbitral award shall not be refused except in accordance with Article V of the Convention."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Inconsistency. ⸻ In the event of any inconsistency between this Act and the Convention,",
      "content": "the Convention shall prevail to the extent of the inconsistency."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Powers to make Rules. The Federal Government may, by notification in the official",
      "content": "Gazette, make rules to carry out the purposes of this Act."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Repeal and saving.⸻(1) The Arbitration (Protocol and Convention) Act, 1937 (VI of",
      "content": "1937) (hereinafter in this section referred to as “the Act”) is hereby repealed.\n(2) Notwithstanding the repeal of the Act, it shall continue to have effect in relation to foreign\narbitral awards made⸻\n(a)    before the date of commencement of this Act; and\n(b)    within the meaning of section 2 of the Act which are not foreign arbitral\nawards within the meaning of section 2 of this Act.\n[See Section 2 (a)]\nDone at New York on 10 June, 1958\nEntry into force: 7 June, 1959"
    }
  ],
  "definitions": [
    {
      "term": "Article",
      "definition": "an Article of Convention;",
      "source_provision": "sec2"
    },
    {
      "term": "Contracting State",
      "definition": "a State which is a Party to the Convention;",
      "source_provision": "sec2"
    },
    {
      "term": "Convention",
      "definition": "the United Nations Convention on the Recognition and Enforcement of Foreign Arbitral Awards, done at New York on 10th June, 1958, set forth in the Schedule to this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Court",
      "definition": "a High Court and such other superior court in Pakistan as may be notified by the Federal Government in the official Gazette; and",
      "source_provision": "sec2"
    },
    {
      "term": "foreign arbitral award",
      "definition": "a foreign arbitral award made in a Contracting State and such other State as may be notified by the Federal Government, in the official Gazette.",
      "source_provision": "sec2"
    }
  ]
}
