{
  "id": "pk-recusant-witnesses-act-1853",
  "type": "statute",
  "title": "Recusant Witnesses Act, 1853",
  "title_en": "Recusant Witnesses Act, 1853",
  "short_name": "RWA",
  "status": "in_force",
  "issued_date": "1853-12-01",
  "in_force_date": "1853-12-01",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Recusant Witnesses Act, 1853 (XIX of 1853) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. [Witness not a party to suit not bound to produce his own title",
      "content": "deeds.] Rep. by the\nIndian Evidence Act, 1872 (I of 1872).\n20-25. [Privileged communications; punishment for non-compliance with summons.] Rep.\nby Act X of 1861."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Persons absconding, etc, to avoid service of summons, etc., liable for damages. Any",
      "content": "person, whether a party to the suit or not, to whom a summons to attend and give evidence or\nproduce a document shall be personally delivered, and who shall, without lawful excuse, neglect or\nrefuse to obey such summons, or who shall be proved to have absconded or kept out of the way to\navoid being served with such summons, and any person who, being in Court and upon being required\nby the Court to give evidence or produce a document in his possession, shall, without lawful excuse,\nrefuse to give evidence or sign his deposition, or to produce a document in his possession,\nshall 2* * * be liable to the party at whose request the summons shall have been issued, or at\nwhose instance he shall be required to give evidence, or produce the document, for all damages\nwhich he may sustain in consequence of such neglect, or refusal, or of such absconding, or keeping\nout of the way as aforesaid, to be recovered in a civil action.\n27-39. [Property of person absconding liable for damages; costs and fines; appeal;\npostponement of trial; evidence to be taken down; evidence of females; power to require further\nevidence ; false evidence of parties punishable; deposition by parties not to be used in their own\nfavour; no appeal against order for summons of witnesses.] Rep. by Act X of 1861."
    },
    {
      "provision_ref": "sec1855",
      "section": "1855",
      "title": "Section 1855. 41",
      "content": "44. [Local extent; commencement.] Rep. by Act X of 1861.\n_____\nDate: 13-09-2024\n1\nShort title given by the Amending Act, 1897 (5 of 1897), Sch. III.\n2\nThe words \"in addition to any proceedings under this Act, \"rep. by the Amending Act, 1891 (12 of 1891)."
    }
  ],
  "definitions": []
}
