{
  "id": "pk-registered-layout-designs-of-integrated-circuits-ordinance-2000",
  "type": "statute",
  "title": "Registered Layout-Designs of Integrated Circuits Ordinance, 2000",
  "title_en": "Registered Layout-Designs of Integrated Circuits Ordinance, 2000",
  "short_name": "RLOIC",
  "status": "in_force",
  "issued_date": "2000-09-11",
  "in_force_date": "2000-09-11",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FobJ8%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Registered Layout-Designs of Integrated Circuits Ordinance, 2000 (XLIX of 2000) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Power to make regulations",
      "content": "ORDINANCE, 2000\nORDINANCE No. XLIX of 2000\n[12th September, 2000]\nAn Ordinance to provide for the registration of layout-designs of integrated circuits\nWHEREAS Pakistan is a signatory to the Agreement for the Establishment of the World Trade\nOrganization and the Agreement on Trade Related Aspects of Intellectual Property Rights for the\npurpose of reduction of distortions and impediments to international trade and for effective and\nadequate protection of intellectual property rights, and with a view to meet obligations of Pakistan\nunder the aforesaid Agreements and to promote technological developments in the country, it is\nexpedient to provide for promotion of the development of semiconductor integrated circuits by\nestablishing a system for legal protection of registered layout-designs of integrated circuits, and for\nmatters ancillary thereto or connected therewith;\nAND WHEREAS, the National Assembly and the Senate stand suspended in pursuance of the\nProclamation of the fourteenth day of October, 1999, and the Provisional Constitution Order No. 1 of\n1999;\nAND WHEREAS, the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of\nOctober, 1999, and Provisional Constitution Order No. 1 of 1999, as well as Order No. 9 of 1999, and\nin exercise of all powers enabling him in that behalf, the President of the Islamic Republic of Pakistan\nis pleased to make and promulgate the following Ordinance :—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_ (1) This Ordinance may be called the Registered\nLayout-Designs of integrated Circuits Ordinance, 2000.\n(2)   It extends to the whole of Pakistan.\n(3)   It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_In this Ordinance, unless there is anything repugnant in the subject or\ncontext,—\n(a)     “Controller” means the Controller of Patents appointed under the Patents\nOrdinance, 2000;\n(b)     “District Court” has the meanings assigned to that expression by the Code of\nCivil Procedure, 1908 (Act V of 1908).\n(c)     “integrated circuit” means a product, in its final form or an intermediate form,\nin which the elements, at least one of which is an active element, and some or\nall of the interconnections are integrally formed in or on a piece of material\nwhich is intended to perform an electronic function;\n(d)     “layout-design” means a three dimensional disposition, howsoever expressed,\nof the elements, at least one of which is an active element and of some or all of\nthe interconnection of an integrated circuit or such a three dimensional\ndisposition prepared for an integrated circuit intended for manufacture;\n(e)     “Patent Office” means the Patent Office established under the Patents\nOrdinance, 2000;\n(f)     “prescribed” means prescribed by rules made under this Ordinance;\n(g)     “protection” means the right to layout-design protection as provided under\nsection 4;\n(h)     “registration” means registration under section 8;\n(i)     “right-holder” means the natural person who, or legal entity which, shall be the\nbeneficiary of the protection referred to in section 4; and\n(j)     “regulations” means regulations made under this Ordinance."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Originality :___ (1) A layout",
      "content": "design shall be considered to be original if it is the result of its\ncreator's own intellectual effort and is not commonplace among creators and manufacturers of layout-\ndesigns of integrated circuits at the time of its creation.\n(2) A layout-design consisting of a combination of elements and inter-connections that are\ncommonplace shall be considered to be original if the combination taken as a whole fulfils the\nconditions specified in sub-section (1)."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Right to protection",
      "content": "_ (1) The right to layout design protection shall be available under this\nOrdinance if and to the extent, the layout-design is original within the meaning of section 3 and has\nbeen subject of application for registration.\n(2) The right to layout-design protection shall belong to the creator of the layout-design.\nWhere several persons have jointly created a layout-design, then such right shall belong to them jointly.\n(3) Where the layout-design has been created in execution of commission or an employment\ncontract, the right to layout design protection shall belong, in the absence of contractual provisions to\nthe contrary, to the person who commissioned the work or to the employee.\n(4) The right to layout-design protection shall be assignable or transferable by succession.\n(5) The right to layout-design protection shall not depend upon whether or not the integrated\ncircuit which incorporates the registered layout-design is itself incorporated in an article."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Effect of protection",
      "content": "_(1) Subject to section 17, the protection shall have the effect that the\nfollowing acts shall be unlawful if performed without the authorization of the right-holder, namely:—\n(i)     reproducing, whether by incorporation in an integrated circuit or otherwise, the\nregistered layout-design in its entirety or any part thereof, except the act of\nreproducing any part that does not comply with the requirement of originality\nreferred to in section 3; and\n(ii)     importing, selling or otherwise distributing for commercial purpose the\nregistered layout-design, or an integrated circuit in which the registered layout-\ndesign is incorporated or an article incorporating such an integrated circuit in so\nfar as it continues to contain an unlawfully reproduced layout-design.\n(2) The following acts shall not require the authorization of the right holder, namely:—\n(i)     reproduction of the registered layout-designs for private purposes or for the sole\npurpose of evaluation, analysis, research or teaching\n(ii)    the incorporation in an integrated circuit of a layout-design created on the basis\nof such analysis or evaluation and which is itself original under section 3 or the\nperformance of any of the acts referred to in sub-section (1) in respect of that\nlayout-design;\n(iii)    the performance of any of the acts referred to in clause (ii) of sub-section (1)\nwhere the act is performed in respect of a registered layout-design, or in respect\nof an integrated circuit in which such a layout design is incorporated, that has\nbeen put on the market by or with the consent of, the right holder;\n(iv)    the performance of any of the acts referred to in clause (ii) of sub-section (1) in\nrespect of an integrated circuit incorporating an unlawfully reproduced layout-\ndesign or any article incorporating such an integrated circuit where the person\nperforming or ordering such an act did not know, when acquiring the integrated\ncircuit or the article incorporating such an integrated circuit, that it incorporated\nan unlawfully reproduced layout-design. However, after the time that such\nperson has received sufficient notice that the layout-design was unlawfully\nreproduced that person may perform any of the said acts only with respect to\nthe stock on hand, or ordered before such time, and shall be liable to pay to the\nright holder a sum equivalent to a reasonable royalty such as would be payable\nunder a freely negotiated licence in respect of such a layout-design; or\n(v)     the performance of any of the acts referred to in clause (ii) of sub-section (1)\nwhere the act is performed in respect of an identical layout-design which is\noriginal and has been created independently by a third party."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Commencement and duration of protection:___The protection of a layout",
      "content": "design\nregistered under this Ordinance shall commence on the date of the first commercial exploitation\nanywhere in the world and shall terminate at the end of the tenth calendar year from the date of such\nfirst commercial exploitation."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Application for registration",
      "content": "_ (1) An application for the registration of a layout design\nshall be in writing and shall be filed with the Patent Office. A separate application shall be filed for\neach layout-design.\n(2) An application for the registration of a layout-design may either be filed only if a layout-\ndesign has not been commercially exploited or has been commercially exploited for not more than two\nyears.\n(3) An application submitted under sub-section (1) shall—\n(i)     contain a request for registration of the layout-design in the Register of\nLayout-Designs and a brief an precise designation thereof;\n(ii)     indicate the name, address, nationality and, if different from the address,\nthe habitual residence of the applicant;\n(iii)   be accompanied by—\n(a)     the power of attorney, appointing the representative of the applicant, if any;\n(b)     a copy or drawing of the layout-design and a sample of the integrated circuit\nalongwith information defining the electronic function which the integrated\ncircuit is intended to perform, however, the applicant may omit such parts of the\ncopy or drawing related to the manner of manufacture of the integrated circuit,\nprovided that the parts submitted are sufficient to allow the identification of the\nlayout-design; and\n(c)     payment of the prescribed fee to the Patent Office;\n(iv)    specify the date of first commercial exploitation of the layout-design\nsomewhere in the world; and\n(v)     provide particulars establishing the right to layout-design protection\nunder section 4.\n(4) Where the application does not duly comply with the requirements of sub-section (3), the\nController shall inform the applicant about the defects and ask him to make necessary corrections\nwithin the prescribed time-limit.\n(5) The Controller shall accord as the filing date to be the date of receipt of the complete\napplication in accordance with the requirements of sub-section (3).\n(6) The Controller shall confirm the filing date and communicate it to the applicant.\n(7) If the defects are not corrected within the time-limit referred to in sub-section (4), the\napplication shall be deemed not to have been filed."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Registration",
      "content": "_ (1) The Controller shall, where the application complies with the\nrequirement of section 7, after such enquiry as he thinks fit, register the layout-design in the Register\nof Layout-Designs.\n(2) The registration of a layout-design shall be published in the official Gazette."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Register of Layout",
      "content": "Designs:___ (1) The Patent Office shall maintain a register to be called\nthe “Register of Layout-Designs” in which it shall, for each registered layout-design, effect all the\nrecordings provided for in this Ordinance.\n(2) The Register of Layout-Designs shall contain the number, title, filing date and the date of\nfirst commercial exploitation of the layout-design as well as the name and address of the right holder\nand other particulars as may be prescribed.\n(3) Any person may consult the Register of Layout Designs and obtain extracts therefrom,\non payment of the prescribed fee."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Right to transfer and subsequent rectification of Register of Layout",
      "content": "Designs:___ (1)\nWhere the essential contents of an application have been taken from the layout-design of another\nperson without his consent, such person may, in writing, request the Controller to transfer the\napplication to him.\n(2) Where the application has already resulted in a registration, that person may, within three\nyears from the publication of the registration, in writing, request the Controller to transfer the\nregistration to him and to rectify the entry in the Register of Layout-designs accordingly.\n(3) The Controller shall send forthwith a copy of such a request to the right-holder, and, within\nthe prescribed period and in the prescribed manner, such right-holder may send to the Controller a\ncounter-statement of the grounds on which he relies.\n(4) If the right-holder sends a counter-statement, the Controller shall furnish a copy thereof to\nthe person requesting the transfer and, after hearing the parties, if either or both wish to be heard, and\nconsidering the merits of the case, shall decide whether the application or registration should be\ntransferred and, where applicable, whether the Register of Layout-Designs should be rectified"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Change in the ownership of a protected layout",
      "content": "design:___(1) Any change in the\nownership of a protected layout-design shall be in writing.\n(2) Once the layout-design has been registered the change in ownership at the request of any\ninterested party, made to the Patent Office, shall be recorded and published by the Controller. Such\nchange shall have no effect against third parties until such recording is effected.\n(3) An application for change in ownership shall be accompanied by such fee as may be\nprescribed."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Contractual licences:___ (1) Any licence contract concerning a registered layout",
      "content": "design\nshall be submitted to the Patent Office which shall keep its contents confidential but shall publish a\nreference thereto.\n(2) The licence contract shall have no effect against third parties until such submission as\nreferred to in sub-section (1) has been made."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Cancellation",
      "content": "(1) Any interested person may apply for cancellation of registration of a\nlayout-design on the grounds that:—\n(i)     the layout-design is not protectable under sections 3 and 4;\n(ii)     the right holder is not entitled to protection under section 4; or\n(iii)   the layout-design has not been commercially exploited anywhere in the\nworld before the filing of the application for registration.\n(2) Where the grounds for cancellation are established with respect only to a part of the layout-\ndesign, only the corresponding part of the registration shall be cancelled.\n(3) An application for cancellation of the registration of the layout-design under sub-sections\n(1) and (2) shall be filed with the District Court in writing. The request shall state the grounds on which\nit is based.\n(4) Any cancelled layout-design registration, or part thereof, shall be regarded as null and void\nfrom the date of the commencement of protection.\n(5) The final decision of the District Court shall be communicated to the Controller who shall\nrecord it and publish a reference thereto as soon as possible."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Representation",
      "content": "_Where an applicant's ordinary residence or principal place of business\nis outside Pakistan he shall be represented by a legal practitioner resident and practicing in Pakistan."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Infringement and enforcement of right",
      "content": "_ (1) Infringement shall consist of the\nperformance of any act which is unlawful under section 5.\n(2) On the request of the right holder, or of his licensee if the latter has requested the right\nholder to institute court proceedings for a specific relief and the right holder has refused or failed to do\nso within a reasonable period, the District Court may grant an injunction to prevent infringement or an\nimminent infringement and award damages and grant any other remedy provided for in the relevant\nlaw in force.\n(3) An action under sub-section (2) may be initiated only after a layout-design has been\nregistered under section 8."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Offences and penalties",
      "content": "_ (1) Any person who, without authorization knowingly performs\nany act which is unlawful under section 5 shall be guilty of an offence punishable with imprisonment\nfor a term which may extend to two years, or with fine which shall not be less than two hundred\nthousand rupees, or with both.\n(2) The Court may also order the seizure, forfeiture and destruction of the layout-designs of\nintegrated circuits or article; and of any materials or implements having been predominantly used in\nthe commission of the offence."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Exploitation by a Government agency or third person:___ (1) Subject to sub",
      "content": "section (2),\nwhere—\n(i)    the public interest, in particular, national security, nutrition, health or the\ndevelopment of other vital sectors of the national economy requires the\nexploitation of a registered layout-design for public non-commercial use; or\n(ii)     a judicial or administrative body has determined that the manner of exploitation\nof a registered layout-design, by the right-holder, or his licensee, is\nanticompetitive, and the Federal Government is satisfied that exploitation of the\nlayout-design in accordance with the provisions of this section would remedy\nsuch practice,\nthe Federal Government may, even without the consent of the right holder, decide that a Government\nagency or a third person designated by the Federal Government may exploit the layout-design.\n(2) The Federal Government shall, before taking any decision under sub-section (1), give the\nright-holder and any interested person an opportunity of being heard if he wishes to be heard.\n(3) The exploitation of a layout-design shall be limited to the purpose for which it was\nauthorized under sub-section (1), and shall be subject to the payment to the right-holder of an adequate\nremuneration therefore taking into account the economic value of the said authorization as the Federal\nGovernment may determine.\n(4) Upon request of the right-holder, or of the beneficiary of the authorization under sub-\nsection (1), the Federal Government may after hearing the parties, if either or both wish to be heard,\nvary the terms of the decision authorizing the exploitation of the layout-design to the extent that\nchanged circumstances justify such variation.\n(5) Upon the request of the right-holder, the Federal Government shall terminate the\nauthorization if it is satisfied that the circumstances which led to the decision have ceased to exist and\nare unlikely to recur or that the beneficiary of the authorization under sub-section (1) has failed to\ncomply with the terms of such authorization.\n(6) Notwithstanding the provisions of sub-section (5), the Federal Government shall not\nterminate an authorization if it is satisfied that the adequate protection of the legitimate interests of the\nbeneficiary of the authorization justifies the maintenance of such authorization.\n(7) Where a third person has been designated by the Federal Government, the authorization\nmay only be transferred with the enterprise or business of the beneficiary of authorization or with the\npart of the enterprise or business within which the layout-design is being exploited.\n(8) A request for grant of authorization under sub-section (1) shall be accompanied by evidence\nthat the right-holder has received, from the person seeking the authorization, a request for a contractual\nlicence but that person has been unable to obtain such licence on reasonable commercial terms and\nconditions and within a reasonable time:\nProvided that this sub-section shall not apply in cases of—\n(i)     national emergency or other circumstantial urgency provided that in\nsuch cases the owner of the patent shall be informed of decision of the\nFederal Government as soon as reasonably practicable;\n(ii)    public non-commercial use; and\n(iii)    anti-competitive practices determined as such by a judicial or\nadministrative body in accordance with clause (ii) of sub-section (1)."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Exercise of discretionary power and extension of time",
      "content": "_ (1) The Controller shall give\nany party to any proceeding before him an opportunity of being heard before exercising any\ndiscretionary power under the provisions of this Ordinance which may adversely affect such party.\n(2) The Controller may, if he is satisfied that the circumstances justify it, upon receiving a\nwritten request therefor, extend the time for doing any act or taking any proceeding under this\nOrdinance, upon notice to the parties concerned and upon such terms as he may direct."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Appeal",
      "content": "_ (1) An appeal shall lie to the High Court in cases of dispute relating to the\napplication of this Ordinance and in matters which under this Ordinance are required to be referred to\na District Court.\n(2) An appeal shall lie to the High Court against the decision of the Federal Government under\nsection 17.\n(3) An appeal shall lie to the High Court against any decision taken by the Controller under\nthis Ordinance in particular the registration of a layout-design, by any interested party and such appeal\nshall be referred within two months of the date of such decision."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Surrender of right:___ (1) The right",
      "content": "holder may surrender his right to protection only with\nthe approval of the sole use grantee, or ordinary use grantee and pledgee, if any.\n(2) A sole use grantee may surrender his sole use right to protection only with the approval\nof the ordinary use grantee and pledgee, if any.\n(3) An ordinary use grantee may surrender his ordinary use right to protection only with the\napproval of the pledgee, if any."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Power to make rules",
      "content": "_ (1) The Federal Government may, by notification in the official\nGazette, make rules for carrying out the purposes of this Ordinance.\n(2) In particular and without prejudice to the generality of the foregoing power, such\nregulations may provide for—\n(a)     payment of fee in connection with an application for registration of layout-\ndesign of' integrated circuit and matters related thereto; and\n(b)     fee to be paid to the Patent Office for obtaining copies of the relevant record of\nthe registered layout-design of integrated circuit from the Patent Office."
    }
  ],
  "definitions": [
    {
      "term": "Controller",
      "definition": "the Controller of Patents appointed under the Patents Ordinance, 2000;",
      "source_provision": "sec2"
    },
    {
      "term": "integrated circuit",
      "definition": "a product, in its final form or an intermediate form, in which the elements, at least one of which is an active element, and some or all of the interconnections are integrally formed in or on a piece of material which is intended to perform an electronic function;",
      "source_provision": "sec2"
    },
    {
      "term": "layout-design",
      "definition": "a three dimensional disposition, howsoever expressed, of the elements, at least one of which is an active element and of some or all of the interconnection of an integrated circuit or such a three dimensional disposition prepared for an integrated circuit intended for manufacture;",
      "source_provision": "sec2"
    },
    {
      "term": "Patent Office",
      "definition": "the Patent Office established under the Patents Ordinance, 2000;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "protection",
      "definition": "the right to layout-design protection as provided under section 4;",
      "source_provision": "sec2"
    },
    {
      "term": "registration",
      "definition": "registration under section 8;",
      "source_provision": "sec2"
    },
    {
      "term": "right-holder",
      "definition": "the natural person who, or legal entity which, shall be the beneficiary of the protection referred to in section 4; and",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "regulations made under this Ordinance.",
      "source_provision": "sec2"
    }
  ]
}
