{
  "id": "pk-registration-of-foreigners-act-1939",
  "type": "statute",
  "title": "Registration of Foreigners Act, 1939",
  "title_en": "Registration of Foreigners Act, 1939",
  "short_name": "ROFA",
  "status": "in_force",
  "issued_date": "1939-04-07",
  "in_force_date": "1939-04-07",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJaY-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Registration of Foreigners Act, 1939 (XVI of 1939) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent",
      "content": "(1) This Act may be called the Registration of Foreigners Act,"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act",
      "content": "2\n[(a)   “foreigner” means a person who is not a citizen of Pakistan;]\n(b)        “prescribed” means prescribed by rules made under this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Power to make rules. The 3[Federal Government] may after previous publication, by",
      "content": "notification in the official Gazette, make rules with respect to foreigners for any or all of the\nfollowing purposes, that is to say__\n(a)        for requiring any foreigner entering, or being present in, 1[Pakistan] to report\nhis presence to a prescribed authority within such time and in such manner and\nwith such particulars as may be prescribed;\n(b)        for requiring any foreigner moving from one place to another place in\n2\n[Pakistan] to report, on arrival at such other place, his presence to a\nprescribed authority within such time and in such manner and with such\nparticulars as may be prescribed;\n(c)        for requiring any foreigner who is about to leave 1[Pakistan] to report the date\nof his intended departure and such other particulars as may be prescribed to\nsuch authority and within such period before departure as may be prescribed;\n(d)        for requiring any foreigner entering, being present in, or departing from,\n1\n[Pakistan] to produce, on demand by a prescribed authority, such proof of his\nidentity as may be prescribed;\n1\nSubs. by Act No. VIII of 1950, ss. 2-3\n2\nSubs. by Act No. XXXV of 1957, s. 2.\n3\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table.\n(e)       for requiring any person having the management of any hotel, boarding-house,\nsarai or any other premises of like nature to report the name of any foreigner\nresiding therein for whatever duration, to a prescribed authority within such\ntime and in such manner and with such particulars as may be prescribed;\n(f)        for requiring any person having the management or control of any vessel or\naircraft to furnish to a prescribed authority such information as may be pres-\ncribed regarding any foreigner entering, or intending to depart from,\n1\n[Pakistan] in such vessel or aircraft, and to furnish to such authority such\nassistance as may be necessary or prescribed for giving effect to this Act ;\n(g)        for providing for such other incidental or supplementary matters as may\nappear to the 2[Federal Government] necessary or expedient for giving effect\nto this Act."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Burden of proof. If any question arises with reference to this Act or any rule made there",
      "content": "under, whether any person is or is not a foreigner, or is or is not a foreigner of a particular class or\ndescription, the onus of proving that such person is not a foreigner or is not a foreigner of such\nparticular class or description, as the case may be, shall, notwithstanding anything contained in the\nEvidence Act, 1872 (I of 1872), lie upon such person."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Penalties. Any person who contravenes, or attempts to contravene, or fails to comply with,",
      "content": "any provision of any rule made under this Act shall be punished, if a foreigner, with imprisonment\nfor a term which may extend to one year or with fine which may extend to one thousand rupees or\nwith both, or if not a foreigner, with fine which may extend to five hundred rupees."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to exempt from application of Act. The 2[Federal Government] may, by order,",
      "content": "declare that any or all of the provisions of the rules made under this Act shall not apply, or shall\napply only with such modifications or subject to such conditions as may be specified in the said\norder, to or in relation to any individual foreigner or any class or description of foreigner:\nProvided that a copy of every such order shall be placed on the table of 3[* * *] the 2[Federal]\nLegislature as soon as may be after its promulgation."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Protection to persons acting under this Act. No suit, prosecution or other legal",
      "content": "proceeding shall lie against any person for anything which is in good faith done or intended to be\ndone under this Act.\n1\nSubs. by Act No. VIII of 1950, s. 4.\n2\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table.\n3\nOmitted by the Adaptation of Central Acts & Ordinances Order, 1949 (Order No. 4 of 1949), Art. 3 and Sch."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Application of other laws not barred. The provisions of this Act shall be in addition to,",
      "content": "and not in derogation of, the provisions of the Foreigner Act, 1[1946 (XXXI of 1946)] and any other\nlaw for the time being in force.\n9. 2[* *              *          *          *          *          *].\n__________\n4923                                                                                                          Date: 12-02-2025\n1\nSubs. by Act No. VIII of 1950, s. 5.\n2\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 2 and Sch. II."
    }
  ],
  "definitions": [
    {
      "term": "foreigner",
      "definition": "a person who is not a citizen of Pakistan;]",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act.",
      "source_provision": "sec2"
    }
  ]
}
