{
  "id": "pk-religious-societies-act-1880",
  "type": "statute",
  "title": "Religious Societies Act, 1880",
  "title_en": "Religious Societies Act, 1880",
  "short_name": "RSA",
  "status": "in_force",
  "issued_date": "1880-01-08",
  "in_force_date": "1880-01-08",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bZw%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Religious Societies Act, 1880 (I of 1880) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Questions may be submitted to High Court",
      "content": "1\nACT No I OF 1880\n[9th January, 1880]\nAn Act to confer certain powers on Religious Societies\nPreamble. WHEREAS it is expedient to simplify the manner in which certain bodies of\npersons associated for the purpose of maintaining religious worship may hold property acquired for\nsuch purpose, and to provide for the dissolution of such bodies and the adjustment of their affairs and\nfor the decision of certain questions relating to such bodies; It is hereby enacted as follows :___"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title. This Act may be called the Religious Societies Act, 1880",
      "content": "Local extent. It 1[* * *] shall extend to 2[ the whole of Pakistan] but nothing herein contained\nshall apply to any Hindus, 3[Muslims] or Buddhists, or to any persons whom the 4[Provincial\nGovernment] may from time to time, by notification in the 5[Official Gazette], exclude from the\noperation of this Act."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Appointment of new trustee in cases not otherwise provided for. When any body of",
      "content": "persons associated for the purpose of maintaining religious worship has acquired, or hereafter shall\nacquire, any property, and such property has been or hereafter shall be vested in trustees in trust for\nsuch body, and it becomes necessary to appoint a new trustee in the place of or in addition to any such\ntrustee or any trustee appointed in the manner hereinafter prescribed, and no manner of appointing\nsuch new trustee is prescribed by any instrument by which such property was so vested or by which\nthe trusts on which it is held have been declared, or such new trustee cannot for any reason be appointed\nin the manner so prescribed, such new trustee may be appointed in such manner as may be agreed upon\nby such body, or by a majority of not less than two-thirds of the members of such body actually present\nat the meeting at which the appointment is made."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Appointment under section 2 to be recorded in a memorandum under the hand of the",
      "content": "chairman of the meeting. Every appointment of new trustees under section 2 shall be made to appear\nby some memorandum under the hand of the chairman for the time being of the meeting at which such\nappointment is made.\nSuch memorandum shall be in the form set forth in the schedule hereto annexed, or as near\nthereto as circumstances allow, shall be executed and attested by two or more credible witnesses in the\npresence of such meeting, and shall be deemed to be a document of which the registration is required\nby the 6[Registration Act, 1908 (XVI of 1908)] section 17.\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1879, Pt. V, p.770; for Proceedings in Council, see ibid., 1879, Supplement, pp. 598, 745;\nand 174, ibid., 1880. Supplement, pp. 23 and 170.\nThis Act has been amended to the extent of Islamabad Capital Territory, see Ordinance No. 27 of 1981, s. 5 and 4th Sch.\n2\nThe words “shall come into force at once, and” rep. by the Repealing and Amending Act, 1914 (X of 1914).\n3\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch. (w. e.f the 14th October, 1955).\n4\nSubs. by Federal Adaptation Order, 1975, Art. 2 and Table, for “Muhammadans”.\n5\nSubs. by Adaptation Order, 1937, for the words “L. G” which had been subs. for the words “G.G. in C” by the Devolution Act, 1920 (38 of 1920), s. 2\nand Sch I.\n6\nSubs. by A.O., 1937, for the words “local official Gazette” which had been subs. for the words “Gazette of India” by Act 38 of 1920, s. 2 and Sch. I\n7\nSubs. by Ordinance, XXVII of 1981, s. 5 and Sch. IV (only to the extent of Islamabad Capital Territory.)"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Property to vest in new trustees without conveyance. When any new trustees have been",
      "content": "appointed, whether in the manner prescribed by any such instrument as aforesaid or in the manner\nhereinbefore provided, the property subject to the trust shall forthwith, notwithstanding anything\ncontained in any such instrument, become vested, without any conveyance or other assurance, in such\nnew trustees and the old continuing trustees jointly, or, if there are no old continuing trustees, in such\nnew trustees wholly, upon the same trusts, and with and subject to the same powers and provisions, as\nit was vested in the old trustees."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Saving of existing modes of appointment and conveyance. Nothing herein contained shall",
      "content": "be deemed to invalidate any appointment of new trustees, or any conveyance of any property, which\nmay hereafter be made as heretofore was by law required."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Provision for dissolution of Societies and adjustment of their affairs. Any number not",
      "content": "less than three-fifths of the members of any such body as aforesaid may at a meeting convened for the\npurpose determine that such body shall be dissolved; and thereupon it shall be dissolved forthwith, or\nat the time then agreed upon; and all necessary steps shall be taken for the disposal and settlement of\nthe property of such body, its claim and liabilities, according to the rules of such body applicable\nthereto, if any, and, if not, then as such body at such meeting may determine :\nProvided that, in the event of any dispute arising among the members of such body, the\nadjustment of its affairs shall be referred to the principal Court of original civil jurisdiction of the\ndistrict in which the chief building of such body is situate ; and the Court shall make such order in the\nmatter as it deems fit."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Upon a dissolution no member to receive profit. If upon the dissolution of any such body",
      "content": "there remains, after the satisfaction of all its debts and liabilities, any property whatsoever, the same\nshall not be paid to or distributed among the members of such body or any of them, but shall be given\nto some other body of persons associated for the purpose of maintaining religious worship or some\nother religious or charitable purpose to be determined by the votes of not less than three-fifths of the\nmembers present at a meeting convened in this behalf, or in default thereof by such Court as last\naforesaid."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Saving of certain provisions of instruments. Nothing in sections 6 and 7 shall be deemed",
      "content": "to affect any provision contained in any instrument for the dissolution of such body, or for the payment\nor distribution of such property."
    }
  ],
  "definitions": []
}
