{
  "id": "pk-removal-from-service-special-powers-repeal-act-2010",
  "type": "statute",
  "title": "Removal from Service (Special Powers) (Repeal) Act, 2010",
  "title_en": "Removal from Service (Special Powers) (Repeal) Act, 2010",
  "short_name": "RFSPA",
  "status": "repealed",
  "issued_date": "2010-11-30",
  "in_force_date": "2010-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FsaZ0%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Removal from Service (Special Powers) (Repeal) Act, 2010 (III of 2010) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Removal from\nService (Special Powers) (Repeal) Act, 2010\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Repeal",
      "content": "(1) The Removal from Service (Special Powers) Ordinance, 2000 (XVII of 2000) is\nhereby repealed, hereinafter referred to as the repealed Ordinance.\n(2) All proceedings pending under the repealed Ordinance or the rules made thereunder\nimmediately before the commencement of this Act against any person whether in government service\nor corporation service shall continue under the repealed Ordinance or the rules made thereunder.\n(3) Subject to sub-section (2), on the repeal of the said Ordinance, all disciplinary matters relating\nto persons in government service, to whom the Civil Servants Act, 1973 (LXXI of 1973) and the\nGovernment Servants (Efficiency and Discipline) Rules, 1973, apply, shall be governed under the\naforesaid Act and the rules made thereunder and persons in corporation service shall be governed under\nthe law applicable to them and rules and by-laws made thereunder.\n______\nRGN Date: 12-03-2025"
    }
  ],
  "definitions": []
}
