{
  "id": "pk-requisitioned-land-continuanceof-powers-ordinance-1977",
  "type": "statute",
  "title": "Requisitioned Land (Continuanceof Powers) Ordinance, 1977",
  "title_en": "Requisitioned Land (Continuanceof Powers) Ordinance, 1977",
  "short_name": "RLPO",
  "status": "in_force",
  "issued_date": "1977-09-14",
  "in_force_date": "1977-09-14",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Fua5g%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Requisitioned Land (Continuanceof Powers) Ordinance, 1977 (XXXIII of 1977) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Savings",
      "content": "THE REQUISITIONED LAND (CONTINUANCE OF POWERS)\nORDINANCE, 1977.\nORDINANCE NO. XXXIII OF 1977\n[15th September, 1977]\nAn Ordinance to provide for the continuance of certain emergency powers in relation to\nrequisitioned land\nWHEREAS it is expedient to provide, in relation to land which, when the Defence of\nPakistan Ordinance, 1971 (XXX of 1971) stands repealed, is subject to any requisition\neffected under any rule made under the said Ordinance, for the continuance of certain powers\ntherefor exercisable under the said Ordinance or the said rules ;\nAND WHEREAS the President is satisfied that circumstances exist which render it\nnecessary to take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977,\nread with the Laws (Continuance in Force) Order, 1977 (C.M.L.A order No. 1 of 1977) and in\nexercise of all powers enabling him in that behalf, the President is pleased to make and promulgate\nthe following Ordinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Ordinance may be called the\nRequisitioned Land (Continuance of Powers) Ordinance, 1977.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definition. In this Ordinance, unless there is anything repugnant in the subject or",
      "content": "context, “requisitioned land” means immovable property which at the commencement of this\nOrdinance is subject to any requisition effected by or under the authority of the Federal Government\nunder the rules made under the Defence of Pakistan Ordinance, 1971 (XXX of 1971)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Continuance of requisitions. Notwithstanding the repeal of the Defence of Pakistan",
      "content": "Ordinance, 1971 (XXX of 1971) and the rules made thereunder, all requisitioned lands shall\ncontinue to be subject to requisition and the Federal Government may use or deal with any\nrequisitioned land in such manner as may appear to it to be expedient:\nProvided that the Federal Government may at any .time release from requisition any\nrequisitioned land."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Release from requisition",
      "content": "(I) Where any requisitioned land is to be released from\nrequisition, the Federal Government may, after making such inquiry, if any, as it considers\nnecessary, specify by order in writing the person to whom possession of the land shall be given.\n(2) The delivery of possession of the requisitioned land to the person specified in an order\nmade under sub-section (1) shall be a full discharge of the Federal Government from all liability in\nrespect of such delivery, but shall not prejudice any rights in respect of the land which any other\nperson may be entitled by due process of law to enforce against the person to whom possession of\nthe land is to be delivered.\n(3) Where the person to whom possession of any requisitioned land is to be given cannot be\nfound and has no agent or other person empowered to accept delivery on his behalf, the\nFederal Government shall cause a notice declaring that the land is released from requisition to be\naffixed on some conspicuous part of the land and publish the notice in the official Gazette.\n(4) When a notice referred to in sub-section (3) is published in the official Gazette, the land\nspecified in such notice shall cease to be subject to requisition on and from the date of such\npublication and be deemed to have been deliverd to the person entitled to possession thereof; and the\nFederal Government shall not be liable for any compensation or other claim in respect of the land\nfor any period after the said date."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Payment of compensation. In respect of the continued subjection of requisitioned land to",
      "content": "requisition under this Ordinance compensation shall be determined and paid in accordance with the\nprovisions of section 18 of the Defence of Pakistan Ordinance,1971(XXX of 1971) and of the\nrules made thereunder:\nProvided that all agreements and awards under the said section in respect of the payment of\ncompensation for the period of requisition before the commencement of this Ordinance shall\ncontinue to be in force and shall apply to the payment of compensation for the period of\nrequisition after such commencement."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to obtain information",
      "content": "(1) The Federal Government may, with a view to\ncarrying out the purposes of sections 3 to 5, by order require any person to furnish to such authority\nas may be specified in the order such information in his possession relating to any requisitioned land\nas may be specified.\n(2) Every person required to furnish such information as is referred to in sub-section (1) shall\nbe deemed to be legally bound to do so within the meaning of sections 176 and 177 of the Pakistan\nPenal Code (Act XLV 1860)."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Delegation of functions. The Federal Government may, by order notified in the official",
      "content": "Gazette, direct that any power conferred or any duty imposed on it by this Ordinance shall, in such\ncircumstances and under such conditions, if any, as may be specified in the direction, be exercised or\ndischarged by such officer as may be so specified."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Indemnity",
      "content": "(1) No suit, prosecution or other legal proceeding shall lie against any\nperson for anything which is in good faith done or intended to be done in pursuance of this\nOrdinance or any rule or order made thereunder.\n(2) No suit or other legal proceeding shall lie against the Federal Government for any\ndamage caused or likely to be caused by anything in good faith done or intended to be done in\npursuance of this Ordinance or any rule or order made thereunder."
    }
  ],
  "definitions": []
}
