{
  "id": "pk-reservists-reinstatement-in-civil-employment-ordinance-1965",
  "type": "statute",
  "title": "Reservists (Reinstatement in Civil Employment) Ordinance, 1965",
  "title_en": "Reservists (Reinstatement in Civil Employment) Ordinance, 1965",
  "short_name": "RICEO",
  "status": "in_force",
  "issued_date": "1965-06-06",
  "in_force_date": "1965-06-06",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJ%2Bd-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Reservists (Reinstatement in Civil Employment) Ordinance, 1965 (XXI of 1965) published by The Pakistan Code (Service Laws).",
  "provisions": [
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power to make rules",
      "content": "THE RESERVISTS (REINSTATEMENT IN CIVIL EMPLOYMENT)\nORDINANCE, 1965\nORDINANCE NO. XXI OF 1965\n[5th June, 1965]\nAN\nto provide for the reinstatement in civil employment of reservists called up for service or\ntraining in any of the Defence Services\nWHEREAS it is expedient to provide for the reinstatement in civil employment of reservists\ncalled up for service or training in any of the Defence Services and matters ancillary thereto;\nAND WHEREAS the national interest of Pakistan in relation to the achievement of\nuniformity within the meaning of clause (2) of Article 131 of the Constitution requires Central\nlegislation in the matter;\nAND WHEREAS the National Assembly is not in session and the President is satisfied that\ncircumstances exist which render immediate legislation necessary;\nNOW, THEREFORE, in exercise of the powers conferred by clause (1) of Article 29 of the\nConstitution, and of all other powers enabling him in that behalf, the President is pleased to make\nand promulgate the following Ordinance:⸻"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and Commencement",
      "content": "_(1) This Ordinance may be called the\nReservists (Reinstatement in Civil Employment) Ordinance, 1965.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definition",
      "content": "In this Ordinance, unless there is anything repugnant in the subject or\ncontext,⸻\n(a)     “employer” means any person who employs any other person, either directly\nor through another person, whether on behalf of himself or any other person,\nand includes Government and any corporation, institution or undertaking\nestablished or set up under any law or by or under the authority of\nGovernment;\n(b)     “reservist” has the same meaning as in the Pakistan (Army and Air Force)\nReserves Act, 1950 (XLVII of 1950), and includes a person who is liable to be\nrecalled after retirement, release or discharge to service or training under any\nrule or regulation made under the Pakistan Army Act, 1952 (XXXIX of 1952),\nOrdinance, 1961(XXXV of 1961)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Reinstatement of reservists called up for army service, etc",
      "content": "_(1) Notwithstanding\nanything contained in any other law for the time being in force or in any contract or agreement, a\nreservist who has been called up for service or training whether before or after the commencement of\nthis Ordinance shall, upon the termination of such service or training, be entitled to reinstatement in\nthe employment from which he was released at the time he was called up and the employer shall\nreinstate such reservist in such employment or, if such reinstatement is less favourable to the\nreservist than that to which he would, in the ordinary course, have been entitled, give him such\nemployment as is not so less favourable:\nProvided that the employer shall not be required to reinstate or employ any reservist if he\ndoes not apply or report to the employer for the purpose within three months of his release from\nservice or training.\n(2) Where for any reason reinstatement or employment of a reservist under sub-section (1) is\nnot practicable, the employer shall, within ten days from the date on which the reservist applies or\nreports himself for reinstatement or employment, make an application to the 2[Federal Government]\nor an authority empowered by it in this behalf for exemption from the provisions of sub-section (1)\nand send a copy thereof to such reservists.\n(3) Upon an application under sub-section (2) the 1[Federal Government] or the authority\nempowered by it shall, after such enquiry and hearing as it considers necessary, make an order⸻\n(a)        exempting the employer from the provisions of sub-section (1) ; or\n(b)        requiring the employer to reinstate or give employment to the reservist on such\nterms and conditions as it may specify in the order.\n(4) If any employer contravenes the provisions of sub-section (1) or fails or neglects to carry\nout an order under sub-section (3), he shall be punishable with imprisonment for a term which may\nextend to six months, or with fine which may extend to ten thousand rupees, or with both, and the\ncourt convicting him shall direct that the employer shall also pay as compensation to the reservist\nconcerned an amount equal to six months' remuneration of the reservist at the rate to which he was\nentitled when he was released.\n2\n[(4A). Where the person guilty of an offence under this Ordinance is a company or other\nbody corporate, every director, manager, secretary or other officer thereof who is, for the time being,\ncompetent to comply with the provisions of this Ordinance shall, unless he proves that he exercised\nall due diligence to prevent the commission of the offence, be deemed to be guilty of the offence and\nshall be liable to be proceeded against and punished accordingly.]\n(5) No court inferior to that of a Magistrate of the first class invested with powers under\nsection 30 of the Code of Criminal Procedure, 1898 (Act V of 1898) , shall try an offence under this\nsection."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Jurisdiction of courts barred",
      "content": "No order made or proceedings taken under this\nOrdinance shall be called in question in any court."
    }
  ],
  "definitions": [
    {
      "term": "employer",
      "definition": "any person who employs any other person, either directly or through another person, whether on behalf of himself or any other person, and includes Government and any corporation, institution or undertaking established or set up under any law or by or under the authority of Government;",
      "source_provision": "sec2"
    }
  ]
}
