{
  "id": "pk-riphah-international-university-ordinance-2002",
  "type": "statute",
  "title": "Riphah International University Ordinance, 2002",
  "title_en": "Riphah International University Ordinance, 2002",
  "short_name": "RIUO",
  "status": "in_force",
  "issued_date": "2002-10-15",
  "in_force_date": "2002-10-15",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FtbJo%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Riphah International University Ordinance, 2002 (LXXVI of 2002) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Functions of the Finance and Planning Committee",
      "content": "ORDINANCE LXXVI OF 2002\nAn Ordinance to provide for the establishment of Riphah International University at Islamabad\n[16-10-2002]\nWHEREAS it is expedient to provide for the establishment of Riphah International\nUniversity at Islamabad and for the matters connected therewith or incidental thereto;\nAND WHEREAS the President is satisfied that circumstances exist which rend it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of Proclamation of Emergency of the Fourteenth day of\nOctober, 1999, and the Provisional Constitution Order No. 1 of 1999, read with the Provisional\nConstitution (Amendment) Order No. 9 of 1999, and in exercise of all powers enabling him in that\nbehalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the\nfollowing Ordinance:––"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "_ (1) This Ordinance may be called the Riphah\nInternational University Ordinance, 2002.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "__ In this Ordinance, unless there is anything repugnant in the subject or\ncontext,––\n(a)     “Academic Council” means the Academic Council of the University;\n(b)     “Authority” means any of the Authorities of the University specified in section\n7;\n(c)     “Board” means the Board of Governors of the University;\n(d)     “Chairman” means the Chairman of the Board;\n(e)     “Chancellor” means the Chancellor of the University;\n(f)     “Dean” means the Dean of a Faculty of the University;\n(g)     “Faculty” means the Faculty of the University;\n(h)     “Head” means Head of a teaching department of the University;\n(i)     “Patron” means the Patron of the University;\n(j)     “Prescribed” means prescribed by Statutes, Regulations and Rules;\n(k)     “Registrar” means the Registrar of the University;\n(l)     “Statutes”, “Regulations” and “Rules” means the Statutes, the Regulations and\nthe Rules made or deemed to have been made under this Ordinance;\n(m)     “teacher” means Professor, Associate Professor, Assistant Professor and\nLecturer engaged whole time by the University for teaching degree and post-\ngraduate classes and includes such other persons as may be declared as\n“Teachers” by Regulations;\n(n)     “teaching department” means teaching department established and maintained\nby the University;\n(o)     “Trust” means Islamic International Medical College Trust;\n(p)     “University” means the Riphah International University established under this\nOrdinance; and\n(q)     “Vice Chancellor” means the Vice-Chancellor of the University;"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment and incorporation of the University",
      "content": "___ (1) There shall be established at\nIslamabad a University to be called Riphah International University consisting of,—\n(i)     the Chancellor, the Vice-Chancellor, the Deans and other members of the\nBoard;\n(ii)    the members of such councils, committees and other bodies as the Board may\nestablish;\n(iii)   the teachers and students of the University and its constituent units; and\n(iv)    such other officers and members of the staff as may from time to time be\nspecified by the Board.\n(2) The University shall be a body corporate by the name of Riphah International University\nhaving perpetual succession and a common seal, with power, among others, to acquire, hold and\ndispose of any property and shall by the said name sue and be sued."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers and functions of the University",
      "content": "__ The University shall have the powers,___\n(a)     to provide for instruction and training in such branches of learning as it may\ndeem fit and to make provision for research, demonstrations and other\nservices, and for the advancement and dissemination of knowledge;\n(b)     to admit, teach and examine students;\n(c)     to hold examinations and confer, award degrees, diplomas, certificates and\nother academic distinctions on and to persons who have passed its\nexaminations under prescribed conditions;\n(d)     to select and promote faculties;\n(e)     to confer honorary degrees;\n(f)     to prescribe courses of studies in such branches of learning as the University\nmay deem fit;\n(g)     to pursue research;\n(h)     to establish and support other facilities for education, training and research;\n(i)     to affiliate or associate itself with other institutions and establish faculties in\nPakistan and abroad for better discharge of its functions and responsibilities;\n(j)     to establish camp offices, campuses and faculties in Pakistan and abroad;\n(k)     to enter into agreements, contracts and arrangements with Universities,\norganizations, institutions, bodies and individuals for the purpose of carrying\nout its function and activities; and\n(l)     to decide teaching methods and strategies in order to ensure the most effective\neducational and training programmers."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. University open to all classes, creeds etc",
      "content": "__ The University shall be open to persons of\neither sex of whatever religion, race, creed, color or domicile who are academically qualified for\nadmission to the courses of study offered by the University; and no such person shall be denied the\nprivileges of the University on the ground only of sex, religion, creed, race, class, colour or domicile."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Teaching and examinations in the University",
      "content": "___ (1) The academic programmes of the\nUniversity shall be conducted in the prescribed manner.\n(2) The University may associate external and internal examiners for the conduct of\nexaminations.\n(3) A degree shall not be awarded to a student unless he has passed an examination in Islamic\nStudies and Pakistan Studies at the bachelor's degree level or in the case of a Non-Muslim student in\nethics and Pakistan Studies at his option."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Authorities of the University.",
      "content": "__ The authorities of the University shall consist of,––\n(a)     Board of Governors;\n(b)     Academic Council;\n(c)     Advanced Studies and Research Board;\n(d)     Finance and Planning Committee;\n(e)     Selection Board; and\n(f)     Such other Authority constituted by the Board."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Officers of the University",
      "content": "__ The following shall be the officers of the University,\nnamely,––\n(a)     the Chancellor;\n(b)     the Vice-Chancellor;\n(c)     the Deans;\n(d)     the Head of teaching department;\n(e)     the Registrar; and\n(f)     such other persons as may be specified by Regulations to be the officers."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Patron",
      "content": "__ (1) The President of Islamic Republic of Pakistan shall be the Patron of the\nUniversity.\n(2) The Patron, when present, or in his absence, his nominee, shall preside at the convocation\nof the University.\n(3) Every proposal to confer an honorary degree shall be subject to confirmation by the\nPatron."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Visitation",
      "content": "__ (1) The Patron may cause an inspection or inquiry to be made in respect of\nany matter connected with the affairs of the University and shall, from time to time, direct any\nperson to inquire into or carry out inspection of,––\n(i)     the University, its buildings, laboratories, libraries and other facilities;\n(ii)    any institution, department or hostel maintained by the University;\n(iii)   the adequacy of financial and human resources;\n(iv)    the teaching, research, curriculum, examination and other matters of the\nUniversity; and\n(v)     such other matters as may be specified by him.\n(2) The Patron shall communicate to the Board his views with regard to the result of a\nvisitation and shall, after ascertaining the views of the Board, advise the Board on the action to be\ntaken by it.\n(3) The Board shall, within such time as may be specified by the Patron, communicate to him\nsuch action, if any, as has been taken, or may be proposed to be taken, upon the results of visitation.\n(4) Where the Board does not, within the time specified, take action to the satisfaction of the\nPatron, he may issue such directions as he may deem fit and the Board shall comply with all such\ndirections."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Vice",
      "content": "Chancellor.____ (1) The Vice-Chancellor who shall be an eminent scholar of\ninternational repute and an educationist of distinction shall be appointed by the Chancellor on the\nrecommendation of the Board for a period of four years and on such terms and conditions as the\nChancellor may determine.\n(2) The Vice-Chancellor shall be the chief academic and administrative officer of the\nUniversity and shall be responsible for the implementation of the decisions of the Board and for the\neffective execution of the programmes of the University in accordance with the guidelines and\npolicies formulated by the Board.\n(3) The Vice-Chancellor shall also have the powers,––\n(i)     to submit plans of work and budget estimates of the University for the\nconsideration of the Board;\n(ii)    to direct the activities connected with the execution of programmes for\ninstruction, training, research, services to community, etc.;\n(iii)   to authorize expenditure provided for in the approved budget and to re-\nappropriate funds Within the same major head of expenditure and report it to\nthe Board in the next meeting.\n(iv)    to sanction and re-appropriate an amount not exceeding one hundred thousand\nrupees for an unforeseen item not provided for in the budget and report it to\nthe Board in the next meeting;\n(v)     to appoint, with the approval of the Board, teachers, officers and members of\nthe staff of the University and such other persons as may be necessary in\naccordance with policies and procedures approved by the Board so as to\nensure the highest intellectual and moral qualities in the person appointed;\n(vi)    to submit to the Board, in accordance with the rules of procedure, reports on\nthe activities of the University and the execution of the plans of work;\n(vii)   to create and fill temporary posts for a period not exceeding six months; and\n(viii) to undertake any work assigned by the Board."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Board of Governors",
      "content": "__ (1) There shall be a Board of Governors consisting of the\nfollowing, namely,––\n(i)     the Chancellor who shall be its Chairman;\n(ii)    the Chairman Higher Education Commission or his nominee;\n(iii)   a retired Judge of the Supreme Court, or a High Court, to be nominated by the\nChief Justice of Pakistan, or as the case may be, the Chief Justice of the\nconcerned High Court;\n(iv)    a Vice-Chancellor or an eminent scholar to be nominated by the Chancellor;\n(v)     five nominees of the Trust;\n(vi)    the Chairman, Federation of Chambers of Commerce and Industry or Vice-\nChairman as his nominee;\n(vii)   one scientist of international repute to be nominee of the Board.\n(viii) the Secretary, Ministry of Education, Government of Pakistan, or his nominee\nnot below the rank of a Joint Secretary; and\n(ix)    the Vice-Chancellor who shall act as Secretary of the Board;\n(2) Members of the Board, other than ex officio members, shall hold office for three years,\nfrom the date of appointment.\n(3) The Chairman of the Board may nominate any member of the Board to act as Chairman in\nhis absence.\n(4) No act or proceedings of the Board shall be invalid by reasons only of the existence of a\nvacancy in, or any defect in the constitution of, the Board."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Powers and functions of the Board of Governors",
      "content": "__ (1) The Board of Governors shall\nhave the powers,––\n(i)     to hold, control and administer the property, funds and resources of the\nUniversity and raise funds upon such security as may be required under\nRegulations;\n(ii)    to undertake responsibility for the financial viability of the University\nincluding responsibility for ensuring effectiveness of its operations, their\ncontinuity and preservation of the autonomy of the University;\n(iii)   to consider and pass the resolution of the annual report, plan of work,\nstatement of accounts and the annual budget estimates;\n(iv)    to formulate and approve the principles, policies and the plans governing the\nactivities and operations of the University so as to facilitate research, teaching\nand other academic work;\n(v)     to make statutes and revise them from time to time for the efficient and\neffective operation of the University;\n(vi)    to create such Faculties, Departments or Institutes and to constitute such\nstanding committees, committees, sub-committees, councils and other\nadministrative or academic advisory bodies as it deems necessary and review\ntheir work;\n(vii)   to consider annual reports relating to the activities of the University and the\nexecution of the plans of work and to direct the Vice-Chancellor to furnish\ninformation relating to any matter specified by the Board;\n(viii) to create such academic or administrative posts as it may deem necessary and\nto make appointments to such posts;\n(ix)    to take such initiatives as it may consider necessary or desirable for the\nefficient and effective management and functioning of the University;\n(x)    to appoint teachers and other employees in BPS-17 and above on the\nrecommendation of the Selection Board; and\n(xi)   to delegate any of its powers to an Authority or officer or a committee.\n(2) The Board may, subject to such conditions as it may deem fit to impose, delegate any of\nits powers to the Vice-Chancellor."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Meeting of the Board of Governors",
      "content": "(1) The Board shall meet at least twice in a year\non dates to be fixed by the Vice-Chancellor in consultation with the Chancellor provided that a\nspecial meeting may be called at any time by the Chancellor, Vice- Chancellor or on a request by not\nless than five members of the Board to consider any matter of urgent nature.\n(2) In the case of a special meeting not less than ten clear days notice shall be given to the\nmembers of the Board and the agenda of the meeting shall be restricted to the matter for which the\nspecial meeting is called.\n(3) The quorum for a meeting of the Board shall be one half of its members a fraction being\ncounted as one.\n(4) The decisions of the Board shall be based on the majority vote of the members present\nand voting.\n(5) In case of equality of votes the Chairman of the Board shall have, and exercise, a casting\nvote."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Academic and administrative staff",
      "content": "__ (1) The academic and administrative staff of the\nUniversity shall be selected with a view to achieving its stated objectives and the basic criteria for\ntheir selection shall be the highest standards of competence, integrity and efficiency.\n(2) In the case of academic staff, academic qualification and fringe benefits shall not be less\nthan those duly approved by the Higher Education Commission for such appointments."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. University Fund, audit and accounts",
      "content": "__ (1) The University shall have a Fund to which\nshall be credited its income from fees, donations, trusts, bequests, endowments, grants, contributions\nand any other sources.\n(2) No contribution, donation or grant which may directly or indirectly involve any\nimmediate or subsequent financial liability of the University or which may involve an activity not\nincluded in its programmes for the time being shall be accepted without the prior approval of the\nBoard.\n(3) The accounts of the University shall be maintained in such form and in such manner as\nmay be prescribed.\n(4) The accounts of the University shall be audited each year within four months of the\nclosing of the financial year of the University by a Chartered Accountant appointed by the Board.\n(5) The accounts, together with the report of the auditor thereon, shall be submitted to the\nBoard for approval.\n(6) The auditor's report shall certify that the auditor has complied with the standards of audit\nand certification laid down by the institute of Chartered Accountants of Pakistan."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. The Academic Council",
      "content": "__ (1) The Academic Council shall consist of,––\n(i)     the Vice-Chancellor who shall be its Chairman;\n(ii)    all the Deans;\n(iii)   all the Heads of the Departments and Institutes;\n(iv)    all Professors of the University;\n(v)     nominee of the Secretary, Ministry of Education not below the rank of a\nDeputy Secretary;\n(vi)    two Associate Professors, two Assistant Professors, and two Lecturers to be\nnominated by the Board;\n(vii)   three persons, eminent in the field of their specialization because of their\nexperience and achievements, to be nominated by the Board;\n(viii) the Advisor Academics, Higher. Education Commission or nominee; and\n(ix)    the Registrar who shall act as Secretary of the Academic Council.\n(2) Members, other than ex-officio members, shall hold office for three years from the date of\nappointment.\n(3) The quorum for a meeting of the Academic Council shall be one-third of the total number\nof members, a fraction being counted as one."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Powers and duties of the Academic Council.",
      "content": "__ (1) The Academic Council shall be the\nacademic body of the University and shall, subject to the provisions of this Ordinance and the\nStatutes, have the powers to lay down proper standards of instructions research, publication and\nexamination and to regulate and promote the academic life of the University.\n(2) In particular and without prejudice to the generality of the foregoing provisions and the\nStatutes, the Academic Council shall have the powers,––\n(i)     to advise the Board on academic matters;\n(ii)    to regulate teaching, research, publication and examinations;\n(iii)   to regulate the admission of students to the courses of studies and\nexaminations in the University;\n(iv)    to regulate the conduct and discipline of the students of the University;\n(v)     to propose to the Board scheme for the constitution and organization of\nFaculties and teaching departments;\n(vi)    to consider or formulate proposals for the planning and development of\nteaching and research in the University;\n(vii)   to make Regulations prescribing the course of studies, the syllabi and the\noutlines of tests for all University examinations subject to the approval of the\nBoard;\n(viii) to regulate the award of studentships, scholarships, medals and prizes;\n(ix)    to make Regulations for submission to the Board;\n(x)     to appoint or nominate members to the Authorities in accordance with the\nprovisions of this Ordinance; and\n(xi)    to perform such other functions as may be prescribed by Statutes, Regulations\nand Rules."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Constitution, functions and powers of other Authorities",
      "content": "__ The constitution,\nfunctions and the powers of the Authorities, for which no specific provision has been made in this\nOrdinance, shall be such as may be prescribed by Statutes, Regulations and Rules."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Appointment of committees by the Authorities",
      "content": "__ The Board, the Academic Council\nand other Authorities may, from time to time appoint such standing, special or advisory committees\nas they may deem fit and may nominate such persons on these committees who are not members of\nthe Authorities."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Provision",
      "content": "__ The University shall work within the framework of the education policy as\nthe Federal Government may, from time to time, make."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Statutes",
      "content": "__ (1) Subject to .the provisions of this Ordinance, Statutes may be made to\nregulate or prescribe all or any of the following matters, namely,––\n(a)     terms and conditions of service of employees of the University including\nscales of pay, pension, insurance, gratuity, provident fund, benevolent fund\nand other fringe benefits;\n(b)     terms and conditions, fee, remuneration for examiners, teachers, researchers\nand such other officers;\n(c)    establishment of other faculties, academic units, research centres and\ndivisions;\n(d)    conditions under which the University may enter into arrangements with other\npublic or private organizations for purpose of affiliation of institutions,\nresearch and other scholarly activities;\n(e)    conditions of appointment of Professors Emeritus;\n(f)    efficiency and discipline rules of the employee of the University;\n(g)    acquisition and administration of properties and investments of the University;\nand\n(h)    all other matters which under this Ordinance are required to be or may be\nprescribed or regulated by Statutes.\n(2) The draft Statutes shall be proposed by the Board for consideration and approval by the\nChancellor."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Regulations",
      "content": "__ (1) Subject to the provisions of this Ordinance and the Statutes, the\nAcademic Council may make Regulations for all or any of the following matters, namely,––\n(a)    scheme of studies and research, including the duration of courses, number of\nsubjects or papers for examinations;\n(b)    syllabi and courses of study and research programmes leading to degrees,\ndiplomas or certificates;\n(c)    methodology for selection and admission of students;\n(d)    conduct and supervision of examinations, appointment of examiners and\nscrutiny and tabulation of results;\n(e)    determination of fees and other charges for admission to various courses;\n(f)    maintenance of discipline among students and schemes for their welfare;\n(g)    institution of fellowships, scholarships, prizes, medals, honorarium and other\nfinancial assistance to students and research scholars;\n(h)    conduct of convocation and manner in which they are to be conducted; and\n(i)    all other academic matters which are to be or may be prescribed by\nRegulations.\n(2) The Regulations shall be approved by the Board on the recommendation of the Academic\nCouncil.\n(3) No Regulation shall be valid until it has been approved by the Board."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Rules",
      "content": "__ The Academic Council may make rules, consistent with this Ordinance, the\nStatutes and the Regulations, to regulate any other matter relating to the affairs of the University\nwhich under this Ordinance are not specifically required to be provided for by the Statutes or the\nRegulations."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. First Statute",
      "content": "__ Notwithstanding anything contained in this Ordinance, the Statutes set\nout in the Schedule to this Ordinance shall be deemed to be the First Statutes made under section 23\nand shall remain in force until they are amended or replaced by new Statutes made in accordance\nwith this Ordinance."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Interpretation",
      "content": "__ If any difficulty arises as to the interpretation of any provision of this\nOrdinance, it shall be placed before the Chancellor whose decision thereon shall be final."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Removal of difficulties",
      "content": "__ (1) If any difficulty arises in giving effect to the provisions of\nthis Ordinance, the Chancellor shall make such order, not inconsistent with the provisions of this\nOrdinance, as may appear to him to be necessary for removing the difficulty.\n(2) Where this Ordinance makes any provision for anything to be done, but no provision has\nbeen made as respects the authority by whom, or the time at which, or the manner in which, it should\nbe done, then it shall be done by such authority, at such time and in such manner as the Chancellor\nmay direct.\n(See section 26)"
    }
  ],
  "definitions": [
    {
      "term": "Academic Council",
      "definition": "the Academic Council of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "any of the Authorities of the University specified in section 7;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of Governors of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Board;",
      "source_provision": "sec2"
    },
    {
      "term": "Chancellor",
      "definition": "the Chancellor of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Dean",
      "definition": "the Dean of a Faculty of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Faculty",
      "definition": "the Faculty of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Head",
      "definition": "Head of a teaching department of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Patron",
      "definition": "the Patron of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Prescribed",
      "definition": "prescribed by Statutes, Regulations and Rules;",
      "source_provision": "sec2"
    },
    {
      "term": "Registrar",
      "definition": "the Registrar of the University;",
      "source_provision": "sec2"
    },
    {
      "term": "teacher",
      "definition": "Professor, Associate Professor, Assistant Professor and Lecturer engaged whole time by the University for teaching degree and post- graduate classes and includes such other persons as may be declared as “Teachers” by Regulations;",
      "source_provision": "sec2"
    },
    {
      "term": "teaching department",
      "definition": "teaching department established and maintained by the University;",
      "source_provision": "sec2"
    },
    {
      "term": "Trust",
      "definition": "Islamic International Medical College Trust;",
      "source_provision": "sec2"
    },
    {
      "term": "University",
      "definition": "the Riphah International University established under this Ordinance; and",
      "source_provision": "sec2"
    },
    {
      "term": "Vice Chancellor",
      "definition": "the Vice-Chancellor of the University;",
      "source_provision": "sec2"
    }
  ]
}
