{
  "id": "pk-rulers-of-acceding-states-abolition-of-privy-purses-and-privileges-order-1972",
  "type": "statute",
  "title": "Rulers of Acceding States (Abolition of Privy Purses and Privileges) Order, 1972",
  "title_en": "Rulers of Acceding States (Abolition of Privy Purses and Privileges) Order, 1972",
  "short_name": "ROASO",
  "status": "in_force",
  "issued_date": "1972-04-15",
  "in_force_date": "1972-04-15",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5dm-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Rulers of Acceding States (Abolition of Privy Purses and Privileges) Order, 1972 published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Power to interpret, etc",
      "content": "THE RULERS OF ACCEDING STATES (ABOLITION OF PRIVY PURSES\nAND PRIVILEGES) ORDER, 1972\n(PRESIDENT’S ORDER NO. 15 OF 1972)\n[16th April, 1972]\nWHEREAS it is expedient to abolish the privy purses of, and other privileges admissible to,\nthe Rulers of Acceding States:\nNOW, THEREFORE, in pursuance of the Proclamation of the 25th day of March, 1969, read\nwith the Proclamation of the 20th day of December, 1971, and in exercise of all powers enabling him\nin that behalf, the President and Chief Martial Law Administrator is pleased to make the following\nOrder:___"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "_(1) This Order may be called the Rulers of Acceding\nStates (Abolition of Privy Purses and Privileges) Order, 1972.\n(2) It shall come into force at once and shall be deemed to have taken effect on the 22nd day\nof December, 1971."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Order to override other laws. The provisions of this Order shall have effect",
      "content": "notwithstanding anything contained in the Provisional Constitution Order or in any other law for the\ntime being in force, or in any Instrument of Accession or any agreement with a Ruler."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Interpretation. In this Order, unless there is anything repugnant in the subject or context,",
      "content": "_\n(a)       “Acceding State” means a State which has at any time after the fourteenth day\nof August, 1947, been in accession with Pakistan;\n(b)         “Privy purse” include any allowance whatever payable to a Ruler under any\nInstrument of Accession, or other agreement;\n(c)         “Ruler” means a Ruler of an Acceding State, howsoever designated, and\nincludes a person recognized before the commencement of this Order under\nthe Rulers (Recognition of Successors) Order, 1960 (P.O. No. 15 of 1960), as\nthe successor such Ruler."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Abolition of privy purses and withdrawal of other privileges. The right of a Ruler to a",
      "content": "privy purse, and all other privileges or titles guaranteed or granted to a Ruler by or under any\nInstrument of Accession, agreement or under any law, are hereby abolished."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Maintenance allowance",
      "content": "_(1) The 1[Federal Government] may grant with effect from the\ncommencement of this Order, in lieu of the privy purse and other privileges of a Ruler abolished under\nArticle 4, maintenance allowance to___\n1\nSubs. by F.A.O., 1975, Art. 2 and Table for “Central Government”.\n(a)       such Ruler at the rate not exceeding the amount of the privy purse guaranteed\nor assured to him reduced, however, by the amount, if any, payable out of such\nprivy purse by the way of allowance or otherwise to any dependent of the Ruler;\nand\n(b)       a dependent of such Ruler who, immediately before such commencement, was\nentitled to receive out of the privy purse of such Ruler any payment by way of\nallowance or otherwise at the rate at which he was entitled, subject to any\nreduction that the 1[Federal Government] may order.\n(2) Any grant of maintenance allowance under clause (1) to a Ruler or a dependent of a Ruler\nshall ordinarily be for the duration of his life and shall be subject to the condition that such Ruler or\ndependent bears true faith and allegiance to Pakistan, conscientiously discharges the obligations as\ncitizen of Pakistan and faithfully acts in the interest of the integrity and solidarity of Pakistan.\n2\n[(3) Notwithstanding anything contained in clause (1) and subject to clause (2), the Federal\nGovernment may, for reasons to be recorded in writing, increase maintenance allowance of a Ruler or,\nas the case may be, a dependent of a Ruler.]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Articles 4 and 5 to apply to certain Nawabs. The provisions of Articles 4 and 5 shall, so",
      "content": "far as may be, apply to the Nawabs of Dera, Tank and Deri, the Shaikh Sahib of Mangrol and the\nTalukdars of Sardargadh, Sultanabad and Bantwa in the same manner as they apply to a Ruler, in\nrespect of any allowance of whatever kind payable, or any privilege granted, to them before the\ncommencement of this Order."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Additional power of the President. Nothing contained in this Order shall be construed to",
      "content": "limit or derogate from the power of the President to grant to a Ruler any privilege, facility or concession\nfor such period and or such conditions as he may determine."
    }
  ],
  "definitions": []
}
