{
  "id": "pk-rules-of-business",
  "type": "statute",
  "title": "Rules of Business",
  "title_en": "Rules of Business",
  "short_name": "ROB",
  "status": "in_force",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tibg%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Rules of Business published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Inter",
      "content": "Division procedure……………………………………………………………… 6-7"
    },
    {
      "provision_ref": "sec14a",
      "section": "14A",
      "title": "Section 14A. Consultation with the Revenue Division ……………………..………………………. 10",
      "content": "PART C.—REFERENCES TO THE PRIME MINISTER AND THE PRESIDENT"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Procedure regarding Inter",
      "content": "Provincial Conference……………………………..……… 17"
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Non",
      "content": "Official Bills ………………………………………………………..………….. 21"
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Official and non",
      "content": "official amendments to Bills………………………..……………… 22"
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Ordinances …………………………………………………………………………… 22",
      "content": "PART F.—RELATIONS WITH MAJLIS-E-SHOORA (PARLIAMENT)"
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Summoning of Majlis",
      "content": "e-Shoora (Parliament) a House or Joint sitting by the President...... 22"
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Prorogation of Majlis",
      "content": "e-Shoora (Parliament) a House or Joint sitting by the President….. 22-23"
    },
    {
      "provision_ref": "sec58",
      "section": "58",
      "title": "Section 58. Repeal …………………………………………..…………………………………… 29",
      "content": "Schedule I.     List of Ministries and Divisions …………………………………………… 30-31\nSchedule II.    Distribution of business among the Divisions ……………………….…..… 32-70\nSchedule III    List of Attached Departments declared as such by the Federal Government.. 71-73\nSchedule IV.    List of officers authorized to make and execute orders and other instruments\nin the name of the President …………………………………………….…..… 74\nSchedule 5A.    List of cases to be submitted to the Prime Minister for his orders……….…… 75-77\nSchedule VB.    List of cases requiring orders of the President on the advice of the Prime\nMinister……………………………………………………………………….. 78-80\nSchedule VI.    List of cases to be submitted to the President for his orders in his discretion… 81\nSchedule VII.   Cases and papers to be submitted to the President for information………..… 82\n(ii)\nIn exercise of the powers conferred by Articles 90 and 99 of the Constitution of the\nIslamic Republic of Pakistan, the Federal Government is pleased to make the following\nrules:-\nPART A.--GENERAL"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Title and commencement",
      "content": "-(1) These rules may be called the \"Rules of\nBusiness, 1973.\"\n(2)     They shall come into force on the fourteenth day of August 1973."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "-(1) In these rules, unless there is anything repugnant in the\nsubject or context:\n(i)       \"Assembly\" means the National Assembly;\n(ii)      \"Attached Department\" means a Department which has direct relation\nwith a Division and has been declared as such by the Federal\nGovernment;\n(iii)     \"business\" means all work done by the Federal Government;\n(iv)      \"Cabinet\" means and consists of the Prime Minister and the Federal\nMinisters;\n(v)       \"case\" means a particular matter under consideration and includes all\npapers relating to it and required to enable the matter to be disposed of,\nviz., correspondence and notes, and also any previous paper on the\nsubject or subjects covered by it or connected with it;\n(vi)      \"Division\" means a self-contained administrative unit responsible for\nthe conduct of business of the Federal Government in a distinct and\nspecified sphere and declared as such by the Federal Government;\n(vii)     \"Federal Secretariat\" means the Divisions or the Ministries when\nreferred to collectively;\n(viii) \"Gazette\" means the official Gazette of Pakistan,\n(ix)      \"Government\" means the Federal Government;\n1\n(x)   \"Leader of the House\" means the Member of the Parliament appointed\nby the Prime Minister to regulate official business in the Assembly, the\nSenate or the Majlis-e-Shoora (Parliament) in joint sitting, as the case\nmay be;\n(xi)      \"Local administration\" means the agency through which the President\nadministers a territory subject to his direct administrative control;\n(xii) \"Member\" means a member of the Assembly or the Senate;\n(xiii) \"Minister\" means the Federal Minister-in-Charge of the Ministry to\nwhich a particular case pertains and includes a Minister without\nportfolio and a Minister of State;\n1\nSubstituted vide SRO 623(I)/2021 dated 27-05-2021\n4\n(xiv)    \"Ministry\" means a Division or group of Divisions constituted as a\nMinistry;\n1\n(xv) \"Majlis-e-Shoora (Parliament)” shall having the same meaning as\nassigned thereto in Article 50 of the Constitution of the Islamic\nRepublic of Pakistan;\n(xvi)    \"Provincial Government\" means the Government of a Province of\nPakistan;\n(xvii) \"Schedule\" means a Schedule to these rules;\n(xviii) \"Secretary\" means the 2[Secretary General], Principal Secretary,\nSecretary, 3[Special Secretary] or Acting Secretary to the Government\nof Pakistan in charge of a Division or a Ministry, and where there is no\nSecretary, the Additional Secretary, Senior Joint Secretary or Joint\nSecretary in charge of the Division or the Ministry;\n(xix)    \"Section\" means a basic working unit in a Division as determined by\nthe Government;\n(xx)     \"Subordinate Office\" means a Federal Government office other than a\nMinistry, Division or an Attached Department.\n(2)      All words and expressions used in these rules but not defined, have the\nsame meaning as in the Constitution of the Islamic Republic of\nPakistan.\n1\nSubstituted vide SRO 623(I)/2021 dated 27-05-2021\n2\nInserted vide S.R.O. 226(I)/2010 (F.No.4-4/2007-Min-I), dated 02.4.2010\n3\nInserted vide SRO 428 (1)/2018 dated 04-04-2018\n5"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Allocation of Business",
      "content": "-(1) The Federal Secretariat shall comprise the\nMinistries and Divisions shown in Schedule I.\n(2)    The Prime Minister may, whenever necessary, constitute a new Ministry\nconsisting of one or more Divisions.\n(3)     The business of government shall be distributed among the Divisions in the\nmanner indicated in Schedule II:\nProvided that the distribution of business or the constitution of the Division\nmay be modified from time to time by the Prime Minister.\n(4)  The Prime Minister shall allocate amongst his Ministers the business of\nGovernment by assigning several Divisions specified in Schedule I to the charge of a\nMinister:\n1\nProvided that a Ministry or a Division not so assigned shall be in the charge\nof the Prime Minister who for smooth functioning of the Division may also delegate his\nfunctions as Minister-in-Charge, either wholly or partly, to a Minister of State and an Adviser\nto the Prime Minister:\nProvided further that more than one Division may be assigned to a Minister."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Organization of Divisions",
      "content": "- (1) Each Division shall consist of a Secretary to\nGovernment and of such other officials subordinate to him as the Government may\ndetermine:\nProvided that the same person may be Secretary of more than one Division.\n(2)     The Secretary shall be the official head of the Division and shall be\nresponsible for its efficient administration and discipline and for the proper conduct of\nbusiness assigned to the Division under rule 3 (3) and for the due execution of the sanctioned\npolicy\n3)      The Secretary shall organize the Division into a number of working units to be\nknown as Sections:\nProvided that a unit which does not conform to a Section may be organized\notherwise than as a Section on a permanent basis, in consultation with the Establishment\nDivision.\nNote:- In the case of an extraordinary working unit such as a research cell or\nan Office of the Officer on Special Duty, it will be sufficient if the\nEstablishment Division is informed of the composition of the unit.\n(4)     The Attached Departments as allocated to the various Divisions are shown in\nSchedule III.\n(5)    The business of Government, other than the business done in the Federal\nSecretariat or the Attached Departments, shall be conducted through such agencies and\noffices as the Prime Minister may determine from time to time.\n(6)     There may be a Special Assistant or Special Assistants to the Prime Minister\nwith such status and functions as may be determined by the Prime Minister.\n1\nSubstituted vide SRO 389(I)/2025 dated 24 th March, 2025\n6"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Transaction of Business",
      "content": "-(1) No important policy decision shall be taken except\nwith the approval of the Prime Minister.\n(2)        It shall be the duty of a Minister to assist the Prime Minister in the formulation\nof policy.\n1\n(2A)    The Prime Minister may, from amongst the Ministers, designate a Minister to\nbe the Deputy Prime Minister and assign him such functions as he may deem appropriate for\nefficient performance of the functions of the Federal Government. In case a Minister had\nalready been so designated, before the coming into force of this Notification, he shall be\ndeemed to have been designated under this sub-rule.\n(3)     The Minister shall keep the Prime Minister informed of any important case\ndisposed of by him without reference to the Prime Minister.\n(4)    No decisions of policy taken by the Prime Minister shall be varied, reversed or\ninfringed without consulting him.\n(5)    Subject to sub-rule (1), the Minister shall be responsible for policy concerning\nhis Division.\n(6)      No officer other than a Secretary, Additional Secretary or Joint Secretary shall\ntake the initiative in approaching a Minister in connection with the official business. If an\nAdditional Secretary or Joint Secretary holds an oral discussion with his Minister, he shall\ncommunicate the points made during discussion to the Secretary at the first possible\nopportunity.\n(7)    The Head of an Attached Department may see a Minister:\nProvided that the Secretary of the Division concerned shall be informed of the\nproposed interview so that he can be present if he so desires.\n(8)     The business of the Division shall ordinarily be disposed of by or under the\nauthority of the Minister-in-Charge.\n(9)    The Secretary shall --\n(a)       assist the Minister-in-Charge in the formulation of policy;\n(b)       duly execute the sanctioned policy;\n(c)       submit all proposals for legislation to the Cabinet with the approval\nof the Minister.\n(d)       keep the Minister-in-Charge generally informed of the working of the\nDivision and of any important case disposed of without reference to\nthe Minister;\n2\n(e)   unless any other official stands notified in this behalf, be the\nprincipal accounting officer for the purpose of clause (q) of section\n2    of    the   Public    Finance     Management       Act,    2019\n(V of 2019);\n(f)       subject to the provisions of these rules and with the approval of the\nMinister-in-Charge, issue standing orders laying down the manner of\ndisposal of cases in the Division, including the distribution of work\namongst the officers of his Division and such orders may specify the\ncases or class of cases which may be disposed of by an officer\n1\nInserted vide SRO 2062(I)/2024 dated 18-12-2024\n2\nSubstituted vide SRO 1434 (I)/2024 dated 11-09-2024\n7\nsubordinate to him; and\n(g)      be responsible for the careful observance of these rules and, where he\nconsiders that there has been any material departure from them, either\nin his own or any other Division, he shall bring the matter to the notice\nof the Minister-in-Charge and, if necessary, to the notice of the Prime\nMinister or the Cabinet.\n(10) When the Secretary submits a case to the Minister, the latter may accept the\nproposals or views of the Secretary or may over-rule him. The Secretary will normally defer\nto the decision of the Minister and implement it. In case, however, the Secretary feels that the\ndecision of the Minister is manifestly wrong and will cause gross injustice or undue hardship,\nhe may state his reasons and re-submit the case to the Minister. If the Minister still adheres to\nhis earlier decision and the matter is important enough, the Secretary shall request the\nMinister to refer the case to the Prime Minister and the Minister shall so refer the case for\norders of the Prime Minister. If the case is not referred to the Prime Minister, the Secretary\nshall submit it directly to the Prime Minister with observations of the Minister-in-Charge.\n(11) The Minister-in-Charge shall be responsible for conducting the business of the\nDivision in the Assembly.\n(11A) Verbal orders given by a functionary of the Government should as a matter of\nroutine be reduced to writing and submitted to the issuing authority. If time permits, the\nconfirmation shall invariably be taken before initiating action. However, in an exigency\nwhere action is required to be taken immediately or it is not possible to obtain written\nconfirmation of the orders before initiating action, the functionary to whom the verbal orders\nare given shall take the action required and at the first available opportunity obtain the\nrequisite confirmation while submitting to the issuing authority a report of the action taken by\nhim.\n(12) If any doubt or dispute arises as to the interpretation of these rules or the\nDivision to which a case properly pertains, the case shall be referred to the Cabinet Division,\nwhose decision shall be final. The Cabinet Division shall obtain the orders of the Prime\nMinister where necessary.\n(13) Instructions ancillary to these rules shall, whenever considered desirable, be\nissued by the Cabinet Division:\nProvided that the special or general orders required to be framed by the Divisions in terms\nof these rules may be issued by them after consulting the Cabinet Division.\n(14) If any order passed happens to contravene a law, rule or policy, it shall be the\nduty of the next below officer to point out this to the authority passing the order.\n(15) Detailed instructions for the manner of disposal of business in the Federal\nSecretariat shall be issued by the Establishment Division in the form of Secretariat\nInstructions."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Individual and collective responsibility",
      "content": "- The Cabinet shall collectively be\nresponsible for the advice tendered to, or the executive orders issued in the name of the\nPresident whether by an individual Minister or as a result of decision by the Cabinet; but the\nMinister shall assume primary responsibility for the disposal of business pertaining to his\nportfolio."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Orders and instruments, agreements and contracts",
      "content": "-(1) Subject to Article\n173, all executive actions of the Government shall be expressed to be taken in the name of the\nPresident.\nNote.- The use of the expression \"Federal Government\" in relation to\nthe Provincial Governments and \"Government of Pakistan\" in relation\nto foreign Government shall be in order.\n8\n(2)   The officers listed in Schedule IV may authenticate by signature all orders and\nother instruments made and executed in the name of the President:\nProvided that in certain cases an officer may be so authorised for a particular occasion\nby order of the Prime Minister.\n(3)    Instructions regarding the manner of authentication of orders and instruments\nin connection with the representation of Pakistan in foreign countries or at international\nconferences and of international agreements and treaties shall be issued by the Foreign\nAffairs Division.\n(4)    Instructions for the making of contracts on behalf of the President and the\nexecution of such contracts and all assurances of property shall be issued by the Law and\nJustice Division.\nPART B.-CONSULTATION AMONG DIVISIONS"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Secretaries' Committee",
      "content": "(1) There shall be a Secretaries' Committee to\ndiscuss matters referred to it by a Division, a Minister-in-Charge, the Prime Minister or\nthe Cabinet, in which collective experience and collective wisdom of the senior officers could\nbe consulted, to the benefit of the subject under consideration.\n(2)   All cases, wherein two or more Divisions have different point of view, may be\nconsidered by the Secretaries' Committee for its resolution or firming up clear\nrecommendations on the issues, before being submitted to the Prime Minister or the Cabinet.\n(3)     All policy matters pertaining to the career progression, service structure and\nterms and conditions of civil servant may be placed before the Secretaries' Committee for\neliciting views and recommendation before submission to the Prime Minister or the Cabinet.\n(4)      The Cabinet Secretary, at least once in a quarter, shall present before the\nCabinet a resume of the decisions and recommendations made by Secretaries' Committee on\nvarious issues.\n(5)    In a matter discussed in the Secretaries’ Committee, if the Secretary of a\nDivision has agreed to a proposal, it shall not be necessary to consult his Division again on\nthat proposal.\n(6)     When a matter is referred to a Committee or working group and a Division is\nrepresented therein by an officer of or above the rank of Joint Secretary, the agreed decision\nof the Committee or working group shall be treated as final and shall not be subjected to\nfurther scrutiny in that Division.\n(7)     The Secretaries’ Committee shall meet at least once a month unless there are\nno items for discussion.\n(8)     Other instructions regarding the submission of cases to the Secretaries’\nCommittee shall be issued by the Cabinet Division."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Consultation with the Cabinet Division",
      "content": "- (1) No Division shall, without\nprevious consultation with the Cabinet Division, issue or authorise the issue of any orders\nwhich involve,-\n1\nSubstituted vide SRO 623(I)/2021 dated 27-05-2021\n10\n(a)     the interpretation of these rules;\n(b)     a change in the allocation of business between the various Divisions of\na Ministry; and1\n(c)     the strength, terms and conditions of service of the personal staff of\nMinisters, Ministers of State, Special Assistants to the Prime Minister\nand other dignitaries who enjoy the rank and status of a Minister or\nMinister of State.2\n(d)     Omitted vide SRO 1434 (I)/2024 dated 11-09-24.\n(2)    Proposals regarding any directions by the President to the Governor of a\nProvince under clause (1) of Article 145 shall be submitted to the President by the Division\nconcerned but a copy of the Presidential directive will be supplied to the Cabinet Division.\n(3)     The Divisions concerned shall obtain clearance of the Cabinet Division to the\nproposals for the sending of delegations which are not in conformity with the procedure laid\ndown by that Division regarding the categorization of international conferences."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Consultation with the Establishment Division",
      "content": "- No Division shall, without\nprevious consultation with the Establishment Division, issue, or authorize the issue of, any\norders, other than orders in pursuance of any general or special delegation made by the\nEstablishment Division, which involve –\n(a) &(b) Deleted vide Cabinet Division Memo. No.104/59/78-Min.I,\ndated 5-7-1979.\n(c)       Appointment to a post in BS-20 and above and equivalent whether by\ninitial appointment or promotion or transfer.\n(d)       a change in the terms and conditions of service of Federal civil\nservants;\n(e)       a change in the statutory rights and privileges of any Federal\nGovernment servant;\n(f)       Omitted vide SRO No.246 (I)/2001, dated 26.4.2001.\n(g)       Omitted vide SRO 1434 (I)/2024 dated 11-09-24.\n(h)       the interpretation of rules and orders made by the Establishment\nDivision; and\n(i)  rules for recruitment to any post or service, including the question of\nremoving a post or service from the purview of the Federal Public\nService Commission for the purposes of recruitment."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Consultation with the Finance Division",
      "content": "(1) No Division shall, without\nprevious consultation with the Finance Division, authorise the issue of any orders, other than\norders in pursuance of any general or special delegation made by the Finance Division, which\nwill affect directly or indirectly the finances of the Federation or which in particular\ninvolve --\n(a)     relinquishment, remission or assignment of revenue, actual or\n1\nInserted vide SRO 1434 (I)/2024 dated 11-09-2024\n2\nSubstituted vide SRO 1434 (I)/2024 dated 11-09-2024\n11\npotential, or grant of a guarantee against it;\n(b)     expenditure for which no provision exists in the budget or for which no\nsanction exists;\n(c)     [Omitted vide Cabinet Division Notification No.4-11/91-Min-I dated\n22.10.1991.];\n(d)     floatation of loan;\n(e)     re-appropriation within budget grant;\n(f)     alteration in the method of compilation of accounts, or of the budget\nestimates;\n(g)     receipt or expenditure of foreign exchange unless already allocated;\n(h)     a change in the terms and conditions of service of Government\nservants on their statutory rights and privileges, which have financial\nimplications;\n(i)     interpretation of rules made by the Finance Division; and\n(j)     omitted vide Cabinet Division Notification No.4-14/98-Min.I dated\n01.12.98.\n(2)     No proposal to which the previous concurrence of the Finance Division is\nrequired shall, so long as concurrence is refused, be proceeded with. If a Minister cannot\nreach agreement with the Minister for Finance and desires to press the proposal, he shall\nsubmit it to the Prime Minister or, if the Prime Minister so desires to the Cabinet. Formal\norders shall not issue until the Finance Division has given its scrutiny to the details of the\nproposal, where no such details have been supplied with the proposal.\n(3)     Except to the extent that power may have been delegated to the Divisions\nunder the rules framed by the Finance Division, every order of an administrative Division\nconveying a sanction to be enforced in audit shall be communicated to the audit authorities\nthrough the Finance Division."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Consultation with the Foreign Affairs Division",
      "content": "- The Foreign Affairs\nDivision shall, subject to orders in pursuance of any general or special delegation made by\nthat Division, be consulted on all matters which affect the foreign policy of Pakistan, or the\nconduct of its foreign relations."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Consultation with the Law and Justice Division",
      "content": "- (1) The Law and Justice\nDivision shall be consulted—\n(a)     on all legal questions arising out of any case;\n(b)     on the interpretation of any law;\n(c)     before the issue of or authorization of the issue of an order, rule,\nregulation, by-law, notification, etc. in exercise of statutory powers;\n(d)     deleted vide Cabinet Division No.104/10/76-Min, dated 26-3-1976.\n(e)     before instituting criminal or civil proceedings in a court of law in\nwhich the Government is involved;\n(f)     whenever criminal or civil proceedings are instituted against the\n12\nGovernment at the earliest possible stage; and\n(g)    before the appointment of a legal adviser in any Division or any office\nor corporation under its administrative control and the Law and Justice\nDivision will make its recommendations after consultation with the\nAttorney General.\n(1A) A Division may, for compelling reasons for a particular case, engage a private\ncounsel and for that purpose shall refer the case to Law and Justice Division\nwhich may, after consultation with the Attorney General, allow engagement of\nsuch counsel on payment of fee by the Division concerned.\n(2)    No Division shall consult, the Attorney General except through the Law and\nJustice Division and in accordance with the procedure laid down by that Division.\nProvided that for the purpose of settlement of its disputes through arbitration at\nnational and international level, the Division concerned may make direct consultation with\nthe Attorney-General for Pakistan.\n(3)      If there is disagreement between the views of the Attorney General and the\nLaw and Justice Division, the case shall be submitted to the Minister for Law and Justice for\nopinion. If the Minister disagrees with the Attorney General, the case shall be referred to the\nPrime Minister for orders who may refer the matter to the Cabinet if he so desires.\n(4)    For any proposed legislation, the Law and Justice Division shall be consulted\nin accordance with rules 27 to 30.\n(5)    Bills or Ordinances received from the Provincial Governments or Governors\nrequiring assent or instructions of the President shall be examined in the Division concerned\nand shall be submitted to the President through the Law and Justice Division."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Reference to the Prime Minister",
      "content": "(1) No order shall be issued without the\napproval of the Prime Minister in-\n(a)     cases involving important policy or departure from important policy;\nNote.- Departure from policy includes departure from a previous\ndecision of the Cabinet or the Prime Minister.\n(b)     cases involving directions to a Governor under Article 145 and to a\nProvincial Government under Article 149;\n(c)     cases where it is proposed that the Federal Government undertake the\nimplementation of an international agreement relating to a subject in\nthe provincial field;\n13\n(d)      cases of Awards-Decorations in recognition of gallantry and academic\ndistinction;\n(e)     cases relating to petitions addressed to the Prime Minister which\nare neither withheld under instructions for the transmission of such\npetitions to the Prime Minister nor accepted;\n(f)      cases relating to mercy petitions against sentences of death passed by\nCourts requiring the exercise of President's prerogative of pardon;\n(g)      cases enumerated in Schedule V-A; and\n(h)      cases involving sanction for the prosecution of the holder of a post\nreferred to in Schedule V-A.\n(2) A case submitted to the Prime Minister for his orders shall include a self-\ncontained, concise and objective summary stating the relevant facts and the points for\ndecision prepared on the same lines as those prescribed in these rules for a summary for the\nCabinet, except that only one copy will be required which may not be printed. The summary\nshall include the specific recommendations of the Minister-in-Charge and shall be\naccompanied by a draft communication, wherever appropriate.\n(3)     Omitted vide Cabinet Division O.M.No.104/8/85-Min-I, dated 4-8-85.\n(4)     In a case in which the Prime Minister's orders are obtained in oral discussion\nby a Minister, Minister of State, Special Assistant to the Prime Minister, Deputy Chairman\nPlanning Commission, Secretary or by any other officer of the Government, a written note\ncontaining a brief record of the discussion and orders of the Prime Minister shall be\nsubmitted to the Prime Minister's Office for information of the Prime Minister.\n(5) The Prime Minister shall:\n(a)      communicate to the President all decisions of the Cabinet relating to\nthe administration of the affairs of the Federation and proposals for\nlegislation;\n(b)      furnish such information relating to the administration of affairs of the\nFederation and proposals for legislation as the President may call for;\nand\n(c)      if the President so requires, submit for consideration of the Cabinet any\nmatter on which a decision has been taken by the Prime Minister or a\nMinister but which has not been considered by the Cabinet.\n15-A. Reference to the President.--(1) Notwithstanding the provisions made in\n1\nthese rules, where in terms of any provision of the Constitution 2[or under any other statutory\nprovision] any function is to be performed or any orders have to be issued by the President or\nhis specific approval is required, the Division concerned shall incorporate a paragraph to this\neffect in the summary entitled as \"Summary for the Prime Minister\". The Prime Minister\nshall render his advice and submit the case to the President. After the President has seen and\napproved the case, it shall be returned to the Prime Minister. The cases to which this sub-rule\napplies are enumerated in Schedule V-B.\n1\nInserted Vide Cabinet Division O.M.No.104/8/85-Min.I, dated 04.08.85\n2\nInserted vide SRO 623(I)/2021 dated 27-05-2021\n14\n(2)     Notwithstanding the provisions made in these rules, where in terms of any\nprovisions of the Constitution, any function is to be performed or any orders have to be\nissued by the President in his discretion, the Division concerned shall submit the case to the\nPresident through the Prime Minister in the form of a self-contained, concise and objective\nsummary entitled as \"Summary for the President\" stating the relevant facts and points for\ndecision prepared on the same lines as prescribed in these rules for a Summary for the\nCabinet, except that only one copy will be required which may not be printed. This\nprocedure will not, however, be applicable where the President has conveyed the decision to\nthe Prime Minster for issuing orders in respect of cases in his discretion. The cases to which\nthis sub-rule applies are enumerated in Schedule VI.\n(3)     The cases and papers referred to in Schedule VII shall be submitted to the\nPresident for his information.\nPART D.--CABINET PROCEDURE"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Cases to be brought before the Cabinet",
      "content": "-(1) The following cases shall be\nbrought before the Cabinet:-\n(a)       proposals for legislation, official or non-official, including money bills;\n(b)       promulgation and revocation of Ordinances;\n(c)       the budgetary position and proposals before the presentation of an\nAnnual Budget Statement and a Supplementary Budget Statement or\nan Excess Budget Statement under Articles 80 and 84;\n(d)       proposals for levy, abolition, remission, alteration or regulation of any\ntax and floatation of loans;\n(e)       a reference to the Supreme Court for advice on a question of law under\nclause (1) of Article 186;\n(f)       generation of electricity and laying of inter-provincial transmission\nlines;\n(g)       omitted vide S.R.O 368(1)/2010 dated 1st June, 2010;\n1\n(h)   proposals for signing of negotiated instruments with foreign countries\nand approval for ratification of the instruments:\nProvided that all proposals for initiation of negotiation and for entering into any\ncultural or other agreements with any foreign government shall, in the first instance, be\napproved in principle by Minister-in-Charge of the Division concerned and actual\nnegotiations shall be initiated only after such approval:\nProvided further that decisions regarding the composition of all delegations, except\nthose for which important briefs are required, to attend meetings of international bodies may\nbe taken by mutual consultation between the Minister and the Minister for Finance, but the\napproval of the Prime Minister shall be obtained--\n(i)       where the delegation is sponsored by a Division under the direct\ncharge of the Prime Minister or a Division or Divisions under the\ncharge of the Minister for Finance; or\n(ii)      where a Minister is proposed to be included in the delegation:\nProvided further that a decision regarding the opening of an honorary consulate\nabroad may be taken by the Foreign Affairs Division in consultation with the Commerce\n1\nSubstituted vide SRO 910 (1)/2017 dated 8-9-2017(F.No.4-2/2016-Min-I)\n15\nDivision.\n(i)       important reports and documents required to be laid before the\nAssembly or Senate;\n1\n(j)   cases involving a significant impact on political, economic and\nadministrative policies;\nNote.- Cases of this nature shall first be brought to the notice of the\nPrime Minister by the Minister-in-Charge. The Prime Minister will\ndecide whether any such case should be brought before the Cabinet.\n(k)       case which the Minister-in-Charge considers important enough for\ndiscussion in the Cabinet;\n(l)       other cases required to be referred to the Cabinet under the\nprovisions of these rules;\n(m)       any case desired by the Prime Minister to be referred to the Cabinet;\nand\n2\n(n)   appointments required to be made by the Government under any law\nfor the time being in force.\n(2)     Omitted vide S.R.O 623(I)/2021 (F.No.4-11/2019-Min-I), dated 27.5.2021."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Method of disposal of Cabinet cases",
      "content": "-(1) Cases referred to the Cabinet shall\nbe disposed of--\n(a)       by discussion at a meeting of the Cabinet; or\n(b)       by circulation amongst Ministers; or\n(c)       by discussion at a meeting of a committee of the Cabinet:\nProvided that the decisions of the Committee shall be ratified by the\nCabinet unless the Cabinet has authorised otherwise.\nThe Secretary to the Cabinet (hereinafter referred to as the \"Cabinet Secretary\") shall,\nunder the general or special orders of the Prime Minister, indicate the manner in which a case\nshall be disposed of.\n(2)     Committees of the Cabinet may be constituted, and their terms of reference\nand membership laid down by the Cabinet or the Prime Minister. Such Committees may be\nstanding or special committees; accordingly as they are appointed to deal with a class of\ncases or a specific case.\n3\n(3) Upon consideration of a case in the Cabinet, the Cabinet, may constitute\ncommittees to further deliberate on the issue and suggest further course of action. The\ncommittee constituted under this sub-rule shall be distinct from the Cabinet Committees\nconstituted under sub-rule (2) and, apart from the Cabinet members, may also have other\nmembers, as the Cabinet may deem appropriate:\nProvided that report or recommendations of such committees, as the case may\nbe, shall invariably be presented before the Cabinet for consideration and a decision in the\nmatter, if so required.\n1\nSubstituted vide SRO 623(I)/2021 dated 27-05-2021\n2\nAdded vide SRO 623(I)/2021 dated 27-05-2021\n3\nAdded vide SRO 623(I)/2021 dated 27-05-2021\n16"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Manner of submission of Cabinet cases",
      "content": "-(1) In respect of all cases to be\nsubmitted to the Cabinet, the Secretary of the Division concerned shall transmit to the\nCabinet Secretary a concise, lucid and printed memorandum of the case (hereinafter referred\nto as the \"summary\"), giving the background and relevant facts, the points for decision and\nthe recommendations of the Minister-in-Charge. In the event of views of the Division being\ndifferent from the views of the Minister-in-Charge, both the views shall be included in the\nsummary:\n[Proviso deleted vide S.R.O 226(I)/2010 (Cabinet Division’s F.No. 4-4/2007, dated\nnd\n2 April, 2010]\n(2)   In the case of a proposed legislation to which approval is sought in principle,\nthe summary shall bring out clearly the main issues to be legislated upon.\n(3)    The summary shall be self-contained as far as possible, not exceeding two\nprinted pages and may include as appendices only such relevant papers as are necessary for\nproper appreciation of the case. The number of copies of the summary and the form in which\nit is to be drawn up shall be prescribed by the Cabinet Secretary.\n(4)     Where a case concerns more than one Division, the summary shall not be\nsubmitted to the Cabinet unless it has been considered by all the Divisions concerned. In the\nevent of a difference of opinion between them, the points of difference shall be clearly stated\nin the summary, a copy of which shall be sent by the sponsoring Division to other Division\nconcerned simultaneously with transmission of the summary to the Cabinet Division.\n(5)    All draft Bills, Ordinances or Orders shall be submitted to the Cabinet after\nthey have been scrutinized by the Law and Justice Division, and no changes shall be made\ntherein except in consultation with that Division.\n(6)      No case for inclusion in the agenda of a meeting of the Cabinet shall be\naccepted unless it reaches the Cabinet Secretary at least seven clear days in advance of the\nmeeting:\nProvided that, if a case is urgent and is required to be taken up at short notice, the\nSecretary concerned will obtain approval of the Prime Minister for its inclusion in the agenda\nbefore it is transmitted to the Cabinet Secretary.\n(7) It shall be the duty of the Cabinet Secretary to satisfy himself that the papers\nsubmitted by a Secretary are complete and in appropriate form. He may return the case until\nrequirements of the rules have been complied with. If the Cabinet Secretary is satisfied that\nthe case does not merit consideration of the Cabinet he may advise the matter to be placed\nbefore an appropriate forum or require it to be submitted to the Prime Minister."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Procedure regarding circulation of Cabinet cases",
      "content": "-(1) When a case is\ncirculated to Cabinet for recording opinion, the Cabinet Secretary shall specify the time by\nwhich opinions should be communicated to him. If a Minister does not communicate his\nopinion by that time, it shall be assumed that he accepts the recommendations contained in\nthe summary.\n(2)     On expiry of the specified time, the Cabinet Secretary shall submit the\nopinions received to the Prime Minister for decision.\n(3)     If the Prime Minister directs that the case shall be discussed at a Cabinet\nmeeting, the Cabinet Secretary shall circulate the opinions recorded by the Ministers, in the\nform of a supplementary summary.\n(4)    Report made to the Cabinet of action taken on its decisions, and other cases\nsubmitted only for information, shall normally be disposed of by circulation."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Procedure regarding Cabinet Meetings",
      "content": "(1) Meeting of the Cabinet to\ndiscuss ordinary business shall normally be held once a week, on a day and time to be\nspecified by the Prime Minister.\n17\nProvided that the Prime Minister may call for a special meeting of the Cabinet at any\ntime and on any day to discuss urgent business.\n(1A)    Meetings of the Cabinet will be attended by the Federal Ministers.\nProvided that the Prime Minister may require the Ministers of State, Advisers and\nSpecial Assistants to the Prime Minister and other dignitaries to attend any or all meetings of\nthe Cabinet by special invitation.\n(2)     Ministers shall so arrange their tours that they are able to attend the weekly\nCabinet meetings, unless they have obtained the Prime Minister's permission to absent\nthemselves, in which case their Secretary should invariably be in attendance at the Cabinet\nmeeting if any item relating to his Division is on the agenda of the Cabinet meeting.\n(3)     The Prime Minister may authorise the holding of Cabinet meetings during his\nabsence.\n(4)      The Prime Minister shall preside at all Cabinet meetings. In the absence of the\nPrime Minister, a Minister nominated by the Prime Minister shall preside. The\ndecisions taken in the Prime Minister's absence shall be subject to the approval of the Prime\nMinister, unless the Cabinet feels that a particular case is so urgent that immediate action may\nbe taken in anticipation of the Prime Minister's approval.\n(5)    The Cabinet Secretary shall ordinarily issue to the Ministers, three days in\nadvance of a meeting, a circular showing the cases proposed to be placed on the agenda,\ntogether with the summaries relating to such cases. In the case of special meetings, the\nagenda may be issued less than three days in advance. A copy of the agenda, without\nsummaries shall also be supplied to the Secretaries of Divisions.\n(6)     No case shall be discussed nor any issue raised unless the summary relating to\nit has first been circulated:\nProvided that the Prime Minister may, in his discretion or at the representation of a\nMinister, dispense with this requirement if he is satisfied that the circumstances were such\nthat a working paper could not be supplied and the matter could brook no delay.\n(7)     The Secretary shall be in attendance at the cabinet meeting for the purpose of\nthe case relating to his Division even when his Minister attends that meeting.\n(8)     Other officers of the Divisions shall not ordinarily be required to be in\nattendance at the Cabinet meetings except-\n(a)    when information on points within their technical or specialised\nknowledge is required; or\n(b)    when the Minister or the Secretary is unable to attend. In such cases\nany officer may be invited to the meeting by the Cabinet Secretary.\nSuch officers may be asked to join the meeting only for the relevant\ncase and, after giving the information required, shall withdraw from\nthe meeting before discussion is taken up by the Cabinet.\n(9)    If the Secretary of the Division concerned considers that the discussion on a\ncase should await the return of the Minister, he may request the Cabinet Secretary for its\npostponement until the return of the Minister. Similarly, the Secretary may request for the\nwithdrawal of a case belonging to his Division from the agenda of the Cabinet meeting.\n(10) When a case is taken up by a meeting of the Cabinet, the Prime Minister may\nrequest the Minister or the Secretary or any other officer of the Ministry concerned who may\nbe in attendance in accordance with sub-rule (8), to explain the point or points on which a\n18\ndecision is required.\n(11) The Cabinet Secretary and or any other officer of the Cabinet Division\nauthorized by him shall attend all meetings and prepare-\n(a)      a brief record of the discussion which, in the absence of special\ndirections by the Cabinet to the contrary, shall be of an impersonal\nnature;\n(b)      a record of the decisions without any statement of the reasons\ntherefore.\n1\n(12) The Cabinet Secretary shall circulate to the Ministers, and if so desired by the\nPrime Minister, to the Advisers and Special Assistants to the Prime Minister a copy of the\nabove record for perusal and return within twenty four hours of issue.\n(13) A copy of decision of the Cabinet, and wherever considered necessary of the\npoints made during the discussion shall be supplied by the Cabinet Secretary to the Secretary\nof the Division concerned for action under rule 24.\n(14) If a Minister considers that there has been a mistake or omission in recording\nthe minutes, he shall point it out to the Cabinet Secretary within 24 hours of the issue of the\nminutes. The Cabinet Secretary shall obtain the orders of the Prime Minister and, if\nnecessary, issue a corrigendum, correct the official record in the Cabinet Division and advice\nthe Secretary of the Division concerned.\n(15) Where a Minister was unable to attend a Cabinet meeting, and the Secretary\nattended the meeting, the record of the items concerning the Division shall be sent to the\nSecretary."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Procedure regarding National Economic Council",
      "content": "-(1) Meetings of the\nNational Economic Council shall be convened by the Cabinet Division under the directions\nof the Prime Minister who shall preside at the meetings.\n(2)    The Federal and Provincial Ministers and officials of the Divisions concerned\nand of the Provincial Governments may be associated with the deliberations of the National\nEconomic Council as and when considered necessary.\n(3)     The provisions of rules 17, 18 and 20 shall apply mutatis mutandis to the\nmanner of submission of cases to, and the procedure for the meetings of the National\nEconomic Council except that the summary shall reach the Cabinet Division at least fifteen\nclear days in advance of the commencement of the meeting.\n(4)      Other instructions regarding submission of cases to the National Economic\nCouncil shall be issued by the Cabinet Secretary.\n2\n(5) There shall be an Executive Committee of the National Economic Council\n(ECNEC) to be appointed by the Prime Minister. The terms of reference of ECNEC shall be\nnotified by the Cabinet Division with the approval of the Prime Minister."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Procedure regarding Committees of Cabinet and National Economic",
      "content": "1\nSubstituted vide SRO 1171(1)/2018 dated 1st October, 2018\n2\nAdded vide SRO 623(I)/2021 dated 27-05-2021\n19\nCouncil.--(1) Meetings of a Committee of the Cabinet or of the National Economic Council\nshall be convened by the Cabinet Division under the directions of the Chairman of the\nCommittee concerned, who shall preside at the meeting of the Committee.\n(2)    The members of the Committee shall attend the meetings:\nProvided that a Federal Minister or a Provincial Minister, where he is a member, if\nunable to attend a meeting, may authorize the Secretary of the Division or Department\nconcerned to represent him.\n(3)     Officials of the Divisions concerned and of the Provincial Governments may\nbe associated with the deliberations of the Committee as and when considered necessary.\n(4)    The provisions of rules 18, 19 and 20 shall apply mutatis mutandis to the\nmanner of submission of cases to, and the procedure for the meeting of the Committee.\n(5)    Other instructions regarding submission of cases to the Committee shall be\nissued by the Cabinet Secretary."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Action on decisions of the Cabinet, National Economic Council or their",
      "content": "Committees, etc.--(1) When a case has been decided by the Cabinet or the National\nEconomic Council or their Committees, the Minister-in-Charge shall take prompt action to\ngive effect to the decision.\n(2)    When the decision is received by the Secretary of the Division concerned, he\nshall-\n(a)     acknowledge the receipt of the decision in the form provided;\n(b)     transmit the decision to his Division for action;\n(c)     keep a register with himself of the decisions received, for the purpose\nof ensuring that prompt and complete action is taken on those\ndecisions; and\n(d)     coordinate action with any other Division concerned with the decision.\n(3)     The Secretary of the Division concerned shall, on receipt of the Cabinet\ndecision, communicate it to the Division but shall not forward the original documents. The\ndecision shall be formally conveyed as decision of the Federal Government and details to the\nMinisters present at the meeting of the Cabinet, Committee of Cabinet etc., shall not be\ndisclosed.\nNote:-The record of the discussion before a decision was taken shall not be\npassed down unless it contains points which require further consideration or\naction in the Division concerned.\n(4)     To ensure implementation of the Cabinet decisions, the Secretary of each\nDivision shall keep a record of all the decisions conveyed to him and shall watch progress of\naction until it is completed. It shall be his responsibility as Secretary of the Division\nsponsoring the summary to consult or inform any other Divisions concerned, in order to\nensure full implementation of the decision.\n(5)     The Cabinet Secretary shall watch the implementation of Cabinet decisions,\nand the Secretary in the Division concerned shall supply to the Cabinet Secretary such\ndocuments as the latter may, by general or special request, require to enable him to complete\nhis record of the case.\n(6)   The Cabinet Secretary shall maintain the record of each case which shall\nconsist of-\n20\n(a)      a copy of all papers issued under rules 19(1), 20(5), 22(3) or 23(4);\n(b)      a copy of the records prepared under rules 19(2), 20(11) or 23(4);\n(c)      all documents received under sub-rule (5).\n(7)    The Secretaries shall retain in their personal custody the record of Cabinet\ndecisions and discussions conveyed to them under rule 20(13), and shall make them over to\ntheir successors at the time of handing over charge.\n(8)     All papers submitted to Cabinet are secret until the Cabinet discussion has\ntaken place. Thereafter each secretary shall decide whether the case should continue to be\nclassified as secret and inform the Cabinet Division of his decision.\n(9)      The Ministers shall return to the Cabinet Secretary –\n(a)      the papers issued to them for decision by circulation, immediately after\nrecording their opinion;\n(b)      the papers issued to them for decision by discussion in a meeting of the\nCabinet or Committee of the Cabinet, etc., under rule 20(5), 22(3) or\n23(4), immediately after the discussion has taken place;\n(c)      copies of the record of discussion and decision circulated by the\nCabinet Secretary under rule 19(1), 20(12), 22(3) or 23(4);\nimmediately after they have perused them; and\n(d)      reports of action taken on Cabinet decisions, or other papers circulated\nfor information, immediately after perusal."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Periodical reports of activities of Divisions",
      "content": "-(1) Omitted vide SRO\n135(I)/98, dated 3rd March, 1998.\n1\n(2) At the beginning of each financial year, each Division shall, for the\ninformation of the Cabinet and for general public, prepare and upload on its website as a\npermanent record a Year Book which shall contain--\n(a)      the details of its activities, achievements and progress during the\npreceding financial year giving only the unclassified information\nwhich can be used for reference purposes;\n(b)      the programme of activities and targets set out for itself during the\npreceding financial year and the extent to which they have been\nrealized; and\n(c)      the relevant statistics properly tabulated.\nNote:- The Secretary of the Division shall ensure that only\nunclassified material is supplied for the Year Book so that the\ninformation contained therein may be available for the use of\nacademics, scholars and other interested.\n2\n(3) Secretary of each Division shall inform the Cabinet Secretary, within ninety\ndays at the end of the financial year under report, about availability of the Year Book, who\nshall disseminate this information to all members of the Cabinet and all Divisions.\n1\nSubstituted vide SRO 40 (1)/2019 dated 11 th January, 2019\n2\nSubstituted vide SRO 40 (1)/2019 dated 11 th January, 2019\n21"
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Annual Report",
      "content": "(1) There shall be prepared by the Cabinet Division an\nannual report on the observance and implementation of the Principles of Policy in relation to\nthe affairs of the Federation in terms of clause (3) of Article 29.\n(2)     The Law and Justice Division shall cause the report to be laid before each\nHouse of the Majlis-e-Shoora (Parliament).\n(3)      The provisions of rule 25(2) and (3) shall apply for the preparation and\nsubmission of the report to Cabinet as they apply to a Year Book.\nPART E.—LEGISLATION"
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Official Bills",
      "content": "(1) The Division concerned shall be responsible for\ndetermining the contents of the proposed legislation for consulting the other Divisions\nconcerned (including the Finance Division) where necessary, and for obtaining the approval\nof the Cabinet under rule 16(1)(a), to the issues involved, before asking the Law and Justice\nDivision to draft the Bill.\nProvided that where the proposed legislation involves only a verbal or formal\namendment of an existing law, it shall not be necessary to obtain approval of the Cabinet\nbefore asking the Law and Justice Division to draft it.\n(2)    When referring the approved legislation to Law and Justice Division for\ndrafting, the Division concerned shall send the relevant papers along with a memorandum\nindicating the provisions which are intended to be incorporated in the draft Bill and giving\nthe objects of and reasons for those provisions to enable the Law and Justice Division to\ngrasp the exact intention of the Division concerned and the full scope of the proposed\nlegislation.\n(3)    Apart from giving shape to the draft legislation, the Law and Justice Division\nshall advise the Division concerned as to the competence of Majlis-e-Shoora (Parliament) to\nmake a law on the subject to which the proposed legislation relates and whether any legal\nrequirements are to be complied with before the Bill is introduced in the Assembly or the\nSenate.\n(4)     Whenever consent or recommendations of the Federal Government or\nprevious sanction of the President is necessary for the introduction of a Bill it shall be drafted\nby the Law and Justice Division along with the Bill.\n(5)     The Division concerned shall then--\n(a)     submit the case to the Cabinet--\n(i)    for approval of the draft Bill;\n(ii)   for deciding any issue that may still be outstanding;\n(b)     obtain the approval of the Prime Minister on the decisions of the\nCabinet on the points mentioned in clause (a) where the approval has\nnot already been given by the Prime Minister in the meeting of the\nCabinet; and\n(c)     obtain the signature of the Prime Minister on the consent or\nrecommendation, or of the President on the previous sanction, where\nrequired to the introduction of the Bill in the Assembly or the Senate;\nand return the Bill to the Law and Justice Division for further action in\nterms of sub-rule (8).\n22\n1\n(5A) The Cabinet may, in an appropriate case, while according approval to the\nproposed legislation under sub-rule (1), dispense with the requirements of clause (a) of\nsub-rule (5) regarding submission of the case to the Cabinet for approval of the draft bill.\n(6)    The Division concerned shall include in the brief prepared for use of the\nMinister-in-Charge the direction which the Cabinet has given regarding the line of action to\nbe adopted with regard to the Bill.\n(7)     Legislation relating to the codification of substantive law or for the\nconsolidation of existing enactments or legislation of a purely formal character, e.g.,\nrepealing and amending Bills and short title Bills, may be initiated in the Law and Justice\nDivision. It shall, however, consult the Division concerned, if any, which shall consider the\ndraft legislation from the administrative point of view and send their views to the Law and\nJustice Division.\n2\n(8) After taking action in terms of sub-rule (5) the Division concerned shall\nforward to the Law and Justice Division the draft legislation in its final form with a statement\nof objects and reasons duly signed by the Minister-in-Charge. The Law and Justice Division,\nafter satisfying itself that all legal requirements have been complied with for the introduction\nof the Bill in the Assembly or, as the case may be, the Senate, transfer the bill along with the\nstatement of objects and reasons to the Parliamentary Affairs Division for arranging its\nintroduction in the appropriate House."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Compliance with Rules of Majlis",
      "content": "e-Shoora (Parliament).-- All Divisions\nshall, in their relations with the Assembly, the Senate and Majlis-e-Shoora (Parliament) in\njoint sitting comply with the Rules of Procedure and Standing Orders of the Assembly, the\nSenate or the joint sitting, as the case may be."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Summoning and prorogation of National Assembly by the",
      "content": "Speaker.--(1) When the Assembly is summoned by the Speaker under clause (3) of article\n54, the date, time and place for the commencement of the session shall be notified in the\nGazette by the Secretary of the Assembly.\n(2)      When the Assembly is prorogued by the Speaker under clause (3) of Article\n54, the date of prorogation shall be notified in the Gazette by the Secretary of the Assembly."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Summoning and prorogation of the Senate by the Chairman",
      "content": "-(1) When\nthe Senate is summoned by the Chairman under clause (3) of article 54 read with Article 61,\nthe date, time and place for the commencement of the session shall be notified in the Gazette\nby the Secretary of the Senate.\n(2)    When the Senate is prorogued by the Chairman under clause (3) of Article 54\nread with Article 61, the date of prorogation shall be notified in the Gazette by the Secretary\nof the Senate."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Review of official and non",
      "content": "official business.-- As soon as a notification\nunder sub-rule (3) of rule 32, sub-rule (1) of rule 34, or sub-rule (1) of rule 35 is issued, all\nDivisions shall undertake a review of official and non-official business intended to be\nbrought before the Assembly, the Senate, both Houses or the joint sitting, as the case may be,\nand shall promptly forward to the Parliamentary Affairs Division detailed lists of such\nbusiness, not later than five days before the commencement of the session."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Provisional forecast of official and non",
      "content": "official business.--\nThe Secretary Parliamentary Affairs Division shall prepare a provisional forecast of the\nbusiness to be brought before the Assembly, the Senate or the joint sitting, as the case may\nbe and shall make, through the appropriate Leader of the House, or in the case of the joint\nsitting, through the Prime Minister, proposals to the Speaker or , as the case may be, the\nChairman for the allotment of days for the transaction of official as well as non-official\nbusiness. The final arrangement as approved by the Speaker or, the Chairman as the case may\nbe, shall be circulated by the appropriate Secretariat to all the Divisions and the Secretary,\nPrime Minister's Office."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Orders of the Day",
      "content": "- The Secretary Parliamentary Affairs Division, shall, in\nconsultation with the appropriate Leader of the House, prepare orders of the day for each\nofficial day and forward it to the appropriate Secretariat. In the case of a joint sitting, the\nOrders of the Day shall be prepared in consultation with the Prime Minister and forwarded to\nthe Secretary of the Assembly."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Transmission of Bills etc",
      "content": "-(1) Copies of Bills, including Bills passed by\none House and transmitted to the other House, Bills to be reconsidered by the Assembly and\n25\nBills to be considered in a joint sitting, resolutions, notices, questions and other business to be\nbrought before the Assembly, the Senate or the joint sitting shall be forwarded as soon as\nreceived or possible, by the appropriate Secretariat to the Division concerned.\n(2)     If a Bill, resolution, motion or question has been wrongly addressed to a\nDivision by the appropriate Secretariat, it shall be promptly transferred by the receiving\nDivision to the Division concerned, under advice to that Secretariat.\n(3)     The appropriate Secretariat shall inform the Division concerned as soon as it is\nknown that a resolution, motion or question has been admitted in its final form or not\nadmitted so that the Division concerned may regulate its action accordingly.\n(4)     Before the commencement of each session of the National Assembly or the\nSenate, the appropriate Secretariat shall ascertain from the Cabinet Division the allocation of\nbusiness amongst the Divisions."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Action by Divisions",
      "content": "- As soon as any communication (whether a notice,\nintimation, a Bill or any other paper) is received from the appropriate Secretariat or any other\nauthority regarding the business or affairs of the Assembly, the Senate or the joint sitting, the\nreceiving officer shall at once bring it to the notice of the Secretary and the Minister."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Introduction of Bills, etc",
      "content": "-(1) A Money Bill shall originate in the National\nAssembly:\nProvided that simultaneously when a Money Bill including the Finance Bill\ncontaining the Annual Budget Statement is presented in the National Assembly, a copy\nthereof shall be transmitted to the Senate which may, within fourteen days, make\nrecommendations thereon to the National Assembly.\n(1A)    The National Assembly shall consider the recommendations of the Senate and,\nafter the Bill has been passed by the Assembly with or without incorporating the\nrecommendations of the Senate, it shall be presented to the President for assent.\n(2)    Bills, other than Money Bills, resolutions, motions, questions or other business\nwith respect to any matter in the Federal Legislative List originate or be moved or asked, in\nor, as the case may be, brought before either House:\nProvided that the Prime Minister shall determine the House in which a\nparticular official bill, resolution or motion originate or be moved or, as the case may be,\nbefore which any other official business shall be brought.\n(3)    Omitted vide S.R.O. No. 822(I)/2002, dated 20.11.2002.\n(4)    An official Bill shall be introduced in the Assembly, or as the case may be, the\nSenate by the Minister-in-Charge or by any other Minister on his behalf.\n(5)     The Minister concerned shall in consultation with the Leader of the House,\ndecide as to which of the following motion should be made with regard to an official Bill\nafter its introduction,--\n(a)     that it be taken into consideration at once and passed; or\n(b)     that it be taken into consideration on a date to be specified; or\n(c)     that it be referred to a Select Committee; or\n(d)     that it be circulated for the purpose of eliciting opinion thereon;\nProvided that if a question of important policy is involved, the Minister shall obtain\nthe orders of the Prime Minister.\n(6)     Omitted vide SRO No. 822(I)/2002, dated 20.11.2002.\n26\n(7)    The Division concerned shall prepare for the use of the Minister-in-Charge a\nbrief of each Bill, whether official or non-official."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Assent to Bills",
      "content": "- A Bill to be presented to the President for his assent shall\nbe forwarded by the appropriate Secretariat duly certified by the Speaker or, as the case may\nbe, the Chairman to the Parliamentary Affairs Division who shall submit it to the President\nfor his assent. The President shall-\n(a)      assent to the Bill, or\n(b)      if it is a Bill other than a Money Bill, return the Bill to the Majlis-e-\nShoora (Parliament) with a message requesting that the Bill, or any\nspecified provision thereof, be reconsidered and that any amendments\nspecified in the message be considered.\n42A Reconsideration of Bill by Majlis-e-Shoora (Parliament).− When the\n1\nPresident has returned a Bill to the Majlis-e-Shoora (Parliament), it shall be reconsidered by\nthe Majlis-e-Shoora (Parliament) in joint sitting and if it is passed by the votes of the majority\nof the members of both Houses present and voting, it shall be deemed for the purposes of the\nConstitution to have been passed by both Houses and shall be presented to the President, and\nthe President shall give his assent within ten days, failing which such assent shall be deemed\nto have been given."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Resolutions",
      "content": "-(1) When an official resolution is to be moved in the Assembly,\nthe Senate or the joint sitting, the Division concerned shall, where time permits, consult the\nLaw and Justice Division and obtain approval of the Cabinet, before forwarding the\nresolution with a notice signed by the Minister to the Secretary of the appropriate Secretariat:\nProvided that no such resolution shall be forwarded to the appropriate Secretariat until\nthe Prime Minister has seen it if he was not present at the Cabinet meeting, or where\nthere was no time to consult the Cabinet.\nNote:- Official resolutions may be for the ratification of an international\nconvention, constitution of a statutory body, declaration of policy on a matter\nof public interest, etc.\n(2)     On receipt of a non-official resolution from the appropriate Secretariat, the\nDivision concerned shall examine its contents and, when the resolution is admitted for\ndiscussion, obtain the orders of the Cabinet if time permits. But the orders of the Prime\nMinister shall in any case be obtained. In examining the resolution, the Division concerned\nshall consider whether the discussion of the resolution, or any part thereof, would be\ndetrimental to the public interest and if so, it should point this out with reasons in its\ncomments on the resolution.\n(3)     The Division concerned shall prepare regarding each resolution, whether\nofficial or non-official, a brief for the use of the Minister.\n(4)    After a resolution has been adopted, the appropriate Secretariat shall forward it\nto the Division concerned for appropriate action."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Motions",
      "content": "-(1) The Division concerned shall submit an official motion,\ntogether with a notice, to the Minister-in-Charge and after he has signed it, shall forward it to\nthe appropriate Secretariat.\nNote:- Official motions may be for the election of members to a\nStanding Committee or a statutory body, raising discussion on a\nparticular matter, etc.\n(2)    On receipt of a non-official motion from the appropriate Secretariat, the\nDivision concerned shall consider whether a discussion of the motion, or any part thereof,\n1\nSubstituted vide S.R.O. 368 (I)/2010 dated 1st June 2010\n27\nwould be detrimental to the public interest.\n(3)    If the Division is of opinion that discussion of a motion or any part thereof\nwould be detrimental to the public interest or that the motion or any part thereof involves a\npoint of important policy which requires the orders of the Prime Minister or the Cabinet\nunder these rules, it shall, as soon as the motion is admitted, submit the case for the orders of\nthe Prime Minister or, as the case may be, the Cabinet and shall in doing so state the reasons\nfor holding such opinion.\n(4)      The Division concerned shall prepare regarding each motion, whether official\nor non-official, a brief for the use of the Minister.\n(5)     After a motion has been adopted, the appropriate Secretariat shall forward it to"
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Questions",
      "content": "-(1) On receipt, from the appropriate Secretariat, of a question\n(starred, un-starred or short notice) proposed to be asked by a member, the Division\nconcerned shall draft a reply and after it has been approved by the Minster forward the\nrequired number of copies of the reply to the appropriate Secretariat before the day on which\nthe question is put down for answer. In the case of a starred question, a brief be prepared by\nthe Division concerned for the use of the Minister in answering any supplementary question\nthat may be asked.\n(2)    A copy of each supplementary question asked in respect of a starred question,\nand of the reply given thereto, shall be forwarded by the appropriate Secretariat to the\nDivision concerned, as soon as possible after the proceedings have been transcribed.\n(3)    The Division concerned shall be responsible for the fulfilment of any\nundertakings given on its behalf in reply to a question or a supplementary question."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Budget",
      "content": "-(1) The Minister for Finance shall, in consultation with the Prime\nMinister and the Speaker, prepare a time-table for the consideration of annual budget by the\nAssembly. The Secretary of the Assembly shall intimate the time-table so decided upon to all\nthe Divisions and the Secretary, Prime Minister's Office.\n(2)    On receipt of a motion proposing a cut in a demand (or supplementary\ndemand) for grant of funds, the Division concerned shall examine the points raised by the\nmember, and any further points likely to be raised, and prepare a brief for the use of the\nMinister-in-Charge in making a reply.\n(3)    When the budget is passed by the Assembly, the Minister for Finance shall\nsubmit the Schedule of Authorized Expenditure to the Prime Minister who shall authenticate\nthe Schedule by his signature as required by Article 83."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Committees of Assembly or Senate",
      "content": "-Standing or ad-hoc Committees may be\nconstituted by the Assembly or the Senate to advise the Divisions concerned on general\nadministrative policy or a special problem."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Directions to the Governors",
      "content": "- No Division shall issue a directive to the\nGovernor of the Province under clause (1) of Article 145 without the specific approval of the\nPrime Minister."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Obligations of Provinces and Federation",
      "content": "(1)     Omitted vide S.R.O 368(I)/2010 (F.No.4-6/2010-Min-I) dated 1st June 2010.\n(2)     Omitted vide S.R.O 368(I)/2010 (F.No.4-6/2010-Min-I) dated 1st June 2010.\n28\n(3)     The implementation of an international agreement in the Provincial field shall\nnormally be the responsibility of the Provincial Government unless in any case specific\norders of the Prime Minister are obtained by the Division concerned in accordance with rule\n15(1)(c).\n(4)     The Foreign Affairs Division shall issue necessary instructions to the\nProvincial Governments in the matter of conducting correspondence with the Government of\na foreign country or a Pakistan Diplomatic Mission abroad or a Foreign Mission in Pakistan\nor an International Organisation."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Conferment of powers and imposition of duties upon a Province",
      "content": "- The\nDivision concerned shall obtain the specific orders of the Prime Minister, if it is proposed to\nenact a law conferring powers and imposing duties upon a Province or officers or authorities\nthereof under clause (2) of Article 146."
    },
    {
      "provision_ref": "sec50a",
      "section": "50A",
      "title": "Section 50A. Secretariat of Council of Common Interests",
      "content": "(1) There shall be a\n1\nSecretariat of the Council of Common Interests (SCCI), having status of a Division which\nshall be headed by the Secretary to the Council of Common Interests.\n(2)     The Secretary of the Council shall report directly to the Prime Minister, in the\nlatter’s capacity as Chairman, CCI and shall also function as principal accounting officer of\nthe Secretariat.\n(3)   The procedure for conduct of business of the Council of Common Interests\nshall be governed in terms of the Rules of Procedure of the Council of Common Interests,"
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Proclamation of Emergency on account of war, internal disturbance,",
      "content": "etc.--(1) The Proclamation in case of a grave emergency in which the security of Pakistan, or\nany part thereof is threatened by war or external aggression, or by internal disturbance\nbeyond the power of a Provincial Government to control, shall be issued by the Cabinet\nDivision in terms of rule 15-A.\n(2)    The Divisions concerned shall keep the provisions of clauses (2) to (8) of\nArticle 232 in view for making legislation, if required, while a Proclamation of Emergency is\nin force and for submission of the Proclamation to the joint sitting or the Senate, as the case\nmay be.\n(3)    The provisions of rules 27, 28, 29 and 30 shall apply mutatis mutandis for the\npurpose of legislation while a Proclamation of emergency is in force."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Failure of constitutional machinery in a Province",
      "content": "-(1)The Proclamation in\ncase of failure of constitutional machinery in a Province shall be issued by the Cabinet\nDivision in terms of rule 15-A.\n(2)    The Division concerned shall keep the provisions of clauses (3) to (6) of\nArticle 234 in view for making legislation, if required, while a Proclamation of Emergency is\nin force and for submission of the Proclamation to the joint sitting or the Senate, as the case\nmay be.\n(3)     The provisions of rules 27, 28, 29 and 30 shall apply mutatis mutandis for the\npurpose of legislation while a Proclamation of Emergency is in force."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Proclamation in case of financial stringency",
      "content": "-(1) The Proclamation in case\nof financial stringency shall be issued by the Finance Division in terms of rule 15-A.\n(2)      The Finance Division shall keep the provisions of clause (4) of Article 235 in\n1\nInserted vide SRO No. 1373(1)/2021 dated 01-12-2021\n29\nview for submission of the Proclamation to the joint sitting or the Senate, as the case may be."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Revocation of Proclamation, etc",
      "content": "- The Proclamation issued under rule 51,52\nor 53 shall be varied or revoked by a subsequent Proclamation to be issued by the Division\nconcerned in terms of rule 15-A."
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Protection and communication of official information",
      "content": "-1(1) Information\nacquired from official documents relating to official matters shall only be communicated by a\ngovernment servant or, as the case may be, designated official to the press, to\nnon-officials, or even to officials belonging to other government offices in accordance with\n(XCVI of 2002).\n(2)    Detailed instructions shall be issued by the Cabinet Division for the treatment\nand custody of official documents and information of a classified nature.\n(3)    Ordinarily all official news and information shall be conveyed to the press and\nthe public through the Press Information Department or the External Publicity Wing of the\nInformation and Broadcasting Division. The manner in which this may be done shall be\nprescribed by general or special orders to be issued by the Information and Broadcasting\nDivision.\n(4)      Only Ministers and Secretaries, and such officers as may be authorized, shall\nact as official spokesmen of the Government. No statement involving foreign policy shall\nnormally be made by a person (other than the Minster of State for Foreign Affairs and the\nPrime Minister) without prior consultation with the Foreign Affairs Division."
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. Channels of Communications",
      "content": "-(1) Except as provided in sub-rule (2), all\ncorrespondence with the Government of a foreign country or a Pakistan diplomatic mission\nabroad or a foreign mission in Pakistan or an international organization shall normally be\nconducted through the Foreign Affairs Division:\nProvided that by means of general or special orders to be issued by the Foreign\nAffairs Division, direct correspondence may be allowed under such conditions and\ncircumstances as may be specified.\n(2)     All requests to a foreign Government or an international organization for\neconomic or technical assistance shall be made through the Economic Affairs Division,\nwhich shall correspond with the foreign Government, etc., in accordance with the prescribed\nchannel. The Economic Affairs Division may allow, by general or special orders, such\nrequests to be made direct.\n(3)     Correspondence with Provincial Governments shall be conducted directly by\nthe Division, in respect of the subjects allocated to them, subject to the provisions of rule 8,\nand it shall ordinarily be addressed to the Secretary of the Department concerned in the\nProvincial Government:\nProvided that under general or special orders to be issued by a Division, its Attached\nDepartment may be authorized to correspond directly with the Department of a Provincial\nGovernment under such conditions and circumstances as may be specified therein.\n(4)     Copies of the correspondence with the Provincial Government in respect of\nthe affairs of former and acceding states, if any,[***]2 shall be endorsed to the States and\nFrontier Regions Division, provided that Division may, by means of general or special orders,\n1\nSubstituted vide SRO 709(I)/2003 (F.No. 4-8/2003-Min), dated 15.7.2003\n2\nOmitted vide SRO 1434 (I)/2024 dated 11-09-2024\n30\nspecify the class or classes of correspondence which shall be conducted through that\nDivision.\n(5)    All correspondence with the headquarters of the Defence Forces viz. General\nHeadquarters, Naval Headquarters, Air Headquarters, or their subordinate formations, shall\nnormally be conducted through the Defence Division:\nProvided that by means of general or special orders to be issued by the Defence\nDivision direct correspondence may be allowed under such conditions and circumstances as\nmay be specified:\nProvided further that the provisions of this sub-rule shall not affect normal\ncommunications between a Service Commander and the Civil Authorities in his area of inter-\ndepartment discussion in which Service representatives are required to take part."
    },
    {
      "provision_ref": "sec57",
      "section": "57",
      "title": "Section 57. Relaxation",
      "content": "-.- The Prime Minister may permit, where he considers it\n1\nnecessary, relaxation of the provisions of these rules in individual cases."
    },
    {
      "provision_ref": "sec25a",
      "section": "25A",
      "title": "Section 25A. Ministry of Poverty Alleviation and Poverty Alleviation and Social Safety",
      "content": "Social Safety                                         Division"
    },
    {
      "provision_ref": "sec83",
      "section": "83",
      "title": "Section 83. Administrative control of the National Electric Power Regulatory Authority",
      "content": "(NEPRA), Pakistan Telecommunication Authority (PTA), Frequency\nAllocation Board (FAB), Oil and Gas Regulatory Authority (OGRA)       and\nPublic Procurement Regulatory Authority (PPRA)."
    },
    {
      "provision_ref": "sec84",
      "section": "84",
      "title": "Section 84. Prime Minister’s Performance Delivery Unit (PMDU) including Pakistan",
      "content": "Citizen Portal (PCP), operation and management of which shall be managed\nby Prime Minister’s Office (Public)."
    },
    {
      "provision_ref": "sec85",
      "section": "85",
      "title": "Section 85. (i) Warrant of precedence;",
      "content": "(ii)    Pakistan Flag;\n(iii)   Coat of Arms, National Emblem, monograms, seals;\n(iv)    Standard time for Pakistan;\n(v)     Public holidays; and\n(vi)    Gazette of Pakistan.\n1"
    },
    {
      "provision_ref": "sec87",
      "section": "87",
      "title": "Section 87. Special Technology Zones Authority",
      "content": "1\nInserted vide SRO 1434 (I)/2024 dated 11-09-2024 [From 1st July, 2022 till 4th June, 2023 Institutional\nReforms Cell remained under the Establishment Division (F.No.471(S)/2022-Cab;F.No. 4-1/2023-Min-I)].\n2\nInserted vide SRO 1434 (I)/2024 dated 11-09-2024\n36\n1"
    },
    {
      "provision_ref": "sec92",
      "section": "92",
      "title": "Section 92. Administrative functions in respect of the National Anti",
      "content": "Money Laundering\nand Counter Financing of Terrorism Authority Act, 2023 (LIII of 2023).\n5"
    },
    {
      "provision_ref": "sec93",
      "section": "93",
      "title": "Section 93. National Anti",
      "content": "Money Laundering and Counter Financing of Terrorism\nAuthority of Pakistan.\n6"
    },
    {
      "provision_ref": "sec1a",
      "section": "1A",
      "title": "Section 1A. Appointment, resignation and removal of Special Assistants to the Prime",
      "content": "-\nMinister and of persons holding the Minister's status without Cabinet rank,                     Articles 90 and 99\ndetermination of their salaries, allowances and privileges.\n3"
    },
    {
      "provision_ref": "sec1c",
      "section": "1C",
      "title": "Section 1C. A Certificate of Secrecy and Fidelity to be signed by an Adviser to the Prime",
      "content": "Minister or a Special Assistant to the Prime Minister upon entering office."
    },
    {
      "provision_ref": "sec10a",
      "section": "10A",
      "title": "Section 10A. Permission to accept foreign honours and awards. Article 259(1)",
      "content": "2INTERIOR AND NARCOTICS CONTROL DIVISION"
    },
    {
      "provision_ref": "sec13a",
      "section": "13A",
      "title": "Section 13A. Office of Wafaqi Mohtasib (Ombudsman) Order, 1983 (P.O.No.1 of 1983),",
      "content": "where the recommendations of the Wafaqi Mohtasib are to be sustained for\nimplementation.\n4"
    },
    {
      "provision_ref": "sec13b",
      "section": "13B",
      "title": "Section 13B. Rejection of representations filed by the Revenue Division or its subordinate",
      "content": "departments, offices and agencies under the Establishment of the Office of the\nFederal Tax Ombudsman Ordinance, 2000 (XXXV of 2000), where the\nrecommendations of the Federal Tax Ombudsman are to be sustained for\nimplementation."
    },
    {
      "provision_ref": "sec2b",
      "section": "2B",
      "title": "Section 2B. Omitted vide SRO No.822 (I)/2002, dated 20.11.2002",
      "content": "2\n2C           Appointment of Federal Caretaker Cabinet (on advice of the Caretaker Prime                      Article 224(1A)\n2\n2D           Minister)                                                                                       Article 101\nAppointment, resignation and removal of Provincial Governors, determination of\n2\n2E            their salaries, allowances and privileges                                                       Article 104\nAppointment of Acting Governors (other than Speaker of the Provincial                                         -"
    },
    {
      "provision_ref": "sec12a",
      "section": "12A",
      "title": "Section 12A. Appointment of Chairman, Joint Chiefs of Staff Committee, the Chief of the Article 243",
      "content": "Army Staff, the Chief of the Naval Staff and the Chief of the Air Staff and\ndetermination of their salaries and allowances"
    },
    {
      "provision_ref": "sec15b",
      "section": "15B",
      "title": "Section 15B. Directions as to the application of Law to a major aerodrome",
      "content": "Omitted vide Cabinet Division Notification No.4-15/96-Min.I, dated 19.11.1996.\n1\nSubstituted vide Cabinet Division O.M.No.104/8/85-Min.I, dated 4.8.1985\n2\nInserted vide S.R.O. 368 (I)/2010 (F.No.4-6/2010-Min-I) dated 01.06.2010\n82"
    },
    {
      "provision_ref": "sec15c",
      "section": "15C",
      "title": "Section 15C. Federal Public Service Commission; its strength and the appointment, removal or Sections 3,4 and 5 of the",
      "content": "resignation of the 1[Chairman and] members, and the terms and conditions of          Federal Public Service\ntheir service.                                                                       Commission Ordinance,\n1977 (XLV of 1977)."
    },
    {
      "provision_ref": "sec22a",
      "section": "22A",
      "title": "Section 22A. Reports relating to the accounts of Federation",
      "content": "Issue of proclamation in case of financial emergency and its revocation.\nOmitted vide Cabinet Division Notification No.4-14/98-Min.I, dated 01.02.1998."
    },
    {
      "provision_ref": "sec36a",
      "section": "36A",
      "title": "Section 36A. Wafaqi Mohtasib (Ombudsman) Order, 1983 (P.O.No.1 of 1983), except the",
      "content": "cases covered by serial No.13A of Schedule V-A.\n1\nSubstituted vide SRO 83(I)/2025 dated 4th February, 2025\n83"
    },
    {
      "provision_ref": "sec36b",
      "section": "36B",
      "title": "Section 36B. Representations filed under section 32 of the Establishment of the Office of",
      "content": "Federal Tax Ombudsman Ordinance, 2000 (XXXV of 2000), except the cases\ncovered by serial No.13B of Schedule V-A."
    },
    {
      "provision_ref": "sec36d",
      "section": "36D",
      "title": "Section 36D. Council of Islamic Ideology : Article 231",
      "content": "(i) Appointment, resignation and removal of members and Chairman.\n(ii) Rules of Procedure."
    },
    {
      "provision_ref": "sec36e",
      "section": "36E",
      "title": "Section 36E. Article 229",
      "content": "Reference to Council of Islamic Ideology whether a proposed law is or is not\nrepugnant to the Injunctions of Islam."
    },
    {
      "provision_ref": "sec48a",
      "section": "48A",
      "title": "Section 48A. Article 48(6)(7)",
      "content": "Referendum of any matter of national importance.                                    Article 213."
    },
    {
      "provision_ref": "sec48b",
      "section": "48B",
      "title": "Section 48B. Article 218 (2)(b)",
      "content": "Appointment of Chief Election Commissioner and members of Election\nCommission."
    }
  ],
  "definitions": [
    {
      "term": "Assembly",
      "definition": "the National Assembly;",
      "source_provision": "sec2"
    },
    {
      "term": "Attached Department",
      "definition": "a Department which has direct relation with a Division and has been declared as such by the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "business",
      "definition": "all work done by the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "Cabinet",
      "definition": "and consists of the Prime Minister and the Federal Ministers;",
      "source_provision": "sec2"
    },
    {
      "term": "case",
      "definition": "a particular matter under consideration and includes all papers relating to it and required to enable the matter to be disposed of, viz., correspondence and notes, and also any previous paper on the subject or subjects covered by it or connected with it;",
      "source_provision": "sec2"
    },
    {
      "term": "Division",
      "definition": "a self-contained administrative unit responsible for the conduct of business of the Federal Government in a distinct and specified sphere and declared as such by the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "Federal Secretariat",
      "definition": "the Divisions or the Ministries when referred to collectively; (viii) \"Gazette\" means the official Gazette of Pakistan,",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government; 1",
      "source_provision": "sec2"
    },
    {
      "term": "Leader of the House",
      "definition": "the Member of the Parliament appointed by the Prime Minister to regulate official business in the Assembly, the Senate or the Majlis-e-Shoora (Parliament) in joint sitting, as the case may be;",
      "source_provision": "sec2"
    },
    {
      "term": "Local administration",
      "definition": "the agency through which the President administers a territory subject to his direct administrative control;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "a member of the Assembly or the Senate; (xiii) \"Minister\" means the Federal Minister-in-Charge of the Ministry to which a particular case pertains and includes a Minister without portfolio and a Minister of State; 1 Substituted vide SRO 623(I)/2021 dated 27-05-2021 4",
      "source_provision": "sec2"
    },
    {
      "term": "Ministry",
      "definition": "a Division or group of Divisions constituted as a Ministry; 1",
      "source_provision": "sec2"
    },
    {
      "term": "Provincial Government",
      "definition": "the Government of a Province of Pakistan; (xvii) \"Schedule\" means a Schedule to these rules; (xviii) \"Secretary\" means the 2[Secretary General], Principal Secretary, Secretary, 3[Special Secretary] or Acting Secretary to the Government of Pakistan in charge of a Division or a Ministry, and where there is no Secretary, the Additional Secretary, Senior Joint Secretary or Joint Secretary in charge of the Division or the Ministry;",
      "source_provision": "sec2"
    },
    {
      "term": "Section",
      "definition": "a basic working unit in a Division as determined by the Government;",
      "source_provision": "sec2"
    },
    {
      "term": "Subordinate Office",
      "definition": "a Federal Government office other than a Ministry, Division or an Attached Department. (2) All words and expressions used in these rules but not defined, have the same meaning as in the Constitution of the Islamic Republic of Pakistan. 1 Substituted vide SRO 623(I)/2021 dated 27-05-2021 2 Inserted vide S.R.O. 226(I)/2010 (F.No.4-4/2007-Min-I), dated 02.4.2010 3 Inserted vide SRO 428 (1)/2018 dated 04-04-2018 5",
      "source_provision": "sec2"
    }
  ]
}
