{
  "id": "pk-secretariat-allowance-rescission-of-orders-etc-ordinance-2000",
  "type": "statute",
  "title": "Secretariat Allowance (Rescission of Orders, etc) Ordinance, 2000",
  "title_en": "Secretariat Allowance (Rescission of Orders, etc) Ordinance, 2000",
  "short_name": "SAOOE",
  "status": "in_force",
  "issued_date": "2000-03-29",
  "in_force_date": "2000-03-29",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaYZQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Secretariat Allowance (Rescission of Orders, etc) Ordinance, 2000 (XII of 2000) published by The Pakistan Code (Service Laws).",
  "provisions": [
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Removals of difficulties",
      "content": "THE SECRETARIAT ALLOWANCE (RESCISSION OF ORDERS, ETC.)\nORDINANCE, 2000\nORDINANCE No. XII of 2000\n[30th March, 2000]\nAn Ordinance to provide for rescission of certain orders relating to Secretariat Allowance\nWHEREAS it is expedient to provide for rescission of certain orders relating to Secretariat\nAllowance granted to certain employees of the Federal Government and to provide for matters\nconnected therewith and incidental thereto;\nAND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the\nProclamation of Emergency of the fourteenth day of October, 1999, and the Provisional Constitution\nOrder No. 1 as amended;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of Proclamation of the fourteenth day of October, 1999,\nand Provisional Constitution Order No. 1 as amended as well as Order No. 9 of 1999, and in exercise\nof all powers enabling him in that behalf, the President of the Islamic Republic of Pakistan is pleased\nto make and promulgate the following Ordinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_ (1) This Ordinance may be called the Secretariat\nAllowance (Rescission of Orders, etc.) Ordinance, 2000.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Rescission of certain orders",
      "content": "_ (1) The orders, office memorandums, instructions and other\ninstruments whereby the Secretariat Allowance was granted to certain Federal Government Employees\nin the Federal Secretariat, President's Secretariat, Prime Minister's Secretariat, National Assembly\nSecretariat, the Senate Secretariat and other organizations of the Federal Government and the orders,\noffice memorandums, instructions and other instruments amending the aforesaid orders office\nmemorandums, instructions and other instruments, hereinafter referred to as the orders, converting the\nSecretariat Allowance into Personal Allowance are hereby rescinded and shall be deemed always to\nhave been so rescinded on the 1st July, 1988, and no financial benefit whatsoever, save and except as\nprovided in sub-section (2), shall accrue or deemed to have accrued of become payable thereunder to\nthe persons employed in the aforesaid Secretariats and other Organisations of the Federal Government\nnotwithstanding any decision of any Court including a High Court and the Supreme Court.\n(2) Any order made, instruction issued, decision of any Court including a High Court or the\nSupreme Court implemented immediately before the commencement of this Ordinance, shall be\ndeemed to have been validly made, issued and implemented and the amount of Secretariat Allowance\nincluding Personal Allowance already paid thereunder shall be deemed to have been validly paid and\nshall not be recoverable from the recipients of such allowances."
    }
  ],
  "definitions": []
}
