{
  "id": "pk-securities-and-exchange-commission-of-pakistan-act-1997",
  "type": "statute",
  "title": "Securities and Exchange Commission of Pakistan Act, 1997",
  "title_en": "Securities and Exchange Commission of Pakistan Act, 1997",
  "short_name": "SAECO",
  "status": "in_force",
  "issued_date": "1997-11-30",
  "in_force_date": "1997-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apqbYw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Securities and Exchange Commission of Pakistan Act, 1997 (XLII of 1997) published by The Pakistan Code (Companies Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Act may be called as the Securities and\nExchange Commission of Pakistan Act, 1997.\n(2) It extends to the whole of Pakistan.\n(3) Save for section 43, the Act shall come into force at once and section 43 shall come into\nforce on such *date as the Federal Government may, by notification in the official Gazette, appoint."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. 1[(1)] In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(a)        “appointed day” means the day on which section 43 comes into force;\n1\n[(aa) “administered legislation” means the legislation administered by the\nCommission as specified in the Schedule I;]\n(b)        “Authority” means the Corporate Law Authority constituted under the\nCompanies Ordinance, 1984 (LXVII of 1984);\n(c)        “Board” means the Securities and Exchange Policy Board established under\nsection 12;\n(d)        “Chairman” means the Chairman of the Commission 1[and includes the Acting\nChairman];\n(e)        “civil servant” means a civil servant as defined in section 2 of the Civil Servants\nAct, 1973 (LXXI of 1973);\n1\n[(f)   “clearing house” means a company that is licensed by the Commission as a\nclearing house;]\n*\ni.e. 1-1-1999 , See SRO 1404(1)/98, dt 31-12-98\n1\nNumbered, added, ins. and subs. by Act XXXVI of 2016, s. 2.\n(g)       “Commission” means the Securities and Exchange Commission of Pakistan\nestablished under section 3;\n(h)       “Commissioner” means a Commissioner of the Commission and shall include\nthe Chairman thereof;\n(i)       “committee” means a committee of the 1[Commission or the Board] constituted\nunder 1[this Act] ;\n1\n[(ia) “Court” means the Company Bench of a High Court as provided in sections 7\nand 8 of the Companies Ordinance, 1984 ( XLVII of 1984 )]\n(j)       “dealing in securities” means making or offering to make, whether as principal\nor agent, with any person or inducing or attempting to induce any person to\nenter into or to offer to enter into—\n(i)        any agreement for or with a view to acquiring, disposing of, subscribing\nfor or underwriting securities, or\n(ii)       any agreement the apparent or ostensible purpose of which is to secure\na profit to any of the parties from the yield of securities or by reference\nto fluctuations in the value of securities;\n1\n[(ja) “document” includes any information recorded in any form, including documents\nor statement of accounts in respect of customers maintained by financial\ninstitution, through modern electronic devices or techniques and data or\ninformation recorded in any legible form;]\n(k)       “employee'' means any officer or servant of the Commission;\n1\n[(ka) “financial services” mean all services provided by regulated persons under this\nAct or any administered legislation, but shall not include any service exclusively\nregulated by the State Bank of Pakistan;\n(kb)      “financial services market” mean all markets in which financial services are\nprovided and includes the capital market and the insurance market;]\n(l)       “Fund” means the fund established under section 23;\n2\n[(la) “Law of insurance” means the Insurance Ordinance, 2000 (XXXIX of 2000) or\nany other law in relation to insurance, the administration of which is vested in\nthe Commission by the Federal Government by notification in the official\nGazette.].\n(m)       “Member” means a Member of the Board;\n1\nSubs. and Ins. by Act XXXVI of 2016, s. 2.\n2\nIns. by Ord. LV of 2000, s. 2.\n(n)        “NBFI” means a non-banking financial institution and includes a development\nfinance institution, a Modaraba, a leasing company, a housing finance company\nand an investment bank but shall not include a banking company as defined in\nclause (c) of section 5 of the Banking Companies Ordinance, 1962 (LVII of\n1962);\n(o)        “Ordinance” means the Companies Ordinance, 1984 (XLVII of 1984);\n(p)        “private sector person” means a person who is not in the service of Pakistan or\nof any statutory body or any body which is owned or controlled by the Federal\nGovernment or a Provincial Government not including a University or an\neducational institution;\n1\n[(pa) “regulated activity” means any activity which is required to be registered with or\nlicensed by the Commission under this Act or any administered legislation;\n(pb)       “regulated person” means a person or entity licensed or registered under this\nAct or any administered legislation to carry on or engage in a regulated activity\nnot being an institution exclusively regulated by the State Bank of Pakistan;]\n(q)        “regulations” means the regulations made by the Board or the Commission; [*]1\n(r)        “rules” means the rules made by the Federal Government [;]1\n1\n[(s)   “Schedule” means schedule annexed to this Act;\n(t)        “self regulatory organization” means an entity connected with financial services\nmarket and registered by the Commission under this Act for the purpose of\nregulating the operations, standards of practice and business conduct of its\nmembers and their representatives with a view to promote protection of\ninvestors and the public interest;\n(u)        “specified” means specified by the Commission through regulations made\nunder this Act;\n(v)        “subordinate legislation” means any rules or regulations made under this Act or\nany administered legislation; and\n(w)        “systemic risk” means the risks, including potential, emerging and systemic\nrisks in financial services market, entities, infrastructure, products and activities\nwhich may impact the ability of the Commission to fulfil its regulatory\nresponsibilities provided in this Act. ]\n1\n[(2) Unless the context requires otherwise, the words and expressions used in this Act but not\ndefined herein shall have the same meaning as assigned to them under the administered legislations.]\n1\nIns, omitted, subs. and added by Act XXXVI of 2016, s. 2."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Commission",
      "content": "(1) There is hereby established a Commission to be\ncalled the Securities and Exchange Commission of Pakistan.\n(2) The Commission shall be a body corporate with perpetual succession and a common seal,\nand may sue and be sued in its own name and, subject to and for the purposes of this Act, may enter\ninto contracts and may acquire, purchase, take, hold and enjoy movable and immovable property of\nevery description and may convey, assign, surrender, yield up, charge, mortgage, demise, reassign,\ntransfer or otherwise dispose of or deal with, any movable or immovable property or any interest vested\nin it, upon such terms as it deems fit.\n1\n[(3) The Commission shall be administratively, financially and functionally independent and\nthe Federal Government shall use its best efforts to promote, enhance and maintain independence of\nthe Commission.]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Head Office. The head office of the Commission shall be in Islamabad. The Commission",
      "content": "may establish and close down offices at such other places in Pakistan as it considers necessary."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. The Commissioners",
      "content": "(1) Subject to sub-section (2), the Commission shall consist of such\nnumber of Commissioners, including the Chairman, appointed by the Federal Government as may be\nfixed by the Federal Government but such number shall not be less than five and more than seven. A\nCommissioner shall be a person who is known for his integrity, expertise, experience and eminence in\nany relevant field, including the securities market, law, accountancy, economics, finance 2[insurance]\nand industry.\n(2) The majority of the commissioners shall always be of private sector persons.\n(3) Subject to the provisions of this Act, the Commission shall, in discharge of its functions\nand exercise of its powers, conduct its proceedings in accordance with the regulations made by the\n2\n[Commission].\n2\n[(4) The Commissioners, including the Chairman, shall be paid such remuneration and\nallowances as the Commission may, with the approval of the Board, determine.]\n3\n[(5) No act, proceeding or decision of the Commission shall be invalid by reason only of the\nexistence of a vacancy in, or defect in the constitution of the Commission.]."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. The Chairman",
      "content": "(1) The Federal Government shall appoint one of the Commissioners to\nbe the Chairman of the Commission, and no Commissioners shall be appointed Chairman for more\nthan two consecutive terms.\n(2) The Chairman shall be the chief executive officer of the Commission and shall, together\nwith the other Commissioners, be responsible for the day to day administration of the affairs of the\nCommission and shall, subject to the regulations made by the Commission, be assisted by the other\nCommissioners in carrying out the functions of the Commission.\n1\nAdded by Act XXXVI of 2016, s. 3.\n2\nIns. Subs., added by Ord. LV of 2000, s. 3.\n3\nSubs. by Act XVIII of 2013, s.2.\n1\n[6A. The Acting Chairman. At any time when position of the Chairman is vacant or the\nChairman is unable to perform his functions due to any cause, the Federal Government shall appoint\nsenior most Commissioner of the Commission to be the Acting Chairman of the Commission until\nappointment of the Chairman on a regular basis:\nProvided that the Federal Government shall ensure the appointment of Chairman on regular\nbasis within hundred and twenty days from the date the post of Chairman fell vacant.]"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Term of office of the Commissioners",
      "content": "(1) Not less than three of the Commissioners\n(excluding the Chairman) first appointed under this Act, to be selected at random ballot in accordance\nwith such procedure as may be approved by the Board (the “Term A Commissioner”) shall hold office\nfor a term of two years, shall retire on the expiration of that term and may be re-appointed for a further\nterm of three years. The Commissioners, other than the Term A Commissioners (including the\nChairman, the “Term B Commissioners”) shall hold office for a term of three years, shall retire on the\nexpiration of that term and may be re-appointed for a further term of three years.\n2\n[(2) At the end of each term, initial or further, or at the end of the cumulative period of five\nyears, in case of the Term A Commissioners, or six years, in case of Term B Commissioners, as\nprovided for in sub-section (1), the relevant number of Commissioners shall cease to hold office and\nany vacancy thus arising shall in each case be filled by appointment of the requisite number of qualified\npersons as Commissioners, each for a term of three years starting from the date of appointment:\nProvided that a Commissioner shall be deemed to have retired at the end of such three-years\nunless, being eligible for re-appointment, he is re-appointed.]\n3\n[(3) Notwithstanding anything contained in sub-sections (1) and (2),-\n(a)         a person who, on the date of his appointment is more than sixty-two years of\nage, shall not be appointed as a Commissioner; and\n(b)         a Commissioner shall cease to hold office attaining the age of sixty-five years.]"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Appointment of employees of the Commission",
      "content": "(1) The Commission may, from time to\ntime, employ persons to be employees of the Commission who shall be paid such remuneration and\nallowances and shall hold their employment on such terms and conditions as may be determined by\nthe Commission with the approval of the Board.\n(2) The employees of the Commission shall hold office during the pleasure of the Commission\nand shall be liable to disciplinary action in accordance with the procedure laid down by the\nCommission with the approval of the Board."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Appointment of advisers and consultants.―(1) Subject to sub",
      "content": "section (2), the\nCommission may, employ and pay consultants and agents and technical, professional and other\nadvisers including, without limitation, bankers, stockbrokers, surveyors, valuers, actuaries,\naccountants, lawyers, and other persons to transact any business or to do any act required to be\ntransacted or done in the exercise of its powers, the performance of its functions or for the better\nimplementation of the purposes of this Act.\n1\nIns by Act XXXVI of 2016, s. 4.\n2\nSubs by Ord. XVIII of 2013, s. 3.\n3\nSubs., Ins. by Act. I of 2008, s. 15.\n(2) The decision to employ and the terms of employment of external advisers and consultants\nshall be made by the Commission in accordance with such policy guidelines as the Commission may,\nin consultation with the Board, establish from time to time."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Delegation of the Commission's functions or powers",
      "content": "(1) The Commission may,\nsubject to such conditions and limitations as it may deem fit to impose, delegate any of its functions\nor powers 1[under this Act or any administered legislation] to one or more Commissioners or any\nofficer of the Commission.\n(2) A delegation under this section shall not prevent the concurrent performance or exercise by\nthe Commission of the functions or powers so delegated."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. The Commission to furnish information. The Commission shall furnish to the Federal",
      "content": "Government or the Board such information with respect to the policy it is pursuing or proposes to\npursue in the performance of any of its functions under this Act as the Federal Government or the\nBoard may, from time to time, require.\n1\n[11A. Committees of the Commission. The Commission may constitute committees,\nconsultative group, task force etc. as it considers necessary or expedient to assist it in performance of\nits functions under this Act or any administered legislation.]."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. The Securities and Exchange Policy Board",
      "content": "(1) The Federal Government shall appoint\na Securities and Exchange Policy Board consisting of 2[eleven] Members.\n(2) Of the Members—\n3\n(a)            [five] shall be—\n3\n[(i)   ex-officio the Finance Minister or, in his absence, the Advisor to Prime\nMinister on Finance, as the case may be,] and\n(ii)       ex-officio the Secretary to the Government of Pakistan Law Division;\n4\n[(iia) ex-officio Secretary to the Government of Pakistan, Commerce Division;]\n(iii)      ex officio the Chairman of the Commission; and\n(iv)       a Deputy Governor of the State Bank of Pakistan nominated by the\nGovernor of the State Bank of Pakistan; and\n1\nIns by Act XXXVI of 2016, Ss. 5 and 6.\n2\nSubs. by Act XXXVI of 2016, s. 7.\n3\nSubs., Ins by Act I of 2008, s. 15.\n4\nSubs. Ins. by Ord. LV of 2000, s. 4.\n1\n(b)      [six] appointed by the Federal Government from private sector each of whom\nis well-known for his integrity, expertise and experience in the spheres of\ncommerce and industry (including in particular the securities industry),\ncorporate law, accountancy, financial services, investment 2[,insurance,]\nbanking, academia or other related relevant fields of expertise [:]1\n1\n[Provided that the Federal Government shall ensure the appointment of private sector member\nof the Board within hundred and twenty days from the date of such vacancy in the Board.]\n(3) A member, not being an ex-officio Member, shall hold office for a term of four years and\nshall be eligible for re-appointment for one further four-year term but not more [.]1\n1\n[* * *]\n(4) An ex-officio Member shall hold office as Member till such time as he holds the office by\nvirtue of which he is a Member and upon his transfer therefrom or retirement, resignation or removal\nfrom office, the person appointed in such Member's place shall be the Member.\n(5) If an ex-officio Member is absent from Pakistan or is unable to attend a meeting of the\nBoard he may authorize an officer, not below the rank of Additional Secretary, of his Division, to act\nas Member and such officer, if approved by the Board, may act as Member.\n(6) If an ex-officio Member is disqualified to be a Member or resigns his office, the Federal\nGovernment shall,—\n(a)        in case he is a person referred to in sub-clause (i) or sub-clause (ii) of clause (a)\nof sub-section (2), appoint another Secretary as Member, so long such person\nholds the post; and\n(b)        in case of a Deputy Governor appoint another Deputy Governor as Member.\n3\n[(7) The Federal Government shall designate one of the Members to be the Chairman of the\nBoard who shall, in the event of a tie, have a casting vote.];"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Procedure of the Board",
      "content": "(1) The Board shall meet as often as may be necessary for the\nperformance of its functions but not less than four times in a calendar year.\n(2) The quorum for a meeting of the Board shall be 4[five] Members, including the Chairman.\n(3) Subject to the provisions of this Act, the procedure and conduct of business of the Board\nshall be regulated by the regulations made by the Board."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Board may invite others to meetings. The Board may invite any person to attend any of",
      "content": "its meetings or deliberations (including any of its committees) for the purpose of advising it on any\nmatter under discussion but any person so attending shall have no right to participate in any decision\nor vote at the said meeting or deliberation.\n1\nSubs. Ins. and omitted by Act XXXVI of 2016, s. 7.\n2\nIns. by Ord. LV of 2000, s. 4\n3\nSubs by Act of I of 08, s. 15.\n4\nSubs. by Act. XXXVI of 2016, s. 8."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Committees of the Board",
      "content": "(1) The Board may constitute such number of its committees\nas it considers necessary or expedient to assist it in the performance of its functions under this Act.\n(2) A committee constituted under this section shall act in accordance with the regulations\nmade by the Board.\n(3) Except as otherwise provided in the regulations made by the Board, the meetings of a\ncommittee shall be held at such times and places as the Chairman of the committee may determine.\n(4) The Members, other than ex-officio Members, commissioner or employees, and any other\nperson invited to attend any meeting of the Board or a committee shall be entitled to such compensation\nand reimbursement of expenses as the Board may from time to time determine by regulations."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Disclosure of interest by Commissioners and Members",
      "content": "(1) For the purpose of this\nand the next following section, a person shall be deemed to have an interest in a matter if he has any\ninterest, pecuniary or otherwise, in such matter which could reasonably be regarded as giving rise to a\nconflict between his duty to honestly perform his functions under this Act and such interest, so that his\nability to consider and decide any question impartially or to give any advice without bias, may\nreasonably be regarded as impaired.\n(2) A Commissioner or a Member having any interest in any matter to be discussed or decided\nby the Commission or the Board or a committee shall, prior to any discussion of the matter, disclose\nin writing, respectively, to the Commission, the Board or a committee, as the case may be, the fact of\nhis interest and the nature thereof.\n(3) A disclosure of interest under sub-section (2) shall be recorded in the minutes of the\nCommission, the Board, or a committee, as the case may be, prior to any discussion of, or decision on,\nthe matter and, after the disclosure, the Commissioner or, as the case may be the Member—\n(a)     shall not, save, in the case of Commissioners, as provided in sub-sections (7) to\n(9), take part nor be present in any deliberation or decision of the Commission,\nthe Board or a committee, as the case may be, and\n(b)     shall be disregarded for the purpose of constitution of a quorum of the Board,\nthe Commission or a committee, as the case may be.\n(4) Any Commissioner, Member or the member of a committee who fails to disclose his interest\nas required by this section shall be guilty of an offence and shall on conviction be liable to\nimprisonment for a term which may extend to one year, or a fine not exceeding one million rupees, or\nboth.\n(5) It shall be a valid defence for a person charged with an offence under sub-section (4) if he\nproves that he was not aware of the facts constituting the offence and that he exercised due care and\ndiligence in discovering those facts which he ought reasonably to have known in the circumstances.\n(6) Each Commissioner shall give written notice to the Federal Government of all direct or\nindirect pecuniary interests that he has or acquires in a body corporate carrying on a business in\nPakistan. The nature of such interests and the particulars thereof shall be disclosed in the annual report\nof the Commission made under section 25.\n(7) If a Commissioner is not the Chairman and the Chairman becomes aware that a\nCommissioner has the interest, the Chairman shall,—\n(a)     if the Chairman considers that the Commissioner should not take part, or\ncontinue to take part, as the case may require, in determining the matter, direct\nthe Commissioner accordingly, or\n(b)     in any other case, cause the Commissioner's interest to be disclosed to the\npersons concerned in the matter (including any person whose application is\npending decision or adjudication by the Commission).\n(8) The Commissioner in respect of whom a direction has been given under clause (a) of sub-\nsection (7) shall comply with the direction.\n(9) If the Commissioner is the Chairman, he shall disclose his interest to the persons concerned\nin the matter (including any person whose application is pending decision or adjudication by the\nCommission).\n(10) Subject to sub-section (7), the Chairman or the Commissioner who has any interest in any\nmatter referred to in this section shall not take part, or continue to take part, as the case may require,\nin determining the matter unless everyone concerned in it consents to the Chairman or, as the case may\nbe, the Commissioner so taking part."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Notification of interest by others",
      "content": "(1) Where a person who, in the course of,—\n(a)     performing a function, or exercising a power, as a delegate of the Commission,\n(b)     performing functions or service as an employee, or\n(c)     performing a function or services in any capacity by way of assisting or advising\nthe Commission, the Board, any committee or any delegate of the Commission,\nis required to consider a matter in which he has an interest, such person shall\nforthwith give to the Commission a written notice stating that he is required to\nconsider the matter and has an interest in it and setting out particulars of the\ninterest.\n(2) The person referred to in sub-section (1) shall also declare his interest in accordance with\nthe said sub-section whenever it is necessary to avoid the conflict of interest.\nDISQUALIFICATION, REMOVAL, RESIGNATION AND VACANCIES"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Disqualification of Members and Commissioners. No person shall be appointed or",
      "content": "continue as a Member or Commissioner if he—\n(a)        has been convicted of an offence involving moral turpitude;\n(b)        has been or is adjudged insolvent;\n(c)        is incapable of discharging his duties by reasons of physical, physiological or\nmental unfitness and has been so declared by a registered medical practitioner\nappointed by the Federal Government;\n(d)        being a Member, absents himself from three consecutive meetings of the Board,\nwithout leave of the Board and, in the case of a Member ex-officio, or fails to\nappoint another person to act as member under sub-section (5) of section 12, or\n(e)        fails to disclose any conflict of interest at or within the time provided for such\ndisclosure by or under this Act or contravenes any of the provisions of this Act\npertaining to unauthorized disclosure of information."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Removal, resignation and vacancies",
      "content": "(1) Subject to sub-section (2), appointment of any\nMember or Commissioner may, at any time, be revoked and he may be removed from his office by\norder of the Federal Government if it is found that such person stands disqualified under section 18.\n(2) Unless a disqualification referred to in section 18 arises from the judgment or order of a\ncourt or tribunal of competent jurisdiction under any relevant provision of applicable law, a Member\nor Commissioner shall not be removed or his appointment revoked without an enquiry by an impartial\nperson or body of persons constituted in accordance with such procedure, as may be prescribed by\nrules made by the Federal Government, and such rules shall provide for a reasonable opportunity for\nhim to be heard in his defence.\n(3) A Member or a Commissioner may at any time resign his office by a written notice\naddressed to the Federal Government.\n(4) The office of a Member or Commissioner shall ipso facto be vacated if he dies."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Powers and functions of the Commission",
      "content": "(1) The Commission shall have all such\npowers as may be necessary to perform its duties and functions under this Act 1[or any administered\nlegislation].\n(2) The Commission may, having regard to its functions and to exercise its powers efficiently,\norganize itself into divisions, wings or such other sub-divisions as it may consider expedient.\n(3) The Commission may, from time to time, identify the matters requiring the Board to make\npolicy decisions and may also make recommendations regarding policy to the Board for its\nconsideration.\n(4) The Commission shall be responsible for the performance of the following functions:\n(a)        regulating the issue of securities;\n1\nIns. by Act. XXXVI of 2016, s. 9.\n(b)        regulating the business in Stock Exchange 1[Commodity Exchange] and any\nother securities markets;\n(c)        supervising and monitoring the activities of any central depository and Stock\nExchange clearing house;\n(d)        registering and regulating the working of stock brokers, sub brokers, share\ntransfer agents, bankers to an issue, trustees of trust deeds, registrars to an issue,\nunderwriters, portfolio managers, investment advisers and such other\nintermediaries who may be associated with the 2[financial services market] in\nany manner;\n(e)        proposing regulations for the registration and regulating the working of\ncollective investment schemes, including unit trust schemes;\n(f)        promoting and regulating self-regulatory organizations including securities\nindustry and related organizations such as Stock Exchanges and associations of\nmutual funds, leasing companies and other NBFIs;\n2\n[(fa) establishing and regulating entities for the protection of investors;\n(fb)       promoting, encouraging and enforcing proper conduct, competence and\nintegrity of regulated persons;\n(fc)       proposing regulations for disclosure of information in public interest;]\n(g)        prohibiting fraudulent and unfair trade practices relating to 2[financial services\nmarket];\n(h)        promoting investors education and training of intermediaries 1[operating in the\nfinancial services market];\n3\n[(ha) hearing and deciding investor complaints against persons involved in brokerage\nbusiness for violations of securities, laws, rules, regulations, directives, codes,\netc;]\n(i)        conducting 2[inspections and] investigations in respect of matters related to this\nAct and 2[any administered legislation] and in particular for the purpose of\ninvestigating insider trading in securities and 3[initiating action against the]\noffenders;\n2\n[(ia) ensuring development of a sound regulatory framework to counter and suppress\nillegal, improper and unfair practices in financial services market and other\nsectors regulated by the Commission ;]\n(j)        regulating substantial acquisition of shares and the merger and take-over of\ncompanies;\n1\nIns. by Act I of 2003, s. 11.\n2\nIns. Subs. and added by Act XXXVI of 2016, s. 9.\n3\nIns. and Subs. by Act I of 2008, s. 15.\n1\n[(ja) regulating professionals who provide services within the financial service\nmarkets;]\n2\n[(jb) maintaining and issuing panels of auditors from which companies may appoint\nauditors, and approving audit firms for financial institutions, listed companies\nand NBFIs;];\n(k)        calling for information from and undertaking inspections, conducting inquiries\nand audits of the Stock Exchanges and intermediaries and self-regulatory\norganizations in the 3[financial services market];\n3\n[(l)   considering and suggesting reforms relating to the financial services market,\nregulated persons, companies and bodies corporate, including changes to the\nconstitution, rules and regulations of companies and bodies corporate, securities\nexchanges or clearing houses;]\n(m)        encouraging the organized development of the 3[financial services market and\nother sector regulated by the commission] in Pakistan;\n(n)        conducting research in respect of any of the matters set out in this sub­section;\n(o)        performing such functions and exercising such powers of the 3[* * *] Federal\nGovernment delegated to the 3[Commission] (other than the power to make any\nrules or regulations) under the provisions of the Ordinance, 4[the Securities and\nExchange Ordinance, 1969 (XVII of 1969), the Modaraba Companies and\nModaraba (Floatation and Control) Ordinance, 1980 (XXXI of 1980)] and\nunder any other law for the time being in force 3[or any other law which may be\nmade after commencement of this Act,] under which any function or power has\nbeen conferred on the 3[Commission].\n(p)        performing such functions and exercising such powers (other than the power to\nmake any rules or regulations) under the Ordinance or any other law for the time\nbeing in force as may, after the commencement of this Act, be delegated to it\nby the Federal Government and exercising any power or performing any\nfunctions conferred on it by or under any other law for the time being in force ;\n5\n[*]\n(q)        proposing regulations in respect of all or any of the aforesaid matters for the\nconsideration and approval of the Board 5[; and]\n5\n[(r)   Exercising all powers, discharging all duties and performing all functions\nassigned to the Commission under, and generally administering, the law of\nInsurance;\n(s)        ensuring and monitoring compliance by insurers, insurance surveyors and\ninsurance intermediaries of all laws, rules and regulations pertaining to\ninsurance for the time being in force;\n1\nIns. by Act IV of 2007, s. 17 (w.e.f. 1-7-2007)\n2\nIns. by Act I of 08, s.15.\n3\nSubs. Omitted, and Ins., by Act XXXVI of 2016, s. 9.\n4\nIns by Act IV of 1999, s.17.\n5\nOmitted, subs. and Added by Ord LV of 2000, s.5\n(t)        regulating professional organizations connected with the Insurance business;\n1\n[omitted]\n(u)        encouraging the organized development of the insurance market in Pakistan] 1[;\nand]\n(v)        promoting and regulating development of Private Pension Schemes and Funds;\n2\n[*]\n2\n[(w) to control and minimize misconduct, market abuse and financial crime in the\nfinancial services market and other sectors regulated by Commission;]\n2\n[(x)   for regulating and facilitating the growth of Shariah compliant financial\nproducts in the financial services market except the financial products regulated\nby the State Bank of Pakistan;\n(y)         to identify and address the factors resulting in systemic risk in the markets\nregulated by the Commission;\n(z)        to regulate and facilitate healthy growth of the corporate sector (private and\npublic), and to promote good corporate governance for development of efficient\nmanagement and prudent financial practices;\n(za)       establishing a foundation or fund to provide for welfare support and facilities to\nthe employees whether serving or retired and their families and to create,\nestablish, organize and assist in the social and cultural activities;\n(zb)       to regulate financial services market to ensure that they function in a fair,\nefficient, transparent and orderly manner; and\n(zc)       performing any other functions entrusted to the Commission by the Federal\nGovernment from time to time.]\n(5) Without prejudice to the provisions of sub-section (4), the approval of the Commission\nshall be required by-\n(a)        all public companies incorporated in Pakistan which intend to issue or offer for\nsale securities in markets outside Pakistan or to list such securities on a Stock\nExchange outside Pakistan, in each case, whether directly or through an\nintermediary;\n(b)        all bodies corporate incorporated outside Pakistan which or persons who intend\nto issue or offer for sale, securities to the public in Pakistan or to list such\nsecurities on a Stock Exchange; and\n(c)        all bodies corporate incorporated outside Pakistan which are already listed on a\nStock Exchange, for the listing of and quotation for any additional securities.\n1\nOmitted, subs. and added by Act I of 03 see 11\n2\nOmitted, Subs. and added by Act XXXVI of 2016, s. 9.\n(6) In performing its functions and exercising its powers, the Commission shall strive\n(a)       to maintain facilities and improve the performance of companies and of\n1\n[financial services market], in the interest of commercial certainty, reducing\nbusiness costs, and efficiency and development of the economy;\n(b)       to maintain the confidence of investors in the 1[financial services market] by\nensuring adequate protection for such investors;\n1\n[(ba) to create awareness among investors and to provide an appropriate degree of\nprotection for investors, having regard to the general principle that investors\nshould take responsibility for their decisions;]\n(c)       to achieve uniformity in how it performs those functions and exercise those\npowers;\n(d)       to administer laws effectively but with a minimum of procedural requirements;\n(e)       to receive, process, and store, efficiently and quickly, the documents lodged\nwith, and the information given to, it under this Act, the Ordinance or any other\nlaw;\n(f)       to ensure that the documents, and the information referred to in clause (e) are\navailable as soon as possible for access by the public; 2[*]\n2\n[(fa) to maintain the confidence of holders of insurance policies by protecting the\ninterests of policy holders and beneficiaries of insurance policies in all matters,\nincluding assignment of insurance policies, nomination by policy holders,\ninsurable interest, surrender value of policies of life insurance, and other terms\nand conditions of contracts of insurance;\n(fb)      to improve existing methods and devise new options for the expeditious\nsettlement of claims and disputes between insurers and policy holders and\nbetween insurers and intermediaries;\n(fc) to promote efficiency in the conduct of insurance business;\n(fd)      to promote the establishment and development of professional and educational\norganizations connected with insurance business with a view to improving the\nquality of insurance services in the country;\n(fe)      to promote awareness among consumers with respect to the benefits of\ninsurance and the existence of measures to safeguard the interests of\nmortgagors, mortgagees and potential policy holders; and]\n(g)       to take whatever action it can take, and is necessary, in order to enforce and give\neffect to 1[this Act, any administered legislation] or any other law.\n1\nSubs., Ins. and added by Act XXXVI of 2016, s. 9.\n2\nOmitted and Ins. by Ord. LV of 2000, ss. 5-6.\n2\n[(7) The Commission, and the Commissioner or officer to whom any of the functions or\npowers have been delegated under section 10 may, for the purposes of a proceeding or enquiry, require\nanyone-\n(a)        to produce before, and to allow to be examined and kept by, an officer of the\nCommission specified in this behalf, any books, accounts or other documents\nin the custody or under the control of the person so required, being documents\nrelating to any matter the examination of which may be considered necessary\nby the Commission or such Commissioner or officer; and\n(b)        to furnish to an officer of the Commission specified in this behalf such\ninformation and documents in his possession relating to any matter as may be\nnecessary for the purposes of the proceeding or enquiry.]"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Functions and powers of the Board",
      "content": "(1) Subject to the provisions of this Act, the Board\nshall-\n(a)        when so asked to do and after consultation with the Commission, advise the\nFederal Government on all matters relating to-\n(i)       the securities industry 2[and insurence industry];\n2\n[(iia) regulation of the insurance sector and protection of the interests of\ninsurance policy holders;]\n(iii)     measures to encourage self-regulation by the Stock Exchanges\n1\n[insurers, Insurance intermediaries, Insurance surveyours] and NBFIs\nby specifying and the standards for such self­regulatory organizations;\n(iv)      measures to promote the development of and to regulate the securities\nmarket; 1[and the insurance market]; and\n(v)       other related matters;\n2\n[(b)   consider and approve (with or without modification) any regulations with\nrespect to implementation of policy decisions, proposed to be made by the\nCommission under the Act.]\n(c)        consider and approve (with or without modification) the budget for each\nfinancial year of the Commission prepared and submitted to it pursuant to the\nprovisions of sub­section (2) of section 24;\n(d)        express its opinion in writing on any policy matter referred to it by the Federal\nGovernment or the Commission;\n(e)        oversee the performance of the Commission to the extent that the purposes of\nthis Act are achieved;\n1\nAdded by Act 4 of 1999, s.17.\n2\nAmended by Ord. LV of 2000, ss, 5-6.\n(f)        exercise all such powers and perform all such functions as are conferred or\nassigned to it under this Act; and\n(g)         specify fees, penalties and other charges chargeable by the Commission for\ncarrying out the purposes of this Act.\n(2) All policy decisions, including any change in previously established policy, in respect of\nall and any matters within the jurisdiction of the Commission shall be made only by the Board. The\nBoard may make policy decisions suo motu or adopt such policy recommendation of the Commission,\nwith or without modification, as the Board may deem fit in its sole discretion."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Supplementary provisions",
      "content": "(1) All guidelines decisions and directives whether of the\nBoard or the Commission shall be in writing expressed by resolutions, orders or in such other form as\nmay be appropriate in the circumstances and shall be authenticated in the manner prescribed by the\nregulations, and where so provided by regulations, also sealed with the seal of the Commission.\n(2) All policy decisions and directives of the Board and the Commission respectively shall be\npublished in the official Gazette and the Board and the Commission shall make” such publications\navailable to the public.\n(3) The Commission shall, in adjudicating upon the rights of any person whose application on\nany matter it is required to consider in the exercise of any power or function under this Act, give the\nreasons for its decision after giving the person concerned a personal hearing, in addition to any written\napplications or submission which may be required to be made.\n(4) The Commission when exercising its powers under this Act shall have regard, so far as,\nrelevant to the circumstances of the particular case, to―\n(a)         the viability of the company or body corporate;\n(b)         the quality and capability of the management of the company or body corporate;\n(c)         the suitability for listing of the company or body corporate or a Stock Exchange\nwhere applicable;\n(d)         the interest of public investors, existing or potential, in the company or body\ncorporate;\n1\n[(da) the professional competence and capability of persons engaged in the provision\nof services in the Insurance Industry;\n(db)        the interest of insurance policy holders, existing or potential, where applicable;]\n(e)         any policy decision or directives of the Board; and\n(f)         the general public interest.\n(5) Subject to the compliance of the provisions of sub-section (3), section 24A of the General\nClauses Act, 1897 (X of 1897), shall apply to any order made or direction given under this Act.\n1\nInserted by Ord. 55 of 2000, ss, 5-6."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. The Fund",
      "content": "(1) There is hereby established, for the purposes of this Act, a Fund to be\nadministered and controlled by the Commission.\n(2) The Fund shall consist of—\n(a)        such sums as the Federal Government may from time to time, grant;\n(b)        grants of money and sums borrowed or raised by the Commission for the\npurposes of meeting any of its obligations or discharging any of its duties;\n1\n[(c)   taxes, fees, penalties or other charges levied under this Act, the Ordinance, the\nSecurities and Exchange Ordinance, 1969 (XVII of 1969), the Modaraba\nCompanies and Modaraba (Floatation and Control) Ordinance, 1980 (XXXI of\n1980), and Under any other law for the time being administered by the\nCommission 1[Law of Insurance] 2[*]\n(d)        all other sums or property which may in any manner become payable to or\nvested in the Commission in respect of any matter incidental to the exercise of\nits functions and powers 2[;and]\n2\n[(e)   any other sources as may be notified by the Federal Government.]\n(3) It shall be the duty of the Commission to conserve the Fund by performing its functions\nand exercising its powers under this Act 2[or any administered legislation] so as to ensure that the total\nrevenues of the Commission are sufficient to meet all sums properly chargeable to its revenue account."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Expenditure to be charged on the Fund",
      "content": "(1) The Fund shall be expended for the\npurpose of—\n(a)        paying any expenditure lawfully incurred by the Commission, including the\nremuneration of Commissioners and employees appointed and employed by the\nCommission, including provident fund contributions, superannuating\nallowances or gratuities and legal fees and cost and other fees and costs;\n(b)        paying any other expenses, costs or expenditure properly incurred or accepted\nby the Commission in the performance of its functions or the exercise of its\npowers under this Act;\n(c)        purchasing or hiring equipment, machinery and any other materials, acquiring\nland and erecting buildings, and carrying out any other work and undertakings\nin the performance of its functions or the exercise of its powers under this Act;\n1\nSubs. by Act 4 of 1999, s. 17.\n2\nOmitted, subs. added, and ins. by Act XXXVI of 2016, s. 10.\n(d)        repaying any financial accommodation received or moneys borrowed under\nthis Act and the profit, return, mark-up or interest due thereon (howsoever\ncalled); and\n(e)        generally paying any expenses for carrying into effect the provisions of this Act\n1\n[or any administered legislation].\n(2) Within ninety days of its establishment, the Commission shall prepare and submit to the\nBoard for its approval, a budget for the period up to and including the end of the then current financial\nyear and thereafter it shall, not later than thirty days 3[before the expiry] of each financial year, submit\nto the Board for approval a budget for the next financial year.\n(3) No expenditure shall be made for which provision has not been made in any approved\nbudget except if made from any previously approved contingency funds, unless further approval is\nsought and obtained from the Board.\n2\n[(3A) Any surplus of receipts over the actual expenditure 1[including budgeted capital\nexpenditure] in a year, after payment of tax, shall be remitted to the Federal Consolidated Fund and\nany deficit from the actual expenditure shall be made up by the Federal Government.”; and\n(4) The Commission shall act as the secretariat of the Board and provide all the necessary\nfacilities to enable the Board to exercise its powers and perform its functions under this Act and the\nnecessary and proper expenses in that connection shall form part of the budget of the Commission."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Annual report and accounts",
      "content": "(1) Within ninety days from the end of each financial year,\nof the Commission (including investigations and enquiries made by the Commission under this Act or\nthe Ordinance 3[or the Law of Insurances] during that financial year and release to the public and\nsimultaneously send a copy of the report to the Federal Government.\n(2) The Commission shall cause proper accounts to be kept and shall as soon as practicable\nafter the end of each financial year cause to be prepared for that financial year a statement of accounts\nof the Commission which shall include a balance-sheet and an account of income and expenditure.\n3\n[(3) The Commission shall cause the statement of accounts to be audited by auditors,\nappointed by Commission with the approval of the Federal Government, who shall be a firm of\nchartered accountants. Any casual vacancy in the office of auditor appointed under this section may\nbe filled in by Commission.]\n(4) The auditors shall make a report to the Federal Government, upon the annual balance sheet\nand accounts, and in any such report they shall state whether in their opinion the balance sheet is a full\nand fair balance sheet containing all necessary particulars and properly drawn up so as to exhibit a true\nand correct view of the affairs of the Commission and, in case they have called for any explanation or\ninformation from the Commission, whether it has been given and whether it is satisfactory.\n(5) The Federal Government may if it deems fit also required the accounts of the Commission\nfor any financial year to be audited by the Auditor General of Pakistan.\n1\nIns. by Act XXXVI of 2016, s. 11.\n2\nIns. by Act XVII of 2012, s. 13.\n3\nsubs. and ins. by Ord. LV of 2000, Ss. 9-10\n(6) The Board shall, within one hundred and twenty days of the end of each financial year,\ntogether with the annual report of the Commission under sub-section (2), send a copy of the statement\nof accounts of the Commission certified by the auditors and a copy of the auditors' report to the Federal\nGovernment which shall cause them to be published in the official Gazette and laid before both Houses\nof the Majlis-e-Shoora (Parliament) within two months of their receipt."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Power to obtain finance, borrow money and receive grants",
      "content": "(1) The Commission may,\nfrom time to time, and with the approval of the Federal Government, obtain finance or borrow money\nfrom sources within Pakistan or from abroad, as the case may be, with such rate of return, profit, mark-\nup or interest payable thereon, as the case may be, and for such period and upon such terms as to the\ntime and method of repayment and otherwise, in respect of any sums required by the\nCommission for meeting any of its obligations or performing any of its functions.\n(2) The Commission may also accept 1[* * *] and with the approval of the Federal Government,\ngrants from entities both domestic and international, including multilateral agencies."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Investment",
      "content": "(1) Subject to sub-section (2), the Commission may, in so far as its moneys\nare not required to be expended under this Act, invest in such manner as set out in section 20 of the\nTrusts Act, 1882 (II of 1882).\n(2) The Commission shall not invest its money in listed securities or any derivative thereof\nwhether listed or not.\n1\n[28. Bank Accounts. The Commission may 2[* * *] open and maintain its accounts in rupees\nor in any foreign currency at such scheduled banks as it may from time to time determine.]\n3[INSPECTION, INVESTIGATION AND ENFORCEMENT]\n4\n[28A. Inspection.—(1) For the purpose of ascertaining whether a person who is, or at any\ntime has been, a regulated person is complying with or has complied with any provision or requirement\nof this Act or any administered legislation, or the terms and conditions of licence or registration, the\nCommission may from time to time inspect any record or document relating to any regulated activity.\n(2) The Commission may authorize in writing one or more of its employees to exercise the\npowers of the Commission under this section.\n(3) In the exercise of his powers under this section, an authorized person may―\n(a)        require the regulated person, or any concerned person, whom he believes is in\npossession of or has under his control any record or document referred to in\nsub-section (1), to produce that record or document before him;\n(b)        make inquiries of a regulated person, or any other person whom he has\nreasonable cause to believe has information relating to any record or document\nreferred to in sub-section (1), concerning any such record or document or\nconcerning any transaction or activity which was undertaken in the course of,\nor which may affect, the business conducted by the regulated person; and\n(c)        inspect and make copies of, or take extracts from, and where necessary take\npossession of, such documents.\n1\nOmitted and subs., by Ord. 55 of 2000, Ss.11-12.\n2\nOmitted by Act VII of 2003, s. 11.\n3\nSubs. by Act XXXVI of 2016, s. 12 and 14.\n4\nIns. and Subs., by Act XXXVI of 2016, s.12 and 13\n(4) For the purpose of an inspection under this section, the regulated person or other person\nmentioned in sub-section (3) shall afford an authorized person access to the records or documents as\nmay be required for the inspection and shall produce before the authorized person such records or\ndocuments as may be required.\n(5) Any person who, without reasonable excuse, fails to comply with a requirement imposed\non him by an authorized person under sub-section (3) commits an offence under this Act and shall be\npunishable with imprisonment of either description which may extend to three years or with fine which\nmay extend to two hundred million rupees or with both.]\n1[29. Investigation and proceedings by the Commission.—(1)Where the Commission, either\non its own motion or on the basis of any information received, authorize one or more of its employees\nor one or more other persons to investigate, whether—\n(a)       an offence or a contravention has been committed by any person under this Act\nor any administered legislation or a subordinate legislation;\n(b)       a regulated person has been engaged in committing fraud, misfeasance or other\nmisconduct in carrying on a regulated activity; or\n(c)       the manner in which a regulated person has engaged or is engaging in his\nregulated activity is not in the interest of the financial services market or\ninvestors, and submit an investigation report thereof to the Commission, the\nCommission shall proceed in the matter in accordance with the provisions of\nthe Act and the administered legislation:\nProvided that where any special procedure regarding investigation or inquiry is provided in the\nadministered legislation the Commission may adopt such special procedure in addition to the\nprocedure provided in this Act.\n(2) Any concerned person, who is reasonably believed or suspected by the investigator to have\nin his possession or under his control any record or document which contains or which is likely to\ncontain information relevant to an investigation under this section or who is believed or suspected of\notherwise having such information in his possession or under his control, shall—\n(a)       produce to the investigator, within such time and at such place as the\ninvestigator requires in writing, any record or document specified by the\ninvestigator which is, or may be, relevant to the investigation and which is in\nhis possession or under his control;\n(b)       if required by the investigator give the investigator an explanation for or further\nparticulars of any record or document produced under clause (a);\n1\nSubs. by Act XXXVI of 2016, s. 12 and 14.\n(c)        appear before the investigator at such time and at such place as the investigator\nrequires in writing and answer truthfully and to the best of his ability any\nquestion relating to the matters under investigation as the investigator may put\nto him, whether orally or in writing; and\n(d)        provide to the investigator all assistance in connection with the investigation\nwhich he is reasonably able to give.\n(3) Any person who without reasonable cause fails to—\n(a)        produce any record or document required to be produced under clause (a) of\nsub-section (2);\n(b)        give an explanation or further particulars as required under clause(b) of\nsub­section (2);\n(c)        appear before the investigator as required under clause (c) of sub­section (2);\n(d)        answer a question put to him by the investigator under clause (c) of sub-section\n(2) or in answering the question says anything which he knows to be false or\nmisleading in a material particular or who in so answering recklessly makes a\nfalse statement; or\n(e)        comply with clause (d) of sub-section (2), commits an offence under this Act\nand shall be punishable with imprisonment of either description which may\nextend to three years or with fine which may extend to two hundred million\nrupees or with both.\n(4) The Commission may, for the purposes of investigation under this Act or any administered\nlegislation, also seek assistance of any other investigating agencies, bureau, local police and\nadministration, statutory bodies, banks and other relevant entity, who shall provide such assistance to\nthe Commission.]"
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Powers of the investigating officers of the Commission",
      "content": "(1) An investigating officer\ncarrying out an investigation or inspection may, only after the written order of the Commission signed\nby 1[a commissioner, or an officer, authorized in this behalf] enter any place or building—\n(a)        to inspect and make copies of or take extracts from any book, minute book,\nregister or document; and\n(b)        where he has reason to believe that an offence has been committed under this\nAct 1[any administered legislation] or any other law in respect of which the\nCommission has power to make investigation or inspection, to search for, seize,\ntake possession of and detain any object, article, material, thing, accounts book\nor other document, including any travel or other personal document which may\nbe used as evidence.\n1\nSubs. by Act XXXVI of 2016, s. 15.\n1\n[(1A) The investigator shall, for the purposes of investigations, have the same powers as are\nvested in a civil court under the Code of Civil Procedure, 1908 (Act V of 1908), while trying suit in\nrespect of the following matters, namely:—\n(a)        summoning and enforcing the attendance of any witness and examining him on\noath or affirmation;\n(b)        compelling the discovery or production of any document, record or other\nmaterial object;\n(c)        receiving evidence on affidavit; and\n(d)        issuing commissions for the examination of witnesses and documents.\n(1B) In addition to sub-section (3), any person who contravenes the requirements of clause (a),\n(b) and (c) of sub-section (IA), the investigator may, after prior written approval of the Commission,\nmake an application to the Court for attachment of property, both movable and immovable, or require\nhim to furnish security for his appearance or any other order as the Court deems appropriate and\nnecessary and in addition, the Commission may pass any order under Chapter XIA on a report of the\ninvestigation officer.\n(1C) Notwithstanding anything contained in Qanun-e-Shahadat Order, 1984 (P.O. 10 of 1984)\nall evidence collected though modern electronic devices and such other techniques shall be admissible\nin the court of law.\n(1D) Any proceeding before the investigator shall be deemed to be a judicial proceeding within\nof any contravention thereof the Commission may file a complaint in the Court of Sessions.]\n(2) When an order has been made under sub-section (1) an investigating officer of the\nCommission may, by notice in writing, require any person to produce before him such books, registers\nor documents as are in the custody or under the control of that person.\n(3) A person who—\n(a)        fails deliberately to produce any such books, registers or documents as are\nrequired by the Commission or an investigating officer; or\n(b)        obstructs or hinders an investigating officer while exercising any of the powers\nunder this section;\nshall be guilty of an offence and shall be liable on conviction to a fine which may extend to one million\nrupees or to imprisonment for a term not exceeding one month, or to both.\n(4) Any accounts, book or other document seized and taken possession of by the investigating\nofficer of the Commission under sub-section (1) may be inspected by any person if such person is\nentitled to inspect such accounts, book or document under this Act, and if so authorized to do in writing\nby the Commission.\n1\nIns. by Act XXXVI of 2016, s. 15.\n(5) Sub-section (1) shall not be construed as limiting or affecting any similar powers conferred\non any person under any, other law.\n(6) Any person aggrieved by the conduct of an investigating officer may lodge a complaint in\nrespect thereof to the Commission.\n(7) The Commission shall, within fifteen days of receipt of the complaint under sub-section (6)\ncommence a hearing to determine the veracity of such complaint in accordance with such procedure\nas may be prescribed by rules made by the Federal Government."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Forcible entry",
      "content": "(1) For the purpose of exercising his powers under sub-sections (1) and\n(2) of section 30, an investigating officer of the Commission may enter any place or building by force,\nif necessary 1[in such form and manner as may be prescribed by the Federal Government through\nrules].\n(2) Notwithstanding anything contained in sub-section (1), no investigating officer of the\nCommission shall enter any premises by the use of force without a written order of the Commission\nsigned by 1[a Commissioner authorized in this behalf].\n(3) If, on enquiry conducted in accordance with the rules it is found that the exercise by an\ninvestigating officer of his power under sub-section (2) was vexatious, excessive or with mala fide\nintent such officer shall be dismissed from service, and shall be guilty of an offence punishable with\nfine which may extend to five hundred thousand rupees and imprisonment for a term not exceeding\none year.\n(4) Whenever a criminal Court imposes a fine under sub-section (3) it shall, when passing\njudgment, order that a sum equal to the whole or any part of the fine recovered, be paid to the person\non whose complaint the investigating officer was convicted, and in case the fine is not recovered the\nsum shall be paid out of the Fund.\n(5) Any sum paid under sub-section (4) shall be without prejudice to the right of the aggrieved\nperson to avail any other remedies available to him under the law but at the time of awarding\ncompensation in any subsequent proceedings relating to the same matter the Court shall take into\naccount any sum recovered from the convict and paid to the aggrieved person.\n2\n[31A. Power of the Commission to call for information.—(1) Notwithstanding anything\ncontained in any other law, the Commission or authorized investigating officer may, by notice in\nwriting, require any person including financial institution to furnish it with such documents or\ninformation as it may require during the course of inquiry, inspection or investigation under this Act\nor any administered legislation within such time and verified in such manner as it may specify.\n(2) The duty to supply information under this section applies notwithstanding any other\nenactment or law in Pakistan including Banking Companies Ordinance, 1962 (LXII of 1962).\n(3) Any person who refuses to provide information required by the Commission under\nsub-section (1) shall be guilty of an offence and shall be liable on conviction to a fine which may\nextend to one million rupees or to imprisonment for a term not exceeding three years, or with both.]\n1\nIns, subs. by Act XXXVI of 2016, s. 16.\n2\nIns. by Act XXXVI of 2016, s. 17."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Power to call for examination",
      "content": "(1) For the purpose of sub-section (1) of section 29, the\nCommission may by notice in writing require any person acquainted with the facts and circumstances\nof the case to appear before an investigating officer authorized by it in this regard. Such person shall\nbe examined orally and any statement made by such person during the course of the examination shall\nbe reduced into writing.\n(2) Such person shall be bound to answer all questions relating to such case put to him by the\ninvestigating officer, as the case may be, and to state the truth, whether or not the statement is made\nwholly or partly in answer questions.\n(3) Subject to sub-section (4), a statement made by any person under this section shall be taken\ndown in writing and signed by the person making it or affixed with his signature and thumb print, as\nthe case may be, after it has been read to him and after he had been given an opportunity to make any\ncorrection he may wish.\n(4) Where the person examined refuses to sign and affix his thumb print on the statement, the\ninvestigating officer of the Commission shall endorse thereon under his hand the fact of such refusal\nand the reason therefor, if any, stated by the person examined.\n(5) Any person who:—\n(a)        fails to appear before an investigating officer of the Commission as required\nunder sub­section (1);\n(b)        refuses to answer any question put to him by an investigating officer of the\nCommission as required under sub­section (2); or\n(c)        knowingly furnishes to an investigating officer of the Commission information\nor statement that is false or misleading in any material particular;\n(d)        wilfully refuses to obey or disregards any lawful order of the Commission\n1\n[under this Act or any other law administered by the commission];\nshall be guilty of an offence and shall be liable on conviction to a fine not exceeding one hundred\nthousand rupees or to imprisonment for a term not exceeding one year, or to both.\n1\n[32A. Implementation of orders of the Commission. The Commission may issue such\ndirections as may be necessary or expedient to give effect to its orders or to prevent abuse of its process,\nincluding but not limited to, seeking the assistance of the local administration or Police who shall be\nbound to provide such assistance.]\n2\n[32B. Review.—(1) Any order passed by the Commission shall be subject to review by the\nCommission on its own motion or on application made to it within thirty days from the date of such\norder.\n(2) Any person aggrieved by an order of the Appellate Bench from which an appeal is allowed\nunder section 34 but no appeal has been preferred, may file an application for review within thirty days\nfrom the date of such order.]\n1\nIns. by Act I of 2008, s. 15.\n2\nIns. by Act XXXVI of 2016, s. 18."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Appeal to the Appellate Bench of the Commission",
      "content": "1[(1) Except as otherwise provided any\nperson aggrieved by an order of the Commission passed by one Commissioner or an officer authorized\nin this behalf by the Commission, may within thirty days of the order, prefer an appeal to an Appellate\nBench of the Commission constituted under sub-section (2):\nProvided that no appeal shall lie against:-\n(a)        an administrative direction given by a Commissioner or an officer of the\nCommission;\n(b)        an order passed in exercise of the powers of revision or review;\n(c)        a sanction provided or decision made by a Commissioner or an officer of the\nCommission to commence legal proceedings 2[* * *] ; and\n(d)        an interim order which does not dispose of the entire matter.]\n(2) The Commission shall constitute an Appellate Bench of the Commission comprising not\nless than two Commissioners to hear appeals under sub-section (1).\n(3) If any Commissioner who is included in the Appellate Bench has participated or been\nconcerned in the decision being appealed against the Chairman shall nominate an other Commissioner\nto sit in the Bench to hear that appeal.\n3\n[(3A) Any clerical or arthematic mistakes in an order or error arising therein from any\naccidental slip or omission may at any time be corrected by the Appellate Bench on its own motion or\non an application made to it by any party.]\n(4) The form in which an appeal is to be filed and the fees to be paid therefor and other related\nmatters shall be prescribed by rules."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Appeal to the Court",
      "content": "(1) An appeal shall lie to the Court referred to in Part II of the\nOrdinance in respect of an order of the Commission comprising two or more Commissioners or the\nAppellate Bench 3[or order made under sub-section (2) of section 32B].\n(2) The appeal under sub-section (1) shall be filed within sixty days of the date of the decision\nand shall be accompanied by a fee of one hundred rupees.\n3\n[(3) The Court may, on an appeal made to it under sub-section (1), accept, set aside or vary\nthe order referred to in sub-section (1) or make such other order as the interest of justice require.\n(4) The Court shall at the stage of admission of an appeal, or at any time thereafter on\napplication of the aggrieved person with due notice to the parties, decide by means of a reasoned order\nwhether the appeal is to be admitted in part or in whole depending on the facts and circumstances of\nthe case:\nProvided that the admission of the appeal shall not per se operate as a stay and nor shall any\nstay be granted therein unless the Commission has been given an opportunity of being heard.\n1\nSubs. by Act IV of 2007, s. 17.\n2\nOmitted. by Act I of 2008, s. 15.\n3\nIns. by Act XXXVI of 2016, s. 19-20.\n(5) Notwithstanding anything contained in any other law, the hearing of appeal may continue\nday to day, unless sufficient cause has shown by the parties jointly or severally which is beyond the\ncontrol of the parties, the Court may adjourn the hearing for maximum of two dates and such\nadjournment may not be more than fifteen days at any one time or for more than thirty days in all.]"
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Obligation of confidentiality",
      "content": "(1) Subject to this section, any person who is or was at\nany time—\n(a)     acting as a Member of the Board, or\n(b)     engaged as a Commissioner or employee of the Commission, or\n(c)     authorized to perform or exercise any function or power of the Commission or\nany function or power on behalf of the Commission or to render services to the\nCommission in the capacity of a consultant or adviser;\nshall not, except to the extent necessary to perform his official duties, or in performance or exercise of\nsuch a function or power, either directly or indirectly, make a record of, or disclose to any person, any\ninformation that is or was acquired by him because of having been so appointed, engaged or\nauthorized, or make use of any such information, for any purpose other than the performance of his\nofficial duties or the performance or exercise of that function or power.\n(2) Any person who contravenes sub-section (1) shall be guilty of an offence and shall be liable\non conviction to a fine not exceeding one million rupees or to imprisonment for a term not exceeding\none year or, to both.\n(3) The Commission shall take all reasonable measures to protect from unauthorized use or\ndisclosure the information given to it in confidence in or in connection with the performance of its\nfunctions or the exercise of its powers.\n(4) For the purpose of sub-section (1) the disclosure of information as required or permitted by\nany law for the time being in force in Pakistan or any other jurisdiction shall be taken to be authorized\nuse and disclosure of the information.\n(5) For the purposes of sub-section (1), the disclosure of information by a person for the\npurposes of—\n(a)     performing his functions as—\n(i)     a Commissioner or employee of the Commission, or\n(ii)    a person who is acting as a Commissioner or employee or who is\nauthorized to perform or exercise a function or power of, or on behalf\nof, the Commission, or\n(b)    The performance of functions or service by the person by way of assisting a\nCommissioner or a delegate of the Commission, shall be taken to be authorized\nuse and disclosure of the information.\n(6) Where the Chairman is satisfied that particular information—\n(a)     will enable or assist the Board to perform or exercise any of its functions or\npowers;\n(b)     will enable or assist the Government, or an agency of the Government to\nperform a function or exercise a power; or\n(c)     will enable or assist the Government, or an agency of the Government, of a\nforeign country to perform a function, or exercise a power, conferred by a law\nin force in that foreign country;\nthe disclosure of the infomation to such persons by a person whom the Chairman authorizes for the\npurpose shall be taken to be authorized use and disclosure of the information.\n(7) The Chairman may impose conditions to be complied with in relation to information\ndisclosed under sub-section (6).\n(8) The disclosure of information to a body specified in sub-section (9) is authorized use and\ndisclosure of the information if:—\n(a)     the Chairman is satisfied that the information will enable or assist the body to\nmonitor compliance with, enforce, or perform functions or exercise powers\nunder―\n(i)    any law for the time being in force;\n(ii)   the rules and regulations (including the listing rules if any), of the body\n; and\n(b)     the disclosure is made by a person authorized by the Chairman for the purpose.\n(9) A body to whom disclosure of information under sub-section (8) may be authorized is—\n(a)     a Stock Exchange; or\n(b)     a clearing house; or\n(c)     a central depository; or\n(d)     such other body corporate as the Federal Government may by notification in the\nofficial Gazette specify for the purposes of this sub-section.\n(10) The Chairman may impose conditions to be complied with by the body and its officers,\nemployees and agents in relation to the information disclosed to it under sub-section (8) and persons\nin respect of whom conditions are imposed shall be bound to comply with them.\n(11) If information is disclosed to a body under sub-section (8) the body, or any officer,\nemployee or agent of the body shall not, without the written consent of the Chairman:\n(a)    disclose the information to a person who is not an officer, employee,\nprofessional adviser or agent of the body corporate; or\n(b)    use the information otherwise than for the purpose of monitoring compliance\nwith, enforcing, or performing functions or exercising powers under:\n(i)     the Ordinance and any other law for the time being in force; or\n(ii)    the rules and regulations (including the listing rules, if any), of the body\ncorporate.\n(12) The Chairman may delegate all or any of his functions and powers under sub-sections (6),\n(7), (8), (10) or (11) to a Commissioner or an employee.\n(13) Nothing in any of sub-sections (4), (5), (7) and (8) shall limit:\n(a)    anything else in any of those sub­sections; or\n(b)    what may otherwise constitute, for the purposes of sub-section (1), authorized\nuse or disclosure of information."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Permitted disclosure. Nothing in section 35 shall preclude a person from",
      "content": "(a)    producing a document to a Court in the cause of criminal proceedings or in the\ncourse of any proceedings under this Act, the Ordinance or any other law for\nthe time being in force.\n(b)    disclosing to a Court in the course of any proceedings referred to in clause (a)\nany matter or thing, that came under his notice in the performance of official\nduties or in the performance of a function or the exercise of a power referred to\nin that section ; or\n(c)    producing a document or disclosing information to a person to whom, in the\nopinion of the Commission, it is in the public interest that the document be\nproduced or the information be disclosed; or\n(d)    producing a document or disclosing information that is required or permitted by\nany law for the time being in force in Pakistan or any other jurisdiction to be\nproduced or disclosed, as the case may be; or\n(e)    producing a document or disclosing information to the Commission.\n1[PART IXA"
    },
    {
      "provision_ref": "sec36a",
      "section": "36A",
      "title": "Section 36A. Scope of powers under this Part",
      "content": "(1) The powers conferred on the Commission under\nthis Part may be exercised in relation to any regulated person if it appears to the Commission that —\n(a)       the exercise of the powers is desirable for the protection of investors or is in the\ninterest of the financial services market; or\n(b)       a regulated person is not a fit and proper person; or\n(c)       a regulated person has contravened or failed to comply with any provision of or\nany requirement under this Act or any administered legislation or, in purported\ncompliance with any such provision or requirement, has furnished the\nCommission with information that is false, inaccurate or misleading.\n(2) In exercising the powers conferred by this section or secjion 36B, the Commission may be\nentitled to rely on the findings of an inspection conducted under section 28A or the content of any\nreport of investigating officer received under section 29.\n(3) The powers conferred on the Commission by this Part may be exercised in relation to a\nperson whose registration or license has been suspended or revoked or has expired whether or not the\nsuspension or revocation is the subject of appeal."
    },
    {
      "provision_ref": "sec36b",
      "section": "36B",
      "title": "Section 36B. Restriction of business",
      "content": "(1) For the purposes of section 36A, the Commission may\nprohibit a regulated person from doing any one or more of the following, namely:—\n(a)       entering into transactions—\n(i)        of a specified description or other than of a specified description; or\n(ii)       in specified circumstances or other than in specified circumstances; or\n(iii)      to a specified extent or other than to a specified extent;\n(b)       soliciting business from persons of a specified description or from persons other\nthan of a specified description; or\n(c)       carrying on business in a specified manner or other than in a specified manner.\n(2) A prohibition under this section may relate to transactions entered into in connection with\nor for the purposes of the regulated activity or to other business that is carried on in connection with\nor for the purposes of any such regulated activity.\n1\nIns. Part-IXA, IXB and IXC, by Act XXXVI of 2016, s. 21."
    },
    {
      "provision_ref": "sec36c",
      "section": "36C",
      "title": "Section 36C. Self",
      "content": "regulatory organizations. A person who wishes to carry on activities as self-\nregulatory organization may apply to the Commission for registration and the Commission may, where\nit deems appropriate in the public interest or for the protection of investors, register any entity as a\nself-regulatory organization in such form and manner and subject to such terms and conditions as may\nbe specified including but not limited to following, namely:—\n(a)     it is a company licensed by the Commission under section 42 of the Ordinance;\n(b)     it has specified in its memorandum of association as its main objects the\ndischarging of functions of self­regulatory organization;\n(c)     it has necessary infrastructure, adequate office space, equipments, experienced\nman power and technical aspects, financial resources, policies, procedures,\nsystems and controls to effectively and efficiently discharge its functions and\nresponsibilities;\n(d)     its directors and senior management officials fulfill the fit and proper criteria as\nmay be specified;\n(e)     at-least one-half of the number of its directors are independent directors and in\norder to determine the independent status of a director, the requirements\nprescribed in the code of corporate governance as specified by the Commission\nfrom time to time shall be followed;\n(f)     the chairman of the board of directors of that company shall always be an\nindependent director;\n(g)     it has paid up capital net of losses of not less than such amount as may be\nspecified; and\n(h)     any other conditions as may be spedified.\nExplanation.— For the purpose of this section, senior management officials shall include, chief\nexecutive officer or managing director, deputy managing director or chief operating officer and chief\nregulatory officer or holder of such position by whatever name called."
    },
    {
      "provision_ref": "sec36d",
      "section": "36D",
      "title": "Section 36D. Registration of self",
      "content": "regulatory organizations.—(1) The application for registration as\na self-regulatory organization shall be made in such form and manner and subject to such fee as may\nbe specified.\n(2) Upon receipt of application under sub-section (1), the Commission may grant certificate of\nregistration after making such inquiries and after obtaining such information as it considers necessary,\nincluding but not limited to the following, namely:—\n(a)     applicant fulfills the eligibility criteria;\n(b)     applicant has the ability to efficiently handle its functions as self-regulatory\norganization and its obligations under this Act and regulations made by the\nCommission;\n(c)     the regulations of the applicant contain satisfactory provisions for the matters\nspecified in this section;\n(d)     it shall be in the interest of financial services market and the public to grant\nregistration to the applicant; and\n(e)     any other condition as may be specified.\n(3) The certificate of registration as self-regulatory organization shall be valid for a period of\nfive years and may be renewed by the Commission subject to fulfillment of such conditions as may be\nspecified.\n(4) Self-regulatory organization shall be responsible to perform the functions which may\ninclude any or all of the following, namely:—\n(a)     effective training and education of the members of self-regulatory organization\nand investors in general;\n(b)     conducting examinations and providing certifications to its members and\ninvestors in general;\n(c)     providing research and development assistance to its members and investors in\ngeneral;\n(d)     conducting the grading of its members with respect to their compliance with the\napplicable law and other norms as may be specified;\n(e)     providing information to the investors regarding general and specific risks of\nfinancial services market, information pertaining to its members and other\ninformation useful for taking informed investment decisions and protecting the\ninterest of investors; and\n(f)     any other functions as may be specified.\n(5) It shall be responsibility of the self-regulatory organization to—\n(a)     specify code of conduct for its members and take measures for ensuring\ncompliance thereof;\n(b)     implement mechanism for monitoring and supervising activities of its members\nand ensuring compliance with applicable laws;\n(c)     implement mechanism for inspection of its members on regular basis;\n(d)     take disciplinary action against its members in cases of violation of code of\nconduct and other applicable law;\n(e)    treat all its members in an equitable manner and must ensure that no member\ngains unfair advantage to other member as a result of oversight activities of\nself­regulatory organization;\n(f)    promptly inform the Commission regarding any non-compliance of laws by its\nmembers;\n(g)    act in good faith and take measures to avoid conflict of interest in conduct of its\nduties and functions;\n(h)    submit annual report to the Commission which shall contain such information\nas may be specified;\n(i)    comply with all the requirements of this Act, regulations made thereunder and\ndirections given by the Commission from time to time;\n(j)    comply with the code of corporate governance specified by the Commission;\n(k)    submit periodical returns to the Commission in the manner and frequency\nspecified;\n(I)    provide such assistance to the Commission as and when required, including the\nfurnishing of such returns and the provision of such information relating to its\noperations or required under this Act or any administered legislation and\napplicable rules and regulations, directions, notifications, etc.;\n(m)    extend full cooperation to the Commission in relation to any inspection or\ninvestigation against its members and in ensuring compliance with the law by\nits members; and\n(n)    perform such other duties and responsibilities as may be specified."
    },
    {
      "provision_ref": "sec36e",
      "section": "36E",
      "title": "Section 36E. Regulations of self",
      "content": "regulatory organization.—(1) Self-regulatory organization shall\nmake regulations subject to prior approval of the Commission and such regulations shall contain\nfollowing provisions, amongst others,—\n(a)    for the protection of investors;\n(b)    for manner of admission of its members;\n(c)    code of conduct for the members;\n(d)    for monitor conduct of its members;\n(e)    relating to discipline of a member who contravenes its regulations or the\nprovisions of this Act or any administered legislation and may provide for fine,\nsuspension, expulsion, limitation of activities, functions or operations;\n(f)    for specifying the procedure for disciplinary proceedings;\n(g)     right of appeal of member of self-regulatory organization against any\ndisciplinary action by the self-regulatory organization including manner and\nprocedures in connection therewith;\n(h)     for preventing fraudulent, deceptive and manipulative acts and practices and\npromoting fair trading practices;\n(i)     obligation of members to provide information to the self-regulatory\norganization in the manner and frequency specified;\n(j)     manner and frequency of submission of returns and information to the\nself­regulatory organization by its members;\n(k)     arbitration mechanism in relation to any dispute between its members or\nbetween members and their clients;\n(I)     for maintenance of books and records by the self­regulatory organization;\n(m)     criteria for appointment of auditors of self-regulatory organization and the\ncontent of audit report;\n(n)     for confidentiality of information available with the self-regulatory organization\nand its officers;\n(o)     for inspection of members including audit by independent auditors to determine\ncompliance with the law and provide opinion on such matters as may be\nspecified;\n(p)     for fair treatment to its members and any person who applies for membership;\nand\n(q)     any other matters as may be specified.\n(2) The Commission may approve regulations of self-regulatory organization with or without\nmodification or on its own motion, make or amend the regulations after giving due notice to the self-\nregulatory organization.\n(3) The Commission may, by notice in writing served on a self-regulatory organization, require\nit to —\n(a)     make regulations specified in the notice within the period specified; or\n(b)     amend regulations referred to in the notice in the manner and within the period\nspecified in the notice.\n(4) Where the Commission is satisfied that a self-regulatory organization has not complied\nwith a requirement referred to in sub-section (3) within the period specified in the notice, the\nCommission may make or amend the regulations and the regulations so made or amended shall be\ndeemed to have been made or amended by the self-regulatory organization and shall have effect\naccordingly.\n(5) Self-regulatory organization shall only admit the regulated persons which are granted a\nlicence by the Commission or which are registered with the Commission under the laws administered\nby the Commission:\nProvided that the Commission may declare a class of persons connected with the financial\nservices market who may be admitted by a self-regulatory organization as its members."
    },
    {
      "provision_ref": "sec36f",
      "section": "36F",
      "title": "Section 36F. Maintenance and inspection of records",
      "content": "(1) A self-regulatory organization shall —\n(a)    make and maintain such records in such form and manner and for such period\nas may be specified;\n(b)    file with the Commission any report specified by the Commission in the form\nand manner as may be specified; and\n(c)    appoint auditor with the prior approval of the Commission to express opinion\non such matters as may be specified.\n(2) The Commission may in writing at any time appoint one or more persons to —\n(a)    inspect books of accounts, other records and documents of the self-regulatory\norganization or its members and the self-regulatory organization or the member,\nas the case may be, shall extend full cooperation to the persons so appointed by\nthe Commission and produce all accounts, records and documents as may be\nrequired by person so appointed; and\n(b)    prepare such financial or other reports as the Commission requires."
    },
    {
      "provision_ref": "sec36g",
      "section": "36G",
      "title": "Section 36G. Powers of the Commission to issue directions to self",
      "content": "regulatory organization.—(1)\nWithout prejudice to the powers conferred by section 40B the Commission may issue directions to\nself-regulatory organization of a general or specific nature where the Commission considers it\nnecessary or expedient, in the public interest or for the protection of investors or in the interest of\nfinancial services market.\n(2) Where the self-regulatory organization contravenes any provision of this Act or any\nadministered legislation or any rules or regulations made thereunder or fails to comply with any\ndirection of the Commission, the Commission may, after providing a reasonable opportunity of being\nheard,—\n(a)    remove the chief exedutive officer, any director or officer of the self-regulatory\norganization from office;\n(b)    impose a penalty of such sum which may extend to fifty million rupees; or\n(c)    suspend or cancel the registration of the self-regulatory organization."
    },
    {
      "provision_ref": "sec36h",
      "section": "36H",
      "title": "Section 36H. Definitions. In this Part,",
      "content": "(a)     “auditor” means a chartered accountant within the meaning of Chartered\nAccountants Ordinance, 1961 (X of 1961) being a person qualified to be\nappointed as auditor of a company under section 253 of the Ordinance;\n(b)     “audit firm” means a firm of chartered accountants in practice organized as\npartnership under the Partnership Act, 1932 (IX of 1932) or a sole proprietary\nfirm being an auditor;\n(c)     “audit oversight board” or “AOB” means the independent audit oversight board\nestablished under section 36;\n(d)     “employee” means any officer or employee of AOB;\n(e)     “fund” means fund established under this Part;\n(f)     “Institute” means the Institute of Chartered Accountants of Pakistan established\nunder the Chartered Accountants Ordinance, 1961 (X of 1961);\n(g)     “member AOB” means the member of AOB;\n(h)     “nominating committee” means committee comprising following ex-officio\nmembers, namely:—\n(i)     Secretary to the Government of Pakistan, Finance Division;\n(ii)    the Chairman of the Commission;\n(iii)   the President of the Institute;\n(iv)    the Governor State Bank of Pakistan; and\n(v)     one member to be co-opted by the ex-officio members;\n(i)     “public interest company” means such company or body corporate as may be\nnotified by the Commission;\n(j)     “quality assurance board” or “QAB” means the quality assurance board\nconstituted by the Institute;\n(k)     “registered audit firm” means an audit firm registered with AOB; and\n(I)     “specified” means specified through regulations made under section 36Z.\n36 I. Establishment of AOB.—(1) There is hereby established an independent audit oversight\nboard to function in the public interest.\n(2) AOB shall have perpetual succession and common seal and can sue and be sued in its own\nname.\n(3) AOB shall perform such functions as assigned to it under this Part and shall have all powers\nincidental and ancillary thereto."
    },
    {
      "provision_ref": "sec36j",
      "section": "36J",
      "title": "Section 36J. Members of AOB",
      "content": "(1) AOB shall comprise seven members including its chairman.\n(2) The members and the chairman of AOB shall be appointed by the Federal Government on\nthe recommendation of the nominating committee.\n(3) A member AOB shall be a person who possesses relevant qualification such as a degree,\nrecognized by the Higher Education Commission, in accountancy, business, finance, law or economics\nand experience of audit, regulation of auditors or corporate law or having been on the board of directors\nor in the senior management of public interest companies.\n(4) The nominating committee shall formulate procedures for selection of members following\ndue process, including interviews of the potential candidates, before recommending them to the\nFederal Government for appointment.\n(5) The quorum of the meeting of AOB shall not be less than four members.\n(6) The members of AOB, including the chairman, shall be paid such remuneration and\nallowances as may be notified by the Federal Government on the recommendation of the nominating\ncommittee.\n(7) A member of AOB shall be appointed for an initial term of three years and shall be eligible\nfor reappointment for another non-renewable term of three years.\n(8) The nominating committee shall determine the appointment procedure and system of\nperformance evaluation of the members of AOB and its constitution and reconstitution in the following\nmanner, namely:—\n(a)     appointment of seven members on first constitution of AOB shall be made for\na term of three years;\n(b)     after expiry of three years on first constitution of AOB, four members of AOB,\nselected on random ballot out of the then existing members, shall continue for\nfurther term of three years and the remaining members shall stand retired and\ncease to hold the office, provided that they have completed their first term of\nthree years; and\n(c)     any vacancy arising at any time shall be filled in accordance with the provisions\nof this Part for a term of three years reckoning from the date of the appointment.\n(9) No act, proceeding or decision of AOB shall be invalid by reason only of the existence of\na vacancy in, or defect in the constitution of AOB."
    },
    {
      "provision_ref": "sec36k",
      "section": "36K",
      "title": "Section 36K. Functions of AOB. Notwithstanding anything contained in any other law, AOB shall",
      "content": "perform the following functions, namely:—\n(a)     to register audit firms, which carry out or intend to carry out audit of public\ninterest companies in the manner laid down in sub­section (1) of section 36T;\n(b)     to deregister audit firms in the manner laid down in sub-section (2) of section\n36T;\n(c)     to undertake comprehensive review and examination of the QAB work and\nindependently assess the appropriateness of the quality control review\nframework and take such actions as deemed necessary;\n(d)     to oversee and review policies, procedures, programs of QAB for ensuring an\neffective oversight of quality of audit of public interest companies and to specify\nany improvement required in QAB's policies, procedures and systems;\n(e)     to direct the Institute for making such changes in the quality control review\nframework as it considers necessary or expedient for the purposes of this Part;\n(f)     to ensure that the auditing standards adopted by the Institute conform to the\ninternational standards as issued by International Auditing and Assurance\nBoard;\n(g)     to conduct inspections and inquiries in respect of matters related to this Part and\nregulations made hereunder; and\n(h)     to coordinate with relevant authorities including the Commission, State Bank of\nPakistan and the Institute in formulating and implementing strategies for\nenhancing the reliability of quality and effectiveness of audits of public interest\ncompanies."
    },
    {
      "provision_ref": "sec36l",
      "section": "36L",
      "title": "Section 36L. Appointment of employees of AOB",
      "content": "(1) The AOB may, from lime to time, employ\npersons for AOB who shall be paid such remuneration and allowances as may be determined by AOB.\n(2) There shall be a full time chief executive officer of AOB with functions as may be\nprescribed."
    },
    {
      "provision_ref": "sec36m",
      "section": "36M",
      "title": "Section 36M. Disclosure of interest",
      "content": "(1) A member of AOB having directly or indirectly, by himself\nor through a member of his immediate family, any interest in any matter directly or indirectly under\ndiscussion by AOB shall disclose to the AOB the fact and nature of his interest.\n(2) A disclosure under sub-section (1) shall be recorded in the minutes of the meeting of AOB\nand, after the disclosure, the member having an interest in the matter —\n(a)     shall neither take part nor be present in any deliberation or decision of AOB;\nand\n(b)     shall be disregarded for the purpose of constituting a quorum of AOB.\n(3) Any member of AOB who fails to disclose his interest as provided under sub-section (1)\ncommits an offence and shall be liable to be removed there for by the Federal Government in\naccordance with the prescribed procedure."
    },
    {
      "provision_ref": "sec36n",
      "section": "36N",
      "title": "Section 36N. Disqualification of members. No person shall be appointed or continue as a member of",
      "content": "AOB if he—\n(a)     has been convicted of an offence involving moral turpitude;\n(b)     has been or is adjudged insolvent;\n(c)     is incapable of discharging his duties by reasons of physical, physiological or\nmental unfitness and has been so. declared by a registered medical practitioner\nappointed by the Federal Government;\n(d)     being a member, absents himself from three consecutive meetings of AOB,\nwithout leave of AOB;\n(e)     fails to disclose any conflict of interest at or within the time provided for such\ndisclosure by or under this Act or contravenes any of the provisions of this Act\npertaining to unauthorized disclosure of information; or\n(f)     is found guilty of misconduct under section 36Q."
    },
    {
      "provision_ref": "sec36o",
      "section": "36O",
      "title": "Section 36O. Removal, resignation and vacancies",
      "content": "(1) Subject to sub-section (2), appointment of\nany member of AOB may, at any time, be revoked and he may be removed from his office subject to\nsuch procedure as may be specified.\n(2) A member of AOB may at any time resign his office by a written notice addressed to the\nchairman of AOB.\n(3) The office of a member of AOB shall ipso facto stand vacated if he dies.\n(4) Any vacancy created as a result of removal, resignation or death of a member of AOB shall\nbe filled on the recommendation of the nominating committee."
    },
    {
      "provision_ref": "sec36p",
      "section": "36P",
      "title": "Section 36P. Fund of AOB",
      "content": "(1) For the purposes of this Part, there is hereby established, a fund to\nbe managed and controlled by AOB in such form and manner as may be prescribed by regulations.\n(2) The fund under sub-section (1) shall consist of —\n(a)     such sums as the Federal Government may from time to time grant;\n(b)     voluntary contributions by the stakeholders;\n(c)     grants of monies and sums raised or borrowed by AOB for the purposes of\nmeeting any of its obligations or discharging any of its duties;\n(d)     fee for registration of the audit firm under this section;\n(e)    fee and charge from the public interest company required to be audited by a\nregistered audit firm;\n(f)    earnings from investments, properties or other assets owned by AOB; and\n(g)    any other grant or donations or amount permitted by the Federal Government.\n(3) The fund shall be used for the purposes of AOB's own affairs and may also be utilized for\nthe affairs of QAB."
    },
    {
      "provision_ref": "sec36r",
      "section": "36R",
      "title": "Section 36R. Accounts and Audit",
      "content": "(1) AOB shall keep proper books of accounts and records in such\nform and manner as may be specified.\n(2) AOB shall send audited financial statements along with auditors report for each financial\nyear to the Federal Government within such time and in such a manner as may be specified."
    },
    {
      "provision_ref": "sec36s",
      "section": "36S",
      "title": "Section 36S. Annual report",
      "content": "(1) AOB shall, within six months on the close of its financial year or\nsuch later time as allowed by the Federal Government, submit to the Federal Government and publish\nan annual report including its performance and future plans and such contents and information as may\nbe prescribed.\n(2) AOB shall ensure that the annual report is accompanied by such other information and\nstatements as may be prescribed."
    },
    {
      "provision_ref": "sec36t",
      "section": "36T",
      "title": "Section 36T. Registration and deregistration of audit firm",
      "content": "(1) An audit firm shall be entitled to\nbe registered on the recommendation of QAB in accordance with the quality control review\nframework:\nProvided that all the firms having satisfactory rating at the time of commencement of this Act\nshall be deemed to be registered.\n(2) AOB, on its own motion or on the recommendation of QAB, may order deregistration of\nthe audit firm from the register maintained under section 36W. For this purpose AOB shall rely on the\nwork and inspections carried out by QAB or its own inspection."
    },
    {
      "provision_ref": "sec36u",
      "section": "36U",
      "title": "Section 36U. Inspection and proceedings by AOB",
      "content": "(1) AOB on a complaint, suo moto or on\nreference made by the Commission or State Bank of Pakistan may conduct inspection of records of\nQAB, in respect of an audit firm registered under this Part, to ensure compliance of this Part or\nregulations made hereunder:\nProvided that, if AOB is not satisfied with the work of QAB, it may directly conduct inspection\nof records of audit firm and the public interest company.\n(2) For the purposes of sub-section (1), AOB or any person authorized in this behalf shall have\n1908), while trying a suit, in respect of the following matters, namely:—\n(a)     discovery and production of books of account and other documents, at such\nplace and at such time as may be specified;\n(b)     summoning and enforcing the attendance of persons and examining them on\noath or affirmation;\n(c)     inspection of any books, registers and other documents of any person referred\nto in clause at any place;\n(d)     issuing commissions for examination of witnesses or documents; and\n(e)     receiving evidence on affidavit."
    },
    {
      "provision_ref": "sec36v",
      "section": "36V",
      "title": "Section 36V. Appeal to the Court",
      "content": "Any person aggrieved by an order of AOB may file an appeal\nbefore the Court, within sixty days of the order of AOB."
    },
    {
      "provision_ref": "sec36w",
      "section": "36W",
      "title": "Section 36W. Register of audit firms",
      "content": "AOB shall keep and maintain register of firms authorized to\ncarry out audit of public interest companies in such form and manner as may be specified."
    },
    {
      "provision_ref": "sec36x",
      "section": "36X",
      "title": "Section 36X. AOB may seek assistance",
      "content": "AOB may seek such assistance from the Commission, State\nBank of Pakistan or Institute as it reasonably require for the performance of its duties and functions\nunder this Part."
    },
    {
      "provision_ref": "sec36y",
      "section": "36Y",
      "title": "Section 36Y. Registration and supervision fees",
      "content": "AOB shall specify fee for the registration of\nauditors of public interest companies, supervision fee for the public interest companies and such others\nas specified."
    },
    {
      "provision_ref": "sec36z",
      "section": "36Z",
      "title": "Section 36Z. Power to make regulations",
      "content": "AOB may make regulations for the purposes of this Part.\n36AA. Power to give directions, circulars, code, guidelines etc.—AOB may issue such\ndirectives, circular, code, guidelines or policy statements as it considers appropriate to carry out the\npurposes of this Part.\n36BB. Power to call for information.—For the purposes of discharging its functions the AOB\nshall be empowered to seek such information from QAB, audit firms and public interest companies or\nfrom any other person, as deemed necessary by it.\n36CC. Penalty, sanctions or revocation of registration.—(1) Subject to sub-section (2), if\nan audit firm fails to comply with the requirement of this Part or any regulations made there-under, or\nif so recommended by the QAB based upon its findings, AOB may after providing opportunity of\nhearing,—\n(a)     impose penalty which may extend to five million Rupees;\n(b)     impose following sanctions;\n(i)    such audit firm may be barred from engaging itself as auditor of the\npublic interest companies for a minimum period of six months or for\nsuch higher period not exceeding five years as may be decided by AOB;\nor\n(ii)      revoke registration and remove name from the register of auditor of\npublic interest companies;\n(c)        reprimand, issue warnings or such other sanctions as deemed necessary or\nappropriate under the circumstances; or\n(d)        publish or place its findings of inspections of registered firms on its website.\n(2) The power to impose penalty under sub-section (1) shall be in addition to the power of the\nCommission to impose penalty or file compliant for prosecution in respect of an offence specified in\nany provisions of the Ordinance relating to the auditors.\n(3) AOB shall give opportunity to be heard through show cause notice to the registered audit\nfirm prior to imposing any penalty, sanctions or revocation of registration under this Part, regulations\nand give reasons for its decision.]\n_________\n1[37.  Cognizance of offences.—(1) Notwithstanding anything contained in the Code of\nCriminal Procedure, 1898 (Act No. V of 1898) but subject to the administered legislation, no court\nother than the court of sessions shall take cognizance of any offence punishable with imprisonment or\nimprisonment in addition of fine under this Act or any administered legislation, except on a complaint\nby an officer authorized in this behalf by the Commission signed by a Commissioner:\nProvided that the Federal Government may, in consultation with the Chief Justice of the\nconcerned High Court, notify any other court established under any other law presided by sessions\njudge or equivalent to take cognizance of any offences under this Act or any administered legislation.\n(2) Subject to sub-section (1), in case of transfer of case from court of sessions it will not be\nnecessary to recall any witness or record any evidence a new that may have been recorded and the\ncourt to which the case is transferred shall continue proceedings from the stage before such transfer."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Prosecution of offences by the Commission",
      "content": "(1) Notwithstanding anything contained\nin the Code of Criminal Procedure, 1898 (Act V of 1898) all prosecution of offences against any person\nunder this Act or the administered legislation, shall be conducted by a special public prosecutor\nappointed by the Commission:\nProvided that special public prosecutor or advocates appointed by the Commission may\ninstitute or defend cases, appeals, petitions, applications and all other matters before any court\nincluding the High Court and Supreme Court in matters arising out of or in relation to proceedings\nunder this Act or any administered legislation.\n1\nSubs. by Act XXXVI of 2016, s. 22.\n(2) On receipt of complaint the court shall issue summons as for the attendance of the accused\nin the first instance and on failure of the accused to appear before the court, warrant of arrest shall be\nissued by the court.\n(3) The complaint referred in this section shall mean the report in writing of the investigation\nofficer stating the facts constituting the offence along with statements of witnesses recorded under\nsection 32 and copies thereof shall be supplied to the accused free of cost before the commencement\nof the trial.\n(4) Personal attendance of the officer authorized by the Commission to file a complaint before\nthe court trying the offence shall not be required during the trial proceedings in the presence of special\npublic prosecutor referred to in sub-section (1).\n(5) The court shall adopt procedure provided for under Chapter XXII-A of the Code of Criminal\nProcedure, 1898 (Act V of 1898) in the manner not inconsistent with the provisions of this Act and all\nprosecutions before the court under this Act shall be disposed of and the judgment pronounced, as\nexpeditiously as possible.\n(6) The hearing of the matters referred to in sub-section (1) shall not be adjourned except for\nsufficient cause to be recorded or for more than fourteen days at one time and court may impose such\ncost as it may deems fit.\n(7) The court may, for reasons to be recorded, dispense with any procedure in the Code of\nCriminal Procedure, 1898 (Act V of 1898) and follow such procedure as it may deem fit in the\ncircumstances of the case for expeditious disposal of the complaint.]\n1[38A. Opportunity of hearing to the Commission in stay matters.—(1) Any court or\nauthority shall, before granting any injunction, whether temporary or permanent in respect of any\naction taken or to be taken by the Commission in pursuance of any power conferred by or under this\nAct or any administered legislation or subordinate legislation, provide opportunity of hearing to the\nCommission.\n(2) No suit or appeal against an order of the Commission or the Appellant Bench shall be\ninstituted except with prior notice of such proceedings to the Commission to its head office or regional\noffice, as the case may be, either personally or through courier along-with acknowledgement and copy\nof the petition or appeal.]\n_____________"
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Power to make rules",
      "content": "(1) Subject to sub-section (2), the Federal Government may, by\nnotification in the official Gazette, make rules for all or any of the matters in respect of which it is\nrequired to make rules to carry out the purposes of this Act.\n(2) The power to make rules conferred by this section shall be subject to the condition of\nprevious publication and before making any rules the draft thereof shall be published in the official\nGazette for eliciting public opinion thereon within a period of not less than 2[Thirty] days from the\ndate of publication.\n1\nIns. by Act XXXVI of 2016, s. 23.\n2\nSubs. by Ord. LV of 2000, s. 13."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Power to make regulations",
      "content": "(1) Subject to sub-section (2),\n(i)         the Board, 1[* * *] on the recommendation of the Commission and in\nconsultation with the Federal Government; and\n(ii)        the Commission 1[in consultation with] the Board, may make such\nregulations as may be required to carry out the purposes of this Act 2[or\nthe functions of the Commission specified in sub-section (4) of section\n20].\n(2) The power to make regulations conferred by this section shall be subject to the condition\nof previous publication and before making any regulations the draft thereof shall be published in two\nnewspapers of wide circulation for eliciting public opinion thereon within a period of not less than\n1\n[thirty] days from the date of publication.\n2\n[40A. Penalty for violation of rules 4[,] regulations 4[, directives and notification].—(1)\n4\nAny [person who contravenes or fails to comply with any provision of] rule made under section 39\nor regulation made under section 40 4[or directive or notification issued under this Act] 4[shall be liable\nto pay by way of penalty a sum] which may extend to ten million rupees and where the contravention\nis a continuing, one with a further 4[penalty] which may extend to one hundred thousand rupees for\nevery day after the first during which such contravention continues.\n(2) A 4[penalty] under sub-section (1) shall be imposed by the Commission after providing a\nreasonable opportunity of being heard to the party;\n3\n[40AA. Fines and penalties to be credited to the Federal Consolidated Fund.― All fines\nand penalties recovered by the Commission shall be credited to the Federal Consolidated Fund.]\n2\n[40B. Power of the Commission to issue directives, circulars, guidelines, etc. The\nCommission shall have the power to issue such directives, codes, guidelines, circulars or notifications\nas are necessary to carry out the purposes of this Act, the rules and regulations made thereunder and\n4\n[any administered legislation]]."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Common seal. The Commission shall have a common seal and such seal shall be kept in the",
      "content": "custody of the Chairman or such other person as may be authorized by the regulations made by the\nCommission. Documents required or permitted to be executed under seal shall be specified in and\nauthenticated in such manner as shall be authorized by regulations made by the Board.\n1\nOmitted and subs., by Ord. LV of 2000, s.14.\n2\nAdded & Ins. by Act IV of 2007, s. 17 (w.e.f. 1-7-07).\n3\nIns by Act XVII of 2012, s. 13.\n4\nSubs. and ins. by Act XXXVI of 2016, ss. 24-25.\n1\n[41A. Standard of proof.—(1) Where it is necessary for the Commission to establish or to\nbe satisfied, for the purposes of this Act or any administered legislation, that any person has\ncontravened:\n(a)        any provision of this Act or any administered legislation or subordinate\nlegislation;\n(b)        any notice, direction or requirement given or made under or pursuant to any\nprovision of this Act or any administered legislation;\n(c)        any of the terms and conditions of a registration granted under this Act or any\nlicence or registration granted under any administered legislation;\n(d)        any other condition imposed under or pursuant to any provision of this Act or\nany administered legislation,\nit shall be sufficient for the Commission to establish or to be satisfied as to the\nmatters referred above on the standard of proof applicable to civil proceedings\nin summary manner in a court of law."
    },
    {
      "provision_ref": "sec41b",
      "section": "41B",
      "title": "Section 41B. Inquiry, investigation and other proceedings in respect of regulated persons",
      "content": "(1)\nNotwithstanding anything contained in any other law, including National Accountability Ordinance,\n1999 (XVIII of 1999) and Federal Investigation Agency Act, 1974 (VIII of 1975) no action, inquiry,\ninvestigation or proceedings in respect of any regulated activity, regulated securities activity,\ntransaction, process or permission granted under this Act or any administered legislation, shall be\ntaken, initiated or conducted by any Federal or Provincial investigating agency, bureau, authority or\ninstitution by whatever name called without reference from the Commission.\nNo proceedings shall lie before any agency, bureau, authority or institution at the instance of\nany party to a matter which is or has been in issue before the Commission, in respect of a matter which\nis actually or has been or might or ought to have been a proper subject of complaint to the Commission\nunder the administered legislation:\nProvided that cases pending before any court having jurisdiction before coming into force of\nthis Amendment Act, shall continue to be prosecuted and conducted without reference from the\nCommission.]"
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Public servants",
      "content": "(1) The Members, Commissioners, employees and other persons\nauthorized to perform or exercise any function or power under this Act or rendering services to\nCommission as consultant or adviser shall be deemed to be public servants within the meaning of\nsection 21 of the Pakistan Penal Code, 1860 (Act XLV of 1860).\n(2) Save as otherwise provided by this Act and only for the purposes so provided, nothing\ntherein contained shall be construed to mean that any person referred to in sub-section (1) is or shall\nbe deemed to be in the service of Pakistan or is to be regarded or treated as a civil servant.\n1\nIns.by Act XXXVI of 2016, s. 26.\n1[42A.   Indemnity of the Commission, Chairman, Commissioners, employees and\nMember.—(1) No suit, prosecutions or any other legal proceedings or action in damages shall lie\nagainst the Commission, Chairman, Commissioners, employees and Members for anything done or\nomission in exercise or performance of any functions, power or duty conferred or imposed by or under\nthis Act or any administered legislation unless the act or omission is shown, beyond reasonable doubt\nto have been in bad faith.\n(2) A Chairman, Commissioner, employees, consultant, advisers and Member shall not be sued\nin their personal capacity for the action bonafidely taken in their official capacity and in case of any\nsuch suit the Commission shall bear expenses of the proceeding till its final dicision.]\n1[42B. Recovery of penalties.—(1) Any penalty imposed by the Commission in the exercise\nof its powers under this Act or any administered legislation or subordinate legislation, shall be payable\nto the Commission and may be recovered by the Commission as a decree for the payment of money in\ncase where the person aggrieved by such order has,-\n(a)        preferred an appeal under section 34 and the Court has upheld the order of the\nCommission or the Appellate Bench, it will automatically be converted into\nexecution proceeding and no fresh notices need to be issued to appellant; or\n(b)        not preferred an appeal to the Appellate Bench of the Commission under section\n33 or to the Court under section 34 and the Court on application of the\nCommission has confirmed and allowed conversion or initiation of execution\nproceedings after notices to the parties as deem appropriate by the Court.\n(2) The Court shall exercise all the powers of an executing court as provided in the Code of\nCivil Procedure, 1908 (Act V of 1908), for the porposes of recovery of penalties:\nProvided that the Court may, for reasons to be recorded, dispense with any procedure in the\nCode of Civil Procedure, 1908 (Act V of 1908) and follow such procedure as it may deem fit in the\ncircumstances of the case for expeditious disposal.\n(3) The executing Court may attach any immovable property or sale of any movable property,\nincluding bank accounts of the person or company on whom a penalty has been imposed under this\nAct or any administered legislation by the Commission and any transaction or attempt to alienate,\ntransfer, encumber or mortgage such property shall be void, illegal and without any lawfuI authority.\n(4) All government departments, authorities, bodies, private entities, housing societies or\nschemes, by whatever name called, banks and any other concerned entity shall, on the orders of the\nCourt, be bound to assist the Commission in providing details of moveable or immovable property of\njudgment debtor.\n(5) In addition to sub-sections (1), (2) and (3) any penalty imposed or amount ordered or\nrequired to be surrendered or deposited with the Commission under this Act or an administered\nlegislation may also be recovered by the Commission as arrears of land revenue.\n1\nSubs. and Ins. by Act XXXVI of 2016, ss. 27-28."
    },
    {
      "provision_ref": "sec42c",
      "section": "42C",
      "title": "Section 42C. Proof of documents by production of certified copies",
      "content": "Notwithstanding anything\ncontained in the Code of Criminal Procedure, 1898 ( Act No. V of 1898), Qanun-e-Shahadat Order,\n1984 (P.O. 10 of 1984) or any other law,—\n(a)     any duly certified copy of extract from any document or record maintained by\nconstrued as sufficient evidence in any inquiry or investigation or legal\nproceedings before any tribunal, authority or court of law ;\n(b)     no one shall without the permission of the Commission in writing, take over or\nremove any original document or register from the custody of the officer of the\nCommission maintained under this Act or any administrated law."
    },
    {
      "provision_ref": "sec42d",
      "section": "42D",
      "title": "Section 42D. Cooperation and assistance to foreign regulatory authorities",
      "content": "(1) Notwithstanding\nanything contained in any other law for the time being inforce, the Commission may, on reciprocal\nbasis, cooperate with and provide assistance under this Act or any administered legislation to a foreign\nregulatory authority or any other international organizations with whom the Commission has entered\ninto any arrangement or agreement or understanding for assisting in any inquiry or investigation. for\ncontravening the laws relating to financial services of the requesting authority.\n(2) An assistance referred to in sub-secion (1) shall include the disclosure of any information\nor document filed with or provided to the Commission under this Act or an administered legislation,\nor any information or document obtained by the Commission from any person on the request of the\nrequesting authority.\n(3) For the purposes of this section the Commission may, notwithstanding anything contained\nin any other law for the time being inforce including Banking Companies Ordinance, 1962 (LXII of\n1962), obtain any information or document from any person on the request of the requesting authority.\n(4) Such cooperation and assistance may be provided without regard to the fact that such\ncontravention does not constitute offence under this Act or any administered legislation.\n(5) The Commission may request the foreign regulatory body or authority or entity to seek such\nmutual legal assistance for carrying out inspection, inquiry investigation under this Act or any\nadministered legislation.\n(6) Notwithstanding anything contained in Qanun-e-Shahadat Order, 1984 (P.O. 10 of 1984)\nall evidence, documents or any material transferred to Pakistan by foreign entity under this section\nshall be considered as evidence in legal proceedings under this Act or any other law for the time being\nin force.\n(7) Any assistance provided under this section to any foreign regulatory authorities or\ninternational organizations may be refused by the Commission on the grounds of national security and\npublic interest."
    },
    {
      "provision_ref": "sec42e",
      "section": "42E",
      "title": "Section 42E. Power to amend the Schedule",
      "content": "The Federal Government may, by notification in the\nofficial Gazette, amend the Schedule.]"
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Dissolution of the Authority. The Authority is hereby 1dissolved and at all times",
      "content": "thereafter,—\n(a)    section 11 and sub-sections (3) to (7) (inclusive) of section 12 of the Ordinance\nshall stand repealed and except as hereinafter provided, all references to the\nAuthority appearing in the Ordinance and any other law for the time being in\nforce shall be deemed to mean and refer to the Commission;\n2\n[(b)   the rules under the Ordinance or under any other law for the time being in force\nbeing administered by the Commission shall be made by the Commission with\nthe approval of the Federal Government.]\n(c)        save as otherwise provided in clause (b), all powers exercisable by the Federal\nGovernment under any provisions of the Ordinance or any other law for the\ntime being in force, which immediately before the appointed day had been\ndelegated to the Authority, shall be exercised by the Commission;\n(d)        all assets, rights, powers, authorities and privileges and all property, movable\nand immovable, cash and bank balance, reserve funds, investments and all other\ninterests and rights in, or arising out of, such property and all debts, liabilities\nand obligations of whatever kind of the Authority subsisting immediately before\nits dissolution shall stand transferred to and vest in the Commission;\n(e)        no officer, employee, servant, or any other person holding any post in\nconnection with the affairs of the Authority, shall have any right or lien to\nappointment to any post in the Commission;\n3\n[(ea) the Commission may, on the instructions of the Federal Government, form a\ncommittee to initiate disciplinary proceedings against a person referred to in\nclause (e) and the Federal Government may take such disciplinary action as it\ndeem appropriate on the recommendation of the committee;]\n(f)        any person referred to in clause (e) who is appointed by the Commission shall\nhave the option either to remain a civil servant or to be an employee of the\nCommission. The option once exercised shall be irrevocable;\n(g)        in the event of a person referred to in clause (e) opting to be an employee of the\nCommission, he shall cease to be a civil servant for all purpose and shall be\nentitled to such remuneration, allowances and other terms and conditions of\nemployment as are applicable to the employees of the Commission. For the\nservice rendered in the Authority such person shall be entitled to such benefits\nincluding the transfer of benefits to the Commission as may be prescribed by\nthe rules. But, in the event of such a person opting to remain as a civil servant,\nhe shall be entitled to the same remuneration, allowances and other rights and\nprivileges as are admissible to civil servants but, in other respects such as\norganizational structure, right to promotion and discipline, he shall be subject\nto the regulations made by the Commission, and for the period he served the\nCommission, the Commission shall contribute to the pension, gratuity and final\npayment of provident fund in accordance with the rules.\n1\ni.e. 1-1-1999, see SRO 1404(I)/98-dt-31-12-98\n2\nSubs. by Ord. 55 of 2000, s.15.\n3\nIns. by Act XXXVI of 2016, s. 29.\n(h)        a person referred to in clause (e) who is not appointed by the Commission shall\ncontinue to draw his pay, allowances, privileges or other benefits as he was\ndrawing while holding the post in the Authority and unless sooner he is\nappointed by the Federal Government to another post or otherwise ceases to\nremain in Government service on account of retirement, dismissal, removal,\ndischarge from service or in any other manner applicable to a civil servant, the\ncost for payment salary, allowance and other benefits to such person shall be\nborne by the Commission.\n(i)          save as otherwise provided in clauses (e) and (h), all debts and\nobligations incurred or contracts entered into or rights acquired and all\nmatters and things engaged to be done by, with or for the Authority\nbefore the appointed day shall be deemed to have been incurred, entered\ninto, acquired or engaged to be done by, with or for the Commission, as\nthe case may be; and\n(j)          all suits and other legal proceedings instituted by or against the\nAuthority before the appointed day shall be deemed to be suits and\nproceedings by or against the Commission as the case may be and may\nproceed and be dealt with accordingly.\n1[43A. Abolition of Department of Insurance.—(1) As from the appointed date—\n(a)        the Department of Insurance shall stand abolished;\n(b)        no officer, employee, servant, or any other person holding any post in\nconnection with the affairs of the Department of Insurance, shall have any right\nor lien to appointment to any post in the Commission;\n(c)        any person referred to in clause (b) who is appointed by the Commission shall\nhave the option either to remain a civil servant or to be an employee of the\nCommission and the option once exercised shall be irrevocable;\n(d)         in the event of a person referred to in clause (b) opting to be an employee of\nthe Commission, he shall cease to be a civil servant for all purposes and shall\nbe entitled to such remuneration, allowances and other terms and conditions of\nemployment as are applicable to the employees of the Commission. For the\nservice rendered in the Department of Insurance such person shall be entitled to\nsuch benefits including the transfer of benefits the Commission as may be\nprescribed by the rules. But, in the event of such a person opting to remain as a\ncivil servant, he shall be entitled to the same remuneration, allowances and other\nrights and privileges as are admissible to civil servants but, in other respects\nsuch as organizational structure, right to seniority, promotion and discipline, he\nshall be subject to the regulations made by the Commission, and for the period\nhe served the Commission, the Commission shall contribute to the pension,\ngratuity and final payment of provident fund in accordance with the rules;\n1\nIns. by Ord. LV of 2000, s. 16.\n(e)        a person referred to in clause (b) who is not appointed by the Commission shall\ncontinue to draw his pay, allowances privileges or other benefits as he was\ndrawing while holding the post in the Department of Insurance and unless\nsooner he is appointed by the Federal Government to another post or otherwise\nceases to remain in Government service on account of retirement, dismissal,\nremoval, discharge from service or in any other manner applicable to a civil\nservant, the cost for paying salary, allowances and other benefits to such person\nshall be borne by the Commission;\n(f)        save as otherwise provided in this Act, all debts and obligations incurred or\ncontacts entered into or rights acquired and all matters and things engaged to be\ndone by, with or for the Federal Government under or pursuant to the Law of\nInsurance before the appointed date shall be deemed to have been incurred,\nentered into, acquired or engaged to be done by, with or for the Commission, as\nthe case may be; and\n(g)        all suits and other legal proceedings instituted by or against the Federal\nGovernment under, or pursuant to, the Law of Insurance before the appointed\ndate shall be deemed to be suits and proceedings by, or against, the Commission\nas the case may be and may be proceeded with and be dealt with accordingly.]"
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Savings. Save as otherwise provided in this Act, nothing in this Act shall affect or be",
      "content": "deemed to affect anything done, action taken, investigation or proceedings commenced, order, rule,\nregulation, appointment, document, or agreement made, fee directed, resolution passed, direction\ngiven, proceedings taken, or instrument executed or issued under or pursuant to any law amended or\nrepealed by this Act 1[or any amendments in this Act] and any such thing, action, investigation,\nproceedings, order, rule, regulation, appointment, document, agreement, fee resolution, direction,\nproceedings or instrument shall, if in force at the commencement date 1[or from the date of any\namendments made in this Act] and not inconsistent with any of the provisions of this Act, continue in\nforce and have effect as if it had been respectively done, taken, commenced, made, directed, passed,\ngiven, executed or issued under this Act or the law as amended by this Act."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Act to override other laws. The provisions of this Act shall have effect notwithstanding",
      "content": "anything inconsistent therewith contained in any other law for the time being in force.\n_______________\n1\nIns. by Act XXXVI of 2016, s. 30.\n(See clause (o) of sub-section (4) of section 20)"
    }
  ],
  "definitions": [
    {
      "term": "appointed day",
      "definition": "the day on which section 43 comes into force; 1 [(aa) “administered legislation” means the legislation administered by the Commission as specified in the Schedule I;]",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "the Corporate Law Authority constituted under the Companies Ordinance, 1984 (LXVII of 1984);",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Securities and Exchange Policy Board established under section 12;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "the Chairman of the Commission 1[and includes the Acting Chairman];",
      "source_provision": "sec2"
    },
    {
      "term": "civil servant",
      "definition": "a civil servant as defined in section 2 of the Civil Servants Act, 1973 (LXXI of 1973); 1 [(f) “clearing house” means a company that is licensed by the Commission as a clearing house;] * i.e. 1-1-1999 , See SRO 1404(1)/98, dt 31-12-98 1 Numbered, added, ins. and subs. by Act XXXVI of 2016, s. 2.",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the Securities and Exchange Commission of Pakistan established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Commissioner",
      "definition": "a Commissioner of the Commission and shall include the Chairman thereof;",
      "source_provision": "sec2"
    },
    {
      "term": "committee",
      "definition": "a committee of the 1[Commission or the Board] constituted under 1[this Act] ; 1 [(ia) “Court” means the Company Bench of a High Court as provided in sections 7 and 8 of the Companies Ordinance, 1984 ( XLVII of 1984 )]",
      "source_provision": "sec2"
    },
    {
      "term": "dealing in securities",
      "definition": "making or offering to make, whether as principal or agent, with any person or inducing or attempting to induce any person to enter into or to offer to enter into— (i) any agreement for or with a view to acquiring, disposing of, subscribing for or underwriting securities, or (ii) any agreement the apparent or ostensible purpose of which is to secure a profit to any of the parties from the yield of securities or by reference to fluctuations in the value of securities; 1 [(ja) “document” includes any information recorded in any form, including documents or statement of accounts in respect of customers maintained by financial institution, through modern electronic devices or techniques and data or information recorded in any legible form;]",
      "source_provision": "sec2"
    },
    {
      "term": "Fund",
      "definition": "the fund established under section 23; 2 [(la) “Law of insurance” means the Insurance Ordinance, 2000 (XXXIX of 2000) or any other law in relation to insurance, the administration of which is vested in the Commission by the Federal Government by notification in the official Gazette.].",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "a Member of the Board; 1 Subs. and Ins. by Act XXXVI of 2016, s. 2. 2 Ins. by Ord. LV of 2000, s. 2.",
      "source_provision": "sec2"
    },
    {
      "term": "NBFI",
      "definition": "a non-banking financial institution and includes a development finance institution, a Modaraba, a leasing company, a housing finance company and an investment bank but shall not include a banking company as defined in clause (c) of section 5 of the Banking Companies Ordinance, 1962 (LVII of 1962);",
      "source_provision": "sec2"
    },
    {
      "term": "Ordinance",
      "definition": "the Companies Ordinance, 1984 (XLVII of 1984);",
      "source_provision": "sec2"
    },
    {
      "term": "private sector person",
      "definition": "a person who is not in the service of Pakistan or of any statutory body or any body which is owned or controlled by the Federal Government or a Provincial Government not including a University or an educational institution; 1 [(pa) “regulated activity” means any activity which is required to be registered with or licensed by the Commission under this Act or any administered legislation;",
      "source_provision": "sec2"
    },
    {
      "term": "regulated person",
      "definition": "a person or entity licensed or registered under this Act or any administered legislation to carry on or engage in a regulated activity not being an institution exclusively regulated by the State Bank of Pakistan;]",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "the regulations made by the Board or the Commission; [*]1",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "the rules made by the Federal Government [;]1 1 [(s) “Schedule” means schedule annexed to this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "self regulatory organization",
      "definition": "an entity connected with financial services market and registered by the Commission under this Act for the purpose of regulating the operations, standards of practice and business conduct of its members and their representatives with a view to promote protection of investors and the public interest;",
      "source_provision": "sec2"
    },
    {
      "term": "specified",
      "definition": "specified by the Commission through regulations made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "subordinate legislation",
      "definition": "any rules or regulations made under this Act or any administered legislation; and",
      "source_provision": "sec2"
    },
    {
      "term": "systemic risk",
      "definition": "the risks, including potential, emerging and systemic risks in financial services market, entities, infrastructure, products and activities which may impact the ability of the Commission to fulfil its regulatory responsibilities provided in this Act. ] 1 [(2) Unless the context requires otherwise, the words and expressions used in this Act but not defined herein shall have the same meaning as assigned to them under the administered legislations.] 1 Ins, omitted, subs. and added by Act XXXVI of 2016, s. 2.",
      "source_provision": "sec2"
    },
    {
      "term": "auditor",
      "definition": "a chartered accountant within the meaning of Chartered Accountants Ordinance, 1961 (X of 1961) being a person qualified to be appointed as auditor of a company under section 253 of the Ordinance;",
      "source_provision": "sec36h"
    },
    {
      "term": "audit firm",
      "definition": "a firm of chartered accountants in practice organized as partnership under the Partnership Act, 1932 (IX of 1932) or a sole proprietary firm being an auditor;",
      "source_provision": "sec36h"
    },
    {
      "term": "employee",
      "definition": "any officer or employee of AOB;",
      "source_provision": "sec36h"
    },
    {
      "term": "fund",
      "definition": "fund established under this Part;",
      "source_provision": "sec36h"
    },
    {
      "term": "Institute",
      "definition": "the Institute of Chartered Accountants of Pakistan established under the Chartered Accountants Ordinance, 1961 (X of 1961);",
      "source_provision": "sec36h"
    },
    {
      "term": "member AOB",
      "definition": "the member of AOB;",
      "source_provision": "sec36h"
    },
    {
      "term": "nominating committee",
      "definition": "committee comprising following ex-officio members, namely:— (i) Secretary to the Government of Pakistan, Finance Division; (ii) the Chairman of the Commission; (iii) the President of the Institute; (iv) the Governor State Bank of Pakistan; and (v) one member to be co-opted by the ex-officio members;",
      "source_provision": "sec36h"
    },
    {
      "term": "public interest company",
      "definition": "such company or body corporate as may be notified by the Commission;",
      "source_provision": "sec36h"
    },
    {
      "term": "registered audit firm",
      "definition": "an audit firm registered with AOB; and",
      "source_provision": "sec36h"
    },
    {
      "term": "specified",
      "definition": "specified through regulations made under section 36Z. 36 I. Establishment of AOB.—(1) There is hereby established an independent audit oversight board to function in the public interest. (2) AOB shall have perpetual succession and common seal and can sue and be sued in its own name. (3) AOB shall perform such functions as assigned to it under this Part and shall have all powers incidental and ancillary thereto.",
      "source_provision": "sec36h"
    }
  ]
}
