{
  "id": "pk-security-of-pakistan-act-1952",
  "type": "statute",
  "title": "Security of Pakistan Act, 1952",
  "title_en": "Security of Pakistan Act, 1952",
  "short_name": "SOPA",
  "status": "in_force",
  "issued_date": "1952-05-04",
  "in_force_date": "1952-05-04",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap%2BYZw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Security of Pakistan Act, 1952 (XXXV of 1952) published by The Pakistan Code (Criminal Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_ (1) This Act may be called the Security of\nPakistan Act, 1952.\n(2) It extends to the whole of Pakistan.\n4\n[(3) It shall come into force at once 5[* * *].\n6\n[2. Definitions.___In this Act, unless there is anything repugnant in the subject or context,___\n7\n[(a)   ‘Board’ means the Review Board referred to in clause (4) of Article 10 of the\nConstitution which is appointed by the Chief Justice of Pakistan and consists\nof a Chairman and two other persons, each of whom is or has been a Judge of\nthe Supreme Court or a High Court;]\n(b)       “Code” means the Code of Criminal Procedure, 1898 (Act V of 1898);\n(c)       “document” includes any painting, drawing, photograph or other visible\nrepresentation and gramophone records, sound tracks and any other article on\nwhich sounds have been recorded with a view to their subsequent reproduction\n; and\n1\nThe Act has been applied to___\n(i) Baluchistan, with effect on and from the 6th May, 1952, see Gazette of P., 1952, Pt. I, page 119, extended to the Leased Areas of Baluchistan, by the\nLeased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950) and to applied in the Federated Areas of Baluchistan, see Gazette of Pakistan, 1953, Pt. I, page\n152, and\nIt has also been extended to___\n(ii) the Baluchistan States Union, by the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G.G.O. 4 of 1953) ; and\n(iii) Khairpur State by the Khairpur (Federal Laws) (Extension) Order, 1953 (G.G.O. 5 of 1953).\nIn this Act references to detention order to an Advisory Board shall be of no effect (with effect from the 7th October, 1958), see the President's Order\n(Post-Proclamation) No. I of 1958, Art. 4 and Sch.\nThe Act has been and shall be deemed to have been brought into force in Gwadur with effect from 8th September, 1958, by the Gwadur (Application of\nCentral Laws) Ordinance, 1960 (Ordinance No. XXXVII of 1960), S. 2, see also Martial Law Regulation No. 72.\n2\nOmitted by the Adaptation (Security Laws) Order, 1956 (P.O. No. VIII of 1956), Art. 2 and Sch. (w.e.f. the 23rd March, 1956).\n3\nOmitted by the Repealing and Amending Ordinance, 1965 (Ordinance No. X of 1965), s. 3 and 2nd Sch.\n4\nSubs. and shall be deemed to have been subs. by Act No. XIII of 1958, s. 2.\n5\nOmitted by Ordinance No. XXIII of 1961, s. 2.\n6\nSubs. by Act No. XIV of 1965, s. 2.\n7\nSubs. by the Preventive Detention Laws (Amendment) Act, 1975 (Act No. XLIV of 1975), s. 2.\n(d)        “press” includes a printing press and all machines, implements and plant and\nparts thereof and all materials used for multiplying documents.]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Restrictions on the movements of suspected persons and their detention",
      "content": "_ (1) The\n1\n[Federal Government] if satisfied with respect to any particular person, that, with a view to\npreventing him from acting in any manner prejudicial to the defence or the external affairs or the\nsecurity of Pakistan, or any part thereof 2[* *   *], 3[* *     *], it is necessary so to do, may\nmake an order___\n(a)        directing such person to remove himself from Pakistan in such manner, before\nsuch time, and by such route, as may be specified in the order;\n(b)        directing that he be detained 4[:]\n1\n[Provided that, within a period of twenty-four months commencing on the day of his first\ndetention in pursuance of an order made under this clause, no person, other than a person who for the\ntime being is an enemy alien or who is employed by, or works for, or acts on instructions received\nfrom, the enemy, or who is acting or attempting to act in a manner prejudicial to the integrity,\nsecurity or defence of Pakistan or any part thereof or who commits or attempts to commit any act\nwhich amounts to an anti-national activity as defined in a Federal law or is a member of any\nassociation which has for its objects, or which indulges in, any such anti-national activity, shall be\ndetained in pursuance of any such order for more than a total period of eight months in the case of a\nperson detained for acting in a manner prejudicial to public order and twelve months in any other\ncase.]\n(c)        directing that, except in so far as may be permitted by the provisions of the\norder, or by such authority or person as may be specified therein, he shall not\nbe in any such area or place as may be specified in the order;\n(d)        requiring him to reside or remain in such place or within such area in Pakistan\nas may be specified in the order, and if he is not already there, to proceed to\nthat place or area within such time as may be specified in the order ;\n(e)        requiring him to notify his movements or to report himself or both to notify his\nmovements and report himself in such manner, at such times, and to such\nauthority or person, as may be specified in the order ;\n(f)        requiring him to conduct himself in such manner, abstain from such acts, or\ntake such order with any property in his possession or under his control, as\nmay be specified in the order ;\n1\nSubs. by the Preventive Detention Laws (Amendment) Act, 1975 (Act No. XLIV of 1975), s. 2.\n2\nOmitted by the Adaption (Security Laws) Order, 1956 (P.O. No. VIII of 1956), Art. 2 and Sch. (w.e.f. the 23rd March, 1956).\n3\nOmitted by the Repealing and Amending Ordinance, 1965 (Ordinance No. X of 1965), s. 3 and 2nd Sch.\n4\nSubs. by the Preventive Detention Laws (Amendment) Act, 1962 (Act No. IV of 1962), s. 2.\n1\n[*             *                  *                *             *                *   *]\n(h)        prohibiting or restricting the 1[* * *] use by him of any such article or\narticles as may be specified in the order :\nProvided that no order shall be made under clause (a) of this sub-section in respect of any\nperson who is or is deemed to be a citizen of Pakistan under the law for the time being in force.\n(2) An order made under sub-section (1) may require the person in respect of whom it is\nmade to enter into a bond, with or without sureties, for the due performance of, or as an alternative to\nthe enforcement of, such restrictions or conditions made in the order as may be specified in the order.\n(3) If any person is in any area or place in contravention of an order made under sub-section\n(1), or fails to leave any area or place in accordance with the requirements of such an order, then,\nwithout prejudice to the provisions of sub-section (5) of this section, he may be removed from such\narea or place by any police officer or by any person authorised by the 2[Federal Government] in this\nbehalf.\n(4) So long as there is in force in respect of any person an order under clause (b) of\nsub-section (1) directing that he be detained, he shall be liable to be detained in such place 2[as the\nBoard may determine] and under such conditions, including conditions as to 2[*] discipline and\npunishment of offences and breaches of discipline, as the 2[Federal Government] may from time to\ntime specify.\n(5) If the 3[Federal] or Provincial Government has reason to believe that a person in respect of\nwhom an order as aforesaid has been made directing that he be detained, has absconded or is\nconcealing himself so that such order cannot be executed, that Government may___\n(a)        make a report in writing to a Magistrate of the First Class having jurisdiction\nin the place where the said person ordinarily resides; and thereupon the\nprovisions of Sections 87, 88 and 89 of the Code (Act V of 1898) shall apply\nin respect of the said person and his property as if the order directing that he\nbe detained were a warrant issued by the Magistrate;\n(b)       by order notified in the official Gazette direct the said person to appear before\nsuch officer, at such place, and within such period, as may be specified in the\norder ; and if the said person fails to comply with such direction he shall,\nunless he proves that it was not possible for him to comply therewith and that\nhe had within the period specified in the order informed the officer of the\nreason which rendered compliance therewith impossible and of his\nwhereabouts, be punishable with imprisonment for a term which may extend\nto three years, or with fine, or with both.\n1\nOmitted by Act No. XIII of 1958, s. 4.\n2\nIns. and omitted by the Preventive Detention Laws (Amendment) Act, 1975 (Act No. XLIV of 1975), s. 2.\n3\nSubs. by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), s. 2 and Table.\n(6) If any person contravenes any order made under this section, he shall be punishable with\nimprisonment for a term which may extend to three years or with fine or with both, and if such\nperson has entered into a bond in pursuance of the provisions of sub-section (2), his bond shall be\nforfeited.\n(7) An order made under this section 1[* * *] 2[shall subject to the provisions of 3[Section\n6A]] remain in force for such period as may be specified in the order 4[and if, before its expiration,\nthe period is extended by the 5[Federal Government] for such extended period] 6* *                *:\n6\n[*               *                     *                     *                    *                   *                 *]\n3\n[*               *                     *                     *                    *                   *                 *]\n1\n[*               *                     *                     *                    *                   *                 *]\n3\n[(9) The revocation, otherwise than on the recommendation of the Board, of an order made\nunder clause (b) of sub-section (1) against any person, or the expiry of any such order, shall not bar\nthe making, against the same person and on the same grounds, of a fresh order under that clause :\nProvided that a person shall not be detained under successive orders on the same grounds for\na period exceeding three months in the aggregate unless the Board has reported before the expiration\nof the said period that there is, in its opinion, sufficient cause for such detention.\nExplanation.___ In computing the aggregate period of three months, there shall be excluded\nany period for which the person concerned has been detained with the authority of the Board under\nSection 6A.]\n6\n[3A. Temporary release of persons detained.___ (1) The 5[Federal Government] may at any\ntime direct that any person detained in pursuance of a detention order may be released for any\nspecified period either without conditions or upon such conditions specified in the direction as that\nperson accepts, and may at any time cancel his release.\n(2) In directing the release of any person under sub-section (1), the 5[Federal Government]\nmay require him to enter into a bond with or without sureties for the due observance of the\nconditions specified in the direction.\n(3) Any person released under sub-section (1) shall surrender himself at the time and place,\nand to the authority, specified in the order directing his release or cancelling his release, as the case\nmay be.\n1\nOmitted and shall be deemed to have been so omitted on the 10th day of October, 1958, by Ordinance No. XXXIX of 1959, s. 2.\n2\nSubs. by the Preventive Detention Laws (Amendment) Act, 1962 (Act No. IV of 1962), s. 2.\n3\nSubs. and omitted by Act No. XIV of 1965, s. 3.\n4\nAdded by Ordinance No. IX of 1965, s. 2.\n5\nSubs. by the Preventive Detention Laws (Amendment) Act, 1975 (Act No. XLIV of 1975), s. 2.\n6\nOmitted and ins. by Act No. XIII of 1958, ss. 4, 5 and 6.\n(4) If any person fails without sufficient cause to surrender himself in the manner specified in\nsub-section (3), he shall be punishable with imprisonment for a term which may extend to two years\nor with fine or with both.\n(5) If any person released under sub-section (1) fails to fulfil any of the conditions imposed\nupon him under the said sub-section or in the bond entered into by him, the bond shall be declared to\nbe forfeited and any person bound thereby shall be liable to pay the penalty thereof."
    },
    {
      "provision_ref": "sec3b",
      "section": "3B",
      "title": "Section 3B. Execution of detention order.―A detention order may be executed at any place in",
      "content": "Pakistan in the manner provided for the execution of warrants of arrest under the Code of Criminal\nProcedure, 1898 (Act V of 1898)."
    },
    {
      "provision_ref": "sec3c",
      "section": "3C",
      "title": "Section 3C. Detention orders not to be invalid or inoperative on certain grounds.―No detention",
      "content": "order shall be invalid or inoperative merely by reason :\n(a)        that the person to be detained thereunder is outside the limits of the territorial\njurisdiction of the Government or officer making the order, or\n(b)        that the place of detention of such persons is outside the said limits.]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers of photographing, etc., persons",
      "content": "_ (1) The 1[Federal Government] or the\nProvincial Government may, by order, direct that any person, in respect of whom an order has been\nmade under sub-section (1) of Section 3, shall____\n(a)        allow himself to be photographed and allow his finger and thumb impression\nto be taken by an officer specified in the order,\n(b)        furnish specimens of his handwriting and signature, and\n(c)        attend at such time and place before such authority or persons as may be\nspecified in the order for all or any of the purposes mentioned in this\nsub-section.\n(2) If any person contravenes any order made under this section, he shall be punishable with\nimprisonment for a term which may extend to six months, or with fine, or with both."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. 2[Omitted]",
      "content": "1\nSubs. by the Preventive Detention Laws (Amendment) Act, 1975 (Act No. XLIV of 1975), s. 2.\n2\nOmitted and shall be deemed to have been so omitted on the 10th day of October, 1958, by Ordinance No. XXXIX of 1959, s. 3.\n1\n[6. Communication of grounds of order.___ 2[(1)] In every case where an order has been\nmade under sub-section (1) of section 3 or under section 10, section 11 3[or section 11A], the\nauthority making the order shall, as soon as may be, but 2[subject to the provisions of sub-section\n(2)], communicate to the person or association affected thereby the grounds on which the order has\nbeen made to enable him or it to make representation in writing against the order, and it shall be the\nduty of such authority to inform such person or association of his or its right of making such repre-\nsentation and to afford him or it the earliest opportunity of doing so:\nProvided that nothing in this section shall require the authority to disclose the facts which it\nconsiders to be against the public interest to disclose.]\n2\n[(2) In the case of an order made under clause (b) of sub-section (1) of section 3, the\nauthority making the order shall, except where the 4[Federal Government] in the interest of the\nsecurity of Pakistan, directs otherwise, inform the person detained under that order of the grounds of\nhis detention at the time he is detained or as soon thereafter as is practicable, but not later than fifteen\ndays from the date of detention.]\n3\n[6A. Reference to Board and its procedure.___ 4[(1) A person shall not be detained under\nan order made under clause (b) of sub-section (1) of section 3 for a period exceeding three months\nunless the Board, to which a reference shall be made by the Federal Government, has reviewed his\ncase and reported, before the expiration of the said period, that there is, in its opinion, sufficient\ncause for such detention, and, if the detention is continued after the said period of three months,\nunless the Board has reviewed his case and reported, before the expiration of each period of three\nmonths, that there is, in its opinion, sufficient cause for such detention.]\n(2) A person affected by an order under clause (b) of sub-section (1) of Section 3 shall be\nentitled to be heard in person by the Board and to consult, in the presence of an officer nominated by\nthe 4[Federal Government], but not to be represented before the Board by, a legal practitioner.\n(3) The Board upon a reference made to it under sub-section (1) shall, after considering the\nmaterial placed before it and calling for such further information as it may require from the 4[Federal\nGovernment], submit a report together with its recommendations to the 4[Federal Government].\n(4) All proceedings of the Board shall be secret.]"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. 6[Omitted]",
      "content": "__\n1\nSubs. by Act No. XIII of 1958, s. 7.\n2\nRenumbered, subs. and added by the Preventive Detention Laws (Amendment) Act, 1962 (Act No. IV of 1962), s. 2.\n3\nSubs. by Act No. XIV of 1965, ss. 4 and 5.\n4\nSubs. by the Preventive Detention Laws (Amendment) Act, 1975 (Act No. XLIV of 1975), s. 2.\n5\nOmitted and shall be deemed to have been so omitted on the 10th day of October, 1958, by Ordinance No. XXXIX of 1959, s. 3.\n6\nOmitted by the Adaptation (Security Laws) Order 1956 (P. 0. No. VIII of 1956), Art. 2 and Sch. (with effect from the 23rd March, 1956).\n1\n[10. Control of subversive associations.___(1) Notwithstanding anything contained in the\nPolitical Parties Act, 1962 (Act III of 1962), or in any other law for the time being in force, where\nthe 2[Federal Government] is satisfied with respect to any association that there is danger that the\nassociation may act in a manner or be used for purposes prejudicial to the defence or external affairs\nor the security of Pakistan or of any part thereof, it may, by written or notified order, direct the\nassociation to suspend its activities for such period not exceeding three months as may be specified\nin the order.\n(2) Where an order under sub-section (1) is in force in respect of an association, any officer\nauthorised by the 2[Federal Government] in this behalf may enter upon and search any premises used\nfor the purposes of the association and take possession of any document belonging to or in the\ncustody of the association which in his opinion may be used for purposes prejudicial to the defence\nor external affairs or the security of Pakistan.\n(3) Where an order has been made in respect of an association under sub-section (1), the\n2\n[Federal Government] may, by written or notified order, direct that no funds or other property of the\nassociation shall be used, transferred or otherwise disposed of, or in any manner dealt with, so long\nas the order under sub-section (1) remains in force.\n(4) Where an order under sub-section (3) has been made in respect of an association, all\nclaims of the employees or creditors of the association, or of any other person, on the association or\non the funds or property thereof, shall remain suspended, and the commencement or continuance of\nall actions and proceedings relating to such claim shall be stayed, for so long as the order remains in\nforce.\n(5) For the purposes of any suit, appeal or application by or against an association in respect\nof which an order under sub-section (3) has been made, the period during which the order remains in\nforce shall, notwithstanding anything contained in the limitation Act, 1908 (IX of 1908), be excluded\nin computing the period of limitation.\n(6) No person shall so long as an order under sub-section (1) in respect of any association\nremains in force___\n(a)       manage or assist in managing the association ;\n(b)       promote or assist in promoting a meeting of any members of the association,\nor attend any such meeting in any capacity ;\n(c)       publish any notice or advertisement relating to any such meeting;\n(d)       invite persons to support the association ; or\n(e)       otherwise in any way assist the operation of the association.\n(7) A copy of an order under this section shall be served on the president, chairman, secretary\nor other officer or person concerned with the management of the affairs of the association by\nwhatever name called, or by leaving it or sending it by post to the association at the last known\naddress of its principal office.\n(8) Whoever contravenes an order made under this section shall be punishable with\nimprisonment for a term which may extend to three years, or with fine, or with both.]\n1\nSubs. by Act No. XIV of 1965, s. 6.\n2\nSubs. by the Preventive Detention Laws (Amendment) Act 1975, (Act No. XLIV of 1975), s. 2."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Control of information",
      "content": "_ (1) Where in the opinion of the 1[Federal Government], any\ndocument made, printed or published contains any news, report or information likely to endanger the\ndefence or external affairs or security of Pakistan or any part thereof 2[* * *] 3[* * *], it may, by\nwritten order___\n(a)        require the editor, printer, publisher or person in possession of such document\nto inform the authority specified in the order of the name and address of any\nperson concerned in the supply and communication of such news, report or\ninformation, as the case may be ;\n(b)        require the delivery to an authority specified in the order of any document\nconnected with the news, report or information referred to in clause (a) ;\n(c)        prohibit the further publication of such news, report or information, and the\nsale and distribution of such document ;\n(d)        declare such document and every copy or translation thereof or extract\ntherefrom to be forfeited to Government.\n(2) Where in pursuance of clause (b) of sub-section (1) any document is required to be\ndelivered to a specified authority, that authority or any police officer may enter upon and search any\npremises whereon or wherein such document or any copy thereof is or is believed to be.\n(3) Where in pursuance of clause (d) of sub-section (1) any document has been declared to be\nforfeited to Government, any police officer may seize any copy thereof wherever found in Pakistan,\nand any Magistrate may by warrant authorise any police officer not below the rank of Sub-Inspector\nto enter upon and search any premises whereon or wherein such document, or any copy thereof is or\nis believed to be.\n4\n[*     *           *          *          *          *          *]\n4\n[11A. Control of certain undertakings and sale of shares, etc.___ (1) Where the 1[Federal\nGovernment] is of the opinion that any undertaking is being used, whether with the aid of funds from\nforeign sources or otherwise, or is likely to be used, for the purpose of making, printing, publishing\nor otherwise disseminating news, reports or information, likely to endanger the defence, the external\naffairs or the security of Pakistan, or any part thereof, or for the purpose of promoting such interests\nof any foreign State as are in conflict with the interests of Pakistan, it may, by order, remove the\nowner or, if there be more than one, all or any of them, and, in the case of a company, all or any of\nthe directors, managing directors, managing agents or any other person, from the control or\nmanagement of such undertaking, and appoint a person to take possession of the whole or any part of\nthe undertaking or its property, movable or immovable, and exercise such powers and perform such\nduties, including, in the case of a company, all or any of the powers or duties of the Board of\nDirectors, as may be set down in the order, and such appointment may at any time be revoked, and a\nfresh appointment made on such conditions and with such limitations as the 1[Federal Government]\nmay determine.\n1\nSubs. by the Preventive Detention Laws (Amendment) Act, 1975, (Act No. XLIV of 1975), s. 2.\n2\nOmitted by the Adaptation (Security Laws) Order, 1956 (P.O. No. VIII of 1956), Art. 2 and Sch. (w.e.f. the 23rd March, 1956).\n3\nOmitted by the Repealing and Amending Ordinance, 1965 (Ordinance No. X of 1965), s. 3 and 2nd Sch.\n4\nOmitted and ins. by Ordinance No. XIV of 1961, ss. 3 and 4 (w.e.f. from the 16th April, 1959).\n(2) Where an order has been made under sub-section (1), the 1[Federal Government], or any\nauthority or person authorized by it in this behalf, shall, as soon as possible, make arrangements to\ntransfer, subject to such conditions as may be deemed fit, and transfer, by way of sale, in any manner\nconsidered expedient, any right, title or interest in the undertaking, or if the undertaking be a\ncompany in the shares thereof, of any director or shareholder to any other person not acting for or on\nbehalf of or in collusion with such director or shareholder.\n(3) Every sale under sub-section (2) shall be subject to confirmation by the 1[Federal\nGovernment], and such confirmation shall be notified in the official Gazette.\n(4) If such undertaking as aforesaid be a company, the 1[Federal Government] may give a\ndirection that the shares held by every or any director or shareholder shall be seized wherever the\nshares may be, for sale under sub-section (2), in such manner that such director or shareholder shall\neffectively cease to hold them.\n(5) Where possession has been taken under sub-section (1), or a direction has been given in\npursuance of sub-section (4), any police officer may seize any property of the undertaking or the\nshares thereof, or any document relating thereto, found any where in Pakistan, and any Magistrate\nmay, by warrant, authorize any police officer not below the rank of Sub-Inspector, to enter upon and\nsearch for any such property, share or document in any premises where the same may be or may\nreasonably be suspected to be.\n(6) The 1[Federal Government] or any authority or person authorized by it in this behalf, may,\nby order, make such arrangements as may be considered expedient to ensure that the continuity of\nthe functioning of the undertaking affected by an order under sub-section (1) is not interrupted\nduring the period between the date of such order and the date on which the person appointed under\nsub-section (1) makes over the control and management of the undertaking under sub-section (5) of\nsection 11B, and any expenditure incurred in connection with such arrangements, including the\nremuneration of any person or persons, shall be met as the expenses of the undertaking.\n(7) If within fourteen days of the promulgation of 2[the security of Pakistan (Amendment)\nOrdinance, 1961], or the publication of a notification under sub-section (3), the persons whose right,\ntitle or interest has been transferred by sale, or the person to whom the sale has been made, makes to\nthe 1[Federal Government] a representation against the sale, the 1[Federal Government] after perusal\nof the record, may, subject to such condition as it may deem fit to impose, set aside the sale and\norder a fresh sale.\nExplanation (I).___ A fresh sale under this sub-section shall be deemed to be a sale under sub-\nsection (2).\nExplanation (II).___ The 1[Federal Government] shall not be bound to hear any of the parties\nor their counsel or agent, or to examine any witness or document, before making an order under this\nsub-section.\n(8) Before a sale is set aside under sub-section (7), the 1[Federal Government] may require\nthe person making the representation to pay an amount sufficient to meet the expenses of the sale,\nand to forfeit to the 1[Federal Government] such other amount, not exceeding twenty-five per cent of\nthe sale price, as may be determined by the 1[Federal Government].\n1\nSubs. by the Preventive Detention Laws (Amendment) Act, 1975 (Act No. XLIV of 1975), s. 2.\n2\nSubs. by the Repealing and Amending Ordinance, 1965 (Ordinance No. X of 1965), s. 3 and 2nd Sch.\n(9) If the purchaser fails to pay the full price of the sale, the property may be resold, and any\ndeficiency which may happen on resale and all expenses attending such resale may be recovered\nfrom him.\n(10) Any amount payable under this section, whether as unpaid price, or as forfeiture or\notherwise, if not paid within the time specified, if any, shall be recoverable as arrears of land\nrevenue.\n(11) The sale shall be complete after all proceedings under this section relating to sale or\nresale, as the case may be, have been concluded and all sums due from the purchaser in whose favour\nthe sale has been concluded have been paid by or recovered from him."
    },
    {
      "provision_ref": "sec11b",
      "section": "11B",
      "title": "Section 11B. Removal of control and possession, etc",
      "content": "_ (1) On the completion of sale the 1[Federal\nGovernment] or the authority or persons, as the case may be, arranging the sale shall deliver\npossession of the property, or in the case of shares, of the certificates relating thereto, to the\npurchaser, supported by a sale certificate.\n(2) If in consequence of the action taken under sub-section (1) of Section 11A, the Board of\nDirectors of a company has ceased to function, the person appointed thereunder shall, immediately\nafter the delivery of possession under sub-section (1), call, notwithstanding anything to the contrary\nin the Companies Act, 1913, or the constitution of the company, by public advertisement, a general\nmeeting of the company to be held under his chairmanship, for the purpose of electing directors.\n(3) A meeting called under sub-section (2) shall, as far as practicable, be held and conducted\nin accordance with the Articles of Association of the company.\n(4) On the conclusion of a meeting held under this section, a record of the proceedings shall\nbe made and certified by the Chairman, and such certificate shall be conclusive proof of the directors\nnamed therein having been validly appointed.\n(5) Immediately after the record of proceedings is certified under sub-section (4), the control\nand management of the company shall be made over to the directors."
    },
    {
      "provision_ref": "sec11c",
      "section": "11C",
      "title": "Section 11C. Payment of sale price, etc",
      "content": "_ (1) Any amount realized as price from a sale, or from a\nfresh, sale as the case may be, under section 11A, shall, after deducting the expenses of the sale, be\npaid, within such time as may be specified by the 1[Federal Government], to the person whose right,\ntitle or interest has been transferred by such sale.\n(2) Where the shares of more than one person have been sold in a single lot, the amount\npayable shall, with the shareholder’s consent, be paid to them against a joint discharge, and in the\nabsence of such consent the amount shall be paid to each shareholder in proportion to the paid\namount of his shares.\n(3) If the person to whom any right, title or interest, is transferred under section 11A, has\ndeposited any moneys before the sale to him is set aside, the amount so deposited or paid shall, after\ndeducting the amount if any, due from such person under any of the provisions thereof, be refunded\nto him, and thereupon all documents executed and endorsements made in his favour shall stand\ncancelled.\n1\nSubs. by the Preventive Detention Laws (Amendment) Act, 1975 (Act No. XLIV of 1975), s. 2.\n(4) Where, in order to effect the transfer of any property, instrument or share, any document\nor endorsement is required to be executed or made by a person whose right, title or interest, is\ntransferred, the 1[Federal Government] or any authority or person authorized by it in this behalf,\nmay, execute such document or make such endorsement, and any document so executed and\nendorsement so made shall be deemed to have been executed and made by the person whose right,\ntitle or interest is so transferred and shall be conclusive proof of such transfer for all purposes.\n(5) In this section, and in Section 11A, the expression “expenses of the sale” shall include\nexpenditure incurred in connection with any dispute arising out of the sale, and such other\nexpenditure as the 1[Federal Government] may determine to be such expenses.\n(6) The provisions of this section and Sections 11A and 11B shall have effect\nnotwithstanding anything to the contrary contained in any law other than this Act, or in any\ninstrument, deed or document.\n(7) For the removal of doubt it is hereby declared that where a person appointed under\nsub-section (1) of Section 11A is required to exercise the powers or perform the duties of the Board\nof Directors of a company, the provisions of the Companies Act, 1913 (VII of 1913), shall, as\nrespects duties not expressly set forth in the order under sub-section (1) of Section 11A, not apply to\nhim.]\n2\n[12. Regulation of publication of certain matters.___ (1) Where the 1[Federal Government]\nis satisfied that in the interest of the defence, the external affairs or the security of Pakistan it is\nnecessary so to do, the 1[Federal Government] or any authority empowered by it In this behalf may,\nby order addressed to a printer, publisher or editor, or printers, publishers or editors generally,\nrequire that all matter relating to a particular subject or class of subjects affecting the defence, the\nexternal affairs or the security of Pakistan shall, before being published in any document or class of\ndocuments, be submitted for scrutiny to any authority specified in the order, who shall, within\nseventy two hours of its submission, either approve of 3[its publication or if it is satisfied that It is\nlikely to prejudicially affect the defence, the external affairs or the security of Pakistan, prohibit it];\nand no matter the publication whereof has been so prohibited shall be published.\n(2) Any person affected by an order under sub-section (1) prohibiting the publication of any\nmatter may, within seven days of the communication of the order, appeal against it 3[* * *] to the\nDistrict Judge of the district in which such person resides :\nProvided that where appeals against the same order have been made by persons who reside\nin different districts all such appeal shall be 3[preferred] to the senior of the District Judges of such\ndistricts.\nExplanation.___ A person shall be deemed to reside in the district in which he ordinarily\nresides or carries on business or personally works for gain.\n(3) The District Judge to whom 3[an appeal] has been made under sub-section (2) shall, after\ngiving the appellant an opportunity of being heard, consider the appeal as speedily as possible and\n3\n[pass such orders thereon as he may deem fit; and the orders shall be final].\n1\nSubs. by the Preventive Detention Laws (Amendment) Act, 1975 (Act No. XLIV of 1975), s. 2.\n2\nSubs. by Act No. XIV of 1965, s. 7.\n3\nSubs. and omitted by Ordinance No. XV of 1985, s. 2.\n(4) If any person contravenes any order made under sub-section (1), then, without prejudice\nto any other proceedings which may be taken against such person, the 1[Federal Government] may\ndeclare to be forfeited to Government every copy of any document published or made in con-\ntravention of such order and any press used in the making of such document]."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Penalties.―If any one contravenes any of the provisions of Section 11 or 12 he shall be",
      "content": "punishable with imprisonment for a term which may extend to three years, or with fine, or with both."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Cognizance of offences",
      "content": "_ (1) No Court shall take cognizance of any offence under this\nAct, except on a report in writing by a public servant as defined in section 21 of the Pakistan Penal\nCode (XLV of 1860)\n(2) Proceedings in respect of an offence under this Act alleged to have been committed by\nany person may be taken before the appropriate Court having jurisdiction in the place where that\nperson is for the time being or where the offence or any part thereof was committed.\n(3) Notwithstanding anything contained in the Code an offence under this Act shall be triable\nby a Magistrate of the first Class."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Procedure for the trial of offences.―Subject to the provisions of the next succeeding",
      "content": "section, all offences punishable under this Act shall be tried in accordance with the procedure\nprescribed for the trial of 2[*] cases by Chapter XX of the Code."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Offences to be cognizable and non",
      "content": "bailable.―Notwithstanding anything contained in\nthe Code, all offences punishable under this Act shall be cognizable and non-bailable; and no person\naccused or convicted of any offence punishable under this Act shall, if in custody, be released on bail\nor on his own bond, unless___\n(1)        the prosecution has had an opportunity of being heard in respect of the\napplication for such release ; and\n(2)        where the prosecution opposes the application, the Court is satisfied that there\nare reasonable grounds for believing that the accused is not guilty of the\noffence."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Bar of jurisdiction of Courts.―Except as provided in this Act, no order made, direction",
      "content": "issued, or proceeding taken under this Act, 3[or purporting to have been so made, issued or taken, as\nthe case may be,] shall be called in question in any Court, and no suit prosecution, or other legal\nproceedings shall lie against any person for anything done or in good faith intended to be done under\nthis Act, or for any loss or damage caused to or in respect of any property whereof possession has\nbeen taken under this Act : Provided that an appeal shall lie against every conviction and sentence\npassed under Section 3(5)(b), 3(6), 4(2) and 13 of this Act, in the same manner and subject to the\nsame limitations as against a conviction and sentence passed by a First Class Magistrate, under the\nCode 4[* * *].\n1\nSubs. by the Preventive Detention Laws (Amendment) Act, 1975, (Ordinance No. XLIV of 1975), s. 2.\n2\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ordinance No. XXVII of 1981), s. 3 and 2nd Sch.\n3\nIns. by Ordinance No. XXIX of 1959, s. 5.\n4\nOmitted by Act No. XIII of 1958, s. 12."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Power to make rules",
      "content": "_(1) The 2[Federal Government] may make rules, not inconsistent\nwith the provisions of this Act (V of 1898), to carry into effect the purposes thereof 2[* * *].\n(2) All rules made under this section shall be laid before the 3[National Assembly] as soon as\nmay be after they are made."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. 4[Omitted]",
      "content": "_______\n156655                                                                                                     Dated: 14-02-2025\n1\nOmitted by the Repealing and Amending Ordinance, 1965 (Ordinance No. X of 1965), s. 3 and 2nd Sch.\n2\nSubs. and omitted by the Preventive Detention Laws (Amendment) Act, 1975 (Act No. XLIV of 1975), s. 2.\n3\nSubs. by Act No. XIII of 1958, s. 14.\n4\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ordinance No. XXVII of 1981), s. 3 and 2nd Sch."
    }
  ],
  "definitions": []
}
