{
  "id": "pk-shaheed-zulfiqar-ali-bhutto-medical-university-islamabad-act-2013",
  "type": "statute",
  "title": "Shaheed Zulfiqar Ali Bhutto Medical University, Islamabad, Act, 2013",
  "title_en": "Shaheed Zulfiqar Ali Bhutto Medical University, Islamabad, Act, 2013",
  "short_name": "SZABM",
  "status": "in_force",
  "issued_date": "2013-03-19",
  "in_force_date": "2013-03-19",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5dp-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Shaheed Zulfiqar Ali Bhutto Medical University, Islamabad, Act, 2013 (XV of 2013) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(l) This Act may be called the Shaheed Zulfiqar Ali Bhutto\nMedical University, Islamabad, Act, 2013.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_ In this Act, unless there is anything repugnant in the subject or context,__\n(a)           “Academic Council” means the Academic Council specified in section 26;\n(b)           “Authority” includes one or more authorities of the University specified in\nsection 20;\n(c)           “Chairman” means head of a teaching department;\n(d)           “Chancellor” means the Chancellor specified in section 9;\n(e)           “Dean” means the Chairman of the Board of Faculty specified in the Schedule;\n(f)           “Director” means the Director of an institute;\n(g)           “Faculty” means a faculty specified in the Schedule;\n1\n[(ga) “Federal Medical and Dental College” or “FMDC” means the Federal Medical\nand Dental College of the Federal Government affiliated to the University;]\n(h)           “Government” means the Federal Government;\n1\n[(i)      “hospital” means a teaching hospital as notified by the Federal Government or\nan authority authorized by it in this behalf;]\n(j)           “prescribed” means prescribed by rules made under this Act;\n(k)           “Pro-Vice Chancellor” means the Pro-Vice-Chancellor appointed under section\n14;\n1\nIns. and subs. by Act, 2018 (III of 2018), s. 2.\n(l)         “registered graduate” means a graduate of the University who either resides\nwithin its jurisdiction or otherwise but his name is entered in the register\nmaintained for the purpose;\n(m)         “regulations” means the regulations made under section 31;\n(n)         “constituent college or institution” means a college, institute, department or\nacademy maintained and administered by the University;\n(o)         “affiliated college” means an educational institution affiliated to the University\nbut not maintained or administered by it;\n(p)         “college” means a constituent college or affiliated college;\n(q)         “rules” means the rules made under section 30;\n(r)         “Schedule” means Schedule to this Act;\n(s)         “Senate” means the Senate specified in section 21;\n(t)         “Syndicate” means the Syndicate specified in section 24;\n(u)         “Teacher” includes a Professor, Associate Professor, Assistant Professor,\nsenior registrar and Demonstrator engaged whole-time by the University,\ncollege, institute or the institution and such other persons as may be declared\nas teachers by the regulations;\n(v)         “Teaching department” means a teaching department maintained and\nadministered by the University;\n1\n[(va) “University” means the Shaheed Zulfiqar Ali Bhutto Medical University\nconstituted under section 3;]\n(w)         “Vice Chancellor” means the Vice-Chancellor appointed under section 12."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Incorporation",
      "content": "(1) The Shaheed Zulfiqar Ali Bhutto Medical University, Islamabad shall\nbe constituted in accordance with the provisions of this Act.\n(2) The University shall consist of the Chancellor, the Vice Chancellor, the Pro-Vice-Chancellor\nand members of the Senate, the Syndicate, and the Academic Council.\n1\nIns. by Act, 2018 (III of 2018), s.2.\n(3) The University shall be an autonomous, body corporate by the name of Shaheed Zulfiqar\nAli Bhutto Medical University and shall have a perpetual succession and a common seal and may sue\nor be sued by the said name.\n(4) The University shall be competent to acquire and hold property both moveable and\nimmovable and lease, sell or otherwise transfer any moveable or immovable property which vests in or\nhave been acquired by it.\n1\n[ (5) The Pakistan Institute of Medical Sciences Islamabad (PIMS) shall be a teaching hospital\nof the University and it shall be headed by an Executive Director appointed by the Prime Minister in the\nmanner as may be prescribed under the Civil Servant Act, 1973 (LXXI of 1973) and the rules made\nthereunder.]\n(6) 1[*                  *          *          *          *      *       *]\n(7) 1[*                  *          *          *          *      *       *]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Functions",
      "content": "_ The University shall perform the following functions, namely:__\n(a)         to provide for instruction in such teaching subjects, disciplines or branches of\nlearning at graduate or post-graduate level as it may deem fit and to make\nprovision for research, advancement and dissemination of knowledge in such\nmanner as it may determine;\n(b)         to prescribe or identify courses of studies to be conducted by it and the faculties;\n(c)         to hold examinations and to award and confer degrees, diplomas, certificates\nand other academic distinctions to and on persons who have been admitted to\nand have passed its examinations;\n(d)         to confer honorary degrees or other distinctions on persons approved therefore;\n(e)         to provide for persons having received education or training in other\ninstitutions, such instructions as it may determine, and to award degrees,\ndiplomas or certificates to such persons;\n(f)         to confer degrees on persons have carried on independent research under certain\nconditions;\n(g)         to inspect constituent or affiliated colleges or institutions;\n(h)         for the purpose of admission to the University, recognize the examination passed\nand the periods of study spent by students at other universities and places of\nlearning as equivalent to such examinations and periods of study in the\nUniversity, and to withdraw such recognition in appropriate cases after giving\nnotice to the concerned student;\n1\nSubs. and Omitted by Act, 2018 (III of 2018), s. 3.\n(i)     to co-ordinate with other universities and public authorities in such manner, and\nfor such purposes as it may determine;\n(j)     to create posts of Professors, Associate Professors, Assistant Professors, Senior\nRegistrars and Demonstrators and other posts for research, publication,\nextension, administration and other related purposes and to appoint persons\nthereto;\n(k)     to confer or award fellowships, scholarships, bursaries, medals and prizes as\nmay be prescribed;\n(l)     to establish teaching departments, schools, colleges, faculties, institutes,\nmuseums and centers of excellence including area study center and other centers\nof learning for the development of teaching and research and to make such\narrangements for their maintenance, management and administration as may be\nprescribed;\n(m)     to arrange, administer and maintain hostels for students of the University;\n(n)     to promote and organize recreational and extra-curricular activities for physical\nand mental growth, health and fitness of the students;\n(o)     to enforce and maintain discipline amongst the students of the University;\n(p)     to demand and receive such fees and other charges as may be prescribed;\n(q)     to make provisions for research and advisory services and, in relation thereto,\nenter into arrangements with other institutions or with public bodies as may be\ndeemed necessary;\n(r)     to make, amend, alter, vary or rescind agreements, contracts and leases;\n(s)     to receive grants, bequests, trusts, gifts, donations, endowments and other\ncontributions made to the University and to make investment thereof, if any,\nwith the permission of the Senate;\n(t)     to engage and provide for the printing and publications of research papers and\nother works for the advancement of medical education; and\n(u)     to do all such other acts and things incidental to the aforesaid, as may be\nnecessary for the University as a custodian of medical education, learning and\nresearch."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Jurisdiction",
      "content": "(1) The University shall exercise the powers conferred on it by or under this\nAct within Islamabad Capital Territory in respect of such medical colleges and institutions in public or\nprivate sector as may apply to the University for exercise of its process:\nProvided that Government may, in consultation with the University, by general or special\norders, modify the extent and scope of aforesaid powers of the University with regard to the territorial\nlimits, colleges and institutions.\n(2) All medical colleges, and health institutions whether in public or private sector excluding\nthe constituent college of a university, located within the Islamabad Capital Territory, whether affiliated\nwith any other university, examination board or medical faculty, notwithstanding anything contained\nin any other law for the time being in force, shall affiliate with the university within such period and on\nsuch condition as may be prescribed.\n(3) The Faculty of Medicine, Quaid-i-Azam University shall be transferred to Shaheed Zulfiqar\nAli Bhutto Medical University, and all students thereafter will be transferred in one year time.\n1\n[(3A) All the teaching posts and teaching faculty of the PIMS existing on commencement of\nto their option under sub-section(3B), stand transferred to the Federal Medical and Dental College.\n(3B) The incumbents of the teaching posts to be transferred under sub-section (3A) may, within\na period of not exceeding sixty days, exercise a one-time irrevocable option either to become\nemployees of the Federal Medical and Dental College or, as the case may be, continue to be employees\nof the PIMS:\nProvided that___\n(a)         on exercise of such option the opted terms and conditions of their service shall\nnot be less favourable than their terms and conditions existing before exercising\nthe option;\n(b)         no person who stands transferred to the Federal Medical and Dental College by\nvirtue of sub-section (3A) shall, notwithstanding anything contained in any law,\nor any other instrument, for the time being in force, be entitled to any\ncompensation because of such transfer; and\n(c)         incumbents of the teaching posts who do not exercise any option within the said\nsixty days shall be deemed to have opted to continue to be employees of the\nPIMS.]\n(4) The University may admit to its privileges, under prescribed conditions and with the consent\nof such university and approval of the Government, the colleges of medical and health sciences, within\nthe territorial limits of another university, whether inside or outside Pakistan.\n(5) An increase in any fee or charge that is in excess of ten per cent per annum on an annualized\nbasis from the last such increase may not be made except in special circumstances, and only with the\napproval of the Chancellor.\n(6) The University shall institute financial aid programmes for students in need on merit basis\nto the extent considered feasible by the Senate subject to the resources available.\n1\nIns. by Act, 2018 (III of 2018), s.4."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. University open to all persons",
      "content": "_The University shall be open to all persons and no person\nshall be denied admission or privileges of the University on the basis of sex, caste, color, creed, class,\nrace, religion or status."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Teaching",
      "content": "(1) All recognized teaching in various subjects, disciplines or courses shall be\nconducted by the University, in the manner specified under the regulations and may include lectures,\ntutorials, discussions, seminars, demonstrations as well as practical work in the laboratories, hospitals,\nworkshops and community and other methods of instruction.\n(2) The courses and the curricula shall be such as may be prescribed."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Principal officers of the University",
      "content": "_The following shall be the principal officers of the\nUniversity, namely:__\n(a)     the Chancellor;\n(b)     the Vice Chancellor;\n(c)     the Pro-Vice Chancellor;\n(d)     the Deans;\n(e)     the Principals of constituent colleges or institutions;\n(f)     the Chairman of Teaching Department;\n(g)     the Registrar;\n(h)     the Controller of Examinations;\n(i)     the Treasurer; and\n(j)     such other persons as may be prescribed."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Chancellor",
      "content": "(1) The President of Islamic Republic of Pakistan shall be the Chancellor of\nthe university and Chairperson of Senate.\n(2) The Chancellor or, in his absence, the Pro-Chancellor or in his absence the nominee of the\nChancellor shall preside at the convocation of the University and the meetings of the Senate.\n(3) Where the Chancellor is satisfied that any order or proceedings of any authority is not in\naccordance with the provisions of this Act, the rules or the regulations made, he may thereof, after\ncalling upon such authority to show cause, by order in writing, modify or set aside such order or\nproceedings, as the case may be.\n(4) Any proposal to confer an honorary degree shall be subject to approval of the Chancellor.\n(5) The Chancellor shall be competent to approve the rules as may be made and submitted to\nhim by the Senate whereupon he may either approve without modifications or refer them back to the\nSenate for re-consideration.\n(6) The Chancellor may terminate any person from the membership of any authority if he is\nsatisfied that such person:___\n(a)    has become of unsound mind; or\n(b)    has been incapacitated to function as a member of such authority; or\n(c)    has been convicted of charges of corruption or moral turpitude."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Revision of powers of the Chancellor",
      "content": "_The Chancellor may, on his own motion or\notherwise, call for and examine the record of any proceedings in which an order has been passed\nby any authority for the purpose of satisfying himself as to the correctness, legality or propriety of\nany finding or order and may pass such orders thereof, as he may deem fit:\nProvided that no order under this section shall be passed unless the person to be affected\nthereby is afforded an opportunity of being heard."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Inspection and inquiry",
      "content": "(1) The Chancellor may cause an inspection or inquiry to be\nmade in respect of any matter connected with the University and shall, from time to time, appoint such\nperson or persons as he may deem fit, for the purposes of conducting inquiry or carrying out inspection\nof___\n(a)    the University, its building, laboratories, libraries, museums, workshops and\nequipment;\n(b)    any institution, college, hospital or hostel maintained by the University;\n(c)    the teaching and other work conducted by the University; and\n(d)    the conduct of examinations held by the University:\nProvided that the Chancellor shall, in every such case, intimate the\nSyndicate of his intention to cause an inspection or inquiry to be made.\n(2) The Chancellor shall forward to the Syndicate the report of such inspection or inquiry and\nshall, after ascertaining the views of the Syndicate thereon, communicate to it the action to be taken.\n(3) The Syndicate shall communicate to the Chancellor such action, if any, as has been taken\nor may be proposed to be taken upon the results of the inspection or inquiry and such communication\nshall be submitted to the Chancellor within such time as may be required or specified by him.\n(4) Where the Syndicate does not, within a reasonable time, take action to the satisfaction of\nthe Chancellor, the Chancellor may, after considering any explanation furnished or representation\nmade by the Syndicate, issue directions to the Vice-Chancellor as he thinks fit and the Vice-Chancellor\nshall other comply such directions or cause the compliance thereof."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Vice Chancellor.___1[(1) The Vice",
      "content": "Chancellor shall be appointed by the Chancellor in\naccordance with the provisions of this Act.]\n(2) The Vice-Chancellor shall have qualification prescribed by Pakistan Medical and Dental\nCouncil at Level I and Level III MS or MD or FCPS or equivalent with fifteen years teaching\nexperience and must have produced ten research papers in Pakistan Medical and Dental Council or\nHigher Education Commission recognized journals.\n(3) The Government shall constitute, for a term of two years, a Search Committee consisting\nof not less than three and not more than five members for making recommendations for appointment\nof the Vice-Chancellor.\n(4) The Search Committee shall follow the HEC’s procedure for selection of the panel for the\npost of the Vice-Chancellor, and will be notified by the Federal Government.\n(5) The Search Committee shall recommend to the Federal Government, a panel of three\npersons who, in its opinion, are suitable for appointment as the Vice-Chancellor.\n(6) The Chancellor shall appoint the Vice-Chancellor for each term of four years but he shall\nserve during the pleasure of the Chancellor.\n(7) The Government shall determine the terms and conditions of service of the Vice-\nChancellor.\n(8) The incumbent Vice-Chancellor shall not be allowed any extension in his tenure but subject\nto eligibility he may again compete for the post of the Vice-Chancellor accordance with the procedure\nprescribed by or under this section.\n(9) If the office of the Vice-Chancellor is vacant or the Vice-Chancellor is absent or is unable\nto perform the functions of the Vice-Chancellor owing to any cause, the Pro-Vice-Chancellor shall\nperform the functions of the Vice-Chancellor but, if at any time, the office of Pro-Vice-Chancellor is\nalso vacant or the Pro-Vice-Chancellor is absent or is unable to perform the functions of the\nVice-Chancellor owing to any cause, the Chancellor shall make such temporary arrangements for the\nperformance of the duties of the Vice-Chancellor as he may deem fit, for not more than a period of\nthree months."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Powers and functions of Vice",
      "content": "Chancellor.__ (1) Subject to sections 22 and 24, the\nVice-Chancellor shall be the chief executive of the University and exercise administrative control over\nall its officers, teachers and employees; and shall ensure the enforcement of the provisions of this Act,\nthe rules and the regulations made thereunder.\n1\nSubs. by Act, 2018 (III of 2018), s. 5.\n(2) The Vice-Chancellor may teach and undertake clinical assignments in the University and its\nattached hospital for academic purposes but shall not undertake any private practice inside or outside\nthe premises of the University.\n(3) The Vice Chancellor may___\n(a)    Place on deputation the services of any officer, teacher or any other employee\nof the University at the disposal of the Federal Government or such other\nuniversity or institution, for such period and on such terms and conditions as\nmay be agreed with the borrowing agency:\nProvided that such terms and conditions shall not be less favorable than\nthose admissible to him immediately before his transfer on deputation; and\n(b)    make appointment to any post in the University, whether as a teacher or\notherwise from persons in the civil government service of Pakistan or from\nofficers, teachers or other employees of any other public sector university or\ninstitution as recommended by the Government:\n(4)    Subject to such conditions as may be prescribed, the Vice-Chancellor may, in an\nemergency, take an action which is not otherwise in the competence of the Vice-Chancellor but is in\nthe competence of any other Authority.\n(5)    The Vice-Chancellor shall, within seven days of taking an action under sub-section (4),\nsubmit a report, of the action taken to the members of the Syndicate; and, the Syndicate shall, within\nforty five days of such an action of the Vice-Chancellor, pass such orders as the Syndicate deems\nappropriate.\n(6)     the Vice-Chancellor shall perform the following functions:___\n(a)    preside at the meetings of the authorities or bodies except the Senate\nnotwithstanding any other nomination by the Chancellor;\n(b)    fill temporary posts for a period not exceeding one year;\n(c)    sanction all expenditure provided for in the approved budget, and to\nre-appropriate funds within the same major head of expenditure;\n(d)    sanction the re-appropriation of an amount not exceeding five hundred thousand\nrupees for an unforeseen but permissible item not provided for in the budget,\nand report it to the Syndicate at the next meeting;\n(e)    appoint experts to set question papers and examiners for all examinations\nof the University after receiving panels of names from the relevant authorities;\n(f)    make such arrangements for the security of examination papers, marks and\nresults as he may consider necessary;\n(g)     direct teachers, officers and other employees of the University to take up such\nassignments in connection with teaching, research, examinations,\nadministration and such other activities in the University as he may, in its\ninterest, consider necessary in consultation with the Dean concerned;\n(h)     delegate, subject to such conditions, if any, as may be prescribed, any of his\npowers under this Act, to any officer of the University;\n(i)     appoint employees up to the scale of pay equivalent to BPS 18:\nProvided that all appointments equivalent to BPS 17 and BPS 18 shall\nbe made on the recommendations of the Selection Board; and\n(j)     suspend, expel or rusticate students of the University on the recommendations\nof the Discipline Committee."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Pro",
      "content": "Vice Chancellor.__(1) The Vice-Chancellor shall nominate the Pro-Vice Chancellor of\nthe University, from amongst a panel of three faculty members of the University, for a term of three\nyears.\n(2) The Pro-Vice-Chancellor shall perform such functions as may be assigned to him under this\nAct, statutes or regulation made thereunder.\n(3) The Syndicate or the Vice-Chancellor may assign any other functions to the\nPro-Vice-Chancellor in addition to his duties as specialist."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Registrar.__(1) The Registrar shall be appointed by the Vice",
      "content": "Chancellor on the\nrecommendations of Syndicate on such terms and conditions as may be prescribed in the statutes.\n(2) the Registrar shall___\n(a)     be the custodian of the common seal and the academic records of the University;\n(b)     maintain a register of registered graduates in the prescribed manner;\n(c)     initiate and process nomination of members to the various authorities in the\nmanner as may be prescribed; and\n(d)     perform such other duties as may be prescribed."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Controller of Examinations",
      "content": "(1) The Controller of Examinations shall be appointed by\nthe Vice-Chancellor on recommendations of syndicate on such terms and conditions as may be\nprescribed in the statutes.\n(2) The Controller of Examinations shall be responsible for the conduct of examinations and\nall matters connected therewith including formation of multiple choice questions (MCQs) bank,\nmaintenance of secrecy of examination, tabulation of results and perform such other duties as may be\nprescribed."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Treasurer.__(1) The Treasurer shall be a whole",
      "content": "time officer and shall be appointed by the\nVice-Chancellor on the recommendations of the Syndicate, on such terms and conditions as may be\nprescribed in the statutes.\n(2) the Treasurer shall be responsible to___\n(a)        manage property, finances and investments of the University;\n(b)        prepare annual and revised budget estimates of the University and present them\nto the Finance and Planning Committee, the Syndicate and the Senate;\n(c)        ensure that the funds of the University are utilized for the purposes for which\nthey are provided; and\n(d)        perform such other duties as may be prescribed."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Auditor",
      "content": "_The Auditor shall be taken from the office of the Auditor General of Pakistan\nbeing in BPS 20 on deputation basis on such terms and conditions as determined by Syndicate."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Other officers and staff members",
      "content": "(1) Subject to the provisions of this Act, the University\nmay employ such officers and employees in its service as may be necessary for the efficient\nperformance of its functions in such manner and on such terms and conditions as may be prescribed.\n1\n[ (2) Until the terms and conditions of service of the employees of the University are prescribed\nunder this Act, all service rules, regulations and instructions as are applicable to civil servants of\nrespective pay scales and status governed by the Civil Servants Act, 1973 (LXXI of 1973) shall apply to\n(3) The employees of the PIMS who on or after commencement of this Act but before\ncommencement of the Shaheed Zulfiqar Ali Bhutto Medical University, Islamabad (Amendment) Act,\n2018___\n(a)        did not exercise any option shall continue to be governed by the Civil Servants\nAct, 1973 (LXXI of 1973) and the rules made thereunder; and\n(b)        had exercised the option to become employees of the University may, within\nsixty days of the commencement of the Shaheed Zulfiqar Ali Bhutto Medical\nUniversity, Islamabad (Amendment) Act, 2018, exercise a one-time irrevocable\noption either to be governed by the Civil Servants Act, 1973 (LXXI of 1973)\nand the rules made thereunder or, as the case may be, to continue to be\nemployees of the University.\n1\nSubs. by Act, 2018 (III of 2018), s. 6.\n(4) Where a person, required to exercise option under clause (b) of sub-section (3), does not\nexercise the option within the said period, he shall be deemed to have exercised the option to be\ngoverned by the Civil Servants Act, 1973(LXXI of 1973) and the rules made thereunder.\n(5) The terms and conditions of service of all persons serving in connection with the affairs of\nany institution, institute or teaching department in any capacity transferred from the University or\ndeemed under sub-section (4) to have exercised the option to be governed by the Civil Servants Act,\n1973 (LXXI of 1973) and the rules made thereunder shall be determined in the prescribed manner\nunder the Civil Servants Act, 1973 (LXXI of 1973) and the rules made thereunder.\n(6) The terms and conditions of the employees determined under sub-section (5) shall not be\nless favourable then those admissible to them immediately before exercising the irrevocable option or\ndeemed under sub-section (4) to have exercised the option.\n(7) Any question arising under sub-sections (3) to (6) of this section and sub-section (1) of\nsection 34 shall be referred to an anomalies committee to be constituted by the Prime Minister for a\nperiod of one year.\n(8) No person who stands transferred to the PIMS by virtue of sub-section (3) or deemed to\nhave exercised the option as provided for in sub-section (4) shall, notwithstanding anything contained\nin any law, or any other instrument, for the time being in force, be entitled to any compensation\nbecause of such transfer.]"
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Authorities",
      "content": "_The following shall be the authorities of the University, namely:___\n(a)    the Senate\n(b)    the Syndicate\n(c)    the Academic Council;\n(d)    the Board of Faculty;\n(e)    the Board of Studies;\n(f)    the Selection Board;\n(g)    the Advanced Studies and Research Board;\n(h)    the Performance Audit and Vigilance Committee;\n(i)    the Finance and Planning Committee;\n(j)    the Discipline Committee; and\n(k)    such other authorities as may be prescribed."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Senate",
      "content": "_ (l) The Senate shall consist of___\n(a)    the Chancellor;\n(b)    two members of the Senate of Pakistan including one from ICT, to be nominated\nby the Chairman Senate of Pakistan;\n(c)    two members of the National Assembly of the Pakistan including one from lCT\nto be nominated by the Speaker of the National Assembly of the Pakistan;\n(d)    the Vice Chancellor;\n(e)    the Pro-Vice Chancellor;\n(f)    the Secretary Capital Administration and Development;\n(g)    one representative of Higher Education Commission;\n(h)    the Principals of constituent college or institutes;\n(i)    the Chairmen of the teaching departments;\n(j)    the Registrar;\n(k)    the Controller of Examinations;\n(l)    the Director or Administrator of University hospitals;\n(m)    the Principal of affiliated college;\n(2) The Chancellor or in his absence the nominee of the Chancellor shall preside or act as the\nchairperson of the Senate.\n(3) The members of the Senate, other than ex-officio members, shall hold office for a period\nof three years.\n(4) The member of the Senate other than the ex-officio member may under his hand tender his\nresignation to the Chancellor.\n(5) The Senate shall meet at least twice each year on dates to be fixed by the Vice-Chancellor\nwith the consent of the Chancellor.\n(6) The quorum for the meeting of the Senate shall be one-third of the total number of its\nmembers, a fraction being counted as one."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Powers and functions of the Senate",
      "content": "_The Senate shall be the highest administrative and\nexecutive body of the University and shall, subject to the provisions of this Act and the rules, have\nthe powers to discharge the following functions, namely:__\n(a)     consider the draft of rules proposed by the Syndicate and deal with them in the\nmanner specified in sub-section (2) of section 30;\n(b)     consider and pass resolutions on the annual report, annual statement of accounts\nand the annual and revised budget estimates submitted by the Syndicate;\n(c)     appoint or nominate members to the Syndicate and other authorities in\naccordance with the provisions of this Act;\n(d)     delegate any of its powers to an authority or officer or a committee or\nsub­committee; and\n(e)     perform such other functions as may be prescribed."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Visitations",
      "content": "_The Senate may, in accordance with the terms and procedures as may be\nprescribed, cause an inspection to be made in respect of any matter connected with the University."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Syndicate.",
      "content": "(1) The Syndicate shall consist of__\n(a)     the Vice-Chancellor (Chairman);\n(b)     two member of the Senate of Pakistan including one from ICT, to be nominated\nby the Chairman Senate of Pakistan;\n(c)     two members of the National Assembly of the Pakistan including one from ICT\nto be nominated by the Speaker of the National Assembly of the Pakistan;\n(d)     the Pro-Vice Chancellor;\n(e)     the representative of administrative ministry not below the rank of additional\nsecretary;\n(f)     one representative of Higher Education Commission;\n(g)     the Chairman of the Hospital Management Committee;\n(h)     the heads of the constituent and affiliated colleges or institutes;\n(i)     two Deans to be nominated by the Senate;\n(j)    two faculty members to be nominated by the Vice­Chancellor;\n(k)    two nominees of the Chancellor;\n(l)    Registrar;\n(m)    the Vice­Chancellor, Quaid­e­Azam University, Islamabad;\n(2) the members of the Syndicate, other than ex-officio members, shall hold office for a period\nof three years.\n(3) the quorum for a meeting of the Syndicate shall be one-third of the total number of its\nmembers, a fraction being counted as one.\n(4) the Registrar shall act as the Secretary of Syndicate."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Powers and functions of Syndicate",
      "content": "_The Syndicate shall be the executive body of the\nUniversity and shall, subject to the provisions of this Act, the rules and the regulations made\nthereunder, have the powers to discharge the following functions, namely:__\n(a)    take effective measures to raise the standards of medical teaching, research and\npublication in the light of national priorities;\n(b)    administer and manage the property and funds of the University;\n(c)    govern and regulate the finances, accounts and investments of the University\nand for that purpose to appoint such agents as it may think fit subject to any\nadvice tendered by the Finance and the Planning Committee in this behalf;\n(d)    prepare the annual report, the annual and revised budget estimates and to advice\nthe Senate thereon, and to re-appropriate funds;\n(e)    execute sale, purchase and transfer of movable or immovable property on behalf\nof the University;\n(f)    make, modify, vary, and rescind contracts on behalf of the University;\n(g)    cause proper books of accounts to be maintained and kept for all sums of money\nreceived and expended in relation to all assets and liabilities of the University;\n(h)    invest any money relating unapplied income in any of the securities described\nin section 20 of the Trusts Act, 1882 (Act II of 1882), in the purchase of\nimmovable property or in such other manner as it may determine, with the like\npower varying such Investments;\n(i)    receive and manage any property transferred, grants, bequests, trusts, gifts,\ndonations, endowments and other contributions made to the University;\n(j)   administer any funds placed at the disposal of the University for specified\npurposes;\n(k)   determine the form and the manner of custody and the regulation of use of\ncommon seal of the University;\n(l)   provide the buildings, libraries, premises, furniture, apparatus, equipment and\nother required items for carrying out the work of the University;\n(m)   establish and maintain hostels or lodgings for the residence of students;\n(n)   create or abolish such administrative, research or other posts as may be\nnecessary;\n(o)   appoint teachers and other officers on the recommendations of the Selection\nBoard for teaching and other posts equivalent to BPS-19 or above and\ndetermine their terms and conditions of appointment including fixation of pay,\netc.;\n(p)   appoint Professor Emeritus on such terms and conditions as may be prescribed;\n(q)   confer honorary degrees in accordance with the conditions as may be\nprescribed;\n(r)   determine the duties of officers, teachers and other employees of the University;\n(s)   suspend, punish and remove from service in the manner as may be prescribed\nsuch officers, teachers and other employees appointed by the Syndicate;\n(t)   submit annual report to the Senate and furnish such information as it may call\nfor;\n(u)   appoint or nominate members to the various authorities in accordance with the\nprovisions of this Act;\n(v)   propose draft rules for submission to the Senate;\n(w)   consider draft regulations under sub-section (1) of section 30, provided that the\nSyndicate may make regulations at its own initiative or in consultation with the\nAcademic Council;\n(x)   recommend a panel of three names of the persons to be appointed as Director\nor Administrator of an attached hospital; and\n(y)   regulate, determine and administer all other matters and perform such other\nfunctions as have been assigned to it by this Act, the rules and the regulations\nmade thereunder."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Academic Council",
      "content": "(1) The Academic Council shall consist of:__\n(a)    the Vice-Chancellor (Chairman);\n(b)    the Pro-Vice Chancellor;\n(c)    the Deans;\n(d)    the Principals of constituents colleges or institutions;\n(e)    the principals or Directors of affiliated colleges or institutes;\n(f)    the University Professors including Professors Emeritus;\n(g)    the Chairmen of all teaching departments;\n(h)    two Associate Professors to be nominated by the Vice­Chancellor; and\n(i)    two Assistant Professors to be nominated by the Vice-Chancellor.\n(2) The members as may be appointed by nomination shall hold office for three years.\n(3) The quorum for a meeting of the Academic Council shall be one-third of the total number\nof its members, a fraction being counted as one."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Functions of the Academic Council",
      "content": "(1) The Academic Council shall be the academic\nbody of the University and shall, subject to the provisions of this Act and the rules made thereunder,\nhave the powers to discharge the following functions, namely:__\n(a)    advise the Syndicate on academic matters;\n(b)    regulate the conduct of teaching, research, publication and examinations;\n(c)    regulate the admission of students to the courses of studies and examinations in\nthe University;\n(d)    regulate the conduct and discipline of the students of the University;\n(e)    propose to the Syndicate scheme for the constitution and organization of\nfaculties, teaching departments and Board of Studies;\n(f)    consider or formulate proposals for the planning and development of teaching\nand research in the University;\n(g)    make regulations on the recommendation of the Board of Faculty and the\nBoards of Studies, prescribing the courses of studies, the syllabi and the out-line\nof tests for all University examinations, provided that if the recommendations\nof the Board of Faculty or a Board of Studies are not received by the prescribed\ndate, the Academic Council may, subject to the approval of the Syndicate,\ncontinue for the next year the courses of studies already prescribed for an\nexamination;\n(h)    recognize the examinations of other universities or examining bodies as\nequivalent to the corresponding examinations of the University;\n(i)    regulate the award or studentships, scholarships, medals and prizes;\n(j)    frame regulations for submission to the Syndicate;\n(k)    appoint or nominate members to the various authorities in accordance with the\nprovisions of this Act; and\n(l)    perform such other functions as may be prescribed."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Constitution, functions and powers of the authorities",
      "content": "_The constitution, functions and\npowers of the authorities for which no specific provision has been made in this Act shall be such as\nmay be prescribed."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Appointment of committees by certain authorities",
      "content": "_The Senate, the Syndicate, the\nAcademic Council, and other authorities may, from time to time, appoint such standing, special or\nadvisory committees as it may deem fit and may nominate such persons on there committees as are\nnot members of the authorities appointing the committees."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Rules",
      "content": "(1) The Senate may, subject to the provisions of this Act, make rules for providing\ncertain terms and conditions to regulate all or any of the following matters, namely:___\n(a)    the scales of pay and, except matters relating to discipline, other terms and\nconditions of service of officers, teachers and other employees of the University;\n(b)    the constitution of pension, insurance, gratuity, provident fund and benevolent\nfund for University employees, provided such rules are not repugnant to the\ngeneral policy of the Federal Government;\n(c)    the maintenance of the register of registered graduates;\n(d)    the establishment of faculties, institutes, colleges and other academic divisions;\n(e)    the power and duties of officers and teachers;\n(f)    conditions under which the University may enter into arrangements with other\ninstitutions nationally or internationally or with public bodies for purposes of\nresearch and advisory services;\n(g)     conditions for appointment of Professors Emeritus and award of honorary\ndegrees; and\n(h)     the general scheme of studies including the duration of courses and the number\nof subjects and papers for examinations.\n(2) Every proposal relating to matters specified in sub-section (1) shall be initiated by the\nSyndicate which shall cause the proposed draft to laid before the Senate which may either pass with\nor without modifications as it may deem fit, or may reject it:\nProvided that the Syndicate shall not propose such draft as may affect the constitution or\npowers of any authority of the University, until such authority has been given an opportunity of\nexpressing an opinion in writing upon the proposals contained therein."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Regulations",
      "content": "_(1) The Syndicate may, subject to the provisions of this Act and the rules,\nmake regulations for regulating all or any of the following matters, namely:\n(a)     courses of study for degrees, diplomas and certificates of the University;\n(b)     manner in which the recognized teaching referred to in sub-section (1) of section\n7 shall be organized and conducted;\n(c)     admission of students to the University;\n(d)     conditions under which students shall be admitted to the courses and the\nexaminations of the University and shall become eligible for the award of\ndegrees, diplomas and certificates;\n(e)     conduct of examinations;\n(f)     fees and other charges to be paid by students for admission to the courses of\nstudy and the examinations of the University;\n(g)     conduct and discipline of students of the University;\n(h)     conditions of residence of the students of the University or the colleges,\nincluding the levying of fees for residence, hostels and lodges;\n(i)     use of hostels and lodges;\n(j)     conditions under which a person should carry an independent research to entitle\nhim to a degree;\n(k)     institution of fellowships, scholarships-medals and prizes;\n(l)        institution of stipends and free and half-free studentships;\n(m)        academic costume;\n(n)        use of the library;\n(o)        formation of teaching departments and Board of Studies; and\n(p)        to lay down all other matters specified by this Act and the rules made\nthereunder;\n(2) Every proposal relating to matters specified in sub-section (1) shall be prepared by the\nAcademic Council and laid before the Syndicate which may approve without modifications or refer\nback to the Academic Council for re-consideration."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Fund",
      "content": "(1) There shall be established a University fund to which shall be Credited\ngrants received from the Federal and Provincial Governments including an initial grant of fifty million\nrupees by the Federal Government. All income from fees, donations, trusts, bequests, endowments,\ncontributions and grant in-aid from any source shall be credited to the University fund.\n(2) The fund shall be kept in such custody, form and manner as may be determined by the\nGovernment."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Recovery of dues",
      "content": "_The University or any person generally or especially authorized by it\nmay apply to the Collector for recovery of any sum accrued to it under any bond and the Collector\nshall thereupon proceed to recover the sum due, as if it were arrears of land revenue."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Property and assets",
      "content": "_1[(1) All movable and immovable assets, funds, rights, privileges,\nliabilities, obligations, interests, etcetera whatsoever, which before commencement of the Shaheed\nZulfiqar Ali Bhutto Medical University, Islamabad (Amendment) Act, 2018 were deemed to be the\nmovable and immovable assets, funds, rights, privileges, liabilities, obligations, etcetera of the\nUniversity, stand transferred to, owned and possessed by the PIMS and be maintained by the Federal\nGovernment or such authority as it may authorize in this behalf:\nProvided that such movable and immovable assets, funds, rights, privileges, liabilities,\nobligations, etcetera in respect of the PIMS shall for the purpose of teaching only be enjoyed by the\nUniversity till acquisition of such movable and immovable assets, funds, rights, privileges, liabilities,\nobligations, etcetera by the University from its own funds and resources.]\n(2) All future assets movable and immovable including land and funds as may be acquired by\nthe University shall become the property of the University.\n1\nSubs. by Act, 2018 (III of 2018), s.7."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Audit and accounts",
      "content": "(1) The accounts of the University shall be maintained in such\nform and manner as maybe laid down by the Federal Government.\n(2) The audit of accounts, stores and stocks of the University shall be conducted by the authority\nor agency as may be determined by the Federal Government.\n(3) The annual statement of the accounts of the University signed by the Treasurer and the\nAuditor shall be submitted to the Federal Government within six months of closing of the financial\nyear.\n(4) The observations of the Auditor or auditing agency, together with such annotations as the\nTreasurer may make, shall be presented to the Syndicate."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Retirement.__An officer, other than the Vice",
      "content": "Chancellor, teacher or other employee of the\nUniversity shall have the right to retire from service on such date, after he has completed twenty-five\nyears of service qualifying for pension or other retirement benefits as the competent authority may, in\nthe public interest, direct or where no direction is given, on the completion of sixtieth year of his age.\nExplanation.__ In this section “competent authority” means the appointing authority or a\nperson duly authorized by the appointing authority in that behalf, not being a person lower in rank to\nthe officer, teacher, or other employee concerned."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Pension etc",
      "content": "(1) The University shall constitute for the benefit of its officers, teachers and\nother employees, in such manner and subject to such conditions as may be prescribed, such pension,\ninsurance, gratuity, provident fund and benevolent fund schemes as it may deem fit, provided these\nare not repugnant to the general policy of the Federal Government.\n(2) Where any provident fund is constituted under this Act, the provisions of the Provident\nFund Act, 1925 (XIX of 1925), shall apply as if it were the Federal Government Provident Fund."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Filling of casual vacancies in authorities",
      "content": "(1) Any causal vacancy among the appointed\nor nominated members of any authority shall be filled within three months and may be made by the\nperson or persons, or the body who appointed or nominated the member whose place has become\nvacant.\n(2) Any member so appointed or nominated under sub-section (1) shall continue to be a\nmember of such authority for the unexpired term for which the person whose place he fills would have\nbeen a member."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Dispute about membership of authorities",
      "content": "_Every question or dispute as to whether any\nperson is entitled to be a member of any authority, or otherwise, shall be referred to a committee\nconstituted by the Senate."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Proceeding of authorities not invalidated by vacancies",
      "content": "_No act, proceeding, resolution\nor decision of any authority shall be invalid by reason of any vacancy therein or invalidity of\nappointment or nomination of any de-facto member of the authority."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Amendment of schedule",
      "content": "_The Federal Government may, by notification in the official\nGazette, amend the schedule."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Removal of difficulties",
      "content": "_If any difficulty arises in giving effect to any provisions of this\nAct, the Chancellor may, on the recommendation of the Vice-Chancellor through syndicate, issue such\norders or directions as may not be inconsistent therewith for removing such difficulty:\nProvided that no order shall be passed under this section after eighteen months of the\ncommencement of this Act.\n[see-section 2 (g)]"
    }
  ],
  "definitions": [
    {
      "term": "Academic Council",
      "definition": "the Academic Council specified in section 26;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "one or more authorities of the University specified in section 20;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "head of a teaching department;",
      "source_provision": "sec2"
    },
    {
      "term": "Chancellor",
      "definition": "the Chancellor specified in section 9;",
      "source_provision": "sec2"
    },
    {
      "term": "Dean",
      "definition": "the Chairman of the Board of Faculty specified in the Schedule;",
      "source_provision": "sec2"
    },
    {
      "term": "Director",
      "definition": "the Director of an institute;",
      "source_provision": "sec2"
    },
    {
      "term": "Faculty",
      "definition": "a faculty specified in the Schedule; 1 [(ga) “Federal Medical and Dental College” or “FMDC” means the Federal Medical and Dental College of the Federal Government affiliated to the University;]",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government; 1 [(i) “hospital” means a teaching hospital as notified by the Federal Government or an authority authorized by it in this behalf;]",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Pro-Vice Chancellor",
      "definition": "the Pro-Vice-Chancellor appointed under section 14; 1 Ins. and subs. by Act, 2018 (III of 2018), s. 2.",
      "source_provision": "sec2"
    },
    {
      "term": "registered graduate",
      "definition": "a graduate of the University who either resides within its jurisdiction or otherwise but his name is entered in the register maintained for the purpose;",
      "source_provision": "sec2"
    },
    {
      "term": "regulations",
      "definition": "the regulations made under section 31;",
      "source_provision": "sec2"
    },
    {
      "term": "constituent college or institution",
      "definition": "a college, institute, department or academy maintained and administered by the University;",
      "source_provision": "sec2"
    },
    {
      "term": "affiliated college",
      "definition": "an educational institution affiliated to the University but not maintained or administered by it;",
      "source_provision": "sec2"
    },
    {
      "term": "college",
      "definition": "a constituent college or affiliated college;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "the rules made under section 30;",
      "source_provision": "sec2"
    },
    {
      "term": "Schedule",
      "definition": "Schedule to this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Senate",
      "definition": "the Senate specified in section 21;",
      "source_provision": "sec2"
    },
    {
      "term": "Syndicate",
      "definition": "the Syndicate specified in section 24;",
      "source_provision": "sec2"
    },
    {
      "term": "Teacher",
      "definition": "a Professor, Associate Professor, Assistant Professor, senior registrar and Demonstrator engaged whole-time by the University, college, institute or the institution and such other persons as may be declared as teachers by the regulations;",
      "source_provision": "sec2"
    },
    {
      "term": "Teaching department",
      "definition": "a teaching department maintained and administered by the University; 1 [(va) “University” means the Shaheed Zulfiqar Ali Bhutto Medical University constituted under section 3;]",
      "source_provision": "sec2"
    },
    {
      "term": "Vice Chancellor",
      "definition": "the Vice-Chancellor appointed under section 12.",
      "source_provision": "sec2"
    }
  ]
}
