{
  "id": "pk-sindh-incumbered-estates-act-1896",
  "type": "statute",
  "title": "Sindh Incumbered Estates Act, 1896",
  "title_en": "Sindh Incumbered Estates Act, 1896",
  "short_name": "SIEA",
  "status": "in_force",
  "issued_date": "1896-10-15",
  "in_force_date": "1896-10-15",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cZk%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Sindh Incumbered Estates Act, 1896 (XX of 1896) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Title and commencement",
      "content": "(1) This Act may be called the Sindh incumbered Estate Act,\n1896; and\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act",
      "content": "(1) “Jagir land” includes also a share held hereditarily of                                                the     revenues of           a\nGovernment village, but does not include siri or mamul or garden grants:\n(2) “jagirdar” means a person who, or whoes ancestor, was found in possession of jagir land\nin Sindh on the seventeenth day of February, 1843, and to whom the said land, or a portion of the\nsame, or other land in lieu thereof, has been continued by the 2*Government, 3[as a jagir]:\n(3) “zamindar” means a person holding lands in Sindh on the aggregate of which he or his\nancestor has been assessed by the Government, on account of land- revenue for any one of the five\nrevenue-years next before the 4[making of an application under section 3 by or in respect of or on\nbehalf of such person] a sum not less than three hundred rupees; and a person holding lands in\nSindh which, having been comprised in the jagir lands of a jagirdar and having ceased to be\njagir lands, are as essed by the Government on account of land revenue at a sum not less than\nthree hundred rupees per year, and, where a joint family or any other body of co - owners hold\nlands of either of those descriptions, each member of that family or body who would be entitled to\ndemand a partition of the lands: and\n(4) “Commissioner” means the Commissioner in Sindh.\n_\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1896, Pt. V.p. 252; and for Proceedings in Council, see ibid., Pt. VI , pp. 236 and"
    },
    {
      "provision_ref": "sec2a",
      "section": "2A",
      "title": "Section 2A. This Act has been and shall be deemed to have been extended to the whole of Pakistan by the Central Laws (Statute Reform) Ordinance, 1960 (21 of",
      "content": "1960), s.3 and 2nd Sch. (with effect from the 14th October, 1955).\nThis Act has been amended in its application to the Province of Sind by the Sind Act, No. 17 of 1975, s. 3 and 2nd Sch.\n2\nThe word “British” omitted by A.O., 1961, Art. 2 and Sch. (with effect from the 23rd March, 1956).\n3\nSubs. by the Sindh Incumbered Estates (Amdt.) Act, 1906 (2 of 1906), s.2(a), for “and to whom, or to whose ancestor, a sanad has been, or\nhereafter may be, granted confirming such continuance”.\n4\nSubs. by s. 2(b), ibid., for “commencement of this Act”."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Application for the benefit of this Act",
      "content": "(1) At any time after the commencement of this\nAct, any jagirdar or zamindar or any person who would be sole heir or one of the heirs to\nsuch jagirdar or zamindar if he then died intestate, may apply in writing to the Commissioner,\nstating that such jagirdar or zamindar is subject to debts or liabilities, other than debts due, or\nliabilities incurred, l[to the Government], or that his immoveable property is charged with\ndebts or liabilities other, than as aforesaid, and requesting that the provisions of this Act be applied\nto his case.\n(2) When any jagirdar, zamindar or other person entitled to make an application under this\nsection is a minor, or of unsound mind, or an idiot, such application may be made on his behalf by\nthe guardian or other legal curator of his person, or by the legally constituted administrator\nor manager of his estate."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Order to inquire",
      "content": "(1) When any such application is made by or on behalf of a jagirdar or\nthe person who would be his sole heir if he then died, the Commissioner shall direct an inquiry to be\nmade by such officer, as he thinks fit, into the nature and amount of such debts and liabilities, and\nthe sufficiency of the debtor's property, whether moveable or immoveable, to discharge the same.\n(2) When such an application is made in any other case, it shall be in the discretion of the\nCommissioner, subject to any general rules which may from time to time be made by the 2[Pro -\nvincial Government] in this behalf, either to reject such application, or to direct an inquiry to be\nmade as aforesaid.\n3\n[5. Interim order of protection.—(1)] When the Commissioner has directed an inquiry\nunder section 4, he may, if he thinks fit, further direct that, until he dismisses the application or\nappoints an officer under section 7, sub-section (2), clause (c),-\n(a)       all proceedings then pending in any Civil or Revenue Court or Office in\nl\n[Pakistan], in respect of any of the debts and liabilities to which the debtor is\nsubject, or which are charged on the whole or any part of his immoveable\nproperty, shall be stayed, and the operation of all processes, executions and\nattachments then in force for, or in respect of, such debts and liabilities shall\nbe suspended; and\n1\nThe original words “to Govt.” have successively been amended by A.O., 1937 and A.O., 1961, Art. 2 (with effect from the 23rd March, 1956) to read\nas above.\n2\nSubs. by A. O., 1937, for “Governor of Bombay in Council”.\n3\n(b)      no fresh proceedings, processes, execution or attachments shall be instituted in,\nor issued by, any Civil Court or Revenue Court or Office in l[Pakistan]\nin respect of such debts and liabilities.\n2\n[(2) Every direction given under sub-section (1) shall be deemed to afford protection\nto sureties of the debtor as well as to the debtor himself, unless in any case a\nsurety has, by his bond, expressly accepted liability thereunder in the event of\nan 'order being made in respect of the debtor's property under section 7, sub-\nsection (2), clause (c).]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Verified statement to be submitted",
      "content": "(1) When an inquiry has been directed under\nsection 4, the applicant shall, within a period to be fixed by the Commissioner, submit to the officer\nappointed to make such inquiry a statement duly verified by the said applicant or by some other\ncompetent person in the manner required by law for the verification of plaints and containing, so far\nas may be practicable, such details as to the debts and liabilities, and as to the sufficiency of the\ndebtor's property, whether moveable or immovable, to meet the same, as the Commissioner, or the\nsaid officer subject to his control, may require.\n(2) If any such statement contains any averment which the person making the verification\nknows or believes to be false, or does not know or believe to be true, such person shall be deemed to\nhave intentionally given false evidence within the meaning of the Pakistan Penal Code (XLV of\n1860)."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Report of inquiry and proceedings thereon",
      "content": "(1) The officer so appointed, after\nmaking inquiry, shall submit a report of the proceedings to the Commissioner.\n(2) On receipt of such report, the Commissioner may—\n(a)        direct a further inquiry; or\n(b)        dismiss the application; or,\n(c)        by order published in the 3[official Gazette], appoint an officer\n(hereinafter called the manager) to manage the moveable property of the\ndebtor, and to arrange for the liquidation of his debts in manner hereinafter\nprovided."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Order of management",
      "content": "(1) An order made under section 7, sub-section (2), clause (c)\n(hereinafter called “the order of management”), shall extend to all immoveable property, including\nany interest in joint immoveable property, of or to which the debtor is on the date of its publication\npossessed or entitled in his own right, or which he is entitled to redeem, or which may be\nacquired by or devolve on him during the continuance of the management, and to all debts and\nliabilities to which he is subject, or which are charged on the whole or any part of his immoveable\nproperty on the said date, and to the amount of any loan which may be received by the manager in\nthe manner hereinafter provided.\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “the\nProvinces and the Capital of the Federation”, which had been subs. by A. 0.,1949, Arts. 3 (2) and 4, for “British India”.\n2\nSub-section (2) ins. by the Sindh Incumbered Estates (Amdt.) 1906 (2 of 1906), s.3.\n3\nSubs. by A.O., 1937, for “Sindh Official Gazette”.\n(2) The management shall be deemed to commence from the date on which the order is\npublished."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Effect of order of management. On the publication of the order of management the",
      "content": "following consequences shall ensue:—\n(1) all proceedings then pending in any Civil Court or Revenue Court or Office in\n1\n[Pakistan] in respect to the debts and liabilities mentioned in section 8 shall be stayed; and the\noperation of all processes, executions and attachments then in force for, or in respect of, such\ndebts and liabilities shall be suspended;\n(2) so long as the management continues, no fresh proceedings, processes, executions or\nattachments shall be instituted in or issued by any Civil Court or Revenue Court or Office in\n1\n[Pakistan] in respect of such debts and liabilities;\n2\n[(2a) clauses (1) and (2) shall be deemed to afford protection to sureties of the debtor as\nwell as to the debtor himself, unless in any case a surety has, by his bond, expressly accepted\nliability thereunder in the event of an order being made in respect of the debtor’s property under\nsection 7, sub-section (2), clause (c);]\n(3) so long as the management continues, the debtor shall be incompetent-\n(a)         to enter into any contract involving him in pecuniary liability, or\n(b)         to mortgage, charge, lease or alienate the property under management or any\npart thereof, or\n(c)          to grant valid receipts for the rents and profits arising or accruing therefrom:\nProvided that nothing contained in this clause shall be deemed to preclude the manager from\nletting, and the debtor from taking, the whole or any part of such property on such terms consistent\nwith this Act as may be agreed upon between the parties;\n(4) so long as the management continues, no person other than the manager shall be\ncompetent to mortgage, charge, lease or alienate such property or any part thereof."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Powers of manager. The manager shall, during the management of the property, have",
      "content": "all powers which the owner thereof might, as such, have legally exercised, and shall receive and\nrecover all rents, 3[profits and other sums] due in respect of the property under management, and for\nthe purpose of recovering such rents, 3[profits and other sums] shall have, in addition to any powers\npossessed by a jagirdar or zamindar, as the case may be, all the powers possessed by a Collector\nunder the law for the time being in force for the recovery of land-revenue due to Government,\n4\n[including the power conferred by section 176 of the Bombay Land -revenue Code, 1879\n(Bom.V of 1879)]:\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2nd Sch. (with effect from the 14th October, 1955),. for “ the\nProvides and the Capital of the Federation” which had been subs. by A.O., 1949, Arts. 3(2) and 4, for “British India”.\n2\nClause (2a) ins. by the Sindh Incumbered Estates (Amdt.) Act, 1906 (2 of 1906), s.4.\n3\nSubs. by the Sindh Incumbered Estates (Amdt.) Act, 1906 (2 of 1906), s. 5 (a), for “and profits”.\n4\nIns. ibid., s.5 (b)\nProvided that he shall not, before the liquidation-scheme hereinafter mentioned has been\nsanctioned, demise the property under management, or any part thereof, for any term exceeding two\nyears, to take effect in possession."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Payments to be made by manager and order thereof",
      "content": "(1) From the sums received or\nrecovered under section 10, the manager shall pay-\nfirst, the costs of the management, including the costs of necessary repairs;\nsecondly, the Government revenue and all debts and liabilities for the time being due or\nincurred 1[to the Government] in respect of the property under management;\nthirdly, the rent (if any) due to the jagirdar or other superior holder in respect of the said\nproperty;\nfourthly, such periodical allowances as the Commissioner may, from time to time, fix for the\nmaintenance of the debtor and his family ;\nfifthly, the cost of such improvements of the said property as he thinks necessary, and are\napproved by the Commissioner.\n(2) The residue shall be retained by the manager for the liquidation, in manner hereinafter\nprovided, of the debts and liabilities mentioned in section 8 other than those so due or incurred l[to\nthe Government], and also for the repayment, either before or after the liquidation of such debts and\nliabilities, of any loan received by the manager under this Act."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Notice to claimants against debtors. On the publication of the order of management,",
      "content": "the manager shall publish in the 2[official Gazette] a notice in English and Sindhi, calling upon all\npersons having claims against the debtor, or the property under management, to notify the same in\nwriting to such manager within six months from the date of the publication, and shall also cause\ncopies of such notice to be exhibited at the mukhtiarkar’s kachahris in the district in which the said\nproperty lies, and at such other places as he thinks fit."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Claimants to present full particulars and documents",
      "content": "(1) Every such claimant shall,\nalong with his claim, present full particulars thereof.\n(2) Every document on which the claimant founds his claim, or on which he relies in support\nthereof, shall be delivered to the manager along with the claim.\n(3) If the document is an entry in any book, the claimant shall produce the book to the\nmanager, together with a copy of the entry on which he relies. The manager shall mark the book for\nthe purpose of identification and, after examining and comparing the copy with the original, shall\nreturn the book to the claimant.\n(4) If any document in the possession or under the control of the claimant is not delivered or\nproduced by him to the manager along with the claim, the manager may refuse to receive such\ndocument in evidence on the claimant's behalf at the investigation of the case.\n1\nThe original words “to Government” have successively been amended by A. 0., 1937, and A. 0., 1961, Art. 2 (with effect from the 23rd March,\n1956) to read as above.\n2\nSubs. by A.O., 1937, for “Sindh official Gazette”."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Claim not duly notified to be barred. Every such claim (other than claims 1[of the",
      "content": "Government] not notified to the manager within the time and in the manner required by such\nnotice shall, except as provided in section 19, clause (d), be deemed for all purposes and on all\noccasions, whether during the continuance of the management or afterwards, to have been duly\ndischarged:\nProvided that, when proof is made to the manager that the claimant was unable to comply\nwith the provisions of section 12, the manager may receive such claim within the further period of\nsix months from the expiration of the original period of six months."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Determination of debts and liabilities. The manager shall inquire into the history",
      "content": "and merits of every claim received under sections 12 and 14, and shall, in accordance with the rules\nto be made under this Act, determine the amount of the debts and liabilities (if any) justly due to the\nseveral claimants."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Power to rank debts and to fix interest. If such amount cannot be paid at once,",
      "content": "the manager shall then proceed to rank such debts and liabilities according to the order in which they\nshall be paid, and to fix the interest (if any) to be paid thereon, respectively, from the date of the final\ndecision thereon to the date of the payment and discharge thereof."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Liquidation scheme",
      "content": "(1) When the total amount of the debts and liabilities\n(including those due and incurred 1[to the Government] has been finally determined, the manager\nshall prepare and submit to the Commissioner a schedule of such debts and liabilities, and a scheme\n(hereinafter called the liquidation-scheme) showing the mode in which it is proposed to pay and\ndischarge the same, whether from the income of the property under management, or with the aid of\nfunds raised under the powers hereinafter conferred, or partly in one of such ways and partly in the\nother.\n(2) Every liquidation-scheme shall further provide for the continuance of the\npayments to be made by the manager under section 11, and for the rep ayment of the money (if\nany) which the manager proposes to borrow under this Act; and may provide for the\nimprovement of the property under management either from the said income or with the aid of the\nfunds raised as aforesaid, or partly in one of such ways and partly in the other."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Proceedings of Commissioner on submission of liquidation scheme. The",
      "content": "Commissioner may—\n(a)      as often as he thinks fit send back such scheme to the manager for revision, and\ndirect him to make such further inquiry as may be requisite for the proper\npreparation of the scheme, or\n(b)      sanction any liquidation-scheme or any revised liquidation-scheme submitted to\nhim, either as it stands, or subject to such modifications as he may\ndeem expedient.\n1\nThe original words “to Government” have successively been amended by A.O., 1937, and A.O., 1961, Art. 2 (with effect from the 23rd March,\n1956), to read as above."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Power to relinquish management",
      "content": "(1) At any time before he has sanctioned a\nliquidation scheme under section 18, the Commissioner may, by an order published in the l[official\nGazette], direct that on a date fixed by such order the management shall be relinquished.\n(2) On the date so fixed—\n(a)        the management shall terminate;\n(b)        the owner of the property under management shall be restored to the\npossession thereof, subject to any leases granted under section 10 ;\n(c)        any residue of the rents and profits of the said property retained under section\n11, sub-section (2), shall be paid to him; and\n(d)        the proceedings, processes, executions and attachments stayed and suspended\nunder section 9, and the debts and liabilities barred by section 14, shall\nrevive.\n(3)        In calculating the periods of limitation applicable to suits to recover and\nenforce debts and liabilities revived under this section, the time during which\nthe management has continued shall be excluded.\nSCHEME."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Effects of sanctioning scheme. When the Commissioner sanctions the liquidation",
      "content": "scheme, he shall notify the fact of such sanction at such places and in such manner as the\n2\n[Provincial Government] may from time to time by rule direct; and thereupon-\n(1) all proceedings, processes, executions and attachments stayed or suspended under\nsection 9 shall be for ever barred, and\n(2) every debt or liability due or owing to any person which was provable before the\nmanager shall be extinguished; and such person shall be entitled to receive under the\nliquidation-scheme the amount (if any) finally awarded to him under Chapter IV in respect of such\ndebt or liability."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Power to remove mortgagee in possession",
      "content": "(1) If the property under management or\nany part thereof is in the possession of a mortgagee or conditional vendee, the manager, at any time\nafter the liquidation-scheme has been sanctioned as aforesaid, may, by an order in writing, require\nsuch incumbrancer to deliver up possession of the same to him at the end of the then current revenue-\nyear.\n(2) if such incumbrancer refuses or neglects to obey such order, the manager may, without resorting\nto a Civil Court, enter upon the property and summarily evict the refrom the said incumbrancer\nand any other person obstructing or resisting on his behalf.\n1\nSubs. by A. 0., 1937, for “Sindh official Gazette”\n2\nSubs. ibid., for “L. G.”.\n(3) Nothing in this section shall be held to affect the right of any incumbrancer to receive,\nunder the liquidation-scheme, the amount (if any) awarded to him under Chapter IV.\n1[22. Power to inquire into consideration given for leases.—(1)] If the property under\nmanagement or any part thereof is in the possession of any person claiming to hold under a lease, 2*\n* * the manager, with the sanction of the Commissioner, may inquire into the sufficiency of the\nconsideration for which the lease was granted, and if such consideration appears to him insufficient,\nmay by written order, at any time after the liquidation-scheme bas been sanctioned as aforesaid,\neither set aside the lease, or require the person so in possession to pay such consideration for the said\nlease as the manager thinks fit ; and, in default of such payment, the lease shall be cancelled.\n3\n[(2) Whenever the manager sets aside or cancels a lease under sub-section (1), he shall, by\nwritten order, award to the lessee such compensation, if any, as may appear to the manager to be\nequitable in the circumstances; and, subject to the provisions of Chapter VI, no compensation in\nexcess of the amount so awarded shall be recoverable by the lessee in a Civil Court or otherwise.\n(3) Any compensation awarded by the manager under sub-section (2) shall be deemed to be\na debt mentioned in section 8, and shall rank in priority to all other debts and liabilities other than\ndebts or liabilities due or incurred 4[to the Government].\n(4) If any lessee whose lease has been so set aside or cancelled refuses or neglects to give up\npossession when required to do so by the manager, the manager may, without resorting to a Civil\nCourt, enter upon the property and summarily evict therefrom the said lessee and any other person\nobstructing or resisting on his behalf.]"
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Power to lease. Subject to the rules made under section 33, the manager, after the",
      "content": "liquidation-scheme has been sanctioned as aforesaid, shall have power to demise all or any part of\nthe property under management for any term of years not exceeding twenty years absolute, to take\neffect in possession, in consideration of the payment to him of any fine, or without fine, and\nreserving such rents, and under such conditions as may be agreed upon.\n5"
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Power to raise money by mortgage or sale. At any time after the liquidation",
      "content": "scheme\nhas been sanctioned as aforesaid, the manager, with the previous assent of the Commissioner, shall\nhave power to raise any money which may be required for carrying out such scheme—\n(a)        by demising by way of mortgage the whole or any part of the property under\nmanagement for a term not exceeding twenty years from the publication of\nthe order of management; or\n(b)        by selling, by public auction or by private contract, and upon such terms as\nthe manager thinks fit, such portion of the said property as may appear\nexpedient; or\n1\n2\nThe words “dated within the three years immediately preceding the commencement of the management” were rep. ibid., s. 6 (b).\n3\nSub-sections (2), (3) and (4) ins. ibid., s. 6(c).\n4\nSee page No. 8, Foot note No. 1\n5\nThis section has been amended in its application to the Province of West Pakistan (except the Capital of the Federation) by West Pakistan Act 16 of\n1957, s. 3 (3) and 3rd Sch. (with effect from the 14th October, 1955).\n(c)        by borrowing money at such rate of interest as appears reasonable to\nthe 1[Provincial Government]."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Separation of part of jagir lands subject to lapse. When jagir land under management",
      "content": "is held on this condition, that on the happening of a certain event a share of the land shall lapse, but\nthat it shall be in the discretion of the person then entitled as jagirdar to divide off and relinquish in\nrespect of the lapse such part of the land, being a fair equivalent of that share, as he thinks fit, the\nmanager may, if he deems it convenient for the better exercise of the powers conferred by sections\n23 and 24, at any time, after such consultation with persons interested as he thinks necessary, allot\nby written order, for relinquishment on the happening of the event, such part of the land as he\nthinks fit ; and thereupon that part and no other shall, on the happening of the event, be\nrelinquished."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Manager’s receipt to be a discharge. The manager's receipt for any moneys, rents or",
      "content": "profits raised or received by him under this Act shall discharge the person paying the same\ntherefrom and from being concerned to see to the application thereof."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Termination of management",
      "content": "(1) When the debts and liabilities mentioned in the\nliquidation-scheme and the amount of any loan received under section 24, clause (c), together with\nthe interest (if any) due there on, have been paid and discharged, the manager shall publish in the\n2\n[official Gazette] a notice fixing a date for the termination of the management.\n(2) On the date so fixed the management shall terminate, and the owner shall be restored to\nthe possession and enjoyment of the property under management, or of such part thereof as has not\nbeen sold by the manager under the power conferred by section 24, but subject to the leases and\nmortgages (if any) granted and made by the manager under the powers conferred by sections 10, 23\nand 24."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Death of debtor during management. If the debtor dies after the publication of the",
      "content": "order of management and before the management has been terminated in either of the modes\nhereinbefore provided,—\n(1) the management shall continue and proceed in all respects as if such debtor were still\nliving ;\n(2) any person succeeding to the whole or any portion of the property under\nmanagement shall, while such management continues, be subject in respect of such property to the\ndisabilities imposed by section 9, clause (3), sub-clauses (b) and (c) ; and\n(3) no Civil Court or Revenue Court or Office in 3[Pakistan] shall, during the\ncontinuance of the management, issue any attachment or other process against any portion of the\nproperty under management for, or in respect of, any debt or liability incurred by any such person\nwhether before or after his said succession.\n1\nSubs. by A. O., 1931, for “L. G.”.\n2\nSubs. ibid., for “Sindh official Gazette”.\n3\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for” the\nProvinces and the Capital of the Federation” which had been subs. by A. O., 1949, Arts. 3 (2) and 4, for “British India”."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Mortgages, etc., made by restored jagirdar valid only for this life. When a jagirdar",
      "content": "or zamindar has been restored under section 27, sub-section (2), to the possession of any property,\nno mortgage, charge, lease or alienation of such property, or of any part thereof, made or granted by\nsuch jagirdar or zamindar shall be valid as to any time beyond his natural life 1[unless made or\ngranted with the previous sanction of the Commissioner], 2[or in the case of a loan granted under\nof 1884), with the previous sanction of the officer granting such loan]."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Power to revise liquidation scheme. Notwithstanding anything contained in this Act,",
      "content": "the Commissioner may, at any time after he has, whether before or after the commencement of this\nAct, sanctioned the liquidation scheme, revise and modify the same, but not so as to affect the right\nof any person to receive in full before the termination of the management the amount finally\nawarded to him under Chapter IV."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Appeal",
      "content": "(1) An appeal against any decision or order under sections 14, 15, 16 and 22,\nand imposing a fine or imprisonment in exercise of the powers conferred by section 37, shall lie to\nthe Commissioner, if preferred within six weeks from the date of such decision or order.\n(2) There shall be no appeal against the decision of the Commissioner on such appeal.\n3\n[32. Power to call for proceedings and pass order thereon. The Provincial Government\nmay, of its own motion or on the application of any person concerned, call for the proceedings in\nany case under this Act, and pass such order thereon consistent with the provisions of this Act as it\nthinks fit.]"
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Power to make rules",
      "content": "(1) The Commissioner, with the previous sanction of the\n4\n[Provincial Government], may, from time to time, make rules consistent with this Act-\n(a) to regulate the security to be required from subordinate officers under this Act;\n(b)     to regulate the procedure in all cases under this Act;\n(c)      for the guidance of officers inquiring into and determining on claims under\nChapter IV ; and in particular as to the allowance of interest (if any) on each\nof the principal debts and liabilities so determined, from the date on which it\nwas incurred down to the date of the determination, and on the aggregate\namount of such debts and liabilities, from the date of the determination down\nto the date of payment, and as to the order of paying debts and liabilities\nand repaying any loan received hereunder;\n(d)     for investing any moneys received or raised by the manager under this Act in\nany Government securities of 5[Pakistan], and for the sale of such\nsecurities; and\n(e)     generally to carry out the provisions of this Act.\n1\nIns. by the Bombay Repealing and Amending Act, 1919 (Bom. 2 of 1919), s. 2 and Sch..1.\n2\nIns. by the Sindh Incumbered Estates (Amdt.) Act, 1929 (Bom. 11 of 1929), s. 2.\n3\nSubs. by the Sind Incumbered Estates (Amdt.) Act, 1951 (Sind Act l7 of 1951), s. 2, for the original s. 32.\nThis section has been amended in its application to the Province of West Pakistan (except the Capital of the Federation), by the West Pakistan\nAct 16 of 1957, s. 3 (3) and 3rd Sch. (with effect from the 14th October, 1955).4\n4\nSubs. by A. 0., 1937, for “Governor of Bombay in Council”.\n5\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960) s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “the\nProvinces and the Capital of the Federation” which had been subs. by A. O., 1949, Arts. 3 (2) and 4, for “British India”.\n(2) Such rules shall be published in the 1[official Gazette], and shall thereupon have the force\nof law."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Power to appoint new manager. Whenever the Commissioner thinks fit, he may",
      "content": "suspend or remove any manager, and may appoint any officer in the stead of any manager appointed\nunder this Act; and thereupon the management then vested under this Act in the former\nmanager shall become vested in the new manager, and the new manager shall have the same powers\nas if he had been originally appointed."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Managers to be public servants. Every manager appointed under this Act shall be",
      "content": "deemed a public servant within the meaning of the Pakistan Penal Code (XLV of\n1860)."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Investigation to be deemed a judicial proceeding. Every investigation conducted by",
      "content": "connected with any such claim, shall be taken to be a judicial proceeding within the meaning of the\nPakistan Penal Code (XLV of 1860)."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Power to summon witnesses and compel production of documents. For the purposes",
      "content": "of this Act, the manager 2[or any officer subordinate to him, not below the rank of a\nMukhtiarkar,] may summon and enforce the attendance of witnesses and compel them to g ive\nevidence, and compel the production of documents, by the same means and, as far as possible in the\nsame manner, as is provided in the case of a Civil Court by the 3Code of Civil Procedure."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Bar of suits. No suit or other proceeding shall be maintained against Bar of suits. any",
      "content": "person in respect of anything done by him bona fide pursuant to this Act."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Saving of jurisdiction of Courts in Sindh in respect of certain suits. Nothing in this",
      "content": "Act precludes the Courts in Sindh having jurisdiction in suits relating to the succession to any\nimmoveable property brought under the operation of this Act from entertaining and disposing of\nsuch suits; but to all such suits the manager of such property shall be made a party.\n________\nDate: 05-09-2024\n1\nSubs. by A. O., 1937, for “Sindh officia1 Gazette”.\n2\nIns. by the Incumbered Estates and Court of Wards (Sind Arndt.) Act, 1947 (16 of 1947), s. 2.\n3\nSee now the Code of Civil Procedure, 1908 (5 of 1908)."
    }
  ],
  "definitions": []
}
