{
  "id": "pk-societies-registration-act-1860",
  "type": "statute",
  "title": "Societies Registration Act, 1860",
  "title_en": "Societies Registration Act, 1860",
  "short_name": "SRA",
  "status": "in_force",
  "issued_date": "1860-05-20",
  "in_force_date": "1860-05-20",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apg%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Societies Registration Act, 1860 (XXI of 1860) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Societies formed by memorandum of association and registration",
      "content": "Any seven or\nmore persons associated for any literary, scientific or charitable purpose, or for any such purpose as\nis described in section 20 of this Act, may, by subscribing their names to a memorandum of\nassociation and filing the same with the Registrar of Joint-stock Companies 7[* * *] from themselves\ninto a society under this Act."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Memorandum of association",
      "content": "The memorandum of association shall contain the\nfollowing things (that is to say):—\nthe name of the society :\nthe objects of the society :\nthe names, addresses, and occupations of the governors, council, directors, committee\nor other governing body to whom, by the rules of the society, the management of its\naffairs is entrusted.\n1\nShort title given by the Short Title Act, 1897 (XIV of 1897).\n2\nThe Act (with exception of the first four sections) is based on the Literary and Scientific Institutions Act No. XVII & XVIII Vict., c 112, ss. 20 et seq.\nIt has been declared to be in force in all the Provinces and the Capital of the Federation, except the Scheduled Districts, by s. 3 of the Laws Local\nExtent Act No. XV of 1874.\nIt has been declared to be in force in Baluchistan by the British Baluchistan Laws Regulation No. II of 1913, s. 3.\nIt has been declared, by notification under s. 3(a) of the Scheduled Districts Act No. XIV of 1874, to be in force in the following Scheduled Districts,\nnamely:—\nThe Districts of Hazara, Peshawar, Kohat, Bannu, Dera Ismail Khan and Dera Ghazi Khan. [Portions of the Districts of Hazara, Bannu, Dera Ismail\nKhan and Dera Ghazi Khan and the Districts of Peshawar and Kohat now form the N.W.F.P., see Gazette of India., 1901, Pt. I, p. 857, and ibid., 1902,\nPt. I, p. 575].\nIt has been extended, by notification under s. 5 of the last-mentioned Act, to the Scheduled District of Sind-See Gazette of India, 1880, Pt. I, p. 672.\nIt has been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.W.F.P., subject to certain modifica-\ntions; and extended to the Excluded Area of Upper Tanawal (N.W.F.P.) other than Phulera with effect from such date and subject to such modifications\nas may be notified-See N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950.\nIt has also been extended to the Leased Areas of Baluchistan by the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950); and applied in the\nFederated Areas of Baluchistan, see Gazette of India, 1937, Pt. I., p. 1499.\n3\nThis Act has been amended in its application to the province of the Punjab. Vide Punjab Act No. IX of 1976 and Punjab Ord. No. XV of 1984.\n4\nThis Act has also been amended in its application to the province of N.W.F.P by N.W.F.P Act No. IV of 1976 and N.W.F.P Ordinance No. V of 1976.\n5\nThis Act has also been amended in its application in the province of Sind by Sind Ord. No. XLI of 1984.\n6\nThese words were added by the Societies Registration (Amendment) Act No. XXII of 1927.\n7\nThe words and figures “under Act XIX of 1857” rep. by the Repealing Act No. XVI of 1874. See now the Companies Act No.VII of 1913, s.288.\nThis Act has been amended to the extent of Islamabad Capital Territory, see Ord. No. XXVII of 1981, s. 5 and 4th Sch.\nThis Act has been amended in its application to the Province of Sind by the Sind Act No. V of 1976.\nA copy of the rules and regulations of the society, certified to be a correct copy by not less\nthan three of the members of the governing body, shall be filed with the memorandum of association."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Registration Fees",
      "content": "Upon such memorandum and certified copy being filed, the registrar\nshall certify under his hand that the society is registered under this Act. There shall be paid to the\nregistrar for every such registration a fee of fifty rupees, or such smaller fee as 1[the Provincial\nGovernment] may, from time to time, direct; and all fees so paid shall be accounted for to 1[the\nProvincial Government]."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Annual list of managing body to be filed",
      "content": "Once in every year, on or before the\nfourteenth day succeeding the day on which, according to the rules of the society, the annual general\nmeeting of the society is held, or, if the rules do not provide for an annual general meeting, in the\nmonth of January, a list shall be filed with the Registrar of Joint-stock Companies of the names,\naddresses and occupations of the governors, council, directors, committee or other governing body\nthen entrusted with the management of the affairs of the society."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Property of society how vested",
      "content": "The property, moveable and immoveable, belonging to\na society registered under this Act, if not vested in trustees, shall be deemed to be vested, for the time\nbeing, in the governing body of such society, and in all proceedings, civil and criminal, may be\ndescribed as the property of the governing body of such society by their proper title."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Suits by and against societies",
      "content": "Every society registered under this Act may sue or be\nsued in the name of the president, chairman, or principal secretary, or trustees, as shall be determined\nby the rules and regulations of the society, and, in default of such determination, in the name of such\nperson as shall be appointed by the governing body for the occasion:\nProvided that it shall be competent for any person having a claim or demand against the\nsociety, to sue the president or chairman, or principal secretary or the trustees thereof, if on applica-\ntion to the governing body some other officer or person be not nominated to be the defendant."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Suits not to abate",
      "content": "No suit or proceeding in any Civil Court shall abate or discontinue by\nreason of the person by or against whom such suit or proceedings shall have been brought or\ncontinued, dying or ceasing to fill the character in the name whereof he shall have sued or been sued,\nbut the same suit or proceedings shall be continued in the name of or against the successor of such\nperson."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Enforcement of judgment against society",
      "content": "If a judgment shall be recovered against the\nperson or officer named on behalf of the society, such judgment shall not be put in force against the\nproperty, moveable or immoveable, or against the body of such person or officer, but against the pro-\nperty of the society.\nit shall have been recovered having sued or having been sued, as the case may be, on behalf of the\nsociety only, and shall require to have the judgment enforced against the property of the society.\nl\nSubs. by A.O., 1937."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Recovery of penalty accruing under bye",
      "content": "law.— Whenever by any bye-law duly made in\naccordance with the rules and regulations of the society, or, if the rules do not provide for the making\nof bye-laws, by any bye-law made at a general meeting of the members of the society convened for\nthe purpose (for the making of which the concurrent votes of three-fifths of the members present at\nsuch meeting shall be necessary), any pecuniary penalty is imposed for the breach of any rule or bye-\nlaw of the society, such penalty, when accrued, may be recovered in any Court having jurisdiction\nwhere the defendant shall reside, or the society shall be situate, as the governing body thereof shall\ndeem expedient."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Members liable to be sued as strangers",
      "content": "Any member who may be in arrear of a\nsubscription which, according to the rules of the society he is bound to pay, or who shall possess\nhimself of or detain any property of the society in a manner or for a time contrary to such rules, or\nshall injure or destroy any property of the society, may be sued for such arrear or for the damage\naccruing from such detention, injury or destruction of property in the manner hereinbefore provided.\nRecovery by successful defendant of costs adjudged. But if the defendant shall be\nsuccessful in any suit or other proceeding brought against him at the instance of the society, and shall\nbe adjudged to recover his costs, he may elect to proceed to recover the same from the officer in\nwhose name the suit shall be brought, or from the society, and in the latter case shall have process\nagainst the property of the said society in the manner above described."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Members guilty of offences punishable as strangers",
      "content": "Any member of the society who\nshall steal, purloin or embezzle any money or other property, or wilfully and maliciously destroy or\ninjure any property of such society, or shall forge any deed, bond, security for money, receipt, or\nother instrument, whereby the funds of the society may be exposed to loss, shall be subject to the\nsame prosecution, and, if convicted, shall be liable to be punished in like manner as any person not a\nmember would be subject and liable to in respect of the like offence."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Societies enabled to alter, extend or abridge their purposes",
      "content": "Whenever it shall\nappear to the governing body of any society registered under this Act, which has been established for\nany particular purpose or purposes, that it is advisable to alter, extend or abridge such purpose to or\nfor other purposes within the meaning of this Act, or to amalgamate such society either wholly or\npartially with any other society, such governing body may submit the proposition to the members of\nthe society in a written or printed report and may convene a special meeting for the consideration\nthereof according to the regulations of the society;\nbut no such proposition shall be carried into effect unless such report shall have been\ndelivered or sent by post to every member of the society ten days previous to the special meeting\nconvened by the governing body for the consideration thereof, nor unless such proposition shall have\nbeen agreed to by the votes of three-fifths of the members delivered in person or by proxy, and\nconfirmed by the votes of three-fifths of the members present at a second special meeting convened\nby the governing body at an interval of one month after the former meeting."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Provision for dissolution of societies and adjustment of their affairs",
      "content": "Any number\nnot less than three-fifths of the members of any society may determine that it shall be dissolved, and\nthereupon it shall be dissolved forthwith, or at the time then agreed upon, and all necessary steps\nshall be taken for the disposal and settlement of the property of the society its claims and liabilities,\naccording to the rules of the said society applicable thereto, if any, and if not, then as the governing\nbody shall find expedient, provided that, in the event of any dispute arising among the said governing\nbody or the members of the society, the adjustment of its affairs shall be referred to the principal\nCourt of original civil jurisdiction of the district in which the chief building of the society is situate;\nand the Court shall make such order in the matter as it shall deem requisite:\nAssent required. Provided that no society shall be dissolved unless three-fifths of the\nmembers shall have expressed a wish for such dissolution by their votes delivered in person, or by\nproxy, at a general meeting convened for the purpose:\nGovernment consent. Provided that 1[whenever any Government] is a member of, or a\ncontributor to, or otherwise interested in, any society registered under this Act, such society shall not\nbe dissolved 1[without the consent of the Government of the Province of registration]."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Upon a dissolution no member to receive profit",
      "content": "If upon the dissolution of any\nsociety registered under this Act there shall remain after the satisfaction of all its debts and liabilities\nany property whatsoever, the same shall not be paid to or distributed among the members of the said\nsociety or any of them, but shall be given to some other society, to be determined by the votes of not\nless than three-fifths of the members present personally or by proxy at the time of the dissolution, or,\nin default thereof, by such Court as aforesaid:\nClause not to apply to joint-stock companies. Provided, however, that this clause shall not\napply to any society which shall have been founded or established by the contributions of\nshareholders in the nature of a Joint-stock Company."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Member defined",
      "content": "For the purposes of this Act a member of a society shall be a person\nwho, having been admitted therein according to the rules and regulations thereof, shall have paid a\nsubscription or shall have signed the roll or list of members thereof, and shall not have resigned in\naccordance with such rules and regulations;\nDisqualified members. but in all proceedings under this Act no person shall be entitled to\nvote or to be counted as a member whose subscription at the time shall have been in arrear for a\nperiod exceeding three months."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Governing body defined",
      "content": "The governing body of the society shall be the governors,\ncouncil, directors, committee, trustees or other body to whom by the rules and regulations of the\nsociety the management of its affairs is entrusted."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Registration of societies formed before Act",
      "content": "Any company or society established for a\nliterary, scientific or charitable purpose, and registered under 2Act 3[VII of 1913], or any such society\nestablished and constituted previously to the passing of this Act but not registered under the said 2Act\n3\n[VII of 1913], may at any time hereafter be registered as a society under this Act;\nAssent required. subject to the proviso that no such company or society shall be registered\nunder this Act unless an assent to its being so registered has been given by three-fifths of the\nmembers present personally, or by proxy, at some general meeting convened for that purpose by the\ngoverning body.\nl\nSubs. by A. O., 1937.\n2\nRep. by the Indian Companies Act No. X of 1866, s. 219.\n3\nSubs. by Ord. No. XXVII of 1981, s.5 and Sch., IV (only to the extent of Islamabad Capital Territory).\nIn the case of a company or society registered under 1Act 2[VII of 1913], the directors shall\nbe deemed to be such governing body.\nIn the case of a society not so registered, if no such body shall have been constituted on the\nestablishment of the society, it shall be competent for the members thereof, upon due notice, to\ncreate for itself a governing body to act for the society thenceforth."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Such societies to file memorandum, etc., with Registrar of Joint",
      "content": "stock Companies.—\nIn order to any such society as is mentioned in the last preceding section obtaining registry under this\nAct, it shall be sufficient that the governing body file with the Registrar of Joint stock Companies 3[*\n* *] a memorandum showing the name of the society, the objects of the society, and the names,\naddresses and occupations of the governing body, together with a copy of the rules and regulations of\nthe society certified as provided in section 2, and a copy of the report of the proceedings of the\ngeneral meeting at which the registration was resolved on."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Inspection of documents",
      "content": "Any person may inspect all documents filed with the\nregistrar under this Act on payment of a fee of one rupee for each inspection, and any person may\nrequire a copy or extract of any document or any part of any document, to be certified by the\nregistrar, on payment of two annas for every hundred words of such copy or extract;\nCertified copies. and such certified copy shall be prima facie evidence of the matters therein\ncontained in all legal proceedings whatever."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. To what societies Act applies",
      "content": "The following societies may be registered under this\nAct:— Charitable societies, 4[* * *], societies established for the promotion of science, literature, or\nthe fine arts, for instruction, the diffusion of useful knowledge, 5[the diffusion of political education],\nthe foundation or maintenance of libraries or reading rooms for general use among the members or\nopen to the public, or public museums and galleries of painting and other works of art, collections of\nnatural history, mechanical and philosophical inventions, instruments, or designs.\n6\n[21. Registration of Deeni Madaris.—(1) Every Deeni Madrasa, by whatever name called,\nshall not operate without getting itself registered in the following manner, namely:—\n(a)        the Deeni Madrasa in existence before the commencement of the Societies\nRegistration (Amendment) Act, 2024, (XXXVIII of 2024), if not already\nregistered, 7[may] get itself registered under this Act within six months from\ncommencement of the Societies Registration (Amendment) Act, 2024\n(XXXVIII of 2024); 7[*]\n(b)        a Deeni Madrasa established after commencement of the Societies\nRegistration (Amendment) Act, 2024, (XXXVIII of 2024), 7[may] get itself\nregistered under this Act 7[or otherwise,] within one year of its establishment\n7\n[; and]\n1\nRep. by the Indian Companies Act No. X of 1866, s. 219.\n2\nSubs. by Ord. No. XXVII of 1981, s.5 and Sch., IV (only to the extent of Islamabad Capital Territory).\n3\nRep. by the Repealing Act No. XVI of 1874. See now the Companies Act, 1913 (VII of 1913), s.288.\n4\nOmitted by A.O., 1949, Sch.\n5\nIns. by Act No. XXII of 1927.\n6\nAdded by Act No. XXXVIII of 2024, s. 2.\n7\nSubs. omit and ins. by Act No. XXXI of 2025, s. 2.\nExplanation.—A Deeni Madrasa having more than one campus shall need only one\nregistration.\n1\n[(c)   those Madaris and Wafaqs already registered or desirous to register\nthemselves directly with Directorate General of Religious Education, Ministry\nof Federal Education and Professional Training, shall be reckoned to have\nbeen registered and shall be dealt with accordingly under the relevant\ndispensations.]\n(2) Every Deeni Madrasa shall submit to the Registrar annual report of its educational\nactivities.\n(3) Every Deeni Madrasa shall cause to be carried out audit of its accounts by an auditor and\nsubmit a copy of its audit report to the Registrar.\n(4) No Deeni Madrasa shall teach or publish any literature which promotes militancy or\nspreads sectarianism or religious hatred:\nProvided that nothing contained herein shall bar the comparative study of various religions or\nschools of thought or the study of any other subject covered by the Holy Quran, Sunnah or the\nIslamic jurisprudence.\n(5) Every Deeni Madrasa shall, subject to their resources, 1[accord priority to] include basic\ncontemporary subjects in their curriculum according to a phased program.\n(6) For registration of Deeni Madrasa under this Act 1[or otherwise], no Deeni Madrasa shall\nbe required to register itself under any other law for the time being in force.\n(7) Once registered under this Act 1[or otherwise], no Deeni Madrasa shall be required to be\nregistered under any other law whatsoever for the time being enforce.\nExplanation.—In this section “Deeni Madrasa” means a religious institution and includes a\nJamia or Dar-ul-Uloom, called by any other name, established or operated primarily for the purposes\nof imparting religious education, which provides boarding and lodging facilities.]\n_______\nDate: 09-10-2025\n1Ins. by Act No. XXXI of 2025, s. 2."
    }
  ],
  "definitions": []
}
