{
  "id": "pk-special-technology-zones-authority-act-2021",
  "type": "statute",
  "title": "Special Technology Zones Authority Act, 2021",
  "title_en": "Special Technology Zones Authority Act, 2021",
  "short_name": "STZAA",
  "status": "in_force",
  "issued_date": "2021-10-03",
  "in_force_date": "2021-10-03",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npapli-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Special Technology Zones Authority Act, 2021 (XVII of 2021) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Act shall be called the Special Technology\nZones Authority Act, 2021.\n(2) it extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless the context otherwise requires,___\n(a)    “Administrator” means the Administrator as described under section 26;\n(b)    “Authority” means the Special Technology Zones Authority established under\nsection 3;\n(c)    “Board” means the Board of Governors constituted under section 6;\n(d)    “Chairperson” means the Chairperson of the Authority appointed by the Prime\nMinister, pursuant to the provisions of this Act, who is entrusted with whole or\nsubstantially whole of the powers of the management of affairs of the Authority in\naccordance with the Act;\n(e)    “Capital Goods” means the goods including but not limited to materials, plant,\nmachinery, hardware, equipment and software, devices, instruments, accessories,\nattachments, building materials, materials and any other equipment required to\nperform functions of the Authority, zones, zone developers and zone enterprises,\nwhether or not manufactured locally, for use in the zones, set up under the Special\nTechnology Zones Authority Act, 202l;\n(f)   “co-zone developer” means a Partner of the zone developer for the establishment,\ndevelopment, operation or management of zone;\n(g)   “Division Concerned” means the Cabinet Division;\n(h)   “Development Agreement” means a duly approved agreement between Authority\nand a zone developer, agreed to and endorsed by the Approvals Committee that\nauthorizes zone developer to develop and establish a zone or a part thereof;\n(i)   “Master Plan” means an overarching planning document providing conceptual,\nspatial, landscape, infrastructure, facilities etc. plan, which is used to structure the\nland and development of infrastructure and facilities for facilitating the smooth\nfunctioning of the zones;\n(j)   “Member” means Member of the Authority;\n(k)   “One Window Facility” means a physical or an information and communication\ntechnology (ICT) facility, comprising of relevant entities of Federal, Provincial or\nLocal Governments, for facilitation of the zone developer and zone enterprises to\nlodge standardized information and documents with a single-entry point to fulfill\ndevelopment, execution, operations, functioning and management of zones;\n(l)   “Person” includes any registered association of persons, consortium, a body\ncorporate formed or incorporated by or under any law in force, company,\ncorporation, society, modaraba, Real Estate Investment Trust (REIT), Government,\ntrust, partnership, or any juridical personality and includes the zone developer and\nzone enterprise;\n(m)   “Prescribed” means prescribed by rules or regulations made and notified under\nthis Act;\n(n)   “Regulations” means regulations prescribed under this Act;\n(o)   “Research and Development” includes regular activities carried out with the\npurpose of obtaining new knowledge that shall enable the development of science\nand technology or creating new equipment, systems, products, services, processes,\napplications, and tools etc., using the available information and resources, including\ntraining and development, software production or improving those that are\navailable;\n(p)   “Rules” means rules prescribed under this Act;\n(q)   “Special Technology Zones Appellate Tribunal” means the Special Technology\nZones Appellate Tribunal constituted under this Act;\n(r)     “Technology Sector” includes one or more technology sectors prescribed by the\nAuthority under the rules;\n(s)     “zone developer” means a public, private or a public-private Person responsible\nfor development, operation or management of the whole, or a part of the whole\nspecial technology zone, and licensed by the Authority as such, and includes a co-\nzone developer;\n(t)     “zone enterprise” means any public, private, or public-private Person developing,\noperating and managing a technological enterprise within the zone and licensed as\nsuch by the Authority;\n(u)     “zone” means a particular type or class of zone, which may be geographical or\nvirtual, new or existing or expansion of an existing zone, as approved and notified\nby the Authority under the rules, including, but not limited to special technology\nzones, information technology parks, high-tech industrial areas, software\ntechnology parks, hardware technology parks, technology export zones, free\ntechnology zones, science and technology parks, information technology zones,\nscience and technology zones, R&D zones, opportunity zones, innovation zones,\ntechnology development zones, knowledge parks, smart cities, knowledge cities,\ntechnology incubation zones or any sector zones, which are developed for the\ndevelopment, promotion and proliferation of technology, particularly all the latest\ncutting edge technologies and may require technological intervention such as\nbiotech, chemical technologies, agritech, fintech, robotics, nanotech, edtech, etc.\nand other zones with any combination or combinations of the aforesaid fields."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Authority",
      "content": "_(1) On the commencement of this Act, there shall stand\nestablished an Authority to be called the Special Technology Zones Authority in accordance with the\nprovisions of this Act.\n(2) The Authority shall comprise of the Chairperson and up to eight (8) Members to be appointed\nin accordance with the provisions of this Act:\nProvided that the Chairperson with the consent of the Board may increase or decrease the number\nof Members, from time to time, as may be considered appropriate.\n(3) The Chairperson shall be appointed by the Prime Minister of Pakistan for a period of three\nyears and shall be eligible for re-appointment for one or more similar terms.\n(4) The Members shall be appointed and removed in accordance with the regulations.\n(5) The Chairperson shall preferably be from the private sector and shall be eligible for such\nremunerations and benefits as determined by the Prime Minister.\n(6) The Chairperson of the Authority may resign from his office by writing in his hand addressed\nto the Prime Minister, or may be removed from his office if, on an inquiry by the Prime Minister, he is\nfound unable to perform the functions of his office because of mental or physical disability or he is found\nguilty by a court of any serious crime of moral turpitude.\n(7) The Authority may create, sanction and approve posts, from time to time as per regulations,\nand prescribe by regulations the qualifications, experience and terms and conditions for appointment of\nthe Chairperson, Members, Executive Directors and other officers and staff of the Authority.\n(8) The Authority shall meet at such time and place and in such manner, as may be prescribed by\nregulations.\n(i)    Three Members shall constitute a quorum for meetings of the Authority requiring\na decision by the Authority:\nProvided that until regulations are made in this behalf, such meetings shall be convened by the\nChairperson.\n(9) No act or proceeding of the Authority shall be invalid by reason only of the existence of a\nvacancy in, or defect in, the constitution of the Authority.\n(10) The powers and functions of the Authority as provided in the Act shall be exercised in the\nname of the Authority by the Authority, comprising of Chairperson and the Members, which shall act\nthrough the Chairperson who shall be the chief executive of the Authority. In performance of his functions\nunder the Act, the Chairperson may act either directly or through the Members.\n(11) The principal office of the Authority shall be in Islamabad and it may set up offices at such\nplace or places within or outside Pakistan as may be required.\n(12) The Authority shall be a body corporate having perpetual succession and a common seal, with\npower, to purchase, acquire, sell, lease, sub-lease, sub-let, license and hold moveable and immovable\nproperty, and shall by said name sue and be sued.\n(13) The Authority shall have the power to constitute as many committees, councils and\nassociations and establish companies, nationally and internationally, to achieve its goals, as it may deem\nfit."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers of the Authority",
      "content": "_(1) Subject to the provisions of this Act, the Authority may take\nsuch measures and exercise such powers as may be required for performance of its functions.\n(2) Without prejudice to the generality of the powers conferred by sub-section (1), the Authority\nshall have exclusive power and authority—\n(a)    for planning, policy formulation, execution, monitoring and evaluation of zones\nwhich may be assigned to it, approved by it, notified by it or developed by it from\ntime to time;\n(b)    to approve and notify zones in accordance with the rules or regulations;\n(c)     for establishment, development, implementation, operations, management and\nfunctioning of zones;\n(d)     to make or cause to make arrangements for provision of security, utilities, roads,\nbasic infrastructure, high speed internet and any other services required to ensure\nsmooth development and functioning of zones;\n(e)     to allow any additional incentives, subsidies and rebates, for zone developers and\nzone enterprises, with the approval of the Federal Government, Provincial\nGovernments or local governments as the case may be;\n(f)     to charge fees and charges for services rendered and the licenses issued to the zone\napplicants, zone developers and zone enterprises as may be prescribed;\n(g)     to impose fines, sanctions and penalties for contraventions under this Act, rules or\nregulations;\n(h)     to appoint an Administrator to the zones in accordance with this Act and any\napplicable rules or regulations;\n(i)     to collect information with respect to technologies and technological developments\nwithin and outside Pakistan and review the impact thereof;\n(j)     to enter into contracts, agreements or any other legal instrument for the purposes of\nthis Act;\n(k)     to purchase, acquire, sell, lease, sub-lease, sub-let, license and hold moveable and\nimmoveable property and set up companies for the purposes of the zones to meet\nthe objectives of this Act;\n(l)     to seek assistance from any Federal/Provincial officer, Ministry, Division,\ndepartment or agency for the performance of its functions under this Act;\n(m)     to set up One Window Facility to facilitate zone developers and zone enterprises;\nand\n(n)     to do anything incidental and ancillary to the foregoing as may be deemed\nnecessary.\n(3) The services provided by the Authority shall be deemed to be essential services for the purposes\nof the Pakistan Essential Services (Maintenance) Act, 1952, and shall be notified accordingly."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Functions of the Authority.___(1) To perform its functions, the Authority may",
      "content": "(a)    from time to time, review national investment policies, laws and regulations that\nimpact zones and propose any amendments, modifications and relaxations therein\nto the Federal Government, the Provincial Government or the Local Governments;\n(b)    initiate and consider zone investment proposals and categories for investment\nwhich may require specific treatments and interventions and recommend, where\nappropriate, additional incentives or relaxation of conditions or criteria to the\nFederal Government, the Provincial Government or the Local Governments for\napproval;\n(c)    he associated in the formulation of all policies that may have an impact on\ninvestment in Technology Sectors in Pakistan, including economic, fiscal and trade\npolicies;\n(d)    coordinate with Ministries, departments, agencies and Provincial Governments or\nLocal Governments with regard to policies and their implementation having impact\non investment in Technology Sectors;\n(e)    identify and promote Technology Sector investment opportunities within and\noutside Pakistan;\n(f)    develop and approve mechanisms and arrangements for management and operation\nof zones including one-window facility for provision of all services and utilities,\nphysical infrastructure, logistics infrastructure, human capital development and\ndigital infrastructure for the zone;\n(g)    identify, create and upgrade technological and scientific clusters and industrial\nsupport systems within zones including, but not limited to Research and\nDevelopment centres, skills development centres, training institutes, data centres,\nuniversities, hospitals, and other hard and soft infrastructure related to successful\nexecution of zones;\n(h)    attract investment into zones including foreign direct investments, venture capital\nfunds, public sector investments, public-private investments and private funds;\n(i)    marketing and promotion of zones by developing a marketing, image-building and\npublic relations strategy to generate interest in the potential and opportunities of the\nPakistani market and publicize its activities;\n(j)    identification and approval of locations for setting up zones;\n(k)    procure and acquire land or any infrastructure for the zones;\n(l)    appoint commissions, expert bodies and consultants to study various aspects of\nattracting investments in technology related businesses and improving the\ninvestment climate, procedures and other related matters;\n(m)    develop studies, feasibility reports, experiments, public-private partnership\nframeworks, financial vehicles, technical research and surveys related to zones;\n(n)    develop or cause to be developed Master Plans for zones and approve or cause to\napprove them;\n(o)    act as One Window Facility for investors, zone developers, zone enterprises and\nother stakeholders involved in zones dealing with other relevant government\nentities on their behalf;\n(p)    issue letters of recommendation or invitation letters, which shall be deemed\nsufficient for the purpose of issuance of business and work permits or visas by\nrelevant Authority;\n(q)    collect, compile, analyse, maintain and distribute zones related information, and\nfrom time to time publish analytical reports, trends and insights;\n(r)    promote a congenial environment and ensure ease of doing business for investments\ninto zones by allowing import of Capital Goods as required by the zone developers\nand zone enterprises;\n(s)    negotiate and finalize all such acts, deeds, initiatives, agreements for protection and\npromotion of technology related investments with other countries, international\nforums, financial institutions and multi-lateral agencies, and represent Pakistan on\nregional and international level, that may be necessary or expedient for the purpose\nof successful planning, development, execution, implementation, management and\nmaintenance of zones;\n(t)    liaise with private sector trade bodies and associations, both local and international,\nfor their active participation in promotion of technology related investment;\n(u)    approval, issuance, notification and cancellation of licenses of zone enterprises and\nzone developers;\n(v)    allocate, lease, sub lease, rent, sell land, space, lots within zones developed by the\nAuthority itself;\n(w)    perform any other function assigned to it by the Federal Government.\n(2) The Federal Government may, from time to time, assign more functions and issue guidelines\nto the Authority."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Board",
      "content": "_(1) There shall be a Board of Governors of the Authority comprising of the following\nmembers, namely:___\n(a)        the Prime Minister of the Islamic Republic of Pakistan shall be its President;\n(b)        Federal Minister in Charge of the Division Concerned;\n(c)        Chairperson of the Authority; and\n(d)        not less than seven and not more than twenty-five ex-officio and Independent\nmembers, provided that not less than five Independent members shall be appointed\nfrom private sector from amongst persons of renowned integrity, expertise,\nexperience and knowledge.\n(2) The ex-officio 1[* * *] members shall be appointed by the Federal Government for a term of\nfour years 1[:]\n1\n[Provided that the independent members shall be appointed for a term of four years by the Prime\nMinister on recommendation of the Secretary of the Division concerned.]\n(3) An ex-officio member shall hold office as member till such time he holds the office by virtue\nof which he is a member and upon his transfer, retirement, resignation or removal from office, the person\nappointed in such person’s place shall be the member.\n(4) Secretary of the Board shall be appointed with the approval of the President.\n(5) The Board shall meet at least twice in a year. The Secretary of the Board may take approval of\nany decision through circulation among members of the Board. The Chairperson of the Authority may\ncall a special meeting with the approval of the President of the Board.\n(6) The meetings of the Board shall be presided over by the President of the Board and in his\nabsence, the President of the Board shall appoint any member to chair the meeting.\n(7) The quorum for a meeting of the Board shall be one-third of the total membership of the Board,\nand decisions of the Board shall be made with majority of total present members of the Board.\n(8) The powers and functions of the Board are as follows:\n(a)        develop and approve national special technology zone strategy, national emerging\ntechnologies strategy, and national information and communication technology\nstrategy;\n(b)        develop and approve national special technology zone plan, national emerging\ntechnologies plan, and national information and communication technology plan;\n1\nOmitted, subs. and added by the Act No. XII of 2025, s. 2.\n(c)     approval of the rules and regulations of the Authority;\n(d)     issue such directions and policy guidelines to the Authority from time to time to\nprotect the interests of the Government, investors and public;\n(e)     oversight, supervision and monitoring the performance of the Authority;\n(f)     approval of the annual budget, annual audited financial statement and accounts for\nany particular financial year;\n(g)     approval of annual report of the Authority;\n(h)     to annually review the implementation of this Act with a view to improving policies\nrelating to zones."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Budget, finance and audit",
      "content": "_(1) The Authority shall, in respect of each financial year, prepare\nits own budget in accordance with the prescribed procedure and submit to the Board for approval.\n(2) The Budget statement shall specifically state the estimated receipts and expenditure and the\nsums which are likely to be required from the Federal Government during the next financial year.\n(3) The Authority shall maintain complete and accurate books of accounts of its receipts and\nexpenditure.\n(4) The accounts of the Authority shall be audited at the close of each financial year by a qualified\nfirm of Chartered Accountants.\n(5) The Authority shall produce such accounts, books and documents and furnish such\nexplanations and information as the auditors may require for the purpose of audit by the external auditors\nor Auditor General of Pakistan.\n(6) Copies of the Auditor’s Report on the accounts shall be provided to the Authority and the\nBoard.\n(7) The Chairperson of the Authority shall be its Principal Accounting Officer."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Grants",
      "content": "_(1) The Federal Government, the Provincial Governments and the Local\nGovernments may, from time to time, place annual grants to the Authority for the smooth discharge of its\naffairs.\n(2) The Authority may receive domestic and international grants for the purposes of achieving the\nobjectives of this Act."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Funds.___(l) There shall be constituted a non",
      "content": "lapsable fund to be called the Special Technology\nZones Authority Fund, which shall vest in the Authority and shall be utilized by the Authority to meet all\nexpenses and charges properly incurred in connection with carrying out the purposes of this Act. The Fund\nshall be credited all sums received by the Authority. The Fund shall be financed by:\n(a)     fees, commissions, charges and other amounts received by the Authority;\n(b)     funds including grants provided by the Federal Government for payment of salaries,\nestablishing infrastructure and running day-to-day business of the Authority as a\none line budget;\n(c)     funds provided by the Provincial, Local Governments or any other body including\ngrants;\n(d)     funds including grants from national and international bodies / organizations;\n(c)     loans from the Federal Government or Provincial Government;\n(f)     loans, investments and foreign aid obtained by the Authority;\n(g)     funds raised through Public-Private Partnerships by the Authority;\n(h)     funds from bonds, sukuks and other forms of finances and investments on the basis\nof participation term certificates, musharika certificates, term finance certificates\nor any other financial or debt instruments or securities issued by the Authority;\n(i)     proceeds of any investments made by the Authority in utilizing any amount of\nFunds which is not required for immediate use.\n(2) The Fund will be utilized for the above purposes as per the mechanism prescribed in the\nregulations.\n(3) Without prejudice to any other law for the time being in force, the Authority may invest in\ndevelopment of projects, specialized funds or financial vehicles or any other area approved by the\nAuthority with fees and contributions from zone developers and zone enterprises, and with funds from\npublic, private or international entities, and Federal, Provincial or Local Governments, to achieve\nobjectives of this Act."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Bank accounts",
      "content": "_(1) The Authority may open and maintain bank accounts in local and foreign\ncurrency in any scheduled bank in Pakistan.\n(2) Bank accounts of the Authority shall be opened with the prior approval of principal accounting\nofficer."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Approvals Committee",
      "content": "_(1) There shall be a committee, called Approvals Committee,\nheaded by the Chairperson and up-to eight members from amongst the Members and officers of the\nAuthority nominated by the Chairperson for this purpose.\n(2) The Chairperson may call any person or adviser or consultant as an expert to assist the\nApprovals Committee and such person or adviser or consultant shall not be eligible to cast a vote.\n(3) The meeting of the Approvals Committee shall be convened on the orders of the Chairperson.\n(4) The Approvals Committee shall meet as frequently as required, but not less than once every\nquarter.\n(5) Two third or more of the members shall constitute quorum of the Approvals Committee.\n(6) Where the Chairperson is not present, a Member of the Authority nominated by the Chairperson\nshall chair the Approvals Committee.\n(7) The decisions of the Approvals Committee shall be taken by majority of the total membership\npresent through voting. In case of equal voting, the Chairperson of the committee shall have the discretion\nto take the final decision.\n(8) The Chairperson shall appoint an officer from the Authority to be the Secretary of the said\nCommittee.\n(9) The Chairperson shall be competent to remove or substitute any member of the Committee, if\ndesired.\n(10) The Chairperson may constitute sub-committees to assist the Approvals Committee to\ndischarge any of its functions."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Functions and Responsibilities of the Approvals Committee",
      "content": "_(1) The functions and\nresponsibilities of the Approvals Committee shall be—\n(a)    to recommend such procedures, mechanisms and regulations to the Authority for\nimplementation of this Act as are applicable to all zones or a particular zone;\n(b)    to review and recommend amendments in national information and communication\ntechnology strategy, national emerging technologies strategy and other technology\nand science related initiatives;\n(c)    to approve or amend development plan and Master Plan for each zone;\n(d)    to recommend strategic initiatives to the Authority including, but not limited to,\ninter-alia, establishing new zones, expansion of existing zones, entering into\nagreement with other entities, joint ventures, public-private partnerships etc;\n(e)    to recommend additional incentives for zone developers and zone enterprises;\n(f)    to recommend any existing or new zone proposed by any investor, whether public\nor private;\n(g)     to consider and approve zone developers and zone enterprises applications and\nagreements."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Criteria for approval of zones",
      "content": "_(1) The Authority shall prescribe the criteria for approval\nof zones in the rules."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Licensing of zone enterprises and zone developers",
      "content": "_(1) The Authority shall prescribe the\ncriteria and procedures for licensing of the zone enterprises and zone developers in the regulations."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Sanctions against zone enterprises and zone developers",
      "content": "_(1) A mechanism may be\nprescribed by the Authority in the regulations for sanctions, imposition and recovery of penalties and fines\nagainst zone enterprises and zone developers for violations of this Act or any rule or regulation prescribed\nby the Authority."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Land regime",
      "content": "_(1) The acquisition of any land or any interest in land for the Authority or for\nany purpose under this Act shall be deemed to be an acquisition for a public purpose within the meaning\nof the Land Acquisition Act, 1894 (1 of 1894) or any successor legislation, and the provisions of the said\nAct shall apply accordingly.\n(2) The Federal Government, Provincial Government, Local Government or any Local Authority\nmay transfer or cause the transfer of any land, property, asset, infrastructure, facility to the Authority,\nsubject to prevailing laws.\nExplanation.___The expression “Federal Government, Provincial Government and Local\nGovernment” shall mean and include any authority, body, corporation or legal entity established or\ncontrolled by such Government and the word “transfer” shall mean and include any and all modes of\ntransfer of properties, assets, land or infrastructure permissible under the laws of Pakistan.\nI7. Public utilities and other facilities.___(1) The Federal Government, Provincial Governments,\nLocal Governments, Municipal Authorities, Cantonments, and other Territories of Pakistan, as the case\nmay be, shall ensure the removal of all obstacles to the provision of, all infrastructure and utility facilities,\nat their cost, including but not limited to electricity, water, gas, roads, telecommunication services and\nother essential facilities necessary for efficient operations of a zone. The Federal, and Provincial\nGovernments shall ensure adequate road access, at their cost, to the zones and adequate provision of zones\nfrom a safety and security standpoint.\n(2) The zone developer shall have the right to set up a renewable, thermal, hydel or other captive\nelectric power generation plant or install power generator of sufficient size to cater the expected demand\nfor electricity within a particular zone as per rules or regulations of the Authority and to sell only the\nexcess electricity generated outside that particular zone as per prevailing laws.\n(3) The Authority may execute agreements with the Provincial Governments, Local Governments,\nMunicipal Authorities, Cantonments, local authority and other Territories of Pakistan for the purposes of\nimplementation of this section.\nExplanation.___The expression “Federal Government, Provincial Government, Local Government\nMunicipal Authorities, Cantonments, local authority and other Territories of Pakistan” shall mean and\ninclude any authority, body, corporation or legal entity established or controlled by such Government."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Incentives for zones",
      "content": "_(1) On execution of relevant agreement with the Authority, the zone\ndevelopers as well as zone enterprises in a zone shall be entitled to incentives outlined in sections 20 and"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. (2) With the objective of promoting a particular sector, industry or zone, the Authority may",
      "content": "recommend and the Federal Government may grant additional incentives and exemptions to zone\nenterprises and zone developers including but not limited to subsidies for electricity, gas and high speed\ninternet connectivity inside the special technology zones, provided that___\n(a)     such additional benefits may only be granted if the Authority finds these to be\njustified on the basis of an economic impact assessment;\n(b)     such additional benefits, if granted conditionally, may be liable to be forfeited with\nretro-active effect if it is finally determined that a zone developer or zone enterprise\nhas failed to comply with the conditions prescribed for the additional benefits in\nquestion; and\n(c)     the Authority shall make economic impact assessment of the zone developers and\nzone enterprises within five years from the date the agreement is signed with the\nzone developers, and within the first year of operations of a zone enterprise.\n(3) Any additional benefits granted by the Authority—\n(a)     shall be deemed to be included in the relevant Development Agreements; and\n(b)     shall become effective on such conditions as the Authority may stipulate.\n(4) Nothing in this Act shall be construed to limit the Authority of any Federal, Provincial and\nLocal Government Authority to grant such additional benefits to zone developers and zone enterprises as\nare within the scope of their respective statutory powers.\n(5) The State Bank of Pakistan may issue special foreign exchange regulations for incentives,\nbenefits and exemptions as set out in this Act."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Protection of incentives",
      "content": "_(1) Incentives, benefits and protections under this Act shall be\nadditional to all incentives, benefits and protections, which may be applicable to zone developers and zone\nenterprises under generally applicable legislation and international agreements of Pakistan.\n(2) These incentives shall not be withdrawn or modified or altered prematurely and retrospectively\n.,\nand any change therein shall be to the advantage of the zone developer and zone enterprise and not\notherwise."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Exemptions and Incentives for the Authority and for the zone developers",
      "content": "_(1) The\nfollowing shall be the incentives for the Authority and zone developers from the date of signing of the\nDevelopment Agreement, for a period of ten years namely___\n(a)     Exemption from all taxes under the Income Tax Ordinance, 200l including tax on\nprofits and gains, income tax, turnover tax, withholding tax, capital gains tax,\nincome tax on dividend income and withholding tax on dividend;\n(b)     Exemption from sales tax under the Sales Tax Act, 1990;\n(c)     Exemption from Customs Duty under the Customs Act 1969 on the import in\nPakistan of all Capital Goods including but not limited to materials plant,\nmachinery, hardware, equipment and software, devices, instruments, accessories,\nattachments, building materials, materials and any other equipment required to\nperform functions of the Authority, zones and zone developers, whether or not\nmanufactured locally, for use in zones;\n(d)     Exemption from property tax;\n(e)     Exemption on dividend income and capital gains of any venture capital fund\n(whether local or foreign) derived from investments in the zone developers; and\n(f)     permission for opening and maintaining of foreign currency accounts, availability\nof foreign exchange, full convertibility to foreign currency and repatriation and free\ntransfer of foreign currency to meet the requirements of investors, lenders,\ncontractors, operators, consultants, insurers, re-insurers, vendors and advisors in\nrelation to any compensation amounts, loan repayments, equity and return on\nequity, profits, works, goods and services in accordance with the foreign exchange\nregulations of the State Bank of Pakistan for zones.\nFor the avoidance of doubt, co-zone developer shall be entitled to the tax exemptions and incentives\npermissible to the zone developers under Section 20."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Alternate dispute resolution mechanism",
      "content": "_(1) The Authority shall prescribe a legally\nbinding and enforceable alternate dispute resolution mechanism consistent with the applicable laws for\nthe settlement of all disputes arising among and between the Authority, zone developers or zone\nenterprises.\n(2) All agreements between zone developers, its operators and sub-consultants, and zone\nenterprises shall be governed by the afore-stated alternate dispute resolution mechanism prescribed by the\nAuthority:\nProvided that nothing herein shall preclude the Authority or any of its sub-ordinate entities or\ncompanies from entering into international arbitration agreements with foreign zone developers and zone\nenterprises."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Cognizance of legal disputes",
      "content": "_(1) No court shall take cognizance of a legal dispute under\nthis Act or the rules or regulations made thereunder to which the jurisdiction of the Special Technology\nZones Appellate Tribunal extends.\n(2) The Special Technology Zones Appellate Tribunal shall have exclusive jurisdiction to\ndetermine all disputes arising in respect of any matters___\n(a)    concerning any officer or employee of the Authority with the exclusion of the\nChairperson;\n(b)    concerning the exercise of powers and functions of the Authority under sections 4\nand 5 of the Act or, Administrator under section 26;\n(c)    concerning any aspect relating to the one-window facility established by the\nAuthority;\n(d)    concerning any decision of the Approvals Committee;\n(e)    in relation to sections 13 and 14 of the Act or any rules or regulations prescribed\nthereunder;\n(f)    concerning any sanction, penalty or fine imposed by the Authority under section 15\nor any rules or regulations prescribed thereunder;\n(g)    relating to section 19 of the Act: and\n(h)    concerning any other rule or regulation prescribed by the Authority."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Appeals to Special Technology Zones Appellate Tribunals",
      "content": "_(1) Any zone developer or\nzone enterprise or a concerned person aggrieved by any order of the Authority may prefer an appeal before\nthe Special Technology Zones Appellate Tribunal, within thirty days of the order, in accordance with the\nprescribed rules.\n(2) An appeal to the Special Technology Zones Appellate Tribunal shall be in such form, contain\nsuch particulars and be accompanied by such documents and fees as may be prescribed under this Act.\n(3) The Special Technology Zones Appellate Tribunal shall consist of a Chairman, who shall be a\nlegal expert, and two members, one being a technical expert and the other being a financial expert, who\nshall be persons of ability, integrity and have special knowledge and professional experience of not less\nthan ten years in the fields of law, economics, technology or finance.\n(4) The Chairman and Members of the Special Technology Zones Appellate Tribunal shall hold\noffice for a period of three years and shall be eligible for re-appointment for a similar term or terms and\nshall cease to hold office on attaining the age of sixty eight years or the expiry of the term whichever is\nearlier.\n(5) The terms, conditions and appointment of the Special Technology Zones Appellate Tribunal\nChairman and other members shall be in the manner as may be prescribed this Act, which may be made\nand shall take effect, notwithstanding anything contained in any other law or rules for the time being in\nforce.\n(6) The Chairman and the members shall be entitled to such salary and other terms and conditions\nof service as the Authority may prescribe.\n(7) The Special Technology Zones Appellate Tribunal shall decide an appeal expeditiously but not\nlater than three months of its presentation to the Tribunal.\n(8) The Special Technology Zones Appellate Tribunal shall, for the purpose of deciding an appeal,\nbe deemed to be a civil court and shall have the same powers as are vested in such court under the Code\nof Civil Procedure, I908 (Act V of 1908), including the powers of___\n(a)    enforcing the attendance of any person and examining him on oath;\n(b)    compelling the production of documents; and\n(c)     issuing commissions for the examination of witnesses and documents.\n(9) It shall be sufficient for the Special Technology Zones Appellate Tribunal to establish, or to be\nsatisfied as to any matter on the standard of proof applicable to civil proceedings in summary manner in\na court of law.\n(10) The Special Technology Zones Appellate Tribunal’s determinations or decisions under this\nAct shall be deemed to be the decrees of a civil court under the Code of Civil Procedure, 1908 (Act V of\n1908).\nExplanation.___ It is clarified that the timeframe for rendering a decision of thee months is\nmandatory and not directory."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Appeal to Supreme Court",
      "content": "_(1) Any person aggrieved by an order of the Special Technology\nZones Appellate Tribunal may prefer leave to appeal to the Supreme Court of Pakistan within sixty days\nunder the rules prescribed by the Supreme Court."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Appointment and Powers of Administrator",
      "content": "_(1) The Authority may appoint any one or\nmore persons an Administrator to investigate, either on its own motion or on the basis of any information\nreceived, whether any contravention of any provision of or anything prescribed by this Act has been\ncommitted. Provided that an Administrator’s investigation shall be carried in the manner prescribed.\n(2) Where an Administrator, after concluding an investigation is satisfied that a contravention of\nany provision of or anything prescribed by this Act has been committed, may recommend to the Authority\nto undertake any of the following in the manner prescribed:\n(a)     impose a fine on or sanction any person responsible for such contravention;\n(b)     cancel any license issued by the Authority to any person responsible for such\ncontravention;\n(c)     issue directions to any zone developer, co-zone developer, or zone enterprise to\ncease from doing any particular act in a zone."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Powers to make rules",
      "content": "_(1) The Authority may, with the approval of the Federal Government,\nmake rules, on the matters as deemed necessary for implementation and to carry out the purposes of this\nAct.\n(2) Until the rules referred to in sub-section (1) are made, the President of the Board shall be\ncompetent to determine, the terms and conditions for appointment of the Chairperson, Members,\nExecutive Directors, officers and employees of the Authority."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Powers to make regulations",
      "content": "_(1) The Authority may, with the approval of the Board, make\nregulations as deemed necessary for the implementation of and to carry out the purposes of this Act."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Annual report",
      "content": "_(1) The Authority shall prepare and submit to the Board, within four months\nof the expiry of each financial year, a report on the conduct of its functions and affairs for that year.\n(2) Each such annual report shall include___\n(a)    an audited statement of income and expenditure;\n(b)    an audited balance sheet;\n(c)    a short financial statement of preceding financial year;\n(d)    activities of the Authority during previous financial year;\n(e)    an outline of the investment programs for the year ahead; and\n(f)    any other matter which the Federal Government may direct or the Authority may\nconsider appropriate to make its report more self-speaking about its initiatives and\nachievements."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Delegation of powers",
      "content": "_(1) The Authority may delegate any of its powers and assign its\nfunctions subject to such conditions as it may deem fit to impose, to the Chairperson, Approvals\nCommittee or any other committee."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Recruitment",
      "content": "_(1) The Authority may, from time to time, create, sanction and approve posts\nand determine the need to employ and appoint such Members, officers, members of its staff, advisers,\nconsultants, and other employees, as it considers necessary for efficient performance of its functions on\nsuch terms and conditions as may be prescribed by regulations, provided that all appointments shall be\nmade in accordance with the prescribed educational, technical or professional qualifications and\nexperience:\nProvided that the regulations, orders, instructions for the time being in force governing all\nappointments and terms of service of employees of the Authority shall be contractual and non-statutory."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Employee of the Authority to be public servants",
      "content": "_(1) For the purposes of this Act, the\nChairperson, Members, Executive Directors and other Officers, staff, advisers, consultants and experts of\nthe Authority shall be deemed to be public servants within the meaning of section 2l of the Pakistan Penal\nCode, 1860 (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Assistance from agencies",
      "content": "_(1) Notwithstanding anything contained in any other law for the\ntime being in force, the Authority may seek any assistance or information from any person including but\nnot limited to, any Ministry, Division, department, statutory body, corporation, agency of the Federal,\nProvincial or Local Governments which, in its opinion, concerns any matter relating to the smooth\nfunctioning of the Authority and the requisite assistance or information, whatever the case may be, shall\nbe provided to the Authority within the time frame stipulated by it. In cases where consent is sought, and\nit is not received within the stipulated time, it shall be deemed as approved after completion of the\nstipulated time."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Public Sector and State",
      "content": "Owned Enterprises Investments in zones.___(1) Notwithstanding\nany prohibition or limitation contained in any law, rules regulations, directives or instructions for the time\nbeing in force, all public sector authorities, departments, agencies, funds, statutory and non-statutory\nbodies, other authorities and state-owned enterprises established or controlled by the Federal, Provincial\nor Local Government may, with the approval of their competent authorities, invest in the zones after due\nconsultations with the Authority."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Employment of Key Persons",
      "content": "_(1) Notwithstanding anything contained in any other law, the\nAuthority may issue special rules for the employment by zone developers and zone enterprises of key\nmanagerial and technical persons who are not citizens of Pakistan, relating to the terms and conditions of\ntheir contracts as well as with respect to the issuance of visas, temporary residence permits and temporary\nwork permits for such key persons and their dependents."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Indemnity",
      "content": "_(1) No suit, prosecution or other legal proceedings shall lie against the Board,\nAuthority, the Chairperson, Members, Executive Directors, officers, the employees and consultants of the\nAuthority and its subsidiaries for anything done in good faith or intended to be done under this Act or any\nrule or regulation made thereunder."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Sums payable to the Authority to be recoverable as land revenue.",
      "content": "_(1) All sums payable\nto the Authority in accordance with the provisions of this Act and the rules or regulations shall be\nrecoverable as arrears of land revenue."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Act to override other laws",
      "content": "_(1) The provisions of this Act shall have effect notwithstanding\nanything to the contrary contained in any other law for the time being in force and any such law shall, to\n1           39. Jurisdiction Barred.___(1) Notwithstanding anything contained in any other law, the powers\nand functions of the Authority relates to the national security of the Pakistan and therefore shall not be\ncalled into question through any criminal or civil proceedings or otherwise by any agency. Save as\nprovided under this Act, no order made or proceeding taken under this Act, rules or regulations made\nthereunder by the Authority or any officer or Authority authorized by it shall be called in question in any\ncourt or administrative tribunal and no injunction shall be granted by such court or tribunal in respect of\nany decision made or proceedings taken in pursuance of any power conferred by or under this Act, rules\nor regulations made thereunder."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Removal of difficulties",
      "content": "_(1) If any difficulty arises in giving effect to any of the provisions\nof the Act, the Federal Government may, within one year of the commencement of this Act, make such\norder, not in-consistent with the provisions of this Act, as may appear to it to be necessary or expedient\nfor the purpose of removing such difficulty."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Repeal and savings",
      "content": "_(1) The Special Technology Zones Authority Ordinance, 2020\nhereinafter referred to as the repealed Ordinance is hereby repealed.\n(2) Notwithstanding the repeal of the repealed Ordinance or anything contained herein-before, all\norders made, decisions taken, rules or regulations made or amended, notifications issued, actions taken,\nappointments made by the Authority, the Prime Minister or the President of the Board, and the Board,\npursuant to the repealed Ordinance, shall be deemed always to have been lawfully and validly made, taken,\nor issued under the provisions of this Act, shall continue to be in force unless amended, varied, withdrawn,\nrescinded or annulled by a person or authority competent to do so under this Act, and shall not be called\nin question before any Court of Law.\n(3) All assets, rights, powers, authorities and privileges and all property, cash and bank balances\nreserve funds, investment and all other interests and rights in or arising out of such property and all debts,\nliabilities and obligations of whatever kind of the former Authority subsisting immediately before its\ndissolution shall stand transferred to and vest in Authority constituted under this Act.\n(4) Notwithstanding anything contained in this Act or any other law for the time being in force or\nin any agreement, deed, document, or other instrument all officers, consultants, advisers, auditors and\nother employees and staff of the former Authority shall stand transferred to and be officers, consultants,\nadvisers, auditors and employees and staff of Authority:\nProvided that the Chairperson and Members of the Authority on the date hereof shall be deemed\nto be the Chairperson and Members of the Authority.\n(5) The persons mentioned herein-above shall be deemed to have been appointed or engaged by\nAuthority in accordance with the same terms and conditions of service as were applicable to them,\nimmediately before such continuance in office or transfer:\nProvided that the civil servants appointed to or working in the former Authority shall upon their\ntransfer to the Authority continue to be governed by the federal civil servants laws and rules made\nthereunder;\n(6) All debts and obligations incurred, or contracts entered into, rights acquired, and all matters\nand things engaged to be done by, with or for the former Authority shall be deemed to have been incurred\nentered into acquired or engaged to be done by, with or for the Authority.\n(7) All suits and other legal proceedings instituted by or against the former Authority before its\nrepeal shall be deemed to be suits and proceedings by or against the Authority and shall be proceeded or\notherwise dealt with accordingly.\n(8) All actions taken by the Board, the Authority, Chairperson, Members, the officers and\nemployees of the Authority between the lapse of the Ordinance and enactment are saved and not legally\nchallengeable.\n(9) Any reference to the former Authority in any statutory instrument or document shall, unless\nthe context otherwise requires, be read and construed as reference to be Authority.\n_____________\nRGN Date: 01-07-2025"
    }
  ],
  "definitions": [
    {
      "term": "Administrator",
      "definition": "the Administrator as described under section 26;",
      "source_provision": "sec2"
    },
    {
      "term": "Authority",
      "definition": "the Special Technology Zones Authority established under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of Governors constituted under section 6;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairperson",
      "definition": "the Chairperson of the Authority appointed by the Prime Minister, pursuant to the provisions of this Act, who is entrusted with whole or substantially whole of the powers of the management of affairs of the Authority in accordance with the Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Capital Goods",
      "definition": "the goods including but not limited to materials, plant, machinery, hardware, equipment and software, devices, instruments, accessories, attachments, building materials, materials and any other equipment required to perform functions of the Authority, zones, zone developers and zone enterprises, whether or not manufactured locally, for use in the zones, set up under the Special Technology Zones Authority Act, 202l;",
      "source_provision": "sec2"
    },
    {
      "term": "co-zone developer",
      "definition": "a Partner of the zone developer for the establishment, development, operation or management of zone;",
      "source_provision": "sec2"
    },
    {
      "term": "Division Concerned",
      "definition": "the Cabinet Division;",
      "source_provision": "sec2"
    },
    {
      "term": "Development Agreement",
      "definition": "a duly approved agreement between Authority and a zone developer, agreed to and endorsed by the Approvals Committee that authorizes zone developer to develop and establish a zone or a part thereof;",
      "source_provision": "sec2"
    },
    {
      "term": "Master Plan",
      "definition": "an overarching planning document providing conceptual, spatial, landscape, infrastructure, facilities etc. plan, which is used to structure the land and development of infrastructure and facilities for facilitating the smooth functioning of the zones;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "Member of the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "One Window Facility",
      "definition": "a physical or an information and communication technology (ICT) facility, comprising of relevant entities of Federal, Provincial or Local Governments, for facilitation of the zone developer and zone enterprises to lodge standardized information and documents with a single-entry point to fulfill development, execution, operations, functioning and management of zones;",
      "source_provision": "sec2"
    },
    {
      "term": "Person",
      "definition": "any registered association of persons, consortium, a body corporate formed or incorporated by or under any law in force, company, corporation, society, modaraba, Real Estate Investment Trust (REIT), Government, trust, partnership, or any juridical personality and includes the zone developer and zone enterprise;",
      "source_provision": "sec2"
    },
    {
      "term": "Prescribed",
      "definition": "prescribed by rules or regulations made and notified under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Regulations",
      "definition": "regulations prescribed under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Research and Development",
      "definition": "regular activities carried out with the purpose of obtaining new knowledge that shall enable the development of science and technology or creating new equipment, systems, products, services, processes, applications, and tools etc., using the available information and resources, including training and development, software production or improving those that are available;",
      "source_provision": "sec2"
    },
    {
      "term": "Rules",
      "definition": "rules prescribed under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Special Technology Zones Appellate Tribunal",
      "definition": "the Special Technology Zones Appellate Tribunal constituted under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Technology Sector",
      "definition": "one or more technology sectors prescribed by the Authority under the rules;",
      "source_provision": "sec2"
    },
    {
      "term": "zone developer",
      "definition": "a public, private or a public-private Person responsible for development, operation or management of the whole, or a part of the whole special technology zone, and licensed by the Authority as such, and includes a co- zone developer;",
      "source_provision": "sec2"
    },
    {
      "term": "zone enterprise",
      "definition": "any public, private, or public-private Person developing, operating and managing a technological enterprise within the zone and licensed as such by the Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "zone",
      "definition": "a particular type or class of zone, which may be geographical or virtual, new or existing or expansion of an existing zone, as approved and notified by the Authority under the rules, including, but not limited to special technology zones, information technology parks, high-tech industrial areas, software technology parks, hardware technology parks, technology export zones, free technology zones, science and technology parks, information technology zones, science and technology zones, R&D zones, opportunity zones, innovation zones, technology development zones, knowledge parks, smart cities, knowledge cities, technology incubation zones or any sector zones, which are developed for the development, promotion and proliferation of technology, particularly all the latest cutting edge technologies and may require technological intervention such as biotech, chemical technologies, agritech, fintech, robotics, nanotech, edtech, etc. and other zones with any combination or combinations of the aforesaid fields.",
      "source_provision": "sec2"
    }
  ]
}
