{
  "id": "pk-stage-carriages-act-1861",
  "type": "statute",
  "title": "Stage-Carriages Act, 1861",
  "title_en": "Stage-Carriages Act, 1861",
  "short_name": "Stage-Carriages Act, 1861",
  "status": "in_force",
  "issued_date": "1861-07-06",
  "in_force_date": "1861-07-06",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apo%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Stage-Carriages Act, 1861 (XVI of 1861) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Definition of stage",
      "content": "carriage. Every carriage drawn by one or more 4horses which shall\nordinarily be used for the purpose of conveying passengers for hire to or from any place in\n5\n[Pakistan] shall, without regard to the form or construction of such carriage, be deemed to be a\nstage-carriage within the meaning of this Act:\n6\n[*      *             *             *                 *             *            *]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Carriage to be licensed. No carriage shall be used as a stage",
      "content": "carriage unless licensed by a\n7\nMagistrate 8* * *."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Power to refuse license. The Magistrate 9[* * *] to whom the application for a license of",
      "content": "stage-carriage is made may refuse to license the same if he shall be of opinion that such stage-\ncarriage is unserviceable or is unsafe or unfit for public accommodation or use.\nParticulars of license. If a Magistrate 9[* * *] as aforesaid shall grant a license, the license\nshall set forth the number thereof, the name and residence of the proprietor of the stage-carriage, the\nplace at which his head office is held, the largest number of passengers and the greatest weight of\nluggage to be carried in or on such carriage, the number of horses by which such carriage is to be\ndrawn, and the name of the place at which such carriage is licensed."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Charge for and duration of license. 10[For every such license there shall be paid by the",
      "content": "proprietor of the stage-carriage the sum of five rupees or such less sum as the 11[Provincial\nGovernment] may fix, and such license shall be in force for one year from the date thereof.]\n1\nShort title given by the Short Titles Act, 1897 (14 of 1897).\nCf. “The Stage-Carriages Act, 1832” (2.& 3 Wm IV, c. 120); “The London Hackney Carriages Act, 1833” (3 & 4 Wm. IV, c. 48); “The Railway\nPassenger Duty Act, 1842” (5 & 6 Vict., c. 79) ; “The Railway Passenger Duty Act 1847” (10 &11 Vict.,c.42); “The Excise Act, 1848” (11 & 12\nVict.,c.118), s. 2:\nThis Act as amended by the Stage-Carriages Act (1861) Amendment Act 1898 (1 of 1898), has been declared to apply to all the Provinces and the\nCapital of the Federation, but not so as to supersede or contravene provisions of local laws dealing with the same subject-see s. 22. For local laws, see\nIt has been declared in force in Baluchistan under s. 3 of the British Baluchistan Laws ResuIation, 1913 (2 of 1913).\n2\nThe Act has been declared in force in British Baluchistan by Baluchistan Regulation II of 1913, s. 3.\nIt has also been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950); and applied in the\nFederated Areas of Baluchistan, see Gaz. of India, 1937, Pt. l, p. 1499.\nThis Act has been repealed to the extent of Islamabad Capital Territory, see Ordinance: No. 27 of 1981, s. 4 and 3rd sch.\n3\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960) s. 3. and 2nd Sch. (with effect from the 14th October, 1955), for\" the\nProvinces and the Capital of the Federation\" which was subs. for\" British India\" by A. O. 1949, Arts. 3 (2) and 4.\n4\nAll expressions and provisions in this Act applied to horses, also apply to all other animals employed in drawing stage-carriages, see section 21, infra.\n5\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2nd Sch. (with effect from the 14th October, 1955), for “the\nProvinces and the Capital of the Federation” which was subs. for “British India” by A.O., 1949, Arts. 3(2) and 4.\n6\nProviso to s.1 which read:- “Provided that this Act shall not apply to carriages not ordinarily used for journeys of a greater distance than twenty miles”\nrep. by s.2 of the Stage- Carriages Act, (1861) Amendment Act, 1898 (1 of 1898)\n7\nFor definition of “Magistrate” , see s. 21, infra.\n8\nThe words “or by the *Commissioner of Police of a Presidency-town” rep. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s.\n3 and II Sch. The word “Chief” was previously rep. by the Repealing and Amending Act, 1914 (10 of 1914), s. 3 and Sch. II.\n9\nThe words “or *Commissioner of Police” rep. by Act 26 of 1951, s. 3 and Sch. II. The word “Chief” was previously rep. by Act 10 of 1914, s. 3 and\nSch. II.\n10\nSubs. by Act 1 of 1898, s. 3, for the original paragraph.\n11\nSubs, by A.O., 1937, for “L.G”.\nWhen a licensed stage-carriage is transferred to a new proprietor within the year, the name of\nsuch new proprietor shall, on application to that effect, be substituted in the license for the name of\nthe former proprietor without any further payment for that year; and every person who appears by the\nlicense to be the proprietor shall be deemed to be such proprietor for all the purposes of this Act."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Particulars to be painted on conspicuous part of carriage. On any stage",
      "content": "carriage being\nlicensed the proprietor there of shall cause the number of the license and all the other particulars of\nsuch stage-carriage."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Penalty for letting carriage without having particulars painted. The proprietor of any",
      "content": "licensed stage-carriage who shall let such stage-carriage for hire without the particulars specified in\nsection 3 being painted on such carriage in the manner directed in the last preceding section shall be\nliable to a fine not exceeding one hundred rupees."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Penalty for letting for hire unlicensed carriage. Whoever lets for hire any stage",
      "content": "carriage\nwithout the same being licensed as provided by this Act, shall be liable, on a first conviction, to a\nfine not exceeding one hundred rupees, and on any subsequent conviction, to a fine which may\nextend to five hundred rupees."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Penalty for allowing carriage to be drawn by fewer animals or more passengers, etc.,",
      "content": "to be carried than provided by license. Any proprietor, or agent of a proprietor, or any driver of a\nlicensed stage-carriage, who knowingly permits such carriage to be drawn by a less number of\nhorses, or who knowingly permits a larger number of passengers, or a greater weight of luggage, to\nbe carried by such stage-carriage than shall be provided by the license, shall be liable on a first\nconviction to a fine not exceeding one hundred rupees, and on any subsequent conviction, to a fine\nwhich may extend to five hundred rupees.\nIn every case where such stage-carriage shall be proved to have been drawn by a less number\nof horses, or to have carried a larger number of passengers or a greater weight of luggage, than shall\nbe provided by the license, the proprietor of such carriage shall be held to have knowingly permitted\nsuch offence, unless he shall prove that the offence was not committed with his connivance, and that\nhe had taken every reasonable precaution and had made reasonable provision to prevent the\ncommission of the offence."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Penalty for ill",
      "content": "treating animals. Any person who shall cruelly beat, ill-treat, over-drive,\nabuse, torture or cause or procure to be cruelly beaten, ill-treated, over-driven, abused or tortured,\nany horse employed in drawing or harnessed to any stage-carriage, or who shall harness to or drive in\nany stage-carriage any horse which from sickness, age, wounds or other cause is unfit to be driven in\nsuch stage-carriage, shall for every such offence be liable to a fine not exceeding one hundred\nrupees."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Revocations of license. Any Magistrate 1[* * *] within the local limits of whose",
      "content": "jurisdiction any stage-carriage shall ply, or who has granted the license of any stage-carriage may\ncancel the license of such stage-carriage if it shall appear to him that such stage-carriage or any horse\nor any harness used with such carriage is unserviceable or unsafe or otherwise unfit for public\naccommodation or use.\n1\nThe words “or*Commissioner of Police” omitted by A. O., 1949, Sch.\nThe word “Chief” was previously rep. by the Repealing and Amending Act, 1914 (10 of 1914), s. 3 and Sch. II."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Penalty for not conforming to provisions of section 5. In any station or place in which",
      "content": "a Magistrate shall reside and be, any police-officer may, in any place within two miles of the office\nof such Magistrate, seize any stage-carriage with the horse harnessed thereto, if the full particulars of\nthe license of such stage carriage be not distinctly painted on such stage-carriage in the manner\nprovided in section 5 of this Act.\nSuch carriage with the horse harnessed thereto shall be taken without delay by such police-\nofficer before such Magistrate, who shall forthwith proceed to hear and determine the complaint of\nsuch police-officer; and, if there upon any fine is imposed by such Magistrate and such fine is paid,\nsuch stage-carriage and horse shall be immediately released; and if such fine be not paid, such stage-\ncarriage and horse may be detained for twenty days as security for the payment thereof; and if the\nfine be not sooner paid, they may be sold and the proceeds applied (so far as they extend) to the\npayment of the said fine, and all costs and charges incurred on account of the detention and sale; and\nthe surplus (if any), when claimed, shall be paid to the proprietor of such carriage and horse; and if\nsuch surplus be not claimed within a further period of two months from such sale, the same shall be\nforfeited to the State.\nIf the proceeds of such sale do not fully pay the fine and costs and charges aforesaid, the\nbalance may be recovered as hereinafter provided."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Penalty for misconduct on part of drivers. If any driver of any stage",
      "content": "carriage, or any\nother person having the care thereof, shall, through intoxication, neglect or by wanton or furious\ndriving or by any other misconduct, endanger the safety of any passenger or other person, or shall\ninjure or endanger the property of the proprietor of such stage-carriage or of any other person, every\nsuch person so offending shall be liable to a fine not exceeding one hundred rupees."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Penalty when recoverable from proprietor. Whenever the driver of any stage",
      "content": "carriage\nor the owner of any horse employed in drawing any stage-carriage shall have committed any offence\nagainst this Act for the commission whereof any penalty is by this Act imposed, other than an\noffence specified in section 8, and such driver or owner shall not be known, or being known cannot\nbe found, or if the penalty cannot be recovered from such driver or owner, the proprietor of such\ncarriage shall be liable to every such penalty as if he had been the driver of such carriage or owner of\nsuch horse at the time when such offence was committed :\nProviso. Provided that if any such proprietor shall make out, to the satisfaction of the\nMagistrate before whom any complaint or information shall be heard, by sufficient evidence, that the\noffence was committed by such driver or owner without the privity or knowledge of such proprietor,\nand that no profit, advantage or benefit, either directly or indirectly, has accrued or can accrue to\nsuch proprietor therefrom, and that he has used his endeavor to find out such driver or owner, and\nhas done all that was in his power to recover the amount of the penalty from him, the Magistrate may\ndischarge the proprietor from such penalty, and shall levy the same upon such driver or owner when\nfound."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Issue of summons. Whenever any charge is made before any magistrate of any offence",
      "content": "under this Act on which it is necessary to issue a summons to the proprietor of a stage-carriage, the\nMagistrate shall issue such summons directed to such proprietor or his nearest agent, and may\ntransmit such summons by letter-post, which shall be deemed to be good service thereof.\nThe letter shall be registered at the post-office, and the cost of the registration shall be borne\nby the Government in the first instance, but may be charged as costs in the case.\nThe summons shall allow a reasonable time, in reference to the distance to which the\nsummons is sent, for the appearance of such proprietor or his agent as aforesaid."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Adjudication of penalties. All penalties incurred under this Act shall be adjudged by",
      "content": "Adjudication a Magistrate 1[* * *] as aforesaid, and all orders made under of penalties this Act by\nsuch Magistrate 1[* * *] shall be final."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Recovery of penalties, etc. All penalties imposed under this Act, or any balance of any",
      "content": "fine, costs or charges as mentioned in section 11 of this Act, may in case of non-payment or non-\nrecovery thereof be levied by distress and sale of the moveable property of the offender by warrant\nunder the hand of the Magistrate who imposed the same."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Offender may be apprehended and detained in custody until return of warrant of",
      "content": "distress. In case any such penalties shall not be forthwith paid, such Magistrate may order the\noffender to be apprehended and detained in safe custody until the return can be conveniently made to\nsuch warrant of distress, unless the offender shall give security to the satisfaction of such Magistrate\nfor his appearance at such place and time as shall be appointed for the return of the warrant of\ndistress."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Imprisonment of offender if distress not sufficient. If upon the return of such warrant it",
      "content": "shall appear that no sufficient distress can be had whereon to levy such penalty, and the same shall\nnot be forthwith paid, or in case it shall appear to the satisfaction of such Magistrate by the\nconfession of the offender or otherwise that he has not sufficient goods and chattels whereupon such\npenalty could be levied if warrant of distress were issued, such Magistrate may, by warrant under his\nhand, commit the offender, 2[* * *] to prison, there to be imprisoned, according to the discretion of\nsuch officer, for any term not exceeding two calendar months when the amount of penalty shall not\nexceed fifty rupees, and for any term not exceeding four calendar months when the amount shall not\nexceed one hundred rupees, and for any term not exceeding six calendar months in any other case,\nthe commitment to be determinable in each of the cases aforesaid on payment of the amount."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. [Recovery of penalty and cost from European British subjects.] Omitted by A. O.,1961,",
      "content": "Art. 2 and Sch. (with effect from the 23rd March, 1956)."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Jurisdiction. On complaint made before any Magistrate of any offence committed under",
      "content": "this Act, it shall not be necessary to prove that the offence was committed within the local limits of\nsuch Magistrate or other officer.\n1\nThe words “or *Commissioner of Police” omitted by A. O., 1949, Sch. The word “'Chief” was previously rep. by the Repealing and Amending Act\n1914 (10 of 1914), s. 3 and Sch. ll.\n2\nThe original words “provided he is not a European British subject” omitted by A. O., 1961, Art. 2 and Sch. (with effect from the 23rd March, 1956).\n1\n[20A. Power to make rules.––(1) The 2[Provincial Government] may, by notification in the\nofficial Gazette, make 3rules to carry out the purposes and objects of this Act in the territories under\nits administration or any part of the said territories.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules\nmay––\n(a)        prescribe forms for licenses under this Act, the sums payable for the same and\nthe conditions on which they may be granted, and the cases in which they may\nbe revoked ;\n(b)        provide for the inspection of stage-carriages, and of the animals Employed in\ndrawing them; and\n(c)        regulate the number and length of the stages for which animals may be driven\nin stage-carriages and the manner in which they shall be harnessed and yoked.\n(3) In making any rule under this section, the 2[Provincial Government] may direct that a\nbreach thereof shall be punishable with fine which may extend to one hundred rupees.]"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Interpretation",
      "content": "clause “Magistrate.” The term “Magistrate” in this Act shall include all\nMagistrates and other persons exercising the powers of a 4Magistrate:\n5\n[*     *          *          *          *          *          *]\nAct applicable to all animals used for drawing-carriages. 6[ All expressions and\nprovisions which in this Act are applied to horses shall also apply to all other animals employed in\ndrawing any carriage ordinarily used for the purpose of conveying passengers for hire to or from any\nplace in 7[Pakistan] :]\n8\n[*     *          *          *          *          *          *]\n9\n[22. Extent of Act. This Act, as amended by subsequent Acts, extends to 10[the whole of\nPakistan]; but it shall not apply to carriages ordinarily plying for hire within the limits of any\nmunicipality or cantonment or other place in which any law for the regulation of carriages is for the\ntime being in force."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Power to Provincial Government to exempt. The 2[Provincial Government] may, by",
      "content": "notifications in the official Gazette, exempt any carriages or class of carriages from all or any of the\nprovisions of this Act.]\nDate: 13-09-2024\n1\nIns. by the Stage-Carriages Act (1861) Amendment Act, 1898 (1 of 1898), section 4.\n2\nSubs. by A. O., 1937, for “L. G.”.\n3\nFor rules under section 20A see different Local Rules and Orders.\n4\nAs to officers exercising the powers of a Magistrate, see s. 3 (2) of the Code of Criminal Procedure, 1898 (Act 5 of 1898).\n5\n6\nSubs. by s. 1 of the Stage-Carriages Act (1861) Amendment Act, 1876(16 of 1876), for the original third clause.\n7\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “the\nProvinces and the Capital of the Federation” which was subs. for “British India” by A. O., 1949, Arts. 3(2) and 4.\n8\nThe clauses relating to “number” and “gender” rep. by the Repealing and Amending Act, 1914 (10 of 1914).s. 3 and Sch. II.\n9\nSs. 22 and 23 were added by s. 5 of the Stage Carriages Act (1861) Amendment Act, 1898 (1 of 1898). The original s. 22 regarding the com-\nmencement of this Act as originally passed was rep. by the Repealing Act, 1870 (14 of 1870).\n10\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2nd Sch. (with effect from the 14th October, 1955), for “all the\nProvinces and the Capital of the Federation” which was previously subs. for the whole of British India” by A. O., 1949 Arts. 3(2) and 4."
    }
  ],
  "definitions": []
}
