{
  "id": "pk-stamp-act-1899",
  "type": "statute",
  "title": "Stamp Act, 1899",
  "title_en": "Stamp Act, 1899",
  "short_name": "Stamp Act, 1899",
  "status": "in_force",
  "issued_date": "1899-01-26",
  "in_force_date": "1899-01-26",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cpg%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Stamp Act, 1899 (II of 1899) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the 2* Stamp Act,\n1899.\n3\n[(2) It extends to the whole of Pakistan.]\n(3) It shall come into force on the first day of July 1899."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is something repugnant in the subject or context, -\n(1) “Banker” “banker” includes a bank and any person acting as a banker:\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1897, Pt. V,p.175; for Report of the Select Committee, see ibid., 1898, pt. V,p, 231 ; and\nfor Proceedings in Council, see ibid., 1898, Pt. VI, pp. 10 and 278; and ibid., 1899, Pt. VI, p. 5.\nThe Act has been amended in its application to:—\n(1)    Bombay, by the Bombay Finance Act, 1932 (Bom. 2 of 1932), as amended by Bombay Acts 1 of 1935 and 3 of 1936 ;\n(2)    the Punjab and the N.W.F.P., by the Indian Stamp (Punjab Amendment) Act, 1922 (Punjab 8 of 1922), the Indian Stamp\n(Punjab Amendment) Act, 1924               (Punjab 1 of 1924) and the Indian Stamp (N.W.F.P. Amendment) Act, 1948 (N.W.F.P. Act\n15 of 1948) : see also the Punjab Stamp (Amendment) Act, 1935 (Punjab 1 of 1935), the Punjab Act 14 of 1948, s. 2 and Act 11 of\n1949, s. 2. applying only to the Punjab;\n(3)    Sind, by the Indian Stamp (Sind Amendment) Act, 1938 (Sind 12 of 1938);\n(4)    Capital of the Federation, by the Finance Act, 1952 (4 of 1952) ; and\n(5)    the Province of West Pakistan (except the Capital of the Federation) by West Pakistan Act No. 16 of 1957,s. 3 (3)and3rd\nSch.(w.e.f. 14-10-55).\nIt has been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.W.F.P., subject to certain\nmodifications, and extended to the Excluded Area of Upper Tanawal (N.W.F.P.) other than Phulera with effect from such date and subject to such\nmodifications as may be notified, see N.W.F.P. (Upper Tanawal Excluded Area) Laws Regulation, 1950.\nThis Act and all rules, notifications, declarations and orders made under it which were in force immediately before the first day of April, 1952, have\nbeen extended to and brought into force in the State of Bahawalpur, see the Bahawalpur (Extension of Laws) Order, 1952 (G.G.O. 2 of 1952), Art. 2.\nIt has been extended to Khairpur State, see the Khairpur (Federal Laws) (Second Extension) Order, 1953 (G.G.O. 14 of 1953).\nIt has also been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950); and applied in\nthe Federated Areas of Baluchistan, see Gazette of India, 1937, Pt. I, p. 1499.\nIt has also been extended to the Baluchistan States Union, see G.G.O. 18 of 1953.\nThis Act has been amended in its application to the Province of West Pakistan by W. Pak. Ord. 46 of 1959 (with effect from the 15th August, 1959).\nIt has also been amended in its application to the Province of Punjab by Punjab Act XXVI of 1973, s. 2.\nThe Act, as in force in the North-West Frontier Province immediately before the commencement of N.W.F.P., Regulation No II of 1974, has been\napplied to the Provincially Administered Tribal Areas of Chitral, Dir, Kalam, Swat and Malakand Protected Area, by N.W.F.P. Regulation No. II of\n1974, s. 3.\nIt has also been amended in its application to the Province of Sind by Sind Act XV of 1975, s. 3.\nThis Act has been amended to the extent of Islamabad Capital Territory see, Ordinance No. XXVII of 1981, s. 5 and 4th Sch.\nThis Act has also been amended in its application to the Province of N.W.F.P. by (1) N.W.F.P. Act VII of 1977. (2) N.W.F.P. Ord. VII of 1976 (3)\nN.W.F.P. Ord. III of 1977. (4) N.W.F.P. Ord. XII of 1977. (5) N.W.F.P. Ord. XVII of 1981.\nThis Act has further been amended in its application to the Province of Baluchistan by Baluchistan Ord. XIV of 1983.\nThis Act has also been amended in its application to the Province of Punjab by Punjab Ord. 1 of 1984 and Ordinance XXXVII of 1984.\nThis Act has also been amended in its application to the Province of Sind by Ordinance No. XVI of 1981 and Sind XXX of 1984.\nIt has further been amended in its application to the Province of West Pakistan by W. Pak. Act No. II of 1964, s. 2 (w.e.f. to be notified later on).\n2\nThe word “Indian” omitted by A.O., 1949, Sch.\n3\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (Ordinance No. XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October,\n1955), for sub-section (2) as amended by the Repealing and Amending Act, 1914 (Act No. X of 1914), s. 3 and II Sch., A.O., 1949, Sch. and the\nFederal Laws (Revision and Declaration) Act, 1951 (Act No. XXVI of 1951), s. 8.\n(2) “Bill of exchange”. “bill of exchange” means a bill of exchange as defined by the\nNegotiable Instruments Act, 1881 (XXVI of 1881), and includes also hundi, and any other document\nentitling or purporting to entitle any person, whether named therein or not, to payment by any other\nperson of, or to draw upon any other person for, any sum of money:\n(3) “Bill of exchange payable on demand”. “bill of exchange payable on demand”\nincludes—\n(a)     an order for the payment of any sum of money by a bill of exchange or\npromissory note, or for the delivery of any bill of exchange or promissory note\nin satisfaction of any sum of money, or for the payment of any sum of money\nout of any particular fund which may or may not be available, or upon any\ncondition or contingency which may or may not be performed or happen;\n(b)        an order for the payment of any sum of money weekly monthly or at any other\nstated periods; and\n(c)        a letter of credit, that is to say, any instrument by which one person authorises\nanother to give credit to the person in whose favour it is drawn :\n(4) “Bill of lading”. “bill of lading” includes a “through bill of lading,” but does not include\na mate’s receipt:\n(5) Bond. “ bond” includes—\n(a)        any instrument whereby a person obliges himself to pay money to another, on\ncondition that the obligation shall be void if a specified act is performed, or is\nnot performed, as the case may be ;\n(b)        any instrument attested by a witness and not payable to order or bearer,\nwhereby a person obliges himself to pay money to another; and\n(c)        any instrument so attested, whereby a person obliges himself to deliver grain\nor other agricultural produce to another:\n(6) “Chargeable.” “chargeable” means, as applied to an instrument executed or first\nexecuted after the commencement of this Act, chargeable under this Act, and, is applied to any other\ninstrument, chargeable under the law in force in 1[Pakistan] when such instrument was executed or,\nwhere several persons executed the instrument at different times, first executed:\n(7) “Cheque”. “cheque” means a bill of exchange drawn on a specified banker and not\nexpressed to be payable otherwise than on demand:\n2\n[*                *                      *                      *                     *                 *                  *]\n(9) “Collector”. “Collector”—\n3\n[(a)      means the Collector of a district; and]\n(b)        includes a Deputy Commissioner and any officer whom 4[the Provincial\nGovernment] may, by notification in the official Gazette, appoint in this\nbehalf:\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (Ordinance No. XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October,\n1955), for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, Arts. 3(2) and 4, for “British India”.\n2\nCl. (8) defining “Chief Controlling Revenue-authority”., rep. by A.O., 1937 : see now definition in s. 3 (9a) of the General Clauses Act, 1897 (Act No.\nX of 1897).\n3\nSubs. by A.O., 1949, Sch., for the original sub-clause (a).\n4\nThe Original words “the L.G.” were first subs. by A.O., 1937, and then amended by A.O., 1964, Art. 2 and Sch. (with effect from the 27th May, 1964),\nto read as above.\n(10) “Conveyance”. “conveyance” includes a conveyance on sale and every instrument by\nwhich property, whether moveable or immoveable, is transferred inter vivos and which is not\notherwise specifically provided for by Schedule I :\n[(11) “Duly stamped” means affixation of an adhesive or impressed stamp or e-stamp of not\n1\nless than the requisite amount and that the stamp has been legally affixed, used or electronically\ngenerated,]\n[(11A) “e-stamp” means a paper printed or partially printed containing a bar code or having\n1\nany of its unique identification code and such other information, as may be specified by the rules, to\nbe generated and printed, on deposit of money equivalent to chargeable stamp duty in the account of\nthe Government.]\n(12) “executed and “execution”. “executed” and “execution”, used with reference to\ninstruments, mean “signed” and ”signature” :\n2\n[*                *                     *                     *                     *                     *                 *]\n1\n[(13) “impressed stamp” includes—\n(a)        the label affixed and impressed by the proper officer;\n(b)        the stamp embossed or engraved on a stamp paper; and\n(c)        e-stamp];\n(14) “Instrument”. “instrument” includes every document by which any right or liability is,\nor purports to be, created, transferred, limited, extended, extinguished or recorded 1[and includes any\ninstrument executed in electronic form.]\n(15) “Instrument of partition”. “instrument of partition” means any instrument whereby co-\nowners of any property divide or agree to divide such property in severalty, and includes also a final\norder for effecting a partition passed by any Revenue authority or any Civil Court and an award by\nan arbitrator directing a partition:\n(16) “Lease”. “lease” means a lease of immoveable property, and includes also—\n(a)        a patta;\n(b)        a kabuliyat or other undertaking in writing, not being a counter-part of a lease,\nto cultivate, occupy or pay or deliver rent for, immoveable property;\n(c)        any instrument by which tolls of any description are let;\n(d)        any writing on an application for a lease intended to signify that the\napplication is granted;\n[(16A) “Marketable security”. “marketable security” means a security of such a\n3\ndescription as to be capable of being sold in any stock market in 4[Pakistan] 5[* * * *:]\n1\nSubs. & Ins. by Finance Act, 2021 (Act No. VIII of 2021), s.2.\n2\nCl. (12A) defining “Collecting Government” ins. by A.O., 1937, and subsequently amended by A.O., 1961, Art. 2 and Sch., has been omitted by A.O.,\n1964, Art, 2 and Sch.\n3\nCI. (16A) ins. by the Indian Stamp (Amdt.) Act, 1904 (Act No. XV of 1904), s. 2.\n4\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (Ordinance No. XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October,\n1955), for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, Arts. 3(2) and 4, for “British India”.\n5\nThe words “or in the United Kingdom” have been omitted (only to the extent of Islamabad Capital Territory) by the Federal Laws (Revision and\nDeclaration, Ordinance, 1981 (Ordinance No. XVII of 1981) s. 5 and Sch. IV.\n(17) “Mortgage-deed”. “ mortgage-deed” includes every instrument whereby, for the\npurpose of securing money advanced, or to be advanced, by way of loan, or an existing or future\ndebt, or the performance of an engagement, one person transfers, or creates, to or in favour of,\nanother, a right over or in respect of specified property:\n(18) “Paper”. “paper” includes vellum, parchment or any other material on which an\ninstrument may be written:\n(19) “Policy of insurance”. “ policy of insurance” includes—\n(a)        any instrument by which one person, in consideration of a premium, engages\nto indemnify another against loss, damage or liability arising from an\nunknown or contingent event;\n(b)        a life-policy, and any policy insuring any person against accident or sickness,\nand any other personal insurance: 1[*]\n1\n[*                *                     *                     *                     *        *   *]\n(20) “Policy of sea-insurance” or “see-policy”.___ “policy of sea-insurance” or “sea-\npolicy”—\n(a)        means any insurance made upon any ship or vessel (whether for marine or\ninland navigation), or upon the machinery, tackle or furniture of any ship or\nvessel, or upon any goods, merchandise or property of any description\nwhatever on board of any ship or vessel, or upon the freight of, or any other\ninterest which may be lawfully insured in, or relating to, any ship or vessel;\nand\n(b)        includes any insurance of goods, merchandise or property for any transit\nwhich includes, not only a sea risk within the meaning of clause (a), but also\nany other risk incidental to the transit insured from the commencement of the\ntransit to the ultimate destination covered by the insurance:\nWhere any person, in consideration of any sum of money paid or to be paid for additional\nfreight or otherwise, agrees to take upon himself any risk attending goods, merchandise or property\nof any description whatever while on board of any ship or vessel or engages to indemnify the owner\nof any such goods, merchandise or property from any risk, loss or damage, such agreement or\nengagement shall be deemed to be a contract for sea insurance :\n(21) “Power-of-attorney”. “power-of-attorney” includes any instrument (not chargeable\nwith a fee under the law relating to court fees for the time being in force) empowering a specified\nperson to act for and in the name of the person executing it :\n(22) “Promissory note”. “promissory note” means a promissory note as defined by the\nNegotiable Instruments Act, 1881 (XXVI of 1881);\nit also includes a note promising the payment of any sum of money out of any particular fund which\nmay or may not be available, or upon any condition or contingency which may or may not be\nperformed or happen:\n(23) “Receipt”. “receipt” includes any not, memorandum or writing—\n(a)        whereby any money, or any bill of exchange, cheque or promissory note is\nacknowledged to have been received, or\n(b)        whereby any other moveable property is acknowledged to have been received\nin satisfaction of a debt, or\n1\nThe word “and” and sub-clause (c) rep. by the Indian Stamp (Amdt.) Act, 1906 (Act No. V of 1906), s. 2.\n(c)       whereby any debt or demand, or any part of a debt or demand, is\nacknowledged to have been satisfied or discharged, or\n(d)       which signifies or imports any such acknowledgment, and whether the same is\nor is not signed with the name of any person: 1[*]\n(24) “Settlement”. “settlement” means any non-testamentary disposition, in writing, of\nmoveable or immoveable property made—\n(a)        in consideration of marriage,\n(b)       for the purpose of distributing property of the settler among his family or those\nfor whom he desires to provide, or for the purpose of providing for some\nperson dependent on him, or\n(c)       for any religious or charitable purpose;\nand includes an agreement in writing to make such a disposition 2[and, where\nany such disposition has not been made in writing, any instrument recording,\nwhether by way of declaration of trust or otherwise, the terms of any such\ndisposition] : 3[and\n(25) “Soldier”. “soldier” includes any person below the rank of non-commissioned officer\nwho is enrolled under the Indian Army Act 1911(VIII of 1911) 4[or the Pakistan Army Act, 1952\n(XXXIX of 1952)].] .\n______\nA.-Of the Liability of Instruments to Duty"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Instruments chargeable with duty",
      "content": "Subject to the provisions of this Act and the\nexemptions contained in Schedule I, the following instruments shall be chargeable with duty\nof the amount indicated in that schedule as the proper duty therefore respectively, that is to say–\n(a)       every instrument mentioned in that schedule which, not having been\npreviously executed by any person, is executed in 5[Pakistan] on or after the\nfirst day of July, 1899 ;\n(b)       every bill of exchange 6[payable otherwise than on demand] 7* or promissory\nnote drawn or made out of 5[Pakistan] on or after that day and accepted or\npaid, or presented for acceptance or payment, or endorsed, transferred or\notherwise negotiated, in 5[Pakistan] ; and\n1\nThe word “and” rep. by the Repealing and Amending Act, 1928 (Act No. XVIII of 1928).\n2\nIns. by the Indian Stamp (Amendment) Act, 1904 (Act No. XV of 1904), s. 2.\n3\nThe word “and” and cI. (25), ins. by Act,1928 (Act No. XVIII of 1928, s. 2 and Sch. I.\n4\nAdded by the Central Laws (Statute Reform) Ordinance, 1960 (Ordinance No. XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October,\n1955).\n5\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960, (Ordinance No. XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October,\n1955), for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, Arts. 3 (2) and 4, for “British India”.\n6\nIns. by the Indian Finance Act, 1927 (Act No. V of 1927), s. 5.\n7\nThe word “cheque” rep., ibid.\n(c)       every instrument (other than a bill of exchange 1[*] or promissory note)\nmentioned in that schedule, which, not having been previously executed by\nany person, is executed out of 2[Pakistan] on or after that day, relates to any\nproperty situate, or to any matter or thing done or to be done, in 2[Pakistan]\nand is received in 2[Pakistan] :\nProvided that no duty shall be chargeable in respect of—\n(1) any instrument executed by, or on behalf of, or in favour of, the 3[Government] in cases\nwhere, but for this exemption, the 3[Government] would be liable to pay the duty chargeable in\nrespect of such instrument;\n(2) Any instrument for the sale, transfer or other disposition, either absolutely or by way of\nmortgage or otherwise, of any ship or vessel, or any part, interest, share or property of or in any ship\nor vessel registered under the Merchant Shipping Act, 1894, or under Act XIX of 18384, or the\nRegistration of Ships Act, 1841 (57 & 58Vict.c. 60 X of 1841), as amended by subsequent Acts."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Several instruments used in single transaction of sale, mortgage or settlement",
      "content": "(1)\nWhere, in the case of any sale, mortgage or settlement, several instruments are employed for\ncompleting the transaction, the principal instrument only shall be chargeable with the duty prescribed\nin Schedule I, for the conveyance, mortgage or settlement, and each of the other instruments shall be\nchargeable with a duty of one rupee instead of the duty (if any) prescribed for it in that schedule.\n(2) The parties may determine for themselves which of the instruments so employed shall, for the\npurposes of sub-section (1), be deemed to be the principal instrument:\nProvided that the duty chargeable on the instrument so determined shall be the highest duty\nwhich would be chargeable in respect of any of the said instruments employed."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Instruments relating to several distinct matters",
      "content": "Any instrument comprising or\nrelating to several distinct matters shall be chargeable with the aggregate amount of the duties with\nwhich separate instruments, each comprising or relating to one of such matters, would be chargeable\nunder this Act."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Instruments coming within several descriptions in Schedule I",
      "content": "Subject to the\nprovisions of the last preceding section, an instrument so framed as to come within two or more of\nthe descriptions in Schedule I, shall, where the duties chargeable thereunder are different, be\nchargeable only with the highest of such duties:\nProvided that nothing in this Act contained shall render chargeable with duty exceeding one\nrupee a counterpart or duplicate of any instrument chargeable with duty and in respect of which the\nproper duty has been paid."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Policies of sea",
      "content": "insurance.— (1) No contract for sea-insurance (other than such insurance\nas is referred to in section 506 of the Merchant Shipping Act, 1894 (57 & 58Vict.c. 60) shall be valid\nunless the same is expressed in a sea- policy.\n1\nRepealed by the Indian Finance Act, 1927 (Act No. V of 1927), s. 5, The word “cheque”.\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960, (Ordinance No. XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October,\n1955), for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, Arts. 3 (2) and 4, for “British India”.\n3\nSubs. by A.O., 1961, Art. 2 (with effect from the 23rd March, 1956), for “Crown”.\n4\n(2) No sea-policy made for time shall be made for any time exceeding twelve months.\n(3) No sea-policy shall be valid unless it specifies the particular risk or adventure, or the time,\nfor which it is made, the names of the subscribers or under-writers, and the amount or amounts\ninsured.\n(4) Where any sea-insurance is made for or upon a voyage and also for time, or to extend to\nor cover any time beyond thirty days after the ship shall have arrived at her destination and been\nthere moored at anchor, the policy shall be charged with duty as a policy for or upon a voyage, and\nalso with duty as a policy for time."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Bonds, debentures or other securities, issued on loans under Act XI, 1879",
      "content": "(1)\nNotwithstanding anything in this Act, any local authority raising a loan under the provisions of the\n1\n[Local Authorities Loans Act, 1914 (IX of 1914)] or of any other law for the time being in force, by\nthe issue of bonds, debentures or other securities, shall, in-respect of such loan, be chargeable with a\nduty of 2[one per centum] on the total amount of the bonds, debentures or other securities issued by\nit, and such bonds, debentures or other securities need not be stamped, and shall not be chargeable\nwith any further duty on renewal, consolidation, sub-division or otherwise.\n(2) The provisions of sub-section (1) exempting certain bonds, debentures or other securities\nfrom being stamped and from being chargeable with certain further duty shall apply to the bonds,\ndebentures or other securities of all outstanding loans of the kind mentioned therein, and all such\nbonds, debentures or other securities shall be valid, whether the same are stamped or not:\n3\n[*                *                    *                    *                     *                    *                 *]\n(3) In the case of wilful neglect to pay the duty required by this section, the local authority\nshall be liable to forfeit to the Government a sum equal to ten per centum upon the amount of duty\npayable, and a like penalty for every month after the first month during which the neglect continues."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. 4[The Provincial Government] may, by rule or order published in the 5[official Gazette],–",
      "content": "(a)        Power to reduce, remit or compound duties. reduce or remit, whether\nprospectively or retrospectively, in the whole or any part of 6[the territories\nunder its administration], the duties with which any instruments or any\nparticular class of instruments, or any of the instruments belonging to such\nclass, or any instruments when executed by or in favour of any particular class\nof persons, or by or in favour of any members of such class, are chargeable,\nand\n(b)        provide for the composition or consolidation of duties in the case of\nissues by any incorporated company or other body corporate of debentures,\nbonds or other marketable securities.\n1\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ordinance No. XXVII of 1981) s. 5 and Sch. IV for “Local Authorities Loan\nAct, 1879”. (Only to the extent of Islamabad Capital Territory).\n2\nSubs. by the Indian Stamp (Amendment) Act, 1910 (Act No. VI of 1910), s. 2, for “eight annas per centum”.\n3\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ordinance No. XXVII of 1981) s. 5 and Sch. IV (Only to the extent of\nIslamabad Capital Territory).\n4\nThe original words “The G. G. in C.” were first subs. by A.O., 1937, and then amended by A.O., 1964, Art. 2 and Sch., to read as above.\n5\nSubs. by A. O., 1937, for “Gazette of India”.\n6\nSubs. ibid., for “British India”.\nB.-Of Stamps and the mode of using them"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Duties how to be paid",
      "content": "(1) Except as otherwise expressly provided in this Act, all\nduties with which any instruments are chargeable shall be paid, and such payment shall be indicated\non such instruments, by means of stamps 1[or e-stamps]—\n(a)        according to the provisions herein contained ; or\n(b)        when no such provision is applicable thereto-as the 2[Provincial Government]\nmay by rule direct.\n(2) The rules3 made under sub-section (1) may, among other matters, regulate,—\n(a)        in the case of each kind of instrument-the description of stamps 1[or e-stamps]\nwhich may be used;\n(b)        in the case of instruments stamped with impressed stamps-the number of\nstamps which may be used ;\n(c)        in the case of bills of exchange or promissory notes written in any Oriental\nlanguage___ the size of the paper on which they are written."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Use of adhesive stamps",
      "content": "The following instruments may be stamped with adhesive\nstamps, namely:—\n(a)        instruments chargeable with the duty of one anna 4[or half an anna], except\nparts of bills of exchange payable otherwise than on demand and drawn in sets\n;\n(b)        bills of exchange,5 * and promissory notes drawn or made out of 6[Pakistan];\n7\n(c)    entry as an advocate, vakil or attorney on the roll of a High Court;\n(d)        notarial acts ; and\n(e)        transfers by endorsement of shares in any incorporated company or other body\ncorporate."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Cancellation of adhesive stamps",
      "content": "(1) (a) Whoever affixes any adhesive stamp to any\ninstrument chargeable with duty which has been executed by any person shall, when affixing such\nstamp, cancel the same so that it cannot he used again; and\n(b) whoever executes any instrument on any paper bearing an adhesive stamp shall,\nat the time of execution, unless such stamp has been already cancelled in manner\naforesaid, cancel the same so that it cannot be used again.\n1\nIns. by the Finance Act,2021 (Act No. VIII of 2021), s.2.\n2\nSubs. by A. O., 1964, Art. 2 and Sch., for “Collecting Government” which had been subs. by A. O., 1937, for “G. G. in C.\"\n3\nSee the Indian Stamp Rules, 1925.\n4\nIns. by the Indian Stamp (Amendment) Act, 1906 (Act No. V of 1906), s. 3.\n5\nThe word “cheques” rep. by the Indian Finance Act, 1927 (Act No. V of 1927), s. 5.\n6\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (Ordinance No. XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955),\nfor “the Provinces and the Capital of the Federation” which had been subs. by A. O., 1949, Arts. 3(2) and 4, for “British India”.\n7\nAs to the enrolment of legal practitioners in the N.W.F.P., see the N.W.F.P. Law and Justice Regulation, 1901 (VII of 1901), s. 9.\n(2) Any instrument bearing an adhesive stamp which has not been cancelled so that it\ncannot be used again, shall, so far as such stamp is concerned, be deemed to be unstamped.\n(3) The person required by sub-section (1) to cancel an adhesive stamp may cancel it by\nwriting on or across the stamp his name or initials or the name or initials of his firm with the true\ndate of his so writing, or in any other effectual manner."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Instruments stamped with impressed stamps how to be written",
      "content": "Every instrument\nwritten upon paper stamped with an impressed stamp shall be written in such manner that the stamp\nmay appear on the face of the instrument and cannot be used for or applied to any other instrument."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Only one instrument to be on same stamp",
      "content": "No second instrument chargeable with\nduty shall be written upon a piece of stamped paper upon which an instrument chargeable with duty\nhas already been written:\nProvided that nothing in this section shall prevent any endorsement which is duly stamped or\nis not chargeable with duty being made upon any instrument for the purpose of transferring any right\ncreated or evidenced thereby, or of acknowledging the receipt of any money or goods the payment or\ndelivery of which is secured thereby. ."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Instrument written contrary to section 13 or 14 deemed un",
      "content": "stamped.— Every\ninstrument written in contravention of section 13 or section 14 shall be deemed to be un-stamped."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Denoting duty",
      "content": "Where the duty with which an instrument is chargeable, or its\nexemption from duty, depends in any manner upon the duty actually paid in respect of another\ninstrument, the payment of such last-mentioned duty shall, if application is made in writing to the\nCollector for that purpose, and on production of both the instruments, be denoted upon such first-\nmentioned instrument, by endorsement under the hand of the Collector or in such other manner. (if\nany) as the l[Provincial Government] may by rule prescribe.\nC.-Of the time of stamping Instruments"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Instruments executed in Pakistan",
      "content": "All instruments chargeable with duty and executed\nby any person in 2[Pakistan] shall be stamped before or at the time of execution."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Instruments other than bills and notes executed out of Pakistan",
      "content": "(1) Every\ninstrument chargeable with duty executed only out of 2[Pakistan], and not being a bill of exchange,\n3\n* or promissory note, may be stamped within three months after it has been first received in\n2\n[Pakistan].\n(2) Where any such instrument cannot, with reference to the description of stamp prescribed\ntherefor, be duly stamped by a private person, it may be taken within the said period of three months\nto the Collector, who shall stamp the same, in such manner as the l[provincial Government] may by\nrule prescribe, with a stamp of such value as the person so taking such instrument may require and\npay for."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Bills and notes drawn out of Pakistan. The first holder in 2[Pakistan] of any bill of",
      "content": "exchange, 4[payable otherwise than on demand] 3* or promissory note drawn or made out of\n2\n[Pakistan] shall, before he presents the same for acceptance or payment, or endorses, transfers or\notherwise negotiates the same in 2[Pakistan], affix thereto the proper stamp and cancel the same:\n1\nSubs. by A.O., 1964, Art. 2 and Sch., for “Collecting Government” which had been subs. by A.O., 1937, for “G. G. in C.”.\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (Ordinance No. XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October,\n1955), for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, Arts. 3(2) and 4, for “British India”.\n3\nThe word “cheque” rep. by the Indian Finance Act, 1927 (Act No. V of 1927), s.5.\n4\nIns., ibid.\nProvided that,—\n(a) if, at the time any such bill of exchange, 1[*] or not comes into the hands of any\nholder thereof in 2[Pakistan], the proper adhesive stamp is affixed thereto and\ncancelled in manner prescribed by section 12 and such holder has no reason to believe\nthat such stamp was affixed or cancelled otherwise than by the person and at the time\nrequired by this Act, such stamp shall far as relates to such holder, be deemed to have\nbeen duly affixed and cancelled.\n(b) nothing contained in this proviso shall relieve any person from any penalty incurred\nby him for omitting to affix or cancel a stamp.\nD.-Of Valuations for Duty"
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Conversion of amount expressed in foreign currencies",
      "content": "(1) Where an instrument is\nchargeable with ad valorem duty in respect of any money expressed in any currency other than that\nof 2[Pakistan], such duty shall be calculated on the value of such money in the currency of\n2\n[Pakistan] according to the current rate of exchange on the day of the date of the instrument.\n3\n[*                *                    *                     *                    *                     *                     *]"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Stock and marketable securities how to be valued",
      "content": "Where an instrument is\nchargeable with ad valorem duty in respect of any stock or of any marketable or other security, such\nduty shall be caluc1ated on the value of such stock or security according to the average price or the\nvalue thereof on the day of’ the date of the instrument."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Effect of statement of rate of exchange or average price",
      "content": "Where an instrument\ncontains a statement of current rate of exchange, or average price, as the case may require, and is\nstamped in accordance with such statement, it shall, so far as regards the subject-matter of such\nstatement, be presumed, until the contrary is proved, to be duly stamped."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Instruments reserving interest",
      "content": "Where interest is expressly made payable by the\nterms of an instrument, such instrument shall not be chargeable with duty higher than that with\nwhich it would have been chargeable had no mention of interest been made therein.\n4\n[23A. Certain instruments connected with mortgages of marketable securities to be\nchargeable as agreements.—(1) Where an instrument (not being a promissory note or bill of\nexchange.)—\n(a)         is given upon the occasion of the deposit of any marketable security by way\nof security for money advanced or to be advanced by way of loan, or for an\nexisting or future debt, or\n1\nThe word “cheque” rep. by the Indian Finance Act, 1927 (Act No. V of 1927), s.5.\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (Ordinance No. XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October,\n1955), for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, Arts. 3(2) and 4, for “British India”.\n3\nSub. Section 2 Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ordinance No. XXVII of 1981) s. 5 and Sch. IV (Only to\nthe extent of Islamabad Capital Territory).\n4\nIns. by the Indian Stamp (Amendment) Act, 1904 (Act No. XV of 1904), s. 3.\n(b)       makes redeemable or qualifies a duly stamped transfer, intended as a security,\nof any marketable security, it shall be chargeable with duty as if it were an\nagreement or memorandum of an agreement chargeable with duty under\nl\n[Article No.5 (c)] of Schedule I.\n(2) A release or discharge of any such instrument shall only be chargeable with the like duty.]"
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. How transfer in consideration of debt, or subject to future payment, etc., to be",
      "content": "charged.— Where any property is transferred to any person in consideration, wholly or in part, of\nany debt due to him, or subject either certainly or contingently to the payment or transfer of any\nmoney or stock, whether being or constituting a charge or incumbrance upon the property or not,\nsuch debt, money or stock is to be deemed the whole or part, as the case may be, of the consideration\nin respect whereof the transfer is chargeable with ad valorem duty:\nProvided that nothing in this section shall apply to any such certificate of sale as is mentioned\nin Article No. 18 of Schedule I.\nExplanation.— In the case of a sale of property subject to a mortgage or other incumbrance,\nany unpaid mortgage-money or money charged, together with the interest (if any) due on the same,\nshall be deemed to be part of the consideration for the sale:\nProvided that, where property subject to a mortgage is transferred to the mortgagee, he shall\nbe entitled to deduct from the duty payable on the transfer the amount of any duty already paid in\nrespect of the mortgage.\nIllustrations\n(1) A owes B Rs.1,000. A sells a property to B, the consideration being Rs.500 and the\nrelease of the previous debt of Rs.1,000. Stamp-duty is payable on Rs.1,500.\n(2) A sells a property to B for Rs.500 which is subject to a mortgage to C for Rs.1,000 and\nunpaid interest Rs.200. Stamp-duty is payable on Rs.1,700.\n(3) A mortgages a house of the value of Rs.10,000 to B for Rs.5,000. B an afterwards buys\nthe house from A. Stamp-duty is payable on Rs.10,000 less the amount of Stamp-duty already paid\nfor the mortgage."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Valuation in case of annuity, etc",
      "content": "Where an instrument is executed to secure the\npayment of an annuity or other sum payable periodically, or where the consideration for a\nconveyance is an annuity or other sum payable periodically, the amount secured by such instrument\nor the consideration for such conveyance, as the case may be, shall, for the purposes of this Act, be\ndeemed to be,—\n(a)     where the sum is payable for a definite period so that the total amount to be\npaid can be previously ascertained-such total amount;\n1\nSubs. by the Indian Stamp (Amdt.) Act, 1912 (Act No. I of 1912), s. 3, for “Article No.5 (b)”.\n(b)        where the sum is payable in perpetuity or for an indefinite time not terminable\nwith any life in being at the date of such instrument or conveyance the total\namount which, according to the terms of such instrument or conveyance, will\nor may be payable during the period of twenty years calculated from the date\non which the first payment becomes due; and\n(c)        where the sum is payable for an indefinite time terminable with any life in\nbeing at the date of such instrument or conveyance the maximum amount\nwhich will or may be payable as aforesaid during the period of twelve years\ncalculated from the date on which the first payment becomes due."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Stamp where value of subject",
      "content": "matter is indeterminate.— Where the amount or value\nof the subject-matter of any instrument chargeable with ad valorem duty cannot be, or (in the case of\nan instrument executed before the commencement of this Act) could not have been, ascertained at\nthe date of its execution or first execution, nothing shall be claimable under such instrument more\nthan the highest amount or value for which, if stated in an instrument of the same description, the\nstamp actually used would, at the date of such execution, have been sufficient:\n1\n[Provided that, in the case of the lease of a mine in which royalty or a share of the produce is\nreceived as the rent or part of the rent, it shall be sufficient to have estimated such royalty or the\nvalue of such share, for the purpose of stamp-duty,—\n(a)        when the lease has been granted by or on behalf of 2[the Government], at such\namount or value as the Collector may, having regard to all the circumstances\nof the case, have estimated as likely to be payable by way of royalty or share\nto 3[the Government] under the lease, or,\n(b)      when the lease has been granted by any other person, at twenty thousand\nrupees a year;\nand the whole amount of such royalty or share, whatever it may be, shall be claimable under such\nlease :]\nProvided also that, where proceedings have been taken in respect of an instrument under\nsection 31 or 41, the amount certified by the Collector shall be deemed to be the stamp actually used\nat the date of execution."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Facts affecting duty to be set forth in instrument",
      "content": "The consideration (if any) and all\nother facts and circumstances affecting the chargeability of any instrument with duty, or the amount\nof the duty with which it is chargeable, shall be fully and truly set forth therein.\n4\n[27A Valuation of immovable property.—(1) Where any instrument chargeable with ad\nvalorem duty under Articles 23,31 or 33 of Schedule-I relates to an immovable property, the value of\nthe immovable property shall be calculated according to the valuation table notified by the district\ncollector in respect of immovable property situated in the locality.\n(2) Where an instrument, mentioned in sub-section (1), relates to immovable property\nconsisting of land and structure, it shall state the value of the land and structure separately and the\nvalue of the structure stated in the instrument shall, subject to the provisions of this Act, be accepted.\n1\nSubs. by the Indian Stamp (Amdt.) Act, 1904 (Act No. XV of 1904), s. 4, for the original proviso.\n2\nThe original words “the Secretary of State in Council” were first subs. by A.O., 1937 and then amended by A.O., 1961, Art. 2 (with effect from the\n23rd March, 1956), to read as above.\n3\nThe original words “the said Secretary of State in Council” were first subs. by A.O., 1937 and then amended by A.O.,1961, Art. 2 (with effect from\n23rd March, 1956), to read as above.\n4\nIns. by Finance Act, 2019 (Act No. V of 2019), s.2, (as is in force in the Islamabad Capital Territory).\n(3) Where the value of immovable property stated in an instrument to which sub-section (1)\napplies is more than the value fixed according to the valuation table, the value declared in the\ninstrument shall be accepted as value for the purposes of stamp duty.\n(4) Where the value given in the valuation table notified under sub-section (1), when applied\nto any immovable property, appears to be excessive, the deputy commissioner or commissioner\n(revenue) or any other person notified by the Government for this purpose may, on application made\nto him by the aggrieved person, determine its correct value and for that purpose the provisions of\nsections 31 and 32 shall apply as nearly as possible.]"
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Direction as to duty in case of certain conveyances",
      "content": "(1) Where any property has been\ncontracted to be sold for one consideration for the whole, and is conveyed to the purchaser in\nseparate parts by different instruments, the consideration shall be apportioned in such manner as the\nparties think fit, provided that a distinct consideration for each separate part is set-forth in the\nconveyance relating thereto, and such conveyance shall be chargeable with ad valorem duty in\nrespect of such distinct consideration.\n(2) Where property contracted to be purchased for one consideration for the whole, by two or\nmore persons jointly, or by any person for himself and others, or wholly for others, is conveyed in\nparts by separate instruments to the persons by or for whom the same was purchased, for distinct\nparts of the consideration, the conveyance of each separate part shall be chargeable with ad valorem\nduty in respect of the distinct part of the consideration therein specified.\n(3) Where a person, having contracted for the purchase of any property but not having\nobtained a conveyance thereof, contracts to sell the same to any other person and the property is in\nconsequence conveyed immediately to the sub-purchaser, the conveyance shall be chargeable with\nad valorem duty in respect of the consideration for the sale by the original purchaser to the sub-\npurchaser.\n(4) Where a person, having contracted for the purchase of any property but not having\nobtained a conveyance thereof, contracts to sell the whole, or any part thereof to any other person or\npersons and the property is in consequence conveyed by the original seller to different persons in\nparts, the conveyance of each part sold to a sub-purchaser shall be chargeable with ad valorem duty\nin respect only of the consideration paid by such sub- purchaser, without regard to the amount or\nvalue of the original consideration; and the conveyance of the residue (if any) of such property to the\noriginal purchaser shall be chargeable with ad valorem duty in respect only of the excess of the\noriginal consideration over the aggregate of the considerations paid by the sub-purchasers:\nProvided that the duty on such last-mentioned conveyance shall in no case be less than one\nrupee.\n(5) Where a sub-purchaser takes an actual conveyance of the interest of the person\nimmediately selling to him, which is chargeable with ad valorem duty in respect of the consideration\npaid by him and is duly stamped accordingly, any conveyance to be afterwards made to him of the\nsame property by the original seller shall be chargeable with a duty equal to that which would be\nchargeable on a conveyance for the consideration obtained by such original seller, or, where such\nduty would exceed five rupees, with a duty of five rupees.\nE.-Duty by whom payable"
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Duties by whom payable",
      "content": "In the absence of an agreement to the contrary, the expense\nof providing the proper stamp shall be borne,—\n(a)        in the case of any instrument described in any of the following Articles of\nSchedule I, namely :—\nNo.2. (Administration Bond),\nl\n[No. 6. (Agreement relating to Deposit of Title-deeds, Pawn or Pledge),]\nNo. 13. (Bill of Exchange),\nNo. 15. (Bond),\nNo. 16. (Bottomry Bond),\nNo. 26. (Customs Bond),\nNo. 27. (Debenture),\nNo. 32. (Further Charge),\nNo. 34. (Indemnity-Bond),\nNo. 40. (Mortgage-Deed),\nNo. 49. (Promissory-Note),\nNo. 55. (Release),\nNo. 56. (Respondentia Bond),\nNo. 57. (Security Bond or Mortgage-Deed),\nNo. 58. (Settlement),\nNo. 62.(a). (Transfer of shares in an incorporated company or other body\ncorporate),\nNo. 62 (b). (Transfer of Debentures, being marketable securities, whether the\ndebenture is liable to duty or not, except debentures provided for by\nsection 8).\nNo. 62 (c). (Transfer of any interest secured by a bond, mortgage-deed or\npolicy of insurance),—\nby the person drawing, making or executing such instrument:\n2\n[(b)   in the case of a policy of insurance other than fire insurance-by the person\neffecting the insurance;\n(bb)       in the case of a policy fire-insurance__ by the person issuing the policy;]\n(c)        in the case of a conveyance (including a re-conveyance of mortgaged\nproperty) by the, grantee: in the case of a lease or agreement to lease-by the\nlessee or intended lessee:\n(d)        in the case of a counterpart of a lease-by the lessor:\n(e)        in the case of an instrument of exchange __by the parties in equal shares:\n(f)        in the case of a certificate of sale __by the purchaser of the property to which\nsuch certificate relates: and,\n1\nSubs. by the Indian Stamp (Amdt.) Act, 1904 (Act No. XV of 1904), s. 5, for “No.6. (Agreement to mortgage)”.\n2\nSubs. by the Indian Stamp (Amdt.) Act, 1906 (Act No. V of 1906), s. 4, for the original cl. (b).\n(g)         in the case of an instrument of partition __by the parties thereto in proportion to\ntheir respective shares in the whole property partitioned, or, when the partition\nis made in execution of an order passed by a Revenue authority or Civil Court\nor arbitrator, in such proportion as such authority, Court or arbitrator directs."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Obligation to give receipt in certain cases",
      "content": "Any person receiving any money\nexceeding twenty rupees in amount, or any bill of exchange, cheque or promissory note for an\namount exceeding twenty rupees, or receiving in satisfaction or part satisfaction of a debt any\nmoveable property exceeding twenty rupees in value, shall, on demand by the person paying or\ndelivering such money, bill, cheque, note or property, give a duly stamped receipt for the same.\n1\n[Any person receiving or taking credit for any premium or consideration for any renewal of\nany contract of fire-insurance, shall, within one month after receiving or taking credit for such\npremium or consideration, give a duly stamped receipt for the same:]"
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Adjudication as to proper stamp",
      "content": "(1) When any instrument, whether executed or not\nand whether previously stamped or not, is brought to the Collector, and the person bringing it applies\nto have the opinion of that officer as to the duty (if any) with which it is chargeable, and pays a fee of\nsuch amount (not exceeding five rupees and not less than eight annas) as the Collector may in each\ncase direct, the Collector shall determine the duty (if any) with which, in his judgement, the\ninstrument is chargeable.\n(2) For this purpose the Collector may require to be furnished with an abstract of the\ninstrument, and also with such affidavit or other evidence as he may deem necessary to prove that all\nthe duty with which it is chargeable, are fully and truly set forth therein, and may refuse to proceed\nupon any such application until such abstract and evidence have been furnished accordingly:\nProvided that—\n(a)         no evidence furnished in pursuance of this section shall be used against any\nperson in any civil proceeding, except in an enquiry as to the duty with which\nthe instrument to which it relates is chargeable; and\n(b)         every person by whom any such evidence is furnished shall, on payment of the\nfull duty with which the instrument to which it relates is chargeable, be\nrelieved from any penalty which he may have incurred under this Act by\nreason of the omission to state truly in such instrument any of the facts or\ncircumstances aforesaid."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Certificate by Collector",
      "content": "(1) When an instrument brought to the Collector under\nsection 31, is, in his opinion, one of a description chargeable with duty, and—\n(a)         the Collector determines that it is already fully stamped, or\n1\nIns. by the Indian Stamp (Amdt.) Act, 1906 (Act No. V of 1906), s. 4, for the original cl. (b).\n(b)        the duty determined by the Collector under section 31, or such a sum as, with\nthe duty already paid in respect of the instrument, is equal to the duty so\ndetermined, has been paid,1\nthe Collector shall certify by endorsement on such instrument that the full duty (stating the amount)\nwith which it is chargeable has been paid.\n(2) When such instrument is, in his opinion, not chargeable with duty, the Collector shall\ncertify in manner aforesaid that such instrument is not so chargeable.\n(3) Any instrument upon which an endorsement has been made under this section, shall be\ndeemed to be duly stamped or not chargeable with duty, as the case may be; and, if chargeable with\nduty, shall be receivable in evidence or otherwise, and may be acted upon and registered as if it had\nbeen originally duly stamped:\nProvided that nothing in this section shall authorise the Collector to endorse—\n(a)        any instrument executed or first executed in 2[Pakistan] and brought to him\nafter the expiration of one month from the date of its execution or first\nexecution, as the case may be ;\n(b)        any instrument executed or first executed out of 2[Pakistan] and brought to\nhim after the expiration of three months after it has been first received in\n2\n[Pakistan] ; or\n(c)        any instrument chargeable with the duty of one anna 3[or half an anna] or any\nbill of exchange or promissory note, when brought to him, after the drawing or\nexecution thereof, on paper not duly stamped.\n4\n[32A. Certificate of designated officer.—An officer designated by the Government shall,\nby notification in the official Gazette, issue a certificate as to genuineness or otherwise of an e-stamp\nfor the purpose of evidence in a legal proceedings.]\n_____"
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Examination and impounding of instruments",
      "content": "(1) Every person having by law or\nconsent of parties authority to receive evidence, and every person in charge of a public office, except\nan officer of police, before whom any instrument, chargeable in his opinion, with duty, is produced\nor comes in the performance of his functions, shall, if it appears to him that such instrument is not\nduly stamped, impound the same.\n(2) For that purpose every such person shall examine every instrument so chargeable and so\nproduced or coming before him in order to ascertain whether it is stamped with a stamp of the value\nand description required by the law in force in 2[Pakistan] when such instrument was executed or\nfirst executed:\n1\nFor refund of this duty in the case of certain instruments, see the Stamp (Specified Instruments) Act, 1924 (Act No. XIII of 1924), s. 3(4).\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (Ordinance No. XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October,\n1955), for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, Arts. 3(2) and 4, for “British India”.\n3\nIns. by the Indian Stamp (Amendment) Act, 1906 (Act No. V of 1906), s. 3.\n4\nIns. by the Finance Act,2021(Act No. VIII of 2021), s. 2.\nProvided that—\n(a)        nothing herein contained shall be deemed to require any Magistrate or Judge\nof a Criminal Court to examine or impound, if he does not think fit so to do,\nany instrument coming before him in the course of any proceeding other than\na proceeding under Chapter XII or Chapter XXXVI of the Code of Criminal\nProcedure, 1898 (V of 1898) ;\n(b)        in the case of a Judge of a High Court, the duty of examining and impounding\nany instrument under this section may be delegated to such officer as the\nCourt appoints in this behalf.\n(3) For the purposes of this section, in cases of doubt,—\n1\n(a)        [the Provincial Government] may determine2 what offices shall be deemed to\nbe public offices; and\n3\n(b)         [the Provincial Government] may determine who shall be deemed to be\npersons in charge of public offices."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Special provision as to unstamped receipts",
      "content": "Where any receipt chargeable with a\nduty of one anna is tendered to or produced before any officer unstamped in the course of the audit\nof any public account, such officer may in his discretion, instead of impounding the instrument,\nrequire a duly stamped receipt to be substituted therefor."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Instruments not duly stamped in admissible is evidence, etc",
      "content": "No instrument\nchargeable with duty shall be admitted in evidence for any purpose by any person having by law or\nconsent of parties authority to receive evidence, or shall be acted upon registered or authenticated by\nany such person or by any public officer, unless such instrument is duly stamped:\nProvided that—\n4\n(a)    any such instrument not being an instrument chargeable with a duty of one\nanna 5[or half an anna] only, or a bill of exchange or promissory note, shall,\nsubject to all just exceptions, be admitted in evidence on payment of the duty\nwith which the same is chargeable, or, in the case of an instrument\ninsufficiently stamped, of the amount required to make up such duty, together\nwith a penalty of five rupees, or, when ten times the amount of the proper duty\nor deficient portion thereof exceeds five rupees, of a sum equal to ten times\nsuch duty or portion;\n(b)        where any person from whom a stamped receipt could have been demanded,\nhas given an unstamped receipt and such receipt, if stamped, would be ad-\nmissible in evidence against him, then such receipt shall be admitted in\nevidence against him on payment of a penalty of one rupee by the person\ntendering it ;\n1\nThe original words “the G. G. in C”. were first subs. by A.O., 1937 and then amended by A.O., 1964, Art. 2 and Sch., to read as above.\n2\nFor the purposes of this section, the office of a returning officer appointed for the purposes of an election to legislative body constituted under the\nGovernment of India Act is not a public office, see Gazette of India, 1920, Pt. I, p. 2136.\n3\nThe original words “the L. G.” were first subs. by A.O., 1937 and then amended by A.O., 1964, Art. 2 and Sch., to read as above.\n4\nFor modifications of this provision in respect of instruments to which the Stamp (Specified Instruments) Act, 1924 (Act No. XIII of 1924), applies, see\ns, 3 of that Act.\n5\nIns. by the Indian Stamp (Amdt.) Act. 1906 (Act No. V of 1906), s. 3.\n(c)        where a contract or agreement of any kind is effected by correspondence\nconsisting of two or more letters and any one of the letters bears the proper\nstamp, the contract or agreement shall be deemed to be duly stamped;\n(d)        nothing herein contained shall prevent the admission of any instrument in\nevidence in any proceeding in a Criminal Court, other than a proceeding under\nChapter XII or Chapter XXXVI of the Code of Criminal Procedure, 1898\n(V of 1898);\n(e)        nothing herein contained shall prevent the admission of any instrument in any\nCourt when such instrument has been executed by or on behalf of l[the\nGovernment], or where it bears the certificate of the Collector as provided by\nsection 32 or any other provision of this Act."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Admission of instrument where not to be questioned",
      "content": "Where an instrument has been\nadmitted in evidence, such admission shall not, except as provided in section 61, be called in\nquestion at any stage of the same suit or proceeding on the ground that the instrument has not been\nduly stamped."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Admission of improperly stamped instruments",
      "content": "2[The Provincial Government] may\nmake rules providing that, where an instrument bears a stamp of sufficient amount but of improper\ndescription, it may, on payment of the duty with which the same is chargeable, be certified to be duly\nstamped, and any instrument so certified shall then be deemed to have been duly stamped as from the\ndate of its execution."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Instruments impounded how dealt with",
      "content": "(1) When the person impounding an\ninstrument under section 33 has by law or consent of parties authority to receive evidence and admits\nsuch instrument in evidence upon payment of a penalty as provided by section 35 or of duty as\nprovided by section 37, he shall send to the Collector an authenticated copy of such instrument,\ntogether with a certificate in writing, stating the amount of duty and penalty levied in respect thereof,\nand shall send such amount to the Collector, or to such person as he may appoint in this behalf.\n(2) In every other case, the person so impounding an instrument shall send it in original to the\nCollector."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Collector’s power to refund penalty paid under section 38, sub",
      "content": "section (1).—(1)\nWhen a copy of an instrument is sent to the Collector under section 38, sub-section (1), he may, if he\nthinks fit, 3[* * *] refund any portion of the penalty in excess of five rupees which has been paid in\nrespect of such instrument.\n(2) When such instrument has been impounded only because it has been written in\ncontravention of section 13 or section 14, the Collector may refund the whole penalty so paid.\n1\nThe original words “the Govt.” were first subs. by A.O., 1937 and then amended by A.O., 1961, Art. 2 (with effect from the 23rd March, 1956), to\nread as above.\n2\nThe original words “the G. G. in C.” were first subs. by A.O.,1937, and then amended by A.O., 1964, Art. 2 and Sch., to read as above.\n3\nThe words “upon application made to him in this behalf or, if no application is made, with the consent of the Chief Controlling Revenue authority”\nrep. by the Decentralization Act, 1914 (Act No IV of 1914), s., 2 and Sch., Pt. I."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Collector’s power to stamp instruments impounded",
      "content": "(1) When the Collector\n1\nimpounds any instrument under section 33, or receives any instrument sent to him under section 38,\nsub-section (2), not being an instrument chargeable with a duty of one anna 2[or half an anna] only or\na bill of exchange or promissory note, he shall adopt the following procedure:—\n(a)        if he is of opinion that such instrument is duly stamped, or is not chargeable\nwith duty, he shall certify by endorsement thereon that it is duly stamped, or\nthat it is not so chargeable, as the case may be :\n(b)       if he is of opinion that such instrument is chargeable with duty and is not duly\nstamped, he shall require the payment of the proper duty or the amount re-\nquired to make up the same, together with a penalty of five rupees; or, if he\nthinks fit, 3[an amount not exceeding] ten times the amount of the proper duty\nor of the deficient portion thereof, whether such amount exceeds or falls short\nof five rupees:\nProvided that, when such instrument has been impounded only because it has been written in\ncontravention of section 13 or section 14, the Collector may, if he thinks fit, remit the whole penalty\nprescribed by this section.\n(2) Every certificate under clause (a) of sub-section (1) shall, for the purposes of this Act, be\nconclusive evidence of the matters stated therein.\n(3) Where an instrument has been sent to the Collector under section 38, sub-section (2), the\nCollector shall, when he has dealt with it as provided by this section, return it to the impounding\nofficer.\n4\n[41. Instruments unduly stamped by accident.— If any instrument chargeable with duty\nand not duly stamped, not being an instrument chargeable with a duty of one anna 5[or half an anna ]\nonly or a bill of exchange or promissory note, is produced by any person of his own motion before\nthe Collector within one year from the date of its execution or first execution, and such person brings\nto the notice of the Collector the fact that such instrument is not duly stamped and offers to pay to the\nCollector the amount of the proper duty, or the amount required to make up the same, and the\nCollector is satisfied that the omission to duly stamp such instrument has been occasioned by\naccident, mistake or urgent necessity, he may, instead of proceeding under sections 33 and 40,\nreceive such amount and proceed as next hereinafter prescribed."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Endorsement of instruments on which duty has been paid under section 35, 40 or",
      "content": "41.—(1) When the duty and penalty (if any) leviable in respect of any instrument have been paid\nunder section 35, section 40 or section 41, the person admitting such instrument in evidence or the\nCollector, as the case may be, shall certify by endorsement thereon that the proper duty or, as the\ncase may be, the proper duty and penalty (stating the amount of each) have been levied in respect\nthereof, and the name and residence of the person paying them.\n1\nFor modifications of these provisions in respect of instruments to which the Stamp (Specified Instruments) Act, 1924 (Act No. XIII of 1924), applies,\nsee s. 3 of that Act.\n2\nIns. by the Indian Stamp (Amendment) Act, 1906 (Act No. V of 1906), s. 3.\n3\nIns. by the Indian Stamp (Amendment) Act, 1904 (Act No. XV of 1904), s. 6.\n4\nFor modifications of these provisions in respect of instruments to which the Stamp (Specified Instruments) Act, 1924 (Act No. XIII of 1924), applies,\nsee s. 3 of that Act.\n5\n1ns. by the Indian Stamp (Amdt.) Act, 1906 (Act No. V of 1906), s. 3.\n(2) Every instrument so endorsed shall thereupon be admissible in evidence, and may be\nregistered and acted upon and authenticated as if it had been duly stamped, and shall be delivered on\nhis application in this behalf to the person from whose possession it came into the hands of the\nofficer impounding it, or as such person may direct:\nProvided that—\n(a)        no instrument which has been admitted in evidence upon payment of duty and\na penalty under section 35, shall be so delivered before the expiration of one\nmonth from the date of such impounding, or if the Collector has certified that\nits further detention is necessary and has not cancelled such certificate;\n(b)        nothing in this section shall affect the1[provisions of rule 9 of Order XIII of\nthe First Schedule to the Code of Civil Procedure. 1908 (Act V of 1908)]."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Prosecution for offence against Stamp",
      "content": "law.— The taking of proceedings or the\npayment of a penalty under this Chapter in respect of any instrument shall not bar the prosecution of\nany person who appears to have committed an offence against the Stamp-law in respect of such\ninstrument:\nProvided that no such prosecution shall be instituted in the case of any instrument in respect\nof which such a penalty has been paid, unless it appears to the Collector that the offence was\ncommitted with an intention of evading payment of the proper duty."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Persons paying duty or penalty may recover same in certain cases",
      "content": "(1) When any\nduty or penalty has been paid under section 35, section 37, section 40 or section 41, by any person in\nrespect of an instrument, and, by agreement or under the provisions of section 29 or any other\nenactment in force at the time such instrument was executed, some other person was bound to bear\nthe expense of providing the proper stamp for such instrument, the first-mentioned person shall be\nentitled to recover from such other person the amount of the duty or penalty so paid.\n(2) For the purpose of such recovery any certificate granted in respect of such instrument\nunder this Act shall be conclusive evidence of the matters therein certified.\n(3) Such amount may, if the Court thinks fit, be included in any order as to costs in any suit\nor proceeding to which such persons are parties and in which such instrument has been tendered in\nevidence. If the Court does not include the amount in such order, no further proceedings for the\nrecovery of the amount shall be maintainable."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Power to Revenue authority to refund penalty or excess duty in certain cases",
      "content": "(1)\nWhere any penalty is paid under section 35 or section 40, the 2[Chief Revenue Authority] may, upon\napplication in writing made within one year from the date of the payment, refund such penalty\nwholly or in part.\n(2) Where, in the opinion of the 2[Chief Revenue Authority], stamp-duty in excess of that\nwhich is legally chargeable has been charged and paid under section 35 or section 40, such authority\nmay, upon application in writing made within three months of the order charging the same, refund\nthe excess.\n1\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ordinance No. XXVII of 1981;, s. 5 and Sch. Sch. IV (Only to the extent of\nIslamabad Capital Territory;, for “Code of Civil Procedure, section 144, clause 3”.\n2\nSubs, by A.O., 1961, Art. 2 and Sch., for “Chief Controlling Revenue authority” (with effect from the 23rd March, 1956).\nFor definition, see the General Clauses Act, 1897 (Act No. X of 1897), s. 3 (9a). In the N.W.F.P., the reference to the Chief Controlling Revenue-\nauthority should be construed as a reference to the Revenue Commissioner.- See the N.W.F.P. Law and Justice Regulation, 1901 (VII of 1901), s. 6 (1)\n(d)."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Non",
      "content": "liability for loss of instruments sent under section 38.—(1) If any instrument sent\nto the Collector under section 38, sub-section (2), is lost, destroyed or damaged during transmission,\nthe person sending the same shall not be liable for such loss, destruction or damage.\n(2) When any instrument is about to be so sent, the person from whose possession it came\ninto the hands of the person impounding the same, may require a copy thereof to be made at the\nexpense of such first-mentioned person and authenticated by the person impounding such instrument."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Power of payer to stamp bills and promissory notes received by him unstamped",
      "content": "When any bill of exchange 1[or promissory note] chargeable with the duty of one anna is presented\nfor payment unstamped, the person to whom it is so presented may affix thereto the necessary\nadhesive stamp, and, upon cancelling the same in manner hereinbefore provided, may pay the sum\npayable upon such bill 2[ or note], and may charge the duty against the person who ought to have\npaid the same, or deduct it from the sum payable as aforesaid, and such bill 2[or note] shall, so far as\nrespects the duty, be deemed good and valid:\nProvided that nothing herein contained shall relieve any person from any penalty or\nproceeding to which he may be liable in relation to such bill 2[or note]."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Recovery of duties and penalties",
      "content": "All duties, penalties and other sums required to be\npaid under this Chapter may be recovered by the Collector by distress and sale of the moveable\nproperty of the person from whom the same are due, or by any other process for the time being in\nforce for the recovery of arrears of land-revenue."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Allowances for spoiled stamps",
      "content": "Subject to such rules as may be made by 3[ the Pro-\nvincial Government] as to the evidence to be required, or the enquiry to be made, the Collector may,\non application made within the period prescribed in section 50, and if he is satisfied as to the facts,\nmake allowance for impressed stamps spoiled in the cases hereinafter mentioned, namely :—\n(a)        the stamp on any paper inadvertently and undesignedly spoiled, obliterated or\nby error in writing or any other means rendered unfit for the purpose intended\nbefore any instrument written thereon is executed by any person:\n(b)        the stamp on any document which is written out wholly or in part, but which\nis not signed or executed by any party thereto:\n(c)        in the case of bills of exchange 4[ payable otherwise than on demand] 5* or\npromissory notes___\n1\nSubs. by the Indian Finance Act, 1927 (Act No. V of 1927), s. 5, for “promissory note or cheque”.\n2\nSubs. ibid., for “note or cheque”.\n3\nThe original words “G. G. in C” have successively been amended by the Decentralization Act, 1914 (Act No. IV of 1914), s. 2 and Sch., Pt. I, A.O.,\n1937 and A.O., 1964, Art. 2 and Sch., to read as above.\n4\nIns. by the Indian Finance Act, 1927 (Act No. V of 1927), s. 5.\n5\nThe word “cheques” rep., ibid.\n(1) the stamp on 1[any such bill of exchange] 2[* *] signed by or on behalf of the drawer\nwhich has not been accepted or made use of in any manner whatever or delivered out of his hands for\nany purpose other than by way of tender for acceptance: provided that the paper on which any such\nstamp is impressed does not bear any signature intended as or for the acceptance of any bill of\nexchange 2[* *] to be afterwards written thereon:\n(2) the stamp on any promissory note signed by or on behalf of the maker which has not\nbeen made use of in any manner whatever or delivered out of his hands:\n(3) the stamp used or intended to be used for 1[any such bill of exchange] 3[*] or\npromissory note signed by, or on behalf of, the drawer thereof, but which from any omission or\nerror has been spoiled or rendered useless, although the same, being a bill of exchange 4* *, may\nhave been presented for acceptance or accepted or endorsed, or, being a promissory note, may have\nbeen delivered to the payee: provided that another completed and duly stamped bill of exchange 5* or\npromissory note is produced identical in every particular, except in the correction of such omission\nor error as aforesaid, with the spoiled bill 5[*] or note:\n(d)        the stamp used for an instrument executed by any party thereto which—\n(1) has been afterwards found to be absolutely void in law from the beginning:\n(2) has been afterwards found unfit, by reason of any error or mistake therein, for the purpose\noriginally intended:\n(3) by reason of the death of any person by whom it is necessary that it should be executed,\nwithout having executed the same, or of the refusal of any such person to execute the same, cannot\nbe completed so as to effect the intended transaction in the form proposed:\n(4) for want of the execution thereof by some material party, and his inability or refusal to\nsign the same, is in fact incomplete and insufficient for the purpose for which it was intended:\n(5) by reason of the refusal of any person to act under the same, or to advance any money in-\ntended to be thereby secured, or by the refusal or non-acceptance of any office thereby granted,\ntotally fails of the intended purpose:\n(6) becomes useless in consequence of the transaction intended to be thereby effected being\neffected by some other instrument between the same parties and bearing a stamp of not less value:\n(7) is deficient in value and the transaction intended to be thereby effected has been effected\nby some other instrument between the same parties and bearing a stamp of not less value:\n(8) is inadvertently and undesignedly spoiled, and in lieu whereof another instrument made\nbetween the same parties and for the same purpose is executed and duly stamped:\n1\nSubs. by the Indian Finance Act, 1927 (Act No. V of 1927), s. 5, for “any bill of exchange”.\n2\nThe words “or cheque” rep., ibid.\n3\nThe word “cheque” rep., ibid.\n4\nThe words “or cheque” rep., ibid.\n5\nThe word “cheque” rep., ibid.\nProvided that, in the case of an executed instrument, no legal proceeding has been\ncommenced in which the instrument could or would have been given or offered in evidence and that\nthe instrument is given up to be cancelled.\nExplanation.—The certificate of the Collector under section 32 that the full duty with which\nan instrument is chargeable has been paid is an impressed stamp within the meaning of this section."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Application for relief under section 49 when to be made",
      "content": "The application for relief\nunder section 49 shall be made within the following periods, that is to say,—\n(1) in the cases mentioned in clause (d) (5), within two months of the date of the instrument:\n(2) in the case of a stamped paper on which no instrument has been executed by any of the\nparties thereto, within six months after the stamp has been spoiled:\n(3) in the case of a stamped paper in which an instrument has been executed by any of the\nparties thereto, within six months after the date of the instrument, or, if it is not dated, within six\nmonths after the execution thereof by the person by whom it was first or alone executed:\nProvided that,—\n(a)        when the spoiled instrument has been for sufficient reasons sent out of\nl\n[Pakistan], the application may be made within six months after it has been\nreceived back in 1[ Pakistan] :\n(b)        when, from unavoidable circumstances, any instrument for which another\ninstrument has been substituted cannot be given up to be cancelled within the\naforesaid period, the application may be made within six months after the date\nof execution of the substituted instrument."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Allowance in case of printed forms no longer required by Corporations",
      "content": "The 2[ Chief\nRevenue Authority] 3[ or the Collector if empowered by the 2[ Chief Revenue Authority] in this behalf]\nmay, without limit of time, make allowance for stamped papers used for printed forms of instruments\n4\n[by any banker or] by any incorporated company or other body corporate, if for any sufficient reason\nsuch forms have ceased to be required by the said 5[banker,] company or body corporate: provided\nthat such authority is satisfied that the duty in respect of such stamped papers has been duly paid."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Allowance for misused stamps",
      "content": "(a)      When any person has inadvertently used, for an instrument chargeable with\nduty, a stamp of a description other than that prescribed for such instrument by\nhas inadvertently used any stamp for an instrument not chargeable with any\nduty; or\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (Ordinance No. XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October,\n1955), for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, Arts. 3(2) and 4, for “British India”.\n2\nSubs, by A.O., 1961, Art. 2 and Sch., for “Chief Controlling Revenue authority” (with effect from the 23rd March, 1956).\nFor definition, see the General Clauses Act, 1897 (Act No. X of 1897), s. 3 (9a). In the N.W.F.P., the reference to the Chief Controlling Revenue-\nauthority should be construed as a reference to the Revenue Commissioner.- See the N.W.F.P. Law and Justice Regulation, 1901 (VII of 1901), s. 6 (1)\n(d).\n3\nIns. by the Decentralization Act, 1914 (Act No. IV of 1914), s. 2 and Sch., Part I.\n4\nIns. by the Indian Stamp (Amendment) Act, 1906 (Act No. V of 1906), s. 6.\n5\nIns. by the Indian Stamp (Amdt.) Act, 1906 (Act No. V of 1906), s. 6.\n(b) when any stamp used for an instrument has been inadvertently rendered useless\nunder section 15, owing to such instrument having been written in contravention\nof the provisions of section 13 ;\nthe Collector may, on application made within six months after the date of the instrument, or, if it is\nnot dated, within six months after the execution thereof by the person by whom it was first or alone\nexecuted, and upon the instrument, if chargeable with duty, being re-stamped with the proper duty,\ncancel and allow as spoiled the stamp so misused or rendered useless."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Allowance for spoiled or misused stamps how to be made",
      "content": "In any case in which\nallowance is made for spoiled or misused stamps, the Collector may give in lieu thereof—\n(a)         other stamps of the same description and value; or\n(b)         if required and he thinks fit, stamps of any other description to the same\namount in value; or,\n(c)         at his discretion, the same value in money, deducting one anna for each rupee\nor fraction of a rupee."
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Allowance for stamps not required for use",
      "content": "When any person is possessed of a stamp\nor stamps which have not been spoiled or rendered unfit or useless for the purpose intended, but for\nwhich he has no immediate use, the Collector shall repay to such person the value of such stamp or\nstamps in money, deducting one anna for each rupee or portion of a rupee, upon such person\ndelivering up the same to be cancelled, and proving to the Collector’s satisfaction–\n(a)         that such stamp or stamps were purchased by such person with a bona fide\nintention to use them; and\n(b)         that he has paid the full price thereof; and\n(c)         that they were so purchased within the period of six months next preceding the\ndate on which they were so delivered:\nProvided that, where the person is a licensed vendor of stamps, the Collector may, if he\nthinks fit, make the repayment of the sum actually paid by the vendor without any such deduction as\naforesaid."
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Allowance on renewal of certain debentures",
      "content": "When any duly stamped debenture is\nrenewed by the issue of a new debenture in the same terms, the Collector shall, upon application\nmade within one month, repay to the person issuing such debenture, the value of the stamp on the\noriginal or new debenture, whichever shall be less:\nProvided that the original debenture is produced before the collector and cancelled by him in\nsuch manner as the 1[Provincial Government] may direct.\n1\nSubs. by A.O., 1937, for “G.G. in C.”.\nExplanation.—A debenture shall be deemed to be renewed in the same terms within the\nmeaning of this section notwithstanding following changes :—\n(a)        the issue of two or more debentures in place of one original debenture, the\ntotal amount secured being the same;\n(b)        the issue of one debenture in place of two or more original debentures, the\ntotal amount secured being the same;\n(c)        the substitution of the name of the holder at the time of renewal for the name\nof the original holder; and\n(d)        the alteration of the rate of interest or the dates of payment thereof.\n_____"
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. Control of, and statement of case to, Chief Revenue Authority",
      "content": "_ (1) The powers\nexercisable by a Collector under Chapter IV and Chapter V 1[and under clause (a) of the first proviso\nto section 26] shall in all cases be subject to the control of the 2[Chief Revenue Authority].\n(2) If any Collector, acting under section 31, section 40 or section 41, feels doubt as to the\namount of duty with which any instrument is chargeable, he may draw up a statement of the case, and\nrefer it, with his own opinion thereon, for the decision of the 2[Chief Revenue Authority ].\n(3) Such authority shall consider the case and send a copy of its decision to the Collector,\nwho shall proceed to assess and charge the duty (if any) in conformity with such decision."
    },
    {
      "provision_ref": "sec57",
      "section": "57",
      "title": "Section 57. Statement of case by Chief Revenue Authority to High Court",
      "content": "3[(1) The Chief\nRevenue Authority may state many case referred to it under section 56, sub-section (2), or otherwise\ncoming to its notice and refer such case, with its own opinion thereon, to the High Court].\n(2) Every such case shall be decided by not less than three Judges of the High Court 4[* * *]\nto which it is referred, and in case of difference the opinion of the majority shall prevail."
    },
    {
      "provision_ref": "sec58",
      "section": "58",
      "title": "Section 58. Power of High Court to call for further particulars as to case stated",
      "content": "If the High\nCourt 4[* * *] is not satisfied that the statements contained in the case are sufficient to enable it to\ndetermine the questions raised thereby, the Court may refer the case back to the Revenue-authority\nby which it was stated, to make such additions thereto or alterations therein as the Court may direct\nin that behalf.\n1\nIns. by the Indian Stamp (Amdt.) Act, 1904 (Act No. XV of 1904), s. 7.\n2\nSubs, by A.O., 1961, Art. 2 and Sch., for “Chief Controlling Revenue authority” (with effect from the 23rd March, 1956).\nFor definition, see the General Clauses Act, 1897 (Act No. X of 1897), s. 3 (9a). In the N.W.F.P., the reference to the Chief Controlling Revenue-\nauthority should be construed as a reference to the Revenue Commissioner.- See the N.W.F.P. Law and Justice Regulation, 1901 (VII of 1901), s. 6 (1)\n(d).\n3\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ordinance No. XXVII of 1981;, s. 5 and Sch. IV (Only to the extent of\nIslamabad Capital Territory, for sub-section (1).\n4\nThe word “or Chief Court”, as amended by A.O., 1937. A.O., 1949 and Act 26 of 1951, have been omitted by Ord. XXI of 1960, s. 3 and 2nd Sch.,\n(with effect from the 14th October, 1955)."
    },
    {
      "provision_ref": "sec59",
      "section": "59",
      "title": "Section 59. Procedure in disposing of case stated",
      "content": "(1) The High Court 1[* * *], upon the hearing\nof any such case, shall decide the questions raised thereby, and shall deliver its judgment thereon\ncontaining the grounds on which such decision is founded.\n(2) The Court shall send to the Revenue-authority by which the case was stated a copy of\nsuch judgment under the seal of the Court and the signature of the Registrar; and the Revenue-autho-\nrity shall, on receiving such copy, dispose of the case conformably to such judgment."
    },
    {
      "provision_ref": "sec60",
      "section": "60",
      "title": "Section 60. Statement of case by other Courts to High Court",
      "content": "_ (1) If any Court, other than a\nCourt mentioned in section 57, feels doubt as to the amount of duty to be paid in respect of any\ninstrument under proviso (a) to section 35, the Judge may draw up a statement of the case and refer\nit, with his own opinion thereon, for the decision of the High Court 1[* * *] to which, if he were the\n2\n[Chief Revenue Authority], he would, under section 57, refer the same.\n(2) Such Court shall deal with the case as if it had been referred under section 57, and send a\ncopy of its judgment under the seal of the Court and the signature of the Registrar to the 2[Chief\nRevenue Authority] and another like copy to the Judge making the reference, who shall, on receiving\nsuch copy, dispose of the case conformably to such judgment.\n(3) References made under sub-section (1), when made by a Court subordinate to a District\nCourt, shall be made through the District Court, and, when made by any subordinate Revenue Court,\nshall be made through the Court immediately superior."
    },
    {
      "provision_ref": "sec61",
      "section": "61",
      "title": "Section 61. Revision of certain decisions of Courts regarding the sufficiency of stamps",
      "content": "(1)\nWhen any Court in the exercise of its civil or revenue jurisdiction or any Criminal Court in any\nproceeding under Chapter XII or Chapter XXXVI of the Code of Criminal Procedure, 1898 (V of\n1898), makes any order admitting any instrument in evidence as duly stamped or as not requiring a\nstamp, or upon payment of duty and a penalty under section 35, the Court to which appeals lie from,\nor references are made by, such first mentioned Court may, of its own motion or on the application\nof the Collector, take such order into consideration.\n(2) If such Court, after such consideration, is of opinion that such instrument should not have\nbeen admitted in evidence without the payment of duty and penalty under section 35, or without the\npayment of a higher duty and penalty than those paid, it may record a declaration to that effect, and\ndetermine the amount of duty with which such instrument is chargeable, and may require any person\nin whose possession or power such instrument then is, to produce the same, and may impound the\nsame when produced.\n(3) When any declaration has been recorded under sub-section (2), the Court recording the\nsame shall send a copy thereof to the Collector, and, where the instrument to which it relates has\nbeen impounded or is otherwise in the possession of such Court, shall also send him such instrument.\n(4) The Collector may thereupon, notwithstanding anything contained in the order admitting\nsuch instrument in evidence, or in any certificate granted under section 42, or in section 43,\nprosecute any person for any offence against the Stamp-law, which the Collector considers him to\nhave committed in respect of such instrument:\n1\nThe word “or Chief Court”, as amended by A.O., 1937. A.O., 1949 and Act XXVI of 1951, have been omitted by Ord. XXI of 1960, s. 3 and 2nd\nSch., (with effect from the 14th October, 1955).\n2\nSubs, by A.O., 1961, Art. 2 and Sch., for “Chief Controlling Revenue authority” (with effect from the 23rd March, 1956).\nFor definition, see the General Clauses Act, 1897 (Act No. X of 1897), s. 3 (9a). In the N.W.F.P., the reference to the Chief Controlling Revenue-\nauthority should be construed as a reference to the Revenue Commissioner.- See the N.W.F.P. Law and Justice Regulation, 1901 (VII of 1901), s. 6 (1)\n(d).\nProvided that–\n(a)         no such prosecution shall be instituted where the amount (including duty and\npenalty) which, according to the determination of such Court, was payable in\nrespect of the instrument under section 35, is paid to the Collector, unless he\nthinks that the offence was committed with an intention of evading payment of\nthe proper duty;\n(b)        except for the purposes of such prosecution, no declaration made under this\nsection shall affect the validity of any order admitting any instrument in\nevidence, or of any certificate granted under section 42.\n____\n1"
    },
    {
      "provision_ref": "sec62",
      "section": "62",
      "title": "Section 62. Penalty for executing, etc., instrument not duly stamped",
      "content": "(1) Any person—\n(a)        drawing, making, issuing, endorsing or transferring, or signing otherwise than\nas a witness, or presenting for acceptance or payment, or accepting, paying or\nreceiving payment of, or in any manner negotiating, any bill of exchange\n2\n[payable otherwise than on demand] 3* or promissory note without the same\nbeing duly stamped; or\n(b)        executing or signing otherwise than as a witness any other instrument\nchargeable with duty without the same being duly stamped; or\n(c)         voting or attempting to vote under any proxy not duly stamped; shall for\nevery such offence be punishable with fine which may extend to five\nhundred rupees:\nProvided that, when any penalty has been paid in respect of any instrument under section 35,\nsection 40 or section 61, the amount of such penalty shall be allowed in reduction of the fine (if any)\nsubsequently imposed under this section in respect of the same instrument upon the person who paid\nsuch penalty.\n(2) If a share-warrant is issued without being duly stamped, the company issuing the same,\nand also every person who, at the time when it is issued, is the managing director or secretary or\nother principal officer of the company, shall be punishable with fine which may extend to five\nhundred rupees."
    },
    {
      "provision_ref": "sec63",
      "section": "63",
      "title": "Section 63. Penalty for failure to cancel adhesive stamp",
      "content": "Any person required by section 12 to\ncancel an adhesive stamp, and failing to cancel such stamp in manner prescribed by that section,\nshall be punishable with fine which may extend to one hundred rupees.\n1\nFor modification of provisions in respect of instruments to which the Stamp (Specified Instruments) Act, 1924 (Act No. XIII of 1924), applies, see s. 3\nof that Act.\n2\nIns. by the Indian Finance Act, 1927 (Act No. V of 1927), s. 5.\n3\nThe word “cheque” rep. ibid."
    },
    {
      "provision_ref": "sec64",
      "section": "64",
      "title": "Section 64. Penalty for omission to comply with provisions of section 27",
      "content": "Any person who, with\nintent to defraud the Government,—\n(a)        executes any instrument in which all the facts and circumstances required by\nsection 27 to be set forth in such instrument are not fully and truly set forth;\nor,\n(b)        being employed or concerned in or about the preparation of any instrument,\nneglects or omits fully and truly to set forth therein all such facts and cir-\ncumstances ; or\n(c)        does any other act calculated to deprive the Government of any duty or\npenalty under this Act;\nshall be punishable with fine which may extend to five thousand rupees."
    },
    {
      "provision_ref": "sec65",
      "section": "65",
      "title": "Section 65. Penalty for refusal to give receipt, and for devices to evade duty on receipts",
      "content": "Any\nperson who,—\n(a)        being required under section 30 to give a receipt, refuses or neglects to give\nthe same; or,\n(b)        with intent to defraud the Government of any duty, upon a payment of money\nor delivery of property exceeding twenty rupees in amount or value, give a\nreceipt for an amount or value not exceeding twenty rupees, or separates or\ndivides the money or property paid or delivered;\nshall be punishable with fine which may extend to one hundred rupees."
    },
    {
      "provision_ref": "sec66",
      "section": "66",
      "title": "Section 66. Penalty for not making out policy, or making one not duly stamped",
      "content": "Any person\nwho—\n(a)        receives, or takes credit for, any premium or consideration for any contract of\ninsurance and does not, within one month after receiving, or taking credit for,\nsuch premium or consideration, make out and execute a duly stamped policy\nof such insurance; or\n(b)        makes, executes or delivers out any policy which is not duly stamped, or pays\nor allows in account, or agrees to pay or allow in account, any money upon, or\nin respect of, any such policy;\nshall be punishable with fine which may extend to two hundred rupees."
    },
    {
      "provision_ref": "sec67",
      "section": "67",
      "title": "Section 67. Penalty for not drawing full number of bills or marine polices purporting to be in",
      "content": "sets.— Any person drawing or executing a bill of exchange l[payable otherwise than on demand] or a\npolicy of marine insurance purporting to be drawn or executed in a set of two or more, and not at the\nsame time drawing or executing on paper duly stamped the whole number of bills or policies of\nwhich such bill or policy purports the set to consist, shall be punishable with fine which may extend\nto one thousand rupees.\n1\nIns. by the Indian Finance Act, 1927 (Act No. V of 1927), s. 5."
    },
    {
      "provision_ref": "sec68",
      "section": "68",
      "title": "Section 68. Penalty for post",
      "content": "dating bills, and for other devices to defraud the revenue.— Any\nperson who—\n(a)        with intent to defraud the Government of duty, draws, makes or issues any bill\nof exchange or promissory note bearing a date subsequent to that on which\nsuch bill or note is actually drawn or made; or\n(b)        knowing that such bill or note has been so postdated, endorses, transfers,\npresents for acceptance or payment, or accepts, pays or receives payment of,\nsuch bill or note, or in any manner negotiates the same; or\n(c)        with the like intent, practices or is concerned in any act, contrivance or device\nnot specially provided for by this Act or any other law for the time being in\nforce ;\nshall be punishable with fine which may extend to one thousand rupees."
    },
    {
      "provision_ref": "sec69",
      "section": "69",
      "title": "Section 69. Penalty for breach of rule relating to sale of stamps and for unauthorised",
      "content": "sale.—(a) Any person appointed to sell stamps who disobeys any rule made under section 74 ; and\n(b)        any person not so appointed who sells or offers for sale any stamp (other than\na one-anna 1[or half an anna] adhesive stamp) ;\nshall be punishable with imprisonment for a term which may extend to six months, or with fine\nwhich may extend to five hundred rupees, or with both."
    },
    {
      "provision_ref": "sec70",
      "section": "70",
      "title": "Section 70. Institution and conduct of prosecutions",
      "content": "_ (1) No prosecution in respect of any offence\npunishable under this Act 2[ * * *] shall be instituted without the sanction of the Collector or such\nother officer as 3[the 4[Provincial Government]] generally, or the Collector specially, authorises in\nthat behalf.\n(2) The 5[Chief Revenue Authority], or any officer generally or specially authorized by it in\nthis behalf, may stay any such prosecution or compound any such offence.\n(3) The amount of any such composition shall be recoverable in the manner provided by\nsection 48."
    },
    {
      "provision_ref": "sec71",
      "section": "71",
      "title": "Section 71. Jurisdiction of Magistrates",
      "content": "No Magistrate other than 6[* * *] a Magistrate whose\npowers are not less than those of a Magistrate of the second class, shall try any offence under this\nAct."
    },
    {
      "provision_ref": "sec72",
      "section": "72",
      "title": "Section 72. Place of trial",
      "content": "Every such offence committed in respect of any instrument may be tried\nin any district 7[* * *] in which such instrument is found as well as in any district 7[* * *] in which\nsuch offence might be tried under the Code of Criminal Procedure for the time being in force.\n1\nIns. by the Indian Stamp (Amdt.) Act, 1906 (Act No. V of 1906), s. 3.\n2\nOmitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ordinance No. XXVII of 1981;, s. 5 and Sch. IV (Only to the extent of\nIslamabad Capital Territory).\n3\nSubs. by A.O., 1937, for “the L. G.”.\n4\nSubs. by A.O., 1964, Art. 2 and Sch., for “collecting Government”.\n5\nSubs, by A.O., 1961, Art. 2 and Sch., for “Chief Controlling Revenue authority” (with effect from the 23rd March, 1956).\nFor definition, see the General Clauses Act, 1897 (Act No. X of 1897), s. 3 (9a). In the N.W.F.P., the reference to the Chief Controlling Revenue-\nauthority should be construed as a reference to the Revenue Commissioner.- See the N.W.F.P. Law and Justice Regulation, 1901 (VII of 1901), s. 6 (1)\n(d).\n6\nThe words “a Presidency Magistrate or” omitted by A.O., 1949, Sch.\n7\nThe words “or presidency-town” rep. by the Federal Laws (Revision and Declaration) Act, 1951 (Act No. XXVI of 1951), s. 3 and II. Sch."
    },
    {
      "provision_ref": "sec73",
      "section": "73",
      "title": "Section 73. Books, etc., to be open to inspection",
      "content": "Every public officer having in his custody any\nregisters, books, records, papers, documents or proceedings, the inspection whereof may tend to\nsecure any duty, or to prove or lead to the discovery of any fraud or omission in relation to any duty,\nshall at all reasonable times permit any person authorised in writing by the Collector to inspect for\nsuch purpose the registers, books, papers, documents and proceedings, and to take such notes and\nextracts as he may deem necessary, without fee or charge."
    },
    {
      "provision_ref": "sec74",
      "section": "74",
      "title": "Section 74. Power to make rules relating to sale of stamps",
      "content": "The l[Provincial Government] 2[* *\n*] may make 3rules for regulating—\n(a)        the supply and sale of stamps and stamped papers,\n(b)        the persons by whom alone such sale is to be conducted, and\n(c)        the duties and remuneration of such persons:\nProvided that such rules shall not restrict the sale of one anna 4[or half an anna] adhesive\nstamps."
    },
    {
      "provision_ref": "sec75",
      "section": "75",
      "title": "Section 75. Power to make rules generally to carry out Act",
      "content": "The 5[Provincial Government] may\nmake rules6 to carry out generally the purposes of this Act, and may by such rules prescribe the fines,\nwhich shall in no case exceed five hundred rupees, to be incurred on breach thereof."
    },
    {
      "provision_ref": "sec76",
      "section": "76",
      "title": "Section 76. Publication of rules",
      "content": "7[(1) All rules made under this Act shall be published in the\nofficial Gazette.]\n(2) All rules published as required by this section shall, upon such publication, have effect as\nif enacted by this Act.\n8\n[76A. Delegation of certain powers.— 9[The 10[Federal Government]] 11[* * *] and the\nProvincial Government, may by notification in the official Gazette] delegate—\n(a)        all or any of the powers conferred on it by sections 2 (9), 33 (3) (b), 70 (1), 74\nand 78 to the 12[Chief Revenue Authority] ; and\n(b)        all or any of the powers conferred on the 12[Chief Revenue Authority] by\nsections 45 (1) (2), 56 (I) and 70 (2) to such subordinate Revenue-authority as\nmay be specified in the notification.]\n1\nSubs. by A.O., 1964, Art. 2 and Sch., for “collecting Government” which had been subs. by A.O., 1937, for “L. G.”\n2\nThe words “subject to the control of the G.G. in C;” rep. by A. O. 1937.\n3\nFor such rules, see different local Rules and Orders.\n4\nIns. by the Indian Stamp (Amdt.) Act, 1906 (Act No. V of 1906)., s. 3.\n5\nSubs. by A.O., 1964, Art. 2 and Sch., for “collecting Government” which had been subs. by A.O., 1937, for “G. G. in C.”.\n6\nSee the Indian Stamp Rules, 1925.\nFor the Punjab Non-Judicial Stamps Refund, Renewal and Disposal Rules, 1954, see Gaz. of Punjab, 1954, Pt. I, p. 970.\n7\nSubs. by A.O., 1937, for the original sub-section.\n8\nS. 76A ins. by the Decentralization Act, 1914 (Act No. IV of 1914), s. 2 and Sch., Pt. I.\n9\nSubs. by A.O., 1937, for “The L. G. may, by notification in the local official Gazette”.\n10\nSubs. by F.A.O., 1975, Art, 2 and Table, for “Central Government”.\n11\nThe words and figures “subject to the provisions of section 124 (1) of the Government of India Act, 1935,” omitted by A.O., 1961, Art. 2 and Sch.\n(with effect from the 23rd March. 1956).\n12\nSubs, by A.O., 1961, Art. 2 and Sch., for “Chief Controlling Revenue authority” (with effect from the 23rd March, 1956).\nFor definition, see the General Clauses Act, 1897 (Act No. X of 1897), s. 3 (9a). In the N.W.F.P., the reference to the Chief Controlling Revenue-\nauthority should be construed as a reference to the Revenue Commissioner.- See the N.W.F.P. Law and Justice Regulation, 1901 (VII of 1901), s. 6 (1)\n(d)."
    },
    {
      "provision_ref": "sec77",
      "section": "77",
      "title": "Section 77. Saving as to court",
      "content": "fees.— Nothing in this Act contained shall be deemed to affect the\nduties chargeable under any enactment for the time being in force relating to court-fees."
    },
    {
      "provision_ref": "sec78",
      "section": "78",
      "title": "Section 78. Act to be translated and old cheaply",
      "content": "Every l[Provincial Government] shall make\nprovision for the sale of translation of this Act in the principal vernacular languages of the territories\nadministered by it at a price not exceeding four annas per copy."
    },
    {
      "provision_ref": "sec79",
      "section": "79",
      "title": "Section 79. [Repealed] Rep. by the Repealing and Amending Act, 1914 (X of 1914), s. 3 and Sch. II",
      "content": "_______\n1\nSubs. by A.O..1937, for “L. G.”.\n1\n[SCHEDULE 1\n[See sections 3 and 27A]\nDescription of instruments                                            Proper stamp-duty\n(1)                                                              (2)"
    },
    {
      "provision_ref": "sec27a",
      "section": "27A",
      "title": "Section 27A. DECLARATION OF ANY TRUST See TRUST",
      "content": "(No.64).\n27A        DECREE, RULE OF A COURT Four percent of the value\nOR AN ORDER OF A COURT based on of property.\nmutual consent of parties in cases involving\ntransfer on an immovable property including\nsale, exchange, gift or mortage, declaring or\nconferring a right in or title to an immovable\nproperty.\nExplanation:— Value in this Article, means\nvalue of property in accordance with the\nvaluation table as notified by the Collector or\nwhere valuation table is not available the\naverage sale price of a property of similar\nnature in the same revenue estate or locality in\nthe preceding year as may be determined by\nCollector."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. MORTGAGE OF A CROP, including",
      "content": "any instrument evidencing an agreement to secure\nthe repayment of a loan made upon any mortgage\nof a crop, whether the crop is or is not in existence\nat the time of mortgage—\n(a) when the loan is repayable not more        One Rupee\nthan three months from the date of\nthe instrument, for every two\nhundred rupees or part thereof of the\nsum secured; and\n(b) when the loan is repayable more than       Two Rupees\nthree months, but not more than\neighteen months, from the date of the\ninstrument, for every one hundred\nrupees or part thereof of the sum\nsecured."
    },
    {
      "provision_ref": "sec46a",
      "section": "46A",
      "title": "Section 46A. (b) in any other case One hundred Rupees Half",
      "content": "B—DISSOLUTION OF PAWN OR                           of the stamp duty\nPLEDGE—See AGREEMENT RELATING                           payable on original.\nTO DEPOSIT OF TITLE-DEEDS, PAWN OR\nPLEDGE (No. 6)."
    }
  ],
  "definitions": []
}
