{
  "id": "pk-standards-of-weight-act-1939",
  "type": "statute",
  "title": "Standards of Weight Act, 1939",
  "title_en": "Standards of Weight Act, 1939",
  "short_name": "SOWA",
  "status": "in_force",
  "issued_date": "1939-03-27",
  "in_force_date": "1939-03-27",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJaX-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Standards of Weight Act, 1939 (IX of 1939) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Standards of\nWeight Act, 1939.\n1\n[(2) It extends to the whole of Pakistan.]\n(3) It shall come into force on such date2 as the 3[Federal Government] may, by notification\nin the official Gazette, appoint."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Unit for weight",
      "content": "(1) The unit for weight shall be the standard grain, that is to say, that\nweight which when multiplied by 1799.84585 is the weight in vacuo of the iridio-platinum cylinder\nin the custody of the 4[Mint Master, Lahore], certified by the Standards Department of the British\nBoard of Trade as having a weight of 1799.84585 grains in vacuo.\n(2) The standard grain shall be the only unit from which all other standard weights shall be\nascertained."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Standard weights",
      "content": "(1) There shall be the following standard weights, namely : __\n(a)        the standard tola, being a weight of 180 standard grains;\n(b)        the standard seer, being a weight of 80 standard tolas or 14,400 standard\ngrains;\n(c)        the standard maund, being a weight of 40 standard seers;\n(d)        the standard pound, being a weight of 7,000 standard grains;\n(e)        the standard ounce, being one-sixteenth part of the weight of a standard\npound;\n(f)        the standard hundredweight, being a weight of 112 standard pounds;\n(g)        the standard ton, being a weight of 2,240 standard pounds.\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch. (w. e. f. fourteenth day of October, 1955).\n2\nThe 1st July, 1942, see Notification No. 33-C (b)/37-A., dated the 13th June, 1942, Gazette of India, 1942, Pt. I, p. 1012.\n3\nSubs. by the Federal Adaptation of Laws Order, 1975 (P.O. No. 4 of 1975), Art. 2 and Table.\n4\nSubs. by the Adaptation of Central Acts and Ordinance Order, 1949 (Order No. 4 of 1949).\n(2) No weight other than the weights set forth in sub-section (1) and integral multiples or\nsub-multiples of any such weight shall be used as a standard weight."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Sets of standard weights",
      "content": "(1) The 1[Federal Government] shall cause to be prepared one\nset of such of the standard weights specified in sub-section (1) of section 3 or multiples or\nsub-multiples thereof as the 1[Federal Government] may consider expedient, and shall cause each\nweight of such set to be authenticated as having been ascertained from the standard grain, and shall\ndeposit the set in such custody as the 1[Federal Government] may think fit.\n(2) The 1[Federal Government] shall cause similar sets of weights, similarly authenticated, to\nbe prepared, and shall supply one set to each Provincial Government.\n(3) The 1[Federal Government] shall cause similar sets of weights, similarly authenticated, to\nbe prepared and shall supply one set to the Government of any 2[Acceding State or non Acceding\nState] 3[* * *] which applies for it and pays the price fixed by the 1[Federal Government]."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Rules",
      "content": "(1) The 1[Federal Government] may, by notification in the official Gazette, make\nrules for carrying into effect the provisions of this Act.\n(2) Without prejudice to the generality of the foregoing power, rules made under this section\nmay regulate__\n(a)        the preparation of the sets of standard weights referred to in section 4 ;\n(b)        the custody of the set of such weights which is to be maintained by the\n1\n[Federal Government] and the periodical verification and adjustment thereof ;\n(c)        the periodical verification and adjustment of the sets of standard weights\nsupplied to Provincial and other Governments."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. 4[Repeal.]",
      "content": "___________\nDate: 31-07-2024\n1\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table.\n2\nSubs. by the Adaptation of Central Acts and Ordinance Order, 1949 (Order No. 1 of 1949).\n3\nOmitted by the Federal Laws (Revision and Declaration) Act, 1951 (XXVI of 1951), s. 3 and 2nd Sch.\n4\nRep. by the Repealing and Amending Act, 1942 (XXV of 1942), s. 2 and 1st Sch."
    }
  ],
  "definitions": []
}
