{
  "id": "pk-state-bank-of-pakistan-sbp-banking-services-corporation-ordinance-2001",
  "type": "statute",
  "title": "State Bank of Pakistan (SBP) Banking Services Corporation Ordinance, 2001",
  "title_en": "State Bank of Pakistan (SBP) Banking Services Corporation Ordinance, 2001",
  "short_name": "SBOPB",
  "status": "in_force",
  "issued_date": "2001-12-30",
  "in_force_date": "2001-12-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pr-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of State Bank of Pakistan (SBP) Banking Services Corporation Ordinance, 2001 (LXVII of 2001) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Share capital and limited liability.⸺(1) The authorized share capital of the Bank",
      "content": "shall be one billion rupees or such other amount the State Bank may, from time to time,\ndetermine by order in writing and shall be divided into shares of one million rupees each.\n(2) The paid-up capital of the Bank shall be such amount as may, from time to time,\nby order in writing be determined by the State Bank and held, inter alia, by it, including the\nfully paid-up shares issued to it under sub-section (7) of section 15.\n(3) The share capital may be divided into different kinds and classes therein as may be\nprescribed by regulations.\n(4) The liability of shareholders of the Bank shall be limited to the amount, if any, not\nfully paid-up on the shares held by them in the capital of the Bank."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Board of Directors.⸺(1) The general superintendence, direction and management",
      "content": "of the affairs and business of the Bank and overall policy making in respect of its operations\nshall vest in the Board of Directors which may exercise all such powers and do all such acts,\ndeeds and things that may be exercised or done by the Bank.\n(2) In discharging its functions, the Board shall ensure compliance with the orders and\ndirections that may be issued by the State Bank from time to time.\n(3) The Board shall consist of⸺\n(a)          members of the Central Board of the State Bank; and\n(b)          the Managing Director.\n1\nSubs. and added by Act No. XXVI of 2021, s. 2.\n(4) The meetings of the Board shall be held at such times and places as may be\nprescribed by regulations or, until so prescribed by regulations, as and when convened by the\nChairman.\n(5) No act or proceedings of the Board shall be invalid merely on the ground of the\nexistence of any vacancy in, or defect in the constitution of, the Board.\n(6) The quorum of meetings of the Board, shall be as may be prescribed by\nregulations or, until so prescribed by regulation, shall be five Directors.\n(7) All decisions of the Board shall be taken by majority of the Directors present and\nvoting at a meeting duly convened and held, and in the event of an equality of votes, the\nChairman may exercise a casting vote.\n(8) A resolution in writing signed by all Directors shall be as effective as if such\nresolution had been passed at a meeting of the Board."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Chairman.⸺(1) The Governor shall be the Chairman of the Bank",
      "content": "(2) The Chairman shall, whenever present, preside over meetings of the Board, but if\nat any meeting the Governor is not present, a Deputy Governor of the State Bank, designated\nfor this purpose by the Governor, shall attend the meeting on behalf of the Governor and\npreside over such meeting provided that if the Deputy Governor being present, is not willing\nto act, or is also absent, the Directors present shall choose one of their member to be the\nChairman of such meeting."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Managing Director.⸺(1) The Managing Director shall be appointed by the State",
      "content": "Bank.\n(2) The Managing Director shall hold office during the pleasure of the State Bank.\n(3) The Managing Director shall be the chief executive officer of the Bank and shall,\nsubject to the control and direction of the Board, administer the affairs of the Bank, and shall\nhave such powers for this purpose as are from time to time delegated to him by the Board.\n(4) The salary and other terms and conditions of service of the Managing Director\nshall be such as the Board may determine.\n(5) The Managing Director shall devote his whole time and attention to the affairs of\nthe Bank, provided that the Managing Director may, in addition to his duties as the Managing\nDirector, be entrusted with such other duties for such period as the State Bank may, by order\nin writing, determine.\n1\n[(6) At any time when the office of the Managing Director is vacant, the Governor may\nwithin a period of sixty days from the date of vacancy appoint any officer of the State Bank or\nfrom the Bank as acting Managing Director:\nProvided that the Managing Director shall be appointed under sub-section (1) within a\nperiod of three months of the occurrence of vacancy.]\n__________________________________________________________________________\n1\nAdded by Act No. XXVI of 2021, s. 3."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Disqualification’s of the Managing Director.⸺No person shall be appointed or",
      "content": "hold office as Managing Director⸺\n(a)     who is a member of the Senate, National Assembly, any Provincial\nAssembly, or an elected member of a local council or local body\nconstituted under any law relating to local councils or local bodies;\n(b)     who is employed in any capacity in the service of the Federal\nGovernment or of a Provincial Government or holds any office or\nposition for which any salary or other remuneration is payable out of\npublic funds;\n(c)     who is a director, officer or employee of any other bank or of a financial\ninstitution or has an interest as a shareholder in any other bank or\nfinancial institution:\nProvided that nothing in this clause shall apply where the\nManaging Director is in the employment of the State Bank or where the\nManaging Director is, in addition to holding the office of Managing\nDirector of the Bank, entrusted with additional duties under sub-section\n(5) of section 9;\n(d)     who has been convicted of tax evasion under any law, or has been\nconvicted or proceedings are pending against him under section 412 of\nBanking Companies Ordinance, 1962 (LVII of 1962), or has been\nconvicted by a court of law for an offence involving moral turpitude;\n(e)     who is in default of payments due from him to any bank, financial\ninstitution, cooperative society, Government department, Government\ncontrolled or managed company or corporation and for the purpose of\nthis clause, default in payment by the spouse, dependent children, and\ncompanies, firms and other business concerns under the control or\nmanagement of a person shall be considered as the default of such\nperson; or\n(f)      who holds an office in a political party."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Committees of Directors.⸺(1) The Board may constitute one or more",
      "content": "Committees consisting of such number of Directors as it may determine.\n(2) The powers, functions, duties and other terms of appointment of a Committee of\nDirectors shall be such as the Board may determine.\n(3) The members of a Committee of Directors shall hold office for such period as the\nBoard may determine.\n(4) The minutes of every meeting of a Committee of Directors shall be laid before the\nBoard at its next meeting following the meeting of the Committee.\n(5) Subject to the general and any special directions of the Board, a Committee of\nDirectors shall deal with any matter entrusted to it by the Board."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Delegation of powers and appointment of attorneys.⸺(1) The Board may, for",
      "content": "the purpose of ensuring smooth and efficient functioning of the Bank and facilitating\ntransactions of its daily business, by resolution, delegate to the Managing Director or any\nother executive of the Bank, subject to such conditions and limitations, if any, as may be\nspecified therein, such of its powers and duties under this Ordinance as it may deem\nnecessary.\n(2) The Board may, from time to time, by resolution appoint any company, firm or\nperson to be the attorney of the Bank for such purposes and with such powers, authorities and\ndiscretions, not exceeding those vested in or exercisable by the Board under this Ordinance\nand for such period and subject to such conditions as the Board may think fit, and any such\nresolution may contain such provisions for the protection and convenience of persons dealing\nwith any such attorney as the Board may think fit."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Accounts and audit.⸺(1) The accounting year of the Bank shall commence on",
      "content": "the first day of July and end on the thirtieth day of June.\n(2) The Bank shall maintain proper accounts and other records to reflect true and fair\nview of its state of affairs and prepare annual statement of accounts, including the profit and\nloss accounts and balance sheet.\n(3) The accounts of the Bank shall be audited by one or more auditors who shall be\nchartered accountants within the meaning of the Chartered Accountants Ordinance, 1961\n(X of 1961), to be appointed by the 1[Board].\n(4) Every auditor shall be supplied with a copy of the annual statement of accounts\nand it shall be the duty of the auditor to examine the same together with the accounts and\nvouchers relating thereto, and every auditor shall have a list delivered to him of all books\nkept by the Bank and shall, at all reasonable times, have access to books, accounts and other\ndocuments of the Bank and may employ accountants or other persons to assist him in\nauditing such accounts and may, in relation to such accounts, examine the Managing\nDirector, any Director and executive of the Bank.\n(5) The auditors shall submit a report to the Board and to the State Bank regarding the\nannual statement of accounts, and in any such report they shall state whether in their opinion\nthe statement of accounts is a full and fair statement of accounts containing all necessary\nparticulars and is properly drawn up so as to exhibit a true and correct view of the state of\naffairs of the Bank and, in case they have called for any explanation or information from the\nManaging Director or the Board, whether it has been given and whether it is satisfactory.\n(6) The Board may, in addition to the audit under sub-sections (3) and (4), cause to be\ncarried out internal audit of the Bank’s accounts and the internal auditors’ reports shall be\nsubmitted to the Board."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Liquidation of the Bank.⸺The Bank shall not be placed in liquidation save by",
      "content": "1\nSubs. by Act No. XXVI of 2021, s. 4\norder of the State Bank and in such manner and on such terms and conditions as the State\nBank may direct.\n________\nTRANSFER OF THE UNDERTAKING BY THE STATE BANK."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Transfer of undertaking to the Bank.⸺(1) Subject to the powers under section",
      "content": "5, the State Bank may direct, by Transfer Order and as particularly described in such Order,\nthat (i) the operational functions and activities of the State Bank; (ii) all related offices and\ndepartments; (iii) all related assets and liabilities; and (iv) certain employees of the State\nBank shall transfer to and vest in the Bank as of the Transfer Date.\n(2) On the making of the Transfer Order by the State Bank under sub-section (1), the\nTransferred Undertaking and the Transferred Employees shall stand transferred to and vest in\nthe Bank as on the Transfer Date and shall be operated, managed and regulated by the Bank\nas the undertaking and employees of the Bank, provided that the rules and regulations of\nthe State Bank applicable to the operation of the Transferred Undertaking and to the\nemployment of the Transferred Employees as of immediately before the Transfer Date shall\ncontinue to be applied by the Bank unless altered by the Board with the approval of the State\nBank.\n(3) For the purposes of sub-section (1),⸺\n(a)        “assets” include properties whether tangible or intangible, rights,\nbenefits and entitlements of every description and nature (other than\nimmovable property) of the State Bank and relating to, as of the\nTransfer Date, the operational functions and activities of the State Bank\nand to the related offices and departments;\n(b)       “employees” means the employees of the State Bank as are\nspecified in the Transfer Order;\n(c)     “liabilities” include debts, obligations, commitments, loans,\nencumbrances, claims and charges of every description and nature,\nactual or contingent of the State Bank and related to, as on the\nTransfer Date, the operational functions and activities of the State\nBank and to the related offices and departments;\n(d)     “related offices and departments” include all field offices of the State\nBank and certain other offices and departments, in full or in part, as are\nspecified in the Transfer Order; and\n(e)      “operational functions and activities” shall consist of the following,\nnamely:⸺\n(i)     revenue collection and payments for and on behalf of\nthe Federal Government, a Provincial Government,\nlocal governments, local bodies or any other\ngovernmental body, authority, institution, company or\ncorporation;\n(ii)    maintenance of the accounts of the Federal Government,\na Provincial Government, local governments, local\nbodies, other governmental bodies, authorities,\ninstitutions, companies, corporations and of other banks\nand financial institutions;\n(iii)    operational work relating to management of debt;\n(iv)     operational work relating to foreign exchange;\n(v)       prize bonds and Government savings schemes;\n(vi)    cash and other business as provided for in agreements\nbetween the State Bank and the Federal Government and\nbetween the State Bank and the Provincial Governments\nor in the Act, the Foreign Exchange Regulation Act,\n1947 (VII of 1947), the Banking Companies Ordinance,\n1962 (L VII of 1962), the Public Debt Act, 1944 (XVIII\nof 1944), the Securities Act, 1920 (X of 1920), or in any\nother applicable laws, rules, regulations, orders and\nnotifications made or issued thereunder; and\n(vii)   any other business, offices or departments, and functions,\nin full or in part, as may be set out in or authorised or\ndelegated by the Transfer Order.\n(4) As and after the Transfer Date, the Bank shall undertake, pay, satisfy, discharge,\nperform and fulfil all debts, liabilities, contracts, engagements, commitments and obligations\nwhatsoever of the State Bank existing immediately before the Transfer Date and comprised in\nor exclusively relating to the Transferred Undertaking, and as on the Transfer Date, the State\nBank shall stand released and discharged from all such debts, liabilities, contracts,\nengagements, commitments and obligations.\n(5) All agreements, contracts, deeds, bonds, securities, powers of attorney, grants of\nlegal representations, guarantees, letters of credit, negotiable instruments and other\ninstruments of whatever kind subsisting or having effect as at immediately before the\nTransfer Date to which the State Bank may be a party or which shall be in favour of the State\nBank and which are comprised in the Transferred Undertaking or exclusively relate thereto\nshall be of full force and effect, on the Transfer Date, against or in favour of the Bank and be\nenforced or acted upon by or against the Bank, as if instead of the State Bank, the Bank had\nbeen a party thereto or as if the same had been issued by or in favour of the Bank.\n(6) All suits, appeals or other legal proceedings, including arbitration proceedings, of\nwhatsoever nature by, or against, the State Bank which exclusively relate to the Transferred\nUndertaking and which shall be pending immediately before the Transfer Date in any court,\ntribunal, other competent authority or before any arbitrator shall be continued exclusively by,\nor against, the Bank and the State Bank shall cease to be a party to such suits, appeals or\nother legal proceedings.\n(7) In consideration of the transfer to the Bank of the Transferred undertaking under\nsub-section (1), the Bank shall issue such number of fully paid-up shares in its share capital\nto the State Bank as shall be specified in the Transfer Order.\n(8) Notwithstanding anything in the Stamp Act, 1899 (II of 1899), or any other law\nfor the time being in force no stamp duty, registration or any other similar tax or levy shall\nbe payable under any law for the time being in force on or in relation to the vesting and\ntransfer made by the Transfer Order.\n(9) The State Bank may take all such further, supplemental, incidental and\nconsequential actions, and steps as may be necessary to give full effect to the provisions of\nthis section."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Employees transferred to the Bank.⸺(1) The Transfer Order shall specify by",
      "content": "category or by name the employees of the State Bank who shall, as from the Transfer Date,\nstand transferred to, and become the employees of, the Bank by virtue of the Transfer Order.\n(2) The Transferred Employee shall not be entitled to any compensation or any other\npayments whatsoever as a consequence of transfer to the Bank.\n(3) The existing terms and conditions of service and the benefits to which the\nTransferred Employees are entitled to in the State Bank, including pension, gratuity,\nprovident and benevolent funds benefits and benefits of the existing staff regulations shall be\nassured to the Transferred Employees upon their transfer to the Bank except where altered\nwith the consent of the Transferred Employees.\n(4) As from the Transfer Date, the benefits accrued to the Transferred Employees\nunder the State Bank’s pension, gratuity, provident fund, benevolent fund and any other\nemployees benefit schemes of the State Bank shall be transferred to similar funds and schemes\nestablished by the Bank and the Transferred Employees shall be deemed to have become\nmembers of, and become entitled to the benefits of, such funds and schemes of the Bank.\n(5) For the purpose of payment of benefits to the Transferred Employees under the\npension, gratuity, provident and benevolent funds and other employees benefits schemes of\nthe Bank, the period of employment of the Transferred Employees under the State Bank shall\ncount towards their employment under the Bank notwithstanding the date of transfer of the\nTransferred Employees to the Bank\n____________"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Power of the State Bank to give direction.⸺(1) Where the State Bank is",
      "content": "satisfied that⸺\n(a)     in the public interest; or\n(b)     to prevent the affairs of the Bank being conducted in a manner\ndetrimental to the interests of its customers or in a manner prejudicial to\nthe interests of the Bank or of the State Bank; or\n(c)    to secure the proper management of the Bank generally,\nit is necessary to issue directions to the Bank, the State Bank\nmay, from time to time, issue such directions as it may deem fit and the\nBank shall be bound to comply with such directions.\n(2) The State Bank may, on representation made to it, or on its own motion, modify or\ncancel any direction issued under sub-section (1) and in so modifying or cancelling any such\ndirection may impose such conditions as it thinks fit, subject to which the modifications or\ncancellation shall have effect.\n____________"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Delegation of the powers of the State Bank.⸺(1) The State Bank may, by",
      "content": "order in writing, direct that all or any of the State Bank’s powers and functions under\nthis Ordinance, the Act, the Banking Companies Ordinance, 1962(LVII of 1962), the Foreign\nExchange Regulation Act, 1947(VII of 1947), or under any other law, rules, regulations,\norders, notifications or bye-laws for the time being in force shall, subject to the provision of\nsection 5 of this Ordinance, be exercised by the Bank, as the State Bank may, from time to\ntime, specify by order in writing.\n(2) Where the Governor or any other executive of the State Bank authorised by the\nGovernor in this behalf has, under sub-section (1), directed that any of the State Bank’s\npowers or functions under any law, rules, regulations, orders, notifications or bye-laws for\nthe time being in force shall be exercised, or performed, by the Bank the Board may, by\nresolution, direct that any of such powers and functions shall be exercised, or performed,\nsubject to such limitations, restrictions or conditions, if any, as the Board may, from time to\ntime, impose by the Managing Director or any other Director, executive or other employee of\nthe Bank specified by the Board."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Appointments under section 23B of the Foreign Exchange Regulation Act,",
      "content": "1947.⸺(1) Notwithstanding the provisions of section 23B of the Foreign Exchange\nRegulation Act, 1947(VII of 1947), the State Bank may, by order in writing, authorize in\nrelation to any area specified in such order any executive of the Bank to act as the Director of\nAdjudication, an Additional Director of Adjudication, a Joint Director of Adjudication, a\nDeputy Director of Adjudication or an Assistant Director of Adjudication for the purposes of\nsection 23B thereof.\n(2) The executives of the State Bank currently acting as the Director of Adjudication,\nthe Additional Director of Adjudication, the Joint Director of Adjudication, the Deputy\nDirector of Adjudication, and the Assistant Director of Adjudication in respect of any area and\ntransferred to the Bank pursuant to the Transfer Order shall continue to hold such\nappointments until removed by the State Bank and shall be deemed to have been appointed\nby the Federal Government for the purposes of section 23B of the Foreign Exchange\nRegulation Act, 1947 (VII of 1947).\n_____________"
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Duty of officers and servants to maintain secrecy.⸺(1) Except in the",
      "content": "performance of his duties under this Ordinance, every executive or other employee of the\nBank shall preserve and aid in preserving secrecy with regard to all matters relating to the\naffairs of the Bank and of the State Bank coming to his knowledge and not published by the\nBank or by the State Bank and with regard to all matters relating to the financial or monetary\naffairs of any bank, institution, person, body of persons, any Government or authority\nwhether in Pakistan or outside Pakistan that may come to his knowledge in the performance\nof his duties.\n(2) Every such executive or other employee who communicates any such matter,\nexcept when required by law so to do, or in the discharge of his duties as such, shall be guilty\nof an offence punishable with imprisonment of either description for a term which may\nextend to three years, or with fine which may extend to one hundred thousand rupees, or with\nboth.\n(3) No court shall take cognizance of any offence punishable under this section except\nupon a complaint in writing by a person authorized in this behalf by the Board."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Bank and its officers to be public officers.⸺(1) For the purposes of Article 7 of",
      "content": "the Qanun-e-Shahadat Order, 1984 (P.O. No. 10 of 1984), the provisions of Part IV of the\nCode of Civil Procedure, 1908 (Act V of 1908), and the provisions of rule 27 of Order V, and\nrule 52 of Order XXI of the said Code, the Bank and any person in the service of the Bank\nacting in his capacity as such shall be deemed to be a public officer.\n(2) The provisions of Article 6 of the Qanun-e-Shahadat Order, 1984 (P.O. No.10 of\n1984), shall apply to the unpublished records of the Bank and the Managing Director shall be\ndeemed to be the officer or head of the department concerned."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Persons in the service of the Bank to be public servants.⸺Every person in the",
      "content": "service of the Bank shall be deemed to be a public servant within the meaning of section 21\nof the Pakistan Penal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Production of unpublished records of the Bank etc.⸺(1) No court, tribunal or",
      "content": "other authority shall be entitled to compel the Bank or any person in the service of the Bank\nto produce or, as the case may be, give any evidence derived from, any unpublished records,\nof the Bank.\n(2) No court, tribunal or other authority shall permit any one to produce or give\nevidence derived from, any unpublished records of the Bank, except with the prior permission\nin writing of the Managing Director who may give or withhold such permission as he thinks\nfit.\n(3) Notwithstanding anything contained in this Ordinance or any other law for the\ntime being in force, a report prepared by the Bank on a banking company under any law for\nthe time being in force shall be deemed to be unpublished for the purposes of sub-sections (1)\nand (2) even if a copy of such report has been supplied to the banking company to which the\nreport pertains, the State Bank or the Federal Government.\n1\n[24. Pension, gratuity and provident fund of Bank employees to be exempt from\nattachments, etc.—Notwithstanding anything contained in any law for the time being in force,\npensions, gratuity and provident fund of the executives and other employees or pensioners shall\nnot be liable to seizure, attachment or sequestration by process of any court order at the instance\nof accreditor, decree holder etc., for any demand against the executives, employees or\npensioners or in satisfaction of a decree or order of any court.]\n1\n[24A. Act or proceeding of the Board not to be questioned.—No act or proceeding\nof the Board or the committees of the Board shall be questioned on the ground only on the\nexistence of any vacancy in or any defect in the constitution of such Board or committee\nthereof.]"
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Exemption from taxes.⸺Notwithstanding anything contained in the Wealth Tax",
      "content": "Act, 1963 (XV of 1963), and the Income Tax Ordinance, 1979 (XXXI of 1979), or any other\nlaw for the time being in force relating to wealth tax, income tax or super tax, the Bank shall\nnot be liable to pay any wealth tax, income tax or super tax on its income or wealth."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Power to make rules.⸺The State Bank may, by notification in the official",
      "content": "Gazette, make rules, consistent with the provision of this Ordinance, for carrying out the\npurposes of this Ordinance."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Power to make regulations.⸺(1) The Bank may, subject to the prior approval of",
      "content": "the rules made thereunder, to provide for all matters for which provision is necessary or\nconvenient for the purpose of giving effect to the provisions of this Ordinance.\n(2) Where any provision of the regulations is inconsistent with any provision of the\nrules, the provision of the rules shall prevail.\n(3) Where the State Bank considers it expedient so to do, it may by order in writing,\ndirect the Bank to make any regulations or to amend or rescind any regulations already made,\nwithin such period as it may specify in this behalf.\n(4) If the Bank fails or neglects to comply with any direction of the State Bank under\nsub-section (3) within the specified period, the State Bank may make, amend or rescind any\nregulation directed by the State Bank to be made, amended or rescinded, and a regulation so\nmade, amended or rescinded by the State Bank shall be deemed to have been made, amended\nor rescinded by the Bank in accordance with the provisions of this section and shall have\neffect accordingly.\n1\n[28. Protection of action taken in good faith.—No suit or other legal proceedings\nshall lie against the State Bank and the Bank or any director or officer of the State Bank and\nthe Bank for anything which is in good faith done or intended to be done in pursuance of this\nOrdinance or of any rules, regulations or orders made thereunder.]\n1\nSubs. and ins. by Act No. XXVI of 2021, ss. 5-7."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Ordinance to override, etc.⸺(1) Except the application of any provision of the",
      "content": "Act to the Bank as a subsidiary of the State Bank, this Ordinance shall have effect\nnotwithstanding anything contained in any law for the time being in force or in any\nagreement, contract, or other applicable document or instrument.\n(2) The Banking Companies Ordinance, 1962 (LVII of 1962), shall not apply to the\nBank."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Removal of difficulties.⸺If any difficulty arises in giving effect to any of the",
      "content": "provisions of this Ordinance, the State Bank may make such order not inconsistent with the\nprovisions of this Ordinance, as may appear to it to be necessary for the purposes of\nremoving the difficulty:\nProvided that no such power shall be exercised after the expiry of two years from the\ncommencement of this Ordinance.\n_______________"
    }
  ],
  "definitions": []
}
