{
  "id": "pk-state-immunity-ordinance-1981",
  "type": "statute",
  "title": "State Immunity Ordinance, 1981",
  "title_en": "State Immunity Ordinance, 1981",
  "short_name": "SIO",
  "status": "in_force",
  "issued_date": "1981-03-10",
  "in_force_date": "1981-03-10",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bZuY-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of State Immunity Ordinance, 1981 (VI of 1981) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Repeal",
      "content": "ORDINANCE VI OF 1981\n[11th March, 1981]\nAn Ordinance to amend and consolidate the law relating to the immunity of States from the\njurisdiction of Courts.\nWHEREAS it is expedient to amend and consolidate the law relating to the immunity of\nStates from the jurisdiction of Courts;\nAND WHEREAS the President is satisfied that circumstances exist which render it\nnecessary to take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, read\nwith the Laws (Continuance in Force) Order, 1977 (C. M. L. A. Order No. 1 of 1977), and in\nexercise of all powers enabling him in that behalf, the President is pleased to make and promulgate\nthe following Ordinance :___"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.⸻(1) This Ordinance may be called the State",
      "content": "Immunity Ordinance, 1981.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Interpretation",
      "content": "_ In this Ordinance, “Court” includes any tribunal or body exercising\njudicial functions."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. General immunity from jurisdiction",
      "content": "_ (1) A State is immune from the jurisdiction of\nthe Courts of Pakistan except as hereinafter provided.\n(2) A Court shall give effect to the immunity conferred by sub-section (1) even if the State\ndoes not appear in the proceedings in question."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Submission to jurisdiction",
      "content": "_(1) A State is not immune as respects proceedings in\nrespect of which it has submitted to jurisdiction.\n(2) A State may submit to jurisdiction after the dispute giving rise to the proceedings has\narisen or by a prior agreement; but a provision in any agreement that it is to be governed by the law\nof Pakistan shall not be deemed to be a submission.\nExplanation.___ In this sub-section and in sub-section (3) of section 14, “agreement” includes\na treaty, convention or other international agreement.\n(3) A State shall be deemed to have submitted ___\n(a)    if it has instituted the proceedings; or\n(b)    subject to sub-section (4) it has intervened or taken any step in the\nproceedings.\n(4) Clause (b) of sub-section (3) does not apply—\n(a)    to intervention or any step taken for the purpose only of-\n(i)     claiming immunity; or\n(ii)    asserting an interest in property in circumstances such that the State\nwould have been entitled to immunity if the proceedings had been\nbrought against it; or\n(b)    to any step taken by the State in ignorance of the facts entitling it to immunity\nif those facts could not reasonably have been ascertained and immunity is\nclaimed as soon as reasonably practicable.\n(5) A submission in respect of any proceedings extends to any appears but not to any counter\nclaim unless it arises out of the same legal relationship or facts as the claim.\n(6) The head of a State’s diplomatic mission in Pakistan, or the person for the time being\nperforming his functions, shall be deemed to have authority to submit on behalf of the State in\nrespect of any proceedings; and any person who has entered into a contract on behalf of and with the\nauthority of a State shall be deemed to have authority to submit on its behalf in respect of pro-\nceedings arising out of the contract."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Commercial transactions and contracts to be performed in Pakistan",
      "content": "_ (1) A State is\nnot immune as respects proceedings relating to___\n(a)    a commercial transaction entered into by the State; or\n(b)    an obligation of the State which by virtue of a contract, which may or may not\nbe a commercial transaction, falls to be performed wholly or partly in\nPakistan.\n(2) Sub-section (1) does not apply to a contract of employment between a State and an\nindividual or if the parties to the dispute are States or have otherwise agreed in writing; and clause\n(b) of that subsection does not apply if the contract, not being a commercial transaction, was made in\nthe territory of the State concerned and the obligation in question is governed by its administrative\nlaw.\n(3) In this section “commercial transaction” means___\n(a)    any contract for the supply of goods or services;\n(b)    any loan or other transaction for the provision of finance and any guarantee or\nindemnity in respect of any such transaction or of any other financial\nobligation; and\n(c)    any other transaction or activity, whether of a commercial, industrial financial,\nprofessional or other similar character, into which a State enters or in which it\nengages otherwise than in the exercise of its sovereign authority."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Contracts of employment",
      "content": "_(1) A State is not immune as respects proceedings relating to\na contract of employment between a State and an individual where the contract was made, or the\nwork is to be wholly or partly performed in Pakistan;\nExplanation.___ In this subsection, “proceedings relating to a contract of employment”\nincludes proceedings between the parties to such a contract in respect of any statutory rights or\nduties to which they are entitled or subject as employer or employee.\n(2) Subject to sub-sections (3) and (4), sub-section (1) does not apply if___\n(a)    at the time when the proceedings are brought the individual is a national of the\nState concerned; or\n(b)    at the time when the contract was made the individual was neither a citizen of\nPakistan nor habitually resident in Pakistan; or\n(c)    the parties to the contract have otherwise agreed in writing.\n(3) Where the work is for an office, agency or establishment maintained by the State in\nPakistan for commercial purposes, clauses (a) and (b) of sub-section (2) do not exclude the\napplication of sub-section (1) unless the individual was, at the time when the contract was made,\nhabitually resident in that State.\n(4) Clause (c) of sub-section (2) does not exclude the application of sub-section (1) where the\nlaw of Pakistan requires the proceedings to be brought before a Court in Pakistan."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Ownership, possession and use of property",
      "content": "_(1) A State is not immune as respects\nproceedings relating to___\n(a)     any interest of the State in, or its possession or use of, immovable property in\nPakistan; or\n(b)    any obligation of the State arising out of its interest in, or its possession or use\nof, any such property.\n(2) A State is not immune as respects proceedings relating to any interest of the State in\nmovable or immovable property, being an interest arising by way of succession, gift or bona\nvacantia.\n(3) The fact that a State has or claims an interest in any property shall not preclude any Court\nfrom exercising in respect of such property any Jurisdiction relating to the estates of deceased\npersons or persons of unsound mind or to insolvency, the winding up of companies or the\nadministration of trusts.\n(4) A Court may entertain proceedings against a person other than a State notwithstanding\nthat the proceedings relate to property___\n(a)    which is in the possession of a State; or\n(b)    in which a State claims an interest, if the State would not have been immune\nhad the proceedings been brought against it or, in a case referred to in clause\n(b), if the claim is neither admitted nor supported by prima facie evidence."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Patents, trade marks, etc. A State is not immune as respects proceedings relating to",
      "content": "_\n(a)    any patent, trade mark, design or plant breeders’ rights belonging to State\nwhich are registered or protected in Pakistan or for which the state has applied\nin Pakistan;\n(b)    an alleged infringement by the State in Pakistan of any patent, trade mark,\ndesign, plant breeders’ rights or copyrights ; or\n(c)    the right to use a trade or business name in Pakistan."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Membership of bodies corporate, etc",
      "content": "_(1) A State is not immune as respects\nproceedings relating to its membership of a body corporate, an unincorporated body or a partnership\nwhich___\n(a)    has members other than States; and\n(b)    is incorporated or constituted under the law of Pakistan or is controlled from,\nor has its principal place of business in, Pakistan, being proceedings arising\nbetween the State and the body or its other members or, as the case may be,\nbetween the State and the other partners.\n(2) Sub-section (1) does not apply if provision to the contrary has been made by an\nagreement in writing between the parties to the dispute or by the constitution or other instrument\nestablishing or regulating the body or partnership in question."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Arbitrations",
      "content": "_(1) Where a State has agreed in writing to submit a dispute which has\narisen, or may arise, to arbitration, the State is not immune as respects proceedings in the courts of\nPakistan which relate to the arbitration.\n(2) Sub-section (1) has effect subject to the provisions of the arbitration agreement and does\nnot apply to an arbitration agreement between States."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Ships used for commercial purposes",
      "content": "_ (1) The succeeding provisions of this section\napply to___\n(a)    Admiralty proceedings; and\n(b)     proceedings on any claim which could be made the subject of Admiralty\nproceedings.\n(2) A State is not immune as respects___\n(a)     an action in rem against a ship belonging to it; or\n(b)     an action in personam for enforcing a claim in connection with such a ship;\nif, at the time when the cause of action arose, the ship was in use or intended\nfor use for commercial purposes.\n(3) Where an action in rem is brought against a ship belonging to a State for enforcing a\nclaim in connection with another ship belonging to that State, clause (a) of sub-section (2) does not\napply as respects the first-mentioned ship unless, at the time when the cause of action relating to the\nother ship arose, both ships were in use or intended for use for commercial purposes.\n(4) A State is not immune as respects,___\n(a)     an action in rem against a cargo belonging to that State if both the cargo and\nintended for use for commercial purposes; .or\n(b)     an action in personam for enforcing a claim in connection with such a cargo if\nthe ship carrying it was then in use or intended for use as aforesaid.\n(5)     in the foregoing provisions references to a ship or cargo belonging to a State include\nreferences to a ship or cargo in its possession or control or in which it claims an interest; and, subject\nto sub-section (4), sub-section (2) applies to property other than a ship as it applies to a ship.\n(6)     Sections 5 and 6 do not apply to proceedings of the nature mentioned in sub-section\n(1) if the State in question is a party to the Brussels Convention and the claim relates to the operation\nof a ship owned or operated by that State, the carriage of cargo or passengers on any such ship or the\ncarriage of cargo owned by that State on any other ship.\nExplanation.___ In this section, “Brussels Convention” means the International Convention\nfor the Unification of Certain Rules Concerning the Immunity of State-owned Ships signed in\nBrussels on the tenth day of April 1926, and “ship” includes hovercraft."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Value added tax, customs",
      "content": "duties, etc. A State is not immune as respects proceedings\nrelating to its liability for___\n(a)     value added tax, any duty of customs or excise or any agricultural levy; or\n(b)     rates in respect of premises occupied by it for commercial purposes."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Service of process and judgment in default of appearance",
      "content": "_ (1) Any notice or other\ndocument required to be served for instituting proceedings against a State shall be served by being\ntransmitted through the Ministry of Foreign Affairs or Pakistan to the Ministry of Foreign Affairs of\nthe State and service shall be deemed to have been effected when the notice or document is received\nat the latter Ministry.\n(2) Any proceedings in Court shall not commence earlier than two months after the date on\nwhich the notice or document is received as aforesaid.\n(3) A State which appears in proceedings cannot thereafter object that sub-section (1) has not\nbeen complied with as respects those proceedings.\n(4) No judgment in default of appearance shall be given against a State except on proof that\nsub-section (1) has been complied with and that the time for the commencement of proceedings\nspecified in sub-section (2) has elapsed.\n(5) A copy of any judgment given against a State in default of' appearance shall be\ntransmitted through the Ministry of Foreign Affairs of Pakistan to the Ministry of Foreign Affairs of\nthe State and the time for applying to have the judgment set aside shall begin to run two months after\nthe date on which the copy of the judgment is received at the latter Ministry.\n(6) Sub-section (1) does not prevent the service of a notice or other document in any manner\nto which the State agreed and sub-sections (2) and (4) do dot apply where service is effected in any\nsuch manner.\n(7) The preceding provisions of this section shall not be construed as applying to proceedings\nagainst the State by way of a counter-claim or to an action in rem."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Other procedural privileges",
      "content": "_(1) No penalty by way of committal to prison or fine\nshall be imposed in respect of any failure or refusal by or on behalf of a State to disclose or produce\nany document or information for the purposes of proceedings to which it is a party.\n(2) Subject to sub-sections (3) and (4), ___\n(a)    relief shall not be given against a State by way of injunction or order for\nspecific performance or for the recovery of land or other property; and\n(b)    the property of a State, not being property which is for the time being in use or\nintended for use for commercial purposes, shall not be subject to any process\nfor the enforcement of a judgment or arbitration award or, in an action in rem,\nfor its arrest, detention or sale.\n(3) Sub-section (2) does not prevent the giving of any relief or the issue of any process with\nthe written consent of the State concerned ; and any such consent, which may be contained in a prior\nagreement, may be expressed so as to apply to a limited extent or generally:\nProvided that a provision merely submitting to the jurisdiction of the courts shall not be\ndeemed to be a consent for the purposes of this sub-section.\n(4) The head of a State’s diplomatic mission in Pakistan, or the person for the time being\nperforming his functions, shall be deemed to have authority to give on behalf of the State any such\nconsent as is mentioned in sub-section (3) and, for the purposes of clause (b) of sub-section (2), his\ncertificate that any property is not in use or intended for use by or on behalf of the State for\ncommercial purposes shall be accepted as sufficient evidence of that fact unless the contrary is\nproved."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. States entitled to immunities and privileges",
      "content": "_(1) The immunities and privileges\nconferred by this Act apply to any foreign State; and references to State include references to___\n(a)     the sovereign or other head of that State in his public capacity;\n(b)     the government of that State; and\n(c)     any department of that government, but not to any entity, hereinafter referred\nto as a “separate entity”, which is distinct from the executive organs of the\ngovernment of the State and capable of suing or being sued.\n(2) A separate entity is immune from the jurisdiction of the courts of Pakistan if, and only\nif___\n(a)     the proceedings relate to anything done by it in the exercise of sovereign\nauthority; and\n(b)     the circumstances are such that a State would have been so immune.\n(3) If a separate entity, not being a State’s central bank or other monetary authority, submits\nto the jurisdiction in respect of proceedings in the case of which it is entitled to immunity by virtue\nof sub-section (2) of this section, the provisions of sub-sections (1) to (3) of section 14 shall apply to\nit in respect of those proceedings as if reference to a State were references to that entity.\n(4) Property of a State’s central bank or other monetary authority shall not be regarded for\nthe purposes of sub-section (3) of section 14 as in use or intended for use for commercial purposes;\nand where any such bank or authority is a separate entity sub-sections (1) and (2) of that section shall\napply to it as if references to a State were references to the bank or authority.\n(5) Section 13 applies to proceedings against the constituent territories of a Federal State; and\nthe Federal Government may, by notification in the official Gazette, provide for the other provisions\nof this Ordinance to apply by to any such constituent territory specified in the notification as they\napply to a State.\n(6) Where the provisions of this Ordinance do not apply to a constituent territory by virtue of\na notification under sub-section (5), the provisions of sub-sections (2) and (3) shall apply to it as if it\nwere a separate entity."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Restriction and extension of immunities and privileges",
      "content": "_(1) If it appears to the\nFederal Government that the immunities and privileges conferred by this Ordinance in relation to\nany State___\n(a)     exceed those accorded by the law of that State in relation to Pakistan; or\n(b)    are less than those required by any treaty, conventional or other international\nagreement to which that State and Pakistan are parties, the Federal\nGovernment may, by notification in the official Gazette, provide for\nrestricting or, as the case may be, extending those immunities and privileges\nto such extent as it may deem fit."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Savings, etc",
      "content": "_(1) This Ordinance does not affect any immunity or privilege conferred\nby the Diplomatic and Consular Privileges Act, 1972 (1X of 1972); and—\n(a)    section 6 does not apply to proceedings concerning the employment of the\nmembers of a mission within the meaning of the Convention set out in the\nFirst Schedule to the said Act of 1972 or of the members of a consular post\nwithin the meaning of the Convention set out in the Second Schedule to that\nAct;\n(b)    sub-section (1) of section 7 does not apply to proceedings concerning a State’s\ntitle to, or its possession of, property used for the purposes of a diplomatic\nmission.\n(2) This Ordinance does not apply to___\n(a)    proceedings relating to anything done by or in relation to the armed forces of a\nState while present in Pakistan;\n(b)    criminal proceedings; or\n(c)     proceedings relating to taxation other than those mentioned in section 12."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Proof as to certain matters",
      "content": "_A certificate under the hand of a Secretary to the\nGovernment of Pakistan shall be conclusive evidence on any question___\n(a)    whether any country is a State for the purposes of this Ordinance, whether any\nterritory is a constituent territory of a Federal State for those purposes or as to\nthe person or persons to be regarded for those purposes as the head or\nGovernment of a State; or\n(b)    whether, and if so when, a document has been served or received as\nmentioned in sub-section (1) or sub-section (5) of section 13."
    }
  ],
  "definitions": []
}
