{
  "id": "pk-stock-exchange-corporatisation-demutualization-and-integration-act-2012",
  "type": "statute",
  "title": "Stock Exchange (Corporatisation, Demutualization and Integration) Act, 2012",
  "title_en": "Stock Exchange (Corporatisation, Demutualization and Integration) Act, 2012",
  "short_name": "SEDAI",
  "status": "in_force",
  "issued_date": "2012-05-08",
  "in_force_date": "2012-05-08",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Fqapg%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Stock Exchange (Corporatisation, Demutualization and Integration) Act, 2012 (XV of 2012) published by The Pakistan Code (Banking/Financial Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Stock\nExchanges (Corporatisation, Demutualization and Integration) Act, 2012.\n(2)     It extends to the whole of Pakistan.\n(3)     It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the context or\nsubject,—\n(i)      “assets” means all immovable and movable properties (whether actual or\ncontingent, tangible or intangible) and include all land, building, machinery and\nequipment, shares, securities, deposits, cash, bank balances, profits, dividends,\nfees, commissions, receivables, claims, contracts, licenses, privileges, reserve\nfunds, investments and all other rights and interests in and arising out of such\nproperty in the ownership, possession, power or control of a stock exchange at\nany given time;\n(ii)     “blocked account” means a CDC account established by a stock exchange in\naccordance with clause (c) of sub-section (1) of section 5;\n(iii)    “CDC” means the Central Depository Company established in pursuance of the\nCentral Depository Companies (Establishment and Regulation) Rules, 1996;\n(iv)     “Commission” means the Securities and Exchange Commission of Pakistan\nestablished under the Securities and Exchange Commission of Pakistan Act,\n1997 (XLII of 1997);\n(v)      “Committee” means the demutualization committee of members of the stock\nexchange ratified under section 3 by the members of the stock exchange;\n(vi)     “Companies Ordinance” means the Companies Ordinance, 1984 (XLVII of\n1984);\n(vii)    “Connected Person” means in relation to a natural person, a spouse, real, step\nor half sibling, lineal ascendant or descendant of such person, a partner,\npromoter or substantial shareholder of an undertaking, company or body\ncorporate of which such person is also a partner, promoter or substantial\nshareholder or an undertaking, company or body corporate in which such person\nis a partner, promoter, substantial shareholder or director;in relation to a legal\nperson a Connected person means an undertaking, company or body corporate\nwhich is a holding, subsidiary or associated company of such legal person;\n(viii)   “corporatisation” means the conversion of a stock exchange from a company\nlimited by guarantee to a public company limited by shares;\n(ix)     “date of corporatisation” means the date on which the Registrar issues a\ncertificate of re- registration to the stock exchange as evidence of its change in\nstatus from a company limited by guarantee to a public company limited by\nshares;\n(x)      “date of demutualization” means the date on which the Registrar issues a\ncertificate of re-registration to the stock exchange in accordance with the\nprovisions of section 6;\n(xi)     “demutualization” means the segregation of the majority ownership of a stock\nexchange from the right to trade on such stock exchange;\n(xii)    “financial institution” includes foreign or local commercial banks development\nfinancial institutions, non-banking finance companies, insurance companies,\nstock exchanges, commodity exchanges, derivative exchanges or any such other\nentity which has been notified by the Commission as a financial institution for\nthe purposes of this Act;\n(xiii)   “first directors” mean directors of the stock exchange nominated by a stock\nexchange or the Commission as the case may be and who take the office of\ndirector on the date of corporatisation and hold such office until elections of the\ndirectors are held in accordance with this Act;\n(xiv)    “initial shareholders” means the legal owners of the shares of a stock exchange\non the date of corporatisation;\n(xv)     “integration” means the merger of two or more stock exchanges;\n(xvi)     “liabilities” means all borrowings, financial obligations, debts, claims, or\npotential losses of every description (Whether actual or contingent) of a stock\nexchange at any given date;\n(xvii) “member” means a member of a stock exchange prior to its corporatisation\nunder this Act;\n(xviii) “prescribe or prescribed” means prescribed by the regulations made by the\nCommission;\n(xix)    “scheme of integration” means a scheme of arrangement for the integration of\ntwo or more stock exchanges;\n(xx)    “Securities Ordinance” means the Securities and Exchange Ordinance, 1969\n(XVII of 1969);\n(xxi)   “security” means a security as defined in clause (1) of sub-section (1) of section\n2 of the Securities Ordinance;\n(xxii) “shareholders” means the legal owners of the shares of a stock exchange at any\ngiven time and include the initial shareholders;\n(xxiii) “stakeholders” means the employees of the stock exchange, the TRE certificate\nholders, the issuers of securities listed on a stock exchange, creditors, if any, of\nsuch stock exchange and the Government of Pakistan;\n(xxiv) “stock exchange” means a stock exchange registered under section 5 of the\nSecurities Ordinance at the time of commencement of this Act and includes a\nstock exchange after corporatisation, demutualization or integration as the case\nmay be;\n(xxv) “strategic investor” means a stock exchange, depository company, a derivative\nexchange or a clearing house which has been approved by the Commission in\naccordancewith the prescribed criteria, for the purposes of acquiring shares of a\nstock exchange in pursuance of section 12;\n(xxvi) “substantial shareholder” means a person who directly or indirectly controls,\nbeneficially owns or holds not less than twenty per cent of the voting rights of\nan undertaking, company or body corporate;\n(xxvii) “trading right entitlement certificate or TRE certificate” means a certificate\nissued by a stock exchange evidencing right of the TRE certificate holder to\napply for registration as a broker in accordance with the Broker and Agent\nRegistration Rules, 2001 as amended from time to time;\n(xxviii) “trading right entitlement certificate holder or TRE certificate holder” means a\nperson who is issued a TRE certificate under section 5, or purchases or acquires\nsuch TRE certificate under section 16 or is issued afresh TRE certificate in\naccordance with the provisions of this Act; and\n(xxix) “undertaking” means any trade or business of a stock exchange.\n(2) The words and expressions used, but not defined in this Act, but which are defined\nin the Companies Ordinance or the Securities Ordinance shall have the same\nmeaning as are assigned to them in these Ordinances."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Procedure upon receiving approval or determination",
      "content": "(1) Within thirty days of\nbeing granted approval under sub-section (2) of section 4 or a determination under sub-section\n(6) of section 4, the stock exchange shall—\n(a)     adopt in a meeting of its members by a special resolution the approved\nmemorandum and articles of association;\n(b)     allot shares to the members approved to be the initial shareholders in the\napproved numbers:\nProvided that all shares will be allotted in a dematerialized format and\nshall not, at any time or for any reason, be convertible into physical format;\n(c)     deposit in a blocked account sixty per cent of shares allotted to each initial\nshareholder and hold these in the blocked account until such time as these\nshares are disposed of in accordance with section 12;\n(d)     issue a certificate to each initial shareholder certifying the number of his shares\nheld in the blocked account; and\n(e)     issue a TRE certificate to each initial shareholder.\n(2)      Willful failure of a stock exchange to comply with any of the requirements of this\nsection shall be an offence under this Act.\n(3)      Within seven days of the adoption of the memorandum and articles of association as\naforesaid, the stock exchange shall deliver to the Registrar,—\n(a)     a certified copy of the special resolution by which the memorandum and\narticles of association have been adopted;\n(b)     a certificate from the auditors of the stock exchange certifying that all shares\nhave been allotted to the initial shareholders in a dematerialized format; and\n(c)     a certificate from CDC that sixty per cent of the shares allotted to each initial\nshareholder have been deposited in a blocked account in accordance with\nclause (c) of sub-section (1) of section 5."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Procedure upon receiving memorandum of the stock exchange",
      "content": "(1) Within seven\ndays of receipt of the information mentioned in sub-section (3) of section 5 and after confirmation from\nthe Commission, the Registrar shall issue a certificate of re-registration to the stock exchange as\nevidence of its change in status from a company limited by guarantee to a public company limited by\nshares.\n(2) The directors of the stock exchange holding office on the date of corporatisation shall\nautomatically cease to hold such office on receipt of the certificate of re-registration by the stock\nexchange, and shall stand replaced by the first directors."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Effect of corporatisation",
      "content": "(1) All assets and liabilities of the stock exchange as at\nthe date of corporatisation shall remain the assets and liabilities of the stock exchange.\n(2)     The corporatisation of the stock exchange shall not—\n(a)     create a new legal entity or prejudice or affect its identity or continuity;\n(b)     adversely affect the registration of the stock exchange under section 5 of the\nSecurities Ordinance;\n(c)     prejudice or affect the continuity of its undertakings;\n(d)     render defective or affect any legal, disciplinary or other proceedings brought\nby or against it prior to the date of corporatisation;\n(e)     affect the validity of any regulation made by the stock exchange or the\nCommission in pursuance of section 34 of the Securities Ordinance;\n(f)    affect any instruction, order, approval, notification, direction, act, requirement,\ncondition, consent, guideline, circular, undertaking, declaration, indemnity,\nwaiver, exemption, restriction or decision or other document howsoever called,\nmade, given or done by the stock exchange or the Commission in accordance\nwith or in pursuance of the Companies Ordinance or the Securities Ordinance\nor any other law or rules and regulations made under such law in force at the\ndate of corporatisation, and such instruction, order, approval, notification,\ndirection, act, requirement, condition, consent, guideline, circular, undertaking,\ndeclaration, indemnity, waiver, exemption, restriction or decision or other\ndocument shall remain valid, binding and have effect in relation to the persons\nto whom such instruction, order, approval, notification, direction, act,\nrequirement, condition, consent, guideline, circular, undertaking, declaration,\nindemnity, waiver, exemption, restriction or decision is applied until it is\namended, repealed or otherwise expires;\n(g)    affect any right, privilege, obligation or liability acquired by or accrued to the\nstock exchange under the provisions of the Companies Ordinance or the\nSecurities Ordinance or any other law or rules and regulations made under any\nsuch law in force at the date of corporatisation and shall not affect any legal,\ndisciplinary or other proceedings, remedy, inspection, investigation or inquiry\nin relation to such right, privilege, obligation or liability and any such legal,\ndisciplinary or other proceedings, remedy, inspection, investigation or inquiry\nmay be instituted, continued or enforced after the date of corporatisation; and\n(h)    affect any action that has been taken by the stock exchange for any breach of its\nregulations.\n(3)     Upon the conversion of the stock exchange from a company limited by guarantee to a\ncompany limited by shares, the liability of each member of the stock exchange as guarantor shall be\ndeemed to be extinguished immediately."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Demutualization. A stock exchange shall stand demutualised when the Registrar has",
      "content": "issued a certificate of re-registration to the stock exchange in accordance with section 6."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Rights attached to shares in the blocked account",
      "content": "(1) All rights in respect of the\nsixty per cent shares of each initial shareholder deposited in the blocked account shall vest and be\nexercised in the following manner, namely: —\n(a)     the right to receive dividends, bonus shares, rights shares and the proceeds of\nsale of these shares shall vest in the initial shareholders:\nProvided that the bonus shares and right shares if any, shall be added to\nthe blocked shares of the initial shareholder and shall be disposed of alongwith\nthose blocked shares in the manner provided in this Act;\n(b)     the right to sell these shares shall vest in the stock exchange to be exercised in\nthe manner provided in section 12; and\n(c)     the right to exercise the voting power attached to these shares shall remain\nsuspended till the time of sale of these shares in accordance with section 12.\n(2)    The blocked account shall be operated by the board of directors in the manner\nprescribed by the Commission."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Board of a stock exchange after demutualization and the election of directors",
      "content": "(1)    At any time after the date of demutualization, TRE certificate holders or connected\npersons of TRE certificate holders shall not hold the majority on the board of directors of any stock\nexchange, or hold more than forty per cent of the total paid up capital of the stock exchange.\n(2)     Within thirty days of the date of demutualization, the stock exchange shall hold an\nelection of directors:\nProvided that the elections shall only be in respect of the seats held by the first directors\nnominated by the stock exchange. The nominees of the Commission shall continue to hold office until\nsuch time as they stand replaced on a directive of the Commission to allow co-option of nominees of\nthe strategic investor, or in subsequent elections by shareholder interest of the strategic investor and\nfinancial institutions or representatives of the general public as the case may be.\n(3)    After the date of demutualization, the chairman of the Board of any stock exchange\nshall always be from amongst those directors who do not represent the TRE certificate holders or their\nconnected persons."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Effect of demutualization",
      "content": "(1) From the date of demutualization, notwithstanding\nanything to the contrary contained in any other law for the time being in force or any agreement, award,\njudgment, decree or other instrument for the time being in force, the demutualization of the stock\nexchange shall become binding on all persons and authorities having any contractual or statutory, right,\npower, obligation or liability in connection with the stock exchange.\n(2)     The demutualization shall not adversely affect the registration of the stock exchange\nunder section 5 of the Securities Ordinance.\n(3)     A shareholder may or may not be a TRE certificate holder of the stock exchange after\ndemutualization.\n(4)     A TRE certificate holder may or may not be a shareholder of the stock exchange after\ndemutualization."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Divestment and issue of further shares",
      "content": "(1) The Commission may at any time not\nlater than two years from the date of demutualization direct the stock exchange and its shareholders to\ndo one or more of the following, namely:-\n(a)     to enter into an agreement with a strategic investor, within one year of such\ndirection, for the sale of not more than forty percent of its total issued share\ncapital out of the shares lying in the blocked account;\n(b)     to sell to the general public through an offer for sale, not less than twenty percent\nof its total issued share capital out of the shares lying in the blocked account\nwithin one hundred and eighty days of the direction in accordance with\napplicable laws;\n(c)     to enter into agreements with and to sell to local financial institutions any shares\nremaining in the blocked account after sale of shares to the strategic investor\nand the general public, within one year of the direction:\nProvided that the Commission may extend the period for compliance\nupon an application by the stock exchange setting out the reasons for not being\nable to comply with the said order within the specified time.\n(2)      A stock exchange may, by special resolution issue further shares carrying extra voting\nrights to a strategic investor with the prior written approval of the Commission.\n(3)     In case if no agreement for the sale of shares of the stock exchange is reached with any\nstrategic investor within one year of the direction given by the Commission or within such time as may\nbe extended by the Commission, the Commission may open the sealed envelop containing the\nvaluation of the shares.\n(4)    Upon opening the sealed envelop, the Commission may take such steps or give such\ndirections as may be necessary for achieving the sale of shares, including but not limited to—\n(a)     ordering the sale of shares to a strategic investor who had earlier made an offer\nto purchase the shares, if the price offered by such strategic investor was equal\nto or more than the valuation of the shares contained in the sealed envelop; or\n(b)     ordering a fresh auction of the shares and selling to the highest bidding strategic\ninvestor or financial institutions such number of shares and in such manner as\nthe Commission may specify; or\n(c)     ordering a revaluation of the stock exchange at the cost of the stock exchange\nand in such manner as the Commission may specify.\n(5)     Notwithstanding anything contained in sub-sections (1) to (4), if a stock exchange fails\nto comply with any or all of the directions given to the stock exchange under sub-section (1), the\nCommission may determine and conclude the matters listed in sub-section (1) in such manner as may\nbe prescribed and any such determination by the Commission shall be final and binding on the stock\nexchange, its shareholders including the initial shareholders and the CDC.\n(6)      Refusal by any initial shareholder to accept an agreement duly entered in accordance\nwith the provisions of this section 12, or failure by any person to comply with any directions given by\nthe Commission, or the willful failure of the committee to sell the shares if the offer price received for\nsuch shares is equal to or more than the approved valuation, shall be an offence."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Sale and purchase of shares by a strategic investor and a financial institution",
      "content": "(1) A strategic investor or a financial institution who acquires shares under section 12 may sell its\nshareholding in a stock exchange only to another strategic investor or a financial institution as the case\nmay be, with the prior written approval of the Commission.\n(2)     A strategic investor may acquire such further shares of a stock exchange in which it is\na strategic investor to enable it to increase its shareholding up to fifty one percent of the total paid up\ncapital, subject to the following conditions, namely:—\n(a)     the prior approval of the Commission is obtained for such further acquisition of\nshares;\n(b)     the further acquisition is made not less than three years after it acquires\nshares under section 12; and\n(c)     the shares are purchased from the market by making a public offer in a\ntransparent manner.\n(3)     No financial institution who has acquired shares under section 12 may acquire any\nfurther shares from the general public:\nProvided that a financial institution may acquire shares from another financial institution\nwith prior approval of the Commission.\n(4)     The Commission may, by order in writing and reasons to be recorded, relax any one or\nall of the restrictions provided in sub-sections (1) to (3) after four years of date of demutualization.\n(5)    The provisions of the Listed Companies (Substantial Acquisition of Voting Shares and\nTakeovers) Ordinance, 2002 (CIII of 2002) shall not apply to any acquisition of voting shares of a\nstock exchange by a strategic investor."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Powers of the Commission to require divestment",
      "content": "(1) If an initial shareholder, a\nmember of the general public (including a company) or a TRE certificate holder directly or indirectly\nacquires more than one percent of the shares of a stock exchange, the Commission may direct such\nperson to divest these shares in a manner as may be specified by the Commission from time to time or\non a case to case basis.\nExplanation.—For the purposes of this sub-section a person shall be deemed to have acquired\nshares indirectly if these shares have been acquired by a connected person of such person.\n(2)     If a financial institution other than a financial institution who acquire shares under\nsection 12, directly or indirectly acquires more than five percent of the shares of a stock exchange, the\nCommission may direct such financial institution to divest these shares in a manner as may be specified\nby the Commission from time to time or on a case to case basis.\nExplanation.—For the purposes of sub-section (2) a financial institution would be deemed to\nhave acquired shares indirectly if these shares have been acquired by a connected person of such\nfinancial institution.\n(3)   The limits on the holding of shares by persons mentioned in sub-sections (1) and (2)\nmay be amended by the Commission from time to time if deemed necessary.\n(4)    Willful failure to comply with any provisions of this section or any directions issued by"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Listing of shares",
      "content": "(1) The shares of a stock exchange shall be listed, on any such\nstock exchange and within any such time as the Commission may prescribe in consultation with the\nboard of directors of the stock exchange which is to be listed.\n(2)      Where the shares of a stock exchange are listed on itself, the Commission shall act as\nthe front line regulator of such stock exchange for such listing, and notwithstanding anything contained\nin any other law, shall have the necessary powers and authority to regulate and administer all the laws,\nrules and regulations prescribed for such matter.\n(3)    The self-listing of the stock exchanges under this section shall be administered and\nmanaged by the Commission in such manner as may be prescribed.\n(4)     A stock exchange shall make an application for the listing of its shares on itself in the\nmanner and form, and subject to such conditions, as the Commission may prescribe.\n(5)     Upon receipt of an application under sub-section (4), the Commission may if it is\nsatisfied, after making such inquiry and receiving such further information as it may consider\nnecessary, that the application fulfils the prescribed conditions for listing, order the listing of the shares.\n(6)  Willful failure of a stock exchange to comply with any prescribed condition or direction\nof the Commission shall be an offence under this Act."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Trading rights",
      "content": "(1) An initial shareholder who is issued a TRE certificate under\nsection 5 shall, if not already registered as a broker with the Commission, be entitled to be so registered\nnot later than two years from the date of demutualization provided that he meets the fit and proper\ncriteria:\nProvided that such TRE certificate holder shall commence business not later than six months\nfrom the date of registration as a broker.\n(2)     A TRE certificate issued under section 5, may only be transferred once in a manner as\nmay be prescribed:\nProvided that transfer of the TRE certificate by a registered broker shall result in the\ncancellation of his registration as broker.\n(3)    Any fit and proper person who acquires a TRE certificate from an initial shareholder in\naccordance with sub-section (2), shall get himself registered as a broker not later than six months from\nthe date of acquiring the TRE certificate, and shall commence business not later than twelve months\nfrom the date of acquiring the TRE certificate.\n(4)     A stock exchange shall not issue new TRE certificates to any person 1[within a period\nof four years from the commencement of this Act] unless two-third majority of TRE certificate holders\nof a stock exchange decide otherwise.\n(5)    After 1[the expiry of period specified in sub-section (4)], a stock exchange shall offer\nfor issuance 1[of] fifteen TRE certificates each year 1[for the period of nine years] in the manner\nprescribed by the Commission\n(6)     After 1[the expiry of the period specified in sub-section (5)], no restriction shall be\nplaced on the issuance of TRE certificates by the stock exchange, and any person who meets the fit\nand proper criteria for registration as a broker shall be eligible to be issued a TRE certificate.\n(7)    Any person who is issued a new TRE certificate shall get himself registered as a broker\nnot later than six months from the date of issuance of such TRE certificate and shall commence\nbusiness not later than three months from the date of registration as a broker.\n(8)     After the date of demutualization, only a private company or a public company as\ndefined in the Companies Ordinance, 1984 (XLVII of 1984) shall be eligible to obtain registration as a\nbroker on a stock exchange:\nProvided that any TRE certificate holder who is registered as a broker on a stock exchange on\nhouse till one year from the commencement of this Act.\nExplanation.—For the purpose of this sub-section the expression “Corporate brokerage house”\nmeans a private company or a public company which is registered as a broker.\n(9)    All Corporate brokerage houses shall comply with the provisions of the Code of\nCorporate Governance issued by the Commission as amended from time to time.\n(10)       Except as provided in sub-section (2), all TRE certificates shall be non transferable.\n(11) Failure of a person, holding a TRE certificate including an initial shareholder, to get\nhimself registered as a broker or commence business within the different periods specified in this\nsection, or in the case of an initial shareholder, to transfer the TRE certificate within two years from\nthe date of demutualization, shall result in the lapse of such TRE certificate.\n(12) The Commission shall prescribe the manner, form and procedures for the transfer and\nissuance of any TRE certificate in any stock exchange.\n______________\n1Subs. and Ins. by Act XXII of 2015, s. 3."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Integration without application to the Court",
      "content": "(1) Any two or more stock exchanges\nmay, upon filing of a scheme of integration, and after compliance with such procedures as may be\nprescribed, be integrated by an order of the Commission, so as to transfer and vest in the successor\nstock exchange (“the successor stock exchange”) all the assets, undertakings and liabilities of any stock\nexchange which, upon such integration, is proposed to cease to exist (“the transferor stock exchange”).\nStock exchanges desirous of integrating may also do so by creating a new legal entity to which the\nassets, undertakings and liabilities of each of the stock exchanges may be transferred.\n(2)      A scheme of integration may only be submitted to the Commission under sub-section\n(1) afterit has been approved by a special resolution of the shareholders of each stock exchange.\n(3)      The successor stock exchange, if already registered as a stock exchange, shall not be\nrequired to apply to the Commission for fresh registration. Where however, a new legal entity is created\nas a result of integration, such entity shall apply for registration as a stock exchange under section 5 of\nafter the integration shall lapse upon such integration."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Power of the Commission to approve a scheme of integration",
      "content": "(1) On receipt of a\nscheme of integration under section 17, the Commission may approve the scheme in principle. Upon\nsuch approval, the stock exchanges shall publish the scheme of integration in two daily newspapers of\nnational coverage, requiring the stakeholders to intimate directly to the Commission in writing, within\nthe 15th day from the date of such publication, the reasons, if any, why the Commission should not\napprove the scheme of integration. Upon receipt of any written objections to the scheme of integration,\nthe Commission shall provide a reasonable opportunity of being heard to such objectors.\n(2)    The Commission may make such inquiry and obtain such further information, as it may\ndeem necessary, in order to determine as to whether to finally approve the scheme of integration or\nnot.\n(3)   The Commission may, if satisfied that the requirements of the prescribed procedure\nhave been complied with, approve the scheme of integration with such modifications, if any, as it may\ndeem appropriate, and specify the effective date of integration.\n(4)     Where a scheme of integration is approved under sub-section (3), it shall be posted on\nthe website of the Commission and published in the official Gazette. In addition, the stock exchange\nshall publish the approved scheme in two daily newspapers of national circulation.\n(5)     With effect from the date of the order of approval of the scheme of integration,\nnotwithstanding anything to the contrary contained in any other law for the time being in force or any\nagreement, award, judgment or decree, the scheme of integration shall have effect and shall be binding\non all persons interested in the transferor stock exchange or the successor stock exchange (or the new\nlegal entity as the case may be) including all shareholders, stakeholders and employees of the stock\nexchanges and all persons having an interest in any asset, undertaking or liability of either the\ntransferor stock exchange or the successor stock exchange (or the new legal entity as the case may be).\n(6)     Notwithstanding anything to the contrary contained in any other law for the time being\nin force, with effect from the date of the order approving the scheme of integration, all the assets,\nundertakings and liabilities of the transferor stock exchange shall, in accordance with the scheme of\nintegration, stand transferred to, and vest in, the successor stock exchange, and the transferor stock\nexchange shall, with effect from the date of such order, cease to exist.\n(7)    The stakeholders of the transferor stock exchange shall, with effect from the date of the\norder approving the scheme of integration, become the stakeholders of the successor stock exchange\nor the new legal entity as the case may be.\n(8)      The Commission may make such further or consequential orders or give such\ndirections, as it deems necessary, in order to effect the integration of the stock exchanges in accordance\nwith the approved scheme of integration.\n(9)   Where the Commission is satisfied that it would not be in the interest of either the\ncapital and stock markets or the general public to approve the scheme, it may by an order in writing,\nreject the scheme:\nProvided that the Commission shall, prior to issuance of such order, give a reasonable opportunity of\nbeing heard to the stock exchanges seeking integration.\n_____________"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Powers of the Commission",
      "content": "(1) Where the Commission is satisfied that a stock\nexchange, a director of a stock exchange, committee member, shareholder, TRE certificate holder or\nany other person, has prima facie committed an offence under this Act or has contravened any\nprovision of this Act or the regulations hereunder, the Commission may provide a reasonable\nopportunity of hearing to the stock exchange, the director, a shareholder TRE certificate holder or\ncommittee member as the case may be.\n(2)     If after giving a reasonable opportunity of hearing to the stock exchange, its directors,\nshareholders, TRE certificate holders or committee member as the case may be, the Commission is\nsatisfied that any of the aforementioned persons has knowingly and wilfully committed an offence\nunder this Act, it may,—\n(a)     direct the stock exchange to pay to the Commission by way of penalty a sum\nnotexceeding twenty million rupees or suspend or cancel the registration of the\nstock exchange;\n(b)     direct each director responsible for such failure to pay to the Commission from\nhis own sources by way of penalty a sum not exceeding one million rupees or\nsuspend or remove such director from the Board of the stock exchange;\n(c)     direct each shareholder guilty of an offence under this Act to pay to the\nCommission from his own sources by way of penalty a sum not exceeding one\nmillion rupees;\n(d)     direct each TRE certificate holder guilty of an offence under this Act to pay to\nthe Commission from his own sources by way of penalty a sum not exceeding\none million rupees; and\n(e)     direct each committee member guilty of an offence under this Act to pay to the\nCommission from his own sources by way of penalty a sum not exceeding one\nmillion rupees.\n(3)    Any sum directed by the Commission to be paid under sub-section (2) shall be\nrecoverable by the Commission as arrears of land revenue.\n(4)     Notwithstanding anything to the contrary contained herein, the Commission may, if it\nis satisfied that a TRE certificate holder, whether or not he is a shareholder of the stock exchange, has\nwilfully and knowingly failed to comply with the provisions of this Act, suspend or cancel the TRE\ncertificate.\n_____________"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Restriction on amendments to the Memorandum and Articles and further issue of",
      "content": "capital.—(1) A stock exchange shall not make any amendments to its Memorandum and Articles of\nAssociation without the prior written approval of the Commission,.\n(2) A stock exchange shall not issue further shares without the prior written approval of the\nCommission."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Winding up of a stock exchange. A stock exchange shall not commence any",
      "content": "proceedings forwinding up, whether voluntary or otherwise, without the prior written approval of the\nCommission:\nProvided that notwithstanding anything contained in any other law for the time being in force,\nthe Commission shall have the power to take all necessary steps to rehabilitate a stock exchange that\nis facing financial or operational problems, in a manner as may be prescribed."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Prohibition on sale etc of assets of the stock exchange. No stock exchange shall sell",
      "content": "immovable assets owned by the stock exchange at the date of corporatisation without the prior approval\nof the Commission and shall ensure that all assets are utilized in furtherance of the business of the\nstock exchange."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Power to make regulations. The Commission, may, by notification in the official",
      "content": "Gazette, make regulations for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Power to give directions",
      "content": "(1) The Commission shall have the power to give such\ndirections to a stock exchange, either jointly or severally, or to a shareholder, or a committee member,\nor a TRE certificate holder as the Commission deems necessary for achieving the purposes of this Act.\n(2)     The stock exchange, shareholder, TRE certificate holder or committee member to\nwhich a direction is issued under this section or any other section of this Act shall be bound to comply\nwith the same and failure of a stock exchange, shareholder, TRE certificate holder or committee\nmember to comply with any such direction shall be an offence under this Act."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Act to override other laws",
      "content": "The provisions of this Act shall have effect\nnotwithstanding anything to the contrary contained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Savings",
      "content": "Save as otherwise provided in this Act, nothing in this Act shall curtail or\ndeem to affect or Curtail the powers of the Commission under the Securities and Exchange\nCommission of Pakistan Act, 1997 (XII of 1997), the Companies Ordinance, the Securities Ordinance\nor any other law for the time being in force."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Removal difficulty",
      "content": "If any difficulty arises in giving effect to the provisions of this\nAct, the Federal Government may, not inconsistent, with the provisions of this Act, give such\ndirections as it may consider necessary for the removal of such difficulty.\n______________________________"
    }
  ],
  "definitions": [
    {
      "term": "assets",
      "definition": "all immovable and movable properties (whether actual or contingent, tangible or intangible) and include all land, building, machinery and equipment, shares, securities, deposits, cash, bank balances, profits, dividends, fees, commissions, receivables, claims, contracts, licenses, privileges, reserve funds, investments and all other rights and interests in and arising out of such property in the ownership, possession, power or control of a stock exchange at any given time;",
      "source_provision": "sec2"
    },
    {
      "term": "blocked account",
      "definition": "a CDC account established by a stock exchange in accordance with clause (c) of sub-section (1) of section 5;",
      "source_provision": "sec2"
    },
    {
      "term": "CDC",
      "definition": "the Central Depository Company established in pursuance of the Central Depository Companies (Establishment and Regulation) Rules, 1996;",
      "source_provision": "sec2"
    },
    {
      "term": "Commission",
      "definition": "the Securities and Exchange Commission of Pakistan established under the Securities and Exchange Commission of Pakistan Act, 1997 (XLII of 1997);",
      "source_provision": "sec2"
    },
    {
      "term": "Committee",
      "definition": "the demutualization committee of members of the stock exchange ratified under section 3 by the members of the stock exchange;",
      "source_provision": "sec2"
    },
    {
      "term": "Companies Ordinance",
      "definition": "the Companies Ordinance, 1984 (XLVII of 1984);",
      "source_provision": "sec2"
    },
    {
      "term": "Connected Person",
      "definition": "in relation to a natural person, a spouse, real, step or half sibling, lineal ascendant or descendant of such person, a partner, promoter or substantial shareholder of an undertaking, company or body corporate of which such person is also a partner, promoter or substantial shareholder or an undertaking, company or body corporate in which such person is a partner, promoter, substantial shareholder or director;in relation to a legal person a Connected person means an undertaking, company or body corporate which is a holding, subsidiary or associated company of such legal person; (viii) “corporatisation” means the conversion of a stock exchange from a company limited by guarantee to a public company limited by shares;",
      "source_provision": "sec2"
    },
    {
      "term": "date of corporatisation",
      "definition": "the date on which the Registrar issues a certificate of re- registration to the stock exchange as evidence of its change in status from a company limited by guarantee to a public company limited by shares;",
      "source_provision": "sec2"
    },
    {
      "term": "date of demutualization",
      "definition": "the date on which the Registrar issues a certificate of re-registration to the stock exchange in accordance with the provisions of section 6;",
      "source_provision": "sec2"
    },
    {
      "term": "demutualization",
      "definition": "the segregation of the majority ownership of a stock exchange from the right to trade on such stock exchange;",
      "source_provision": "sec2"
    },
    {
      "term": "financial institution",
      "definition": "foreign or local commercial banks development financial institutions, non-banking finance companies, insurance companies, stock exchanges, commodity exchanges, derivative exchanges or any such other entity which has been notified by the Commission as a financial institution for the purposes of this Act; (xiii) “first directors” mean directors of the stock exchange nominated by a stock exchange or the Commission as the case may be and who take the office of director on the date of corporatisation and hold such office until elections of the directors are held in accordance with this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "initial shareholders",
      "definition": "the legal owners of the shares of a stock exchange on the date of corporatisation;",
      "source_provision": "sec2"
    },
    {
      "term": "integration",
      "definition": "the merger of two or more stock exchanges;",
      "source_provision": "sec2"
    },
    {
      "term": "liabilities",
      "definition": "all borrowings, financial obligations, debts, claims, or potential losses of every description (Whether actual or contingent) of a stock exchange at any given date; (xvii) “member” means a member of a stock exchange prior to its corporatisation under this Act; (xviii) “prescribe or prescribed” means prescribed by the regulations made by the Commission;",
      "source_provision": "sec2"
    },
    {
      "term": "scheme of integration",
      "definition": "a scheme of arrangement for the integration of two or more stock exchanges;",
      "source_provision": "sec2"
    },
    {
      "term": "Securities Ordinance",
      "definition": "the Securities and Exchange Ordinance, 1969 (XVII of 1969);",
      "source_provision": "sec2"
    },
    {
      "term": "security",
      "definition": "a security as defined in clause (1) of sub-section (1) of section 2 of the Securities Ordinance; (xxii) “shareholders” means the legal owners of the shares of a stock exchange at any given time and include the initial shareholders; (xxiii) “stakeholders” means the employees of the stock exchange, the TRE certificate holders, the issuers of securities listed on a stock exchange, creditors, if any, of such stock exchange and the Government of Pakistan; (xxiv) “stock exchange” means a stock exchange registered under section 5 of the Securities Ordinance at the time of commencement of this Act and includes a stock exchange after corporatisation, demutualization or integration as the case may be;",
      "source_provision": "sec2"
    },
    {
      "term": "strategic investor",
      "definition": "a stock exchange, depository company, a derivative exchange or a clearing house which has been approved by the Commission in accordancewith the prescribed criteria, for the purposes of acquiring shares of a stock exchange in pursuance of section 12; (xxvi) “substantial shareholder” means a person who directly or indirectly controls, beneficially owns or holds not less than twenty per cent of the voting rights of an undertaking, company or body corporate; (xxvii) “trading right entitlement certificate or TRE certificate” means a certificate issued by a stock exchange evidencing right of the TRE certificate holder to apply for registration as a broker in accordance with the Broker and Agent Registration Rules, 2001 as amended from time to time; (xxviii) “trading right entitlement certificate holder or TRE certificate holder” means a person who is issued a TRE certificate under section 5, or purchases or acquires such TRE certificate under section 16 or is issued afresh TRE certificate in accordance with the provisions of this Act; and (xxix) “undertaking” means any trade or business of a stock exchange. (2) The words and expressions used, but not defined in this Act, but which are defined in the Companies Ordinance or the Securities Ordinance shall have the same meaning as are assigned to them in these Ordinances.",
      "source_provision": "sec2"
    }
  ]
}
