{
  "id": "pk-it-policy-framework",
  "type": "statute",
  "title": "Pakistan National IT Policy Framework — Digital Pakistan Vision",
  "title_en": "Pakistan National IT Policy Framework — Digital Pakistan Vision 2025",
  "short_name": "DigPak2025",
  "status": "in_force",
  "issued_date": "2019-01-01",
  "in_force_date": "2019-01-01",
  "url": "https://www.moitt.gov.pk/digital-pakistan",
  "description": "Pakistan's National IT Policy Framework underpins the Digital Pakistan Vision, establishing the strategic objectives and regulatory approach for the development of Pakistan's digital economy, e-government services, IT industry, broadband connectivity, and digital skills. The Framework guides government policy across all digital sectors and is implemented by the Ministry of Information Technology and Telecommunication.",
  "provisions": [
    {
      "provision_ref": "ch1",
      "section": "Chapter 1",
      "title": "Chapter 1. Digital Pakistan Vision",
      "content": "The Digital Pakistan Vision aims to transform Pakistan into a knowledge economy and leverage digital technology for economic growth, poverty reduction, improved governance, and enhanced quality of life for all citizens. The five pillars of the Digital Pakistan Vision are: 1. Connectivity and Digital Infrastructure: ensuring affordable, reliable, high-speed internet access for all citizens and businesses. 2. Digital Government: transforming government services through digitalization to improve efficiency, transparency, and citizen satisfaction. 3. Digital Economy and Skills: developing the digital economy and building the skills needed by citizens and businesses to participate in it. 4. Innovation and Entrepreneurship: fostering a culture of innovation and supporting technology startups and entrepreneurs. 5. Cybersecurity and Digital Trust: ensuring that Pakistan's digital environment is secure, trusted, and rights-respecting. The Ministry of Information Technology and Telecommunication leads the implementation of the Digital Pakistan Vision."
    },
    {
      "provision_ref": "ch2",
      "section": "Chapter 2",
      "title": "Chapter 2. IT Industry Development",
      "content": "Pakistan shall develop its IT and IT-enabled services (ITeS) industry as a priority sector for economic growth and export earnings. The IT industry development strategy includes: (a) establishing technology parks and software technology parks with world-class facilities in major cities; (b) simplifying regulations for IT companies, including streamlined company registration and easy repatriation of earnings; (c) providing fiscal incentives including income tax exemptions for IT exports and reduced withholding taxes; (d) facilitating access to finance for IT startups through government-backed venture capital funds and loan guarantee schemes; (e) promoting Pakistan as an offshore IT services destination through marketing campaigns; (f) developing world-class IT educational institutions in partnership with leading international universities. Pakistan IT exports shall be targeted to reach five billion US dollars within five years. The Special Technology Zones Authority (STZA) shall develop zones offering special economic and regulatory benefits to IT companies."
    },
    {
      "provision_ref": "ch3",
      "section": "Chapter 3",
      "title": "Chapter 3. Broadband and Connectivity",
      "content": "Universal access to affordable broadband internet is a foundational requirement for the Digital Pakistan Vision. The connectivity strategy includes: (a) expanding 4G coverage to 90% of the population within three years, with 5G rollout in urban areas; (b) deploying fiber optic broadband to all district headquarters and tehsil headquarters; (c) establishing satellite internet services for remote and under-served areas; (d) reducing the cost of internet access through regulatory measures and competition promotion; (e) providing subsidized internet access to low-income households through targeted support programs; (f) ensuring connectivity for all public schools and health facilities. The Universal Service Fund (USF) shall be the primary funding mechanism for connectivity in rural and under-served areas. PTA shall issue spectrum for 5G services within a specified timeframe and shall promote competitive markets for broadband services. Pakistan shall develop a national fiber backbone to reduce dependence on submarine cable landing stations."
    },
    {
      "provision_ref": "ch4",
      "section": "Chapter 4",
      "title": "Chapter 4. Digital Government Services",
      "content": "The e-governance strategy aims to make all citizen-facing government services available digitally by 2025. The digital government strategy includes: (a) establishing the National Digital Service Platform as the single digital interface for all government services; (b) deploying Pakistan's national digital identity (Computerized National Identity Card — CNIC) as the primary means of digital authentication; (c) digitalizing all federal government departments and agencies within three years; (d) implementing a whole-of-government cloud strategy to reduce costs and improve service resilience; (e) establishing open data portals for all federal agencies; (f) streamlining all business registration and licensing processes to be available digitally. NADRA (National Database and Registration Authority) shall develop and maintain the digital identity infrastructure. The Ministry of IT shall establish a Government Digital Service team to drive the quality and accessibility of digital government services. All new government systems shall follow digital-by-default and cloud-first principles."
    },
    {
      "provision_ref": "ch5",
      "section": "Chapter 5",
      "title": "Chapter 5. Digital Skills and Education",
      "content": "Pakistan faces a digital skills gap that must be addressed to enable full participation in the digital economy. The digital skills strategy includes: (a) introducing computer science and coding as mandatory subjects from Class 5 through the National Curriculum; (b) training 100,000 teachers in digital skills and digital pedagogy; (c) establishing DigiSkills training programs for five million citizens in digital skills including freelancing, e-commerce, and programming; (d) partnering with international technology companies for certification programs; (e) providing scholarships for IT-related postgraduate studies abroad; (f) creating special programs for women and youth in underserved areas. The Higher Education Commission shall work with universities to develop curricula aligned with industry needs. The DigiSkills portal shall provide free online training courses in the most in-demand digital skills. Pakistan shall recognize informal digital credentials and micro-certifications in the labour market."
    },
    {
      "provision_ref": "ch6",
      "section": "Chapter 6",
      "title": "Chapter 6. Fintech and Digital Financial Inclusion",
      "content": "Pakistan shall leverage fintech to extend financial services to the unbanked and underbanked population and to drive economic growth. The digital financial inclusion strategy includes: (a) promoting the Raast (instant payment system) as the universal infrastructure for digital payments; (b) enabling open banking through standardized APIs for financial data sharing; (c) establishing a regulatory sandbox for fintech innovation under SBP oversight; (d) promoting digital wallets and branchless banking for rural and low-income populations; (e) facilitating cross-border remittances through digital channels at lower cost; (f) developing a digital credit scoring system using alternative data sources. The National Financial Inclusion Strategy shall incorporate digital financial services as a key pillar. SBP and SECP shall maintain a proportionate regulatory framework for fintech that fosters innovation while managing risks. Pakistan shall develop the enabling legal and regulatory framework for open finance."
    },
    {
      "provision_ref": "ch7",
      "section": "Chapter 7",
      "title": "Chapter 7. Artificial Intelligence and Emerging Technologies",
      "content": "Pakistan shall develop a national strategy for artificial intelligence (AI) and emerging technologies to position the country at the forefront of the global AI revolution. The AI strategy includes: (a) establishing an AI National Centre of Excellence at a leading Pakistani university; (b) developing AI applications for priority government services including health, education, agriculture, and disaster management; (c) creating an ethical AI framework ensuring fairness, transparency, accountability, and privacy; (d) investing in AI research and development through public-private partnerships; (e) developing regulatory frameworks for AI applications in financial services, healthcare, and other regulated sectors; (f) positioning Pakistan as a destination for AI development and testing. Pakistan shall participate actively in international AI governance discussions. Cloud computing, the Internet of Things (IoT), and blockchain technology shall be embraced as enablers of the digital economy with appropriate regulatory frameworks."
    },
    {
      "provision_ref": "ch8",
      "section": "Chapter 8",
      "title": "Chapter 8. E-Commerce and the Digital Economy",
      "content": "Pakistan shall create conditions for the rapid growth of e-commerce and the digital economy. The e-commerce strategy includes: (a) establishing a comprehensive e-commerce policy and regulatory framework; (b) enabling digital payments for e-commerce through Raast and other payment systems; (c) developing the postal and logistics infrastructure for e-commerce delivery; (d) facilitating cross-border e-commerce through customs simplification and digital trade agreements; (e) protecting consumer rights in e-commerce transactions through consumer protection legislation; (f) enabling Pakistani SMEs to sell on international e-commerce platforms. The Ministry of Commerce shall lead the development of e-commerce policy in coordination with the Ministry of IT. Pakistan shall negotiate digital economy provisions in free trade agreements. The Legal Framework for e-commerce shall address electronic contracts, consumer protection, data privacy, and dispute resolution for online transactions."
    },
    {
      "provision_ref": "ch9",
      "section": "Chapter 9",
      "title": "Chapter 9. Implementation, Monitoring and Evaluation",
      "content": "The implementation of the Digital Pakistan Vision shall be coordinated by the Ministry of Information Technology and Telecommunication, with oversight by a Digital Pakistan Committee chaired by the Prime Minister. Each pillar of the Digital Pakistan Vision shall have a designated lead ministry and a multi-stakeholder working group responsible for its implementation. Annual implementation plans shall be developed with clear targets, timelines, and budget allocations. Progress against the Digital Pakistan Vision targets shall be measured through a set of key performance indicators, published quarterly in a publicly accessible dashboard. An annual review of the Digital Pakistan Vision shall be conducted to assess progress and identify course corrections needed. International organizations, development banks, and bilateral partners shall be engaged to provide technical assistance and financing for Digital Pakistan initiatives. Civil society and the private sector shall be engaged as partners in the implementation and monitoring of the Digital Pakistan Vision."
    }
  ],
  "definitions": [
    {
      "term": "Digital Pakistan Vision",
      "definition": "Pakistan's national strategy to transform Pakistan into a knowledge economy through digital technology, with five pillars: connectivity and digital infrastructure, digital government, digital economy and skills, innovation and entrepreneurship, and cybersecurity.",
      "source_provision": "ch1"
    },
    {
      "term": "IT-enabled services",
      "definition": "Services that are delivered using information technology as the primary medium, including business process outsourcing, software development, call centres, and data analytics services.",
      "source_provision": "ch2"
    },
    {
      "term": "open banking",
      "definition": "A system in which banks provide third-party financial service providers with access to consumer banking, transaction and other financial data through standardized APIs, enabling the development of new financial products and services.",
      "source_provision": "ch6"
    }
  ]
}
