{
  "id": "pk-sugar-export-subsidy-fund-ordinance-1970",
  "type": "statute",
  "title": "Sugar Export Subsidy Fund Ordinance, 1970",
  "title_en": "Sugar Export Subsidy Fund Ordinance, 1970",
  "short_name": "SESFO",
  "status": "in_force",
  "issued_date": "1970-10-30",
  "in_force_date": "1970-10-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cZeb-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Sugar Export Subsidy Fund Ordinance, 1970 (XX of 1970) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Power to make rules",
      "content": "*ORDINANCE NO. XX OF 1970\n[26th October, 1970]\nAn Ordinance to provide for the establishment of a Sugar Export Subsidy Fund for promoting export\nof sugar.\nWHEREAS it is expedient to provide for the establishment of a Sugar Export Subsidy Fund\nfor promoting export of sugar;\nAND WHEREAS, during the absence of the President and Chief Martial Law Administrator\nabroad, the Minister for Health, Labour and Family Planning is performing the functions of President\nas Acting President in pursuance of clause (a) of paragraph 3 of the State Arrangements Regulation\n(Martial Law Regulation No. 55);\nNOW, THEREFORE, in pursuance of the Proclamation of the 25th day of March, 1969, read\nwith the Provisional Constitution Order and the Regulation aforesaid, and in exercise of all powers\nenabling him in that behalf, the Acting President is pleased to make and promulgate the following\nOrdinance:___"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Ordinance may be called the Sugar\nExport Subsidy Fund Ordinance, 1970.\n(2) It extends to Baluchistan, the North-West Frontier Province, the Punjab and Sind.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or",
      "content": "context,___\n(a)        “export” means taking to any place outside Pakistan by any means;\n(b)        “prescribed” means prescribed by rules made under this Ordinacne;\n(c)        “sugar” does not include khandsari and Palmyra sugar;\n(d)        “sugar-cane” means the plant saccharum officinarum which is commonly\nknown as the sugar-cane and from which sugar is obtained."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Levy of sales tax and excise duty",
      "content": "_(1) There shall be levied and collected in such\nmanner as may be prescribed___\n(a)        sales tax on sugar-cane sold to the sugar mills at the rate of twenty-five paisa\nper maund; and\n(b)        excise duty___\n(i)       on sugar-cane grown by sugar mills at the rate of twenty-five paisa per\nmaund, and\n(ii)       on sugar produced by sugar mills at the rate of one rupee per maund.\n*\n(2) The sales tax and excise duty levied under sub-section (1) shall be in addition to any sales\ntax or excise duty imposed on sugar-cane or sugar by or under any other law for the time being in\nforce."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Sugar Export Subsidy Fund",
      "content": "_(1) There shall be established a fund to be called the\nSugar Export Subsidy Fund to which shall be credited the proceeds of the sales tax and excise duty\nlevied and collected under section 3 after deducting the cost of collection.\n(2) The Sugar Export Subsidy Fund shall be applied for the purpose of subsidising export of\nsugar to such extent and in such manner as the 1[Federal Government] may, from time to time,\ndecide.\n(3) The 1[Federal Government] may, by special order, authorise repayment from out of the\nSugar Export Subsidy Fund of the excise duty paid on so much of the sugar produced by a sugar mill\nas is exported by such mill."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Registration of contracts. The 1[Federal Government] may, by general or special order,",
      "content": "require any contract or class of contracts for export of sugar to be registered in such manner and with\nsuch authority as may be specified in the order."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to call for information, etc",
      "content": "_(1) The 1[Federal Government] may, at any time,\nby order, direct any sugar mill to maintain such accounts and to furnish to the 1[Federal] Board of\nRevenue or to any officer of the 1[Federal Government] such returns or other information relating to\ncrushing of sugar-cane and production of sugar within such time and giving such particulars as may\nbe specified in the order.\n(2) Any person authorised in this behalf by the 1[Federal Government] or by the 1[Federal]\nBoard of Revenue may at all reasonable times enter any sugar factory or any place or premises where\nsugar is manufactured, stored or kept for sale and may require the production for his inspection of\nany book, register, record or other paper kept therein and ask for any information relating to the\ncrushing of sugar-cane and production of sugar."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Penalty. A person shall be punishable with imprisonment for a term which may extend to",
      "content": "three years, or with fine, or with both, if he ___\n(a)        contravenes or fails to comply with any order or direction issued under this\nOrdinance; or\n(b)        when required by any order made under this Ordinance to make any statement\nor furnish any information, makes a statement or furnishes information which\nhe knows or has reasonable cause to believe to be false or does not believe to\nbe true; or\n(c)        makes any such statement as aforesaid in any book, account, record,\ndeclaration, return or other document which he is required by any such order\nto maintain or furnish; or\n(d)        maintains double sets of books, accounts or any other records, in which the\nentries are not identical.\n1\nSubs. by F.A.O., 1975, Art. 2 and Table."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Offences by Companies, etc. Where any person guilty of an offence under this Ordinance",
      "content": "is a company or other body corporate, every director, manager, secretary or other officer, and every\nagent and servant thereof and, in the case of an unlimited company or a company limited by\nguarantee, also every member thereof shall be punishable as if he had committed such offence:\nProvided that no such director, manager, secretary or other officer and no such agent, servant,\nor member shall be prosecuted under this Ordinance except with the previous approval of the\n1\n[Federal] Board of Revenue; and the 1[Federal] Board of Revenue shall not give such approval if it\nis satisfied after giving such director, manager, secretary, officer, agent, servant or member an\nopportunity of showing cause against prosecution that the offence was committed without his\nknowledge or that he used due diligence to prevent its commission."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Cognizance of offences. No court shall take cognizance of an offence punishable under",
      "content": "this Ordinance except on a report in writing of the facts constituting such offence made by the\n1\n[Federal] Board of Revenue or any person authorised by it in this behalf."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Protection of action taken in good faith. No suit, prosecution or other legal proceedings",
      "content": "shall lie against the 1[Federal Government] or any authority or person exercising any power under\nthis Ordinance for anything which is in good faith done or intended to be done under this Ordinance\nor any rules or orders made thereunder."
    }
  ],
  "definitions": [
    {
      "term": "export",
      "definition": "taking to any place outside Pakistan by any means;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Ordinacne;",
      "source_provision": "sec2"
    },
    {
      "term": "sugar-cane",
      "definition": "the plant saccharum officinarum which is commonly known as the sugar-cane and from which sugar is obtained.",
      "source_provision": "sec2"
    }
  ]
}
