{
  "id": "pk-sugarcane-act-1934",
  "type": "statute",
  "title": "SugarCane Act, 1934",
  "title_en": "SugarCane Act, 1934",
  "short_name": "SugarCane Act, 1934",
  "status": "in_force",
  "issued_date": "1934-04-30",
  "in_force_date": "1934-04-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-b56U-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of SugarCane Act, 1934 (XV of 1934) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Sugar-cane Act,\n1934.\n1\n[(2) It extends to the whole of Pakistan.]\n(3) This section shall come into force at once; the remaining sections of this Act shall come\ninto force in any Province on such date as the 2[Provincial Government] may, by notification in the\n2\n[official Gazette], appoint in that behalf."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(1) “controlled area” means any area specified in a notification issued under sub-section (1)\nof section. 3;\n(2) “factory” means any premises (including the precincts thereof) wherein twenty or more\nworkers are working or were working on any day of the preceding twelve months and in any part of\nwhich any manufacturing process connected with the production of sugar is being carried on or is\nordinarily carried on with the aid of power; and\n(3) “sugar” means any form of sugar containing more than ninety percent of sucrose."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Declaration of controlled areas, and fixing of prices",
      "content": "(1) The 2[Provincial\nGovernment] may, by notification in the 2[official Gazette], declare any area specified in the\nnotification to be a controlled area for the purposes of this Act.\n(2) 2[* * *] the 2[Provincial Government] may, by notification in the 2[official Gazette], fix a\nminimum price or minimum prices for the purchase in any controlled area of sugar-cane intended for\nuse in any factory.\n(3) The 2[Provincial Government] may, by notification in the 2[official Gazette], prohibit in\nany controlled area the purchase of sugar-cane intended for use in any factory otherwise than from\nthe grower of the sugar-cane or from a person licensed by the 2[Provincial Government] to act as a\npurchasing agent.\n1\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955).\n2\nSubs. by Adaptation Order. 1937."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Previous publication of notifications under section 3",
      "content": "Not less than thirty days before\nthe issue of any notification under sub-section (1) or sub-section (2) of section 3, the 1[Provincial\nGovernment] shall publish in the 1[official Gazette] and in such other manner (if any) as it thinks fit a\ndraft of the proposed notification specifying a date on or after which the draft will be taken into\nconsideration, and shall consider any objection or suggestion which may be received from any\nperson with respect to the draft before the date so specified."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Penalty for purchase of sugar",
      "content": "cane in contravention of notification under section 3.—Whoever\nin any controlled area purchases any sugar-cane intended for use in a factory at a price less than the\nminimum price fixed therefor by notification under sub-section (2) of section 3 or in contravention of\nany prohibition made under sub-section (3) of section 3 shall be punishable with fine which may\nextend to two thousand rupees."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Sanction for prosecution under this Act",
      "content": "No Court shall take cognizance of any\noffence punishable under section 5 except upon complaint made by order of, or under authority from,\nthe District Magistrate."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power of Provincial Government to make rules",
      "content": "(1) The 1[Provincial Government]\nmay, by notification in the 1[official Gazette], make rules for the purpose of carrying into effect the\nobjects of this Act.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules\nmay provide for ___\n(a)        the carrying out of inquiries preliminary to the exercise of the powers\nconferred by section 3;\n(b)        establishing Advisory Committees for any purpose connected with the\nadministration of this Act and defining the powers, functions and procedure of\nsuch Committees;\n(c)        the issue of licences to purchasing agents, the fees for such licences, and the\nregulation of the purchase and sale of sugar-cane by and to such agents;\n(d)        the organisation of growers of sugar-cane into societies for the sale of sugar-\ncane to factories;\n(e)        the authorities by which any functions under this Act or the rules made\nthereunder are to be performed; and\n(f)        the records, registers and accounts to be maintained for ensuring compliance\nwith the provisions of this Act.\n(3) In making any rule under sub-section (1) or under clause (c) or clause (f) of sub-section\n(2), the 1[Provincial Government] may provide that a breach of the rule shall, where no other penalty\nis provided by this Act, be punishable with fine not exceeding two thousand rupees."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Power of Provincial Government to make rules",
      "content": "The 2[Provincial Government] after\nprevious publication may, by notification in the 1[official Gazette], make rules providing for the\nexemption of factories or any class of factories from the provisions of this Act.\nDate: 09-08-2024\n1\nSubs. by Adaptation Order. 1937.\n2\nSubs. by the Federal Adaptation of Laws Order, 1975, (P. O. 4 of 1975) Art. 2 and table, for “Central Government” which was subs. by A. O., 1937,\nfor “G. G. in C.”."
    }
  ],
  "definitions": []
}
