{
  "id": "pk-supreme-court-practice-and-procedure-act-2023",
  "type": "statute",
  "title": "Supreme Court (Practice and Procedure) Act, 2023",
  "title_en": "Supreme Court (Practice and Procedure) Act, 2023",
  "short_name": "SCAPA",
  "status": "in_force",
  "issued_date": "2023-04-20",
  "in_force_date": "2023-04-20",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pnbQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Supreme Court (Practice and Procedure) Act, 2023 (XVII of 2023) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Act shall be called the Supreme Court (Practice\nand Procedure) Act, 2023.\n1\n[(2) It shall come into force at once and shall be deemed to have taken effect on and from the\ndate of commencement of the Constitution (Twenty-sixth Amendment) Act, 2024 (XXVI of 2024).]\n2\n[2. Practice and Procedure of the Supreme Court. __(1) Every cause, matter, petition, appeal\nor review application before the Supreme Court, shal1 be heard and disposed of by a Bench constituted\nby the Committee comprising the Chief Justice, the next senior most Judge in order of seniority and a\nJudge to be nominated by the Chief Justice:\nProvided that if a member for any reason is unable to attend meeting of the Committee, the\nChief Justice may nominate any other Judge of the Supreme Court as a member of the Committee.\n(2) The decisions of the Committee shal1 be by majority.]\n1\n[2A. Practice and procedure of Constitutional Benches. __ (1) Where a question arises as to\nwhether a cause, matter, petition, appeal or review application falls within clause (3) of Article 191A\nof the Constitution and is to be heard and disposed of by a Constitutional Bench or another Bench of\nthe Supreme Court, the committee constituted under clause (4) of Article 191A of the Constitution\nshall, through a speaking order, determine the question and if it decides that a matter__\n(a)        falls within clause (3) of Article 191A of the Constitution, assign it to a\nConstitutional Bench for hearing and disposal; or\n(b)        does not fall within clause (3) of Article 191A of the Constitution, send it to the\nCommittee constituted under section 2 for disposal by another Bench.\n(2) The Registrar of the Supreme Court of Pakistan shall provide the requisite administrative\nand secretarial support to the Constitutional Benches.\n(3) Subject to the availability of Judges, Constitutional Benches shall comprise equal number\nof Judges from each Province.]\n1\nSubs. by Act No. XXXI of 2024, ss. 2-5.\n2\nOmitted and subs. by Act No. XXXVI of 2025, ss. 2-3 (w.e.f. 13-11-2025).\n1\n3.             [*     *         *          *         *       *     *]\n1\n4.             [*     *         *          *         *       *     *]\n2\n5.             [*     *         *          *         *       *     *]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Right to appoint counsel of choice",
      "content": "For filing a review application under Article 188 of\nthe Constitution, a party shall have the right to appoint counsel of its choice.\nExplanation: For the purpose of this section, ‘counsel’ shall mean an Advocate of the Supreme\nCourt."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Application for fixation of urgent matters",
      "content": "An application pleading urgency or seeking\ninterim relief, filed in a cause, appeal or matter, shall be fixed for hearing within fourteen days from\nthe date of its filing.\n1\n[7A. Hearing, etc.__ Unless law requires a decision within a stipulated period, every cause,\nmatter or appeal in the Supreme Court shall be heard at its turn based on first in, first out, which is to\nsay, the cases filed first shall be heard first."
    },
    {
      "provision_ref": "sec7b",
      "section": "7B",
      "title": "Section 7B. Recording and transcript of proceedings",
      "content": "Hearing of every cause, matter or appeal in\nthe Supreme Court shall be recorded and transcript thereof duly prepared. For the purposes of reliance\nthereon in any court proceedings, only a certified copy of the transcript against payment of a fee\namounting to Rupees fifty per page shall be used.]"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Act to override other laws etc",
      "content": "The provisions of this Act shall have effect\nnotwithstanding anything contained in any other law, rules or regulations for the time being in force\nor judgment of any Court including the Supreme Court and a High Court.\n_______\nRGN Dated 17-11-2025\n1\nOmitted and ins. by Act No. XXXI of 2024, ss. 6 and 8.\n2\nOmitted by Act No. XXXVI of 2025, s. 4 (w.e.f. 13-11-2025)."
    }
  ],
  "definitions": []
}
