{
  "id": "pk-supreme-court-review-of-judgments-and-orders-act-2023",
  "type": "statute",
  "title": "Supreme Court (Review of Judgments and Orders) Act, 2023",
  "title_en": "Supreme Court (Review of Judgments and Orders) Act, 2023",
  "short_name": "SCOJA",
  "status": "in_force",
  "issued_date": "2023-05-25",
  "in_force_date": "2023-05-25",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pkaw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Supreme Court (Review of Judgments and Orders) Act, 2023 (XXIII of 2023) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, commencement and extent",
      "content": "(1) This Act shall be called the Supreme\nCourt (Review of Judgments and Orders) Act, 2023.\n(2)    It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Enlargement of jurisdiction of the Supreme Court",
      "content": "In case of judgments and\norders of the Supreme Court in exercise of its original jurisdiction under Article 184 of the\nConstitution, the scope of review on both facts and law, shall be the same as an appeal under Article\n185 of the Constitution."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Larger Bench",
      "content": "A review petition shall be heard by a Bench larger than the Bench\nwhich passed the original judgment or order."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Right to appoint counsel",
      "content": "The review petitioner shall have the right to appoint any\nadvocate of the Supreme Court of his choice for the review petition."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Judgments and orders made prior to commencement of this Act",
      "content": "The right to file\na review petition shall also be available to an aggrieved person against whom an order has been made\nunder-clause (3) of Article 184 of the Constitution, prior to the commencement of this Act:\nProvided that the review petition under this section shall be filed within sixty days of the\ncommencement of this Act."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Limitation",
      "content": "A review petition may be filed within sixty days of the passing of the\noriginal order."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Act to override other laws etc",
      "content": "The provisions of this Act shall have effect\nnotwithstanding anything contained in any other law, rules or regulations for the time being in force\nor judgment of any court including the Supreme Court and a High Court."
    }
  ],
  "definitions": []
}
