{
  "id": "pk-surrender-of-illicit-arms-act-1991",
  "type": "statute",
  "title": "Surrender of Illicit Arms Act, 1991",
  "title_en": "Surrender of Illicit Arms Act, 1991",
  "short_name": "SOIAA",
  "status": "in_force",
  "issued_date": "1991-11-30",
  "in_force_date": "1991-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apmYZQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Surrender of Illicit Arms Act, 1991 (XXI of 1991) published by The Pakistan Code (Criminal Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Act may be called the Surrender of",
      "content": "Illicit Arms Act, 1991.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force in such areas and on such date as the Federal Government\nmay, on recommendation of the respective Provincial Governments, by notification in the official\nGazette appoint; and different date may be so appointed in respect of different areas."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. (1) In this Act, unless there is anything repugnant in the subject or context,⸻",
      "content": "(a)         “illicit arms” includes―\n(i)        cannon as defined in the Pakistan Arms Ordinance, 1965 (W.P.\nOrdinance No. XX of 1965), excluding sub-machine guns and their\nsilencers revolvers or pistols of over 46 inches bore;\n(ii)       all types of explosive substances as defined in the Explosive\nSubstances Act, 1908 (VI of 1908), and the Explosive Act, 1884 (IV of\n1884), including mines of all types;\n(iii)      all types of containers, grenades bombs and shells that discharge\npoisonous or noxious gases or other chemicals or substances which\ncause damage to human body;\n(iv)       fire-arms comprising automatic weapons (other than machine guns)\nincluding sub-machine guns, automatic rifles and machine pistols; and\n(v)        rifles, carbines muskets, shortguns, revolvers, pistols and appliances\nthe object of which is the silencing of fire-arms and all other fire-arms\nnot included in sub-clause (iv),\nwhich are held or possessed in contravention of the provisions of the\nArms Act, 1878 (XI of 1878), the Explosives Act, 1884 (IV of 1884),\nAct, 1965 (W.P. Ord. XX of 1965), or any other law for the time being\nin force;\n1\nThis Act shall come into force in the Karachi Division (w.e.f. 24-8-95) vide S.R.O. No. 841 (I)/95, dt. 24-8-95.\n(b)       “prescribed” means prescribed by rules made under this Act.\n(2) The Federal Government may, by notification in the official Gazette, declare any article,\nsubstance, arms, ammunition or military stores not, specified hereinbefore which is held or\npossessed in contravention of any law as illicit arms, ammunition or explosives, for the purpose of\nthis Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Act not to derogate from other laws. The provisions of this Act shall be in addition to,",
      "content": "and not in derogation of, any other law for the time being in force, and nothing contained herein\nshall exempt any person from any proceedings which may be instituted against him under such law."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Surrender of illicit arms.⎯ 1[(1) O n the commencement of this Act, all] persons in",
      "content": "possession or control of any illicit arms shall surrender such arms 2[to the District Co-ordination\nOfficer, Deputy District Officer (Revenue)] or officer-in-charge of a police-station within whose\njurisdiction such persons ordinarily reside or to such other authority as may be specified by the\nFederal Government by notification in the official Gazette.\n(2) The authority receiving any illicit arms shall issue a receipt for the same."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Surrender of arms, etc., by persons on visit abroad. A person on a lawful visit abroad",
      "content": "at the commencement of this Act shall, within 1[sixty days] of his return to Pakistan, through an\nauthorized route or port of entry surrender and deposit and deposit all illicit arms in his possession\nor control to one of the authorities specified in section 4."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Publicity for surrender of illicit arms.― (1) The Federal Government and the Provincial",
      "content": "Government shall give wide publicity to the provisions of this Act on the media, including\ntelevision, radio, national and regional press, in Urdu, English and regional languages or by any\nother mode as may be prescribed.\n(2) There shall be publicly displayed a count-down of every expired day of the period\nallowed for surrender of illicit arms under this Act and the number of days left for such surrender."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Punishments.― (1) Whoever contravenes the provisions of section 4 or section 5 or fails",
      "content": "to surrender illicit arms shall,—\n(a)       in respect of illicit arms defined in sub-clauses (i) to (iii) of clause (a) of\nsection 2, be punished with imprisonment for life and forfeiture of property,\nboth movable and immovable;\n(b)       in respect of illicit arms defined in sub-clause (iv) of clause (a) of section 2,\nbe punished with imprisonment for life or with imprisonment for a term which\nshall not be less than ten years having regard to the antecedents of the accused;\nand\n1\nSubs. & deemed always to have been so subs. by Ord. 66 of 01, s. 2 & Sch.\n2\nSubs. by Ord. 66 of 01, s. 2 & Sch.\n(c)        in respect of illicit arms defined in sub-clause (v) of clause (a) of section 2,\nbe punished with imprisonment for a term which may extend to fourteen years\nbut shall not be less than three years, having regard to the antecedents of the\naccused.\n(2) Any illicit arms in respect of which a person is convicted and sentenced under sub-\nsection (1) shall stand forfeited to the Federal Government.\n(3) Any conveyance used for the transportation of any illicit arms shall also be liable to\nconfiscation.\nExplanation.― In this section, “conveyance” includes a vessel, aircraft, vehicle or animal."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Indemnity. A person surrendering or depositing illicit arms under section 4 or section 5",
      "content": "shall stand indemnified against any legal or penal action for having previously possessed such illicit\narms:\nProvided that any person who had committed any offence with such arms shall not be\nexempted from criminal liability for any such offence."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Search for illicit arms, etc. 1[(1) The Federal Government may, from time to time, launch",
      "content": "campaign for recovery of illicit arms in a coordinated manner and the Provincial Governments and\nall other agencies of the State which may be called upon shall act in aid of the Federal Government\nand Provincial Governments.]\n(2) Search for illicit arms, ammunition or explosives shall be carried out, as nearly as may be,\nin accordance with Chapter V of the Code of Criminal Procedure, 1898 (Act V of 1898):\nProvided that, where in case of an extreme urgency a departure from the provisions of the\nCode is made, the District Superintendent of Police or any other officer authorizing the search\nshall record reasons for such departure."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Reward for successful recovery. Any person providing information for successful",
      "content": "recovery of illicit arms may, in the prescribed manner, be appropriately rewarded by the Federal\nGovernment or, as the case may be, by the Provincial Government to whom such information is\nprovided, keeping in view the number of illicit arms recovered on the basis of such information."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Scrutiny of licences, etc.⎯ (1) Whenever the Federal Government or, if so required by",
      "content": "it, the Provincial Government deems fit, it may, notwithstanding anything contained in the\nPakistan Arms Ordinance, 1965 (W.P. Ordinance No. XX of 1965), the Explosive Substances Act,\n1908 (VI of 1908), the Explosives Act, 1884 (IV of 1884), the Arms Act, 1878 (XI of 1878), or any\nother law, by notification in the official Gazette, direct every person possessing or keeping in his\ncontrol any arms, ammunition or explosives under any licence issued by any authority appointed\nunder any law for the time being in force, to present such licence to the authority specified in the\nnotification, by the Federal Government or, as the case may be, the Provincial Government, for\nscrutiny.\n1\nSubs. and shall be deemed always to have been so subs. by Ord. 66 of 01, s. 2 & Sch.\n(2) Where, on scrutiny of a license, the authority referred to in sub-section (1) is satisfied that\nit was not in the public interest or conducive for maintenance of law and order or the public peace to\nallow retention of the licence or any arms, ammunition or explosives, it may, after providing an\nopportunity of being heard, cancel the licence issued to a person to possess or keep any arms,\nammunition or explosives.\n(3) Where a licence is cancelled under sub-section (2), the person possessing or keeping any\narms, ammunition or explosives shall deposit such arms, ammunition or explosives with the\nauthority specified by the Federal Government."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Punishment for failure to present licence for scrutiny. Whoever fails to present his",
      "content": "licence for possessing or keeping any arms, ammunition or explosives as required under section 11\nshall be punished with imprisonment which may extend to ten years but shall not be less than three\nyears and confiscation of such arms, ammunition or explosives."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Exemption. Nothing contained in this Act shall apply to a person who is exempt by",
      "content": "virtue of the provisions of the Pakistan Arms Ordinance, 1965 (W.P. Ordinance No. XX of\n1965), and the rules framed thereunder from holding a licence for possessing any arms and\nammunition, including those of prohibited bore, by virtue of his office or otherwise."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Removal of difficulties. If any difficulty arises in giving effect to any provision of this",
      "content": "Act, the Federal Government may make such order or direction, not inconsistent with the provisions\nof this Act, as may appear to it to be necessary for the purpose of removing such difficulty.\n___________"
    }
  ],
  "definitions": [
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act. (2) The Federal Government may, by notification in the official Gazette, declare any article, substance, arms, ammunition or military stores not, specified hereinbefore which is held or possessed in contravention of any law as illicit arms, ammunition or explosives, for the purpose of this Act.",
      "source_provision": "sec2"
    }
  ]
}
