{
  "id": "pk-tax-laws-amendment-ordinance-2025",
  "type": "statute",
  "title": "Tax Laws (Amendment) Ordinance, 2025",
  "title_en": "Tax Laws (Amendment) Ordinance, 2025",
  "short_name": "TLO",
  "status": "in_force",
  "issued_date": "2025-05-01",
  "in_force_date": "2025-05-01",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tjbw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Tax Laws (Amendment) Ordinance, 2025 (IV of 2025) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Ordinance shall be\ncalled the Tax Laws (Amendment) Ordinance, 2025.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Amendments of the Income Tax Ordinance, 2001 (XLIX of",
      "content": "2001).—In the Income Tax Ordinance, 2001 (XLIX of 2001), the following }\nfurther amendments shall be made, namely:—\n(1) “in section 138, after sub-section (3), the following new sub-section\n(3A) shall be inserted, namely:—\n- “(3A) Notwithstanding anything contained in this Ordinance or any other :\nlaw or any rule, any decision or judgment of any court, forum or authority, the\ntax payable under any provision of this Ordinance or any assessment order shall\nbecome immediately payable or within the time specified in the notice issued by\nthe income tax authority under this sub-section, irrespective of the time provided\nunder any other provision or the said decision or judgment, in case the issue\ngiving rise to the tax payable is decided by a High Court or Supreme Court of\nPakistan.”;\n(2) in section 140, after sub-section (6), the following new sub-section\n(6A) shall be inserted, namely: —\n“(6A) Notwithstanding anything contained in this Ordinance or any other\nlaw or any rule, any decision or judgment of any court, forum or authority, the\ntax payable under any assessment order shall become immediaiely recoverable or\nwithin the time specified in the notice issued by the income tax authority under\nthis sub-section irrespective of the time provided under any other provision or the\nsaid decision or judgment, in case the issue giving rise to the tax payable is\ndecided by a High Court or Supreme Court of Pakistan.”;\n(3) after section 175B, the following new section 175C shall be\ninserted, namely: —\nPART I] THE GAZETTE OF PAKISTAN, EXTRA., MAY 2, 2025 151\n| “175C Posting of Officer of Inland Revenue.— Subject to such\nconditions and restrictions, as deemed fit to be imposed, the Board or the\nChief Commissioner, may post an Officer of Inland Revenue or such other\nofficials with any designation working under the control of the Board or the\nChiéf Commissioner, to the premises of any person or class of such persons, to\nmonitor production, supply of goods or rendering of or providing of services and\nthe stock of goods not sold at any time.”;"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Amendments in the Federal Excise Act, 2005",
      "content": "In the Federal\nExcise Act, 2003, the following further amendments shall be made, namely: —\n(1) in section 26, in sub-section (1), after the word “thereunder”, the\nexpression “or such goods without affixing or affixing counterfeit tax stamps, bar\ncodes, banderoles, stickers, labels or bar codes, as required under section 45A of\nthis Act” shall be inserted; and\n(2) in section 27,—\n(a) in sub-section (1), after the world “counterfeiting”, the expression\n“or such goods without affixing or affixing counterfeit tax stamps,\nbar codes, banderoles, stickers, labels or bar codes, as required\nunder section 45A of this Act” shall be inserted; and\n(b) after sub-section (3), the following new sub-section (4) shall be\nadded, namely:—-\n“(4) Without prejudice to the foregoing provisions of this section, the\nBoard in case of goods subject to monitoring under section 45A of this Act and\ncounterfeited goods, may authorize any ofticer or employee of the Federal or\nProvincial Government to exercise the powers and perform the functions of the\nOfficer of Inland Revenue under section 26 and sub-section (1) of section 27, by\nnotification in the official Gazette subject to such conditions, if any, it may deem\nfit to be imposed.”.\nASIF ALI ZARDARI,\nPresident,\nRAJA NAEEM AKBAR,\nSecretary.\na  RISTAN PRESS, ISLAMABAD. 3\na \"TTT MANAGER, PRINTING CORPORATION OF ctr: ROAD, FARAH\nPRINTED BY fut UUTY CONTROLLER STATIONERY AND FORMS. UNIVERSITY RO"
    }
  ],
  "definitions": []
}
