{
  "id": "pk-tea-control-of-prices-distribution-and-movement-ordinance-1960",
  "type": "statute",
  "title": "Tea (Control of Prices, Distribution and Movement) Ordinance, 1960",
  "title_en": "Tea (Control of Prices, Distribution and Movement) Ordinance, 1960",
  "short_name": "TOPDA",
  "status": "in_force",
  "issued_date": "1960-07-05",
  "in_force_date": "1960-07-05",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-a5abZw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Tea (Control of Prices, Distribution and Movement) Ordinance, 1960 (XXVIII of 1960) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Ordinance in addition to Other Laws, etc",
      "content": "THE TEA (CONTROL OF PRICES, DISTRIBUTION AND MOVEMENT)\nORDINANCE, 1960\nORDINANCE No. XXVIII OF 1960\n[6th July, 1960]\nAn Ordinance to provide for special measures for the control of prices, distribution and movement of\ntea.\nWHEREAS it is expedient to provide for special measures for the control of prices,\ndistribution and movement of tea;\nNow, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958,\nand in exercise of all powers enabling him in that behalf, the President is pleased to make and\npromulgate the following Ordinance:-"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title extent and commencement",
      "content": "_(1) This Ordinance may be called the Tea\n(Control of Prices, Distribution and Movement) Ordinance, 1960.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Ordinance, unless there is anything repugnant in the subject or\ncontext,___\n(a)        “approved dealer” means a dealer in tea registered under this Ordinance as a\nbidder, blender, importer, wholesaler or retailer;\n1\n[(aa) ‘appropriate Government’ means, in relation to matters pertaining import of\ntea from outside Pakistan, and trade and commerce between the Provinces the\n2\n[Federal Government] and, in relation to other matters, the Provincial\nGovernment;]\n(b)        “bidder” means a person who bids at internal tea auctions for the purpose of\nbuying tea either for himself or on behalf of others, and includes a broker;\n(c)        “blender” means a person engaged in the business of buying and blending tea\nand preparing packets or other containers of tea for distribution;\n(d)        “brewed tea” means tea prepared for drinking, whether with or without\nmilk, sugar or gur;\n(e)        “broker” includes a commission agent;\n1\nClause (aa) ins. by A. O., 1964, Art. 2 and Sch.\n2\nSubs. by F.A.O., 1975 Art. 2 and Table, for “Central Government”.\n(f)       “Controller-General” means the Controller-General of Prices and Supplies\nappointed by the 1[appropriate Government], and includes any Additional,\nDeputy or Assistant Controller-General so appointed, and any other officer\nauthorized by the 1[appropriate Government] to exercise all or any of the\npowers of the Controller-General under this Ordinance;\n(g)       “dealer” means a person who deals in tea as a bidder, blender, importer,\nwholesaler or retailer;\n(h)       “importer” means a person who imports into Pakistan tea from outside\nPakistan;\n(i)       “prescribed” means prescribed by rules made under this Ordinance;\n(j)       “retailer” means a person carrying on the business of selling tea in retail,\nwhether in conjunction with any other business or not;\n(k)       “tea” includes blended and unblended tea, leaf, tea fanning, tea dust, tea\ncontained in packets or other containers and brewed tea; and\n(l)       “wholesaler” means a person carrying on the business of selling tea wholesale,\nwhether in conjunction with any other business or not."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Registration of dealers.___(1) The Controller",
      "content": "General shall maintain separate registers, in\nsuch form as may be prescribed, for the registration of bidders, blenders, importers, wholesalers and\nretailers, and may register any person in such register on an application made to him, giving such\nparticulars, in such form, and on payment of such fees as may be prescribed, and subject to such\nconditions, if any, as the Controller-General may think fit to impose.\n(2) The Controller-General may require any person applying for registration under sub-\nsection (1) to furnish such further particulars and information and to produce such documents as the\nController-General may consider necessary for the purpose.\n(3) The Controller-General shall notify in the official Gazette the name of every person\nregistered under sub-section (1).\n(4) Nothing in this section shall be construed as precluding a person registered in any one of\nthe registers maintained under sub-section (1) from being registered in any other register so\nmaintained."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to refuse suspended or cancel registration",
      "content": "_ (1) No dealer shall be entitled to\nregistration under sub-section (1) of section 3 as of right, and registration may be refused, or, if\ngranted, may be suspended or cancelled for any one of the following reasons, that is to say,__\n(a)       for contravening or failing to comply with any provision of this Ordinance, or\nthe rules or orders made thereunder;\n(b)       for contravening or failing to comply with any condition imposed by the\nController-General at the time of registration under section 3;\n1\nSubs, by A. O., 1964, Art. 2 and Sch., “Central Government”.\n(c)        for under-invoicing or over-invoicing the value of imports or exports of tea;\n(d)        for obtaining or attempting to obtain registration under this Ordinance by\nfraudulent means or wilful misrepresentation;\n(e)        for indulging in activities which in the opinion of the Controller-General are\ndetrimental to public interest.\n(2) Any person aggrieved by an order under sub-section (1) may appeal against the order to\nthe 1[appropriate Government], within such time as may be prescribed, and the order of the\n1\n[appropriate Government] thereon shall be final."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Forward transaction banned.___(1) All sales at internal auctions of tea shall be on im",
      "content": "mediate payment basis, and all kinds of speculative forward transactions in tea are hereby prohibited.\n(2) Any such transaction as aforesaid outstanding immediately before the promulgation of\nthis Ordinance shall, notwithstanding anything in any agreement, contract, deed or other document,\nbe void."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Restrictions on dealings in tea",
      "content": "No person, not being an approved dealer, shall at any\none time hold in stock, purchase, sell, or agree to purchase or sell tea weighing three hundred pounds\nor more."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Duty to declare possession of excess stocks",
      "content": "Any person having in his possession a\nquantity of tea exceeding that permitted by or under this Ordinance shall forthwith report the fact to\nexcess quantity as the Controller-General may direct."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Fixation of prices",
      "content": "The Controller-General may, from time to time, by notification in the\nofficial Gazette, fix the maximum prices up to which any variety of tea may be sold by (a) a blender,\n(b) an importer, (c) a wholesaler, (d) a retailer, or (e) any other person or class of persons, and no\nperson shall sell or resell tea at prices higher than the prices so fixed.\nExplanation.___ It shall not be a contravention of this section to sell or resell tea at prices\nlower than the prices fixed under this section."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Fixation of quantities of tea to be held by approved dealers etc.,",
      "content": "The Controller-\nGeneral may, by notification in the official Gazette, fix in respect of any grade or variety of tea__\n(a)        the maximum quantity which may at any time be possessed by an approved\ndealer or class of approved dealers ;\n(b)        the maximum quantity which may in any one transaction be sold by an\napproved dealer or class of approved dealers to another approved dealer or\nclass of approved dealers ; and\n1\nSubs. by A. O., 1964, Art. 2 and Sch., for “Central Government”.\n(c)        the maximum quantity which may at any one time be purchased by any\napproved dealer or class of approved dealers."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Restrictions on possession and sale of tea where maximum is fixed under section 9",
      "content": "No approved dealer shall___\n(a)        have in his possession at any one time stock of tea exceeding the maximum\nfixed by notification under clause (a) of section 9, or,\n(b)        sell or offer for sale to any person in any one transaction tea exceeding the\nmaximum fixed by notification under clause (b) of section 9."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Power to order sale",
      "content": "The Controller-General may by order in writing require any\napproved dealer to sell to such person or persons such quantity of tea as may be specified in the\norder, and may issue such incidental or supplementary instructions in writing to any approved dealer\nin regard to the sale thereof as he thinks fit."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Restrictions on movements of tea",
      "content": "Notwithstanding any agreement to the contrary,\nthe Controller-General or any other officer empowered in this behalf by the 1[appropriate\nGovernment] may, by a general or special order in writing, prohibit the transport of tea from one\nplace to another within Pakistan by or on behalf of any dealer or other person, and direct such dealer\nor person to sell or deliver the whole or any part of the tea held by him to any person or persons\nspecified in the order."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Information to be furnished by importers.",
      "content": "_(1) Every importer, shall, within fourteen\ndays from the date of receiving intimation of dispatch of any consignment of tea from any place\noutside Pakistan, furnish to the Controller-General by registered post, acknowledgement due, the\nfollowing information in respect of the consignment, namely:-\n(a)        grade or variety and quantity of tea included in the consignment ;\n(b)        expected date and place of arrival of the consignment in Pakistan; and\n(c)        how the stocks of tea are proposed to be disposed of on arrival.\n(2) Every importer shall, within fourteen days of the clearance of the consignment from the\ncustoms, furnish to the Controller-General the following information supported by original docu-\nments in respect of the consignment, namely :—\n(a)        grade or variety and quantity of tea included in the consignment ;\n(b)        landed cost of the consignment showing C.I.F. value, customs duty, sales tax,\nand other incidental charges, if any, separately."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Disposal of imports",
      "content": "No importer shall sell or otherwise dispose of any consignment\nof tea imported by him except in accordance with such written instructions as may be issued to him\nby the Controller General in this behalf.\n1\nSubs. by A. O., 1964, Art. 2 and Sch., for “Central Government”."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Declaration of godowns, store",
      "content": "houses and ware-houses.— Any dealer may be required\nby the Controller-General to declare the situation and descriptive particulars of any place other than\nhis usual place of business where he keeps or stores tea, and after making such declaration he shall\nnot keep or store tea elsewhere than at such place or his usual place of business."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Information to be furnished by blenders",
      "content": "Every blender shall furnish to the\nController-General so as to reach him by the fifteenth day of each calendar month the following\ninformation, namely:___\n(a)     grade or variety and actual or estimated quantity of tea blended during the\npreceding calendar month ;\n(b)     the actual or estimated cost of blending such tea ; and\n(c)     the manner in which and the persons to whom the blender proposes to dispose\nof the same."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Maintenance of records, etc.___(1) Every approved dealer shall keep such books, ac",
      "content": "counts and records relating to the business carried on by him as the Controller-General may require\nfrom time to time.\n(2) Every dealer or other person holding stocks of tea and every person employed in\nconnection with the business of such dealer or other person, on being required so to do either by\nnotice served on him or by special or general direction issued by the Controller-General, shall-\n(a)     produce before such person as may be specified in the notice or direction such\naccounts and other documents as may be specified in the notice or direction ;\n(b)     furnish to the Controller-General such estimates, returns and other information\nrelating to the business as may be specified in the notice or direction ; and\n(c)     permit any person or persons of a class or description mentioned in the notice\nor direction to enter upon, inspect and search with a view to securing\ncompliance with this Ordinance or the rules or orders made thereunder any\npremises used for or in connection with the business, and seize all stocks of\ntea in respect of which such person or persons have reason to believe that a\ncontravention of this Ordinance or the rules or orders made thereunder has\nbeen, is being, or is about to be, committed."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Marking of process and exhibition of price lists",
      "content": "_(1) Every blender shall mark the\nretail sale price on each packet or other container of tea or on a label affixed to each packet or\ncontainer.\n(2) Every dealer shall maintain and exhibit on his premises a price list of all kinds of tea\nexposed or intended for sale.\n(3) No dealer shall destroy, efface or alter or cause to be destroyed, effaced or altered the\nprices marked and exhibited under sub-sections (1) and (2)."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Cash memorandum to be given in certain cases",
      "content": "Every dealer when selling tea for\ncash shall, if the sale for five rupees or more in all cases, and if the sale is for less than five rupees,\nwhen so requested by the purchaser, give the purchaser a cash memorandum containing particulars\nof the transaction:\nProvided that the provisions of this section shall apply only to those dealers who are liable to\npay income-tax."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Refusal to sell",
      "content": "No dealer shall without reasonable excuse refuse to sell to any person\nany quantity of tea not exceeding the maximum fixed by or under this Ordinance.\nExplanation.___ The possibility or expectation of obtaining a higher price at a later date shall\nnot be deemed to be a reasonable excuse within the meaning of this section, but it shall not be a\ncontravention of this section to refuse to supply tea to a retailer or a consumer in excess of his\nnormal quota or reasonable requirements determined in accordance with the established system of\ndistribution, in case such system is equitable and is in keeping with established commercial and trade\npractice."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Offences and penalties",
      "content": "_(1) If any person contravenes any provision of this Ordinance\nor any rule or order made thereunder, he shall be punishable with imprisonment for a term which\nmay extend to three years or with fine or with both, and any Court trying such contravention may\ndirect that any stocks of tea in respect of which such contravention has been made shall be forfeited\nto Government.\n(2) The owner of any vessel, conveyance or animal carrying any tea in respect of which any\nprovision of this Ordinance or any rule or order made thereunder has been contravened shall, if the\ncarrying is part of the transaction involving the contravention and if he knew or had reason to believe\nthat the contravention was being committed, be deemed to have contravened the provisions of this\nOrdinance, and in addition to the punishment to which he is liable under sub-section (1), the vessel,\nconveyance or animal shall also be liable to be forfeited to Government."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Attempts and abetments",
      "content": "Any person who attempts to contravene, or abets the\ncontravention of any provision of this Ordinance or any rule or order made thereunder shall be\ndeemed to have contravened the provisions of this Ordinance."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Offences by corporations",
      "content": "If the person contravening any provision of this Ordinance\nor any rule or order made thereunder is a company or other body corporate, every director, manager,\nsecretary or other officer or agent thereof shall, unless he proves that the contravention took place\nwithout his knowledge or that he exercised all due diligence to prevent such contravention, be\ndeemed to be guilty of such contravention."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. False statements",
      "content": "Any person who,___\n(a)     when required by or under this Ordinance to make any statement or furnish\nany information, makes any statement or furnishes any information which is\nfalse in any material particular and which he knows or has reasonable cause to\nbelieve to be false, or does not believe to be true, or\n(b)     makes any statement as aforesaid in any book, account, record, declaration,\nreturn or other document which he is required by or under this Ordinance to\nmaintain or furnish,\nshall be punishable with imprisonment for a term which may extend to three years or with fine or\nwith both.\n1"
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Cognizance of offences",
      "content": "No court shall take cognizance of an offence punishable\nunder this Ordinance except with the previous sanction in writing of the 2[appropriate Government],\n3\n[* * *] or of an officer or other authority empowered for the purpose by the 2[appropriate\nGovernment] 4[* * *]."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Power to try offences summarily",
      "content": "Any magistrate or bench of magistrates empowered\nfor the time being to try in a summary way the offences specified in sub-section (1) of section 260 of\nthe Code of Criminal Procedure, 1898, may, on application in this behalf being made by the\nprosecution, try in accordance with the provisions contained in sections 262 to 265 of the said Code\nany offence punishable under this Ordinance, (Act V of 1898)."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Special provisions regarding fines",
      "content": "Notwithstanding anything contained in section 32\nof the Code of Criminal Procedure, 1898, it shall be lawful for any magistrate of the first class\nespecially empowered by the Provincial Government in this behalf to pass a sentence of fine\nexceeding one thousand rupees on any person convicted of an offence under this Ordinance, (Act V\nof 1898)."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Presumption as to orders",
      "content": "_(1) No order made in exercise of any power conferred by or\nunder this Ordinance shall be called in question in any Court.\n(2) Where any order purports to have been made and signed by an authority in exercise of\nany power conferred by or under this Ordinance, a court shall, within the meaning of the Evidence\nAct, 1872, (I of 1872) presume that such order was so made by that authority."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Protection of action taken in goods faith",
      "content": "_(1) No suit or prosecution or other legal\nproceeding shall lie against any person for anything which is in good faith done or intended to be\ndone in pursuance of this Ordinance or any rule or order made thereunder.\n(2) No suit or other legal proceeding shall lie against the Government for any damage caused\nor likely to be caused by anything which is in good faith done or intended to be done in pursuance of\nany provision of this Ordinance or any rule or order made thereunder."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Delegation of powers",
      "content": "The 2[appropriate Government] may, by notified order5, direct\nthat all or any of its powers under this Ordinance or the rules made thereunder shall in relation to\nsuch matters and subject to such conditions, if any, as may be specified in the direction, be\nexerciseable also by—\n(a)        such officer or authority subordinate to the 2[appropriate Government], or\n1\nFor notification authorizing the Government of East and West Pakistan and the Administrator of Karachi under this section, see Gaz. of P., 1960, Ext.,\np. 1584a.\n2\nSubs. by A. O., 1964, Art. 2 and Sch., for “Central Government”.\n3\nThe original words and commas “or if it is authorised by the Central Government in this behalf, of the Provincial Government”, omitted ibid.\n4\nThe original words “or by the Provincial Government so authorized” omitted ibid.\n5\nFor notification, see Gaz. of P., 1960, Ext., pp. 1923 a-1.\n1\n(b)         [where 2[Federal Government] is the appropriate Government, such\nProvincial Government or such officer or authority subordinate to a Provincial\nGovernment,\nas may be specified in the direction."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Ordinance not to apply to Government transactions",
      "content": "Nothing in this Ordinance\nshall apply to the possession or sale of any quantity of tea by a dealer or other person in the course of\nthe fulfilment of a contract entered into with the 2[Federal Government] or a Provincial Government."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Power to make rules",
      "content": "The 3[appropriate Government] may by notification in the\nofficial Gazette make rules4 for carrying out the purposes of this Ordinance.\nPower to exempt.— The 3[appropriate Government] may, by order notified in the"
    },
    {
      "provision_ref": "sec533",
      "section": "533",
      "title": "Section 533. official Gazette, exempt any person or class of persons or any grade, variety or stock of tea from the",
      "content": "operation of all or any of the provisions of this Ordinance to such extent and subject to such\nconditions, if any, as may be specified in the order."
    }
  ],
  "definitions": [
    {
      "term": "approved dealer",
      "definition": "a dealer in tea registered under this Ordinance as a bidder, blender, importer, wholesaler or retailer; 1 [(aa) ‘appropriate Government’ means, in relation to matters pertaining import of tea from outside Pakistan, and trade and commerce between the Provinces the 2 [Federal Government] and, in relation to other matters, the Provincial Government;]",
      "source_provision": "sec2"
    },
    {
      "term": "bidder",
      "definition": "a person who bids at internal tea auctions for the purpose of buying tea either for himself or on behalf of others, and includes a broker;",
      "source_provision": "sec2"
    },
    {
      "term": "blender",
      "definition": "a person engaged in the business of buying and blending tea and preparing packets or other containers of tea for distribution;",
      "source_provision": "sec2"
    },
    {
      "term": "brewed tea",
      "definition": "tea prepared for drinking, whether with or without milk, sugar or gur;",
      "source_provision": "sec2"
    },
    {
      "term": "broker",
      "definition": "a commission agent; 1 Clause (aa) ins. by A. O., 1964, Art. 2 and Sch. 2 Subs. by F.A.O., 1975 Art. 2 and Table, for “Central Government”.",
      "source_provision": "sec2"
    },
    {
      "term": "Controller-General",
      "definition": "the Controller-General of Prices and Supplies appointed by the 1[appropriate Government], and includes any Additional, Deputy or Assistant Controller-General so appointed, and any other officer authorized by the 1[appropriate Government] to exercise all or any of the powers of the Controller-General under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "dealer",
      "definition": "a person who deals in tea as a bidder, blender, importer, wholesaler or retailer;",
      "source_provision": "sec2"
    },
    {
      "term": "importer",
      "definition": "a person who imports into Pakistan tea from outside Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "retailer",
      "definition": "a person carrying on the business of selling tea in retail, whether in conjunction with any other business or not;",
      "source_provision": "sec2"
    },
    {
      "term": "tea",
      "definition": "blended and unblended tea, leaf, tea fanning, tea dust, tea contained in packets or other containers and brewed tea; and",
      "source_provision": "sec2"
    },
    {
      "term": "wholesaler",
      "definition": "a person carrying on the business of selling tea wholesale, whether in conjunction with any other business or not.",
      "source_provision": "sec2"
    }
  ]
}
