{
  "id": "pk-tea-ordinance-1959",
  "type": "statute",
  "title": "Tea Ordinance, 1959",
  "title_en": "Tea Ordinance, 1959",
  "short_name": "Tea Ordinance, 1959",
  "status": "in_force",
  "issued_date": "1959-08-07",
  "in_force_date": "1959-08-07",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-a5aZZQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Tea Ordinance, 1959 (XLVI of 1959) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Repeal",
      "content": "ORDINANCE NO. XLVI OF 1959\n[8th August, 1959]\nAn Ordinance to provide measures for the expansion of export of tea, for the setting up of bodies to\nestablish new tea gardens and rehabilitate derelict tea gardens, and generally for the promotion of\nthe tea industry, and for levying a cess on tea produced in Pakistan\nWHEREAS it is expedient to provide measures for the expansion of export of tea, for the\nsetting up of bodies to establish new tea gardens and rehabilitate derelict tea gardens, and generally\nfor the promotion of the tea industry, and for levying a cess on tea produced in Pakistan;\nNOW, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958, and\nin exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate\nthe following Ordinance:___"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_ (1) This Ordinance may be called the Tea\nOrdinance, 1959.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Ordinance, unless there is anything repugnant in the subject or\ncontext,___\n(a)        “Board” means the Pakistan Tea Board constituted under section 3;\n1\n[(aa) “Collector” means a Collector of Customs appointed under section 3 of the\nCustoms Act, 1969 (IV of 1969);]\n(b)        “Committee” means the 2[Tea Development Committee] constituted under\nsection 9;\n(c)        “estate” means a tea estate and includes a tea garden or a part of tea estate or\ngarden;\n(d)        “export” means to take out of Pakistan by land, sea or air to any place outside\nPakistan;\n(e)        “owner” includes any agent of an owner;\n(f)        “prescribed” means prescribed by rules, made under this Ordinance;\n1\nCl. (aa) was ins. by the Tea (Amdt.) Ordinance, 1960 (I of 1960), s. 2. has been subs. by the Federal Laws (Revision and Declaration)\nOrdinance, 1981 (XXVII of 1981), s. 3 and Sch. II.\n2\nSubs. by Ord. No. I of 1960, s. 2, for “Development Committee”.\n(g)        “tea” means the commodity known as tea made from the leaves of the plant\nCamellia Thea 1[or Camellia Sinnensis] including adjacent tender stalks or\ngreen tea but excluding tea waste; and\n(h)        “tea seed” includes seeds, roots, stumps, cuttings, buds and any living portion\nof the plant Camellia Thea 1[or Camellia Sinnensis] which may be used to\npropagate that plant."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Constitution of Pakistan Tea Board",
      "content": "_(1) As soon as may be, the 1[Federal Government]\nshall constitute a body to be called the Pakistan Tea Board consisting of the following members, that\nis to say:___\n2\n[(a)   A Chairman to be appointed by the 1[Federal Government] ;]\n3\n[(aa)] 4[three] members elected by the Pakistan Tea Association 5[*                                           *        *];\n(b)        two members elected by the Tea Traders Association of Pakistan of whom one\nshall represent the tea brokers and shippers 6[and the other the tea traders];\n(c)        one member to be nominated by the 1[Federal Government] 7[to represent the\nestates under proprietary management];\n8\n[*                *                     *                     *                *                *          *]\n9\n[(e)   two persons possessing special knowledge of tea or tea cultivation, or\nagriculture, 10[to be nominated by the Federal Government] ;]\n(f)        one person to be elected by the recognized labour unions of tea gardens;]\n11\n[(g) one officer serving under the 1[Federal Government] in the Ministry of\nCommerce to be nominated by the 1[Federal Government].]\n(2) The 1[Federal Government] shall publish in the official Gazette the names of all the\nmembers of the Board and thereupon the Board shall be deemed to be constituted.\n(3) Members of the Board shall, subject to the provisions of sub-section (4), hold office for\nthree years, and shall be eligible for re-election or re-nomination.\n1\nIns. ibid.\n1\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n2\nCl. (a) was ins. by the Tea (Amdt.) Ordinance, 1962 (LXVI of 1962), s. 2.\n3\nThe original cl. (a) was renumbered as cl. (aa), ibid.\n4\nSubs. by the Tea (Amdt.) Ordinance, 1960 (I of 1960), s. 3, for “four”.\n5\nOmitted by P.O. 4 of 1975, Art. 2 and Sch.\n6\nAdded by Ord. No. I of 1960, s. 3.\n7\nSubs. ibid., for certain words.\n8\nOmitted by P.O., 4 of 1975, Art. 2 and Sch.\n9\nThe original cl. (e) was subs. by Ord. No. I of 1960, s. 3.\n10\nSubs. by P.O. 4 of 1975, Art. 2 and Sch.\n11\n(4) When a member of the Board dies, resigns or ceases to reside in Pakistan 2[or to represent\nthe particular interest which he was elected or nominated to represent] or becomes incapable of\nacting, the vacancy shall be filled by a fresh election or nomination, as the case may be, and any\nperson so elected or nominated shall hold office for the un-expired term of his predecessor.\n(5) If any authority or body entitled to elect or nominate a member under this section makes\ndefault in electing or nominating a member within the prescribed time, the 1[Federal Government]\nmay make nomination to fill the vacancy.\n(6) No act or proceeding of the Board shall be invalid merely on the ground of the existence\nof any vacancy in, or any defects in the constitution of, the Board.\n(7) Until the Board is constituted under this section, the Pakistan Tea Board constituted under\nsub-section (1) of section 3 of the Pakistan Tea Act, 1950 (XII of 1950), and functioning\nimmediately before the commencement of this Ordinance shall continue to function, and while so\nfunctioning, shall be deemed to be a Board constituted under this section.\n3\n[(8) The Board shall be a body corporate by the name of the Pakistan Tea Board, having\nperpetual succession and a common seal, with power to acquire, own and dispose of any property\nand shall, by the said name, sue and be sued.]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Functions of the Board",
      "content": "The functions of the Board shall be to 4[undertake such\nbusiness, or to acquire take over or manage the business of such concern, as the 1[Federal\nGovernment] may direct ; to] regulate, control and promote the 5[cultivation and] export of tea ; to\norganise and assist in special research connected with tea cultivation and tea industry]; 5[to regulate\nand control the sale of tea;] to collect statistics from growers, manufactures or dealers of tea and\nother persons on any matter relating to tea and the tea industry; to fix grading standards of tea and\nprovide for training in tea tasting ; and generally, to take such measures as may appear advisable in\nthe interests of the tea industry of Pakistan ; and to perform such other functions as the 1[Federal\nGovernment] may, from time to time, direct."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Control of the Board",
      "content": "_ (1) The Board shall be subject to the superintendence and control\nof the 1[Federal Government], and in the discharge of its functions shall be guided by such general or\nspecial instructions as may, from time to time, be given to it by the 1[Federal Government].\n(2) The 1[Federal Government] may cancel, suspend or modify, as it thinks fit, any act of the\nBoard, and the records of the Board shall be open to inspection by any officer authorized in this\nbehalf by the 1[Federal Government]."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Imposition of tea cess",
      "content": "There shall be levied and collected, for the purposes of this\nOrdinance, a cess on all tea produced in Pakistan, at such rate not exceeding two rupees and eight\nannas per one hundred pounds of tea as the 1[Federal Government] may, by notification in the\nofficial Gazette, fix."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Application of proceeds of cess",
      "content": "__ (1) The proceeds of the cess after deducting the cost\nof collection, if any, shall be paid to the Board and shall be applied by the Board for meeting the\nexpenses of measures taken in the performance of its functions 6[, for payment, of contributions to\nany international organisation connected with tea,] and for contributing towards a contributory\n1\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n2\nIns. by the Tea (Amdt.) Ordinance, 1960 (I of 1960), s. 3.\n3\nSub-section (8) was added by the Laws Amendment Ordinance, 1965 (XXXIX of 1965), s. 4.\n4\nIns. by the Laws Amendment Ordinance 1965 (XXXIX of 1965), s.4.\n5\nIns. by the Tea (Amdt.) Ordinance, 1960 (I of 1960), s. 4.\n6\nIns. ibid., s. 5.\nprovident fund constituted and maintained in such manner as may be prescribed for the benefit of the\nemployees of the Board.\n(2) The Board may, subject to any rules made in this behalf borrow on the security of the cess\nfor any purpose for which it is authorized under sub-section (1) to expend its funds."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Keeping of accounts and audit and annual reports",
      "content": "_(1) The Board shall publish annual\nreports and shall keep regular accounts of all moneys received and expended by it.\n(2) The accounts shall be audited every year by auditors approved in this behalf by the\n1\n[Auditor-General of Pakistan], and such auditors shall have power to disallow any item, which has,\nin their opinion, been expended otherwise than for the purpose of this Ordinance.\n2\n[TEA DEVELOPMENT COMMITTEE]"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Constitution of Tea Development Committee",
      "content": "__(1) The 3[Federal Government] may set\nup a Committee of the Board, to be known as the 4[Tea Development Committee], consisting of___\n(a)        The Chairman of the Board.\n5\n[*                *          *          *          *          *          *]\n6\n[*                *          *          *          *          *          *]\n(2)     A member of the Committee, not being a Government servant shall receive such\nallowances as the 3[Federal Government] may determine.\n(3) A member of the Committee shall cease to be so when he ceases to be a member of the\nBoard."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Functions of the Committee",
      "content": "_ (1) The functions of the Committee shall be to establish\nnew tea gardens to acquire and rehabilitate derelict tea gardens in accordance with such schemes as\nmay be approved by the 3[Federal Government] and generally to render assistance to the existing\ngardens to improve their production.\n(2) The Committee may, with the approval of the 3[Federal Government], sell or transfer its\ntea gardens after they are established, or rehabilitated to any Pakistani national, firm or company."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Grants and loans by Government to the Committee",
      "content": "The 3[Federal Government]\nmay make grants or give loans from the general revenues to the Committee to carry out its functions\nand may, subject to such conditions as it may impose, authorize the Committee to give loans to any\nperson, firm or company at concessional rates for the improvement and expansion of tea estates 7[or\ntea factories] and to borrow money from banks on the security of the assets of its gardens.\n1\nSubs. by F.A.O., 1975 Art. 2 and Sch.\n2\nSubs. by the Tea (Amdt.) Ordinance, 1960 (I of 1960), s. 6, for “Development Committee”.\n3\nSubs. by F.A.O., 4 of 1975, Art. 2 and Table, for “Central Government”.\n4\nSubs. by Ord. No. I of 1960., s. 7, for “Development Committee”.\n5\nCl. (aa) ins. by the Tea (Amdt.) Ordinance, 1962 (LXVI of 1962), s. 3, omitted by the Tea (Amdt.) Ordinance, 1965 (XIV of 1965), s.3.\n6\nOmitted by P.O. 4 of 1975, Art. 2 and Sch.\n7\nIns. by the Tea (Amdt.) Ordinance, 1960 (I of 1960), s. 8."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Appointment of officials by the Committee",
      "content": "The Committee may, subject to the\napproval of the 1[Federal Government], appoint such officers, advisers and employees for the\nefficient performance of its functions as may be necessary."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Keeping of accounts",
      "content": "_(1) The Committee shall keep accounts of all moseys received\nand expended by it.\n(2) The accounts maintained by the Committee shall be audited by the auditors appointed for\nthe purpose by the Board with the previous approval of the 1[Federal Government].\n(3) A statement of the accounts as audited 2[together with a report on its activities] shall be\nfurnished by the Committee to the Board and to the 1[Federal Government] as soon as possible after\nthe end of each financial year.\nCONTROL OVER 3[CULTIVATION AND] EXPORTS\n4\n[13A. Power to direct compulsory expansion.___ (1) The 1[Federal Government] may, by\ngeneral or special order, direct the owner of an estate to plant or replant tea on such minimum area in\nthat estate every year as may be specified in the order.\n(2) Any owner of an estate who fails to comply with any direction issued under sub-section\n(1) shall be liable to pay a fine to be computed at the rate of one thousand rupees per year per acre of\nland in respect of which he makes default till such time as the default is made good.\n(3) The fine imposed under sub-section (2) shall be realized as a public demand or as an\narrear of land revenue]."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Export allotment and its distribution",
      "content": "_(1) The 1[Federal Government] may, in\nconsultation with the Board, by notification in the official Gazette, fix the export allotment of tea\n5\n[for each tea year, that is to say, a year commencing on the first day of April, and ending on the\nthirty-first day of March next following].\n6\n[(2) The export allotment fixed under sub-section (1) may be distributed among such tea\nestates, in such proportion, and in such manner, as the 1[Federal Government] may from time to time\ndetermine.]"
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Export auctions",
      "content": "_(1) The 1[Federal Government] may direct that all tea intended for\nexport 7[or such part thereof as it may specify] shall be sold in a special set of auctions to be known\nas export auctions to be held for this purpose.\n(2) Every estate for which an export quota is fixed for any year shall during the course of\nthat year sell in the export auctions the full amount of its quota 8[or such part thereof as may be\nspecified by the 2[Federal Government]].\n1\nSubs. by the F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n2\nIns. ibid.,s. 9.\n3\nIns. by the Tea (Amdt.) Ordinance, 1960 (I of 1960), s. 10.\n4\nSection 13A was ins ibid., s. 11.\n5\nSubs. by the Tea (Amdt.) Ordinance, 1965 (XIV of 1965), s. 4, for “each year”.\n6\nSubs. by Ord. No. I of 1960, s. 12 for original sub-section 2.\n7\nSubs. ibid.,\n8\nIns. by the Tea (Amdt.) Ordinance 1965, (XIV of 1965), s. 5."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Export of tea purchased at export auctions",
      "content": "_ (1) All tea purchased in the export\nauctions shall be exported by or on behalf of the purchaser within a period of 1[four] months from the\ndate of the purchase and every such purchaser shall have the right to obtain an export licence\nrequired under section 17 for the full quantity required to be exported under this section.\n(2) The 2[Federal Government] may, in special circumstances, permit a purchaser to export in\nlieu of tea purchased in the export auctions an equivalent quantity of tea purchased otherwise than in\nsuch auctions."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Control of export of tea and tea seeds",
      "content": "_(1) No tea shall be exported except under a\nlicence issued by or on behalf of the Board in such form and in accordance with such conditions as\nmay be prescribed.\n(2) No tea seed shall be exported except under a permit issued by or on behalf of the\n2\n[Federal Government].\n(3) The breach of the provisions of this section shall be punishable as if it were an offence\n3\nunder [item 9 of section 156 of the Customs Act, 1969 (IV of 1969) and the provisions of section\n157] and Chapter XVII of that Act shall apply accordingly."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Registration of contracts",
      "content": "The 2[Federal Government] may, by general or special\norder, require any contracts or class of contracts, for sale of tea for export to be registered with such\norganisation and in such manner as maybe specified in the order."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Power to prohibit transport storage or sale",
      "content": "The 2[Federal Government] may, by\ngeneral or special order, direct any 4[person] or class of 5[persons] not to transport, store, buy, sell or\notherwise dispose of any tea or tea of a specified description except in such manner and under such\nconditions as may be specified.\n6\n[19A. Limitation of application of certain provisions of this Chapter.—Nothing in\nsections 14 to 19 of this Chapter shall apply to tea:____\n(a)        proved to the satisfaction of the Collector to have been imported into Pakistan\nfrom any place outside Pakistan,\n(b)        shipped as stores on board any vessels, in such quantity as the Collector\nconsiders reasonable having regard to the number of the crew and passengers,\nand the length of the voyage on which the vessel is about to depart, or\n(c)        exported as samples by post or as air freight in packages not exceeding twenty\npounds avoirdupois in weight].\n1\nSubs. by the Tea (Amdt.) Ordinance, 1960 (I of 1960), s. 13, for “three”.\n2\nSubs. by F.A.O., 1975 Art. 2 and Table, for “Central Government”.\n3\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and II Sch.\n4\nSubs. by the Tea (Amdt.) Ordinance, 1960 (I of 1960), s. 14, for “exporter”.\n5\nSubs. ibid., for “exporters”.\n6\nSection 19A was ins. ibid., s. 15."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Power to call for information etc",
      "content": "_(1) The 1[Federal Government] may, for the\npurposes of this Ordinance at any time, by notified order, direct such person or class of persons as\nmay be specified in the order to maintain such accounts and furnish such returns or other information\nrelating to their business of cultivation, production, manufacture, sale or purchase of tea to the\n1\n[Federal Government] or to such officer or authority subordinate to the 1[Federal Government] or\nthe Provincial Government within such period, and giving such particulars as may be specified.\n(2) Any person authorised in this behalf by the 1[Federal Government] or by the Board or any\nmember authorised by the Chairman of the Board in writing or any officer of the Board may, at all\nreasonable times, enter any tea estate or any place or premises where tea or tea waste is\nmanufactured, stored, kept or exposed for sale and may require the production for his inspection of\nany book, register, record or other paper kept therein and ask for any information relating to the\ncultivation, production, manufacture, storage or keeping for sale of tea or tea waste."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Delegation of powers",
      "content": "The 1[Federal Government] may, by notified order, direct that\nany power conferred upon it by or under this Ordinance, shall, in relation to such matters and subject\nto such conditions, if any, as may be specified in the order, be exercisable also, by___\n(i)        the Board, or\n(ii)       such officer or authority subordinate to the 1[Federal Government] or such\nProvincial Government or such officer or authority subordinate to the\nProvincial Government as may be specified in the direction."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Power to exempt",
      "content": "The 1[Federal Government] may by order exempt any person or\nclass of persons from the operation of all or any of the provisions of this Ordinance 2[to such extent\nand subject to such conditions as may be specified in the order]."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Penalties",
      "content": "_(1) Any person who contravenes or fails to comply with any provision of this\nOrdinance except 3[section 13A and] section 17 or of any order or direction issued under this\nOrdinance shall be punished with imprisonment for a term which may extend to three years or with\nfine or with both.\n(2) Where any person as aforesaid is a company or a body corporate, every director, manager,\nsecretary, or other officer, and every agent and servant thereof, and in the case of an unlimited\ncompany or a company limited by guarantee, also any of its members, shall, subject to the provisions\nof the next succeeding sub-section, be punishable as if he had contravened the provisions of this\nOrdinance.\n(3) No such director, manager, secretary or other officer and no such agent, servant or\nmember as is referred to in subsection (2) shall be prosecuted under this Ordinance unless he has\nbeen given an opportunity by the 1[Federal Government] to show cause, within such time as the\n1\n[Federal Government] may specify why he should not be prosecuted, and if it is made to appear to\nthe satisfaction of the 1[Federal Government] at any time before the institution of the prosecution that\nhe has used due diligence to enforce the observance of the provisions of this Ordinance and the\norders and directions issued there-under or that the offence has been committed without his\nknowledge or against his consent, the 1[Federal Government] shall forbear further proceedings\nagainst him:\n1\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n2\nAdded by the Tea (Amdt.) Ordinance, 1960 (I of 1960), s. 16.\n3\nIns. ibid., s. 17.\nProvided that nothing in this sub-section shall prevent the 1[Federal Government] from\nproceeding against him further if on discovery of new facts it sees reason to do so."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. False statement",
      "content": "If any persons___\n(i)        when required by any order made under this Ordinance to make any statement\nor furnish any information, makes any statement or furnishes any information,\nwhich is false in any material particular and which he knows or as has\nreasonable cause to believe to be false or does not believe to be true, or\n(ii)       makes any such statement as aforesaid in any book, account, record,\ndeclaration, return or other document which he is required by any such order\nto maintain or furnish, or\n(iii)      maintains double sets of books, accounts or any other records, in which the\nentries are not identical, he shall be punishable with imprisonment for a term\nwhich may extend to three years or with fine or with both."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Protection of action taken in good faith",
      "content": "No suit, prosecution or legal proceedings\nshall lie against the Board or any member thereof or any person acting on its behalf in respect of\nanything done in good faith under this Ordinance or any rules made under this Ordinance."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Cognizance of offences",
      "content": "No court shall take cognizance of any offence punishable\nunder this Ordinance except on a report in writing of the facts constituting such offence made by the\nBoard or a person authorized by the Board."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Special provision regarding fines",
      "content": "Notwithstanding anything contained in section 32\nof the Code of Criminal Procedure, 1898 (Act V of 1898), it shall be lawful for any Magistrate of the\nFirst Class specially empowered by the Provincial Government in this behalf to pass a sentence of\nfine exceeding one thousand rupees on any person convicted under this Ordinance."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Presumption as to orders",
      "content": "Where an order purports to have been made and signed by\nan authority in exercise of any power conferred by or under this Ordinance, a court shall, within the\nmeaning of the Evidence Act, 1872 (I of 1872) presume that such order was so made by that\nauthority."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Power to make rules",
      "content": "The 1[Federal Government] may, by notification in the official\nGazette, make rules for carrying out the purposes of this Ordinance."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Power to make bye",
      "content": "laws.___(1) The Board may make bye-laws not inconsistent with this\nOrdinance and the rules made thereunder.\n(2) All bye-laws made under this section shall be subject to the previous approval of the\n1\n[Federal Government].\n31. 2[*              *          *          *          *          *          *]\nDated: 05.04.24\n1\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n2\nRep. by the Repealing and Amending Ordinance, 1965 (X of 1965), s. 2 and 1st Sch."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Pakistan Tea Board constituted under section 3; 1 [(aa) “Collector” means a Collector of Customs appointed under section 3 of the Customs Act, 1969 (IV of 1969);]",
      "source_provision": "sec2"
    },
    {
      "term": "Committee",
      "definition": "the 2[Tea Development Committee] constituted under section 9;",
      "source_provision": "sec2"
    },
    {
      "term": "estate",
      "definition": "a tea estate and includes a tea garden or a part of tea estate or garden;",
      "source_provision": "sec2"
    },
    {
      "term": "export",
      "definition": "to take out of Pakistan by land, sea or air to any place outside Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "owner",
      "definition": "any agent of an owner;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules, made under this Ordinance; 1 Cl. (aa) was ins. by the Tea (Amdt.) Ordinance, 1960 (I of 1960), s. 2. has been subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch. II. 2 Subs. by Ord. No. I of 1960, s. 2, for “Development Committee”.",
      "source_provision": "sec2"
    },
    {
      "term": "tea",
      "definition": "the commodity known as tea made from the leaves of the plant Camellia Thea 1[or Camellia Sinnensis] including adjacent tender stalks or green tea but excluding tea waste; and",
      "source_provision": "sec2"
    },
    {
      "term": "tea seed",
      "definition": "seeds, roots, stumps, cuttings, buds and any living portion of the plant Camellia Thea 1[or Camellia Sinnensis] which may be used to propagate that plant.",
      "source_provision": "sec2"
    }
  ]
}
