{
  "id": "pk-tea-plantations-labour-ordinance-1962",
  "type": "statute",
  "title": "Tea Plantations Labour Ordinance, 1962",
  "title_en": "Tea Plantations Labour Ordinance, 1962",
  "short_name": "TPLO",
  "status": "in_force",
  "issued_date": "1962-05-31",
  "in_force_date": "1962-05-31",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJ6c-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Tea Plantations Labour Ordinance, 1962 (XXXIX of 1962) published by The Pakistan Code (Labour Laws).",
  "provisions": [
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. General power to make rules",
      "content": "ORDINANCE No. XXXIX OF 1962\n[4th June, 1962]\nAn Ordinance to provide for the welfare of labour, and to regulate the conditions of work, in tea\nplantations\nWHEREAS it is expedient to provide for the welfare of labour, and to regulate the conditions\nof work, in tea plantations;\nNOW, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958,\nand in exercise, of all powers enabling him in that behalf, the President is pleased to make and\npromulgate the following Ordinance :-"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, commencement and application",
      "content": "_(1) This Ordinance may be called\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once.\n(4) It applies in the first instance to all tea plantations, but the Provincial Government may,\nby notification in the official Gazette, apply it to any other area of land measuring twenty-five acres\nor more and used or intended to be used for growing tea whereon less than thirty persons are\nemployed, or were employed on any day of the preceding twelve months."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In the Ordinance, unless there is anything repugnant in the subject or\ncontext,-\n(a)    “adolescent” means a person who has completed his fifteenth year but has not\ncompleted his seventeenth year ;\n(b)    “adult” means a person who has completed his seventeenth year;\n(c)    “child” means a person who has not completed his fifteenth year;\n(d)    “day” means a period of twenty four hours beginning at midnight;\n(e)    “employer” when used in relation to a tea plantation means the person who\nhas ultimate control over the affairs of the tea plantation, and where the affairs\nof any tea plantation are entrusted to any other person (whether called a\nmanaging agent, manager, superintendent or by any other name) such other\nperson shall be deemed to be the employer in relation to that tea plantation;\n(f)    “prescribed” means prescribed by rules made under this Ordinance;\n(g)     “tea plantation” means any land used or intended to be used for growing tea\nwhich measures twenty five acres or more and whereon thirty or more persons\nare employed, or were employed on any day of the preceding twelve months ;\n(h)     “wages” has the meaning assigned to it in clause (vi) of section 2 of the\nPayment of Wages Act, 1936 (IV of 1936) ;\n(i)     “week” means a period of seven days beginning at midnight on Saturday night\nor such other night as may be fixed by the Provincial Government in relation\nto tea plantations in any area after such consultation as may be prescribed with\nreference to the tea plantations concerned in that area ;\n(j)     “worker” means a person employed in a tea plantation for hire or reward,\nwhether directly or through any agency, to do any work, skilled, unskilled,\nmanual or clerical, but does not include-\n(i)     a medical officer at the plantation ;\n(ii)    any person whose monthly wages exceed five hundred rupees; or\n(iii)   a person employed in a tea plantation primarily in a managerial\ncapacity notwithstanding that his monthly wages do not exceed five\nhundred rupees ;\n(k)     “young” person means a person who is either a child or an adolescent."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Chief Inspector and Inspectors",
      "content": "_(1) The Provincial Government may, by notification in\nthe official Gazette, appoint for the Province a duly qualified persons to be the chief inspector of tea\nplantations and so many duly qualified persons to be inspectors of tea plantations subordinate to the\nchief inspector as it thinks fit.\n(2) Subject to such rules as may be made in this behalf by the Provincial Government, the\nchief inspector may declare the local area or areas within which, are the tea plantations with respect\nto which, inspectors shall exercise their powers under this Ordinance, and may himself exercise the\npowers of an inspector within such limits as may be assigned to him by the Provincial Government.\n(3) The chief inspector and all inspectors shall be deemed to be public servants within the\nmeaning of section 21 of the Pakistan Penal Code (Act XIV of 1860)."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers and functions of inspectors",
      "content": "Subject to any rules made by the Provincial\nGovernment in this behalf, an inspector may within the local limits for which he is appointed-\n(a)     make such examination and inquiry as he thinks fit in order to ascertain\nwhether the provisions of this Ordinance and of the rules made thereunder are\nbeing observed in the case of any tea plantation;\n(b)     with such assistants from amongst persons in the employment of Government\nor of any municipal body or other local authority, as he thinks fit, enter,\ninspect and examine any tea plantation or part thereof at any reasonable time\nfor the purpose of carrying out the objects of this Ordinance;\n(c)     examine any worker employed in any tea plantation or require the production\nof any register or other document maintained in pursuance of this Ordinance,\nand take on the spot or otherwise statement of any persons which he may\nconsider necessary for carrying out the purposes of this Ordinance ; and\n(d)     exercise such other powers as may be prescribed:\nProvided that no person shall be compelled under this section to answer any question or make\nany statement tending to incriminate himself."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Facilities to be provided to inspector",
      "content": "Every employer shall afford the inspector all\nreasonable facilities for making any entry, inspection, examination or inquiry under this Ordinance."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Notice to inspector before commencement of work",
      "content": "Before work is begun in any tea\nplantation after the commencement of this Ordinance, the employer shall, send to the inspector a\nwritten notice containing—\n(a)     the name of the tea plantation and its situation;\n(b)     the address to which communications relating to the tea plantation should be\nsent ; and\n(c)     such other particulars as may be prescribed for the purposes of this Ordinance."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Certifying surgeons",
      "content": "_(1) The Provincial Government may appoint medical practitioners\nhaving the prescribed qualifications to be certifying surgeons for the purposes of this Ordinance\nwithin such local limits or for such tea plantation or class of tea plantations as it may assign to them\nrespectively.\n(2) The certifying surgeon shall carry out such duties as may be prescribed in connection\nwith-\n(a)     the examination and certification of workers ; and\n(b)     the exercise of such medical supervision as may be prescribed where young\npersons are, or are to be, employed in any work in any tea plantation which is\nlikely cause injury to their health."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Drinking water",
      "content": "In every tea plantation such arrangements as may be prescribed shall be\nmade by the employer to provide and maintain at convenient places in the tea plantation a sufficient\nsupply of wholesome drinking water for all workers."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Conservancy",
      "content": "_(1) There shall be provided separately for males and females in every tea\nplantation a sufficient number of latrines and unrinals of prescribed types and number so situated as\nto be convenient and accessible to workers employed therein.\n(2) All latrines and urinals provided under sub-section (1) shall be maintained in a clean and\nsanitary condition."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Medical facilities",
      "content": "In every tea plantation there shall be provided and maintained so as\nto be readily available such medical facilities for the workers as may be prescribed."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Canteens",
      "content": "_(1) The Provincial Government may make rules requiring that in every tea\nplantation wherein one hundred and fifty or more workers are ordinarily employed, one or more\ncanteens shall be provided and maintained by the employer for the use of the workers.\n(2) Without prejudice to the generality of the foregoing power, such rules may provide for-\n(a)     the date by which the canteen shall be provided;\n(b)     the number of canteens that shall be provided and the standards in respect of\nconstruction, accommodation, furniture and other equipment of the canteens;\n(c)     the food-stuffs which may be served therein and the charges which may be\nmade therefor;\n(d)     the constitution of managing committee for the canteen and the representation\nof the workers in the management of the canteen ; and\n(e)     the delegation to the chief inspector, subject to such conditions as may be\nprescribed, of the power to make rules under clause (c)."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Creches",
      "content": "The Provincial Government may make rules providing that in every tea\nplantation wherein forty or more women workers are employed or were employed on any day of the\npreceding twelve months the employer shall provide and maintain, in such manner and of such-\nstandard as may be prescribed, rooms for the use of such of the children of the women workers as are\nbelow the age of six years."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Recreational facilities",
      "content": "The Provincial Government tray make rules requiring every\nemployer to make provision in his tea plantation for such recreational facilities for the workers and\ntheir children as may be prescribed."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Educational facilities",
      "content": "Where the children between the ages of six and twelve of\nworkers employed in any tea plantation exceed twenty five in number, the Provincial Government\nmay make rules requiring every employer to provide educational facilities for the children in such\nmanner and of such standard as may be prescribed."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. House building facilities",
      "content": "It shall be the duty of every employer to provide house-\nbuilding facilities to every worker and his family residing in the tea plantation according to such\nscale as may be prescribed."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Facilities for daily necessities, etc",
      "content": "It shall be the duty of the employers to provide\nfacilities within easy reach of the employees for obtaining the daily necessities of life through co-\noperative or other means and also to provide the employees with such amenities for protection from\nadverse weather conditions as may be prescribed."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Welfare Officers",
      "content": "_(1) In every tea plantation wherein three hundred or ,more workers\nare ordinarily employed the employer shall employ such number of Welfare Officers as may be\nprescribed.\n(2) The Provincial Government may prescribe the duties, qualifications and conditions of service of\nofficers employed under sub-section (1)."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Weekly hours, spread",
      "content": "over and daily intervals for rest.—The Provincial Government\nmay make rules providing for the regulation of the weekly working hours, their spread-over per day,\nand the daily intervals for rest, for the workers,"
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Weekly holidays.___(1) The Provincial Government may make rules providing for",
      "content": "(a)     a day of rest in every period of seven days which shall be allowed to all\nworkers ; and\n(b)     payment for work done on a day of rest at such overtime rate as may be\nprescribed under section 31.\n(2) Notwithstanding anything contained in clause (a) of sub-section (1) where a worker is\nwilling to work on any day of rest which is not a closed holiday in the tea plantation, nothing\ncontained in this section shall prevent him from doing so:\nProvided that in so doing a worker does not work for more than ten days consecutively\nwithout a holiday for a whole day intervening.\nExplanation.— Nothing contained in this section shall apply to any worker whose total\nperiod of employment, including any day spent on leave, is less than six days."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Notice of period of work",
      "content": "_(1) There shall be displayed and correctly maintained in\nevery tea plantation, in such form and manner as may be prescribed, a notice of periods of work\nshowing clearly for every day the periods during which the workers may be required to work.\n(2) Subject to the other provisions of this Ordinance, no worker shall be required or allowed\nto work in any tea plantation otherwise than in accordance with the notice of periods of work\ndisplayed in the tea plantation.\n(3) An employer may refuse to employ a worker for any day if on that day he turns up for\nwork more than half an hour after the time fixed for the commencement of the day’s work."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Prohibition of employment of young children",
      "content": "No child who has not completed his\ntwelfth year shall be required or allowed to work in any tea plantation."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Night work for women and children",
      "content": "Except with the permission of the chief\ninspector, no woman or child worker shall be a employed in any tea plantation otherwise than\nbetween the hours of 6 A M. and 7 P.M.\nProvided that nothing in this section shall be deemed to apply to midwives and nurses\nemployed as such in any tea plantations."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Non",
      "content": "adult workers to carry tokens.—No child who has completed his twelfth year and\nno adolescent shall be required or allowed to work in any tea plantation unless-\n(a)    a certificate of fitness granted with reference to him under section 24 is in the\ncustody of the employer ; and\n(b)    such child or adolescent carries with him while he is at work a toke giving a\nreference to such certificate."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Certificate of fitness",
      "content": "_(1) A certifying surgeon shall, on the application of any young\nperson or his parent or guardian accompanied by a document signed by the employer or any other\nperson on his behalf that such person will be employed in the tea plantation if certified to be fit for\nwork, or on the application of the employer or any other person on his behalf with reference to any\nyoung person intending to work in the tea plantation, examine such person, and ascertain his fitness\nfor work as a child or an adolescent.\n(2) A certificate of fitness granted under this section shall be valid for a period of twelve\nmonths from the date thereof, but may be renewed.\n(3) Any fee payable for a certificate under this section shall be paid by the employer and shall\nnot be recoverable from the young person, his parents or guardian."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Power to require medical examination",
      "content": "An inspector may, if he thinks necessary so\nto do, cause any young person employed in a tea plantation to be examined by a certifying surgeon."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Application of Chapter",
      "content": "The provisions of this Chapter shall not operate to the\nprejudice of any rights to which a worker may be entitled under any other law or under the terms of\nany award, agreement, or contract of service:\nProvided that, where such award, agreement or contract of service provides for a longer leave\nwith wages than provided in this Chapter, the worker shall be entitled only to such longer leave.\nExplanation.—For the purpose of this Chapter leave shall not, except as provided in section\n27, include weekly holidays or holidays for festivals or other similar occasions."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Annual leave with wages",
      "content": "_(1) Every worker shall be allowed leave with wages for a\nnumber of days calculated at the rate of.\n(a)    if an adult, one day for every thirty days of work performed by him; and\n(b)    if a young person, one day for every twenty days of work performed by him:\nProvided that a period of leave shall be inclusive of any holiday which may occur during such\nperiod.\n(2) if a worker does not in any one period of twelve months taken the whole of the leave\nallowed to him under sub-section (1) any leave not taken by him shall be added to the leave to be\nallowed to him under that sub-section in the succeeding period of twelve months.\n(3) A worker shall cease to earn any leave under this section when the leave with wages due\nto him amounts to thirty days."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Festival holidays",
      "content": "Every worker shall be allowed in a year not less than five days’ paid\nfestival holidays which shall be determined by the employer in consultation with the workers."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Sick leave",
      "content": "Every worker shall be allowed in a year fifteen days sick leave on half\naverage wages."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Wages during leave or holiday period",
      "content": "_(1) For the leave or holidays allowed to a\nworker under section 27 and section 28 he shall be paid at the rate equal to daily average of his total\nfull-time wages for the days on which he worked, exclusive of any overtime earnings and bonus, if\nany, but inclusive of dearness allowance and cash equivalent of any advantage accruing from the\noccasional supply by the employer of food grains.\n(2) A worker who has been allowed leave under section 27 for any period not less than four\ndays in the case of an adult and five days In the case of a young person shall, before his leave begins,\nbe paid his wages for the period of the leave allowed."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Extra wages for overtime",
      "content": "Where a worker works on any day or in a week for more\nthan the hours fixed under section 18, he shall be entitled in respect of the overtime worked to wages\nat such rate as may be prescribed."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Obstruction",
      "content": "_(1) Whoever obstructs an inspector in the discharge of his duties under\nthis Ordinance or refuses or willfully neglects to afford the inspector any reasonable facility for\nmaking any inspection, examination of inquiry authorized by or under this Ordinance in relation to\nany plantation, shall be punishable with imprisonment for a term which may extend to three months,\nor with fine which may extend to five hundred rupees, or with both.\n(2) Whoever willfully refuses to produce on the demand of an inspector any register or other\ndocument kept in pursuance of this Ordinance, or prevents or attempts to prevent or does anything\nwhich he has reason to believe is likely to prevent any person from appearing before or being\nexamined by an inspector acting in pursuance of his duties under this Ordinance, shall be punishable\nwith imprisonment for a term which may extend to three months, or with fine which may extend to\nfive hundred rupees, or with both."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Penalty for contraventions of provisions relating to medical facilities",
      "content": "Any employer\nwho contravenes the provisions of section 10 shall be punishable with imprisonment which may\nextend to three months, or with fine which may extend to five hundred rupees, or with both."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Use of false certificate of fitness",
      "content": "Whoever knowingly uses or attempts to use as a\ncertificate of fitness granted to himself under section 24 a certificate granted to another person under\nthat section, or having been granted a certificate of fitness to himself, knowingly allows it to be used,\nor allows an attempt to use it to be made by another person, shall be punishable with imprisonment\nwhich may extend to one month, or with fine which may extend to fifty rupees, or with both."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Contravention of provisions regarding employment of labour",
      "content": "Whoever except as\notherwise permitted by or under this Ordinance, contravenes any provision of this Ordinance or of\nany rules made thereunder, prohibiting, restricting or regulating the employment of persons in a tea\nplantation, shall be punishable with imprisonment for a term which may extend to three months, or\nwith fine which may extend to five hundred rupees, or with both."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Other offences",
      "content": "Whoever contravenes any of the provisions of this Ordinance or of any\nrules made thereunder for which no other penalty is elsewhere provided by this Ordinance or the\nrules, shall be punishable with imprisonment for a term which may extend to three months, or with\nfine which may extend to five hundred rupees, or with both."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Enhanced penalty after previous conviction",
      "content": "If any person who has been convicted of\nany offence punishable under this Ordinance is again guilty of an offence involving a contravention\nof the same provision, he shall be punishable on a subsequent conviction with imprisonment which\nmay extend to six months, or with fine which may extend to one thousand rupees, or with both."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Exemption of employer from liability in certain cases",
      "content": "Where an employer charged\nwith an offence under this Ordinance alleges that another person is the actual offender, he shall be\nentitled upon complaint made by him in this behalf to have, on giving to the prosecutor in this behalf\nthree clear days’ notice in writing of his intention so to do, that other person brought before the court\non the day appointed for the hearing of the case and if , after the commission of the offence has been\nproved, the employer proves to the satisfaction of the court that-\n(a)     he has used due diligence to enforce the execution of the relevant provisions\nof this Ordinance ; and\n(b)     that the other person committed the offence in question without his\nknowledge, consent or connivance ; the said other person shall be convicted of\nthe offence and shall be liable to the like punishment as if he were the\nemployer and the employer shall be acquitted:\nProvided that—\n(a)     the employer may be examined on oath and his evidence and that of any\nwitness whom .he calls in his support shall be subject to cross-examination on\nbehalf of the person he charges to be the actual offender and by the prosecutor;\nand\n(b)     if, in spite of due diligence, the person alleged as the actual offender cannot be\nbrought before the court on the day appointed for the hearing of the ease, court\nshall adjourn the hearing thereof from time to time so, however, that the total\nperiod of such adjournment does not exceed three months, and if, by the end\nof the said period, the person alleged as the actual offender cannot still be\nbrought before the court, the court shall proceed to bear the case against the\nemployer."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Cognizance of offences",
      "content": "_ No court shall take cognizance of any offence punishable\nunder this Ordinance except on complaint made by the chief inspector or any person authorized by\nhim in this behalf and no court inferior to that of a Magistrate of the first class shall try any offence\npunishable under this Ordinance."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Limitation of prosecutions",
      "content": "No court shall take cognizance of any offence punishable\nunder this Ordinance unless the complaint thereof has been made or is made within three months\nfrom the date on which the alleged commission of the offence comes to the knowledge of an\ninspector:\nProvided that, where the offence consists of disobeying a written order made by an inspector,\ncomplaint thereof may be made within six months of the date on which the offence is alleged to have\nbeen committed."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Indemnity",
      "content": "No suit, prosecution or other legal proceeding shall lie against any person\nfor anything which is in good faith done or intended to be done under this Ordinance."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Leave for person simultaneously engaged in a tea factory and a tea plantation",
      "content": "If a\nperson is employed within the same year both in the tea plantation covered by this Ordinance and a\ntea processing factory covered by the Factories Act, 1934 (XXV of 1934), under the sane\nmanagement, he shall be entitled to the maximum facilities provided under either this Ordinance or\nthat Act so far as annual leave, sick leave and other similar conditions are concerned."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Power to exempt",
      "content": "The Provincial Government may, by order in writing, exempt,\nsubject to such conditions and restrictions as it may think fit to impose, any employer or class of\nemployers from all or any of the provisions of this Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "adolescent",
      "definition": "a person who has completed his fifteenth year but has not completed his seventeenth year ;",
      "source_provision": "sec2"
    },
    {
      "term": "adult",
      "definition": "a person who has completed his seventeenth year;",
      "source_provision": "sec2"
    },
    {
      "term": "child",
      "definition": "a person who has not completed his fifteenth year;",
      "source_provision": "sec2"
    },
    {
      "term": "day",
      "definition": "a period of twenty four hours beginning at midnight;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "tea plantation",
      "definition": "any land used or intended to be used for growing tea which measures twenty five acres or more and whereon thirty or more persons are employed, or were employed on any day of the preceding twelve months ;",
      "source_provision": "sec2"
    },
    {
      "term": "week",
      "definition": "a period of seven days beginning at midnight on Saturday night or such other night as may be fixed by the Provincial Government in relation to tea plantations in any area after such consultation as may be prescribed with reference to the tea plantations concerned in that area ;",
      "source_provision": "sec2"
    },
    {
      "term": "worker",
      "definition": "a person employed in a tea plantation for hire or reward, whether directly or through any agency, to do any work, skilled, unskilled, manual or clerical, but does not include- (i) a medical officer at the plantation ; (ii) any person whose monthly wages exceed five hundred rupees; or (iii) a person employed in a tea plantation primarily in a managerial capacity notwithstanding that his monthly wages do not exceed five hundred rupees ;",
      "source_provision": "sec2"
    }
  ]
}
