{
  "id": "pk-terrorist-affected-areas-special-courts-act-1992",
  "type": "statute",
  "title": "Terrorist Affected Areas (Special Courts) Act, 1992",
  "title_en": "Terrorist Affected Areas (Special Courts) Act, 1992",
  "short_name": "TAACA",
  "status": "in_force",
  "issued_date": "1992-11-30",
  "in_force_date": "1992-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apmZZw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Terrorist Affected Areas (Special Courts) Act, 1992 (X of 1992) published by The Pakistan Code (Criminal Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Terrorist\nAffected Areas (Special Courts) Act, 1992.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act, unless there is anything repugnant in the subject or context,__\n(a)     “Code” means the Code of Criminal Procedure, 1898 (Act V of 1898);\n(b)     “Government” means the Federal Government;\n(c)     “Civil armed forces” means the Pakistan Rangers, the Frontiers Crops,\nPakistan Coast Guards, Frontier Constabulary or any other force notified by\nthe Government as such;\n(d)     “Notification” means a notification published in the official Gazette;\n(e)     “Public Prosecutor” means a Public Prosecutor” or an Additional Public\nProsecutor or a Special Public Prosecutor appointed under section 12;\n(f)     “Schedule offence” means an offence specified in the Schedule being an\noffence committed in a terrorist affected area;\n(g)     “Special Court” means a Special Court established under section 6;\n(h)     “terrorist affected area” means an area declared as a terrorist affected area\nunder section 3;\n(i)     “Zone” means a zone constituted under section3;\n(j)     words and expressions used but not defined in this Act and defined in the\nCode shall have the meanings respectively assigned to them in the Code.\n(2) Any reference in this Act to the Code or any provision thereof shall, in relation to an area\nin which the Code or such provision is not in force be construed as a reference to the corresponding\nlaw or the relevant provisions of the corresponding law, if any, in force in that area."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Declaration of terrorist affected areas",
      "content": "If the Government is of the opinion that\noffences of the nature specified in the Schedule are being committed in any area on such a scale and\nin such a manner that it is expedient for the purpose of coping with such offences to have recourse to\nthe provisions of this Act, it may, by notification,__\n(a)     declare such area to be a terrorist affected area;\n(b)     constitute such area into a single zone or into as many zones as it may deem\nfit; and\n(c)     direct the Provincial Government of the Province in which such zone is\nsituated to appoint a Magistrate for each zone or a number of such zones."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Use of Police and Civil Armed Forces, etc",
      "content": "(1) If a Magistrate on receiving a police\nreport or other information is of the opinion__\n(a)     that any person in the zone is harbouring criminals, keeping as hostage any\nperson who has been kidnapped or abducted, indulging in violence\nconstituting a cognizable offence or acting in breach of an order for the time\nbeing in force prohibiting the assembly of more than five persons or violation\nof curfew or transporting weapons or firearms, ammunition or explosive\nsubstances or carrying weapons or firearms, ammunition or explosive\nsubstances on his person, whether openly or concealed, in breach of law or for\nun-lawful purposes;\n(b)     that it is necessary to destroy any illicit arms dump or prepared or fortified\nposition or shelter from which armed attacks are made or are likely to be made\nor any structure used as straining camp for armed insurgents or utilized as a\nhideout by armed gangs of dacoits or anti- state elements or absconders\nwanted for any offence;\n(c)     that it is necessary to arrest any person who has committed a cognizable\noffence or against whom a reasonable suspicion exists that he has committed\nor is about to commit a cognizable offence; or\n(d)     that it is necessary to enter and search without warrant any place to make\narrest of any such person or to secure release of any person illegally confined\nor detained or for recovery of any property reasonably suspected to be crime\nproperty or recovery of any arms, ammunition or explosive substances or\nlethal weapons believed to be unlawfully kept;\nmay be verbal orders require such person to comply with law, desist from indulging in unlawful\nactivity, surrender himself or anything in his control.\n(2) If his orders under sub-section (1) are not complied with, the Magistrate after such\nwarning as may be sufficient in his opinion and use of force become necessary for the purpose of\nsecuring compliance with the said orders may direct the officer or Junior Commissioned Officer or\nthe police or civil armed forces officers at his disposal to secure such compliance and to use\nnecessary force, even to the extent of causing death,__\n(a)     against any person referred to in clause (a) of the said sub section;\n(b)     to destroy any illicit arms dumps prepared or fortified position or shelter from\nwhich armed attacks are made or are likely to be made or any structure used\nas training camp for armed insurgents or utilized as a hideout by armed gangs\nof dacoits or anti-state elements or absconders wanted for any offence;\n(c)     to arrest without warrant any person referred to in clause of the said sub-\nsection; or\n(d)     to enter and search with warrant, any place to make arrest of any such\nperson or to secure release of any person illegally confined or detained or for\nrecovery of any property reasonably suspected to be crime property or any\narms, ammunition or explosive substances or lethal weapons believed to be\nunlawfully kept."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power of police, civil armed forces, etc",
      "content": "(1) When the Magistrate cannot be\ncommunicated with any police officer not below the rank of Sub-Inspector or an officer of\nequivalent rank in the civil armed forces or a Naib Subedar may after sufficient warning use\nnecessary force even to the extent of causing death,__\n(a)     against any person referred to in clauses (a) of sub-section (1)of section 4;\nor\n(b)     to destroy any illicit arms dump, prepared or fortified position or shelter\nfrom which armed attacks are made or are likely to be made, or any\nstructure used as training camp for armed insurgents or utilized as a hideout\nby armed gangs of dacoits or anti-state elements or absconders wanted for any\noffence; or\n(c)     to arrest, without warrant, any person referred to in clause( c ) of sub-section\n(1) of section 4; or\n(d)     to enter and search without warrant any place to make arrest of any such\nperson to secure release of any person illegally confined or detained or for\nrecovery of any property reasonably suspected to be crime property or any\narms, ammunition or explosive substances or lethal weapons believed to be\nunlawfully kept.\n(2) The officer referred to in sub-section (1) shall, at the first opportunity as and when it\nbecomes practicable for him to communicate with the magistrate, do so and shall thenceforward\nobey the instructions of the Magistrate as to whether he shall or shall not continue such action."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Establishment of Special Courts",
      "content": "(1) For the purpose of providing for speedy trial of\nscheduled offences committed in a zone, the Government may establish, by notification, a Special\nCourt in relation to such zone__\n(a)     within such zone; or\n(b)     if the Government having regard to the exigencies of the situation prevailing\nsuch zone considers it expedient so to do, at any place outside such zone but\nwithin the province in which such zone is situated.\n(2) Notwithstanding anything contained in sub-section (1), if having regard to the exigencies\nof the situation prevailing in a province, the Government is of the opinion that it is expedient to\nestablish in relation to a zone, or in the relation to two or more zones, in the province, a Special\nCourt outside the said zone or zones, for the trial of such scheduled offences committed in the zone\nor zones the trial whereof within the zone or any of the zones—\n(a)     is not likely to be fair or impartial or completed with utmost dispatch; or\n(b)     is not likely to be feasible without occasioning a breach of peace or grave risk\nto the safety of the accused, the witnesses, the Public Prosecutor and the\nperson constituting the Special Court, or any of them; or\n(c)     is not otherwise in the interest of justice, the Government may, by\nnotification, establish in relation to such zone or zones a Special Court at such\nplace outside the said zone or zones as may be specified in the notification."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Composition and appointment of Presiding officers of Special Courts. A Special Court",
      "content": "shall consist of a Judge, being a person who is, or has been, or is qualified for appointment as, a\nJudge of a High Court and is appointed by the Government after consultation with the Chief Justice\nof the High Court."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Place of sitting",
      "content": "(1) A Special Court shall sit at such place as the Government may, by\norder specify in that behalf.\n(2) Subject to the provisions of sub-section (1), a Special Court may, if it considers it\nexpedient or desirable so to do, sit for holding trial of a case at any place other than the ordinary\nplace of its sitting in the province in which it is establish;\nProvided that, if the Public Prosecutor certifies to the Special Court that it is in his\nopinion necessary for the protection of the accused or any witness or otherwise expedient in the\ninterests of justice that the whole or any part of the trial should be held at some place other than the\nordinary place of its sitting, the Special Court may, after hearing the accused, make an order to that\neffect unless, for reasons to be recorded in writing, the Special Court thinks fit to make any other\norder."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Jurisdiction of Special Court",
      "content": "(1) Notwithstanding anything contained in the Code or\nin any other law, a scheduled offence committed in a zone in a province, shall be triable only by the\nSpecial Court exercising territorial jurisdiction in such zone.\n(2) Notwithstanding anything contained in sub-section (1), if, in respect of a case involving a\nscheduled offence committed in any zone in a province, the Government, having regard to the\nprovisions of sub-section (2) of section 6 and the facts and circumstances of the case, is of the\nopinion that it is expedient that such offence should be tried by the Special Court established in\nrelation to such zone outside the zone, the Government may make a declaration to that effect.\nExplanation.—Where a Special Court is established in relation to two or more zones, such\nSpecial Court shall be deemed, for the purpose of this sub-section, to have been established in\nrelation to each of such zones.\n(3) A declaration made under sub-section (2) shall not be called in question in any court.\n(4) Where any declaration is made in respect of any offence committed in a zone in a\nprovince, any prosecution in respect of such offence shall be instituted only in the Special Court\nestablished in relation to such zone outside such zone, and, if any prosecution in respect of such\noffence is pending immediately before such declaration in any other court, the same shall stand\ntransferred to such Special Court and such Special Court shall proceed with such case from the stage\nat which it was pending at that time."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Transfer of cases",
      "content": "(1) Notwithstanding anything contained in the Act, the\nGovernment may, if it considers it expedient so to do in the interest of justice, or were the\nconvenience or safety of the witnesses or the safety of the accused so requires, transfer any case__\n(a)    from any court to a Special Court; or\n(b)    from one Special Court to another Special Court within or outside the zone but\nin the same province.\n(2) A Special Court to which a case is transferred under sub-section (1) shall proceed with the\ncase from the stage at which it was pending immediately before such transfer and it shall not be\nbound to recall and rehear any witness who has given evidence and may act on the evidence already\nrecorded."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Powers of Special Courts with respect to other offences",
      "content": "(1) When trying any\nscheduled offence a Special Court may also try any offence other than the scheduled offence with\nwhich the accused may, under the Code, be charged at the same trial.\n(2) If, in the course of any trial under this Act, it is found that the accused person has\ncommitted any other offence, the Special Court, may, whether such offence is or is not a scheduled\noffence, convict such person of such offence and pass any sentence authorised by law for the\npunishment thereof."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Public prosecutors",
      "content": "(1) For every Special Court, the Government shall appoint a\nperson to be the Public Prosecutor and may appoint one or more person to be Additional Public\nProsecutor or Additional Public Prosecutors;\nProvided that the Government may also appoint for any case or class of cases a Special\nPublic Prosecutor.\n(2) Every person appointed as a Public Prosecutor or an Additional Public Prosecutor or a\nSpecial Public Prosecutor shall be deemed to be a Public Prosecutor within the meaning of\nsection 492 of the Code, and the provisions of the Code shall have effect accordingly."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Procedure and powers of Special Court",
      "content": "(1) The officer-in-charge of a police-\nstation shall complete the investigation and forward directly to the Special Court a report under\nsection 173 of the Code within fourteen days in respect of a case triable by such court;\nProvided that the Special Court may extend the time within which such report is to be\nforwarded in a case where good reasons are shown for not being able to do so within the time\nspecified in this sub-section.\n(2) Any default on the part of an officer-in-charge of a police-station, an investigating officer\nor any other person required by law to perform any functions in connection with the investigation,\nthat results in, or has the effect of, delaying the investigation or submission of the report under\nsub-section (1), shall be deemed to be a wilful disobedience of the order of the Special Court and\ndealt with under the law accordingly.\n(3) The Special Court may directly take cognizance of a case triable by such court without\nthe case being sent to it under section 190 of the Code.\n(4) In cases triable by a Special Court, orders for detention of an accused in police custody\nunder section 167 of the Code shall be obtained from the Special Court Concerned which shall\nrecord reasons for authorising or refusing such detention:\nProvided that, where an accused cannot within twenty-four hours be produced before the\nSpecial Court, a temporary order for police custody no exceeding twenty-four hours may be obtained\nfrom the nearest Magistrate for the purpose of producing the accused before the Special Court within\nthat period.\n(5) Where, in a case triable by the Special Court, an accused has been released from police\ncustody under section 169 of the Code, or has been remanded to judicial custody, the Special Court\nmay, on good grounds being shown by a Public Prosecutor or Law Officer of the Government, for\nreasons to be recorded in writing, make an order for placing him in police custody for a period not\nexceeding ten days for the purpose of further investigation in the case.\n(6) For the purposes of sub-sections (4) and (5), a Special Court shall be deemed to be a\nMagistrate.\n(7) On taking cognizance of a case, the Special Court shall proceed with the trial from day to\nday and shall decide the case within thirty days.\n(8) A Special Court shall not adjourn any trial for any purpose unless such adjournment is, in\nits opinion, necessary in the interest of justice and no adjournment shall, in any case, be granted for\nmore than two working days.\n(9) A Special Court shall not, merely by reason of a change in its composition or transfer of\na case under sub-section (1) of section 10, be bound to recall and re-hear any witness who has given\nevidence and may act on the evidence already recorded.\n(10) Any accused person may be tried in his absence if the Special Court, after such\ninquiry as it deems fit, is satisfied that—\n(a)    such absence is deliberate and brought about with a view to impending the\ncourse of justice; or\n(b)    the behavior of the accused in court has been such as to impede the course of\njustice and the Special Court has on that account ordered his removal from the\nCourt:\nProvided that, in a case referred to in clause (a) the accused person shall not be tried\nunless a proclamation in accordance with the provisions of Section 87 of the Code has been\npublished in respect of him, which proceedings shall be completed by the Special Court within\nseven days, and until the proclamation has been published in at least three national daily\nnewspapers out of which one shall be in Urdu language and the Court may also proceed under\nsection 88 of the code;\nProvided further that the Special Court shall proceed with the trial after taking necessary\nsteps to appoint an advocate to defend the accused person who is not before the Court.\nExplanation.—An accused who is tried in his absence under sub-section (10) shall be\ndeemed not to have admitted commission of any offence for which he has been charged.\n(11) the advocate appointed under the second proviso to sub-section (10) shall be a person\nselected by the Special Court for the purpose and he shall be engaged at the expense of the\nGovernment and a notice of his appointment shall be published by the Special court in the\nnewspapers referred to in the first proviso to that sub-section.\n(12) If, within sixty days from the date of his conviction, any person tried under sub-section\n(10) appears voluntarily, or is apprehended and brought before the Special Court, and proves to its\nsatisfaction that he did not abscond or conceal himself for the purpose of avoiding the proceeding\nagainst him, the Special Court shall set aside his conviction and proceed to try him in accordance\nwith law for the offence for which he is charged:\nProvided that, the Special Court may exercise its powers under this sub-section in a case in\nwhich a person as aforesaid appears before it after the expiration of the said period and satisfies it\nthat he was prevented from appearing within the said period by circumstances beyond his control.\n(13) Where a scheduled offence is punishable with imprisonment for a term not exceeding\nthree years, or with fine, or with both, a Special Court may, notwithstanding anything contained in\nsub-section (1) of section 260 or section 262 of the Code, try the offence in a summary way in\naccordance with the procedure prescribed in the Code and the provisions of sections 263 to 265 of\nthe Code shall, so far as may be apply to such trial: and\nProvided that, in the case of any conviction in a summary trial under this section, it shall be\nlawful for a Special Court to pass a sentence of rigorous imprisonment for a term not exceeding two\nyear:\nProvided further that a Special Court shall not try in a summary way any case which was\npending in any Court immediately before the commencement of this Act and is transferred to the\nSpecial Court under Section 10.\n(14) Subject to the other provisions of this Act, a Special Court shall, for the purpose of trial\nof any offence, have all the powers of a court of Session and shall try such offence as if it were a\nCourt of Session as for as may be in accordance with the procedure prescribed in the Code for\ntrial before a Court of Session."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Protection of witnesses",
      "content": "All proceedings before a Special Court shall be conducted\nin open Court.\nProvided that, where the Public Prosecutor so applies or the Special Court considers it\nnecessary so to do for any reason, any proceedings or part thereof may be held in camera.\n(2) A Special Court may, on an application made by a witness in any proceedings before it or\nby the Public Prosecutor in relation to such witness or on its own motion, take such measures as it\ndeems fit for keeping the identity and address of the witness secret.\n(3) In particular and without prejudice to the generality of the provisions of sub-section (2),\nthe measures which a Special Court may take under that sub-section may include\n(a)     the holding of the proceedings at a protected place;\n(b)     the avoiding of the mention of the names and addresses of the witnesses in its\norders or judgments or in any record of the case accessible to public; and\n(c)     the issuing of any directions for securing that the identity and addresses of the\nwitnesses are not disclosed.\n(4) Any person who contravenes any direction issued under sub-section (2) shall be punishable with\nrigorous imprisonment for a term of three years and with fine which may extend to ten thousand\nrupees."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Manner and place of execution of sentence",
      "content": "The Government may specify the\nmanner, mode and place of execution of any sentence passed under this Act, having regard to the\ndeterrent effect which such execution is likely to have."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Power to transfer cases to regular courts",
      "content": "Where, after taking cognizance of any\noffence, a Special Court is of opinion that the offence is not a scheduled offence, it shall,\nnotwithstanding that it has no jurisdiction to try such offence, transfer the case for trial of such\noffence to any court having jurisdiction under the Code and the court to which the case is transferred\nmay proceed with the trial of the offence as if it had taken cognizance of the offence."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Appeal",
      "content": "(1) An appeal against the final judgment of the Special Court shall lie to the\nSupreme Ap pellate Court which shall consist of—\n(a)     a Chairman, being a Judge of the Supreme Court to be nominated by the\ngovernment after consultation with the Chief Justice of Pakistan: and\n(b)     two Judges of the High Courts to be nominated by the Government after\nconsultation with the Chief Justice of the High Court concerned.\n(2) The Government may establish as many Supreme Appellate Courts as it may deem\nnecessary.\n(3) Copies of the judgment of a Special Court shall be supplied to the accused and the Public\nProsecutor free of cost on the day the judgment is pronounced and the record of the trial shall be\ntransmitted to the Supreme Appellate Court within three days of the decision.\n(4) An appeal under sub-section (1) shall be preferred by a person sentenced by the Special\nCourt to the Supreme Appellate Court within seven days of the passing of the sentence.\n(5) The Attorney General or Advocate General may, or on being directed by the Government\nshall, present to the Supreme Appellate Court an appeal against the order of acquittal or a sentence\npassed by a Special Court within thirty days of such order.\n(6) An appeal under this section shall be heard and decided by the Supreme Appellate\nCourt within thirty days.\n(7) A Supreme Appellate Court shall sit at such places, and have jurisdiction within such\nterritorial limits, as may be fixed by the Government.\n(8) In exercise of the appellate jurisdiction, a Supreme Appellate Court shall, subject to the\nprovisions of this Act, have all the powers conferred on an Appellate Court under Chapter XXXI of\nthe Code."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Trial before special Court to have precedence",
      "content": "The trial under this Act of any\noffence by a Special Court, and appearance of the accused before it, shall have precedence over the\ntrial of any other case against the accused in any other Court, except the High Court on its original\nside."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Modified application of certain provisions of the Code",
      "content": "(1) Notwithstanding\nanything contained in the code or any other law, every scheduled offence shall be deemed to be a\ncognizable offence within the meaning of clause (f) of Section 4 of the Code and “cognizable case”\nas defined in that clause shall be construed accordingly.\n(2) Sections 374 to 379 of the Code shall apply in relation to a case involving a scheduled\noffence subject to the modification that the reference to “Court of Session” and “High Court”,\nwherever occurring therein, shall be construed as reference to “Special Court” and “Supreme\nAppellate Court”, respectively.\n(3) Notwithstanding the provisions of sections 439, 496, 497, 498, 498A and 561 A of\nthe Code, no Court other than the Special Court shall have the power or jurisdiction to grant bail to\nan accused person in a case triable by a Special Court:\nProvided that the Special Court shall not release the accused on bail if there are reasonable\ngrounds for believing that he has been guilty of the offence for which he has been charged, nor shall\nan accused person be so released unless the prosecution has been given notice to show cause why he\nshould not be so released."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Overriding effect of Act",
      "content": "(1) The provisions of this Act shall have effect\nnotwithstanding anything contained in the Code or any other law but, save as expressly provided in\nthis Act, the provisions of the code shall, in so far as they are not inconsistent with the provisions of\nthis Act, apply to the proceedings before a Special Court; and for the purpose of the said provisions\nof the Code, the Special Court shall be deemed to be a Court of Session.\n(2) In particular and without prejudice to the generality of the provisions contained in sub-\nsection (1), the provisions of section 350 of the code shall, as far as may be, apply to the\nproceedings before a Special Court, and for this purpose any reference in those provisions to a\nmagistrate shall be construed as a reference to the Special Court."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Delegation",
      "content": "The Government may, by notification, delegate, subject to such conditions\nas may be specified, all or any of the powers exercisable by it under this Act."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Power to amend the Schedule",
      "content": "The Government may, by notification, amend the\nSchedule so as to add an entry thereto or modify or omit any entry therein."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Power to make rules",
      "content": "The Government may, by notification, make such rules, if\nany, as it may deem necessary for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Saving",
      "content": "(1) Nothing contained in this Act shall affect the jurisdiction exercisable by, or\nthe procedure applicable to, any Court or other authority under any law relating to the Naval,\nMilitary or Air Force or any other armed force of the Government.\n(2) For the removal of doubts, it is hereby declared that, for the purpose of any such law as is\nreferred to in sub-section (1), a Special Court shall be deemed to be a court of ordinary criminal\njurisdiction.\n(3) Nothing contained in this Act shall affect any proceedings pending in any Special Court\nconstituted under the Suppression of the Terrorist Activities (Special Courts) Act, 1975 (XV of\n1975), immediately before the commencement of this Act."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Presumption as to certain offences",
      "content": "(1) Where any person accused of having\ncommitted a scheduled offences is found to be in possession of, or to have under his control, an\narticle or thing which is capable of being used for, or in connection with, the commission of such\noffence, or is apprehended, in circumstances which tend to raise a reasonable suspicion that he has\ncommitted such offence, he shall be presumed to have committed the offence unless he can prove\nthat he had not in fact committed the offence.\n(2) Where a person is accused of having committed by scheduled offence specified in sub-\nsection (3), in a terrorist affected area and it is shown that such person had been at a place in such\narea at a time when firearms or explosives were used at or from that place to attack or resist the\nmembers of any armed forces or the forces charged with the maintenance of public order acting in\nthe discharge of their duties, it shall be presumed, unless the contrary is shown, that such a person\nhad committed such offence.\n(3) The offences referred to in sub-section (2) are the following:—\n(a)     sections 121, 121A, 122, 123, 123A and 124A of the Pakistan Penal Code\n(Act XLV of 1860) and;\n(b)     criminal conspiracy or attempt to commit, or abetment of, any of the\naforesaid offences."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Contempt of Court",
      "content": "A Court shall have the power to punish with rigorous\nimprisonment for a term which may extend to one year and with fine any person who__\n(a)     abuses, interferes with or obstructs the process of the Court in any way or\ndisobeys any order or direction of the Court;\n(b)     scandalizes the Court or otherwise does anything which tends to bring the\nCourt or a person constituting the Court into hatred, ridicule or contempt;\n(c)     does anything which tends to prejudice the determination of a matter pending\nor most likely to come up before the court; or\n(d)     does anything which, by any other law, constitutes contempt of Court.\nExplanation.—In this section , “Court” means a Special Court or, as the case may be, a\nSupreme Appellate Court."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Indemnity",
      "content": "No suit, prosecution or other legal proceedings shall lie against any\nperson in respect of anything which is in good faith done or intended to be done under this Act.\n______\n[See Section 2(f)]"
    }
  ],
  "definitions": [
    {
      "term": "Code",
      "definition": "the Code of Criminal Procedure, 1898 (Act V of 1898);",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "Civil armed forces",
      "definition": "the Pakistan Rangers, the Frontiers Crops, Pakistan Coast Guards, Frontier Constabulary or any other force notified by the Government as such;",
      "source_provision": "sec2"
    },
    {
      "term": "Notification",
      "definition": "a notification published in the official Gazette;",
      "source_provision": "sec2"
    },
    {
      "term": "Public Prosecutor",
      "definition": "a Public Prosecutor” or an Additional Public Prosecutor or a Special Public Prosecutor appointed under section 12;",
      "source_provision": "sec2"
    },
    {
      "term": "Schedule offence",
      "definition": "an offence specified in the Schedule being an offence committed in a terrorist affected area;",
      "source_provision": "sec2"
    },
    {
      "term": "Special Court",
      "definition": "a Special Court established under section 6;",
      "source_provision": "sec2"
    },
    {
      "term": "terrorist affected area",
      "definition": "an area declared as a terrorist affected area under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "Zone",
      "definition": "a zone constituted under section3; (j) words and expressions used but not defined in this Act and defined in the Code shall have the meanings respectively assigned to them in the Code. (2) Any reference in this Act to the Code or any provision thereof shall, in relation to an area in which the Code or such provision is not in force be construed as a reference to the corresponding law or the relevant provisions of the corresponding law, if any, in force in that area.",
      "source_provision": "sec2"
    }
  ]
}
