{
  "id": "pk-the-census-ordinance-1959-repealed-by-act-xiv-of-2011-section-63-w-e-f-31-05-201",
  "type": "statute",
  "title": "THE CENSUS ORDINANCE, 1959(Repealed by Act XiV of 2011 section 63 (w.e.f 31-05-2011)))",
  "title_en": "THE CENSUS ORDINANCE, 1959(Repealed by Act XiV of 2011 section 63 (w.e.f 31-05-2011)))",
  "short_name": "TCOBA",
  "status": "repealed",
  "issued_date": "1959-03-20",
  "in_force_date": "1959-03-20",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NpaJ1m-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of THE CENSUS ORDINANCE, 1959(Repealed by Act XiV of 2011 section 63 (w.e.f 31-05-2011))) (X of 1959) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, Extent and Commencement",
      "content": "_(1) This Ordinance may be called the\nCensus Ordinance, 1959.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once.\n3\n[2. Definitions.__ In this Ordinance, unless there is anything repugnant in the\nsubject or context,___\n(a)          “Census” means population and housing census;\n(b)          “Census Officer” means any person appointed under section 4;\n(c)          “House” includes a building, tent or vessel used as human dwelling;\n(d)          “Local council” means a local council constituted under any law relating to\n1\nThe Ordinance has been applied to the Provincially Administered Tribal Areas of Baluchistan by Baluchistan Government Notification no.\nS.O. (TA) 3-1/71, dated 28-12-1980, see Baluchistan Gazette, Ext. No. 251, dated 28-12-1980.\nThis Ordinance shall apply to the whole of the Tribal Areas, see Regulation No. 1 of 1981, Art. 2.\nThis Ordinance shall applied to the Federally Administered Tribal Areas, by S.R.O. No. 1273 (I)/80, dated 21-12-1980.\nThe Census (Amendment) Act, 1991 (6 of 1991), shall apply to the Federally Administered Tribal Areas, Vide S.R.O. No. 1154 (I)/92, dated\n15-11-1992.\nBaluchistan Notification No. S.O (T.A.) 3-11/91/621, dated 6-5-1993.\n2\nIns. by the Census (Amdt.) Act, 1991 (6 of 1991), ss. 2 and 3.\n3\nSubs. ibid., s. 4, for section 2.\nlocal government and includes a Cantonment Board constitute under the\nCantonments Act 1924 ; and\n(e)         “Prescribed” means prescribed by rules made under this Ordinance.]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Declaration for Taking Census. The 1[Federal Government] may, from time to",
      "content": "time, by notification 2in the official Gazette, declare that census for Pakistan shall be taken\nduring such period as may be specified therein."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Census Officers.",
      "content": "_(1) The 1[Federal Government] may appoint___\n(i)         a 3[Chief Census Commissioner] to supervise the taking of census throughout\nPakistan;\n4\n(ii)         [Provincial Census Commissioner] to supervise the taking of census within Province\n5\n* * *; and\n(iii)       Census Officers to take, aid in or supervise the taking of, census within any specified\narea.\n(2) The 1[Federal Government] may, by order6, delegate the powers conferred upon it\nby clause (iii) of sub-section (1) to such officer or authority as may be specified in the order.\n(3) A declaration in writing signed by any authority authorized in this behalf by the\n1\n[Federal Government] that any person has been duly appointed a Census Officer shall be\nconclusive proof of such appointment."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Discharge of duties of Census Officers in certain cases",
      "content": "__(1) If the District\nMagistrate, or any authority authorized in this behalf by the 1[Federal Government], by an\norder in writing so directs,____\n(a)         every officer in command of any body of men belonging to naval, military or\nair force of Pakistan or of any vessel of war,\n(b)         every person, other than a pilot or harbour-master, having charge or control of\na vessel,\n1\nSubs. by F.A.O., 1975 Art. 2 and Table, for “Central Government”.\n2\nFor such a notification, see Gaz. of P., 1960, Ext., p. 117.\n3\nSubs. by the Census (Amdt.) Act, 1991 (6 of 1991), s. 5 for “Census Commissioner”.\n4\nSubs. ibid., for “Director of Census”.\n5\nThe words “or the Federal Capital” omitted by A.O., 1964, Art. 2 and Sch.\n6\nFor such an order, see Gaz. of P., 1960, Ext., pp. 325___334.\n(c)        every person, in charge of a lunatic asylum, hospital, work-house, prison,\nreformatory or lock-up or of any public, charitable, religious or educational\ninstitution,\n(d)        every keeper, owner, secretary or manager of any sarai, hotel, boardinghouse,\nlodging-house, emigration depot, or club,\n(e)        every manager or officer of a railway, or any commercial or industrial\nestablishment or trading concern, and\n(f)        every occupant of immovable property wherein persons are living at the time\nof taking census,\nshall, in relation to the person who, at the time of the taking the census, are under his\ncommand or charge, or are inmates of his sarai, hotel, house, depot or club, or are employed\nunder him, or are present on or in such immovable property, perform such duties of a Census\nOfficer as may be required by such order.\n(2) The provisions of this Ordinance relating to a Census Officer shall, so far as may\nbe, apply to a person performing the duties of a Census Officer in pursuance of an order\nunder sub-section (1).\n(3) Whoever refuses or neglects to perform the duties which he is directed under\nsub-section (1) to perform shall be deemed to have committed an offence under section 187\nof the Pakistan Penal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to call upon certain persons to give assistance. The District Magistrate,",
      "content": "or any Census Officer appointed under clause (iii) of sub-section (1) of section 4 for any local\narea and authorized by rules in this behalf, may, by order in writing, call upon___\n(a) owners and occupiers of land, farmers, tenure holders and assignees of land\nrevenues, or their agents;\n(b) member of 1[local councils] and other local authorities, and officers, and\n1\nSubs. by the Census (Amdt.) Act, 1991 (6 of 1991), s. 6, for Certain words.\nservants thereof; and\n(c)         school teachers, government servants and literate persons of good repute for\nthe time being residing in the area concerned;\nto work as enumerators, or perform any other duties of a Census Officer, or to give such\nassistance as may be specified in the order towards the taking of census of persons who 1[and\nof house which] are, at the time of the taking of census, on the lands of such owners,\noccupiers, farmers, tenure holders or 3 assignees, or within the areas which such members\nrepresent or for which such local authorities are established, or, as the case may be, in which\nsuch teachers, government servants or literate persons are themselves residing, and the\npersons to whom an order under this section is directed shall be bound to obey the same."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Formulation of Questionnaire and asking of Questions",
      "content": "_(1) The 2[Federal\nGovernment] may, by notification in the official Gazette, formulate such questionnaire as it\nthinks fit, and a Census Officer may require any person within his jurisdiction to give\nanswers to such questionnaire and to such other questions relevant to the questionnaire as he\nmay think fit.\n(2) any person who is required to give answers to the questionnaire and other relevant\nquestions under sub-section (1) shall be legally bound to give answer to the best of his\nknowledge or belief:\nProvided that a woman shall not be so bound to state the name of her husband or\ndeceased husband or of any other person whose name she is forbidden by custom to mention."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Occupier to allow access and affixing of marks, etc. Every person occupying any",
      "content": "house, enclosure, vessel or other place shall allow the Census Officer such access thereto as,\nhaving regard to the customs of the country, they may reasonably\n1\nIns. by the Census (Amdt.) Act, 1991 (6of 1991), s. 6.\n2\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\nrequire for the purposes of the census and shall allow them to paint on, or affix to, the house,\nenclosure, vessels or place such letters, marks or numbers as may be necessary for the\npurposes of the census."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Occupier, manager to fill up a prescribed schedule.",
      "content": "_(1) Subject to any rule\nmade in this behalf, a Census Officer may within the local limits of his jurisdiction\nleave or cause to be left a Schedule prescribed for the purpose at any dwelling house\n1\n[(including any commercial, industrial or other premises which are also used for the purpose\nof residence)] or with the manager or any officer of any commercial or industrial\nestablishment or trading concern, for the purpose of its being filled up by the occupier of such\nhouse or of any specified part thereof, or by such manager or officer with respect to such\nparticulars regarding the inmates of such house or part or the persons employed under such\nmanager or officer during the time of the taking of the census, as may be specified in the\nSchedule.\n(2) When a Schedule has been left under sub-section (1), the occupier, manager or\nofficer concerned shall fill it up or cause it to be filled up as required by that sub-section to\nthe best of his knowledge or belief, sign his name thereto and deliver it to the Census Officer\nor to such person as the Census Officer may direct."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Census record not open to inspection",
      "content": "_2[(1)] No person shall have a right to\ninspect any book, register or record made by a Census Officer in the discharge of his duties as\nsuch, and notwithstanding anything to the contrary in the 3[Qanun-e-Shahadet, 1984 (P.O.X\nof 1984), no entry in any such book, register or record shall be admissible as evidence in any\ncivil proceeding whatsoever, or in any criminal proceedings other than a prosecution under\nthis Ordinance or under any other law for any act or omission under this Ordinance which\nconstitutes an offence under such other law.\n1\nIns. by the Census (Amdt.) Ordinance, 1979 (58 of 1979), s. 2.\n2\nRe-numbered by the Census (Amdt.) Act, 1991 (6 of 1991), s, 7.\n3\nSubs. ibid., for “Evidence Act 1872”.\n1\n[(2) The individual information furnished in the Census returns, except so much of it\nas is not traceable to an individual, shall be confidential and shall not be used for any purpose\nother than compilation of Statistics]."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. 2[Local Councils] and other local authorities to take census. Notwithstanding",
      "content": "anything contained in any other law for the time being in force, a 3[local council] or other\nlocal authority shall, in consultation with the 4[Provincial Census Commissioner] or other\nofficer authorized in this behalf by the 5[Federal Government], cause, during the period\nspecified under section 3, the census of the 6[area within the jurisdiction of a local council or\nother local authority] to be taken wholly or in part in the manner authorized or required by or\nunder this Ordinance."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Grant of statistical abstracts. The 7[Chief Census Commissioner, the Provincial",
      "content": "5\nCensus Commissioner] or any authority authorized in this behalf by the                           [Federal\n8\nGovernment] may, at the request of any [local council or local authority] or person, cause\nabstracts to be prepared and supplied containing such statistical information as can be derived\nfrom the census returns being information which is not contained in any published reports\nand which, in the opinion of such Commissioner, 9* or authority, such 8[local council or local\nauthority] or person may reasonably require."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Penalties. If any person",
      "content": "_\n1\nAdded by the Census (Amdt.) Act, 1991 (6 of 1991), s. 7.\n2\nSubs. ibid., s., 8 for “Municiplities”.\n3\nSubs. ibid., for “Municipality”.\n4\nSubs. ibid., for “Director of Census”.\n5\nSubs. by F.A.O., 1975 For Art. 2 and Table for “Central Government”.\n6\nSubs. by Act 6 of 1991, s. 8, for certain words.\n7\nSubs. ibid., s. 9, for Certain words.\n8\nSubs. ibid., for “local Authority”.\n9\nOmitted ibid.\n(a)          being a Census Officer, or being lawfully required to give assistance towards the\ntaking of census, refuses or neglects to use reasonable diligence in performing any\nduty imposed upon him or in obeying any order issued to him in accordance with\nthis Ordinance or any rule made there under, or hinders on obstructs another\nperson in performing any such duty or in obeying any such order, or\n(b)          being a Census Officer intentionally puts any offensive or improper question or\nknowingly makes my false return or, without the previous sanction of the\n1\n[Federal Government] discloses any information which he has received by means\nof or for the purpose of, a census return 2[or fails to deliver or forward to the\nproper authority, or retains copies or extracts from, the Census returns or any\ndocuments relating to the Census], or\n(c)          intentionally gives a false answer to, or refuses to answer to the best of his\nknowledge or belief, the questionnaire or other relevant question asked of him by\na Census Officer which he is legally bound to answer, or\n(d)          occupying any house, premises, vessel or land, refuses to allow a Census Officer\nsuch reasonable access thereto as he is required under this Ordinance to allow, or\n(e)          removes, obliterates, alters or damages without proper authority or before the\ncompletion of the census any letters, marks or objects which has been painted or\naffixed for the purposes of the census, 3[or]\n4\n[(f)     attempts to have a false return made by a Census Officer,]\nhe shall be punishable with 5[ 6* imprisonment for a term which may extend to 7[six months] or\nwith fine which may extend to 7[fifteen thousand rupees, or with both]\n1\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n2\nIns. by the Census (Amdt.) Ordinance 1979, (58 of 1979), s. 3.\n3\nSubs. ibid., for “full stop”.\n4\nAdded by the Census (Amdt.) Ordinance, 1979 (58 of 1979), s. 3.\n5\nSubs. by the Census (Amdt.) Ordinance, 1970 (16 of 1970), s. 2.\n6\nThe word “rigorous” omitted by the Census (Amdt.) Act, 1991 (6 of 1991), s. 10.\n7\nSubs. by Act 41 of 1997, s. 2."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Sanction for prosecution under this Ordinance. No prosecution under this",
      "content": "Ordinance shall be instituted except with the previous sanction of the 1[Federal Government]\nor of any authority authorized in this behalf by the 1[Federal Government]."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Prosecution under other laws. Nothing in this ordinance shall be deemed to",
      "content": "prevent any person from being prosecuted under any other law for any act or omission under\nthis Ordinance which constitutes an offence under such other law:\nProvided that no such prosecution shall be instituted except with the previous sanction\nreferred to in section 14."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Census Officers and persons assisting them to be public servants. All Census",
      "content": "Officers, and all persons performing the duties of a Census Officer or giving assistance\ntowards the taking of the census, while acting in pursuance of an order made under this\nOrdinance, shall be deemed to be public servants within the meaning of section 21 of the\nPakistan Panel Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Delegation of Power. The 1[Federal Government] may, by notification in the",
      "content": "official Gazette direct that all or any of the powers conferred upon it by or under this\nOrdinance shall subject to such conditions, if any, as may be specified in the notification be\nexercisable also by the Provincial Government."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. [Repeal.] Omitted by the Federal Laws (Revision and Declaration) Ordinance,",
      "content": "1981 (27 of 1981), s. 3 and II Sch.\n_______\n1\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”."
    }
  ],
  "definitions": []
}
