{
  "id": "pk-torture-and-custodial-death-prevention-and-punishment-act-2022",
  "type": "statute",
  "title": "Torture and Custodial Death (Prevention and Punishment) Act, 2022",
  "title_en": "Torture and Custodial Death (Prevention and Punishment) Act, 2022",
  "short_name": "TACDA",
  "status": "in_force",
  "issued_date": "2022-11-02",
  "in_force_date": "2022-11-02",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5lqaQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Torture and Custodial Death (Prevention and Punishment) Act, 2022 (XXVIII of 2022) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Torture and\nCustodial Death (Prevention and Punishment) Act, 2022."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the subject or context,\n(a)     “Agency” means The Federal Investigation Agency constituted under the Federal\nInvestigation Act, 1974 (VIII of 1975);\n(b)     “Code” means the Code of Criminal Procedure, 1898 (Act V of 1898);\n(c)     “complaint” means allegations made orally or in writing to the Agency that a public\nofficial or a person working in an official capacity has committed an offence under this\nAct;\n(d)     “complainant” means any person filing a complaint, upon having reliable information\nof the commission of an offence under this Act, or his representative as the case may\nbe;\n(e)     “concerned division” means the Ministry or department to which the business of the\nAct stands allocated;\n(f)     “custody” includes all situations where a person is detained or deprived of his liberty\nby any person, including a public official or by any other person working in an official\ncapacity irrespective of legality nature and any place of such detention.\nExplanation-I.— It includes judicial custody and all forms of temporary and\npermanent restraint upon the movement of a person by law or by force or by other\nmeans; and\nExplanation-II.— A person shall be deemed to be in custody during search, arrest and\nseizure proceedings;\n(g)   “cruel” or “inhuman” or “degrading treatment” means and includes any deliberate or\naggravated treatment inflicted by a public official or a person acting on his behalf\nagainst a person under their custody, causing suffering, gross humiliation or\ndegradation of the person in custody;\n(h)   “custodial death” means the death of a person while in custody, directly or indirectly\ncaused by and attributable to acts of torture committed upon the deceased while in\ncustody;\nExplanation-I.__ Custodial death includes death occurring in police, private or medical\npremises, in a public place or in a police or other vehicle or in jail. It includes death\noccurring while a person is being arrested or taken into detention or being questioned;\nand\nExplanation-II__ Custodial death also includes all cases where the death of a person\nafter his release from custody is directly caused by and may be substantially attributed\nto acts committed upon the deceased while in custody;\n(i)   “custodial rape” means and includes any person taking advantage of his position and\ncommitting rape or sexual abuse on a person in his custody or in custody of a public\nofficial subordinate to him;\n(j)   “Government” means the Federal Government or the Provincial Government, as the\ncase may be;\n(k)   “malafide complaint” means a complaint filed against any person, including a public\nofficial with malafide intentions or other ulterior motives or to harass such person or\npublic official;\n(l)   “person” shall have the same meaning as assigned thereto in section 11 of the Pakistan\nPenal Code, 1860 (Act XLV of 1860);\n(m)   “public official” for the purpose of this Act means every person who holds any office\nby virtue of which he is empowered to place or keep any person in confinement, every\nofficer of the Government whose duty it is, as such officer, to prevent offences, to\ninvestigate, and to give information of offences.\nExplanation.— Wherever the words “Public official” occur, they shall be understood\nas every person who is in actual possession of a public office, whatever legal defect\nthere may be in that person’s right to hold that position;\n(n)   “torture” means an act committed by which severe physical pain or physical suffering,\nis intentionally inflicted on a person for such purposes as obtaining from him or a third\nperson information or a confession, punishing him for an act he or a third person has\ncommitted or is suspected of having committed, or intimidating or coercing him or a\nthird person, or for any reason based on discrimination of any kind, when such pain or\nsuffering is inflicted by or at the instigation of or with the consent or acquiescence of a\npublic official or other person acting in an official capacity. It does not include pain or\nsuffering arising only from, inherent in or incidental to lawful sanctions; and\n(o)     “victim” or “aggrieved person” means any person who alleges that an offence under\nthis Act has been committed against him.\n(2) All the words and phrases used but not defined in this Act shall have the same meaning as\ndefined in the Pakistan Penal Code, 1860 (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Inadmissibility of statement extracted through torture",
      "content": "(1) Any statement, information\nor confession obtained by a public official as a result of torture or cruel, inhuman or degrading\ntreatment shall be inadmissible evidence in any proceedings against the person making it.\n(2) A public official who knowingly uses such information under sub-section (1) shall be liable\nfor imprisonment which may not exceed one year or with fine which may not exceed hundred thousand\nrupees of both.\n(3) Notwithstanding anything contained in sub-sections (l) and (2), any information or\nconfession obtained as a result of torture or cruel, inhuman or degrading treatment shall be admitted\nas evidence against a person accused of committing the offence of torture. These provision shall be in\naddition to the provisions of section 37 and 38 of the Qanoon-e-Shahdat, Order 1984 (P.O. No. X of\n1984)."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Custody of females",
      "content": "(1) No female shall be detained in order to extract information\nregarding the whereabouts of a person accused of any offence or to extract evidence from such\nfemale.\n(2) No female shall be taken or held in custody by a male except by a female public official\nlawfully authorized to do so."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Investigation of offences",
      "content": "(1) Notwithstanding anything contained in any other law for\nthe time being in force, the Agency shall have the exclusive jurisdiction to investigate the complaints\nagainst any public officials who have committed offence under this Act:\nProvided that the Agency shall investigate the complaints under the supervision of National\nCommission for Human Rights.\n(2) If at any time, including during the grant of physical remand under the Code, the Magistrate\nhas reasonable grounds to be1ieve that the offence under this Act is committed or a complaint of torture\nis lodged by the person in custody, he shall order a medical examination and if the results of such\nexamination reveal infliction of torture, he shall notify the Agency to investigate such offence.\n(3) The Agency, while investigating the offences under this Act, shall have the same powers\nand shall fol1ow the same procedure as prescribed in the Federal Investigation Agency Act, 1974 (Act\nVIII of 1975) and the rules made thereunder."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Trial of offences",
      "content": "(1) Notwithstanding anything contained in any other law for the time\nbeing in force, the Court of Sessions shall have exclusive jurisdiction to try offences under this Act.\n(2) No adjournment shall be granted during the trial save for the interest of justice, provided\nthat if such an adjournment is granted it shall be not more than thirty days."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Intimation to the concerned Government and transfer of suspension of public official",
      "content": "(1) The Agency, while investigating a public official who is accused of an offence under this Act, shall\nwithin twenty-four hours of arrest, inform the competent authority to which the public official is\naccountable, of the nature of the proceedings against him.\n(2) Notwithstanding anything contained in any other law for the time being in force, a public\nofficial when accused of an offence under this Act shall forthwith be suspended or transferred to a\ndifferent location from the location in which the alleged offence was committed, after completion of a\ndepartmental enquiry within 7 days, giving a finding that there is prima facie evidence of commission\nof offence under this Act by the public official.\n(3) Notwithstanding anything contained in any other law for the time being in force, a public\nofficial when convicted of an offence under this Act shall not perform any public duty unless acquitted\nby the appellate court.\nExplanation-I.—In this section, the “competent authority” shall mean the appointing authority\nas prescribed in the service rules of the relevant Government.\nExplanation-II.—It is clarified that this section, except sub-section (3), shall only apply when\na court of law finds a strong prima facie evidence against a public official with regard to the\ncommission of an offence under this Act."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Punishment for torture",
      "content": "Any public official who commits or abets or conspires to\ncommit torture shall be punished with the same punishment as prescribed for the type of harm provided\nin Chapter XVI of the Pakistan Penal Code.\nExplanation. — The offence under this section shall be cognizable, non-compoundable and\nnon-bailable within the meaning of the Code."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Punishment for custodial death",
      "content": "Whoever commits or abets or conspires to commit the\noffence of custodial death, shall be punished with the same punishment as prescribed in section 302 of\nthe Pakistan Penal Code.\nExplanation. — The offence under this section shall be cognizable, compoundable and non-\nbailable within the meaning of the Code."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Punishment for custodial rape",
      "content": "Whoever commits or abets the offence of custodial\nrape, shall be dealt with and punished under the law and procedure for rape, and the provisions of this\nAct shall also be applicable to the accused, mutatis mutandis.\nExplanation.__ The offences under this section shall be cognizable, compoundable and non-\nbailable within the meaning of the Code."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Punishment for filing malafide complaints",
      "content": "Whoever files a malafide complaint shall,\nafter it is established that the complaint was malafide, be punished with the same punishment as is\nprescribed under section 8 for the perpetrators under this Act."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Appeals",
      "content": "(1) An appeal against a conviction or acquittal of an offence under this Act\nshall be presented before the respective High Court within thirty days from the date on which copy of\nthe order passed by the Court of Sessions is supplied to the appellant.\n(2) An appeal against conviction shall not be admitted unless part of the amount, imposed in\nthe form of fine as directed by the appellate court, is deposited in the court."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Time limit for investigation, trial and appeal",
      "content": "(1) The investigation of the offences\nunder this Act shall be completed within thirty days from the date of submission of the complaint.\n(2) If the investigation of an offence under this Act is not completed within thirty days, the\nAgency shall call for a report for explaining the delay in completion of the investigation and if satisfied\nwith the causes of delay, may grant maximum five days for completion of the investigation or if the\nAgency is not satisfied with the causes of delay, may transfer the investigation to another investigating\nofficer who shall take up and complete the investigation from the same stage where it was left by his\npredecessor.\n(3) If investigation of an offence is not completed with thirty days, the Agency shall also file\nan interim report before the Court of Session and the court may decide to initiate the trial on the basis\nof such information.\n(4) The trial of offences under this Act shall be completed within three weeks from the date of\nsubmission of challan before the relevant court.\n(5) The appeal against the offences under this Act shall be decided within thirty days from the\ndate of filing of such appeal."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Special protection",
      "content": "(1) Any person, including the victim or complainant or any\nwitnesses, who allege that he requires protection from a person accused of having committed an\noffence under this Act or from any of his associates, shall file a petition to the Court of Session in this\nregard.\n(2) The court receiving the petition, after giving notice to the concerned parties, shall hear the\nmatter and pass an order on the petition within three days.\n(3) The court while disposing of such a petition as mentioned in sub- section (1) shall make\nsuch orders as deemed necessary and appropriate according to the facts and circumstances of the case."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Act not to prejudice civil remedies",
      "content": "Nothing in this Act shall prejudice the civil\nremedies available to the victim by virtue of any other law for the time being in force."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Overriding effect",
      "content": "The provisions of this Act shall have effect notwithstanding anything\ncontained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Provisions of the Code to apply",
      "content": "The provisions of the Code shall apply to the\nproceedings under this Act."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Duties of the Government",
      "content": "The Government shall take all measures to ensure that the\nprovisions of this Act are given wide publicity through media at regular intervals and;\nthe relevant public officials are given periodic sensitization and awareness training on the\nissues addressed in this Act."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Removal of difficulties",
      "content": "If any difficulty arises in the implementation of the provisions\nof this Act, the concerned division may make such orders, not inconsistent with the provisions of this\nAct, as may appear to it to be appropriate for removing such difficulty:\nProvided that no such order shall be made after the expiry of a period of two years after the\nenactment of this Act."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Power to make rules",
      "content": "The concerned division may, by notification in the official\nGazette, make rules for the purpose of carrying out the objects and purposes of this Act.\n____________\nRGN Date: 04-11-2025"
    }
  ],
  "definitions": [
    {
      "term": "Agency",
      "definition": "The Federal Investigation Agency constituted under the Federal Investigation Act, 1974 (VIII of 1975);",
      "source_provision": "sec2"
    },
    {
      "term": "Code",
      "definition": "the Code of Criminal Procedure, 1898 (Act V of 1898);",
      "source_provision": "sec2"
    },
    {
      "term": "complaint",
      "definition": "allegations made orally or in writing to the Agency that a public official or a person working in an official capacity has committed an offence under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "complainant",
      "definition": "any person filing a complaint, upon having reliable information of the commission of an offence under this Act, or his representative as the case may be;",
      "source_provision": "sec2"
    },
    {
      "term": "concerned division",
      "definition": "the Ministry or department to which the business of the Act stands allocated;",
      "source_provision": "sec2"
    },
    {
      "term": "custody",
      "definition": "all situations where a person is detained or deprived of his liberty by any person, including a public official or by any other person working in an official capacity irrespective of legality nature and any place of such detention. Explanation-I.— It includes judicial custody and all forms of temporary and permanent restraint upon the movement of a person by law or by force or by other means; and Explanation-II.— A person shall be deemed to be in custody during search, arrest and seizure proceedings;",
      "source_provision": "sec2"
    },
    {
      "term": "custodial death",
      "definition": "the death of a person while in custody, directly or indirectly caused by and attributable to acts of torture committed upon the deceased while in custody; Explanation-I.__ Custodial death includes death occurring in police, private or medical premises, in a public place or in a police or other vehicle or in jail. It includes death occurring while a person is being arrested or taken into detention or being questioned; and Explanation-II__ Custodial death also includes all cases where the death of a person after his release from custody is directly caused by and may be substantially attributed to acts committed upon the deceased while in custody;",
      "source_provision": "sec2"
    },
    {
      "term": "custodial rape",
      "definition": "and includes any person taking advantage of his position and committing rape or sexual abuse on a person in his custody or in custody of a public official subordinate to him;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government or the Provincial Government, as the case may be;",
      "source_provision": "sec2"
    },
    {
      "term": "malafide complaint",
      "definition": "a complaint filed against any person, including a public official with malafide intentions or other ulterior motives or to harass such person or public official;",
      "source_provision": "sec2"
    },
    {
      "term": "torture",
      "definition": "an act committed by which severe physical pain or physical suffering, is intentionally inflicted on a person for such purposes as obtaining from him or a third person information or a confession, punishing him for an act he or a third person has committed or is suspected of having committed, or intimidating or coercing him or a third person, or for any reason based on discrimination of any kind, when such pain or suffering is inflicted by or at the instigation of or with the consent or acquiescence of a public official or other person acting in an official capacity. It does not include pain or suffering arising only from, inherent in or incidental to lawful sanctions; and",
      "source_provision": "sec2"
    }
  ]
}
