{
  "id": "pk-toshakhana-management-and-regulation-act-2024",
  "type": "statute",
  "title": "Toshakhana (Management and Regulation) Act, 2024",
  "title_en": "Toshakhana (Management and Regulation) Act, 2024",
  "short_name": "TARA",
  "status": "in_force",
  "issued_date": "2024-04-13",
  "in_force_date": "2024-04-13",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5ppag%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Toshakhana (Management and Regulation) Act, 2024 (III of 2024) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, application, and commencement.(1)This Act shall be called the",
      "content": "Toshakhana (Management and Regulation) Act, 2024.\n(2) It extends to the whole of Pakistan.\n(3) It shall apply to public office holders and private individuals as private members of an\nofficial delegation.\n(4) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(a)     “gift includes non-perishable items received by public office holder or private\nmember of an official delegation from a local or foreign dignitary or company\nother than the gift of cash given to employees in BPS-1 to BPS-4 as tips;\n(b)     “Government” means the Federal Government;\n(c)     “Toshakhana” means repository of gifts maintained by the division to which\nbusiness of this Act stands allocated;\n(d)     “public office holder” means a person, his spouse or children who—\n(i)       is President of Pakistan or the Governor of a Province;\n(ii)      is the Prime Minister, Chairman Senate, Speaker of the National\nAssembly, Deputy Chairman Senate, Deputy Speaker National\nAssembly, Federal Minister, Minister of State, Attorney General,\nAdvocate General and such other law officers appointed under the\nCentral Law Officers Ordinance, 1970 (VII of 1970), Federal\nProsecutor General and Such other law officers, Adviser to the Prime\nMinister,     Special Assistant to the Prime Minister, Federal\nParliamentary Secretary, Member of Parliament, Auditor General\nPolitical Secretary, and a person who holds a post or office with the\nrank or status of a Federal Minister or Minister of State;\n(iii)     is the Chief Minister, Speaker Provincial Assembly, Deputy Speaker\nProvincial Assembly; Provincial Minister, Adviser to the Chief\nMinister, Special Assistant to the Chief Minister, Provincial\nParliamentary Secretary, Member of Provincial Assembly, Advocate\nGeneral, Provincial Prosecutor General or such other law officers,\nPolitical Secretary and a person who holds a post or office with the\nrank or status of a Provincial Minister;\niv)    any person, who draws any or some benefits from public exchequer in\nany scale or grade or in any office or position and shall include all,\nwhether elected, nominated, selected or under any contractual\nobligations where public exchequer is wholly or partially involved. It\nshall include any person who holds office in any service of Pakistan\norrenders any service in connection with the affairs of the Federal,\nProvincial, or the      local Governments or in the management of\ncorporations, banks, or any financial institution, firms or any other\ninstitutions or organizations established, controlled or administered by\nthe Federal or Provincial Governments, as the case may be. It includes\nmembers of the armed forces of Pakistan and in the judiciary;\n(e)     “prescribed” means prescribed by rules; and\n(f)     “rules” means rules made under this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Acceptance of gift and its deposit in Toshakhana.Gift received by public office holder",
      "content": "or private person as part of official delegation shall be deposited in the Toshakhana of Government\nof Pakistan in thirty days or within such time limit and manner as may be prescribed."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Management and regulation of Toshakhana",
      "content": "(1) The division to which business of this\nAct stands allocated shall be responsible for management and regulation of Toshakhana and to take\nmeasures in the prescribed manner.\n(2) Notwithstanding anything contained in any other law for the time being in force, the\ninformation in respect of Toshakhana shall be open to inspection subject to such conditions,\nlimitations and restrictions as may be prescribed."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Offence.Whoever contravenes or attempts to contravene or abets in contravention of",
      "content": "section-3 or any rules made thereunder shall be punishable with fine equal to five times the assessed\nmarket value of the gift. In case of Government servant, he will be liable to the departmental\nproceedings also as per the respective laws/ rules."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to make rules.The Federal Government shall, by notification in the official",
      "content": "Gazette, make rules for carrying out purposes of this Act."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Utilization of funds from disposal of Gifts",
      "content": "(1) The existing and future gifts to be\nreceived in Toshakhana shall be disposed of through open auction.\n(2) The proceeds of such auction shall be kept in a separate account and will be utilized for\npromoting female primary education in the most backward areas of the country.\n___________\nRGN Date: 26-06-2024"
    }
  ],
  "definitions": [
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "Toshakhana",
      "definition": "repository of gifts maintained by the division to which business of this Act stands allocated;",
      "source_provision": "sec2"
    },
    {
      "term": "public office holder",
      "definition": "a person, his spouse or children who— (i) is President of Pakistan or the Governor of a Province; (ii) is the Prime Minister, Chairman Senate, Speaker of the National Assembly, Deputy Chairman Senate, Deputy Speaker National Assembly, Federal Minister, Minister of State, Attorney General, Advocate General and such other law officers appointed under the Central Law Officers Ordinance, 1970 (VII of 1970), Federal Prosecutor General and Such other law officers, Adviser to the Prime Minister, Special Assistant to the Prime Minister, Federal Parliamentary Secretary, Member of Parliament, Auditor General Political Secretary, and a person who holds a post or office with the rank or status of a Federal Minister or Minister of State; (iii) is the Chief Minister, Speaker Provincial Assembly, Deputy Speaker Provincial Assembly; Provincial Minister, Adviser to the Chief Minister, Special Assistant to the Chief Minister, Provincial Parliamentary Secretary, Member of Provincial Assembly, Advocate General, Provincial Prosecutor General or such other law officers, Political Secretary and a person who holds a post or office with the rank or status of a Provincial Minister; iv) any person, who draws any or some benefits from public exchequer in any scale or grade or in any office or position and shall include all, whether elected, nominated, selected or under any contractual obligations where public exchequer is wholly or partially involved. It shall include any person who holds office in any service of Pakistan orrenders any service in connection with the affairs of the Federal, Provincial, or the local Governments or in the management of corporations, banks, or any financial institution, firms or any other institutions or organizations established, controlled or administered by the Federal or Provincial Governments, as the case may be. It includes members of the armed forces of Pakistan and in the judiciary;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules; and",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Act.",
      "source_provision": "sec2"
    }
  ]
}
