{
  "id": "pk-trade-organizations-act-2013",
  "type": "statute",
  "title": "Trade Organizations Act, 2013",
  "title_en": "Trade Organizations Act, 2013",
  "short_name": "TOA",
  "status": "in_force",
  "issued_date": "2013-02-21",
  "in_force_date": "2013-02-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FqbZ8%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Trade Organizations Act, 2013 (II of 2013) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, application and commencement.⸻ (1) This Act may be called the",
      "content": "Trade Organizations Act, 2013.\n(2) It extends to the whole of Pakistan.\n(3) It shall apply to trade organizations whose objects and business are not confined to one\nprovince.\n(4) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.⸻In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(a)     “Administrator” means an Administrator appointed under this Act;\n(b)     “articles” mean the articles of association of a trade organisation;\n(c)     “district” means an administrative district notified by the Provincial\nGovernments from time to time;\n(d)     “division” means an administrative division notified by the Provincial\nGovernment from time to time;\n(e)     “Executive Committee” means the Board of Directors, the Managing\nCommittee or any other body, by whatever name called, of a registered trade\norganisation responsible for the management or conduct of the affairs of such\ntrade organisation;\n(f)     “existing trade organisation” means an organisation licensed under the Trade\nOrganisations Ordinance, 1961(XLV of 1961);\n(g)            “licence” means a licence granted to a trade organisation under section 3;\n(h)        “member of the Executive Committee” includes a Director where the Executive\nCommittee is a Board of Directors and the Chairman, Senior Vice Chairman,\nVice Chairman, President, Senior Vice-President and Vice President of a trade\norganisation licensed under this Act;\n(i)        “member of a trade organisation” means a firm and includes a proprietorship,\nan association of persons, a partnership, a company or a multinational\ncorporation, engaged in trade, industry or services and enrolled as a member of\na trade organisation licensed under this Act;\n(j)        “memorandum” means the memorandum and the articles of association of a\ntrade organisation;\n(k)        “office bearers” means President, Senior Vice President, Vice-President,\nChairman, Senior Vice-Chairman and Vice Chairman of a trade organization;\n(l)        “Ordinance” means the Companies Ordinance, 1984 (XLVII of 1984);\n(m)        “prescribed” means prescribed by rules made under this Act;\n(n)        “register” means the Register of Companies required to be kept under section\n147 of the Ordinance;.\n(o)        “registered trade organisation” means a trade organisation registered under the\nOrdinance;\n1\n[(p)   “Regulator” means the Director General or any other officer not below basic\npay scale 20 appointed by the division concerned to perform functions under\nthis Act;]\n(q)        “repealed ordinance” means the Trade Organizations Ordinance 1961 (XLV of\n1961);\n(r)        “trade organisation” means an organization, which—\n(i)       is capable of being formed as a limited company within meaning of the\nOrdinance;\n(ii)      is formed or intended to be formed with the object of promoting any\ntrade, industry or service or any combination thereof;\n(iii)     prohibits payment of any profits to its members; and\n(iv)       applies its income and profits for achieving its objects;\n(s)        “small traders and small business” means a member of trade organization\n1\nSubs. by Act No. IV of 2025, s.2.\nwhose number of employees is less than twenty, annual business turnover\nranges between two million rupees to twenty million rupees, all utility bills do\nnot exceed one million rupees per annum and neither such small trader or small\nbusiness is owned or controlled by a Provincial Government nor it carries on\ntrade or business confined to only one Province; and\n(t)        “small industry” means a member of trade organization which is a\nmanufacturing concern having an industry less than twenty employees, whose\nannual turnover ranges between two million rupees to twenty million rupees,\nutility bills do not exceed one million rupees per annum and is neither owned or\ncontrolled by a Provincial Government nor carries on trade or business confined\nto only one Province."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Licensing and registration of trade organisations.⸻ (1) Notwithstanding anything",
      "content": "contained in the Ordinance or in any other law for the time being in force relating to registration of\nsocieties, bodies or associations of persons, no trade organisation shall be registered under the\nOrdinance or such other law unless it holds a licence granted by the 1[Regulator] authorizing it to be\nso registered.\n(2) No licence shall be granted for registration under the Ordinance to a trade organisation\nunless it is ⸻\n(a)        a Federation of Chambers of Commerce and Industry, organized on all Pakistan\nbasis, to represent Chambers and Associations referred to in clauses (b), (c), (d)\nand (f):\nProvided that a licence for registration as a Federation of Chambers of\nCommerce and Industry shall not be granted to more than one trade\norganisation;\n(b)        a Chamber of Commerce and Industry organized to represent trade, industry and\nservices in a district. Such a Chamber representing less than the prescribed\nnumber of persons shall not be granted licence. Where the number of persons\ndesiring to form a Chamber is less than the prescribed number of persons, they\nmay join a licensed Chamber of the adjoining district:\nProvided that the 1[division to which business of this Act stands\nallocated] may, by notification in official Gazette, combine one or more districts\nfor the purpose of grant of only one licence. In such a case the 1[division to\nwhich business of this Act stands allocated] may allow the districts so combined\nto form a Town Association under clause (e);\n(c)        a Women’s Chamber of Commerce and Industry organized to represent the\nwomen entrepreneurs engaged in trade, industry or services in each\nadministrative division but such a Chamber representing less than the prescribed\nnumber of women entrepreneurs shall not be granted licence and where the\nnumber of women entrepreneurs desiring to form a Chamber is less than the\n1\nSubs. by Act No. IV of 2025, s.3.\nprescribed number, they may join an adjoining Women’s Chamber of\nCommerce and industry:\nProvided that nothing contained in this clause shall debar a woman\nentrepreneur to become member of a Chamber in clause (b) if such woman\nentrepreneur otherwise fulfills the criteria of membership of the respective\nchamber:\nProvided further that nothing contained in this clause shall debar the\nrequired number of women entrepreneurs to form district Women Chambers of\nCommerce if they otherwise fulfill the criteria of formation of a district\nchamber.\n(d)        an association with membership on all Pakistan basis organized to represent a\nspecific trade, industry or service or any combination thereof:\nProvided that a licence for registration as an all Pakistan association\nshall not be granted to more than two trade organisations in the same sector, one\nof which must be an organization representing small business, small traders or\nsmall industry:\nProvided further that the question. whether a specific activity in trade,\nindustry or service is an independent sector or only a sub-sector, shall be\ndetermined by the Government, whose decision in this respect shall be final;\n(e)        a Town Association, organized to represent trade, industry and services in a\ntown, tehsil, taluka or a district where there is no chamber and such Town\nAssociation shall be affiliated with the Chamber of the concerned district:\nProvided that when a town, tehsil or taluka is upgraded as a district or is\ngranted licence under clause (b), the Town Association in that town, tehsil,\ntaluka or district shall cease to exist with immediate effect; and\n(f)        a Chamber of Small Traders organized to represent small businesses, small\ntraders and small industry, in each district, provided that they otherwise qualify\nto form a chamber under this Act.\n(3) Notwithstanding the provisions of clause (b) and (d) of sub-section (2), where the\nmembership of a chamber in a district attains the minimum prescribed number for grant of licence to\na chamber under this Act, such persons shall be entitled to form and apply for grant of licence as a\nchamber.\n(4) On grant of licence to a Chamber under sub-section (3), the firms and companies, which\nhad obtained membership in the Chamber of an adjoining district, shall be deemed to have been de-\nregistered from membership register of the adjoining Chamber.\n(5) Application for grant of licence of a trade organisation shall be made to the 1[Regulator] in\nthe prescribed application form.\n1\nSubs. by Act No. IV of 2025, s.3.\n(6) A trade organisation shall be granted licence on such terms and subject to such conditions\nas may be prescribed.\n(7) Licence shall be granted to a trade organisation for a period of five years.\n(8) A trade organisation holding a licence shall be registered under the Ordinance as a company\nwith limited liability without the addition of the word “limited” to its name and on such registration\nshall enjoy all the privileges of a limited company and be subject to all its obligations except those\nof—\n(a)     using the word “limited” as any part of its name;\n(b)        publishing its name; and\n(c)        sending lists of members to the registrar.\n(9) The Federal Government may, by notification in the official Gazette, grant exemption to\nany trade organisation from any provision of this Act and such exemption may be for such period and\nsubject to such conditions as may be specified in the notification:\nProvided that no such exemption shall be granted to a trade organisation unless the\nFederal Government is satisfied that it would be in the public interest to do so."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Revocation of licences of existing trade organisations.⸻ (1) Except as hereinafter",
      "content": "provided and notwithstanding anything in any other law for the time being in force and memorandum\nand articles of association of any trade organisation, any licence granted under section 3 of the repealed\nordinance to an existing trade organisation shall stand revoked with effect from the 30th December,\n2006 and such trade organisation shall be required to apply for grant of licence under this Act by the\ndate notified by the Federal Government:\nProvided that revocation of licence of a trade organisation shall not prevent its members\nfrom assuming office, subject to section 11, consequent upon elections under the repealed ordinance.\n(2) The 1[Regulator] shall decide the application for grant of licence within such period of its\nfiling as notified by the 1[Regulator].\n(3) An existing trade organisation which has applied for grant of licence within the time notified\nby the [Regulator] shall continue to function as a trade organisation until the 1[Regulator] decides its\n1\napplication for grant of licence and until the first elections are held according to rules made under this\nAct."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Privileges and obligations of trade organisations. ⸻(1) A licensed and registered trade",
      "content": "organisation shall be a body corporate with perpetual succession and a common seal and may sue and\nbe sued in its own name and, subject to and for the purposes of this Act, may enter into contracts and\nmay acquire, purchase, take, hold and enjoy movable and immovable property of every description\nand may convey, assign, surrender, yield up, charge, mortgage, demise, re-assign, transfer or otherwise\ndispose of or deal with, any movable or immovable property or any interest vested in it, upon such\nterms as it deems fit.\n1\nSubs. by Act No. IV of 2025, s.4.\n(2) The liability of members of a licensed and registered trade organisation shall be limited to\ntheir membership subscription.\n(3) No trade organisation other than a licensed and registered trade organisation shall use in its\nname or title the word “Federation” or “Chamber” or “Association” except an existing trade\norganisation which has applied for grant of licence under this Act:\nProvided that nothing in sub-section (3) shall apply to a company, association or body\nof persons formed for promoting art, science, religion, charity, sports, any profession other than trade,\ncommerce, industry, service or any other subject which the Government may, by notification in the\nofficial Gazette specify in this behalf."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Renewal of licence. ⸻(1) A licensed trade organisation shall require renewal of its licence",
      "content": "every five years.\n(2) Application for renewal of licence shall be made to the Regulator ninety days prior to the\nexpiry of licence:\nProvided that the Regulator, on sufficient cause being shown by an order in writing,\nmay extend the period not exceeding thirty days.\n(3) Annual accounts and performance of a trade organisation shall be audited by a firm of\nchartered accountants and the reports thereof shall be submitted to the Regulator alongwith the renewal\napplication.\n(4) The Regulator, on receipt of the application for renewal of licence, shall endeavour to\ndecide it before the expiry of the licence."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Cancellation of licence and exemption.⸻ (1) The licence granted to a trade organisation",
      "content": "shall be cancelled by the 1[Regulator], where—\n(a)        a trade organisation fails to apply for renewal of the licence granted under\nsection 3 of this Act within the prescribed or extended period allowed by the\nRegulator;\n(b)        a trade organisation fails to apply for membership of the Federation of Pakistan\nChambers of Commerce and Industry within one month of grant of licence;\n(c)        a trade organisation fails to get registration under the Ordinance;\n(d)        a trade organisation is found to be non-existent at the registered address or is\nnon­operational;\n(e)        a trade organisation is not holding elections or operating according to the\nprovisions of the memorandum within the prescribed period;\n(f)        a trade organisation is not complying with the orders and directions of the\nFederal Government or Regulator issued under this Act of the prescribed rules;\n1\nSubs. by Act No. IV of 2025, s.5.\n(g)        a trade organisation is not discharging statutory obligations as a limited\ncompany incurred under the Ordinance;\n(h)        a trade organisation is not discharging statutory obligations under this Act or\nprescribed rules;\n(i)        a trade organisation fails to pay the penalties imposed under this Act within the\nprescribed period;\n(j)        the Federal Government cancels any exemption granted to a trade organisation,\nunder sub­section (9) of section 3;\n(k)        the trade organisation is engaged in activities other than those for which it was\nestablished;\n(l)        the trade organisation has lost its representative character or its membership\nremains below the prescribed threshold over a period of two years; and\n(m)            the financial or performance audit report of a trade organisation states that—\n(i)       the income and profits of the trade organisation are spent for purposes\nother than those for which it was established;\n(ii)      the trade organisation does not remain financially viable.\n(2) Where the 1[Regulator] intends to cancel the licence of a trade organisation, granted under\nsection 3 of this Act, it shall issue a show cause notice to such trade organisation specifying the grounds\nfor its intention to cancel the licence and provide adequate opportunity of being heard before deciding\nthe matter.\n(3) The 1[Regulator] shall notify, in the official Gazette, cancellation of licence of a trade\norganisation.\n(4) Where the licence is cancelled on any ground mentioned in clause (d), (e), (f), (g), (h), (i),\n(k), (l) and (m) of sub-section (1) members of the trade organisation concerned found responsible by\nthe 1[Regulator] for the grounds of cancellation shall be debarred from sponsoring the proposal for\ngrant of licence or de novo licence to a trade organisation or becoming member of or holding any office\nof any trade organisation for a period not exceeding three years.\n(5) Where the licence of a trade organisation has been cancelled under sub-section (1) and a\nmember or member of executive committee or employee of such trade organisation continues to\nimpersonate as member, member of executive committee or employee of the trade organisation, such\nperson shall be liable to penalties under section 24."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Cancellation of registration.⸻(1) Notwithstanding anything contained in the Ordinance or",
      "content": "any other law for the time being in force,—\n(a)        the registration of a trade organisation under the Ordinance shall be deemed to\n1\nSubs. by Act No. IV of 2025, s.5.\nhave been cancelled with immediate effect if the licence granted to such trade\norganisation has been cancelled by the 1[Regulator] under section 7;\n(b)        the registration of an existing trade organisation shall stand cancelled with\nimmediate effect if such a trade organisation has failed to apply for grant of\nfresh licence within the time notified by the 1[Regulator];\n(c)        the registration of an existing trade organisation under the Ordinance shall stand\ncancelled on 1st July, 2008, unless it has been granted licence by the\n1\n[Regulator] under section 3.\n(2) The registrar shall strike off the register, and publish in the official gazette, the names of all\nsuch trade organisations whose registration has been cancelled under sub-section (1).\n(3) All affairs of a trade organisation whose registration stands cancelled under sub-section (1)\nshall be wound up in a manner as determined by the Federal Government."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Grant of licence de novo. ⸻ (1) Where licence of a trade organisation is cancelled under",
      "content": "section 7, the 1[Regulator] may consider grant of licence de novo after a period of one year from the\ndate of cancellation or licence:\nProvided that where the licence of a trade organisation was cancelled under clause (a)\nof sub-section (1) of section 7, the 1[Regulator] may consider the grant of licence de novo at an earlier\ndate.\n(2) The trade organisation seeking licence under sub-section (1) shall be required to make an\napplication in such form and manner as may be prescribed."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Membership of trade organisations.⸻ (1) Chambers and sector specific associations on",
      "content": "all Pakistan basis, granted licence under this Act, shall apply for membership of the Federation of\nPakistan Chambers of Commerce and Industry within thirty days of grant of licence under this Act.\n(2) Upon an application by a trade organisation under sub-section (1), the Federation of\nPakistan Chambers of Commerce and Industry shall enroll such trade organisation as its member\nwithin thirty days and where such an enrolment is not decided within thirty days, the matter shall be\nreferred to the Regulator alongwith the reasons for not allowing enrolment and the Regulator shall\ndecide the matter within thirty days.\n(3) A chamber or an association which is a member of the Federation of Chambers of\nCommerce and Industry shall be eligible to vote in the election of office-bearers and committees of\nthe Federation on completion of two years of grant of licence:\nProvided that the existing trade organisations, on grant of licence under this Act, shall\nbe deemed to be members of the Federation and shall be entitled to vote.\n(4) Proprietorships, associations of persons, partnerships, companies or multinational\ncorporations engaged in trade, industry or services shall be entitled to enrolment as members of\nchambers and associations on fulfillment of the prescribed conditions.\n1\nSubs. by Act No. IV of 2025, ss.6-7.\n(5) Notwithstanding anything contained in any other law for the time being in force any person\nengaged in trade, industry or service, or any combination thereof, shall be entitled to be enrolled as a\nmember of a registered trade organisation except where such person is otherwise disqualified for any\nof the reasons as may be prescribed.\n(6) Where a person, qualified to be enrolled as a member of a trade organisation, is refused\nenrolment or the enrolment is unduly delayed, on a complaint by the aggrieved person, the Regulator\nmay direct the trade organisation concerned to enroll such person as a member on fulfillment of the\nprescribed requirements.\n(7) New members of the chambers and associations shall be eligible to vote on completion of\ntwo years of their enrolment and payment of all dues:\nProvided that old members of the chambers and associations at the time of renewal of\nmembership which has been discontinued due to non payment of subscription dues shall be eligible to\nvote on completion of one year of their re-enrolment and payment of all dues.\n(8) Except for the membership and office-bearers provided under this Act or prescribed rules,\nthere shall not be any other position by any nomenclature in a trade organisation."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Organisation and tenure of office",
      "content": "bearers and executive committee of trade\norganisations.⸻ (1) Notwithstanding anything in any other law for the time being in force and\nmemorandum and articles of association of any existing trade organisation the tenure of office-bearers\nof all trade organisations shall be 1[two years],—\n(a)        in the case of the Federation of Pakistan Chambers of Commerce and Industry\nfrom the 1st day of January 1[*       *      *     *     *      *      *];\n(b)        in the case of all other trade organisations, from the 1st day of October\n1\n[*     *         *   *       *       *    *].\n2\n[*     *          *          *         *   *       *]\n(2) The organisational structure of trade organisations including composition and tenure of\nExecutive Committees and the manner of their elections shall be such as prescribed."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Uniformity in structure and autonomy of trade organizations.⸻ (1) The 3[division to",
      "content": "which business of this Act stands allocated] shall propose to and obtain approval from the Standing\nCommittee on Commerce in the National Assembly for a minimum, basic template of Memorandum\nfor all trade organisations to be registered under this Act;\n(2) The said template shall be in compliance with the Ordinance and shall ensure integrity,\ntransparency and efficiency in maintaining the roll of voting members, election of office bearers,\nfiduciary responsibility and right of the individual members of the trade organization.\n1\nSubs. and omitted by Act No. XXVII of 2022, s. 2.\n2\nOmitted by Act No. XVIII of 2025, s.2.\n3\nSubs. by Act No. IV of 2025, s.9.\n(3) After approval, the 1[division to which business of this Act stands allocated] shall publish\nin the official Gazette the basic template of Memorandum for all trade organisations to be registered\nunder this Act;\n(4) Apart from adherence to the basic template, the registered trade organisations shall be\nautonomous to make changes in its Memorandum in compliance with the Ordinance."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. The Regulator.⸻ (1) The 1[division to which business of this Act stands allocated] may,",
      "content": "by notification in the official Gazette, appoint or empower an officer to perform functions of Regulator\nof trade organisations under this Act.\n(2) The 1[division to which business of this Act stands allocated] may appoint or empower such\nother officers with such designations as it deems fit for performing under the superintendence and\ndirection of the Regulator, such functions of the Regulator, under this Act as he may, from time to\ntime, authorise them to discharge.\n(3) The Regulator may, by order in writing,—\n(a)        review any function, matter, case or decision of any officer; or\n(b)        withdraw any function, matter or case from any officer or staff and deal with\nsuch function, matter or case himself either de novo or from the stage it was so\nwithdrawn, or transfer the same to another officer or staff at any stage."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Powers and functions of the Regulator.⸻ (1) All acts and proceedings of a registered",
      "content": "trade organisation shall be subject to control of the Federal Government and, subject to such control,\nthe affairs of such trade organisation shall be managed and conducted in such manner as the Regulator\nmay, from time to time, direct.\n(2) the Regulator shall, for the purpose of this Act, have the same powers as are vested in a\nCivil Court under the Code of Civil Procedure, 1908 (Act V of 1908) in respect of the following\nmatters, namely:—\n(a)        summoning and enforcing attendance of any person and examining him on oath;\n(b)         compelling production of documents;\n(c)         receiving evidence on affidavit; and\n(d)        issuing commission for examination of witnesses.\n(3) Notwithstanding anything contained in any law for the time being in force or in the articles\nor memorandum of association of a registered trade organisation and without prejudice to the\ngenerality of the foregoing provisions, the Regulator shall exercise the powers to—\n(a)        conduct enquiries into the affairs of a trade organisation as may be necessary\nfor the purposes of this Act;\n1\nSubs. by Act No. IV of 2025, ss.9-10.\n(b)     inspect, with or without prior notice, any office of such trade organisation\nincluding any of its branch or regional, circle, zonal or liaison office, or any\nrecord or document found therein;\n(c)     attend any meeting of the general body or the Executive Committee of such\ntrade organisation or of any committee or other body set up or appointed to\ntransact any business, or to conduct any affair of such trade organisation;\n(d)     watch and supervise, or cause to be watched and supervised, any election held\nby or for the purpose of electing persons to the Executive Committee or other\nbody including a region, circle or zone of any such trade organisation;\n(e)     act as a final forum of appeals against the decisions of any person, committee\nor office-bearers of a trade organisation in matters relating to electoral process\nbefore the conduct of election; and\n(f)     annul the results of any election held by any trade organisation if he is\nsatisfied—\n(i)     upon his own knowledge and after such investigation he may think fit to\nmake; or\n(ii)    upon a report made by a person authorised by him to make investigation\nfor the purpose; or\n(iii)   upon a complaint filed by an aggrieved person in this behalf within thirty\ndays of the announcement of the results of such election, that the\nirregularities in the conduct of such election justify such annulment and,\nby order in writing, direct fresh election to be held within such period as\nmay be specified in the order;\n(g)     give directions to persons or trade organisations in matters concerning this Act\nor any rules or directive made thereunder;\n(h)     impose and collect penalties and fines under section 25; and\n(i)     such other powers as are provided by this Act."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Powers to enter and search the premises.⸻ (1) The Regulator or any officer authorized",
      "content": "in this behalf may, for the purpose of making any investigation, enter any premises, where the\nRegulator or such authorized officer, as the case may be, has reasons to believe that any article, books\nof account, computer hardware or software, data recording devices or other document relating to the\nsubject matter of investigation may be found and may—\n(a)     search such premises and inspect any article, books of account, computer\nhardware or software, data recording devices or other document;\n(b)     take extracts or copies of such articles, books of account or any software data;\n(c)        impound or seal such books of account, computer hardware or software, data\nrecording devices or other documents; and\n(d)        make inventory of such articles, books of account, computer hardware or\nsoftware, data recording devices or other documents found in such premises.\n(2) All searches made under sub-section (1) shall be carried out, mutatis mutandis, in\naccordance with provisions of the Code of Criminal Procedure, 1898 (Act V of 1898).\n(3) Before taking any action under this section, the Regulator shall submit to the 1[secretary of\nthe division to which business of this Act stands allocated] in writing the evidence and reasons for\ntaking the said action."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Supersession of Executive Committee, office",
      "content": "bearers and appointment of\nAdministrator.⸻ (1) Where the 1[secretary of the division to which business of this Act stands\nallocated] is in receipt of the findings of an investigation by the Regulator, that the affairs of a\nregistered trade organisation are not being properly managed and that the interests of trade, industry\nor service so require, it may, by order in writing, suspend or supersede the Executive Committee of\nsuch trade organisation for such period, not exceeding six months. as may be specified in the order:\nProvided that no such order shall be made unless the Executive Committee, intended to\nbe suspended or superseded, has been given a notice in writing of and afforded an opportunity to make\na representation against, the intended supersession.\n(2) Where⸻\n(a)        an Executive Committee is superseded under sub­section (1);\n(b)        in the opinion of the 1[secretary of the division to which business of this Act\nstands allocated], it is not possible for any reason to reconstitute the Executive\nCommittee at the due time of such reconstitution; or\n(c)        the Executive Committee is debarred by an order of any court, from discharging\nits functions, the 1[secretary of the division to which business of this Act stands\nallocated] may appoint, for such period, not exceeding six months, an\nAdministrator to take over functions of such Committee and to manage and\nconduct affairs of the trade organisation:\nProvided that when the period of supersession is terminated or the Executive\nCommittee is reconstituted or the order of the court is vacated before expiry of the period for which\nthe Administrator shall have been appointed, the 1[secretary of the division to which business of this\nAct stands allocated] may direct the Administrator to relinquish the functions taken over by him in\nfavour of the Executive Committee.\n(3) Upon appointment of an Administrator under clause (a) or clause (b) of sub-section (2), the\nmembers of the Executive Committee shall be deemed to have vacated their respective offices."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Administrator to act under control of the Regulator.⸻ (1)The Administrator shall",
      "content": "manage and conduct affairs of the trade organisation under supervision and control of the Regulator\n1\nSubs. by Act No. IV of 2025, ss.11-12.\nand in accordance with the rules, if any, made in this behalf by the Federal Government and, until such\nrules are made, in accordance with such directions as the Regulator may, from time to time, give.\n(2) The rules and directions referred to in sub-section (1) may provide for—\n(a)        the appointment of an Advisory Committee consisting of persons selected from\nmembers of the trade organisation to assist the Administrator in discharge of his\nfunctions;\n(b)        holding of elections for the purpose of reconstitution of the Executive\nCommittee at any time considered appropriate before expiry of term of\nappointment of the Administrator;\n(c)        compliance with provisions of the Ordinance to the extent applicable to the trade\norganisation except those relating to laying of the income and expenditure\naccount and reading of the auditor’s report in general meeting;\n(d)        withholding, during the period of supersession of the Executive Committee, of\nthe general meeting of the trade organisation other than the meeting to hold\nelections for reconstituting the Executive Committee;\n(e)        conduct of any business, during the period the general meeting remains\nwithheld, which requires approval or assent of the members at a general\nmeeting;\n(f)        the pay, allowances, remuneration and other privileges, of the Administrator\nand members of the advisory committee; and\n(g)        such other matters as are necessary for efficient management of affairs of the\ntrade organisation.\n(3) Any expenditure incurred in connection with management of a trade organisation by the\nAdministrator, including pay, allowances and remuneration of the Administrator and members of the\nAdvisory Committee, shall be met as expenses, and be a charge on the income, of the trade\norganisation:\nProvided that the 1[division to which business of this Act stands allocated] may allow\nremuneration, honorarium to and re-imbursement of actual expenses incurred by the Administrator in\nconnection with performance of his functions to be met from the Trade Organisations Fund."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Restriction on suits against trade organisations.⸻ Notwithstanding anything contained",
      "content": "in any law for the time being in force or in the articles or memorandum of a registered trade\norganisation, no suit or other legal proceedings relating to affairs of a trade organisation shall be\ninstituted or commenced in any court except High Court."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Compulsory membership of trade organisations.⸻(1) Notwithstanding anything",
      "content": "contained in any other law for the time being in force or in the articles or memorandum of association\nof any trade organisation or other company or in any agreement or other instrument, the 1[division to\nwhich business of this Act stands allocated] may,⸻\n1\nSubs. by Act No. IV of 2025, ss.13-14.\n(a)        subject to any rules made in this behalf, by order in writing, direct any firm,\ncompany or other concern engaged in any trade, commerce, industry or service\nto be a member of registered trade organisation specified in the order; or\n(b)        if it considers expedient in the interest of trade, commerce, industry, or service,\nby notification in the official Gazette, direct all such firms, companies or\nconcerns or any class thereof engaged in trade, commerce, industry or service,\nas may be specified in the notification subject to exception if any, to be members\nof the registered trade organisation or organisations specified in this behalf in\nsuch notification.\n(2) Upon the issue of an order or notification under sub-section (1), the registered trade\norganisation concerned shall admit as its member any firm, company or concern directed to be its\nmember by such order or notification."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Restriction on membership.⸻ (1) No person shall be a member of more than such number",
      "content": "of trade organisations as the 1[division to which business of this Act stands allocated] may, by\nnotification in the official Gazette, specify in this behalf.\n(2) A person convicted for any offence under this Act shall not hold, or be eligible for holding,\nany office in a registered trade organisation unless a period of five years has elapsed."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Appeal.⸻ (1) Any person or trade organisation aggrieved by any decision or order of the",
      "content": "Administrator may, within fourteen days of communication of such decision or order, prefer appeal to\nthe Regulator.\n(2) Any person or trade organisation aggrieved by any decision or order of the Regulator may,\nwithin fourteen days of communication of such decision or order, prefer appeal to the 1[secretary of\nthe division to which business of this Act stands allocated] whose decision, subject to sub-section (4),\nshall be final.\n(3) On appeal under sub-section (1) the Regulator or, as the case may be, under sub-section (2)\n1\nthe [secretary of the division to which business of this Act stands allocated] may suspend the operation\nor execution of the decision or order appealed against until the disposal of such appeal.\n(4) Any person aggrieved by the final order or decision of the 1[secretary of the division to\nwhich business of this Act stands allocated], involving a question of law, may, within thirty days of\nsuch order or decision, prefer appeal to the High Court."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Delegation of powers.⸻ (1) The 1[division to which business of this Act stands allocated]",
      "content": "may, by notification in the official Gazette, direct that all or any of its powers under this Act shall, in\nrelation to such matters or subject to such conditions as may be specified therein, also be exercisable\nby the Regulator.\n(2) The Regulator may, by order in writing, authorise the Administrator or any other officer to\nexercise and perform any of his powers and functions under this Act.\n1\nSubs. by Act No. IV of 2025, ss.15-17."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Federal Government may carry out functions of the Regulator.⸻ Notwithstanding",
      "content": "anything contained in any other provision of this Act, the 1[division to which business of this Act\nstands allocated] may, by notification in the official Gazette, direct that powers and functions of the\nRegulator shall, under such circumstances or in such cases, as may be specified in the notification, be\nexercised and performed by the 1[division to which business of this Act stands allocated] and upon\nsuch notification reference to the Regulator in the relevant provisions of this Act shall be construed as\nreference to the 1[division to which business of this Act stands allocated] and such provisions shall\nhave effect accordingly."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Power to levy fee etc.⸻The Federal Government may levy and charge prescribed",
      "content": "processing fee for grant of licence or renewal of licence to a trade organisation and for examining\nperformance reports, audited accounts and other documents submitted to the Federal Government or\nthe Regulator."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Penalty.⸻ Where a person contravenes any provision of this Act or any rule or order made",
      "content": "or any direction or instruction given thereunder or obstructs any officer or person acting under or in\npursuance of any such provision, rule, order, direction or instruction, shall be liable to penalty which\nmay extend to one hundred thousand rupees."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Contravention by companies, etc.⸻Where a person contravening or failing to comply",
      "content": "with, any provision of this Act or any rule, order or direction made or issued thereunder is a company\nor other body corporate, every managing director, director, manager, secretary or other officer or agent\nthereof shall, unless he proves that the offence was committed without his knowledge or that he\nexercised due diligence to prevent its commission, shall be liable to the penalty as provided for such\ncontravention or failure."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Trade Organisations Fund.⸻ (1) There shall be established a fund to be known as the",
      "content": "Trade Organisations Fund which shall consist of ⸻\n(a)        grants made by the Federal Government and the Provincial Governments;\n(b)        fees and penalties collected by the Regulator; and\n(c)        contributions from local and foreign donors or agencies.\n(2) The Federal Government shall make rules and regulations for utilizing and incurring\nexpenditures from the Fund.\n(3) For the purpose of maintaining the Fund the 1[Regulator] may open and maintain accounts\nat such scheduled banks as 1[he] may from time to time determine."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Presumption as to orders.⸻ Where an order purports to have been made or signed by an",
      "content": "authority or person in exercise of any power conferred by or under this Act, a court shall presume that\nsuch order was so made by that authority or person."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Indemnity.⸻ No suit, prosecution or other legal proceedings shall lie against any person",
      "content": "1\nSubs. by Act No. IV of 2025, ss.18-19.\nfor anything which is, in good faith, done or intended to be done in pursuance of this Act or any rule\nor order made or any direction given thereunder."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Power to make rules.⸻ The Federal Government may, by notification in the official",
      "content": "Gazette, make rules for carrying out purposes of this Act."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Act to override other laws.⸻ The provisions of this Act shall have effect notwithstanding",
      "content": "anything to the contrary contained in any other law, for the time being in force."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Merger of trade organisations.⸻ Notwithstanding anything contained in any other law",
      "content": "for the time being in force or provisions contained in memorandum and articles of association of any\ntrade organisation, the 1[division to which business of this Act stands allocated] may, by notification\nin official Gazette, direct any number of trade organisations to merge if each of' them is involved in\nthe same or significantly similar trade, industry or services or any combination thereof:\nProvided that if two or more trade organisations are involved in the same or\nsignificantly similar trade, industry or services or any combination thereof, their merger shall be\ndetermined by the 1[division to which business of this Act stands allocated] whose decision in this\nregard shall be final."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Transitional provisions.⸻ (1) All existing trade organisations, before making application",
      "content": "for grant of licence under this Act, shall alter their memorandum and articles of association or any\nexisting arrangement and shall take such other actions as are necessary to bring the constitution,\nworking and procedures of the existing trade organisations in conformity with provisions of this Act.\n(2) Notwithstanding anything contained in this Act or any other law, for the time being in force,\nor provisions contained in the memorandum and articles of association of any trade organisation, in\norder to bring the composition of the Federation of Pakistan Chambers of Commerce and Industry,\nchambers and associations in conformity with the provisions of this Act, the 1[division to which\nbusiness of this Act stands allocated] may, within six months of the commencement of this Act, pass\nany orders deemed appropriate for this purpose. Such orders may include, but not limited to, extension\nof the tenure of the office bearers and committees or supersession of Executive Committee or\nappointment of administrator or annulment of the elections of any trade organisation including the\nFederation of Pakistan Chambers of Commerce and Industry, held under the repealed ordinance or the\norder of the court. Simultaneously, with the passing of such order, the 1[division to which business of\nthis Act stands allocated] shall issue schedule of election for the respective trade organisation."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Repeal and savings.⸻ On commencement of this Act,⸻",
      "content": "(a)        the Trade Organisations Ordinance, 1961 (XLV of 1961), in its application to\ntrade organisations with objects and business not confined to one Province, shall\nstand repealed with effect from the 30th December, 2006; and\n(b)        save as otherwise expressly provided, nothing in this Act, or any repeal effected\nthereby, shall affect or deemed to affect anything done, action taken,\ninvestigation and proceedings commenced and orders, rules, regulations,\nappointment, documents or agreements made, directions given, proceedings\ntaken and instruments executed or issued under or in pursuance of the repealed\nordinance and any such thing, action, investigation, proceedings, orders, rules,\n1\nSubs. by Act No. IV of 2025, ss.20-21.\nregulations, appointments, deeds, documents, directions, proceedings shall, if in\nforce at the commencement of this Act and not inconsistent with any of the\nprovisions of this Act, continue to be in force and have effect as if it were\nrespectively done, taken, commenced, made, directed, given, executed or issued\nunder corresponding provision of this Act."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Validation of actions etc.⸻ Anything done, actions taken, orders passed, instruments",
      "content": "made, proceedings initiated, processes or communications issued, powers conferred, assumed,\nexercised by the Federal Government or Regulator on and after the 4th October, 2007 and before the\ncommencement of this Act shall be deemed to have been validly done, made, issued, taken, initiated,\nconferred, assumed and exercised and the provisions of this Act shall have, and shall be deemed always\nto have had, effect accordingly.\n_____________\np19wns44508\nRGN Dated: 24-06-2025"
    }
  ],
  "definitions": [
    {
      "term": "Administrator",
      "definition": "an Administrator appointed under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "district",
      "definition": "an administrative district notified by the Provincial Governments from time to time;",
      "source_provision": "sec2"
    },
    {
      "term": "division",
      "definition": "an administrative division notified by the Provincial Government from time to time;",
      "source_provision": "sec2"
    },
    {
      "term": "Executive Committee",
      "definition": "the Board of Directors, the Managing Committee or any other body, by whatever name called, of a registered trade organisation responsible for the management or conduct of the affairs of such trade organisation;",
      "source_provision": "sec2"
    },
    {
      "term": "existing trade organisation",
      "definition": "an organisation licensed under the Trade Organisations Ordinance, 1961(XLV of 1961);",
      "source_provision": "sec2"
    },
    {
      "term": "licence",
      "definition": "a licence granted to a trade organisation under section 3;",
      "source_provision": "sec2"
    },
    {
      "term": "member of the Executive Committee",
      "definition": "a Director where the Executive Committee is a Board of Directors and the Chairman, Senior Vice Chairman, Vice Chairman, President, Senior Vice-President and Vice President of a trade organisation licensed under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "member of a trade organisation",
      "definition": "a firm and includes a proprietorship, an association of persons, a partnership, a company or a multinational corporation, engaged in trade, industry or services and enrolled as a member of a trade organisation licensed under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "memorandum",
      "definition": "the memorandum and the articles of association of a trade organisation;",
      "source_provision": "sec2"
    },
    {
      "term": "office bearers",
      "definition": "President, Senior Vice President, Vice-President, Chairman, Senior Vice-Chairman and Vice Chairman of a trade organization;",
      "source_provision": "sec2"
    },
    {
      "term": "Ordinance",
      "definition": "the Companies Ordinance, 1984 (XLVII of 1984);",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "register",
      "definition": "the Register of Companies required to be kept under section 147 of the Ordinance;.",
      "source_provision": "sec2"
    },
    {
      "term": "registered trade organisation",
      "definition": "a trade organisation registered under the Ordinance; 1 [(p) “Regulator” means the Director General or any other officer not below basic pay scale 20 appointed by the division concerned to perform functions under this Act;]",
      "source_provision": "sec2"
    },
    {
      "term": "repealed ordinance",
      "definition": "the Trade Organizations Ordinance 1961 (XLV of 1961);",
      "source_provision": "sec2"
    },
    {
      "term": "trade organisation",
      "definition": "an organization, which— (i) is capable of being formed as a limited company within meaning of the Ordinance; (ii) is formed or intended to be formed with the object of promoting any trade, industry or service or any combination thereof; (iii) prohibits payment of any profits to its members; and (iv) applies its income and profits for achieving its objects;",
      "source_provision": "sec2"
    },
    {
      "term": "small traders and small business",
      "definition": "a member of trade organization 1 Subs. by Act No. IV of 2025, s.2. whose number of employees is less than twenty, annual business turnover ranges between two million rupees to twenty million rupees, all utility bills do not exceed one million rupees per annum and neither such small trader or small business is owned or controlled by a Provincial Government nor it carries on trade or business confined to only one Province; and",
      "source_provision": "sec2"
    },
    {
      "term": "small industry",
      "definition": "a member of trade organization which is a manufacturing concern having an industry less than twenty employees, whose annual turnover ranges between two million rupees to twenty million rupees, utility bills do not exceed one million rupees per annum and is neither owned or controlled by a Provincial Government nor carries on trade or business confined to only one Province.",
      "source_provision": "sec2"
    }
  ]
}
