{
  "id": "pk-traffic-offences-special-courts-ordinance-1981",
  "type": "statute",
  "title": "Traffic Offences (Special Courts) Ordinance, 1981",
  "title_en": "Traffic Offences (Special Courts) Ordinance, 1981",
  "short_name": "TOCO",
  "status": "in_force",
  "issued_date": "1981-12-28",
  "in_force_date": "1981-12-28",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bZ6b-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Traffic Offences (Special Courts) Ordinance, 1981 (XXXIX of 1981) published by The Pakistan Code (Criminal Laws).",
  "provisions": [
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power to make rules",
      "content": "ORDINANCE No. XXXIX OF 1981\n[29th December, 1981]\nAn Ordinance to constitute Special Courts for the speedy disposal of cases pertaining to traffic\noffences.\nWHEREAS it is expedient to constitute Special Courts for the speedy disposal of cases\npertaining to traffic offences and for matters connected therewith and ancillary thereto;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, read\nwith the Provisional Constitution Order, 1981, and in exercise of all powers enabling him in that\nbehalf, the President is pleased to make and promulgate the following Ordinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_(1) This Ordinance may be called the Traffic\nOffences (Special Courts) Ordinance, 1981.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or",
      "content": "context,—\n(a)    “Special Court” means a Special Court constituted under section 3; and\n(b)    “traffic offence” means an offence punishable under the Provincial Motor\nVehicles Ordinance, 1965 (W.P Ordinance No. XIX of 1965)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Constitution of Special Courts",
      "content": "_(1) The Provincial Government shall, by notification in\nthe official Gazette, constitute, for the whole or any part of the Province, a Special Court consisting\nof a person who is—\n(a)    a local dignitary; or\n(b)    a member of a Local Council constituted under the law relating to local\ngovernment; or\n(c)    an advocate of not less than five years' standing; or\n(d)    a serving Magistrate.\n(2) A Special Court shall sit at such place as the Provincial Government may direct.\n(3) The terms and conditions of a person appointed as a Special Court shall be such as the\nProvincial Government may determine.\n(4) A Special Court shall have all the powers conferred by the Code of Criminal Procedure,\n1898 (Act V of 1898), on a Magistrate of the first Class.\n(5) A Special Court shall follow the procedure prescribed by the Code of Criminal Procedure,\n1898 (Act V of 1898), for trial of cases by Magistrates, and a person conducting prosecution before a\nSpecial Court shall be deemed to be a Public Prosecutor.\n1\n[(5A) A Special Court may, if it thinks fit, try a traffic offence in a summary way in\naccordance with the provisions contained in sections 262 to 265 of the Code of Criminal Procedure,\n1898 (Act V of 1898)].\n(6) All proceedings before a Special Court shall be deemed to be judicial proceedings within\nCourt shall be deemed to be a Court for the purposes of sections 480 and 482 of the Code of\nCriminal Procedure, 1898 (Act V of 1898)."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Jurisdiction of Special Court",
      "content": "_(1) Notwithstanding anything contained in the Code of\nCriminal Procedure, 1898 (Act V of 1898), or the Provincial Motor Vehicles Ordinance, 1965 (W.P\nOrdinance No. XIX of 1965), the traffic offences shall be triable exclusively by a Special Court.\n(2) If in the course of a trial before the Special Court, the Court is of opinion that any of the\noffences which the accused is alleged to have committed is not a traffic offence, the Court shall\nrecord such opinion and try the accused only for such offence, if any, as is a traffic offence."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Transfer of pending cases",
      "content": "_(1) Upon the constitution of a Special Court, all cases to\nwhich the jurisdiction of the Special Court extends and which may be pending in any Court\nimmediately before the constitution of the Special Court shall stand transferred to the Special Court.\n(2) In respect of a case transferred to a Special Court by virtue of sub-section (1), the Special\nCourt shall not, by reason of such transfer be bound to recall and rehear any witness who has given\nevidence in the case before the transfer and may act on the evidence already recorded by or produced\nbefore the Court which tried the case before the Transfer."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Appeal. An appeal from a judgment of a Special Court shall lie to the Court of Session",
      "content": "2\n[except in a case tried summarily in which a Special Court passes a sentence of fine not exceeding\ntwo thousand rupees only]."
    }
  ],
  "definitions": [
    {
      "term": "Special Court",
      "definition": "a Special Court constituted under section 3; and",
      "source_provision": "sec2"
    },
    {
      "term": "traffic offence",
      "definition": "an offence punishable under the Provincial Motor Vehicles Ordinance, 1965 (W.P Ordinance No. XIX of 1965).",
      "source_provision": "sec2"
    }
  ]
}
