{
  "id": "pk-transfer-of-evacuee-deposits-act-1956",
  "type": "statute",
  "title": "Transfer of Evacuee Deposits Act, 1956",
  "title_en": "Transfer of Evacuee Deposits Act, 1956",
  "short_name": "TOEDA",
  "status": "in_force",
  "issued_date": "1956-11-11",
  "in_force_date": "1956-11-11",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap%2Bbaw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Transfer of Evacuee Deposits Act, 1956 (XLV of 1956) published by The Pakistan Code (Civil Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_ (1) This Act may be called the Transfer of\nEvacuee Deposits Act, 1956.\n(2) It extends to 1[the whole of Pakistan] 2[* * *].\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "_\n(a)        “Custodian” means the Custodian of Deposits appointed under section 3, and\nincludes an Assistant Custodian of Deposits ;\n(b)        “deposit” means___\n(i)        any movable property in the custody or under the control of any Civil\nor Revenue court in respect of any proceedings before it ; or\n(ii)       any movable property under the superintendence or in the custody of a\nCourt of Wards under any law for the time being in force, whether\nsuch movable property be in the actual custody of the Court of Wards,\nor in that of some other authority on its behalf ; or\n(iii)     any movable property in the custody or under the control of a\nManager;\nand includes any securities, insurance policies and negotiable instruments in\nthe custody or under the control of any such Civil or Revenue court or under\nthe superintendence or in the custody of such Court of Wards or in the custody\nor under the control of a Manager.\n1\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Sch.\n2\nOmitted by the Central Adaptation Order of Laws 1964 (P. O. No. 1 of 1964), Art. 2 and Sch.\nExplanation I.___“Securities” include shares, scrips, stocks, bonds, debentures,\ndebenture stocks, or other marketable securities of a like nature in or of any\nbody corporate and also Government securities.\nExplanation II.___Where any deposit in the custody or under the control of any Civil\nor Revenue court or under the superintendence or in the custody of a Court of\nWards or in the custody or under the control of the Manager has vested in the\nCustodian of Evacuee Property, such deposit shall, for the purposes of this\nAct, be deemed to be in the custody or under the control of such Civil or\nRevenue court or under the superintendence or in the custody of the Court of\nWards or in the custody or under the control of the Manager as the case may\nbe ;\n(c)        “refugee” means a person who, having been ordinarily resident in any place in\nthe territories now comprising India, or in any area occupied by India, has, on\naccount of the setting up of the Dominions of Pakistan and India, or on\naccount of civil disturbances or the fear of such disturbances, taken refuge in\nPakistan ;\n(d)        “evacuee” means any person who, on account of the setting up of the\nDominions of Pakistan and India or on account of civil disturbances or the fear\nof such disturbances, has, on or after the first day of March, 1947, left any\nplace to which this Act extends and who is now residing in any place forming\npart of India ;\n(e)        “Manager” means the manager of an encumbered estate appointed under any\nlaw for the time being in force relating to encumbered estates ;\n(f)        “transferable deposit” means a deposit in which an evacuee has any right or\ninterest to the extent of that right or interest ;\n(g)        “prescribed” means prescribed by rules made under section 13."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Appointment of Custodian and Assistant Custodian of Deposits",
      "content": "_(1) The 1[Federal\nGovernment] may, by notification in the official Gazette, appoint a Custodian of Deposits and as\nmany Assistant Custodians of deposits as may be necessary for the purpose of discharging the duties\nimposed upon the Custodian and Assistant Custodians by or under this Act.\n(2) Subject to the provisions of this Act, the Custodian and Assistant Custodians of Deposits\nshall discharge the duties imposed on them by or under this Act under the general superintendence\nand control of the 1[Federal Government], and the 1[Federal Government] may, by general or special\norder, provide for the distribution and transfer of work among them.\n(3) Subject to the provisions of this Act, the Assistant Custodians of Deposits shall discharge\nCustodian."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Procedure for transfer of certain deposits",
      "content": "_ (1) Where a Civil or Revenue court or a\nCourt of Wards or a Manager is satisfied___\n1\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Sch.\n(a)        in the case of a Civil or Revenue court other than a Civil court exercising\njurisdiction under the Guardians and Wards Act, 1890 (VIII of 1890), or\nManager that no party interested in a deposit is a Muslim ;\n(b)       in the case of a Civil court exercising jurisdiction under the Guardians and\nWards Act, 1890 (VIII of 1890), that neither the guardian nor the minor\ninterested in a deposit is a Muslim;\n(c)        in the case of a Court of Wards having under its superintendence or custody a\ndeposit, that the ward is not a Muslim ;\nthe Civil or Revenue court or the Court of Wards or the Manager, as the case may be, shall, as soon\nas may be after the commencement of this Act, transfer the deposit, along with the records relating\nthereto, to such authorised officer or authority in India as the 1[Federal Government] may by general\nor special order specify in this behalf:\nProvided that where in the opinion of the Civil or Revenue court or the Court of Wards or the\nManager, as the case may be, any of the persons interested in a deposit is not an evacuee, the deposit\nshall not be transferred to India.\n(2) Every Civil or Revenue court and every Court of Wards or Manager shall, as soon as may\nbe, send to the Custodian in such form as may be prescribed, particulars of all deposits transferred to\nIndia under sub-section (1)."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Procedure for transfer of certain other deposits",
      "content": "_ (1) Where either on a request\nreceived in this behalf from any such officer or authority in India as may be specified in this behalf\nby the 1[Federal Government] by notification in the official Gazette, or on any other information\navailable to him, the Custodian is of opinion that there is a transferable deposit to which the\nprovisions of section 4 do not apply, he may send for the record relating thereto from any court or\nother authority and inspect the same.\n(2) If, after making any such inspection as is referred to in sub-section (1) and after making\nsuch further inquiry into the matter as may be prescribed, the Custodian is satisfied that the deposit is\na transferable deposit, he may, by order, direct that the deposit shall be transferred to such authorised\nofficer or authority in India as the 1[Federal Government] may, by general or special order, specify in\nthis behalf, and any court or other authority holding in its custody or under its control any such\ndeposit shall comply with the direction.\n(3) Notwithstanding anything contained in this section, where in respect of any deposit the\nextent of the right or interest of an evacuee in such deposit is not easily ascertainable or having\nregard to the nature of the deposit it is in the opinion of the Custodian not practicable to separate the\nright, or interest of the evacuee from the right or interest of other persons in such deposit, the\nCustodian shall not transfer any part of the deposit to India."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Transfer of records relating to transferable deposits",
      "content": "__ (1) Where a transferable\ndeposit is directed to be transferred to India under the provisions of section 5, the Custodian may\nsend the record relating to the deposit, or if it is expedient so to do only a certified copy of such part\nof the record as in the opinion of the Custodian is material to the case, to the Government of India or\nto such officer or authority to whom or to which the deposit has been directed to be transferred.\n1\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Sch.\n(2) If a certified copy only is sent in pursuance of sub-section (1), the original record,\ntogether with a copy of the order of the Custodian under section 5 shall be returned to the court or\nother authority from which it was obtained."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power of Court or Custodian to convert deposits into money before transmission to",
      "content": "India. Where the transfer to India of any article which is or forms part of a transferable deposit is\nprohibited under any law for the time being in force, it shall be lawful for the Civil or Revenue court,\nor the Court of Wards or the Manager or the Custodian, as the case may be, to convert the article into\nmoney in such manner as may be prescribed, and upon such conversion the provisions of this Act\nshall apply to the proceeds thereof as they apply to transferable deposit."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Cessation of jurisdiction in respect of deposits transferred. Upon the transfer of any",
      "content": "transferable deposit under section 4, or in pursuance of an order of the Custodian under section 5, all\ncourts and authorities in Pakistan shall, save as otherwise provided in this Act, cease to have or\nexercise any jurisdiction in relation to the deposit so transferred in so far as it relates to the right or\ninterest of any evacuee in the deposit."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Reception in Pakistan of deposits transferred from India",
      "content": "_ (1) It shall be lawful for\nthe Custodian to receive and hold in his custody any deposit transferred by any such officer or\nauthority in India as may be specified by the 1[Federal Government] by general or special order as\nbeing a deposit belonging to any refugee.\n(2) On receipt of any such deposit as is referred to in sub-section (1), the Custodian shall\ncause notice thereof to be given in such manner as may be prescribed to all persons who may appear\nto be interested in the deposit, and after giving a reasonable opportunity to such persons to be heard\nin the matter and after inspecting any such record relating to the deposit as may be transferred from\nIndia, dispose of the deposit in the manner following, that is to say,___\n(a)        if the claimant, where there is only one claiming and entitled to the deposit, or\nif all the claimants, where there are more than one, appear before the\nCustodian and there is no dispute as to the distribution of the deposit, the\nCustodian shall pay the deposit to that claimant, or, as the case may be,\ndistribute the deposit among the claimants in the manner agreed to by them ;\n(b)        if all the claimants do not appear before the Custodian or if all such claimants\nappear but do not agree as to the person or persons entitled to the deposit or to\nthe distribution of the deposit among them the Custodian shall forward the\ndeposit and the records relating thereto to the principal Civil court of original\njurisdiction within whose jurisdiction all or the largest number of claimants\nreside, or where the claimants residing within the jurisdictions of two or more\nof such courts are equal in number, to the court which in the opinion of the\nCustodian shall best serve the convenience of the claimants.\n(3) The court to which a deposit and any record relating thereto are forwarded under sub-\nsection (2), shall proceed to deal with the matter as if the deposit had been made in compliance with\nan order made by it in a proceeding before it and, after making such further inquiry into the matter as\nit may think fit, award the deposit to the person or distribute it among the persons who in its opinion\nis or are entitled thereto.\n1\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Sch.\n(4) Any party aggrieved by an order made by a court under sub-section (3) may appeal\nagainst the order if the value of the claim made in the appeal exceeds two thousand rupees as against\nan appealable decree or, where the value of the claim is less, apply for a revision as against in\nnon-appealable decree ; and the provisions of the Code of Civil Procedure, 1908 (Act V of 1908),\nand of the Court Fees Act, 1870 (VII of 1870), shall apply accordingly to such appeal or application\nfor revision.\n(5) The disposal of any deposit in accordance with the provisions of this section shall\ndischarge the Custodian from any liability to any person in respect of the deposit."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Powers of Custodian. The Custodian shall have all powers vested in a Civil court under",
      "content": "matters, namely :___\n(a)        discovery and inspection ;\n(b)        enforcing the attendance of witnesses and requiring the deposit of their\nexpenses ;\n(c)        compelling the production of documents ;\n(d)        examining witnesses on oath ;\n(e)        reception of evidence and affidavits ;\n(f)        issuing commissions for the examination of witnesses:\nand may summon and examine suo motu any person whose evidence appears to him to be material ;\nand shall be deemed to be a Civil court within the meaning of sections 480 and 482 of the Code of\nCriminal Procedure, 1898 (Act V of 1898).\nExplanation.___ For the purpose of enforcing the attendance of witnesses, the local limits of\nthe jurisdiction of the Custodian shall be the local limits for which he is appointed."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Jurisdiction of Civil courts barred. No Civil court shall question the legality of any",
      "content": "action taken or of any decision given by the Custodian in connection with the transfer of any\ntransferable deposit or with the disposal of any deposit received from India as belonging to a refugee."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Protection of action taken in good faith. No suit, prosecution or other legal proceedings",
      "content": "shall lie against the 1[Federal Government] or any Custodian or any other person in respect of\nanything which is in good faith done or intended to be done in pursuance of this Act or of any rule or\norder made thereunder."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Power to make rules",
      "content": "_ (1) The 1[Federal Government] may, by notification in the\nofficial Gazette, make rules to carry out the purposes of this Act.\n(2) In particular, and without prejudice to the generality of the foregoing power, such rules\nmay___\n1\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Sch.\n(a)       define the terms and conditions of service of Custodians and the local limits of\ntheir respective jurisdictions and provide for the distribution and transfer of\nwork among or from them ;\n(b)        prescribe the manner in which deposits any records relating thereto may be\ntransferred to India;\n(c)        prescribe the manner in which and inquiry under this Act may be held;\n(d)        prescribe the manner in which a transferable deposit may be converted into\nmoney under section 7;\n(e)        specify the persons to whom and the manner in which notices of any\nproceedings under this Act shall be given;\n(f)        prescribe the manner in which certified copies of any record may be prepared\nunder this Act and the fees, if any, which may be levied in respect of such\ncertified copies;\n(g)        prescribe the form in which any application may be made to the Custodian\nunder this Act.\n1\n14.                       [*     *         *          *          *         *   *]\n_____________\n72833                                                                                            Date: 03-02-2025\n1\nRep. by the Repealing and Amending Ordinance, 1965 (X of 1965), s. 2 and 1st Sch."
    }
  ],
  "definitions": [
    {
      "term": "Custodian",
      "definition": "the Custodian of Deposits appointed under section 3, and includes an Assistant Custodian of Deposits ;",
      "source_provision": "sec2"
    },
    {
      "term": "refugee",
      "definition": "a person who, having been ordinarily resident in any place in the territories now comprising India, or in any area occupied by India, has, on account of the setting up of the Dominions of Pakistan and India, or on account of civil disturbances or the fear of such disturbances, taken refuge in Pakistan ;",
      "source_provision": "sec2"
    },
    {
      "term": "evacuee",
      "definition": "any person who, on account of the setting up of the Dominions of Pakistan and India or on account of civil disturbances or the fear of such disturbances, has, on or after the first day of March, 1947, left any place to which this Act extends and who is now residing in any place forming part of India ;",
      "source_provision": "sec2"
    },
    {
      "term": "Manager",
      "definition": "the manager of an encumbered estate appointed under any law for the time being in force relating to encumbered estates ;",
      "source_provision": "sec2"
    },
    {
      "term": "transferable deposit",
      "definition": "a deposit in which an evacuee has any right or interest to the extent of that right or interest ;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under section 13.",
      "source_provision": "sec2"
    }
  ]
}
