{
  "id": "pk-transfer-of-offenders-ordinance-2002",
  "type": "statute",
  "title": "Transfer of Offenders Ordinance, 2002",
  "title_en": "Transfer of Offenders Ordinance, 2002",
  "short_name": "TOOO",
  "status": "in_force",
  "issued_date": "2002-08-02",
  "in_force_date": "2002-08-02",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Ftap4%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Transfer of Offenders Ordinance, 2002 (XXXVII of 2002) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Inspector",
      "content": "General of Prisons to have the custody of an offender transferred to Pakistan"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Power to make rules",
      "content": "ORDINANCE NO. XXXVII OF 2002\nAN\nto provide for transfer of a citizen of Pakistan convicted of an offence in a foreign country to\nPakistan and a citizen of a foreign country convicted of an offence in Pakistan to that country.\nWHEREAS it is expedient to provide for transfer of a citizen of Pakistan convicted of an\noffence in a foreign country to Pakistan and a citizen of a foreign country convicted of an offence in\nPakistan to that country and for matters connected therewith or ancillary thereto;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action;\nNOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of\nOctober, 1999, and the Provisional Constitution Order No. 1 of 1999, read with the Provisional\nConstitution (Amendment) Order No. 9 of 1999, and in exercise of all powers enabling him in that\nbehalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the\nfollowing Ordinance:—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_ (1) This Ordinance may be called the Transfer\nof Offenders Ordinance, 2002.\n(2) It shall come into force at once.\n(3) It extends to the whole of Pakistan"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "_ In this Ordinance unless there is anything repugnant in the subject or\ncontext,-\n(a)    “agreement” means an agreement entered into between Pakistan and any other\ncountry relating to the mutual transfer of offenders between the two countries;\n(b)    “appropriate authority” in relation to a specified country, means a person or\nbody of persons in a specified country referred to in the agreement as the\nauthority responsible for administering the transfer of offenders to, and from,\nsuch country;\n(c)    “Competent Authority” means the Secretary, Ministry of Interior and Narcotics\nControl (Interior Division) or any other person as the. Competent Authority\nmay, by notification in official Gazette, authorize to exercise powers and\nperform functions, of the Competent Authority under this Ordinance;\n(d)    “Inspector-General of Prisons” means the person who is for the time being\nholding office as the Inspector-General of Prisons in a Province;\n(e)    “offender” means a person who is convicted of an offence whether committed\nbefore or after the commencement of this Ordinance and is for the time being\nserving a sentence of imprisonment by virtue of an order made either by any\ncourt in Pakistan or by a court or other institution exercising judicial powers\nwhich is empowered to make such order, in any specified country;\n(f)     “prescribed” means prescribed by rules;\n(g)     “rules” means rules made under this Ordinance; and\n(h)     “specified country” means a country which entered into an agreement for\nmutual transfer of offenders with Pakistan and notified as such by the Federal\nGovernment by notification in the official Gazette."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Application of the Ordinance",
      "content": "_ Where an agreement for mutual transfer of offenders has\nbeen entered into between Pakistan and any specified country, whether before or after the\ncommencement of this Ordinance, the Competent Authority shall, by notification in the official\nGazette, declare that the provisions of this Ordinance shall apply in respect of such country."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Competent Authority to make an application requesting the transfer of an offender",
      "content": "_\n(1) The Competent Authority may make an application to an appropriate authority in a specified\ncountry, requesting the transfer to that country of any offender who is, or is suspected to be, a citizen\nof that country.\n(2) Notwithstanding anything contained in sub-section (1), any offended who claims to be a\ncitizen of a specified country may, through the concerned Inspector-General of Prisons, make an\napplication to the Competent Authority to be transferred to the specified country of which he claims\nto be a citizen and the Competent Authority may, where considers it appropriate, make a request on\nbehalf of such offender under sub-section (1) to the appropriate authority of such specified country.\n(3) Every application for a request under this section shall be made in such form and be\naccompanied by such documents as may be prescribed.\n(4) Where the Competent Authority makes an application at the request of an offender, it shall\ninform such offender in writing of the action or decision taken both by the Competent Authority and\nthe appropriate authority of the specified county in relations to his request for a transfer."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Application to be made by an appropriate authority",
      "content": "_ (1) An application made to the\nCompetent Authority by an appropriate authority of specified country for the transfer to Pakistan of an\noffender who claims to be a citizen of Pakistan shall be entertained if-\n(a)     such application is made in the form prescribed for that purpose;\n(b)     a copy of the order, decision or judgment by which such offender was sentenced\nto the term of imprisonment, certified as correct by the appropriate authority of\nsuch specified country, is attached to the application.\n(2) Where the Competent Authority, by order, allows an application made under sub-section\n(1), the copy of the order, decision or judgment, as the case may be, attached to an application shall be\nproof of the facts stated therein and shall have effect as if it were an order, decision or judgment, as\nthe case may be, passed by a court of competent jurisdiction in Pakistan."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Condition of transfer",
      "content": "_ The transfer of any offender on an application made under this\nOrdinance shall be subject to the following conditions, namely:-\n(a)     that the offender is a citizen of Pakistan or of the specified country,\nnotwithstanding he may also be a citizen of any other country;\n(b)     that the order, decision or judgment by which the sentence of imprisonment was\nimposed on the offender is a final order, decision or judgment;\n(c)     that at the time of the application for the transfer is made, the offender concerned\nhas more than six months left to serve of the term of imprisonment imposed on\nhim or that the term of imprisonment imposed was for an unspecified period;\n(d)     that the offender consents to the transfer or where, in view of his age or physical\nor mental status, he is unable to give his consent, the consent shall be given by\nsuch other person who is designated either by the Competent Authority or the\nappropriate authority of a specified country as being competent to give consent\non behalf of the offender; and\n(e)     that both the Competent Authority and the appropriate authority of the specified\ncountry consent to his transfer."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Issue of warrant by the Competent Authority:___(1) Subject to sub",
      "content": "section (3), the\nCompetent Authority may, if considers it appropriate issue or cause to be issued, a warrant authorizing\nthe transfer out of Pakistan to a specified country of any offender.\n(2) The warrant to be issued under sub-section (1) shall be in the prescribed form under the\nhand of the Competent Authority.\n(3) The Competent Authority shall not issue a warrant under sub-section (1) unless it is satisfied\nthat all reasonable steps have been taken to inform the offender being transferred, in writing, in his\nown language, or a language he understands, of the effects and consequences of such transfer in\nrelation to such offender.\n(4) The Competent Authority shall on the date of issuing of a warrant under subsection (1)\ncause a copy thereof to be served on the concerned Inspector-General of Prisons.\n(5) A warrant issued under sub-section (I) shall be deemed to be sufficient authority for the\nconcerned Inspector-General of Prisons to deliver, or cause the delivery of, such offender to any person\nauthorized to receive such offender and to keep him in custody and deliver him to the custody of a\nperson, duly authorized by the appropriate authority in the specified country, to take the custody of\nsuch offender."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. No withdrawal of consent after issue of warrant",
      "content": "_ On or after he issue of a warrant under\nsection 7, the consent given under clause (d) of section 6 by the offender, in respect of whom such\nwarrant was issued, shall be final and revocable and any purported withdrawal of a consent given after\nthe issue of a wan-ant shall not affect the validity of such warrant or any directions given in relation to\nsuch warrant."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Effect of any warrant issued by the Competent Authority",
      "content": "_ The effect of a warrant\nissued by the Competent Authority under section 7 shall be to authorize—\n(a)     the taking of the offender to any place within Pakistan and his delivery at a place\nof departure from Pakistan into the custody of person duly authorized by the\nappropriate authority in the specified country to which he is being transferred\nto, take such custody of the offender; and\n(b)     the removal of the offender, by the person into whose custody he was delivered,\nto any place outside Pakistan."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Removal of an offender in custody to any other place in Pakistan",
      "content": "_ (1) Any offender\ncommitted to custody under section 9 or 10 who escapes from such custody, may be sent to any place\nin Pakistan in like manner as a person escaping from custody under a warrant for his arrest issued in\nthat place in respect of an offence committed therein.\n(2) Where any offender, who is in custody under section 9 or 10, is required to be removed\nfrom the place where he is held in custody to any other place in Pakistan he shall be deemed to continue\nto be in legal custody until he reaches the place to which he is required to be transferred."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Remission and President's powers to grant pardon",
      "content": "_ (1) An offender who is transferred\nto Pakistan in terms of section 9 shall be subject to any remission of the sentence of imprisonment,\nimposed on him in the specified country where he was convicted, to which he may have become\nentitled to on the date of his transfer in accordance with the laws relating to remission of a sentence in\nforce in such specified country.\n(2) Nothing in this Ordinance shall be so construed as to limit or take away the power of the\nPresident to grant pardon or remission of sentence to any offender under Article 45 of the Constitution\nof the Islamic Republic of Pakistan or by any other authority under any law of Pakistan for the time\nbeing in force."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. No appeal or revision of a sentence of imprisonment imposed upon an offender who",
      "content": "is a citizen of Pakistan:___ The sentence of imprisonment imposed on any offender who is a citizen of\nPakistan in any specified country shall not be subject to any appeal or revision in any court in Pakistan,\nnotwithstanding the fact that the order, decision or judgment imposing such sentence is deemed to be\nan order, decision or judgment imposed by a court of competent jurisdiction in Pakistan."
    }
  ],
  "definitions": [
    {
      "term": "agreement",
      "definition": "an agreement entered into between Pakistan and any other country relating to the mutual transfer of offenders between the two countries;",
      "source_provision": "sec2"
    },
    {
      "term": "Competent Authority",
      "definition": "the Secretary, Ministry of Interior and Narcotics Control (Interior Division) or any other person as the. Competent Authority may, by notification in official Gazette, authorize to exercise powers and perform functions, of the Competent Authority under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "Inspector-General of Prisons",
      "definition": "the person who is for the time being holding office as the Inspector-General of Prisons in a Province;",
      "source_provision": "sec2"
    },
    {
      "term": "offender",
      "definition": "a person who is convicted of an offence whether committed before or after the commencement of this Ordinance and is for the time being serving a sentence of imprisonment by virtue of an order made either by any court in Pakistan or by a court or other institution exercising judicial powers which is empowered to make such order, in any specified country;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "rules made under this Ordinance; and",
      "source_provision": "sec2"
    },
    {
      "term": "specified country",
      "definition": "a country which entered into an agreement for mutual transfer of offenders with Pakistan and notified as such by the Federal Government by notification in the official Gazette.",
      "source_provision": "sec2"
    }
  ]
}
