{
  "id": "pk-transfer-of-population-welfare-programme-field-activities-ordinance-1983",
  "type": "statute",
  "title": "Transfer of Population Welfare Programme (Field Activities) Ordinance, 1983",
  "title_en": "Transfer of Population Welfare Programme (Field Activities) Ordinance, 1983",
  "short_name": "TOPWP",
  "status": "in_force",
  "issued_date": "1983-08-01",
  "in_force_date": "1983-08-01",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-bpqY-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Transfer of Population Welfare Programme (Field Activities) Ordinance, 1983 (XIX of 1983) published by The Pakistan Code (Departmental Laws).",
  "provisions": [
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to make rules",
      "content": "THE TRANSFER OF POPULATION WELFARE PROGRAMME (FIELD\nACTIVITIES) ORDINANCE, 1983.\nORDINANCE No. XIX OF 1983\n[2nd August, 1983]\nAn Ordinance to provide for the transfer of field activities of the Population Welfare\nProgramme to the Provincial Governments.\nWHEREAS it is expedient to provide for the transfer of field activities of the Population\nWelfare Programme under the Population Welfare Division to the Provincial Governments for their\nspeedy implementation and exercising effective supervision and control and for matters connected\ntherewith or ancillary thereto;\nAND WHEREAS the President is satisfied that circumstances exist which render it necessary\nto take immediate action ;\nNOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, and in\nexercise of all powers enabling him in that behalf, the President is pleased to make and promulgate\nthe following Ordinance : ___"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement.⎯ (1) This Ordinance may be called the Transfer of",
      "content": "Population Welfare Programme (Field Activities) Ordinance, 1983.\n(2) It shall come into force on such date as the Federal Government may, by notification in\nthe official Gazette, appoint."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Ordinance to override other laws. This Ordinance shall have effect notwithstanding",
      "content": "anything contained in any other law for the time being in force."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Definitions. In this Ordinance, unless there is anything repugnant to the subject or",
      "content": "context,___\n(a)    “Board” and “Council” shall have the same meaning as in the Population\nWelfare Planning Programme (Appointment and Termination of Service)\nOrdinance, 1981 (XIV of 1981) ;\n(b)    “employee” means a person whose services have been regularized under the\nPopulation Welfare Planning Programme (Appointment and Termination of\nService) Ordinance, 1981 (XIV of 1981) or who has been recruited in or under\nthe Population Welfare Division after the promulgation of the said Ordinance ;\n(c)    “field activities” means___\n(i)     provision of Population Welfare Motivational Services by establishing\ncontacts with the clients at all levels ;\n(ii)    provision of Family Health Service, Clinical and Non-clinical con-\ntraception through Family Welfare Centres and those Reproductive\nHealth Service Establishments located in the Provincial Government\nhospitals, and, particularly, provision of services for rural areas ;\n(iii)    provision of Population Welfare motivation and services through line\ndepartments of the Provincial Governments;\n(iv)     supply of contraceptives and medicines to the desirous clients in urban\nand rural areas of the districts through the network of community\ndistribution points, and other agencies involved in the programme;\n(v)      implementation of publicity and communication strategy;\n(vi)     promotion of community involvement and active participation in\nPopulation Welfare Programme activities;\n(vii)    coordination of Population Welfare Programme activities with other\nnation-building departments at district and local levels;\n(viii)   setting up of Advisory Management Committees at Family Welfare\nCentre level and Population Welfare Councils at district and provincial\nlevels as provided in the Population Welfare Plan, 1981-84 ; and\n(ix)     any other activity of the Population Welfare Programme that the\nFederal Government may specify;\n(d)     “Population Welfare Programme” means any such programme in operation at\nGovernment from time to time."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Transfer of field activities to the Provincial Governments",
      "content": "_ (1) The field activities of\nthe Population Welfare Programme shall stand transferred to the Provincial Governments.\n(2) The Federal Government shall determine as to whether a particular activity is a field\nactivity within the meaning of this Ordinance."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Powers, functions and responsibilities of the Provincial Governments.⎯ (1) Upon the",
      "content": "transfer of field activities of the Population Welfare Programme to the Provincial Government, all\npowers and functions of the Federal Government in respect of field activities shall, subject to the\nother provisions of this Ordinance, vest in the Provincial Governments.\n(2) The Provincial Government shall supply to the Federal Government such returns,\nstatistics and information as may be required for monitoring, evaluation and research.\n(3) The Provincial Government shall closely collaborate with the Federal Government in\nrespect of the functions of the Federal Government referred to in sub-section (1) of section 6 and\nactivities which are identified by the Federal Government as Federal functions."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Functions of the Federal Government, etc.⎯ (1) The Federal Government shall continue",
      "content": "to perform all functions pertaining to National Policy, Planning and Coordination, Information,\nTraining, Supplies, Statistics, Monitoring and Evaluation, Research and Foreign Assistance.\nExplanation.___ In this sub-section, “Information” includes “Education” and\n“Communication” components of the Population Welfare Programme.\n(2) In the performance of their functions relating to field activities, the Provincial\nGovernment shall be guided by such guidelines and instructions on questions of policy as may be\nlaid down and given from time to time by the Federal Government, which shall be the sole judge as\nto whether a question is a question of policy."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Transfer of other activities to the Provinces. The working of the field activities of the",
      "content": "Population Welfare Programme shall be reviewed by the Federal Government from time to time and\nthe Federal Government may transfer to the Provincial Governments 1[or withdraw from such\nGovernment any activities of the Population Welfare Programme as it may deem necessary to\nimprove the execution of the Population Welfare Programme]."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Transfer, etc. of employees.⎯ (1) Notwithstanding anything contained in any contract or",
      "content": "agreement or in the conditions of service, an employee shall be retained in the Population Welfare\nDivision or transferred to the Provinces as follows :⎯\n(a)        an employee who was recruited or appointed by the Council shall be retained\nin, or, as the case may be, stand transferred to, the Population Welfare\nDivision ;\n(b)        an employee who was recruited by the Board shall be retained in, or, as the\ncase may be, stand transferred to the Province in which he was originally\nrecruited ;\n(c)        an employee who was originally recruited by the Board but subsequently\nappointed by the Council shall be retained in, or, as the case may be, stand\ntransferred to the Population Welfare Division.\n(d)        an employee shall, if he was recruited for the Population Welfare Division, be\nretained in that Division and, if he was recruited against a post in a Province,\nstand transferred to the Province of his domicile; and\n(e)        a female employee who is married or a widow may be allowed the option to\nbe transferred to the Province of the husband's or late husband's domicile:\nProvided that the Provincial Government of the Province in which an employee who is to be\nso transferred to the Population Welfare Division or to another Province is serving immediately\nbefore the commencement of this Ordinance may retain the services of such employee for such\nperiod as may be agreed upon between the Provincial Government and the Population Welfare\nDivision or, as the case may be, the Government of the other Province to which he is to be\ntransferred:\nProvided further, that the services of an employee, who immediately before the\ncommencement of this Ordinance was working in relation to any of the functions of the Federal\nGovernment under the Ordinance, shall be retained by the Federal Government in consultation and\nwith the agreement of the Provincial Government concerned.\n1\nSubs. and shall be deemed always to have been so subs. by ordinance No. 32 of 2001, s. 2.\n(2) Every employee referred to in sub-section (1) shall be entitled to the same terms and\nconditions of service with respect to grade, remuneration, leave and pension to which he was entitled\nimmediately before the commencement of this Ordinance 1[and shall, notwithstanding anything\ncontained in any other law for the time being in force or any judgment of any Court or tribunal,\nincluding a High Court and the Supreme Court, be deemed to have become the civil servants of the\nrespective Provincial Government on such commencement and shall be governed by the rules and\nregulations made under the Provincial laws relating to civil servants].\n(3) Unless otherwise directed by the Provincial Government, all authorities and officers and\nministerial staff exercising powers and functions immediately before the date of transfer shall, as\nfrom that day, continue to exercise their respective powers and functions.\n(4) No employee referred to in sub-section (1) shall be entitled to any compensation because\nof his transfer by virtue of, or under, the provisions of this Ordinance.\n2\n[(5) Notwithstanding any judgment of any Court or tribunal, including a High Court, the\nSupreme Court, any law, contract, agreement or in the conditions of service, all actions taken,\npowers, including financial and administrative, exercised, orders or instructions issued, by the\nFederal Government and Provincial Governments in respect of terms and conditions of employees\nreferred to in sub-section (1) after their retention in the Federal Government or transfer to the\nProvincial Governments, shall be deemed always to have been validly taken, exercised or issued by\nthe Federal Government and Provincial Governments.]"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Assets and liabilities, etc. On the commencement of this Ordinance,",
      "content": "_\n(a)        all rights and privileges, assets and liabilities, debts and obligations of the\nFederal Government relating to field activities of the Population Welfare\nProgramme subsisting immediately before such commencement shall, as from\nsuch commencement, be the rights, privileges, assets, liabilities, debts and\nobligations of the Provincial Government within whose territorial jurisdiction\nthey exist ;\n(b)        any contract made on behalf of the Federation for matters relating to field\nactivities of the Population Welfare Programme before such commencement\nshall, as from such commencement, if the contract is for purposes which are\nexclusively purposes of the Provincial Government, be deemed to have been\nmade on behalf of the Province concerned ;\n(c)        all rights and liabilities relating to field activities of the Population Welfare\nProgramme which have accrued or may accrue under any such contract shall,\nto the extent to which they would have been rights or liabilities of the\nFederation, be the rights or liabilities of the Province concerned ; and\n(d)        all suits and other legal proceedings relating to field activities of the\nPopulation Welfare Programme instituted by or against the Federation before\nsuch transfer shall, as from such commencement, be deemed to be suits and\nproceedings by or against the Province concerned.\n1\nAdded and shall be deemed always to have been so added by ordinance 32 of 2001, s. 3.\n2\nAdded ibid."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Financing of the Population Welfare Programme.⎯ (1) The financial liability of the",
      "content": "Federal Government in respect of field activities shall be limited to the extent of the approved\nprojects and financial grants shall be provided to the Provincial Governments through the\nDevelopment Budget of the Population Welfare Division.\n(2) The grants provided to the Provincial Governments for specific approved projects shall\nnot be transferred by them to other projects or for any other purpose.\n(3) The Provincial Government shall maintain complete and accurate account and other\nrecord in respect of the Population Welfare Programme in such manner and form as may be specified\nby the Federal Government in consultation with the Auditor General of Pakistan, provided that\nseparate accounts shall be maintained for the Head Office and for each organization, unit or project.\n(4) The accounts shall be audited by the Auditor General of Pakistan."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Removal of difficulties. The Federal Government may, for the purpose of removing any",
      "content": "difficulty that may arise in bringing into operation, or giving effect to, any provision of this\nOrdinance, make such orders as it may consider necessary."
    }
  ],
  "definitions": [
    {
      "term": "employee",
      "definition": "a person whose services have been regularized under the Population Welfare Planning Programme (Appointment and Termination of Service) Ordinance, 1981 (XIV of 1981) or who has been recruited in or under the Population Welfare Division after the promulgation of the said Ordinance ;",
      "source_provision": "sec3"
    },
    {
      "term": "Population Welfare Programme",
      "definition": "any such programme in operation at Government from time to time.",
      "source_provision": "sec3"
    }
  ]
}
