{
  "id": "pk-transfer-of-railways-amendment-ordinance-2025",
  "type": "statute",
  "title": "Transfer of Railways (Amendment) Ordinance, 2025",
  "title_en": "Transfer of Railways (Amendment) Ordinance, 2025",
  "short_name": "TORO",
  "status": "in_force",
  "issued_date": "2025-10-31",
  "in_force_date": "2025-10-31",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tnbw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Transfer of Railways (Amendment) Ordinance, 2025 (X of 2025) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Amendment of Article 4, P.O. No. 33 of 1962",
      "content": "In the said\nOrder, 1n Article 4,—\n- (a) in the marginal note, for the word “Boards”, the word “Board”\n. shall be substituted;\n(b) for clause (3), the following clause shall be substituted, namely: —\n. . ~~ <(3) All actions taken by the Board in the discharge of its\n: functions shall be expressed in writing and signed by the Secretary\nof the Board.”; and\n) (c) after clausc (3), the following new clause shall be added, namely:-\n. “(4) The Board shall take decision on the construction of new\n: railway lines or the modification, closing or dismantling of any\nrailway line and shail coordinate on rail movements into and from\nports:\nProvided that the Board shall not alter the terms and\n.conditions of any contract relating to the conveyance of defence\ntraffic, alter the priority of movement in respect of defence traffic\n- PART ]] THE GAZETTE OF PAKISTAN, EXTRA., NOV. 3, 2025 767 |\n[2 EE ———— |\nand close or dismantle any railway line or make any modifications |\nin the defence lines except with the approval of Ministry of |\n\" Defence.”."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. * Insertion of Article 4A, P.O. No. 33 of 1962",
      "content": "In the said Order,\nafter Article 4, the following new Article shall be inserted, namely: — |\n“4A. Track access.—{1) For the purposes of this Article, a ‘track |\naccess agreement’ means a track access agreement pursuant to which a |\nprivate party is granted, in consideration for track access charges, a right\n5 to access the Pakistan Railways network and infrastructure and to |\n_— operate rolling-stock ,on the. Pakistan Railways network, in accordance\n, with the terms of such track access agreement as amended from time to |\n‘ time.\n(2) Notwithstanding anything contained, in the Railway\nRegulatory Authority Ordinance, 2002 (XCII of 2002), hereinafter\nreferred to as ‘Ordinance XCII of 2002°,—\n(a) subject to sub-clauses(b) and (c), until the Railway\nRegulatory Authority is constituted under Ordinance XCII of\n2002, the Board shall exercise overall regulatory oversight\nand ensure compliance of track access by private parties, both\nlocal and foreign for freight and passenger services; :\n) (b) Ordinance XCII of 2002 shall not apply to any track access\nagreement, including amendments .thereto, executed under\nthis Order, prior to or subsequent to the establishment of the\nRailway Regulatory Authority; and Co\n(c) the Railway Regulatory Authority, whenever constituted,\nshall have no jurisdiction to canccl, amend, or otherwise\n: modify any such agreement or amendments thercto, approved\nand entered into before or after its establishment.\n(3) Subject to clauses (4) and (5), the Board is authorized .to\napprove track access agreements for the access to and use of Pakistan\nRailways nctwork and infrastructure and Railways Division is\n- authorized to enter into such track access agreements as approved by the\nBoard.\n(4) The Railways Division may ecnter into track access y\nagrecments with a private party,—\nSR RR RRR oo\n’ ¥\n: 768 THE GAZETTE OF PAKISTAN, EXTRA., NOV. 3, 2025 {PART I > ,\n—_— -\n: (a) pursuant to and in accordance with the Inter-Governmental\nCommercial Transactions law or under the Intemational\nand Inter-Governmental commitments of the Federal\nGovernment, or\n(b) who is an investor that has invested in a qualified investment\n| : duly notified in the First Schedule to the Foreign Investment\n| (Promotion and Protection) Act, 2022 (XXXV of 2022); or\n|\n(c) selected through a competitive bidding.\n(5) The private party executing the track access agreement shall oo\n| be required to mect the qualification critcrion approved and notified by o\nthe Board from time to time, and communicated to the private party, ¢\nprior to the entry into such track access agreement:\nProvided that any private party that meets the criteria of sub-\nclause (b) of clause (4) shall be deemed to meet the qualification criteria\n| : necessary for track access agreements.\n(6) The track access agreements entered in pursuance to this\n| Order shall be governed solely by the provisions of this Order and\n| applicable rules and regulations made under to this Order.\n| SE (7) Track access shall be materialized by offering Pakistan\nRailways nctwork and infrastructure to the private partics for its cfficient\n| oo use, facilitating competition, revenue generation, improving: safety,\nstrategic planning and investments, through operations of freight and\npassenger train services with their own locomotives and rolling stock,\n. (8) Any amendment, or purported amendment, of a track access\nagreement shall be made with the consent of parties and shall not be\neffective unless that amendment has been approved by the Board. :\n(9) The charges, fec, revenue sharing, etc., from private parties\nshall be approved by the Board and included in the relevant track access\n~ agreement.\n(10) Pakistan Railways may provide train crew or other requisite\npersonnel on mutually agreed terms and, if required, also offer\nmaintenance facilities for locomotives and rolling stock.\n(11) The Board shall approve the railway network and\ninfrastructure usage plan (time-tabling) to be submitted by Pakistan\nRailways keeping due margins for maintenance and rehabilitation\nworks. :\n¢ PART 1} THE GAZETTE OF PAKISTAN, EXTRA., NOV. 3, 2025 769\n(12) The Federal Government Inspector of Railways (FGIR) shall\ncarry out periodic inspections of the railway network for ensuring safety E\nof train operations. :\n(13) The Board shall sanction the use of any rolling stock on the\nrailway network after ascertaining its suitability and conformance to the\n. prescribed standards.\n(14) The Board shall require the private parties and Pakistan\n: Railways to furmish periodically, but not later than one year, the\n. operating and financial results and any other information that may be\noc necessary.\n* (15) Pakistan Railways shall maintain detailed records of all track\naccess requests, the allocations and capacity usage. An annual report\nshall be submitted to the Board detailing volume of track access requests\nand approvals, utilization of network capacity, track access charge\nrevenues, performance matrix, and any incident of non-compliance.\n(16) The Board shall oversee the implementation of track access\nagreements and investigate complaints and disputes regarding unfair\ntreatment, capacity denial or discriminatory practices.\n(17) Any dispute between the parties to a track access agreement\nshall be settled in accordance with the terms of the agreement.\n(18) The Board, keeping in view the best International practices,\nmay perform any other function or excrcisc any power that may be\nmcidental or consequential to the performance of any of its functions or\nthe exercise of any of its powers.\n(19) The agreements which were signed under the Track Access |\n(2005) and are still valid shall continue, to be in force subject to\nfulfillment of conditions precedent and revision of clauses, rates, |\ncharges, fee, cte., as may be mutually agreed between the parties. |\n(20) The Federal Government may, in the national interest and by\nnotification in the official Gazette, exempt any private party or a project\nfrom all or any of the provisions of this Order or any other law\ngoverning the track access, for the time being in force.”. hid"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Amendment of Article 5, P.O. No. 33 of 1962",
      "content": "In the said\nOrder, in Article 5,—\n(a) in clause (a), after the semicolon, at the end, the word “and” shall\nbe added; :\n\"770 THE GAZETTE OF PAKISTAN, EXTRA. NOV. 3, 2025 [PART] RA\neee ep eee Ae eer ee eee er Se ee re [3 ( 4\n(b) in clause (b), for the word “Provincial”, the word “Federal” shall\nbe substituted and for the semicolon, at the end, a full stop shall be\nsubstituted; and\n(c) clauses (c) and (d) shall be omitted.\n© 7. Amendment of Article 6, P.O. No. 33 of 1962.—In the said\nOrder, in Article 6,-\noo (a) in clause (1), in sub-clause (a), after the semicolon, at the end, the\nword “and” shall be added; N\n(b) sub-clause (b) shall be omitted; and xe\n(c) clauses (2), (3) and (5) shall be omitted.\n©. 8. Omission of Article 7, P.O. No. 33 of 1962.—In the said Order,\nArticle 7 shall be omitted.\n: 9. Omission of Article 8, P.O. No. 33 of 1962.—In the said Order,\nArticle 8 shall be omitted.\n| ’ 10. Omission of Article 9, P.O. No. 33 of 1962.—In the said Order,\nArticle 9 shall be omitted."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Omission of Schedule; P.O. No. 33 of 1962",
      "content": "In the .said Order,\nthe Schedule, at the end, shall be omitted.\nASIF ALI ZARDARI,\nPresident.\nRAJA NAEEM AKBAR.\nSecretary.\nee ————\nPRINTED BY THE MANAGER, PRINTING CORPORATION OF PAKISTAN PRESS, ISLAMABAD.\nPUBLISHED BY THE DEPUTY CONTROLLER, S1ATIONERY AND FORMS, UNIVERSITY ROAD, KARACIIL."
    }
  ],
  "definitions": []
}
