{
  "id": "pk-transplantation-of-human-organs-and-tissue-act-2010",
  "type": "statute",
  "title": "Transplantation of Human Organs and Tissue Act, 2010",
  "title_en": "Transplantation of Human Organs and Tissue Act, 2010",
  "short_name": "TOHOA",
  "status": "in_force",
  "issued_date": "2010-03-17",
  "in_force_date": "2010-03-17",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Fsa5Y%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Transplantation of Human Organs and Tissue Act, 2010 (VI of 2010) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.",
      "content": "_ (1) This Act may be called the Transplantation\nof Human Organs and Tissues Act, 2010.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(a)    “brain dead” means irreversible loss of brain and brain stem functions\nsimultaneously;\n(b)    “death” means an irreversible cessation of the entire function of brainstem;\n(c)    “donor” means a person who donates any part of his body, organ, tissue or\ncell;\n(d)    “Evaluation Committee” means a committee appointed under section 5;\n(e)    “human organ” means any part of a human body, organ or tissue;\n(f)    “Monitoring Authority” means an authority constituted under section 8 to\nmonitor the process of transplantation of human organs or tissues and matters\nrelating thereto;\n(g)    “payment” means payment in money or money's worth but does not include\nany payment for defraying or reimbursing,___\n(i)     the cost of removing, transporting or preserving the human organ to be\nsupplied; or\n(ii)    any expenses or loss of earnings incurred by a person so far as\nreasonably and directly attributable to his supplying any organ from his\nbody.\n(h)       “prescribed” means prescribed by rules made under this Act;\n(i)       “recognized institution” means a medical institution or hospital for practice of\noperative surgery in transplantation of human organs or tissues to be\nrecognized by the Monitoring Authority;\n(j)       “recognized transplant surgeon or physician” means Surgeons or Physicians\npossessing appropriate qualifications, experience, and trained in the relevant\nfield, to investigate, examine and carry out transplantation surgery of human\norgans or tissues; and\n(k)       “transplantation” means the grafting of any human organ or tissue of any\nliving or deceased person to some other living person for therapeutic purposes."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Donation of organ or tissue by a living person",
      "content": "_ (1) Notwithstanding anything\ncontained in any other law for the time being in force, a living donor who is not less than eighteen\nyears of age, may during his lifetime voluntarily donate any organ or tissue of his body to any other\nliving person genetically and legally related, who is a close blood relative and the donation of organ\nor part or tissue by such person for therapeutic purpose shall be regulated in the manner as may be\nprescribed. In the case of regenerative tissue, i.e. stem cells, there is no restriction of age between\nsiblings.\nExplanation. ___For the purpose of this section, the expression “close blood relative” means\nparent, son, daughter, sister, brother and includes spouse:\nProvided that transplantation shall be voluntary, genuinely motivated and without any duress\nor coercion.\n(2) In case of non-availability of a donor as explained under sub-section (1), the Evaluation\nCommittee may allow donation by a non-close blood relative, after satisfying itself that such\ndonation is voluntary."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Donation of human organs or tissues after death",
      "content": "_ (1) Any person who is not less than\neighteen years of age may before his death, in writing duly signed and verified by the respective\nEvaluation Committee, donate any of his organ or tissue for transplantation and for this purpose may\nauthorize any medical institution or hospital duly recognized by the Monitoring Authority. The cases\nof unclaimed brain dead hospitalized patients shall be presented to an Evaluation Committee for\ntransplantation after an intense search for their relatives within twenty-four hours.\n(2) On the death of a donor referred to in sub-section (1), any close relative of the deceased\nshall inform the Evaluation Committee about the deceased and cause the removal of the human\norgan or tissue in accordance with the authorization.\n(3) A donation under this section may be executed in such form and manner as may be\nprescribed and may be revoked at any time during the lifetime of the donor in the presence of two\nwitnesses.\n1\n[4A Provision for donation of human organs or tissues after accidental death—(1) The\nauthority issuing a driving licence shall make a provision at the first page of a driving licence in the\nform of an undertaking for obtaining consent of applicant of such driving licence regarding donation\nof human organs or tissues in case of accidental death of the holder of such driving licence.\n1\nIns. by the Transplantation of Human Organs and Tissues (Amendment) Act, 2023 (XXIX of 2023), s.2.\n(2) Whoever apply for a driving licence may opt for signing the undertaking as provided in\nsub-section (1) consenting that his organs or tissues may be transplanted to any person in need of\nsuch human organs or tissues in case of accidental death of the signatory to be removed by the\nnearest authorized medical institution or hospital duly recognized by the Monitoring Authority.\n(3) The Monitoring Authority, driving licence issuing authority or such other authorities in\nthe field of public health shall publicize the importance to be a deceased donor for the welfare of\nhumanity from different scientific and religious aspects so that people may contribute through their\nvoluntary donations of organs and tissues in case of accidental death.]"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Evaluation Committee.",
      "content": "_ (1) As soon as may be after the commencement of this Act the\nFederal Government may, by notification in the official Gazette, appoint as many Evaluation\nCommittees as may be necessary which shall consist of a surgical specialist, a medical specialist, a\ntransplant specialist, a nephrologist, and a neurophysician and an intensivist where available and two\nlocal notables having a good record of social service. The Evaluation Committee shall be established\nfor every medical institution and hospital where at least twenty-five transplants are being carried out\nannually.\n(2) The Evaluation Committee shall___\n(a)    ensure that no organ or tissue is retrieved from non-related living donors\nwithout the prior approval of the Evaluation Committee;\n(b)    determine brain death of a person;\n(c)    determine propriety of removal of a human organ from any living person using\nbrain death protocol to be formulated; and\n(d)    determine fitness or otherwise for transplantation of a human organ into any\nother body."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Transplantation to be carried out by the team of transplant surgeons and physicians,",
      "content": "etc. ___ (1) The transplantation of human organ or tissue or removal of any part of human organ for\nthe purpose of transplantation shall only be carried out by the recognized professionals who shall,\nbefore the removal of any human organ from the body of the deceased, ensure that written\ncertification has been obtained from the Evaluation Committee that death has occurred.\n(2) For the purpose of sub-section (1) a person shall be deemed to be medically and legally\ndead at the time when in the opinion of the Evaluation Committee, based upon acceptable standard\nof medical practice, there is___\n(a)    an absence of natural respiratory and cardiac functions and attempt at\nresuscitation are not successful in restoring those functions; or\n(b)    an irreversible and permanent cessation of all brainstem functions and future\nattempt of resuscitation or continued supportive maintenance would not be\nsuccessful in restoring such natural functions.\n(3) On the commencement of this Act the Federal Government shall on the recommendation\nof the Monitoring Authority, by notification in the official Gazette, publish the list of medical\ninstitutions and hospitals as recognized medical institutions and hospitals for practice of operative\nsurgery in transplantation of human organs and tissues. The Federal Government may revise the list\nfrom time to time.\n(4) No hospital or medical institution shall carry out transplantation of human organs and\ntissues unless it is recognized as provided in sub-section (3)."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Effects etc., to the donor and the recipient.",
      "content": "_ (1) No transplantation of a human organ\nand tissue from a donor other than defined in sub-section (1) of section 3 shall be carried out without\nprior permission of the appropriate Evaluation Committee and only at such medical institutions and\nhospitals which have been notified under sub-section (3) of section (6), provided that such donation\nby Pakistani citizens shall not be permissible to citizens of other countries.\n(2) No human organ or tissue shall be removed from the body of a living person except for\nthe purposes of section 3 and no transplantation team of a recognized medical institution or hospital\nshall undertake the removal or transplantation of any human organ or tissue from a living donor\nunless they have explained the effects, complications and hazards connected with the removal of\norgan or tissue for transplantation to the donor and its outcome in the recipient respectively in such\nmanner as may be prescribed."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Monitoring Authority",
      "content": "_ (1) The Federal Government shall, by notification in the official\nGazette, constitute a Monitoring Authority consisting of the following, namely:___\n(i)      Minister for Health                                         Chairman\n(ii)     Secretary Ministry of Health                          Member/ Secretary\n(iii)    Surgeon General, Pakistan Army                              Member\n(iv)     President, Transplantation Society of Pakistan              Member\n(v)      Executive Director, Pakistan Medical Research Council       Member\n(vi)     President, Ophthalmological Society of Pakistan             Member\n(vii)    President, Pakistan Medical Association of Pakistan         Member\n(viii)   President, Pakistan Society of Gastroenterology             Member\n(ix)     Surgical Transplant Specialist                              Member\n(x)      Any other outstanding Medical Specialist whom               Member\nthe Federal Government may nominate\n(2) The Authority so constituted shall—\n(a)      monitor transplantation and enforce prescribed standards for recognized\nmedical institutions and hospitals;\n(b)      investigate and hold inquiry into the allegations of breach of any provision of\nthis Act;\n(c)     inspect recognized medical institutions and hospitals for examination of\nquality of transplantation, follow up medical care of donor and recipient and\nany other matter ancillary thereto and also periodically inspect institutions\nwishing to be recognized;\n(d)     cause establishment of a National Registry and national and regional networks\nfor evaluating quality and outcome of transplant centers and cause\nenhancement and promotion of transplantation; and\n(e)     due to shortage of available human organs for transplantation to meet\nlifesaving patient needs; the Monitoring Authority will explore and support the\ninternational collaboration of xenotransplanation in future, after considering\nall ethical and safety risks and also continue to examine and collect global data\non the practices, safety, quality, efficacy and epidemiology of stem cell as well\nas non-human organ transplantation.\n(3) The Monitoring Authority shall appoint an Administrator, preferably from the medical\nprofession, in consultation with the Federal Government and also appoint such other officers as may\nbe required, on terms and conditions, to be determined by it, to carry out the day-to-day business of\nthe Authority, for which the Federal Government shall provide a reasonable annual grant.\n(4) The Federal Government in consultation with the Monitoring Authority shall establish a\nfund consisting of grants by the Federal and Provincial Governments and contributions by NGOS,\nphilanthropists and other individuals for the transplantation or indigent patients including post\ntransplant care and medicines.\n(5) The pool of voluntary donors and registry of potential recipients shall be established and\nregulated as may be prescribed."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Prohibition of removal or transplantation of human organs for any purpose other",
      "content": "than therapeutic purpose. ___ No donor and no person empowered to give authority for removal of\nany human organ shall authorize the removal of any human organ for any purpose other than the\ntherapeutic purposes."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Punishment for removal of human organ without authority",
      "content": "_ (1) Whoever renders\nhis services to or at any medical institution or hospital and who for the purposes of transplantation,\nconducts, associates with or helps in any manner, in the removal of any human organ without\nauthority, shall be punished with imprisonment for a term which may extend to ten years and with\nfine which may extend to one million rupees.\n(2) Where any person convicted under sub-section (1) is a registered medical practitioner his\nname shall also be reported to the Pakistan Medical and Dental Council for appropriate action\nincluding removal of his name from the register of the Council for a period of three years for the first\noffence and permanently for subsequent offence."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Punishment for commercial dealings in human organ. ___Whoever",
      "content": "(a)     makes or receives any payment for the supply of, or for an offer to supply, any\nhuman organ;\n(b)     seeks to find a person willing to supply for payment of any human organ;\n(c)     offers to supply any human organ for payment; or\n(d)     initiates or negotiates any arrangement involving the making of any payment\nfor the supply of, or for an offer to supply any human organ,—\n(i)     takes part in the management or control of a body of persons, whether\na society, firm, or company, whose activities consist of or include the\ninitiation or negotiation of any arrangement referred to in clause (d); or\n(ii)    publishes or distributes or causes to be published or distributed any\nadvertisement,—\n(a)    inviting persons to supply for payment of any human organ;\n(b)    offering to supply any human organ for payment; or\n(c)    indicating that the advertiser is willing to initiate or negotiate\nany arrangement referred to in clause (d),\nshall be punished with imprisonment for a term which may extend to ten years and with fine which\nmay extend to one million rupees."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Punishment for contravention of any other provision of this Act",
      "content": "_ Whoever\ncontravenes any provision of this Act or any rule made, or any condition of the registration granted,\nthereunder for which no punishment is separately provided in this Act, shall be punished with\nimprisonment for a term which may extend to three years or with fine which may extend to three\nhundred thousand rupees or with both."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Offences by companies",
      "content": "_Where any offence, punishable under this Act has been\ncommitted by a company, its Chief Executive or Director or any other person who, at the time the\noffence was committed was in charge of, and was responsible to, the company for the conduct of\nbusiness of the company, as well as the company, shall be deemed to be guilty of offence and shall\nbe liable to be proceeded against and punished accordingly:\nProvided that a company shall be liable to pay fine only:\nProvided further that nothing contained in this section shall render any such person liable to\nany punishment, if he proves that the offence was committed without his knowledge or that he had\nexercised all due diligence to prevent the commission of such offence.\nExplanation.___For the purposes of this section,___\n(a)     “company” means anybody corporate and includes a firm or other association\nof individuals; and\n(b)     “director”, in relation to a firm, means a partner in the firm."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Cognizance of offences",
      "content": "_ (1) No Court inferior to that of the Magistrate of First Class\nempowered under section 30 of the Code of Criminal Procedure, 1898 (Act V of 1898) shall try an\noffence punishable under this Act.\n(2) No Court shall take cognizance of an offence under this Act except on a complaint in\nwriting made by,___\n(a)     the Monitoring Authority or its Secretary; or\n(b)     an aggrieved person who has given notice of not less than fifteen days, in such\nmanner as may be prescribed, to the Monitoring Authority, of the alleged\noffence and of his intention to lodge a complaint.\n(3) Notwithstanding anything in section 32 of the Code of Criminal Procedure, 1898 (Act V\nof 1898) it shall be lawful for a Magistrate referred to in sub-section (1) to pass any sentence\nauthorized by this Act even if such sentence exceeds his powers under the said section.\n(4) Notwithstanding anything in the Code of Criminal Procedure, 1898 (Act V of 1898) the\noffences punishable under this Act shall be non-bailable."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Savings",
      "content": "_Neither the grant of any facilities of any authority for removal of any human\norgan from the body of the donor deceased or alive in accordance with the provisions of this Act nor\nremoval of any human organ or tissue from the body of a deceased person with due care in pursuance\nof such authority shall be deemed to be an offence punishable under section 297 of the Pakistan\nPenal Code (Act XLV of 1860)."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Protection of actions taken in good faith",
      "content": "_ (1) No suit, prosecution or other legal\nproceedings shall lie against any person for anything which is done in good faith or intended to be\ndone in pursuance of the provisions of this Act or rules made there under.\n(2) No suit or other legal proceedings shall lie against the Federal Government for any\ndamage caused or likely to be caused for anything which is done with due care in good faith or\nintended to be done in pursuance of the provisions of this Act."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Power to make rules",
      "content": "_ The Federal Government may, by notification in the official\nGazette, make rules for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Removal of difficulties",
      "content": "_ If any difficulty arises in giving effect to any provision of this\nAct, the President may make such order as he considers necessary or expedient for the purpose of\nremoving the difficulty.\n__________"
    }
  ],
  "definitions": [
    {
      "term": "brain dead",
      "definition": "irreversible loss of brain and brain stem functions simultaneously;",
      "source_provision": "sec2"
    },
    {
      "term": "death",
      "definition": "an irreversible cessation of the entire function of brainstem;",
      "source_provision": "sec2"
    },
    {
      "term": "donor",
      "definition": "a person who donates any part of his body, organ, tissue or cell;",
      "source_provision": "sec2"
    },
    {
      "term": "Evaluation Committee",
      "definition": "a committee appointed under section 5;",
      "source_provision": "sec2"
    },
    {
      "term": "human organ",
      "definition": "any part of a human body, organ or tissue;",
      "source_provision": "sec2"
    },
    {
      "term": "Monitoring Authority",
      "definition": "an authority constituted under section 8 to monitor the process of transplantation of human organs or tissues and matters relating thereto;",
      "source_provision": "sec2"
    },
    {
      "term": "payment",
      "definition": "payment in money or money's worth but does not include any payment for defraying or reimbursing,___ (i) the cost of removing, transporting or preserving the human organ to be supplied; or (ii) any expenses or loss of earnings incurred by a person so far as reasonably and directly attributable to his supplying any organ from his body.",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "recognized institution",
      "definition": "a medical institution or hospital for practice of operative surgery in transplantation of human organs or tissues to be recognized by the Monitoring Authority;",
      "source_provision": "sec2"
    },
    {
      "term": "recognized transplant surgeon or physician",
      "definition": "Surgeons or Physicians possessing appropriate qualifications, experience, and trained in the relevant field, to investigate, examine and carry out transplantation surgery of human organs or tissues; and",
      "source_provision": "sec2"
    },
    {
      "term": "transplantation",
      "definition": "the grafting of any human organ or tissue of any living or deceased person to some other living person for therapeutic purposes.",
      "source_provision": "sec2"
    }
  ]
}
