{
  "id": "pk-unani-ayurvedic-and-homoeopathic-practitioners-act-1965",
  "type": "statute",
  "title": "Unani, Ayurvedic and Homoeopathic Practitioners Act, 1965",
  "title_en": "Unani, Ayurvedic and Homoeopathic Practitioners Act, 1965",
  "short_name": "UAAHP",
  "status": "in_force",
  "issued_date": "1965-01-27",
  "in_force_date": "1965-01-27",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cJqX-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Unani, Ayurvedic and Homoeopathic Practitioners Act, 1965 (II of 1965) published by The Pakistan Code (Health/Medical Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement.⸺(1) This Act may be called the Unani, Ayurvedic",
      "content": "Homoeopathic Practitioners Act, 1965.\n(2) It extends to the whole of Pakistan.\n3\n[(3) It shall come into force on the twenty first day of July, 1965.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.⸺In this Act, unless there is anything repugnant in the subject or context,⸺",
      "content": "(a)        “approved” means approved by the                               4\n[Federal Government] on the\nrecommendation of the 5[Council];\n6\n[(b)   “Committee” means the Committee appointed by the Council;\n(bb)       “Council” means the National Council for Tibb or, as the case may be, the\nNational Council for Homoeopathy, established under section 3;]\n(c)        “Homoeopathy” means the Homoeopathic system of medicine 7[including the\nBio-Chemic system of medicine,] and “Homeopath” means a practitioner of\nHomoeopathy 7[or the Bio­Chemic system of medicine];\n________________________________________________________________________________________________________________________\n1\nFor Statement of Objects and Reasons, see Gaz. of P., 1965, Ext., p. 52 S.\n2\nSubs. by the Unani, Ayurvedic and Homeopathic Practitioners (Amdt.) Ordinance, 1978 (XXII of 1978), s. 2.\n3\nSubs. and shall be deemed always to have been so subs. by Unani, Ayurvedic and Homeopathic Practitioners (Amdt.) Ordinance, 1966 (II of\n1966), s. 2, for the original sub-section (3).\n4\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n5\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.) Ordinance, 1982 (XXVII of 1982), s. 5 for “Board” and “Boards”.\n6\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt) Ordinance (XXVII of 1982), s. 2.\n7\nIns. and added by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.) Ordinance, 1978 (XXII of 1978), s.3.\n1\n[(cc) ‘list’ means the list of Homoeopaths prepared under section 27 as that list existed\nimmediately before the commencement of the Unani, Ayurvedic and Homoeopathic Practitioners\n(Amendment) Ordinance, 1978, and ‘listed’ shall be construed accordingly ;\n(ccc)      ‘meeting’ means meeting of the 2[Council] ;\n(cccc) ‘misconduct’ means conduct contrary to the provisions of this Act, the rules and\nregulations made under this Act and the Code of Ethics adopted by the\n2\n[Council];]\n(d)        “prescribed” means prescribed by rules or regulations made under this Act ;\n(e)        “President” means the President of the 2[Council] ;\n1\n[(ee) ‘qualified’ means qualified from any approved or recognized teaching institution\nimparting instruction in the Unani, Ayurvedic or Homoeopathic system of\nmedicine;]\n(f)        “recognized” means recognized by the 3[Federal Government] for the purposes\nof this Act ;\n(g)        “register” means a register of practitioners of the Unani or Ayurvedic or\nHomoeopathic system of medicine maintained under this Act ;\n(h)        “registered practitioner” means a practitioner whose name is for the time being\nentered in a register ;\n(i)        “Registrar” means the Registrar of the 2[Council] ;\n(j)        “Tabib” means a practitioner of the Unani system of medicine ;\n(k)        “Unani and Ayurvedic systems of medicine” means the Unani Tib and\nAyurvedic (including the Siddha) system of medicine, whether supplemented\nor not by such modern advances as the 2[Council] may, from time to time,\ndetermine ;\n(l)        “Vaid” means a practitioner of the Ayurvedic system of medicine 1[;]\n1\n[(m) ‘Vice-President’ means Vice-President of the 2[Council].]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment and incorporation of 2[Councils].⸺(1) As soon as may be after the",
      "content": "commencement of this Act, the 3[Federal Government] shall, by notification in the official Gazette,\nestablish a 4[Council to be called the National Council for Tib] and, by a like notification, 5[another\nCouncil to be called the National Council for Homoeopathy] for the purposes of this Act.\n_________________________________________________________________________________\n1\nIns., Subs. and added by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.) Ordinance, 1978 (XXII of 1978), s.3.\n2\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.) Ordinance, 1982 (XXVII of 1982), s. 5 for “Board” and “Boards”.\n3\nSubs. by F.A.O., 1975, Art. 2 and Table for “Central Government”.\n4\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.) Ordinance, 1979 (LXVI of 1979), s. 3, for certain words.\n5\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt) Ordinance, 1982 (XXVII of 1982), s.3.\n(2) Each of the two 1[Councils] shall be a body corporate, having perpetual succession and a\ncommon seal, and shall, by its name as specified in sub-section (1), sue and be sued.\nCONSTITUTION AND FUNCTIONS OF 1[COUNCILS]\nCOMPOSITION AND PROCEEDINGS OF 1[COUNCILS]\n2\n[4. Composition of the National Council for Tib.—(1) The National Council for Tib shall\nconsist of the following members, namely:⸺\n(a)        four members, being qualified and registered practitioners of the Unani system\nof medicine, to be nominated by the Federal Government after consulting the\nProvincial Government concerned of whom one shall be from each Province ;\n(b)       eleven qualified members, to be elected from amongst themselves by the\nregistered practitioners of the Unani system of medicine, of whom five shall be\nfrom the Punjab, three from Sind, two from the North-West Frontier Province\nand one from Baluchistan ;\n(c)       two members, to be elected from amongst themselves by the teachers of all the\nrecognized institutions of the Unani or Ayurvedic system of medicine ;\n(d)       one member, to be elected from amongst themselves by the registered\npractitioners of the Ayurvedic system of medicine ; and\n(e)       four members, to be nominated by the Federal Government, of whom one shall\nbe a scientist 3[from the related field], 4[and one Deputy Secretary (Budget),\nMinistry of Health] 3[who shall also be the Chairman of the Finance\nCommittee].\n(2) Notwithstanding anything contained in sub-section (1), for the purpose of constituting the\nNational Council for Tib for the first time,⸺\n(a)        the members required to be elected under clauses (b) and (c) shall be nominated\nby the Federal Government from amongst the registered practitioners of the\nUnani system of medicine ;\n(b)       the member required to be elected under clause (d) shall be nominated by the\nFederal Government from amongst the registered practitioners of the Ayurvedic\nsystem of medicine ; and\n(c)       for the members nominated under clauses (a) and (e) the Federal Government\nshall nominate fresh members in accordance with the provisions of those\nclauses.]\n_________________________________________________________________________________________________________________________\n1\nSubs., by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982, (XXVII of 1982), s. 5, for “Board” and “Boards”\nrespectively.\n2\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1979. (LXVI of 1979), s. 4, for section 4 which were\npreviously subs. by Ord. 22 of 1978, s. 4, for the original sections 4 and 5.\n3\nIns. and added by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt), Ordinance, 2002 (LXI of 2002), s.2.\n4\nAdded by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt), Ordinance, 2002 (IV of 2002), s.2.\n4[5. Composition of the 1[National Council for Homoeopathy].⸺The 1[National Council for\nHomoeopathy] shall consist of the following members, namely:⸺\n(a)        four members, being registered Homoeopaths, to be nominated by the Federal\nGovernment after consulting the Provincial Government concerned, of whom\none shall be from each Province ;\n(b)       eleven members, to be elected from amongst themselves by registered and listed\nHomoeopaths, of whom five shall be from the Punjab, three from Sindh, two\nfrom the North-West Frontier Province and one from Baluchistan ;\n(c)       two members, to be elected from amongst themselves by the teachers of\nrecongnised institutions of Homoeopathy ; and\n(d)       four members, to be nominated by the Federal Government, of whom one shall\nbe a scientist 2[from the related field] 3[and one Deputy Secretary (Budget),\nMinistry of Health] 2[who shall also be the Chairman of the Finance\nCommittee]]."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. The President.⸺The President 4[and Vice",
      "content": "President] shall be elected by the members of\nthe Board from amongst themselves :\n5\n[*               *                     *                     *                      *                     *                      *]"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Publication of names, etc.⸺The 6[Federal Government] shall publish in the official Gazette",
      "content": "the names of the President 4[, the Vice-President] and other members of the 7[Council] together with\nthe dates on which such members are elected or nominated."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Term of office of members",
      "content": "(1) The members of the 7[Council] shall be nominated or\nelected, as the case may be , in such manner and for such term as may be prescribed by rules.\n3\n[(2) Every member of the Council shall, subject to the other provisions of this Act and as may\nbe prescribed by rules, hold office for the prescribed term and cease to hold office at the expiry thereof.]\n(3) Members shall be eligible for re-nomination or re-election to the 7[Council] on the expiry\nof the prescribed term.\n3\n[(4) If a vacancy in the office of President, Vice-President or a member occurs during the\nprescribed term, through death, resignation, disability or otherwise, the vacancy shall be filled in\naccordance with the provisions of this Chapter.]\n_________________________________________________________________________________\n1\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982), s. 4, for certain words.\n2\nIns. and added by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt), Ordinance, 2002 (LXI of 2002), s.3.\n3\nAdded and Subs. by by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt), Ordinance, 2002 (IV of 2002), ss.3-4.\n4\nSubs., Ins. and Omitted by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978), ss, 4-6.\n5Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n6\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982), s. 5, for “Board”.\n1\n[(5) The election or nomination of the members of the Council shall be held at least three\nmonths prior to the expiry of the prescribed tenure of the Council and expenditure on election shall be\nborne by the respective Council and if, at any time, the Council ceases to exist on expiry of its\nprescribed tenure, all powers and functions of the Council shall, till constitution of new Council or for\na period of one year, be exercised and performed by such person or authority as may be appointed by\nthe Federal Government in this behalf, as if such person or authority were the Council.]"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Vacancies not to invalidate proceedings of 2[Council].⸺No act or proceedings of the",
      "content": "2\n[Council] shall be invalid merely on the ground of the existence of any vacancy in or any defect in\nthe composition of the 2[Council].\n3\n[11. Resignation by President etc.⸺The President, Vice-President or any member may at\nany time resign his office by a letter addressed to the Registrar, and such resignation shall take effect\nfrom the date it is accepted by the 2[Council]."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Declaration of vacancies.⸺If any member, during the term of his office,⸺",
      "content": "(a)        absents himself, without such reason as may in the opinion of the 2[Council] be\nsufficient, from three consecutive ordinary meetings of the 2[Council]. or\n(b)        becomes subject to any of the disqualifications mentioned in section 13, the\n2\n[Council] shall declare his office vacant."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Disqualification of members.⸺4[(1)] No person shall be a member of the 2[Council] if⸺",
      "content": "(a)        he is an undischarged insolvent ;\n(b)        he has been adjudicated by a competent court to be of unsound mind ;\n(c)        he has at any time been convicted of an offence which in the opinion of the\n5\n[Federal Government] involves moral turpitude ; or\n(d)        his name has been removed from the register.\n4\n[(2) If at any time it appears to the Federal Government that any member of the Council has\nfailed to exercise or has exceeded or abused any power conferred upon him as a member of the Council,\nany committee or examining body appointed under sub-section (3) of section 22, may, if satisfied that\nsuch failure, excess or abuse has adversely affected the efficient conduct of such member in achieving\nproposed to be taken, by notification in the official Gazette, disqualify him from the membership of\nthe Council or, as the case may be, Committee or examining body.]"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Functions of the Council.⸺The following shall be the functions of the 2[Council],",
      "content": "namely:⸺\n_________________________________________________________________________________\n1\nAdded by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt), Ordinance, 2002 (LXI of 2002), s.4.\n2\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance 1982 (XXVII of 1982) s. 5 for “Board”.\n3\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt), Ordinance, 1978 (XXII of 1978), s.8.\n4\nRenumber and Added by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt), Ordinance, 2002 (IV of 2002), s.5.\n5\nSubs. by F.A.O. 1975, Art. 2 and Table, for “Central Government”.\n(a)        to consider applications for recognition under this Act made by institutions\nimparting or desiring to impart instruction in the system of medicine with which\nthe 1[Council] is concerned ;\n(b)        to secure the maintenance of an adequate standard of 2[education] in recognized\nInstitutions ;\n(c)        to make arrangements for the registration of duly qualified persons in\naccordance with the provisions of this Act ;\n2\n[(cc) to appoint committees or sub-committees, each having due representation of all\nthe Provinces, for a specific period, to perform any specified function connected\nwith the functions of the 1[Council];]\n(d)        to provide for research in the system of medicine with which the 1[Council] is\nconcerned ; and\n(e)        to do such other acts and things as it may be empowered or required to do by\nthis Act or the rules."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Meetings of the Council",
      "content": "(1) The 1[Council] shall meet at such time and place, and every\nmeeting of the 1[Council] shall be summoned in such manner, as may be prescribed by regulations:\nProvided that, until such regulations are made, the President may summon a meeting of the\n1\n[Council] at such time and place as he may deem expedient by notice addressed to each member.\n2\n[(2) The President and, in his absence, the Vice-president, shall preside at every meeting of\n1\nthe [Council] and if, at any time, the Vice-president is also absent and the President has given prior\npermission, a member elected by the members present from amongst themselves shall preside.]\n(3) Except as hereinafter provided, all questions at meeting of the 1[Council] shall be decided\nby a majority of the votes of the members present.\n(4) 2[Eight] members of the 1[Council] shall form a quorum.\n(5) At every meeting of the 1[Council] the 2[person presiding] shall, in addition to his vote as a\nmember of the 1[council], have a second or casting vote in case of an equality of votes."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Officer of the Council and their pay and allowance",
      "content": "3[(1) The Council shall, with the\nprevious approval in writing of the Federal Government, appoint a Registrar and Controller of\nExamination on such terms and conditions as may be determined by the Federal Government and may\nappoint a person to act in his place during his absence on leave.\n_________________________________________________________________________________\n1\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982), s.5, for “Board”.\n2\nSubs. and Ins. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978), ss. 9-10.\n3\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 2002 (LXI of 2002), s.5.\n(2) An order of the Council appointing, punishing or removing the Registrar and Controller of\nExamination from office shall not take effect unless confirmed by the Federal Government in writing.]\n(3) The Registrar shall be Secretary to the 1[Council] and shall exercise such powers and\nperform such duties as may be prescribed by regulations.\n(4) The 1[Council] may appoint such other officers and servants on such terms and conditions\nas the [Council] may, with the previous approval in writing of the 2[Federal Government] determine.\n1\n(5) The Registrar and all other officers and servants of the 1[Council] shall be deemed to be\npublic servants within the meaning of Section 21 of the Pakistan Penal Code."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Recognition of institutions",
      "content": "(1) Any institution imparting or desiring to impart\ninstruction in the Unani, Ayurvedic or Homoeopathic system of medicine 3[according to the courses\nprescribed by rules] may apply for recognition under this Act.\n(2) An application for recognition shall be addressed to the Registrar of the 1[Council]\nConcerned 4[,shall be accompanied by the fees prescribed by rules] and shall contain full information\nin respect of the following matters, namely:⸺\n(a)        the constitution and personnel of the managing body of the institution ;\n(b)        the subject and courses in which it imparts or proposes to impart instructions ;\n(c)        the equipment possessed by the institution and the number of students for whom\naccommodation and other provision has been or is proposed to be made ;\n(d)        the strength and particulars of its, staff their salaries, qualifications and the\nresearch work to their credit ;\n(e)        the fees levied or proposed to be levied and the financial provision made for\ncapital expenditure on buildings and equipment and for the continued\nmaintenance and efficient working of the institution.\n(3) The Registrar shall place the application before the 1[Council], and the 1[Council] may\ndirect the Registrar to call for any further information which it may consider necessary, and may also\ndirect a local inquiry to be made by competent person or persons authorized by it in this behalf.\n(4) After considering the report of such local inquiry, if any and making such further inquiry\nas may appear to it to be necessary, the 1[Council] shall forward the application together with its\nrecommendation whether the recognition asked for should or should not be granted, to the 2[Federal\nGovernment] which may, 5[after making inspection, if necessary, at its own or through the Provincial\n_________________________________________________________________________________\n1\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance 1982 (XXVII of 1982) s. 5 for “Board”.\n2\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n3\nIns. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance 1978 (XXII of 1978, s.11.\n4\nIns. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Act, 1968 (X of 1968), s. 2.\n5\nIns. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Act, 2002 (IV of 2002), s. 6.\nGovernment concerned,] by order, grant or refuse to grant recognition and the grant of recognition\nmay be subject to such terms and conditions, if any, as may be specified in the order."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Maintenance of standard of efficiency",
      "content": "(1) It shall be the duty of the 1[Council] to secure\nthe maintenance of an adequate standard of efficiency in recognized institutions.\n(2) For the purpose of securing such standard, the 1[Council] may—\n(a)       from time to time call upon any recognized institution to furnish such particulars\nas the 1[Council] may require of any course of study provided or examination\nconducted by such institution, and\n(b)       appoint inspectors from amongst the registered practitioners to attend and be\npresent at all or any of the examinations conducted by such institution prior to\nthe qualifying examination.\n(3) The inspectors shall not interfere with the conduct of any examination, and their duty shall\nbe to report to the 1[Council] their opinion as to the sufficiency or otherwise of every examination\nwhich they attend, and any other matter in relation to such examination on which the 1[Council] may\nrequire them to report.\n(4) The 1[Council] shall arrange periodical inspection of recognized institutions and\nsupervision of the examinations conducted by such institutions, through inspectors to be appointed by\nthe 1[Council], and shall pay such salaries and allowances and traveling expenses to the inspectors as\nmay be approved by the 2[Federal Government]."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Withdrawal of recognition",
      "content": "(1) The 1[Council] when it thinks fit may, and when\nrequired to do so by the 2[Federal Government] shall, make an enquiry whether any recognized\ninstitution should cease to be a recognized institution.\n(2) If, on making such an enquiry, and after considering all such information and reports as are\nreferred to in the preceding section and making such further inquiry as may appear to it to be necessary,\nthe 1[Council] is satisfied that the 3[education] provided or the examinations conducted by a recognized\ninstitution are not such as to secure and adequate standard of efficiency for the practice of the system\nof medicine taught in the institution, it shall submit a report to the 2[Federal Government] with its\nrecommendation stating the reasons therefor that the recognition of the institution should be withdrawn\nand the 2[Federal Government] may, on receipt of such report, make an order to be published in the\nofficial Gazette, withdrawing the recognition of the institution:\nProvided that no order under this sub-section shall be made unless the institution concerned\nhas been given an opportunity to raise, within a specified time, the standard of the 3[education] and\nexamination to the satisfaction of the 2[Federal Government] and the institution has, in the opinion of\nthe 2[Federal Government], failed to do so."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Duration of courses",
      "content": "(1) The duration of the course in recognized institutions of Unani\n_________________________________________________________________________________\n1\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982), s. 5, for “Board”.\n2\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n3\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978), s. 12.\nor Ayurvedic System of Medicine shall be four years and the course shall include the subjects\nprescribed by regulations.\n(2) The duration of diploma course in recognized institutions of Homoeopathy shall be four\nyears and the course shall include the subjects prescribed by regulations.\n1\n[21. Qualifications for admission to institutions.⸺(1) The minimum qualifications required\nfor admission to a recognized institutions of Unani or Ayurvedic System of medicine shall be\nmatriculation with science or equivalent examination of any university or education board in Pakistan\nestablished by or under any law for the time being in force.\n(2) The minimum qualifications required for admission to a recognized institution of\nhomoeopathy shall be intermediate with science (F.Sc. Pre-medical) or equivalent examination of any\nuniversity or education board in Pakistan established by or under any law for the time being in force,\nbut those with bachelor or higher qualification with science shall be entertained.]"
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Qualifying examination",
      "content": "(1) A qualifying examination shall be held at least once in\nevery year for the purpose of granting a diploma conferring the right of registration under this Act.\n(2) The examination shall be held on the subjects prescribed by regulations and the right of\nappearing at the examination shall be restricted to candidates who have undergone a course of study\nin such subjects in the prescribed manner at a recognized institution.\n2\n[(3) The examination shall be held under the control of an examining body to be appointed by\nthe Federal Government after consulting the Council.\n(4) The Chairperson of the examination body shall be appointed by the Federal Government.]\n____________________\n_________________________________________________________________________________\n1\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amendment) Act, 2021 (LI of 2021), s. 2.\n2\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amendment) Act, 2002 (LXI of 2002), s. 7."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Registration how made.⸺1[(1) * * * * * * *",
      "content": "(2) *                *                     *                    *                     *                     *                   *]\n(3) Applications for registration under this Act shall be made in such form and on payment of\nsuch fee as may be prescribed by rules.\n(4) The 1[Council] shall examine the applications received under this section and after making\nsuch enquiries as it thinks fit regarding the qualifications 1[* * * * * * *] of the applicants and their\nprofessional efficiency direct the entry of the names to be made in the register in accordance with the\nProvisions of this Act.\n1\n[24. Registration of Unani, Ayurvedic and Homoeopathic Practitioners.—(1) Every\nperson who passes the qualifying examination in the Unani, Ayurvedic or Homoeopathic System of\nmedicine from a recognized institution may apply for registration in the respective register.\n(2) Every person who is a registered medical practitioner within the meaning of the 4[Medical\nand Dental Council Ordinance, 1962 (XXXII of 1962)], and has taken to the practice of Homoeopathy\nmay apply for registration as Homoeopath.]\n3\n[(3) Notwithstanding anything contained in sub-sections (1) and (2), the Federal Government\nmay, if it deems fit after consulting the Council, direct that a degree or diploma in the Unani, Ayurvedic\nor Homoeopathic System of medicine, as the case may be, granted by any institution in or outside\nPakistan shall be recognized on such conditions as it may, by notification in the official Gazette,\nspecify.]\n1[25. *              *                     *                    *                     *                     *                   *\n26. *                *                     *                    *                     *                     *                   *\n27. *                *                     *                    *                     *                     *                   *]"
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Removal from register, etc",
      "content": "The 2[Council] may direct that the name of any practitioner\nwho has been convicted of a cognizable offence or who after due enquiry has been found guilty of\nmisconduct shall be removed from the register or the list 1[* * * *] if the offence or misconduct in the\n_________________________________________________________________________________\n1\nOmitted and subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978), ss.14-17.\n2\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982), s. 5, for “Board”.\n3\nAdded. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 2002 (IV of 2002), s. 7.\nopinion of the 1[Council] discloses moral turpitude such as to render him unfit to practice his\nprofession:\nProvided, however, that no action shall be taken by the 1[Council] under this section unless the\nperson convicted of the cognizable offence or found guilty of misconduct has been given a reasonable\nopportunity to show cause against the punishment proposed to be inflicted on him."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Cancellation or alteration of entries in register, etc",
      "content": "The 1[Council] may on its own\nmotion or on information received from any person and after due enquiry and giving an opportunity\nto the person concerned of being heard cancel or alter any entry in the register or the list 2[* * * *] if\nin the opinion of the 1[Council] the entry was made fraudulently or improperly."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Maintenance of register, etc",
      "content": "(1) Subject to any general or special orders of the\n1\n[Council] it shall be the duty of the Registrar to keep the register and the list 2[* * * *] and to attend\nthe meetings of the 1[Council].\n(2) The register and the list shall contain the name, residence and qualifications of every\npractitioner registered or listed under this Act, and the dates on which the qualifications were acquired.\n(3) The Registrar shall keep the register and the list correct and up-to-date and shall, from time\nto time, enter therein any alteration in the address and qualifications of the practitioners, and remove\nthere from the names of the practitioners who die or whose names are directed to be removed in\naccordance with the provisions of this Act.\n(4) The 3[Federal Government] may by rules prescribe any additional fee for any alteration in\nthe register due to additional qualifications.\n(5) If the Registrar has reason to believe that any registered practitioner or a person whose\nname is entered in the list 2[* * * *] has ceased to practice or has changed his permanent address\nwithout due intimation to him, he may write by registered post to such practitioner at the address as\nentered in the register to enquire whether he has ceased to practice or has changed his residence and,\nif within six months no reply is received, the Registrar may remove the name of such practitioner from\nthe register:\nProvided that the 1[Council] may, at any time on the application of the practitioner whose name\nis removed under this sub-section, order that the name of such practitioner be re-entered in the register."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Publication of List",
      "content": "(1) The Registrar shall, in every 2[fourth] year, on or before a date to be\nfixed by the 1[Council] cause to be published a correct list of the names and qualifications of all\npractitioners for the time being entered in the register 2[or the list] and the dates when such\nqualifications were acquired.\n_________________________________________________________________________________\n1\nSubs.by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982) s. 5, for “Board”\n2\nOmitted and Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978), ss 18-20.\n3\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n(2) It shall be presumed that any person entered in such list is a registered practitioner and that\nany person not so entered is not a registered practitioner.\nRIGHT, DUTIES AND LIABILITIES OF REGISTERED PRACTITIONERS"
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Intimation of change of address",
      "content": "Every registered practitioner shall inform the Registrar\nof any change in his permanent address."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Privileges of registered practitioners",
      "content": "(1) Notwithstanding any thing, contained in any\nlaw for the time being in force, every 1[registered or listed practitioner] shall be entitled⸺\n(a)        to hold any appointment as physician or medical officer in any Unani,\nAyurvedic or, as the case may be, Homoeopathic dispensary, hospital, infirmary\nor lying-in hospital if such dispensary, hospital, infirmary or laying-in hospital\nis supported by or receives a grant from Government or any local authority and\ntreats patients according to the relevant system of medicine, or in any public\nestablishment, body or institution practicing such system;\n(b)        to vote for the election of members to the 2[Council];\n(c)        to recover fees through courts.\n(2) No 1[registered or listed practitioner] shall stock, use or sell any drugs or medicines except\nsuch as are included in the Unani, Ayurvedic or, as the case may be, Homoeopathic Pharmacopoeia\napproved by the 3[Federal Government].\n(3) A practitioner registered under section 25 shall be entitled to the privileges specified in\nclauses (b) and (c) of sub-section (1) and be subject to the restriction mentioned in sub-section (2).\n1\n[(4) A registered or listed practitioner shall abide by the Code of Ethics framed by the\n2\n[Council] with the approval of the Federal Government.]\n1[34. *              *                     *                     *                    *                     *                     *\n35. *                *                     *                     *                    *                     *                     *]\n_________________________________________________________________________________\n1\nSubs., added and omitted by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978), ss 21-22.\n2\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982), s. 5, for “Board”.\n3\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\nOFFENCES, PENALITY AND PROCEDURE\n1\n[36. Offences and penalties.— Whoever contravenes the provisions of sub-section (2) of\nsection 33 shall be punishable with imprisonment for a term which may extend to seven years, or with\nfine which may extend to one lac rupees, or with both.]"
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Persons not registered under Act not to practice etc",
      "content": "(1) No person other than a\n1\n[registered or listed practitioner] shall practise or hold himself out, whether directly or by implication,\nas practicing the Unani, Ayurvedic or, as the case may be , Homoeopathic system of medicine.\n(2) No Tabib, Vaid or Homoeopath shall⸺\n(a)       sign or authenticate a birth certificate 1[or death certificate] required by any law\nor rule to be signed or authenticated by a duly qualified medical practitioner; or\n(b)       sign or authenticate a medical or physical fitness certificate 1[or death\ncertificate] required by any law or rule to be signed or authenticated by a duly\nqualified medical practitioner.\n1\n[(2A) No Homoeopath shall practise surgery.]\n(3) Whoever contravenes the provisions of this section, shall be punishable with imprisonment\nfor a term which may extend to one year, or with fine which may extend to one thousand rupees, or\nwith both.\n1\n[37A. Prohibition against calling applications, etc., by un-recognised institutions.—(1)\nNo institution which is not recognized under section 17 shall call applications, advertise or arrange for\nadmission to such institution for imparting education in the Unani, Ayurvedic or Homoeopathic system\nof medicine; nor shall such institution advertise or conduct any correspondence course in any such\nsystem of medicine.\n(2) Whoever contravenes the provisions of sub-section (1) shall be punishable with\nimprisonment for a term which may extend to seven years, or with fine which may extend to one lac\nrupees, or with both.]"
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Colourable imitation of degrees",
      "content": "(1) No person other than a body or institution\nauthorized under this Act shall confer, grant or issue or hold out as entitled to confer, grant or issue a\ndegree, diploma or licence which purports to entitle the holder to practise the Unani, Ayurvedic or\nHomoeopathic system of medicine, or which is identical with or is a colourable imtimation of any\ndegree, diploma or licence granted by a body or institution so authorized.\n(2) Whoever contravenes the provisions of this section shall be punishable with fine which may\nextend to one thousand rupees, and if the person so contravening is an association, every member of\nsuch association who knowingly or willfully authorises or permits the contravention shall be\npunishable with fine which may extend to one thousand rupees.\n_________________________________________________________________________________\n1\nSubs. and Ins. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978), ss 23-25."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Prohibition against use of title, description, etc",
      "content": "(1) No person shall add to his name,\ntitle or description any letters or abbreviations which imply or are calculated to the belief that he holds\na degree, diploma, licence or certificate as his qualification to practise the Unani, Ayurvedic or\nHomoeopathic system of medicine, unless he holds such degree, diploma, licence or certificate and\nsuch degree, diploma, licence or certificate.⸺\n(i)        is recognized by any law for the time being in force in Pakistan or in any part\nthereof; or\n(ii)       has been conferred, granted or issued by a body or institution authorized under\nthis Act in this behalf; or\n(iii)      has been conferred, granted or issued by an authority empowered or recognized\nas competent by the 2[Federal Government] or the Provincial Government to\nconfer, grant or issue such degree, diploma, licence or certificate.\n(2) Notwithstanding anything contained in any other law for the time being in force, no Tabib\nor Vaid shall describe himself as a Doctor but a Homoeopath may use the expression “Homoeopathic\nDoctor” both the words “Homoeopathic” and “Doctor” having equal prominence.\n(3) Whoever contravenes the provisions of this section shall be punishable with imprisonment\nfor a term which 1[shall not be less than one year nor more than five years and also with fine which\nmay extend to twenty thousand rupees]."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Savings",
      "content": "Nothing in this Chapter shall apply to any person⸺\n(a)        who limits his practice to dentistry ; or\n(b)        who being a nurse, midwife or health visitor and registered as such under any\nlaw for the time being in force, or a dai, attends on a case of labour ; or\n(c)        who being a technical assistant like Jarrah or Kuhal attends on a case under the\ndirection and personal guidance of a registered practitioner of the Unani system\nof medicine."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Cognizance of offences, etc",
      "content": "(1) No court shall take cognizance of any offence under this\nAct except on a complaint in writing by an officer empowered in this behalf by the 1[*] Government.\n(2) 1[Except as provided in section 36, no] court other than that of a Magistrate of the first class\nshall try an offence under this Act.\nSUPERSESSION OF 3[COUNCIL]"
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Supersession of Council",
      "content": "1[(1) If at any time it appears to the Federal Government that\n______________________________________________________________________________\n1\nSubs. and omitted by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978). ss 26-28.\n2\nSubs. by F.A.O. 1975, Art. 2 and Table for “Central Government”.\n3\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982). S. 5, for “Board”.\nthe 1[Council] has failed to exercise or has exceeded or abused any of the powers conferred upon it by\nor under this Act, the Federal Government may, if it is satisfied that such failure, excess or abuse has\nadversely affected the efficient conduct of the affairs of the 1[Council] or the achievement of the objects\nof this Act, by notification in the official Gazette, supersede the 1[Council] for a period of one year\nand may, by a like notification, extend the period of supersession for a further period of one year :\nProvided that no 1[Council] shall be superseded unless a reasonable opportunity has been given\nto it to show cause against the supersession].\n(2) Upon the supersession of the 1[Council] under sub-section (1)⸺\n(a)        the persons holding office as President 2[, Vice-President] and members of the\n1\n[Council] shall cease to hold office ; and\n(b)   all powers and functions of the 1[Council] shall, during the period of\nsupersession, be exercised and performed by such person or authority as the\n3\n[Federal Government] may appoint in this behalf, as if such person or authority\nwere the 1[Council].\n(3) The 1[Council] shall be reconstituted in accordance with the provisions of this Act for the\nexercise and performance of its powers and functions on the expiry of the period specified in the\nnotification under sub-section (1)."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Fees received by Council",
      "content": "4[(1)] All moneys received by the 1[Council] as fees shall be\napplied for the purpose of the 1[Council] in accordance with the rules made under this Act.\n4\n[(2) The accounts of the Council shall be maintained in such form and manner as the\nAuditor-General of Pakistan may prescribe.\n(3)     The accounts of the Council shall be audited by one or more auditors appointed by the\nFederal Government in consultation with Auditor-General of Pakistan.]\n2\n[44. Death of registered practitioners.—For the purpose of securing information relating to\nthe death of a registered or listed practitioner, the 1[Council] may appoint an honorary. Registrar of\nDeaths in each district and regulate his functions and terms of appointment.]"
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Indemnity",
      "content": "No suit, prosecution or other legal proceeding shall be instituted against any\nperson for anything which is in good faith done or intended to be done under this Act or the rules or\nregulations made thereunder."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Power to make rules",
      "content": "(1) The 3[Federal Government] may, after consulting the\n1\n[Council], by notification in the official Gazette, make rules5 to carry out the purposes of this Act.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules may\nprovide for all or any of the following matters, namely:⸺\n(a)        the time and place at which and the manner in which elections shall be held ;\n(b)   the manner in which vacancies shall be filled ;\n_________________________________________________________________________________\n1\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982), s. 5, for “Board”.\n2\nIns. and subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978) ss 28-29.\n3\nSubs. by F.A.O., 1975, Art. 2 nad Table, for “Central Government”.\n4\nNumbered and added by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 2002 (LXI of 2002), s. 8.\n5\nFor such rules, see Gaz. of p., 1965, EXT., pp. 1445-1450.\n(c)        the form of the list and register and the particulars to be entered therein ;\n(d)        fees chargeable for the registration, alteration in the register regarding additional\nqualifications and alteration of other entries in the register ;\n1\n[(e)   fees chargeable from institutions applying for recognition under this Act ;\n(f)        the registration with the 2[Council] concerned of students admitted to\nrecognised institutions and the fees chargeable for such registration ;\n(g)        fees chargeable for admission to examinations or tests held under any provision\nof this Act ;\n(h)        the purposes for which the fees received by the 2[Council] shall be applied5[;\nand]]\n5\n[(i)   fee chargeable for renewal of registration.]"
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Power to make regulations",
      "content": "The 2[Council] may, with the previous approval in writing\n3\nof the [Federal Government], make regulations not inconsistent with this Act or the rules made\nthereunder for the following matters, namely :―\n(a)        courses of study for training and qualifying examinations ;\n(b)        languages in which examinations shall be conducted and instruction given ;\n(c)        admission of students to recognized institutions ;\n(d)        the conditions under which candidates shall be admitted to different courses\nand the qualifying and other examinations ;\n(e)        the conditions of appointment of examiners and the conduct of examinations ;\n(f)        the conditions for the appointment of teachers in recognized institutions 4[and\nthe qualifications of the principals and teachers thereof] ;\n(g)        the requirements for the recognition of teaching institutions ;\n(h)        the time and place at which the 2[Council] shall hold its meetings ;\n(i)        such other matters as may be necessary for the exercise of powers and\nperformance of functions to be exercised or performed by the 2[Council] under\nthis Act and the rules made thereunder.\n6\n[48. Policy issues relating to the affairs of the Council.⸺In the discharge of its function,\nthe Council shall be guided on questions of policy by the instructions, if any, as may be given to it,\nfrom time to time, by the Federal Government which shall be the sole judge as to whether a question\nis a question of policy.]\n_________________________________________________________________________________\n1\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Act, 1968 (X of 1968) s. 3.\n2\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982), s. 5. for “Board”.\n3\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n4\nAdded by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978), s. 30.\n5\nSubs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Act, 2002 (IV of 2002) s. 8.\n6\nAdded by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Act, 2002 (LXI of 2002) s. 9."
    }
  ],
  "definitions": [
    {
      "term": "approved",
      "definition": "approved by the 4 [Federal Government] on the recommendation of the 5[Council]; 6 [(b) “Committee” means the Committee appointed by the Council;",
      "source_provision": "sec2"
    },
    {
      "term": "Council",
      "definition": "the National Council for Tibb or, as the case may be, the National Council for Homoeopathy, established under section 3;]",
      "source_provision": "sec2"
    },
    {
      "term": "Homoeopathy",
      "definition": "the Homoeopathic system of medicine 7[including the Bio-Chemic system of medicine,] and “Homeopath” means a practitioner of Homoeopathy 7[or the Bio­Chemic system of medicine]; ________________________________________________________________________________________________________________________ 1 For Statement of Objects and Reasons, see Gaz. of P., 1965, Ext., p. 52 S. 2 Subs. by the Unani, Ayurvedic and Homeopathic Practitioners (Amdt.) Ordinance, 1978 (XXII of 1978), s. 2. 3 Subs. and shall be deemed always to have been so subs. by Unani, Ayurvedic and Homeopathic Practitioners (Amdt.) Ordinance, 1966 (II of 1966), s. 2, for the original sub-section (3). 4 Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. 5 Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.) Ordinance, 1982 (XXVII of 1982), s. 5 for “Board” and “Boards”. 6 Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt) Ordinance (XXVII of 1982), s. 2. 7 Ins. and added by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.) Ordinance, 1978 (XXII of 1978), s.3. 1 [(cc) ‘list’ means the list of Homoeopaths prepared under section 27 as that list existed immediately before the commencement of the Unani, Ayurvedic and Homoeopathic Practitioners (Amendment) Ordinance, 1978, and ‘listed’ shall be construed accordingly ; (ccc) ‘meeting’ means meeting of the 2[Council] ; (cccc) ‘misconduct’ means conduct contrary to the provisions of this Act, the rules and regulations made under this Act and the Code of Ethics adopted by the 2 [Council];]",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules or regulations made under this Act ;",
      "source_provision": "sec2"
    },
    {
      "term": "President",
      "definition": "the President of the 2[Council] ; 1 [(ee) ‘qualified’ means qualified from any approved or recognized teaching institution imparting instruction in the Unani, Ayurvedic or Homoeopathic system of medicine;]",
      "source_provision": "sec2"
    },
    {
      "term": "recognized",
      "definition": "recognized by the 3[Federal Government] for the purposes of this Act ;",
      "source_provision": "sec2"
    },
    {
      "term": "register",
      "definition": "a register of practitioners of the Unani or Ayurvedic or Homoeopathic system of medicine maintained under this Act ;",
      "source_provision": "sec2"
    },
    {
      "term": "registered practitioner",
      "definition": "a practitioner whose name is for the time being entered in a register ;",
      "source_provision": "sec2"
    },
    {
      "term": "Registrar",
      "definition": "the Registrar of the 2[Council] ;",
      "source_provision": "sec2"
    },
    {
      "term": "Tabib",
      "definition": "a practitioner of the Unani system of medicine ;",
      "source_provision": "sec2"
    },
    {
      "term": "Unani and Ayurvedic systems of medicine",
      "definition": "the Unani Tib and Ayurvedic (including the Siddha) system of medicine, whether supplemented or not by such modern advances as the 2[Council] may, from time to time, determine ;",
      "source_provision": "sec2"
    },
    {
      "term": "Vaid",
      "definition": "a practitioner of the Ayurvedic system of medicine 1[;] 1 [(m) ‘Vice-President’ means Vice-President of the 2[Council].]",
      "source_provision": "sec2"
    }
  ]
}
