{
  "id": "pk-united-nations-declaration-of-death-of-missing-persons-act-1956",
  "type": "statute",
  "title": "United Nations (Declaration of Death of Missing Persons) Act, 1956",
  "title_en": "United Nations (Declaration of Death of Missing Persons) Act, 1956",
  "short_name": "UNODO",
  "status": "in_force",
  "issued_date": "1956-04-10",
  "in_force_date": "1956-04-10",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap%2BabA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of United Nations (Declaration of Death of Missing Persons) Act, 1956 (VII of 1956) published by The Pakistan Code (International Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "_ (1) This Act may be called the United Nations\n(Declaration of Death of Missing Persons) Act, 1956.\n(2) It shall extend to the whole of Pakistan and shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Provisions of the Schedule to have the force of law",
      "content": "_ (1) Notwithstanding anything to\nthe contrary contained in any other law for the time being in force, the provisions set out in the\nSchedule to this Act, of the Convention on Declaration of Death of Missing Persons, adopted by the\nUnited Nations Conference on the Declaration of Death of Missing Persons, on the 6th Day of April,\n1950, shall have the force of law in Pakistan.\n(2) The 2[Federal Government] may by notification in the official Gazette amend the said\nSchedule in conformity with any amendments duly made in the provisions of the said Convention."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Powers to make declaration in respect of certain persons having disappeared",
      "content": "subsequent to 1945. ___(1) Where in pursuance of any international agreement, convention or other\ninstrument it is necessary or permissible to make a declaration of death in respect of persons having\ndisappeared subsequent to 1945 under circumstances similar to those mentioned in the provisions set\nout in the Schedule to this Act, the 1[Federal Government] may, by notification in the official\nGazette, declare that the said provisions or such of them as it may deem necessary or convenient for\ngiving effect to the said agreement, convention or other instrument, shall apply with such adaptations\nas may be necessary to the persons specified in the notification, and thereupon the said provisions\nshall apply accordingly and notwithstanding anything to the contrary contained in any other law for\nthe time being in force, shall in such application have the force of law in Pakistan.\n(2) The persons to be specified in the notification as aforesaid may be specified in such\nmanner as the 2[Federal Government] may think fit."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to make rules.",
      "content": "_The 1[Federal Government] may make rules for carrying out the\npurposes of this Act."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. (Repeal.) Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of",
      "content": "1981), s. 3 and II Sch.\n1\nSubs. by F.A.O., 1975, Art. 2 and Table.\n(See sections 2 and 3)\nARTICLE 1\nScope"
    }
  ],
  "definitions": []
}
