{
  "id": "pk-united-nations-privileges-and-immunities-act-1948",
  "type": "statute",
  "title": "United Nations (Privileges and Immunities) Act, 1948",
  "title_en": "United Nations (Privileges and Immunities) Act, 1948",
  "short_name": "UNAIA",
  "status": "in_force",
  "issued_date": "1948-06-15",
  "in_force_date": "1948-06-15",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-ap%2BUaA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of United Nations (Privileges and Immunities) Act, 1948 (XX of 1948) published by The Pakistan Code (International Laws).",
  "provisions": [
    {
      "provision_ref": "sec1948",
      "section": "1948",
      "title": "Section 1948. 2. Conferment on United Nations and its representatives and officers of certain",
      "content": "privileges and immunities. (1) Notwithstanding anything to the contrary contained in any other law,\nImmunities, adopted by the General Assembly of the United Nations on the 13th day of February\n1946, shall have the force of law in Pakistan.\n(2) The 2[Federal Government] may, from time to time, by notification in the official Gazette,\namend the Schedule in conformity with any amendments, duly made and adopted, of the provisions\nof the said Convention set out therein."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Power to confer certain privileges and immunities on other international",
      "content": "organisations and their representatives and officers. Where in pursuance of any international\nAgreement, convention or other instrument it is necessary to accord to any international\norganisation3 and its representatives and officers privileges and immunities in Pakistan similar to\nthose contained in the provision set out in the Schedule, the 2[Federal Government] may, by\nnotification in the official Gazette, declare that the provisions set out in the Schedule shall, subject to\nsuch modifications, if any, as it may consider necessary or expedient for giving effect to the said\nagreement, convention or other instrument apply mutatis mutandis to the international organisation3\nspecified in the notification and its representatives and officers, and thereupon the said provision\nshall apply accordingly and, notwithstanding anything to the contrary contained in any other law,\nshall in such application have the force of law in Pakistan."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to make rules. The 2[Federal Government] may make rules for carrying out the",
      "content": "purposes of this Act.\n__________________\n1\nThis Act has been applied to Baluchistan, see Gaz. of P., 1953, Pt. I, p. 8; and applied also in the Federated Areas of Baluchistan, see Gaz. of P., 1953,\nPt. I, p. 152.\nIt has also been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950).\n2\nSubs. by Federal Adaptation Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table.\n3\nP., 1952, Pt. I. pp. 66-68.\nrepresentatives and officers, see ibid., 1953, Pt. I., p. 146.\nAgency, see ibid., 1965, Pt. I, p. 7.\n1\n(See section 2 and 3)\nSECTION 1. The United Nations shall possess juridical personality. It shall have the\ncapacity:__\n(a) to contract;\n(b) to acquire and dispose of immovable and movable property;\n(c) to institute legal proceedings.\nPROPERTY, FUNDS AND ASSETS\nSECTION 2. The United Nations, its property and assets wherever located and by\nwhomsoever held, shall enjoy immunity from every form of legal process except in so far as in any\nparticular case it has expressly waived its immunity. It is, however, understood that no waiver of\nimmunity shall extend to any measure of execution.\nSECTION 3. The premises of the United Nations shall be inviolable. The property and assets\nof the United Nations, wherever located and by whomsoever held, shall be immune from search,\nrequisition, confiscation, expropriation and any other form of interference, whether by executive,\nadministrative, Judicial or legislative action.\nSECTION 4. The archives of the United Nations, and in general all documents belonging to it\nor held by it, shall be inviolable wherever located.\nSECTION 5. Without being restricted by financial controls, regulations or moratoria of any\nkind,\n(a)        the United Nations may hold funds, gold or currency of any kind and operate\naccounts in any currency ;\n(b)        the United Nations shall be free to transfer its funds, gold or currency from\none country to another or within any country and to convert any currency held\nby it into any other currency.\nSECTION 6. In exercising its rights under section 5 above, the United Nations shall pay due\nregard to any representations made by the Government of any Member in so far as it is considered\nthat effect can be given to such representations without detriment to the interests of the United\nNations.\nSECTION 7. The United Nations, its assets, income and other property shall be:__\n(a)        exempt from all direct taxes; it is understood, however, that the United\nNations will not claim exemption from taxes which are, in fact, no more than\ncharges for public utility services;\n1\nThis Schedule has been made applicable, mutatis mutandis, to the International Organization for Migration (I.O.M) vide SRO 66(KE)/2001, dt 26-12-\n2000.\n(b)     exempt from customs duties and prohibitions and restrictions on imports and\nexports in respect of articles imported or exported by the United Nations for\nits official use. It is understood, however, that articles imported under such\nexemption will not be sold in the country into which they were imported\nexcept under conditions agreed with the Government of that country;\n(c)     exempt from customs duties and prohibitions and restrictions on imports and\nexports in respect of its publications.\nSECTION 8. While the United Nations will not, as a general rule, claim exemption from\nexcise duties and from taxes on the sale of movable and immovable property which form part of the\nprice to be paid nevertheless when the United Nations is making important purchases for official use\nof property on which such duties and taxes have been charged or are chargeable, Members will,\nwhenever possible, make appropriate administrative arrangements for the remission or return of the\namount of duty or tax.\nSECTION 9. The United Nations shall enjoy in the territory of each Member for its official\ncommunications treatment not less favourable than that accorded by the Government of that Member\nto any other Government including its diplomatic mission in the matter of priorities, rates and taxes\non mails, cables, telegrams, radiograms, telephotos, telephone and other communications; and press\nrates for information to the press and radio. No censorship shall be applied to the official\ncorrespondence and other official communications of the United Nations.\nSECTION 10. The United Nations shall have the right to use codes and to despatch and\nreceive its correspondence by courier or in bags, which shall have the same immunities and\nprivileges as diplomatic couriers and bags.\nSECTION 11. Representatives of Members to the principal and subsidiary organs of the\nUnited Nations and to conferences convened by the United Nations, shall, while exercising their\nfunctions and during their journey to and from the place of meeting, enjoy the following privileges\nand immunities:__\n(a)     immunity from personal arrest or detention and from seizure of their personal\nbaggage, and, in respect of words spoken or written and all acts done by them\nin their capacity as representatives, immunity from legal process of every\nkind;\n(b)     inviolability for all papers and documents;\n(c)     the right to use codes and to receive papers or correspondence by courier or in\nsealed bags;\n(d)    exemption in respect of themselves and their spouses from immigration\nrestrictions, aliens registration or national service obligations in the state they\nare visiting of through which they are passing in the exercise of their\nfunctions;\n(e)    the same facilities in respect of currency or exchange restrictions as are\naccorded to representatives of foreign governments on temporary official\nmissions;\n(f)    the same immunities and facilities in respect of their personal baggage as are\naccorded to diplomatic envoys; and also\n(g)    such other privileges, immunities and facilities not inconsistent with the\nforegoing as diplomatic envoys enjoy, except that they shall have no right to\nclaim exemption from customs duties on goods imported (otherwise than as\npart of their personal baggage) or from excise duties or sales taxes.\nSECTION 12. In order to secure, for the representatives of Members to the principal and\nsubsidiary organs of the United Nations and to conferences convened by the United Nations,\ncomplete freedom of speech and independence in the discharge of their duties, the immunity from\nlegal process in respect of words spoken or written and all acts done by them in discharging their\nduties shall continue to be accorded, notwithstanding that the persons concerned are no longer the\nrepresentatives of Members.\nSECTION 13. Where the incidence of any form of taxation depends upon residence, periods\nduring which the representatives of Members to the principal and subsidiary organs of the United\nNations and to conferences convened by the United Nations are present in a state for the discharge of\ntheir duties shall not be considered as periods of residence.\nSECTION 14. Privileges and immunities are accorded to the representatives of Members\nnot for the personal benefit of the individuals themselves but in order to safeguard the independent\nexercise of their functions in connection with the United Nations. Consequently a Member not only\nhas the right but is under a duty to waive the immunity of its representative in any case where in the\nopinion of the Member the immunity would impede the course of justice, and it can be waived\nwithout prejudice to the purpose for which the immunity is accorded.\nSECTION 15. The provisions of sections 11, 12 and 13 are not applicable as between a\nrepresentative and the authorities of the state of which he is a national or of which he is or has been\nthe representative.\nSECTION 16. In this Article the expression “representatives” shall be deemed to include all\ndelegates, deputy delegates, advisers, technical experts and secretaries of delegations.\nSECTION 17. The Secretary-General will specify the categories of officials to which the\nprovisions of this Article and Article VII shall apply. He shall submit these categories to the General\nAssembly. Thereafter these categories shall be communicated to the Governments of all Members.\nThe names of the officials included in these categories shall from time to time be made known to the\nGovernments of Members.\nSECTION 18. Officials of the United Nations shall:―\n(a)     be immune from legal process in respect of words spoken or written and all\nacts performed by them in their official capacity;\n(b)     be exempt from taxation on the salaries and emoluments paid to them by the\nUnite Nations;\n(c)     be immune from national service obligations;\n(d)     be immune, together with their spouses and relatives dependent on them, from\nimmigration restrictions and alien registration;\n(e)     be accorded the same privileges in respect of exchange facilities as are\naccorded to the officials of comparable ranks forming part of diplomatic\nmissions to the Government concerned;\n(f)     be given, together with their spouses and relatives dependent on them,\nthe same repatriation facilities in time of international crisis as\ndiplomatic envoys;\n(g)     have the right to import free of duty their furniture and effects at the\ntime of first taking up their post in the country in question.\nSECTION 19. In addition to the immunities and privileges specified in section 18, the\nSecretary-General and all Assistant Secretaries-General shall be accorded in respect of\nthemselves their spouses and minor children, the privileges and immunities, exemptions and\nfacilities accorded to diplomatic envoys, in accordance with international law.\nSECTION 20. Privileges and immunities are granted to officials in the interests of the\nUnited Nations and not for the personal benefit of the individuals themselves. The Secretary-\nGeneral shall have the right and the duty to waive the immunity of any official in any case\nwhere, in his opinion, the immunity would impede the course of justice and can be waived\nwithout prejudice to the interests of the United Nations. In the case of the Secretary-General,\nthe Security Council shall have the right to waive immunity.\nSECTION 21. The United Nations shall co-operate at all times with the appropriate\nauthorities of Members to facilitate the proper administration of justice, secure the\nobservance of police regulations and prevent the occurrence of any abuse in connection with\nthe privileges, immunities and facilities mentioned in this Article.\nSECTION 22. Experts (other than officials coming within the scope of Article V)\nperforming missions for the United Nations shall be accorded such privileges and immunities\nas are necessary for the independent exercise of their functions during the period of their\nmissions, including the time spent on journeys in connection with their missions. In\nparticular they shall be accorded:\n(a)     immunity from personal arrest or detention and from seizure of their personal\nbaggage;\n(b)    in respect of words spoken or written and acts done by them in the course of\nthe performance of their mission’ immunity from legal process of every kind.\nThis immunity from legal process shall continue to be accorded\nnotwithstanding that the persons concerned are no longer employed on\nmissions for the United Nations;\n(c)    inviolability for all papers and documents;\n(d)    for the purpose of their communications with the United Nations, the right to\nuse codes and to receive papers or correspondence by courier or in sealed\nbags;\n(e)    the same facilities in respect of currency or exchange restrictions as are\naccorded to representatives of foreign governments on temporary official\nmissions;\n(f)    the same immunities and facilities in respect of their personal baggage as are\naccorded to diplomatic envoys.\nSECTION 23. Privileges and immunities are granted to experts in the interests of the United\nNations and not for the personal benefit of the individuals themselves. The Secretary-General shall\nhave the right and the duty to waive the immunity of any expert in any case where, in his opinion, the\nimmunity would impede the course of justice and it can be waived without prejudice to the interests\nof the United Nations.\nSECTION 24. The United Nations may issue United Nations laissez-passer to its officials.\nThese laissez-passer shall be recognized and accepted as valid travel documents by the authorities of\nMembers, taking into account the provisions of section 25.\nSECTION 25. Applications for visas (where required) from the holders of United Nations\nlaissez-passer, when accompanied by a certificate that they are traveling on the business of the\nUnited Nations, shall be dealt with as speedily as possible. In addition, such person shall be granted\nfacilities for speedy travel.\nSECTION 26. Similar facilities to those specified in section 25 shall be accorded to\nexperts and other persons who, though not the holders of United Nations laissez-passer, have\na certificate that they are travelling on the business of the United Nations.\nSECTION 27. The Secretary-General, Assistant Secretaries-General and Directors\ntraveling on United Nations laissez-passer on the business of the United Nations shall be\ngranted the same facilities as are accorded to diplomatic envoys.\nSECTION 28. The provisions of this Article may be applied to the comparable\nofficials of specialized agencies if the agreements for relationship made under Article 63 of\nthe Charter so provide.\nSECTION 29. The United Nations shall make provisions for appropriate modes of\nsettlement of:\n(a)    disputes arising out of contracts or other disputes of a private law\ncharacter to which the United Nations is a party;\n(b)    disputes involving any official of the United Nations who by reason of\nhis official position enjoys immunity, if immunity has not been waived\nby the Secretary-General.\nSECTION 30. All differences arising out of the interpretation or application of the\npresent Convention shall be referred to the International Court of Justice, unless in any case\nit is agreed by the parties to have recourse to another mode of settlement. If a difference\narises between the United Nations on the one hand and a Member on other hand, a request\nshall be made for an advisory opinion on any legal question involved in accordance with\nArticle 96 of the Charter and Article 65 of the Statute of the Court. The opinion given by the\nCourt shall be accepted as decisive by the parties.\n__________\n17823\nDate: 29-05-2025"
    }
  ],
  "definitions": []
}
