{
  "id": "pk-united-nations-security-council-act-1948",
  "type": "statute",
  "title": "United Nations (Security Council) Act, 1948",
  "title_en": "United Nations (Security Council) Act, 1948",
  "short_name": "UNCA",
  "status": "in_force",
  "issued_date": "1948-06-10",
  "in_force_date": "1948-06-10",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npappm-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of United Nations (Security Council) Act, 1948 (XIV of 1948) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Measures under Art. 41 of the Charter of the United Nations.― If, under Article 41 of the",
      "content": "Charter of the United Nations signed at San Francisco on the 26th day of June 1945, the Security\nCouncil of the United Nations calls upon the 2[Federal Government] to apply any measures, not\ninvolving the use of armed force, to give effect to any decision of that Council, the 2 [Federal\nGovernment] may, by order published in the official Gazette, make such provisions (including\nprovisions having extra-territorial operation) as appear to it necessary or expedient for enabling those\nmeasures to be effectively applied.3[* *     *       *      *       *      *]\n4\n[3.Indemnity.―No suit, prosecution or other legal proceedings shall lie against any person in\nrespect of anything which is in good faith done or intended to be done under this Act."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to make rules.―The Federal Government may, by notification in the official Gazette,",
      "content": "make rules for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Delegation.―The Federal Government may, by order, delegate to a Pakistani person, entity",
      "content": "or authority, subject to such conditions as may be specified therein, all or any of the powers exercisable\nby it under this Act.]\n__________\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1947, Pt., V.p.271\nThis Act has been applied to Baluchistan, see Gaz. of P., 1953, Pt. I,p. 8 and also applied in the Federated Areas of Baluchistan, see Gaz. of P.1953, Pt. I, p."
    },
    {
      "provision_ref": "sec152",
      "section": "152",
      "title": "Section 152. It has also been extended to the Leased Areas of Baluchistan, see the Leased Areas (Law) Order, (G.G.O.3 of 1950.)",
      "content": "2\nSubs. By F.A.O 1975, Art. 2 and Table, for “Central Government”.\n3\nOmitted vide amendment United Nations (Security Council) (Amendment) Act, 2020 dated 31 July 2020 (ACTXXI of 2020) “and without prejudice to the\ngenerality of the foregoing power, provision may be made for the punishmentof persons offending against the order”.\n4\nInserted vide amendment United Nations (Security Council) (Amendment) Act, 2020(ACTXXI of 2020 dated 31 July 2020"
    }
  ],
  "definitions": []
}
