{
  "id": "pk-vagrancy-capital-of-the-federation-act-1950",
  "type": "statute",
  "title": "Vagrancy (Capital of the Federation) Act, 1950",
  "title_en": "Vagrancy (Capital of the Federation) Act, 1950",
  "short_name": "VOTFA",
  "status": "in_force",
  "issued_date": "1950-10-22",
  "in_force_date": "1950-10-22",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2NpaJdj-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Vagrancy (Capital of the Federation) Act, 1950 (LXXIV of 1950) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "_ (1) This Act may be called the\nVagrancy 2[Karachi Division] Act, 1950.\n(2) It extends to the 2[Karachi Division].\n(3) It shall come into force on such day3 as the 4[Federal Government] may, by\nnotification in the official Gazette, appoint."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or",
      "content": "context,___\n(1) “Child” means a person who has not completed his fourteenth year and is neither a\ncontagious leper nor a lunatic;\n(2) “Old, disabled or infirm” means and includes a person who by reason of age,\ndisease, affliction, or physical or\n1\nFor Statement of Objects and Reasons, see Gaz. of P.,1950, Pt. V, p. 283.\n2\nSubs. by A. O.,1964, Art. 2 and Sch., for “Federal Territory of Karachi” which had been subs. by the Repealing and Amending Ordinance,\n1961 (1 of 1961), s. 3 and 2nd Sch., for “Capital of the Federation”.\n3\nThe 15th February 1951, see Gaz. of P., Ext.,1951, p. 43.\n4\nSubs. by F.A.O. 1975, Art. 2 and Table for “Central Government”\nmental defect is, in the opinion of the Court, not capable of earning his livelihood and is\nneither a contagious leper nor a lunatic;\n(3) “Poor House” means a house or institution for the detention and maintenance of\nvagrants who are children or old, disabled and infirm persons, and set up for the purpose by\nthe 1[Federal Government] or any private person or persons;\n(4) “Prescribed” means prescribed by rules made under this Act;\n(5) “Public place” includes a railway train or any motor vehicle or carriage;\n(6) “Special Magistrate” means a Magistrate empowered under section 3;\n(7) “Vagrant” means a person of any age or either sex who___\n(a)        solicits or receives alms in a public place;\n(b)        enters on any private premises without the permission of the occupier for the\npurpose of soliciting or receiving alms\n(c)        exposes or exhibits with the object of obtaining alms any sore, wound, injury,\ndeformity or disease;\n(d)        has no ostensible means of subsistence or no fixed abode and is or remains in\nany public place in such condition or manner as makes it likely that he lives by\nsoliciting or receiving alms; or\n(e)        allows himself to be exhibited for the purpose of soliciting or receiving alms;\nbut does not include a person who____\n(i)        solicits or receives alms in any place of Hindu worship, or\n1\nSubs. by F.A.O. 1975, Art. 2 and Table for “Central Government”.\n(ii)       solicits or receives money, food or gifts in accordance with any religious\nusage or for a purpose authorised by any law or authorised in the prescribed\nmanner by the 1[Provincial Government]:\nProvided that on the application of the trustee or trustees of any place\n1\nof Hindu worship, the                       [Provincial Government] may, in the manner\nprescribed, direct that \"vagrant\" shall include a person who solicits or receives\nalms in such place."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Special Magistrate. The 1[Provincial Government] may empower any Magistrate",
      "content": "of the First Class as a Special Magistrate for the purposes of this Act."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power of arrest",
      "content": "_ (1) Any police officer authorised in this behalf in pursuance of\na direction of the 1[Provincial Government] may arrest without warrant any person who\nappears to him to be a vagrant:\nProvided that no such person shall be so arrested if he furnishes bail for appearance\nbefore the Special Magistrate.\n(2) The police officer making the arrest shall, without unnecessary delay, take or send\nthe person so arrested to a Special Magistrate.\n(3) The provisions of section 61 of the Code of Criminal Procedure, 1898 (V of\n1898), shall apply to every person arrested under this section and the custody in which he\nmay be detained until he is brought before the Special Magistrate shall be such as may be\nprescribed.\n1\nSubs. by A.O., 1964, Art. 2 and Sch., for “Central Government”."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Declaration of persons as vagrants",
      "content": "_ (1) When a person is brought before a\nSpecial Magistrate under section 4, the Special Magistrate shall make a summary inquiry into\n(2) If the enquiry referred to in sub-section (1), cannot be completed forthwith, the\nSpecial Magistrate may adjourn it from time to time and order the person to be remanded for\nnot longer than 7 days at a time to such place and custody as may be prescribed.\n(3) If on completing an inquiry under this section, the Special Magistrate is not\nsatisfied that such person is a vagrant, he shall order him to be released forthwith.\n(4) If on completing the inquiry the Magistrate is satisfied that such person is a\nvagrant, he shall make a declaration to that effect and shall further inquire whether the said\nvagrant is a child, or an old, disabled or infirm person within the meaning of this Act."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Detention of vagrants",
      "content": "_ (1) A person declared a vagrant under the preceding\nsection shall, if upon the further enquiry required by sub-section (4) of that section he is\nfound to be neither a child nor an old, disabled or infirm person, be liable to be ordered to be\ndetained.\n(2) Such detention may, upon a first declaration of vagrancy, extend to a period not\nexceeding one month, and upon any subsequent declaration to a period not exceeding six\nmonths.\n(3) So long as there remains in force in respect of any person an order under this\nsection directing that he be detained, he shall be liable to be detained in such place and under\nsuch conditions, including conditions as to maintenance, discipline and punishment of\noffences and breaches of discipline as the 1[Provincial Government] may from time to time\nspecify, and discipline shall include the imposition of manual and such other work as may be\nprescribed..\n1\nSubs. by A. O., 1964, Art. 2 and Sch., for “Central Government”."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Detention in the Poor House",
      "content": "_ (1) Any person declared a vagrant under section 5\nand found in the further enquiry required by sub-section (4) of that section to be a child or an\nold, disabled or infirm person, shall be so certified by the Special Magistrate and be ordered\nto be detained in a Poor House.\n(2) Any person ordered to be detained under this section shall be sent under police\ncustody to a Poor House, along with the said certificate of which a copy shall be sent to the\n1\n[Provincial Government], and there detained until he is discharged in accordance with the\nprovisions of section 11."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Dependent children. When in respect of any vagrant a certificate has been issued",
      "content": "under sub-section (1) of section 7 and there is any child, being a child within the meaning of\nthis Act, dependent on him, the Special Magistrate may direct that such child may also be\nsent to the Poor House."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Externment of vagrant.",
      "content": "__ (1) If in the course of the further inquiry required by\nsub-section (4) of section 5 it appears to the Special Magistrate that the person declared a\nvagrant under that section belongs to any territory outside the 2[Karachi Division], he may,\ninstead of proceeding under section 6 or section 7, by order in writing direct the vagrant to\nleave the 2[Karachi Division] with such children dependent on him as may be named in the\norder and within such time and by such route as may be stated in the order and not to return\nthither without his permission in writing.\n(2) When a vagrant against whom an order has been made under sub-section (1)\nfails to comply with such order or returns to the 3 [Division] without the permission in\nwriting of the Special Magistrate, he may be arrested without warrant by any police officer\nand shall be liable, on conviction before a Magistrate,\n1\nSubs. by A.O., 1964, Art. 2 and Sch., for “Central Government”.\n2\nSubs. ibid for “Federal Territory of Karachi” which had been subs. by the Repealing and Amending Ordinance, 1961 (1 if 1961), s. 3 and\n2nd Sch., for “Capital of the Federation”.\n3\nSubs. ibid., for “Territory” which had been subs. by the Repealing and Amending Ordinance 1961 (1 of 1961,) s. 3 and 2 nd Sch., for\n“Capital”.\nto be punished with rigorous imprisonment for a term which may extend to one year.\n(3) Nothing in sub-section (2) shall be construed as rendering any child liable to be\nproceeded against thereunder."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Conduct and discipline. A vagrant detained in the Poor House under this Act",
      "content": "shall be subject to such rules of conduct and discipline including the imposition of manual\nand such other work as may be in keeping with his general state of health and as may be\nprescribed."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Discharge from Poor House",
      "content": "_ (1) A vagrant may be discharged from the Poor\nHouse under the written order of the Special Magistrate____\n(a)    if he is satisfied that satisfactory employment has been obtained for the\nvagrant; or\n(b)    that the vagrant has become possessed of an income sufficient to support\nhimself without resort to vagrancy;\n(c)    on a relative of the vagrant, or a person in respect of whom the Magistrate is\nsatisfied that he is interested in the welfare of the vagrant, entering into a bond\nwith or without sureties in such sum as may be prescribed, to look after and\nmaintain the vagrant and to prevent him from resorting to vagrancy;\n(d)    for other good and sufficient reasons to be recorded by the Special Magistrate\nin writing.\n(2) When the employment referred to in clause (a) of subsection (1) is obtained\nfor a vagrant detained in a Poor House, or discharged from a Poor House in order to\ntake up that employment, a vagrant refusing or wilfully neglecting to take up the same\nshall be liable to be punished on conviction\nbefore a Magistrate with rigorous imprisonment for a term which may extend to six months."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Punishment for employing or causing persons to solicit or receive alms",
      "content": "Whoever employs or causes any person to solicit or receive alms, or abets the employment or\nthe causing of a person to solicit or receive alms, or exhibits a person for the purpose of\nsoliciting or receiving alms or whoever having the custody, charge, or care of a child,\nconnives at or encourages the employment or the causing of the child to solicit or receive\nalms shall be liable to be punished on conviction before a Magistrate with rigorous\nimprisonment for a term which may extend to two years or with fine or with both."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Punishment for escape from custody. Any vagrant who escapes from any",
      "content": "custody or detention to which he has been committed under this Act or any rules made\nthereunder may be arrested without warrant and shall for any such offence be liable to be\npunished on conviction before a Magistrate with rigorous imprisonment for a term which\nmay extend to one year."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Prosecution for escape. No prosecution for an offence under section 13 shall be",
      "content": "commenced except by, or with the permission of, such officer as may be authorised in this\nbehalf by the 1[Provincial Government]."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Procedure at end of imprisonment for escape. Every person imprisoned under",
      "content": "the provisions of section 13 shall at the end of his term of imprisonment be sent back, under\npolice custody, to the custody or detention from which he escaped, and there kept for the\npurpose for which he was entrusted to that custody or detention before his escape."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Indemnity. No suit, prosecution or other legal proceeding shall lie against any",
      "content": "person for anything which is in good faith done or intended to be done under this Act or the\nrules made thereunder.\n1\nSubs. by A.O., 1964, Art. 2 and Sch., for “Central Government”."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Appeal. Notwithstanding anything in any other law for the time being in force an",
      "content": "appeal shall lie to the District Magistrate from any conviction or order of detention under this\nAct, and the order of the District Magistrate in appeal shall be final."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Rules",
      "content": "_ (1) The 1[Provincial Government] may make rules2 for carrying out the\npurposes of this Act.\n(2) Without prejudice to the generality of the foregoing power such rules may provide\nfor the conduct and inspection of Poor Houses and the maintenance of persons detained\ntherein."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Delegation of powers. The 1[Provincial Government] may, by notification in the",
      "content": "official Gazette, direct that any power or duty conferred or imposed upon it by or under this\nAct, or any document required by or under this Act to be submitted to it shall be exercised or\nperformed or submitted to, as the case may be, such officer subordinate to it as may be\nspecified in the direction.\n______\n1\nSubs. by A.O. 1964. Art. 2 and Sch. For “Central Government”.\n2\nFor the Vagrancy (Capital of the Federation) Rules, 1951, see Gaz. Of P. Ext., 1951, p. 43."
    }
  ],
  "definitions": []
}
