{
  "id": "pk-virtual-assets-ordinance-2025",
  "type": "statute",
  "title": "Virtual Assets Ordinance, 2025",
  "title_en": "Virtual Assets Ordinance, 2025",
  "short_name": "VAO",
  "status": "in_force",
  "issued_date": "2025-07-07",
  "in_force_date": "2025-07-07",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tlbA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Virtual Assets Ordinance, 2025 (VII of 2025) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec3s",
      "section": "3S",
      "title": "Section 3S. Whistle",
      "content": "blower protection.— (1) A Person who in good faith reports to the\nAuthority a contravention of this Ordinance or any Rules or Regulations made under it shall not\nbe subjected to any form of retaliation.\n(2) The Authority may prescribe a whistle-blower reward scheme by Rules\nwhich shall be consistent with any applicable whistle-blower protection law in Pakistan."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Complaint",
      "content": "handling and dispute-resolution scheme .— (1) Licensees shall\nestablish and maintain internal complaint-handling procedures approved by the Authority.\n~ (2) The Authority may establish or recognize an independent dispute-\nresolution scheme for claims below a Prescribed monetary threshold."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Issuers of initial virtual asset offering",
      "content": "(1) A Person shall not conductor\npurport to conductan Initial Virtual Asset Offering, in or from Pakistan, unless that Virtual Asset\noffering is approved under this Ordinance.\n(2) For avoidance of doubt, a natural Person shall not be eligible to promote\nor conductan Initial Virtual Asset Offering in or from Pakistan.\n(3) A Person desiring to conductor promote an Initial Virtual Asset Offering,\nin or from Pakistan, or trading on a Virtual Asset trading platform shall be in compliance with\nsuch requirements as may be Prescribed by the Authority.\n(4) A Person shall not conductor promote an Initial Virtual Asset Offering, in\n. or from Pakistan, or trading on a Virtual Asset trading platform unless it has submitted to the\nAuthority an application in compliance with subsection (3) and the Authority has notified the\nPerson, in writing, that it has no objection to the issuance.\npe h:\nJorn OF PAKISTAN, EXTRA JULY 9.2025 |\nsu tun oAZTIEO PARES Smeets ey\nES ol it object m wy;\n§) Notwithstanding subsection (4), gmp y eid pei WIRE md\n( + or actions be taken after issuance has commenced, where\nrequire that such measures ¢ NEI\n) the manner in which the issuance abv fick comistent » i\n(e the information provided in the application;\n(b) the description, nature of characteristics of the Initial Virtual Asset\nOffering material deviates from the description prided 5 g,\napplication;\n(c) the Issuer is a Person that was not disclosed in the application,\n(d) the target investor base is different from that disclosed 3, fhe\napplication; ;\n(¢) the relevant regulatory authority has reason to believe that the Issue i;\nmis selling the initial Virtual Assets offering; or\n(f) the issuance is undertaken in a manner detrimental to the puty;,\n: interest.\n(6) Any Person who, in connection with the application, supplies fhe\nAuthority with information he or she knows or should reasonably know: is false or misleading\ncommits an offence and is liable on conviction to such fines as provided under section 350,\n(7) A Person who contravenes the provisions of subsection (1), (2), (3)and (4)\ncommits an offence and is liable on conviction to imprisonment for a term of 7 years, fine of\nboth.\nPART VII: ANTI-MONEY-LAUNDERING, COUNTER-TERRORIST FINANCING"
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Application of anti",
      "content": "money laundering act, 2010.— (1) For the purposes of the\nAnti-Money Laundering Act, 2010, Virtual Asset Service Providers licensed under this\nOrdinance shall be deemed to be designated non-financial businesses and professions and shall\ncomply with all obligations thereunder.\n(2) Without prejudice to the generality of subsection ( 1), every Virtual Asset\nService Provider licensed under this Ordinance shall, in accordance with the requirements of the\nAnti-Money Laundering Act, 2010, and any Rules, Regulations, or guidelines issued by the\nFinancial Monitoring Unit;\n(2) report suspicious transactions to the Financial Monitoring Unit. The\nAuthority may, in consultation with the Financial Monitoring Unit,\nissue further guidance on indicators of suspicious activity specific to\n; ity spe\nVirtual Asset transactions;\n| J\nPaRrl] THE GAZETTE OF PAKISTAN, EXTRA, JULY 9, 2025 555\nBRR\n(® maintain records of customer due diligence, transactions, and other\nrelevant information for the Prescribed period; and\n(©) establish and maintain intemal controls and compliance programs,\nincluding the appointment of a compliance officer, to prevent money\ny laundering and terrorist financing.\n©) The Authority shall align its AML/CFT requirements with the standards\nestablished by the Financial Action Task Force (FATF) and may issue additional guidance to\n© ensure compatibility with intemational compliance norms.\n: 39. Travel tule and record-keeping obligations— (1) A Licensee shall obtain,\nhold, and a originator and beneficiary information in any transfer of Virtual Assets\nmeeting or exceeding the threshold Prescribed by the Authority, in a manner consistent with\n. the standards set out in Recommendation 16 of the Financial Action Task Force (FATF), as\nupdated from time to time. :\n(2) A Licensee shall maintain records of transactions, customer due-diligence\nand risk assessments for a minimum period of seven years."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Real",
      "content": "time regulator access and reporting — (1) Licensees shall establish secure\nautomated interfaces enabling the Authority, the State Bank of Pakistan, the Securities and\nExchange Commission of Pakistan, the Federal Investigation Agency and the Federal Board of :\nRevenue and all other relevant agencies and authorities as may be notified by the Authority to\naccess Prescribed data in real time or near real time.\n(2) The Authority shall specify the technical standards and data scheme for\nthe interfaces referred to in subsection (1)."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Cyber",
      "content": "security and operational-resilience standards.— (1) Licensees shall\ncomply with the cyber-security framework issued by the Authority in consultation with the\nrelevant agencies and/or authorities.\n© (2) A material cyber incident shall bs reported to the Authority without delay\nand in any case not later than twenty-four hours from the time of its discovery.\nPART VIII: INNOVATION SANDBOX AND NO-ACTION RELIEF"
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Establishment and objectives of the sandbox",
      "content": "The Authority shall establish\nand operate a regulatory sandbox for the purpose of fostering responsible innovation in Virtual\nAsset products and services within a controlled environment. :"
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Eligibility, application and supervisory agreement",
      "content": "(1) An applicant seeking\nentry into the sandbox shall submit a detailed application to the Authority, providing\n. | Lp dE BRR ea LT is pti i\ni\n556 THE GAZETTE OF PAKISTAN, EXTRA., JULY 9, 2025 [PART |\n) : n od i ion, its anticipated benefit; :\n© comprehensive information regarding the propoues A its anticipated benefits, Potenti)\nrisks, proposed mitigation measures, and a clear exit strategy.\n@ Applicants who are deemed suitable for participation in the sandbox shal]\nAer into a formal supervisory agreement with the Authority, which shall specify the Precise\nenter A TOL # he \" n . ‘\nparameters and conditions goveming the testing of the innovation."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Duration, limits and exit of sandbox testing",
      "content": "(1) The duration of any testing\nwithin the sandbox shall not exceed a period of eighteen months from the date of\ncommencement, unless otherwise determined by the Authority.\n(2) The Authority may, at its discretion, impose limits on transaction, the\nnumber of customers involved in the testing, or the overall financial exposure arising from fp,\nsandbox activities. N\n(3) Upon the conclusion of the sandbox testing period, the participant shal], 5\ndirected by the Authority, either transition to obtaining a full license under this Ordinance, -\ndiscontinue the Virtual Asset Service that was the subject of the test, or take such other steps a\nthe Authority may direct or deem necessary."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. No",
      "content": "action relief and transitional arrangements. — (1) The Authority may issye\na no-action letter stating that it does not intend to take enforcement action in respect of specified\nconduct for a defined period. :\n(2) The issuance of a no-action letter shall not constitute a legal immunity,\nand the Authority reserves the right to withdraw such a letter at any time by providing written\nnotice.\nPART IX: ENFORCEMENT, OFFENCES AND PENALTIES"
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Investigatory powers",
      "content": "(1) For the purpose of ascertaining compliance with this\nOrdinance the Authority may—\n(a) enter and inspect any premises used in connection with a |\nVirtual Asset Services; :\n(b) examine and take copies of books, records and data;\n~ (¢) summon and examine any Person acquainted with the facts and\ncircumstances of the matter; or :\n(d) apply to the relevant authority for a warrant to search and seize evidence of\nan offence.\n[ -\n|\nPART | THE GAZE) OF pAk|\nee T———— IST 3\nAN, EXTRA, JuLy 9,2025 557\n(2) Where the Authority -\nLl 5 A W o ‘ add i\naie 5 Biles the a hte Zr result of ap Investigation, has reasonable\n: ** this Ordinance hag been comm: i\ncriminal complaint in Writing before 4 court of ance has been committed, it may file a\nwok . OF competent jurisdiction in acc i\nCods of Criminal Provedurs, 1395 petent jurisdiction in accordance with fhe"
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Administrative gape",
      "content": "ons, — ‘ . .\nhas contravened this Ordinance on emia Where the Authority is satisfied that a Person\nof tote OF 118 fullowlig sanatiogs. 100s made under it, the Authority may impose one\na 1a : P :\n®) issue a written reprimand or public censure;\n(®) issue a direct; fas\na directive requiring the Person to cease or take specified measures\n. to remedy the contravention;\nCc i i\n(c) pi a financial penalty not exceeding the higher of one hundred\nttlion Pakistani Rupees (PKR 100,000,000) or five percent (5%) of the\n) Virtual Asset Service Provider’s annual turnover;\n(d) suspend or revoke any license issued to the Virtual Asset Service Provider.\nunder this Ordinance; or\n(©) disqualify any Person from holding any office or position of responsibility\nin a Virtual Asset Service Provider licensed under this Ordinance. |\n3 2) Where the Authority is satisfied that an Issuer has contravened any\nprovision of Sections 33 or 37 of this Ordinance, or any Regulations made thereunder, the\nAuthority may impose one or more of the sanctions listed in subsection (1), with such\nmodifications as may be appropriate, including—\n(@) a financial penalty not exceeding the higher of one hundred million\nPakistani Rupees (PKR 100,000,000) or five percent (5%) of the total\nvalue of the Virtual Asset offering;\n(b) a public directive requiring correction, retraction, or clarification of false\nor misleading statements;\n(¢) aban or restriction on the Issuer from making further public offerings of\n+ Virtual Assets for a specified period;\n(d) disqualification of responsible individuals from participating in the\nmanagement or governance of Virtual Asset Service Providers or Issuers;\nor :\n(e) suspension or revocation of any prior approval granted under Section 37.\nie\n\\W THE GAZETTE OF PAKISTAN EXTRA UY 90008 (Fae |\nBC Bmore) Iterventbon pemers (1) Ba the event of a aysteri thoes. market\napelin, Bad wn abereomity beach the Authority may ome ot order teemperaniy\nwanpending speceiod Vinal Asse Services of Trees ing related svete Tor & periond not ¢ coeeding\nBarty dave\n(3 Nach onder shall be subject to review by the Vietwal Assets Appetite\nTribunal won appli ston by an aggrieved party\nOA OW penalties (1) The Authority may, in addition to or mn lew of\nadministrative sanctions, apply to the Court having jurisdiction for the imposition of # evil\nPenalty a applicable under the Code of Civil Procedure, 1908 in tespect of any contravention of\n(@) The court may order restitution of profits and grant such other rehef as it ’\nmay deem appropriate.\nSL Criminal offences. (1) A Person who willfully provides an unlicensed Virtual g\nAsset Service commits an offence and is liable on conviction to imprisonment for a term not\nexceeding seven years, or a fine not exceeding fifty million Pakistani Rupees, or both.\n(2) A Person who knowingly makes any false or misleading statement in any\napplication, retum or document submitted to the Authority commits an offence and is liable on\nvonviction to imprisonment for a term not exceeding three years, or a fine not exceeding twenty\nmillion Pakistani Rupees, or both.\n(3) Any Person who obstructs an officer of the Authority in the exercise of\npowers under this Ordinance commits an offence and is liable on conviction to imprisonment\nfor a term not exceeding two years, or a fine not exceeding ten million Pakistani Rupees, or\nboth,\n(4) ~~ Where a Virtual Asset Service Provider contravenes any provision of the\nAnti-Money Laundering Act, 2010, or the Rules, Regulations, or guidelines made thereunder,\nsuch contravention shall be punishable in accordance with the penalties Prescribed under the\nsaid Ordinance, in addition to any regulatory action under this Ordinance.\n(8) Notwithstanding anything contained in this Ordinance, all offences\npunishable under this Ordinance shall be investigated, tried, and punished in accordance with\nunless otherwise provided in this Ordinance or the Rules or Regulations made thereunder.\n(6) The Federal Govemment may, by notification in thé official Gazette,\ndesignate one or more special courts or judicial forums to exercise jurisdiction over offences\nunder this Ordinance. Until such time, jurisdiction shall lic with the courts empowered to try\noffences under the Code of Criminal Procedure, 1898.\n§1. Liability of officers of bodies corporate— Where an offence under this\nOrdinance is committed by a body corporate with the consent, connivance or neglect of any\n5 1\nt\n&\ndirector, manager, secretary or similar officer, such Person shall be deemed to have committed\nthe offence.\n| 52. org and appeals to virtual assets appellate tribunal.— (1) A Virtual\n| Assets Appel ate. ri unal shall be established and no court shall take cognizance of a legal\n| dispute under this Ordinance or the Rules or Regulations made thereunder to which the\njurisdiction of the Virtual Assets Appellate Tribunal extends. An appeal can be filed on a\n| decision of the Virtual Assets Tribunal as set forth in section 53 of this Ordinance.\nI clon 2) Notwithstanding anything contained here, the Federal Government may,\nby notification in the official Gazette, desi gnate an existing tribunal established under any other\nlaw to exercise the powers and. perform the functions of the Virtual Assets Appellate Tribunal\nunder this Ordinance. x\n(3) Any Virtual Asset Service Provider, Licensee, or any other Person\n§ aggrieved byan order of the Authority may prefer an appeal before the Virtual Assets Appellate\nTribunal within thirty days of the date on which the order was communicated, in accordance\nwith the PrescribedRules.\n(4) An appeal to the Virtual Assets Appellate Tribunal shall be in such form,\ncontain such particulars, and be accompanied by such documents and fees as may be Prescribed\nunder this Ordinance. .\n(5) The Virtual Assets Appellate Tribunal shall consist of a presiding officer,\nwho shall be a legal expert, and two members, one being a technical expert and the other being\n; a financial expert, who shall be Persons of ability, integrity, and have special knowledge and\nprofessional experience of not less than ten years in the fields of law, technology, finance, or .\n€conomics.\n(6) The presiding officer and members of the Virtual Assets Appellate\nTribunal shall be appointed by the Federal Government, in the manner Prescribed, and hold\noffice for a period of three years and shall be eligible for re-appointment for a similar term or :\nterms and shall cease to hold office on attaining the age of sixty-eight years or the expiry of the\nterm, whichever is earlier. :\n(7) The terms, conditions, and appointment of the Virtual Assets Appellate\nTribunal presiding officer and other members shall be in the manner Prescribed by the Federal\nGovernment.\n(8) The presiding officerand the members shall be entitled to such salary and\nother terms and conditions of service as the Federal Government may prescribe.\n(9) The Virtual Assets Appellate Tribunal shall decide an appeal\nexpeditiously but not later than three months of its presentation to the Tribunal.\n|\nCB ARISTAN. EXTRA. JULY 9, 2025 PART |\n560 THE GAZETTE OF PAKISTAN, EX RA\n: ; deciding an\n; + Tribunal shall, for the purpose of deciding\n» Virtual Assets Appellate 1 oe :\n(10) w vil court and shall have the same powers as are vested in such court\nappeal, be deemed to be a civil © * of 1908), including the powers of —\nunder the Code of Civil Procedure, 1908 (Act v8 bp th;\n(a) enforcing the attendance of any Person and examining him on oath;\n(b) compelling the production of documents; and\n(c) issuing commissions for {he examination of witnesses and documents.\ns (11) It shall be sufficient for the Virtual Assets Appellate opr to i\nor to be satisfied as to any matter on the standard of proof applicable to civil proceeding\nsummary manner in a court of law. ’\n(12) The Virtual Assets Appellate Tribunal’s determinations or decisions vor .\nthis Ordinance shall be deemed to be the decrees of a civil court under the Code of Civi\nProcedure, 1908 (Act V of 1908). . ."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Appeal to supreme court",
      "content": "Any Person aggrieved by an order of the Virtual\nAssets Appellate Tribunal may prefer an appeal to the Supreme Court of Pakistan within sixty\ndays under the RulesPrescribed by the Supreme Court.\n: * PART X: TAXATION AND AUDIT CO-OPERATION"
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Reporting to federal board of revenue",
      "content": "Every Virtual Asset Service Provider\nlicensed under this Ordinance shall comply with the obligations for tax withholding and the\nfiling of information returns as Prescribed under the Income Tax Ordinance, 2001 and any Rules\nor Regulations issued by the Federal Board of Revenue in relation to transactions involving\nVirtual Assets and the income of the Virtual Asset Service Provider.\n: PART XI: ISLAMIC-FINANCE AND SHARIAH COMPLIANCE\n; 55. Role of shariah advisory committee.— (1) The Authority shall constitute a\nShariah Advisory Committee of such composition and in such mode and manner as may be\nPrescribed by Rules. fib\n(2) The Shariah Advisory Committee shall advise the Authority on Shariah\ncompliance of Virtual Asset products and services.\n(3) The rulings issued by the Shariah Advisory Committee on designated |\nIslamic products shall be binding on Licensees offering or dealing with such products.\nni |\nPART 1] OF PAK |g\n: TAN EXTRA, JULY 9,2025 561"
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. Certification of shay,",
      "content": ") h ~¢om\n© may submit an application to the Authorit fous Virtual asset products. - (1) A Licensee\nghariah-compliant, Y Tor certification that a Virtual Asset product is\n(2) The Author\nY ma a saaiithe it 4\nconditions and ongoing review ag the plan such certification subject to such terms and\nghariah Advisory Committee, y may deem appropriate in consultation with the\n0 PART XII: MISCELLANEOUS"
    },
    {
      "provision_ref": "sec57",
      "section": "57",
      "title": "Section 57. owers to make rules, Ty, A",
      "content": "y— e A ’\nGovernment, make Rules as deemed necessary a with the approval of the Federal\npurposes of this Ordinance, implementation of and to carry out the\n4 58. P I]\nNL ky to make regulations. — The Authority may make Regulations as deemed\nnecessary plementation of and to carry out the purposes of this Ordinance."
    },
    {
      "provision_ref": "sec59",
      "section": "59",
      "title": "Section 59. Bar of jurisdiction",
      "content": "Notwithstanding anything contained in any other law for\nunder this Ordinance or Rules or Regulations made thereunder shall be questioned by any\ner Aalenged 1h any court or tribunal, nor shall any injunction be granted against such\ndecisions or actions."
    },
    {
      "provision_ref": "sec60",
      "section": "60",
      "title": "Section 60. Transitional provisions",
      "content": "(1) Until such time that the Pakistan Virtual Asset\nRegulatory Authority is formally notified and operational under this Ordinance, the Federal\nGovernment may, by notification in the official Gazette, designate any existing Division,\nregulatory authority, or body corporate to perform the functions, exercise the powers, and\ndischarge the responsibilities assigned to the Authority under this Ordinance.\n(2) Any Person who is providing Virtual Asset Services immediately before\ncommencement, either apply to the Authority or designated authority for a license under this\nOrdinance or cease to carry on such service. -\n3) During the transitional period specified in subsection (1), any Person\n®) y\n: providing Virtual Asset Services shall comply with directions issued by the designated Division,\nregulatory authority, or body acting on behalf of the Authority."
    },
    {
      "provision_ref": "sec61",
      "section": "61",
      "title": "Section 61. Power of the Federal Government to issue policy directives",
      "content": "The Federal\nGovernment may, by notification in the official Gazette, give policy directives to the Authority\n[SSE -\nBa |\n562 THE GAZETTE OF PAKISTAN, EXTRA., JULY 9, 2025 [PART |\nEe AL\nto align its actions with national policies, priorities and interests consistent with the objectives\nand framework established under this Ordinance. Such policy directives shall not impede the\nAuthority's operational autonomy."
    },
    {
      "provision_ref": "sec62",
      "section": "62",
      "title": "Section 62. Removal of difficulties,",
      "content": "If a procedural or operational difficulty arises in\ngiving effect to any of the provisions of this Ordinance, the Federal Government may, within six\nmonths of the commencement of this Ordinance, make such order not inconsistent with the\nprovisions of this Ordinance, as may appear fo it to be necessary or expedient for removing such\ndifficulty.\n\"SCHEDULE 1\n(See section 14)\nThe lst below shall constitute the types of Virtual Asset Services and their description.\nService Category Description\n“Advisory Services IE Ss | means the provision ) of Personalised\n: recommendations to a customer, either upon |\n| request or at the initiative of Virtual Asset |\n) | Service Providers, relating to one or more\nactions or transactions involving Virtual |\n| Assets. |\nSU SE SN ETL EE A AT LE ST ES SY | .\n»\nI THE GAZETTE OF pA .\n| paRT 1] KISTAN, EXTRA. JULY 9, 2025 563\n~a-oker-Dealer Services T\n| Broker- Means any of the following;\n| : (@) arranging or facilitating orders for the\n. | Purchase and sale of Virtual Assets between\n| & | two parties;\n| | | (b) soliciting or accepting orders and\n| receiving consideration in fiat currency or\n| 8 | | Virtual Assets;\n| | ©) trading Virtual Assets on the Virtual\n| | | Asset Service Provider's own account;\n| E | Exemption: A Person that deals solely on\n| 8 | itsown account, does not execute orders on\n| 8 : : behalf of customers, and does not hold or\nEF & | | control Customer Assets is not regarded as |\n: | carrying on ‘broker-dealer services’ for the |\n¥ gp purposes of this Ordinance\n| lms : (d)  market-making using Customer |\n§ | | ase or i\n| 8 | '(¢) providing placement or distribution\n: Lew oo cc |serviceaforlesyes. |\n8 Custody Services | means the safekeeping or controlling, on\np | behalf of customers, of Virtual Assets or of\n) | ' the means of access to such Virtual Assets.\n: ARTIST. THANE DORIAN, 5 I PANE SA NaS :\n' Exchange Services . | means any of the following: |\n:\n- | (a) exchanging Virtual Assets for fiat\n: | currency;\n| (b) exchanging one or more types of\nVirtual Assets; |\n\"(c) matching orders between buyers and\nsellers and executing conversions as |\n. 1 | . . |\n| described in (a) and (b); or\n(d) maintaining an order book for the |\n: above purposes. |\nln SRE ite\n=\n564 THE GAZETTE OF PAKISTAN, EXTRA., JULY 9, 2025 [PART |\nLending and Borrowing Services | means the facilitation of lending of |\n| borrowing arrangements involving Virtya]\n| Assets, where one or more lenders transfer or\n: ' lend Virtual Assets to one or more borrowers, |\n“subject to a contractual obligation for the | ;\n: | borrower to return equivalent Virtual Assets\nat a specified time or upon demand.\n: Virtual Asset Derivatives Services ~~ | means the offering or facilitation of |\n: transactions in derivatives that have a Virtual |\nAsset as their underlying reference asset. |\nVirtual Asset Management and Investment | means acting in a fiduciary or agency |\nServices | capacity for the purpose of managing or !\n| | administering another Person’s Virtual |\n| Assets, including:\n| (@) portfolio or investment mariagement |\n| involving Virtual Assets; and |\n| | (®) responsibility for staking on behalf of\n| | customers to earn validator or network |\npL a ve Sen Wl oe Ee\nVim Asset Transfer and Settlement | includes transfer, transmission, or settlement\nServices | of Virtual Assets between parties, or from\n| one wallet, address, or location to another, on\n| behalf of customers.\nFiat referenced TokenIssuance Services | The issuance, offering, redemption, or Tok Ronit\nongoing management of any fiatorAsset- Eyal\nReferenced token, including:\n| ® Establishing or administering reserve |\n: | assets backing the value of the Fiat-\nReferenced Token;\n| | * Providing redemption rights or liquidity |\n| mechanisms to users or holders;\n: |\n| | * Operating any infrastructure enabling the\n| issuance, transfer, or conversion of such\n| | Fiat-Referenced Token;\nmp\nRR Sa BN\nPART 1] THE GAZETTE OF PAKISTAN, EXTRA. JULY 9, 2025 565\nEE EE Ee  —— —— —————\n* Acting as the primary Issuer, reserve\ncustodian, or central administrator of the\nFiat-Referenced Tokensystem.\nSCHEDULE 2\n(See section 22)\nMINIMUM PAID-UP CAPITAL :\n*\nMinimum Paid-up\n« Category Capital (PKR)\nExchange 1,000,000,000 |\nBroker-dealer 100,000,000\nCustody-only 200,000,000\nFiat Referenced 1,000,000,000\nTokenlssuer\nAsset Referenced ’\nToken Issuer 1,000,000,000 ‘\n: Other As Prescribed ¢ \\\nSCHEDULE 3\n(See sections 26 & 27) |\nSIGNIFICANT ISSUER THRESHOLDS & RESERVE METRICS pred\n(1) An Issuer shall be deemed “significant” where:\n(a) the total market capitalisation of the fiat referenced or Asset-Referenced token exceeds\nfive billion Pakistani Rupees (PKR 5,000,000,000); or\n(b)the number of users based in Pakistan holding the fiat referencedorAsset-Referenced\ntoken exceeds five million (5,000,000); or\n(c) such other thresholds as may be Prescribed by the Authority."
    }
  ],
  "definitions": []
}
