{
  "id": "pk-voluntary-declaration-of-domestic-assets-act-2018",
  "type": "statute",
  "title": "Voluntary Declaration of Domestic Assets Act, 2018",
  "title_en": "Voluntary Declaration of Domestic Assets Act, 2018",
  "short_name": "VDODA",
  "status": "in_force",
  "issued_date": "2018-05-21",
  "in_force_date": "2018-05-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pjbg%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Voluntary Declaration of Domestic Assets Act, 2018 (XXX of 2018) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Act may be called the Voluntary Declaration\nof Domestic Assets Act, 2018.\n(2) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "(1) In this Act, unless there is anything repugnant in the subject or\ncontext,—\n(a)     “declarant” means a person making a declaration under section 5;\n(b)     “court of law” means an Appellate Tribunal, a High Court or Supreme\nCourt of Pakistan;\n(c)     “domestic assets” means assets of every kind other than foreign assets under\nForeign Assets (Declaration and Repatriation) Act, 2018;\n(d)     “holder of public office” means a person who is or has been, during the\npreceding ten years,—\n(i)     the President of the Islamic Republic of Pakistan or the Governor of\na Province;\n(ii)    the Prime Minister, Chairman Senate, Speaker of the National\nAssembly, Deputy Chairman Senate, Deputy Speaker National\nAssembly,         Federal          Minister,      Minister  of\nState, Attorney-General for Pakistan and other Law Officers\nappointed under the Central Law Officers Ordinance, 1970\n(VII of 1970), Adviser or Consultant or Special Assistant to\nthe Prime Minister and holds or has held a post or office with\nthe rank or status of a Federal Minister or Minister of State,\nFederal Parliamentary Secretary, Member of Parliament,\nAuditor-General of Pakistan, Political Secretary;\n(iii)   the Chief Minister, Speaker Provincial Assembly, Deputy Speaker\nProvincial    Assembly,     Provincial     Minister, Adviser  or\nConsultant or Special Assistant to the Chief Minister and\nwho holds or has held a post or office with the rank or status\nof a Provincial Minister, Provincial Parliamentary Secretary,\nMember of the Provincial Assembly, Advocate-General for a\nProvince     including    Additional       Advocate-General  and\nAssistant Advocate-General, Political Secretary;\n(iv)    the Chief Justice or, as the case may be, a Judge of the Supreme\nCourt, Federal Shariat Court, a High Court or a Judicial Officer\nwhether exercising judicial or other functions or Chairman or member\nof a Law Commission, Chairman or Member of the Council of Islamic\nIdeology;\n(v)     holding an office or post, in the service of Pakistan or any service in\nconnection with the affairs of the Federation or of a Province or of\na local council constituted under any Federal or Provincial law\nrelating to the constitution of local councils, co-operative societies or\nin the management of corporations, banks, financial institutions,\nfirms, concerns, undertakings or any other institution or\norganization established, controlled or administered by or under\nthe Federal Government or a Provincial Government or a civilian\nemployee of the Armed Forces of Pakistan:\nProvided that a member of the Board, not actively engaged\nin the business and day-today affairs of the said corporations,\nbanks, financial institutions, firms, concerns, undertakings or any other\ninstitution or organization shall not be treated as holder of public\noffice under this sub-clause;\n(vi)    the Chairman or Mayor or Vice Chairman or Deputy Mayor of a zila\ncouncil, a municipal committee, a municipal corporation or a\nmetropolitan corporation constituted under any Federal or Provincial\nlaw relating to local councils;\nExplanation.—For the purpose of this sub-clause the\nexpressions “Chairman” and “Vice Chairman” shall include “Mayor”\nand “Deputy Mayor” as the case may be, and the respective councilors\ntherein; and\n(vii)   a District Nazim or District NaibNazim, Tehsil Nazim or Tehsil\nNaibNazim or UnionNazim or Union NaibNazim.\n(e)    “undisclosed asset” in relation to an immovable property includes an\nimmovable property the value of which has been under-reported or\nunderstated;\n(2) All other words and expressions used but not defined in the Act shall have the same\nmeaning assigned to them under the Income Tax Ordinance, 2001 (XLIX of 2001) and the rules\nmade thereunder."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Act to override other laws",
      "content": "The provisions of this Act shall have effect\nnotwithstanding anything to the contrary contained in any other law for the time\nbeing in force."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Application",
      "content": "(1) The provisions of this Act shall apply to—\n(a)    every company, association of persons and all citizens of Pakistan wherever\nthey may be, except holders of public office, their spouses and dependent\nchildren; and\n(b)    undisclosed income and domestic assets held by the persons mentioned in\nclause (in Pakistan, except where proceedings are pending in any court of law\nin respect of the undisclosed income or domestic assets.\n(2)    The provisions of this Act shall not apply to any proceeds or assets that are\ninvolved in or derived from the commission of a criminal offence."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Declaration of domestic assets in Pakistan",
      "content": "(1)Subject to the provisions of this\nAct, any person may make, to the Federal Board of Revenue by the due date specified in section 6,\na declaration in respect of undisclosed income and domestic assets acquired before the tenth day of\nApril, 2018.\n(2)     The value of a domestic asset shall be as specified in section 10.\n(3)   The description, value and tax paid in respect of the undisclosed income and\ndomestic assets declared in sub-section (1) shall be in the manner as set out in Form A of the Schedule\nto this Act.\n(4) The declaration of undisclosed income and domestic assets shall be made in the manner\nas set out in Form A of the Schedule to this Act, electronically on Federal Board of Revenue’s web\nportal and shall be valid only if it is accompanied by the evidence of payment of tax. The declarant\nmay be required to provide additional item-wise details of such income and assets while filing\ndeclaration on Federal Board of Revenue’s web portal."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Period of applicability",
      "content": "The declaration under section 5 shall be made on or after the\ntenth day of April, 2018 but on or before the thirtieth day of June, 2018."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Charge of tax",
      "content": "The domestic assets declared within the due date shall be chargeable to\ntax at the rates specified in the Table below on the value of assets as determined under section 10,\nnamely:—\nS.No.                      Assets                       Rate (as a percentage of\nthe value of the asset)\n(1)                         (2)                                  asset)\n(3)"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Payment of tax",
      "content": "(1) The due date for payment of the tax chargeable under section 7 shall\nbe the date on which declaration is made under section 6.\n(2) No tax shall be payable by the declarant under any law for the time being in force including\n(1) in respect of the undisclosed income and domestic assets declared under section 5."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Incorporation in books of account",
      "content": "(1) Where a declarant has paid tax under section\n8 in respect of undisclosed income and domestic assets declared under section 5, the declarant\nshall be entitled to incorporate in his books of account such undisclosed income and domestic assets.\n(2) For the purpose of the Income Tax Ordinance, 2001(XLIX of 2001), the cost of\nacquisition of domestic assets and date of acquisition shall be deemed to be the value under sub-\nsection (2) of section 5 and the date on which declaration has been made by the declarant,\nrespectively.—"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Valuation",
      "content": "For the purpose of this Act, the valuation of assets declared shall be made\nin the following manner, namely:—\nS.No. Undisclosed income and                    Value for the purpose of section 5(2)\ndomestic assets\n(1)            (2)                                              (3)"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Other precious stones Market rate as on the 9 th April, 2018",
      "content": "and metals.                 or cost of acquisition, whichever is\nhigher."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Stock",
      "content": "in-trade. Market rate as on the 9th April, 2018."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Prize bonds, cash and For bank accounts balance as on 9 th",
      "content": "bank accounts including     April, 2018 and face value for other\nforeign currency            assets.\naccounts."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Confidentiality",
      "content": "(1) Notwithstanding the provisions of sub-section (3) of section 216\nof the Income Tax Ordinance, 2001 (XLIX of 2001), the Right of Access to Information Act, 2017\n(XXXIV of 2017) and any other law for the time being in force, particulars of any person making a\ndeclaration under this Act or any information received in any declaration made under this Act\nshall be confidential.\n(2) A person who discloses any particulars in contravention of sub- section (1) shall commit\nan offence punishable on conviction with a fine of not less than five hundred thousand Rupees but\nnot exceeding one million Rupees or imprisonment for a term not exceeding one year or with both."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Misrepresentation",
      "content": "Notwithstanding anything contained in this Act, where a\ndeclaration has been made by misrepresentation or suppression of facts, such declaration shall be\nvoid and shall be deemed never to have been made under this Act.\nSchedule\nForm A\nDECLARATION UNDER SECTION 5\nNTN (if\navailable)\nTELEPHONE NUMBER:\nEmail:\nS.No.    Undisclosed income and assets.         Value as per section 10."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Government securities ( other than",
      "content": "those at S.No. 1 in the Table under\nsection 7)\nTotal value in Rupees\nTax @ 5% (A)"
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Government securities or rupee",
      "content": "amount from encashment of foreign\ncurrency accounts (S.No. 1 in the\nTable under section 7)\nTax @ 2% (B)\nTotal Tax (A+B)\nWhether evidence of payment of tax attached.                        YES          NO\nI, the undersigned, solemnly declare that to the best of my knowledge and belief—\n(a)    the information given in this declaration is correct and complete; and\n(b)    the value of domestic assets have truly been declared.\nI, further declare that I am competent to make this declaration and verify it in my own\nname.\nDate __________       Signature___________\nName _____________"
    }
  ],
  "definitions": [
    {
      "term": "declarant",
      "definition": "a person making a declaration under section 5;",
      "source_provision": "sec2"
    },
    {
      "term": "court of law",
      "definition": "an Appellate Tribunal, a High Court or Supreme Court of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "domestic assets",
      "definition": "assets of every kind other than foreign assets under Foreign Assets (Declaration and Repatriation) Act, 2018;",
      "source_provision": "sec2"
    },
    {
      "term": "holder of public office",
      "definition": "a person who is or has been, during the preceding ten years,— (i) the President of the Islamic Republic of Pakistan or the Governor of a Province; (ii) the Prime Minister, Chairman Senate, Speaker of the National Assembly, Deputy Chairman Senate, Deputy Speaker National Assembly, Federal Minister, Minister of State, Attorney-General for Pakistan and other Law Officers appointed under the Central Law Officers Ordinance, 1970 (VII of 1970), Adviser or Consultant or Special Assistant to the Prime Minister and holds or has held a post or office with the rank or status of a Federal Minister or Minister of State, Federal Parliamentary Secretary, Member of Parliament, Auditor-General of Pakistan, Political Secretary; (iii) the Chief Minister, Speaker Provincial Assembly, Deputy Speaker Provincial Assembly, Provincial Minister, Adviser or Consultant or Special Assistant to the Chief Minister and who holds or has held a post or office with the rank or status of a Provincial Minister, Provincial Parliamentary Secretary, Member of the Provincial Assembly, Advocate-General for a Province including Additional Advocate-General and Assistant Advocate-General, Political Secretary; (iv) the Chief Justice or, as the case may be, a Judge of the Supreme Court, Federal Shariat Court, a High Court or a Judicial Officer whether exercising judicial or other functions or Chairman or member of a Law Commission, Chairman or Member of the Council of Islamic Ideology; (v) holding an office or post, in the service of Pakistan or any service in connection with the affairs of the Federation or of a Province or of a local council constituted under any Federal or Provincial law relating to the constitution of local councils, co-operative societies or in the management of corporations, banks, financial institutions, firms, concerns, undertakings or any other institution or organization established, controlled or administered by or under the Federal Government or a Provincial Government or a civilian employee of the Armed Forces of Pakistan: Provided that a member of the Board, not actively engaged in the business and day-today affairs of the said corporations, banks, financial institutions, firms, concerns, undertakings or any other institution or organization shall not be treated as holder of public office under this sub-clause; (vi) the Chairman or Mayor or Vice Chairman or Deputy Mayor of a zila council, a municipal committee, a municipal corporation or a metropolitan corporation constituted under any Federal or Provincial law relating to local councils; Explanation.—For the purpose of this sub-clause the expressions “Chairman” and “Vice Chairman” shall include “Mayor” and “Deputy Mayor” as the case may be, and the respective councilors therein; and (vii) a District Nazim or District NaibNazim, Tehsil Nazim or Tehsil NaibNazim or UnionNazim or Union NaibNazim.",
      "source_provision": "sec2"
    }
  ]
}
