{
  "id": "pk-west-pakistan-agricultural-development-finance-corporation-recovery-of-arrears-a",
  "type": "statute",
  "title": "West Pakistan Agricultural Development Finance Corporation (Recovery of Arrears) Act, 1958",
  "title_en": "West Pakistan Agricultural Development Finance Corporation (Recovery of Arrears) Act, 1958",
  "short_name": "WPADF",
  "status": "in_force",
  "issued_date": "1958-04-16",
  "in_force_date": "1958-04-16",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tlbQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Agricultural Development Finance Corporation (Recovery of Arrears) Act, 1958 (XVIII of 1958) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Act may be called the",
      "content": "1\n[(2) It shall extend to the whole of the Province of West Pakistan, except the Tribal Areas.]\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Pledging of property to the Corporation and recovery of its dues. (1) Notwithstanding",
      "content": "anything contained in any other law for the time being in force it shall be lawful for any agricultural\nconcern, as defined in the Agricultural Development Finance Corporation Act, 1952 (VII of 1952)\n(hereinafter called the said Act) to pledge, mortgage, hypothecate or assign to the Agricultural\nDevelopment Finance Corporation (hereinafter called the Corporation) established under the said Act,\nany movable or immovable property, in order to secure a loan advanced or to be advanced by the\nCorporation under the said Act.\n(2) The Corporation shall, in accordance with the provisions of the said Act, be competent to\ndeal with and recover its dues by disposal of any property, pledged, mortgaged, hypothecated or\nassigned as aforesaid and nothing contained in any other law shall affect the rights or powers of the\nCorporation conferred on it under the provisions of the said Act, or affect anything done or purported\nto be done thereunder."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Repeal of West Pakistan Ordinance XII of 1957. The West Pakistan Agricultural",
      "content": "Development Finance Corporation (Recovery of Arrears) Ordinance, 19571 is hereby repealed.\n_______\nRGN Date: 24-07-2025\n1\nSubs. by the West Pakistan Laws (Extension to Karachi) Ordinance, 1964 (VII of 1964, s. 2 and Sch."
    }
  ],
  "definitions": []
}
