{
  "id": "pk-west-pakistan-agricultural-pests-ordinance-1959",
  "type": "statute",
  "title": "West Pakistan Agricultural Pests Ordinance, 1959",
  "title_en": "West Pakistan Agricultural Pests Ordinance, 1959",
  "short_name": "WPAPO",
  "status": "in_force",
  "issued_date": "1959-05-10",
  "in_force_date": "1959-05-10",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tnag%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Agricultural Pests Ordinance, 1959 (XXVIII of 1959) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Repeal and Savings",
      "content": "WEST PAKISTAN ORDINANCE No. XXVIII OF 1959\n[11th May, 1959]\nAN\nto amend and consolidate the law relating to the eradication of agricultural pests in the Province of\nWest Pakistan.\nPreamble. WHEREAS it is expedient to amend and consolidate the law relating to the\neradication of agricultural pests in the Province of West Pakistan;\nNOW, THEREFORE, in pursuance of the Presidential Proclamation of the seventh day of\nOctober, 1958, and in exercise of all powers enabling him in that behalf, the Governor of West Pakistan\nis pleased to make and promulgate the following Ordinance:–"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Ordinance may be called the West",
      "content": "Pakistan Agricultural Pests Ordinance, 1959.\n1\n[(2) It extends to the whole of the Province of West Pakistan, except the Tribal Areas.]\n(3) It shall come into force in such area or areas and from such date or dates as Government\nmay, by notification, specify."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless the context otherwise requires, the following",
      "content": "expressions shall have the meanings hereby respectively assigned to them, that is to say__\n(a)        “affected area” means any area affected by an agricultural pest;\n(b)        “agricultural pest” means a pest mentioned in the Schedule to this Ordinance;\n(c)        “crops” include all agricultural or horticultural crops and all trees, bushes or\nplants;\n(d)        “Government” means the Government of West Pakistan;\n(e)        “infested crop” means a crop affected by any agricultural pest;\n(f)        “Inspector” means an officer appointed under this Ordinance to perform the\nfunctions of an Inspector;\n(g)        “occupier” means the person in actual possession of land and includes the\nmanager or managing agent or any other person authorised to represent the\noccupier;\n1\nSubs. by the West Pakistan Laws (Extension to Karachi) Ordinance, 1964 (Ordinance No. VII of 1964), s. 2 and Sch.\n(h)    “preventive measures” means measures prescribed by Government to eradicate\nand to prevent the spread of any agricultural pest; and\n(i)    “prescribed” means prescribed by rules made under this Ordinance."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Powers of Government. Government may, by notification, prohibit",
      "content": "(a)    the employment of such methods of cultivation as help the spread of agricultural\npests either generally or with respect to any particular crop;\n(b)    the transport or sale of any infested crop."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Occupier to carry out preventive measures. Every occupier of land in which any crop is",
      "content": "cultivated shall be bound to carry out the preventive measures prescribed in respect of such crop or\ncrops."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Appointment of Inspectors. Government may, by notification, appoint such persons as it",
      "content": "thinks fit to be Inspectors for the purposes of this Ordinance within each such local area as may be\nspecified, and the persons so appointed shall be deemed to be public servants within the meaning of\nsection 21 of the Pakistan Penal Code (XLV of 1860)."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Powers of Inspectors. An Inspector may, subject to any rules made in this behalf by",
      "content": "Government__\n(a)    at any time enter and inspect any land, building, place, vessel or vehicle for the\npurpose of exercising the powers or performing the duties conferred or imposed\non him by or under this Ordinance;\n(b)    seize any infested crop and destroy or cause to be destroyed such crop in such\nmanner as may be prescribed;\n(c)    seize any infested crop or by a requisition in writing direct the occupier or the\nperson incharge of such crop not to sell or dispose of or pick or collect or move\nthe seized crop from such place as may be specified in the requisition without\nthe written permission of such authority as may be prescribed in this behalf."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Notice to occupier to carry out preventive measures. (1) Whenever an Inspector is",
      "content": "satisfied that preventive measures have not been duly carried out by the occupier of any land he shall\ncall upon such occupier by notice in writing to carry out such measures within fifteen days of the\nreceipt of the notice.\n(2) The occupier may within seven days from the service upon him of such notice prefer an\nappeal to the Collector, or Deputy Collector, or Assistant Collector, first grade, specially empowered\nin this behalf by the Collector, against the notice.\n(3) The authority before whom the appeal is preferred may extend the time specified in the\nnotice issued under sub-section (1) and shall, after giving the occupier an opportunity of being heard,\npass such order on the appeal as he thinks fit.\n(4) Every order passed under sub-section (3) shall be final."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Powers of Inspectors to take preventive measures and to recover expenses incurred in",
      "content": "connection therewith. (1) If an occupier on whom a notice has been served under sub-section (1) of\nsection 7 does not comply with such notice within the time specified therein or where an appeal has\nbeen preferred by him under sub-section (2) of that section, does not comply with the order passed on\nsuch appeal within seven days, the Inspector may carry out or cause to be carried out the preventive\nmeasures not undertaken, at the cost of the occupier and for such purpose may take with him or depute\nor employ such subordinates or other persons as he deems fit.\n(2) Where an Inspector has taken any action under this Ordinance in respect of any property\nat the expenses of a person bound to take such action he may record a certificate indicating the amount\nof the cost and the person from whom such amount is recoverable and such amount shall be recoverable\nas arrears of land revenue."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Powers of Government to declare affected area and to recover costs of remedial and",
      "content": "preventive measures in such areas. (1) Whenever it appears to Government that the Province or any\npart thereof is affected or threatened by an agricultural pest and that immediate action is necessary,\nGovernment may by notification declare the Province or such area as affected area and take such\nremedial and preventive measures in respect of such area as may be necessary.\n(2) Government may recover the whole or a part of the costs incurred in connection with the\naforesaid remedial and preventive measures from the occupiers or land owners in the affected area or\nfrom the persons who in its opinion have benefited by such measures.\n(3) All such costs, if unpaid, shall be recoverable as arrears of land revenue."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Penalty for contravening the provisions of 1[section 3 or section 4]. Whoever",
      "content": "contravenes the provisions of 1[section 3 or section 4] shall be punished for a first offence with a fine\nwhich may extend to five hundred rupees, and for every subsequent offence with imprisonment\nwhich may extend to three months or with fine which may extend to one thousand rupees or with\nboth."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Appeals. (1) Any person aggrieved by an order of seizure or destruction may, within seven",
      "content": "days of such order, appeal to the Collector, Deputy Collector or Assistant Collector, first grade,\nspecially empowered by the Collector in this behalf.\n(2) Any order passed on appeal under sub-section (1), and if no appeal is preferred, the order\nof the Inspector shall be final."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to amend the Schedule. Government may, if it considers it expedient, by",
      "content": "notification, add to or exclude any pest from the Schedule."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Bar of suits. No suit, prosecution or other legal proceeding shall lie against an Inspector or",
      "content": "any person acting under his order in respect of anything in good faith done or intended to be done\nunder this Ordinance."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Jurisdiction. No prosecution under this Ordinance shall be instituted except on the",
      "content": "complaint in writing of 1[an officer authorised by Government in this behalf] stating the facts\nconstituting the offence.\n1\nSubs. by W.P. Ordinance No. IV of 1961, ss. 2 & 3."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Government to make rules. (1) Government may make rules to carry out the purposes of",
      "content": "this Ordinance.\n(2) In particular and without prejudice to the generality of the foregoing powers Government\nmay make rules__\n(a)     prescribing preventing measures;\n(b)     prescribing the manner in which an Inspector may exercise his powers under\nsection 6;\n(c)     prescribing the form of requisitions and notices and the manner in which\nrequisitions and notices may be served;\n(d)     prescribing the authority which may release seizure imposed under the\nOrdinance; and\n(e)     prescribing the manner in which costs shall be assessed and paid."
    }
  ],
  "definitions": [
    {
      "term": "affected area",
      "definition": "any area affected by an agricultural pest;",
      "source_provision": "sec2"
    },
    {
      "term": "agricultural pest",
      "definition": "a pest mentioned in the Schedule to this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Government of West Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "infested crop",
      "definition": "a crop affected by any agricultural pest;",
      "source_provision": "sec2"
    },
    {
      "term": "Inspector",
      "definition": "an officer appointed under this Ordinance to perform the functions of an Inspector;",
      "source_provision": "sec2"
    },
    {
      "term": "occupier",
      "definition": "the person in actual possession of land and includes the manager or managing agent or any other person authorised to represent the occupier; 1 Subs. by the West Pakistan Laws (Extension to Karachi) Ordinance, 1964 (Ordinance No. VII of 1964), s. 2 and Sch.",
      "source_provision": "sec2"
    },
    {
      "term": "preventive measures",
      "definition": "measures prescribed by Government to eradicate and to prevent the spread of any agricultural pest; and",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Ordinance.",
      "source_provision": "sec2"
    }
  ]
}
