{
  "id": "pk-west-pakistan-animals-slaughter-control-act-1963",
  "type": "statute",
  "title": "West Pakistan Animals Slaughter Control Act, 1963",
  "title_en": "West Pakistan Animals Slaughter Control Act, 1963",
  "short_name": "WPASC",
  "status": "in_force",
  "issued_date": "1963-04-16",
  "in_force_date": "1963-04-16",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tjag%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Animals Slaughter Control Act, 1963 (III of 1963) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Act may be called the West Pakistan",
      "content": "Animals Slaughter Control Act, 1963.\n1\n[(2) It extends to the whole of the Province of the West Pakistan, except the Tribal Areas.]\n(3) This section shall come into force at once and the remaining provisions of the Act or any\nof them shall come into force in such 1[*] area and on such date as Government may, by notification\nin the official Gazette, specify in this behalf."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless the context otherwise requires, the following expressions",
      "content": "shall have the meanings hereby respectively assigned to them, that is to say:__\n(a)        “animal” means a bull, bullock, buffalo, buffalo-bull, camel, cow, goat, ostrich\n1\n[,goat] and sheep of any age;\n(b)        “carcass” means the dead body of an animal;\n(c)        “cull” means to pick an animal which is suitable neither for breeding purposes\nnor for draught purposes;\n(d)        “Government” means the Government of Pakistan;\n(e)        “local authority” means a local council established under 1[the Electoral College\nAct, 1964 (Act IV of 1964)] or a Municipal Committee constituted under any\nmunicipal law for the time being in force or a Cantonment Board established\nunder the Cantonments Act, 1924 (II of 1924);\n(f)        “prescribed” means prescribed by rules made under this Act;\n(g)        “slaughter” means to kill animals by any means;\n1\nSubs., omitted and ins. by the West Pakistan Ordinance No. XXIV of 1965, ss. 2-3.\n(h)        “slaughter-house” means any building or premises used for slaughtering\nanimals and approved by the local authority concerned;\n(i)        “stock yard” means any enclosure, approved by a local authority where animals\nare assembled for examination by the Veterinary Officer to determine whether\nthey are suitable for slaughter or not, or where animals approved for\nslaughtering are housed until they are removed to the slaughter house;\n(j)        [‘area’ means an area which the Government may, by notification in the\n1\nOfficial Gazette, declare to be an area for the purposes of this Act;]\n(k)        “useful animal” means__\n(i)       a female sheep below the age of one year and six months;\n(ii)      a female sheep of the age exceeding one year and six months but not\nexceeding four years, which is pregnant or fit for breeding purposes;\n(iii)     any female animal, other than sheep, below three years of age;\n(iv)      any female animal, other than sheep, which is pregnant or in milk or fit\nfor breeding purposes;\n(v)       any female animal, other than sheep, between three to ten years of age,\nwhich is fit for draught purposes; but does not include any such animal\nwhich on account of culling, injury, illness or other cause, is certified in\nwriting by a Veterinary Officer or any Gazetted Officer of the Animal\nHusbandry Department as not likely to live or as no longer a useful\nanimal for the purposes of this Act;\n(l)        “Veterinary Officer” means an Officer of the Animal Husbandry Department,\nnot below the rank of a Veterinary Assistant Surgeon, and includes an Officer-\nin-charge of a slaughter-house, provided that such officer-in-charge possesses a\ndegree or diploma from a recognized Veterinary or Animal Husbandry College."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Restriction on slaughter of animals. (1) No person shall slaughter a useful animal",
      "content": "(2) No person shall slaughter an animal__\n(a)        unless such animal has been approved as hereinafter provided, for slaughter;\n1\n[*]\n(b)        except in a slaughter house and during the hours prescribed therefore 1[;and]\n1\n[(c)   on Tuesdays and Wednesdays or on such other day or days as Government may,\nby notification in the Official Gazette, specify in this behalf]\n1\nSubs., omitted and ins. by the West Pakistan Ordinance No. XXIV of 1965, ss. 3-4.\nProvided that nothing contained in this section shall apply to the slaughter of any animal__\n(i)       by a Muslim on the day of Eid-ul-Azha and the two succeeding days; or\n(ii)       which on account of illness, injury or other cause is likely to die before it can\nbe presented to the officer-in-charge of slaughter- house."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Examination in Stock Yard. (1) Any person intending to slaughter an animal in slaughter",
      "content": "house shall produce the animal in the stock yard for examination at any time during the hours fixed by\nthe local authority concerned for inspection.\n(2) After examination of any such animal the Veterinary Officer may approve it for slaughter:\nProvided that no useful animal shall be so approved.\n(3) Any person aggrieved by a decision of the Veterinary Officer may, within twenty-four hours\nof such decision, prefer an appeal from such decision, to such authority as may be prescribed.\n(4) Subject to the decision of the appellate authority the decision of the Veterinary Officer shall\nbe final."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Prohibition to cause abortion. No person shall voluntarily cause a pregnant sheep to mis",
      "content": "carry or induce premature birth of its young."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to exempt. Government may, under special circumstances subject to such conditions",
      "content": "as it may deem fit to impose, exempt any person or class of persons from all or any provisions of this\nAct."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power of entry, search and seizure. A Veterinary Officer or any Gazetted Officer may",
      "content": "enter and search a slaughter-house or any other premises where he has reason to believe that an offence\nunder this Act has been, is being or is about to be committed and may seize any animal, carcass or\nmeat in respect of which such offence has been, is being or is about to be committed, as the case may\nbe."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Penalty. (1) Whoever contravenes any provision of this Act 1[(other than the provisions of",
      "content": "clause (c) of sub-section (2) of section 3)] or such of the rules made thereunder as may be prescribed,\nshall on first conviction, be punished with fine which may extend to two hundred rupees or with\nimprisonment for a term which may extend to one month or with both and, on second or subsequent\nconviction, with imprisonment which may extend to six months, or with fine which may extend to five\nhundred rupees or with both.\n1\n[1A. Whoever contravenes the provisions of clause (c) of sub-section (2) of section 3 shall be\npunished with imprisonment for a term which may extend to three years, or with fine, or with both,\nand the court trying such contravention shall direct that any animal slaughtered in contravention of the\nprovisions of the said clause shall be forfeited to Government.]\n1\nIns. by the West Pakistan Ordinance No. XXIV of 1965, s. 5.\n(2) An attempt to contravene any provisions of this Act or the rules as aforesaid and an abetment\nof such contravention shall be punished as an offence under this Act.\n(3) Any person who is in possession of the premises where an offence under this Act has been\nor is being committed may be presumed to have abetted that offence."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Forfeiture. The court trying an offence under this Act may direct that any animal, carcass",
      "content": "or meat in respect of which the court is satisfied that an offence under this Act has been committed, be\nforfeited to Government."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Reward to Informers. The court trying an offence under this Act may direct that an amount",
      "content": "not exceeding twenty per cent of such sum as may be realized by way of fine or under section 517 of\nthe Code of Criminal Procedure, 1898 (V of 1898), on account of the sale or disposal otherwise of\nawarded to the person or persons supplying information relating to the commission of the offence."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Rules. Government may frame rules",
      "content": "(i)     to regulate the procedure for the disposal of animals, carcass or meat seized\nunder this Act ; and\n(ii)    generally to give effect to the provisions of this Act."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Repeal of Act LXVI of 1950. The Karachi Cattle Slaughter Control Act, 1950 is hereby",
      "content": "repealed.\n_________\nRGN Date: 05-05-2025"
    }
  ],
  "definitions": [
    {
      "term": "animal",
      "definition": "a bull, bullock, buffalo, buffalo-bull, camel, cow, goat, ostrich 1 [,goat] and sheep of any age;",
      "source_provision": "sec2"
    },
    {
      "term": "carcass",
      "definition": "the dead body of an animal;",
      "source_provision": "sec2"
    },
    {
      "term": "cull",
      "definition": "to pick an animal which is suitable neither for breeding purposes nor for draught purposes;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Government of Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "local authority",
      "definition": "a local council established under 1[the Electoral College Act, 1964 (Act IV of 1964)] or a Municipal Committee constituted under any municipal law for the time being in force or a Cantonment Board established under the Cantonments Act, 1924 (II of 1924);",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "slaughter",
      "definition": "to kill animals by any means; 1 Subs., omitted and ins. by the West Pakistan Ordinance No. XXIV of 1965, ss. 2-3.",
      "source_provision": "sec2"
    },
    {
      "term": "slaughter-house",
      "definition": "any building or premises used for slaughtering animals and approved by the local authority concerned;",
      "source_provision": "sec2"
    },
    {
      "term": "stock yard",
      "definition": "any enclosure, approved by a local authority where animals are assembled for examination by the Veterinary Officer to determine whether they are suitable for slaughter or not, or where animals approved for slaughtering are housed until they are removed to the slaughter house; (j) [‘area’ means an area which the Government may, by notification in the 1 Official Gazette, declare to be an area for the purposes of this Act;]",
      "source_provision": "sec2"
    },
    {
      "term": "Veterinary Officer",
      "definition": "an Officer of the Animal Husbandry Department, not below the rank of a Veterinary Assistant Surgeon, and includes an Officer- in-charge of a slaughter-house, provided that such officer-in-charge possesses a degree or diploma from a recognized Veterinary or Animal Husbandry College.",
      "source_provision": "sec2"
    }
  ]
}
