{
  "id": "pk-west-pakistan-civil-courts-ordinance-1962",
  "type": "statute",
  "title": "West Pakistan Civil Courts Ordinance, 1962",
  "title_en": "West Pakistan Civil Courts Ordinance, 1962",
  "short_name": "WPCCO",
  "status": "in_force",
  "issued_date": "1962-01-07",
  "in_force_date": "1962-01-07",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tiaQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Civil Courts Ordinance, 1962 (II of 1962) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Temporary vacancy of office of District Judge. In the event of the death of a District",
      "content": "Judge or of his being prevented from performing his duties by illness or other cause, the Additional\nDistrict Judge, if any, or in the absence of the Additional District Judge from the district, the senior\nmost of the Civil Judges at the headquarters, shall assume charge of the district without interruption\nof his ordinary jurisdiction, and while so in charge shall perform the duties of the District Judge with\nrespect to the filing of suits and appeals, receiving pleadings, execution of processes and the like, and\nshall be designated Additional District Judge or Civil Judge, as the case may be, in charge of the district\nand shall continue in such charge until the office of the District Judge has been resumed or assumed\nby an officer duly appointed thereto."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Delegation of powers of the District Judge. Any District Judge, leaving the headquarters",
      "content": "and proceeding on duty to any place within his jurisdiction or in the event of his absence from the\ndistrict on leave, may delegate to the Additional District Judge or in the absence of an Additional\nDistrict Judge to the senior most of the Civil Judges at the headquarters, the power of performing any\nof the duties enumerated in section 21 that may be emergent ; and such officer shall be designated\nAdditional District Judge or Civil Judge, as the case may be, in charge of the district."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Temporary vacancy of office of Civil Judge. In the event of the death, suspension or",
      "content": "temporary absence of any Civil Judge, the District Judge may empower any other Civil Judge of the\ndistrict to perform the duties of the Judge of the vacated Civil Court, either at the place of such Court\nor of his own Court, but in every such case the registers and records of the two Courts shall be kept\nseparately."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Civil Courts having unlimited jurisdiction regarding value to try suits against the State",
      "content": "and its servants in their official capacity. (1) No Civil Court not having jurisdiction in original suits\nwithout limit as regards value and no Court of the Small Causes shall receive, entertain or register any\nsuit in which Pakistan or any of its Provinces or any public officer as defined in clause (17) of section\n2 of the Code of Civil Procedure, 1908 (V of 1908), in his official capacity is a party.\n(2) In every such case the plaintiff shall be referred to the Court of the Civil Judge having\njurisdiction in original suits without limit as regard value and such suit shall be instituted only in the\nCourt of such Civil Judge and shall be heard at the headquarters of the district.\n1\n[(2-A) Notwithstanding anything contained in sub-sections (1) and (2), in the Karachi District,\nany such suit, if the value thereof does not exceed twenty-five thousand rupees, may be instituted in\nand be tried by the Court of the District Judge, the Additional District Judge or Civil Judge of the First\nClass, and where the value of the suit exceeds twenty-five thousand rupees, it shall be instituted in and\nbe tried by the High Court.\n(2-B) The High Court may transfer any civil suit, whether instituted before or after the coming\ninto force of the West Pakistan Civil Courts (Amendment) Act, 1963, and whether pending before it\n1\nIns. by West Pakistan Act No. XV of 1963, s. 2\nor in any other Court, which under the provisions of sub-section (2-A) may be tried by a Civil\nCourt constituted under this Ordinance, to such Civil Court, and such suit shall thereupon be tried by\nsuch Civil Court.]\n(3) Nothing in this section shall be deemed to apply to a suit relating to the affairs of a\nGovernment Railway or to any suit merely because a public officer is a party thereto, in his capacity\nas—\n(a)   a member of a local authority ; or\n(b)   curator, guardian, manager or representative of a private person or estate in virtue of\nan appointment, delegation, declaration or exercise of powers under—\n(i)     Order XXXII rule 4 (4) of the Code of Civil Procedure, 1908 (V of 1908);\n(ii)    section 195 of the Succession Act, 1925 (XXXIX of 1925);\n(iii)   section 69 or 71 of the Lunacy Act, 1912 (IV of 1912);\n(iv)    section 7, 18 or 42 of the Guardians and Ward Act, 1890 (VIII of 1890); or\n(v)     any provision of any West Pakistan enactment relating to Court of Wards."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. List of holidays. (1) Subject to such general orders as may be made by Government, the",
      "content": "High Court shall prepare a list of days to be observed in each year as holidays in the Civil Courts.\n(2) Every such list shall be published in the Official Gazette."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Seal of the court. Every Court shall have and use, as the occasion may arise, a circular seal",
      "content": "two inches in diameter bearing round its circumference the title of the Court in English and Urdu script\nand in the centre a device and impression of a crescent moon with the horns pointing upwards\nsurmounted by a star, and the said seal shall be delivered to and kept in the custody of the presiding\nofficer of the Court."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Power of frame rules. (1) The High Court may, with the approval of Government, frame",
      "content": "rules for the purposes of carrying into effect the provisions of this Ordinance.\n(2) In particular, and without prejudice to the generality of the foregoing power, the High Court\nmay, with the approval of Government, frame rules for all or any of the following purposes, namely:—\n(a)     the supervision of all Civil Courts and their visitation and inspection;\n(b)     the exercise by the District Judges of the general control vested in them over\nthe Civil Courts in their respective districts;\n(c)     the places and times for the holding of Civil Courts;\n(d)     the fees to be charged for processes issued by the Civil Courts or by any officer\nof any such Court;\n(e)    the fees payable in any suit or proceeding in any Civil Court by any party in\nrespect of the fees of the pleader of any other party; and\n(f)    the manner in which the proceedings of the Civil Courts shall be kept and\nrecorded, the manner in which the paper books for the hearing of appeal shall\nbe prepared and the granting of copies."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Repeal and savings. (1) The enactments specified in the Schedule are hereby repealed to",
      "content": "the extent mentioned in the fourth column thereof.\n(2) The districts and headquarters of districts existing for the purposes of civil justice when this\nOrdinance comes into force shall be deemed to have been made and determined under this Ordinance.\n(3) On the commencement of this Ordinance, if any suit or appeal is pending in the High Court\nor any other Civil Court, which under this Ordinance is to be tried or heard by some other Court, such\nsuit or appeal shall stand transferred to the Court competent under this Ordinance to try or hear the\nsame.\n(4) (i)    The District Judges;\n(ii) the Additional Judges, the Joint Judges and the Assistant Judges; and\n(iii) the First Class Subordinate Judges, the Second Class Subordinate Judges, the\nSubordinate Judges, the Joint Subordinate Judges and Civil Judges,\nappointed under any of the enactments repealed under sub- section (1) shall, on the commencement of\nthis Ordinance, become District Judges, Additional District Judges and Civil Judges respectively under\nthis Ordinance, and exercise powers and jurisdiction as such.\n(5) Notwithstanding the repeal of the enactments mentioned in the Schedule, everything done,\naction taken, obligation, liability, penalty or punishment incurred, inquiry or proceeding commenced,\nofficer appointed or person authorised, jurisdiction or power conferred, rule made and order issued\nunder any of the provisions of the said enactments shall, if not inconsistent with the provisions of this\nOrdinance, continue in force and, so far as may be, be deemed to have been respectively done, taken,\nincurred, commenced, appointed, authorised, conferred, made or issued under this Ordinance.\n[ENACTMENTS REPEALED]\n(See section 28)\nYear. No.                                Short title                                 Extent of repeal\n1      2                                 3                                              4\n1918      VI The Punjab Courts Act, 1918.                                          The whole.\n1918      VI The Punjab Courts Act, 1918, as applicable to former The whole.\nBahawalpur State.\n1926      VII The Sind Courts Act, 1926.                                           The whole.\n1926      VII The Sind Courts Act, 1926, as applicable to the District of The whole, except\nKarachi.                                                    section 8.\n1926      VII The Sind Courts Act, 1926, as applicable to the District of The whole.\nKhairpur.\n1931       I    The North-West Frontier Province Courts Re-gulation,1930.\nThe whole.\n1939      VII The British Baluchistan Courts Regulation,1939.\nThe whole.\n1952      X The North-West Frontier Province Courts Act,1952.\nThe whole.\n1952       ..   Dastoor-ul-Amal Diwani, Riasat Kalat.\nThe whole.\n1959      IV The Sind Acts           (Extension        to   Khairpur   District)\nEntry 4 of the First\nOrdinance,1959.\nSchedule.\n1956      II\nThe Karachi Courts Order, 1956.\nThe whole, except\nclause 4 (2).\n___________\np10wns21473\nRGN Date: 24-06-2025"
    }
  ],
  "definitions": []
}
