{
  "id": "pk-west-pakistan-consolidation-of-holdings-ordinance-1960",
  "type": "statute",
  "title": "West Pakistan Consolidation of Holdings Ordinance, 1960",
  "title_en": "West Pakistan Consolidation of Holdings Ordinance, 1960",
  "short_name": "WPCOH",
  "status": "in_force",
  "issued_date": "1960-03-09",
  "in_force_date": "1960-03-09",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tkbw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Consolidation of Holdings Ordinance, 1960 (VI of 1960) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. No appeal except as provided by this Ordinance. Save as provided in this Ordinance no",
      "content": "appeal or revision shall lie from any order passed under this Ordinance or the rules made thereunder."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Procedure on confirmation. When the confirmation of a scheme of consolidation becomes",
      "content": "final, the Consolidation Officer shall__\n(a)      announce the decision which has become final, if this has not been already done;\n(b)      demarcate the boundaries of the holdings, if necessary; and\n(c)      cause to be prepared a new record-of-rights in accordance with the scheme.\nExplanation.__ Such record-of-rights shall have the same force as the record-of- rights which it\npurports to replace."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Rights of land",
      "content": "owners and tenants after consolidation same as before. A land-owner or\na tenant shall have the same rights in the holding or land allotted to him in pursuance of a scheme of\nconsolidation as he had in his original holding or tenancy, as the case may be."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Transfer of incumbrance to new allotments. Subject to any rules that may be made under",
      "content": "section 29, when the holding of a land-owner or the tenancy of a tenant brought under the scheme of\nconsolidation is burdened with any lease, mortgage orother incumbrance, such lease, mortgage or other\nincumbrance shall be transferred and attached to the holding or tenancy allotted under the scheme or\nto such part of it as the Consolidation Officer may direct; and, thereupon, the lessee, mortgagee or\nother incumbrancer, as the case may be, shall cease to have any right in or over the land from which\nthe lease, mortgage or other incumbrance has been transferred."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Right of land",
      "content": "owners, tenants and persons affected in newly allotted holdings and\ntenements. The land-owners, tenants and other persons affected by the scheme of consolidation shall\nbe entitled to possession of the holdings and tenements allotted to them under the scheme and the\nConsolidation Officer shall, by an order, direct that they be put in possession thereof from such date\nafter the final confirmation of the scheme, as he may deem expedient, and for this purpose he shall\nhave all the powers of the Collector.\n6\n[18-A. Summary ejectment. Any person occupying, or in possession of, any holding or\ntenement included in the Consolidation Scheme__\n(a)        the right of occupation of which has been allotted to any land owner, tenant or\nother person under the Consolidation Scheme; or\n(b)        possession of which has not been authorised by the Consolidation Officer under\nthe Consolidation Scheme;\nmay, after being given a reasonable opportunity of showing cause against such action, be summarily\nejected by the Consolidation Officer, with the use of such force as may be necessary:\nProvided that no person shall be so ejected earlier than the date mentioned in the order made\nunder section 18.]"
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Revenue Officer to prevent encroachment upon way or path shown in new records. A",
      "content": "Revenue Officer may, either of his own motion or on an application in this behalf, eject any person\nmaking any encroachment upon any way or path shown in the record-of-rights prepared under section\n15, and by an order published in such manner as may be prescribed, forbid repetition of the\nencroachment:\nProvided that the proceedings of the Revenue Officer shall be subject to any decree or order\nwhich may be passed by any Court of competent jurisdiction.\nSUPPLEMENTAL."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Cost of consolidation proceedings. The cost of consolidation proceedings shall be",
      "content": "recovered, in such manner as may be prescribed, from the persons whose holdings are affected by the\nscheme of consolidation:\nProvided that Government may remit the costs of a single scheme of consolidation or of all\nschemes of consolidation in a particular area either in whole or in part or for a term of years."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Recovery of compensation or cost as arrears of land",
      "content": "revenue.__ Any amount payable as\ncompensation under section 12 or as costs under section 20 may be recovered as an arrear of land-\nrevenue.\n6\nAdded by West Pakistan Ordinance No. XVII of 1965, s. 3."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. No instrument necessary to effect transfer. Notwithstanding anything in any law:",
      "content": "(a)     an instrument in writing shall not be necessary in order to give effect to a transfer\ninvolved in carrying out any scheme of consolidation of holdings; and\n(b)     if any instrument is executed, it shall not require registration."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Abeyance of partition proceedings during consolidation proceedings. When an",
      "content": "application for the consolidation of holdings has been made and it has been duly admitted, partition\nproceedings in respect of the estate or sub-division which will be affected by the scheme shall not be\ncommenced, and all pending proceedings shall remain in abeyance till the conclusion of the\nconsolidation proceedings."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Transfer of property during consolidation proceedings. When an application for the",
      "content": "consolidation of holdings has been made, no land-owner or tenant having a right of occupancy upon\nwhom the scheme will be binding shall have power, without the sanction of the Consolidation Officer,\nduring the pendency of the consolidation proceedings, to transfer or otherwise deal with any part of\nhis holding or tenancy so as to affect the rights of any other land-owner or tenant having a right of\noccupancy therein under the scheme of consolidation."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Killabandi to be the basis. Consolidation of holdings shall be carried out on the basis of",
      "content": "killabandi where the physical features of the tract under operation permit such a course."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Jurisdiction of Civil Court barred as regard matter arising under this Ordinance. No",
      "content": "Civil Court shall entertain any suit or application to obtain a decision or order in respect of any matter\nwhich Government or the Board of Revenue or any officer is, by this Ordinance, empowered to\ndetermine, decide or dispose of."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Public servants indemnified for acts done under this Ordinance. No suit or other legal",
      "content": "proceedings shall be maintained in respect of the exercise of any powers or discretion conferred by\nthis Ordinance or against any public servant or person duly appointed or authorised under this\nOrdinance in respect of anything in good faith done or purported to be done under the provisions\nthereof or the rules made thereunder."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. The Ordinance not to affect the validity of consolidation of holdings by Co",
      "content": "operative\nSocieties duly registered. In relation to any Co-operative Society duly registered under any law for\nthe time being in force relating to Co-operative Societies, having as its object the consolidation of\nholdings, nothing in this Ordinance shall affect the validity or enforceability of__\n(a)     the acts or proceedings of any society as aforesaid or of its managing committee\nor servants;\n(b)     any decision of any society as aforesaid approving by a two-thirds majority of\nits whole membership, a scheme for the re-arrangement of the holdings of all or\nany members of such society; or\n(c)     the acts, proceedings and awards done, taken or made by the Registrar acting as\narbitrator, or by a person appointed by the Registrar in accordance with the bye-\nlaws of such society and the rules applicable to it, to act as arbitrator, in respect\nof any dispute arising out of or relating to any scheme of rearrangement as\naforesaid, and all such acts, proceedings, decisions and awards shall have such\neffect in relation to the holdings which have been re-arranged thereby, as is\nprovided by the aforesaid bye-laws and rules."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Power to make rules. (1) The Board of Revenue may after previous publication make rules",
      "content": "for the purpose of carrying into effect the provisions of this Ordinance.\n(2) In particular and without prejudice to the generality of the foregoing power, the Board of\nRevenue may, in the manner prescribed by the last preceding sub-section, make rules__\n(a)     prescribing the minimum area of land to be held by the persons making an\napplication under sub-section (2) of section 3;\n(b)     providing for the particulars to be contained in any application made under sub-\nsection (2) of section 3;\n(c)     providing for the procedure to be followed by the Consolidation Officer and for\nthe appointment and constitution of an Advisory Committee or Panchayat to\nassist the Consolidation Officer in the examination or the preparation of the\nscheme;\n(d)     providing for the manner in which the costs of the consolidation proceedings\nshall be assessed;\n(e)     providing for the appointment of guardians ad litem for minors;\n(f)     for determining the value of lands and the compensation to be paid therefor;\n(g)     for the guidance of Consolidation Officers in respect of the transfer of\nincumbrances and leases;\n(i)     generally for the guidance of the Consolidation Officers and other officers and\npersons in all proceedings under this Ordinance; and\n(j)     for appointment of an officer or officers to supervise the consolidation\noperations and to supervise and control the consolidation staff."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Repeal. The Punjab Consolidation of Holdings Act, 1936 (pb IV of 1936), and the North",
      "content": "West Frontier Province Consolidation of Holdings Act, 1946 (N.W.F.P. IX of 1946), are hereby\nrepealed.\n__________\np11wns24812\nRGN Date: 18-06-2025"
    }
  ],
  "definitions": []
}
