{
  "id": "pk-west-pakistan-control-of-goondas-ordinance-1959",
  "type": "statute",
  "title": "West Pakistan Control of Goondas Ordinance, 1959",
  "title_en": "West Pakistan Control of Goondas Ordinance, 1959",
  "short_name": "WPCOG",
  "status": "in_force",
  "issued_date": "1959-06-03",
  "in_force_date": "1959-06-03",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tnbQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Control of Goondas Ordinance, 1959 (XXXV of 1959) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Offences cognizable and non",
      "content": "bailable\n22-A. Appointment and duties of Probation Officers\n22-B. Action on Probation Officers report"
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Repeal",
      "content": "1959\nWEST PAKISTAN ORDINANC No. XXXV OF 1959.\n[4th June, 1959]\nAN\nto consolidate and amend the law relating to the control of disorderly persons commonly known as\ngoondas in the Province of West Pakistan.\nPreamble. WHEREAS it is expedient to consolidate and amend the law relating to the control\nof disorderly persons commonly known as goondas in the Province of West Pakistan ;\nNOW, THEREFORE, in pursuance of the Presidential Proclamation of the seventh day of\nOctober, 1958, and in exercise of all powers enabling him in that behalf, the Governor of West Pakistan\nis pleased to make and promulgate the following Ordinance:__"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent. (1) This Ordinance may be called the West Pakistan Control of",
      "content": "Goondas Ordinance, 1959.\n1\n[(2) It shall extend to the whole of the Province of West Pakistan, except the Tribal Areas.]\n1\n[1-A. Definitions. In this Ordinance, unless the context otherwise requires, the following\nexpressions shall have the meanings hereby respectively assigned to them, that is to say–\n(a)        “Government” means the Government of West Pakistan;\n(b)        “prescribed” means prescribed by rules made under this Ordinance; and\n(c)        “Tribunal” means the Tribunal constituted under section 2.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Constitution of Tribunal. (1) In every district there shall be a Tribunal to deal with cases",
      "content": "under this Ordinance arising within the district.\n(2) The Tribunal shall consist of the officer holding for the time being the office of the District\nMagistrate or any Magistrate of the first class especially empowered by Government in this behalf."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Powers of Tribunal. (1) For the purpose of conducting inquiries under this Ordinance, the",
      "content": "Tribunal shall have all the powers of a District Magistrate under the Code of Criminal Procedure, 1898\n(X of 1898), for issuing summonses and warrants, for compelling attendance of witnesses and\nproduction of documents for the examination of persons complained against and witnesses, and for\nissuing commissions for the examination of witnesses.\n(2) Proceedings before the Tribunal shall be deemed to be judicial proceedings.\n1\nSubs. and Ins. by West Pakistan Ordinance No. XI of 1968, ss. 2-3."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Contempt proceedings. The Tribunal shall for purposes of section 480 of the Code of",
      "content": "Criminal Procedure, 1898 (V of 1898), be deemed to be a court."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Cognizance of cases by Tribunal. (1) No Tribunal shall take cognizance of a case under",
      "content": "this Ordinance unless__\n(a)        (i)         the person complained against resides, or\n(ii)        the acts mentioned in clauses (a) to (l) of section 13 are alleged to have been\ncommitted,\nwithin the local limits of its jurisdiction; and\n1\n[(b)   the officer in charge of the police-station within the jurisdiction whereof such place as\naforesaid lies, or in areas which are not within the jurisdiction of any police-station, the\nExtra Assistant Commissioner within whose jurisdiction such place lies or any other\nofficer authorised in this behalf by the District Magistrate, lays information with the\nTribunal under sub-section (2).]\n(2) The information shall be signed by the police-officer concerned and shall briefly set out__\n(a)        the practices with which the person complained against is charged;\n(b)        instances, with details of time and place of such practices;\n(c)        a statement of any relevant general repute in which such person is held and any\nother ground on which the information is based;\n(d)        names and other particulars of witnesses who will be produced to support the\nallegations contained in the information; and\n(e)        prayer as regards action to be taken against him."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Summoning of the persons. On receipt of information under section 5, the Tribunal may",
      "content": "summon the person complained against to appear before it, and shall, as soon as he appears before it,\nsupply him with a copy of the information laid against him:\nProvided that the Tribunal may, for reasons to be recorded, in the very first instance or at any\nlater stage of the inquiry, instead of issuing summons, issue a warrant, non-bailable or bailable, in such\nsum as may appear to it reasonable, for the arrest of the aforesaid person and his production before the\nTribunal__\n(i)        if it is satisfied that the said person is hiding himself to evade service of the summons,\nor\n(ii)       if he does not appear in spite of the service of the summons, or\n(iii)      if it is, for any other reason, satisfied that such action is necessary."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Procedure where a person absconds or conceals himself. If the Tribunal has reason to",
      "content": "believe that a person against whom a warrant of arrest has been issued under section 6, has absconded,\nor is concealing himself so that the warrant cannot be executed, it may__\n1\nSubs. by West Pakistan Ordinance No. XXII of 1965, s. 2.\n(a)       send a report to a Magistrate having jurisdiction in the area where the person\ncomplained against ordinarily resides or has his property or is present, and the\nsaid Magistrate shall take proceedings under sections 87, 88 and 89 of the Code\nof Criminal Procedure, 1898, in respect of such person and his property as if the\nwarrant were a warrant issued by the said Magistrate; or\n(b)       by order notified in the Gazette, direct such person to appear before it, at such\nplace and within such period as may be specified in the order; and if such person\nomits to comply with the directions, he shall, unless he proves that it was not\npossible for him to comply therewith and that he had, at the first possible\nopportunity within the period sent information to the Tribunal of the reason\nwhich rendered compliance therewith impossible and of his whereabouts, be\ndeemed to have evaded compliance with the order."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Appearance before Tribunal. (1) The Tribunal may, when the person complained against",
      "content": "appears before it, take from him a bond, with or without sureties, for his appearance during the inquiry\nor when called upon, as the case may be, and may also, having regard to the nature of the information\nlaid against him, require him to furnish a bond, with one or more sureties, in such sum as the Tribunal\nmay think fit, to be of good behaviour until the conclusion of the inquiry and may direct that he be\ndetained in custody until such bond is executed, or in default of execution, until the inquiry is\nconcluded.\n(2) The Tribunal may, for reasons to be recorded, instead of taking a bond for the appearance\nof the person complained against, order his detention till the conclusion of the inquiry in such prison\nas it thinks suitable:\nProvided that such detention shall not exceed two months unless his case has been referred to\nthe Commissioner and the latter has agreed to such detention."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Joint proceedings. Where two or more persons are associated together with regard to any",
      "content": "matter covered by the allegations contained in the information laid in respect of them, to an extent\nwhich in the opinion of the Tribunal justifies such a course, the inquiry into the matter with regard to\nwhich they are associated together may be conducted against all, or any of them jointly."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Proceedings before Tribunal. The Tribunal shall proceed to inquire into the truth or",
      "content": "otherwise of the information upon which action has been taken, and for that purpose may record such\nevidence as may appear necessary, following in all such cases, the procedure prescribed in the Code\nof Criminal Procedure, 1898, for conducting trials and recording evidence in summons cases, but\nsubject to the special provisions of this Ordinance."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Tribunal may act on the evidence recorded by its predecessor. Whenever any Tribunal,",
      "content": "after having heard and recorded the whole or any part of the evidence in an inquiry, ceases to exercise\njurisdiction therein, and is succeeded by another Tribunal, which has and which exercises such\njurisdiction, the Tribunal so succeeding may act on the evidence so recorded by its predecessor or\npartly recorded by its predecessor and partly recorded by itself; or may resummon the witnesses and\nre-commence the inquiry."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Orders by Tribunal. 1[(1) Notwithstanding anything to the contrary contained in any other",
      "content": "law for the time being in force, the Tribunal may__\n1\nSubs. by West Pakistan Ordinance No. XI of 1968, s. 4.\n(a)       receive and consider evidence of general repute of previous convictions, or of\nprevious occasions on which the person complained against was bound over to\nkeep the peace or be of good behaviour;\n(b)       for reasons to be recorded in writing, eccept evidence on affidavit of witnesses\nwhose presence cannot be secured without such amount of delay or expense as\nwould in the opinion of the Tribunal be un-reasonable in the circumstances of\nthe case, or on any other ground sufficient in its opinion and connected with any\nmatter arising in the case.]\n(2) The Tribunal may grant immunity from prosecution for any offence other than that of giving\nfalse evidence to any witness appearing in an inquiry under this Ordinance in respect of any matter\nrelevant to the inquiry.\n(3) The Tribunal may direct any Magistrate having jurisdiction in the area to take such steps as\nmay be necessary to protect the life and property of any person who has given or is required to give\nevidence in any inquiry under this Ordinance.\n1\n[13. Declaration of Goondas. If the Tribunal is satisfied, as a result of enquiry held under this\nOrdinance, that the person complained against__\n(a)       keeps or manages a drinking or gambling den or a place where opium or other\nintoxicating drugs are smoked or otherwise consumed, or makes a livelihood\nout of such den or place by acting as a tout or otherwise howsoever; or\n(b)       engages in the illicit manufacture or sale of liquor or opium or other intoxicating\ndrugs; or\n(c)       keeps or manages a brothel as defined in the West Pakistan Suppression of\nProstitution Ordinance, 1961, or is a tout of prostitutes, or lives, wholly or in\npart, on the earnings of prostitutes; or\n(d)       frequents, for immoral purposes, houses or localities inhabited by prostitutes; or\n(e)       frequents resorts of vice such as drinking or gambling dens, or places where\nopium or other intoxicating drugs are smoked or otherwise consumed; or\n(f)       makes fraudulent collection in the name of charity; or\n(g)       is frequently drunk and disorderly in public; or\n(h)       is in the habit of using obscene or abusive language in public; or\n(i)       corrupts persons under eighteen years of age by initiating them into vices such\nas drinking or gambling or immoral behaviour; or\n(j)       annoys or molests persons, particularly women or persons under eighteen years\nof age; or\n1\nSubs. by West Pakistan Ordinance No. XI of 1968, s. 5.\n(k)     does obscene acts such as willful exposure of his person in public; or\n(l)     insults the modesty of women by using foul language or making indecent\nsounds or gestures, or by exposure of his person or the person of any other\nindividual or of any object or otherwise howsoever; or\n(m)     behaves riotously in public by entering into affrays, or otherwise howsoever; or\n(n)     causes fear or alarm to the public or any section or member thereof, by issuing\nthreats, verbally or in writing, or by making, publishing or circulating false\nstatements, rumors or reports; or\n(o)     indulges in criminal intimidation as defined in section 503 of the Pakistan Penal\nCode; or\n(p)     makes a livelihood, or extorts money or other property or seeks any concession\nor favor from any one, by any form of intimidation; or\n(q)     defies the law generally and endangers public peace; or\n(r)     habitually moves, carries, takes or sends, by any means whatsoever, any goods\nwithout the payment of any tax, duty or fee imposed by law or in contravention\nof any lawful order; or\n(s)     habitually receives or deals in property which he knows or has reason to believe\nto be stolen property as defined in section 410 of the Pakistan Penal Code; or\n(t)     habitually kidnaps, abducts or seduces women persons of un-sound mind or\nminors within the meaning of section 360, 361, 362 or 366-A of the Pakistan\nPenal Code; or\n(u)     publishes, distributes, circulates, sells or offers for sale any obscene book or\npicture or other objects; or\n(v)     habitually indulges in unnatural carnal inter-course; or\n(w)     habitually counterfeits or habitually and intentionally utters counterfeit coins;\nor\n(x)     is by habit a forger; or\n(y)     makes a livelihood by cheating, fraud, black-marketing (that is to say, engaging\nin transactions involving the transfer, sale or movement of goods in\ncontravention of any lawful order controlling such transfer, sale or movement),\nacting as an intermediary between bribe-givers and corrupt officials or persons\nin public life, or by any other corrupt or dishonest means; or\n(z)     abets the commission of any of the acts mentioned in the aforesaid clauses or\nbreach of any order made under this Ordinance, or harbours a goonda, not being\nthe wife or the husband of such goonda;\nit shall declare that such person is a goonda, and shall direct that his name be publicly notified in the\nprescribed manner, and be placed on the prescribed list of goondas.]"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Special orders against goondas. (1) While making a declaration under section 13 the",
      "content": "Tribunal may act in such one or more of the following ways as it may deem fit:__\n(a)       it may require him to furnish a bond, with one or more sureties, for such period\nnot exceeding 1[three years] and in such amount as may be specified, to be of\ngood behaviour, provided that, where he is a minor, the bond executed by a\nsurety or sureties only may be accepted;\n(b)       it may, in view of his age and antecedants, and the fact that some person of\nmature age, who is in a position of authority over him by virtue of relationship\nor otherwise, undertakes to become responsible for his good behaviour and\nexecutes a bond or other document to the satisfaction of the Tribunal to this\neffect, release him after due admonition;\n(c)       it may, where he fails to execute the bond or cannot produce a surety or sureties\nto the satisfaction of the Tribunal, order him to be detained in prison until he\nexecutes the bond or until a satisfactory surety or sureties if required, are\navailable or, failing that, the term of the order under clause (b) expires or until\nthe Tribunal makes any other order about him;\n(d)       it may direct that__\n(i)        his movements be restricted to any place or area specified in the order;\n(ii)       or may direct him to report himself at such times and places and in such\nmode as may be specified in the order;\n(iii)      or it may make both the directions;\n(iv)       or may direct that he shall not reside within areas specified in the order;\n(e)       it may direct that he shall not visit or go within surroundings specified in the\norder, or, any of the undermentioned places, without the written permission of\nthe officer in charge of the police-station within whose jurisdiction such place\nis situated, namely:__\n(i)        schools, colleges, and other institutions where persons under eighteen\nyears of age or women are given education or other training or are\nhoused permanently or temporarily ;\n(ii)       theatres, cinemas, fairs, amusement parks, and other places of public\nentertainment;\n(iii)      public halls, restaurants, tea-shops and other places of public resort;\n(iv)       public or private parks and gardens;\n1\nSubs. by West Pakistan Ordinance No. XI of 1968, s. 6.\n(v)     public or private playing fields and race-courses; or\n(vi)    the scene of any public meeting or procession or any assemblage of the\npublic whether in an enclosed place or otherwise, in connection with any\npublic event or festival or other celebrations.\n(2) No order under clause (d) or clause (e) of sub-section (1) shall be made operative for a\nperiod exceeding three years and without hearing the goonda in respect thereof."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Publication of declaration. An order under section 13 declaring any person to be a goonda",
      "content": "shall be published along with a statement of the order or orders if any made in respect of such person\nunder section 14, in such manner and containing such details as may be prescribed."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Bond under Tribunal’s orders. (1) Every bond furnished in compliance with an order",
      "content": "made by the Tribunal under this Ordinance shall be in the form prescribed by the Code of Criminal\nProcedure, 1898, for a bond of the same description:\nProvided that the Tribunal may direct that the sureties offered be scrutinised by a Magistrate\nof the first class nominated for the purpose by it.\n(2) Any surety may apply to be released from the obligations of his bond, and the Tribunal\nmay, after such enquiry as it may deem fit, call upon the person who is bound over to furnish a fresh\nsurety, and thereupon the provisions of sub- section (1) shall apply in relation thereto:\nProvided that the surety seeking release shall not be released from his obligations unless a fresh\nsurety has been accepted in his place or, in case no surety is furnished or accepted, he produces the\nperson concerned before the Tribunal.\n(3) The Tribunal may, where a person who has furnished a bond for his appearance makes\ndefault, direct, in addition to action under the other provisions of this Ordinance, that a warrant which\nmay be bailable or non-bailable as the Tribunal may direct shall be issued for the production of such\nperson.\n(4) The provisions of section 514 of the Code of Criminal Procedure, 1898, shall apply in\nrespect of the forfeiture of bonds furnished under this Ordinance, as if for the expression “Court” the\nexpression “Tribunal” wherever applicable for the purpose of this Ordinance, was substituted, and as\nif from sub-section (1) of the said section, the reference to a Magistrate of first class was omitted, and\nas if in sub-section (7) of the said section__\n(i)     the reference to section 106 or section 118 or section 562 of that Code was\nreplaced by a reference to clause (a) of sub-section (1) of section 14 of this\nOrdinance ; and\n(ii)    the reference to a bond executed in lieu of the bond under section 514 B of that\nCode was replaced by a reference to the proviso to clause (a) of sub-section (1)\nof section 14 of this Ordinance.\n(5) A breach of any order made against any person under clause (d) or clause (e) of sub-section\n(1) of section 14, or the further commission of any of the acts mentioned in section 13, or the\ncommission of any offence which is punishable with imprisonment under any law for the time being\nin force and which in the opinion of the Tribunal involves or implies moral turpitude, shall amount to\na breach of a bond for good behaviour which may have been furnished by him under this Ordinance."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Discharge of person informed against. If, on an inquiry under section 10, it is proved that",
      "content": "action under section 13 is not necessary the Tribunal shall make an entry on the record to that effect,\nand if such person is in custody only for the purposes of the inquiry, shall release him, or, if such\nperson is not in custody, shall discharge him."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Appeal against the orders of the Tribunal. (1) An appeal from an order made by a",
      "content": "Tribunal under section 4, section 8, section 13, section 14 or section 16, shall lie to the Commissioner\nof the Division in which the Tribunal exercises its jurisdictions.\n(2) The provisions of the Limitation Act, 1908 (IX of 1908), shall apply to an appeal under\nsub-section (1):–\nProvided that the period of limitation for an appeal shall be thirty days from the date of the\norder.\n(3) The Commissioner on hearing the appeal may__\n(a)    discharge the person complained against, or\n(b)    dismiss the appeal, or\n(c)    subject to the provisions of this Ordinance modify the order appealed against in\nsuch manner as he may think fit."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Revision of Tribunal’s orders. In relation to any such order under section 4, or section",
      "content": "13, or section 16 the High Court may call for the record of the case, and if the Tribunal or the\nCommissioner appears__\n(a)    to have exercised a jurisdiction not vested in it by law, or\n(b)    to have failed to exercise a jurisdiction so vested, or\n(c)    to have acted in the exercise of its jurisdiction illegally,\nthe High Court may make such direction as it may deem sufficient for the rectification of the error or\nomission and the Tribunal or the Commissioner shall conduct itself, or himself, as the case may be,\naccordingly."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Photographs, fingerprints, etc. Every person, in respect of whom an order has been made",
      "content": "under section 13 shall, if so directed by the Tribunal present himself before such officer of Government\nand at such place and time as may be specified in the order__\n(i)    for being photographed,\n(ii)   for giving his finger impressions or, if literate, specimens of his handwriting and\nsignature,\nand such person shall allow himself to be photographed and shall affix his finger impressions as\nrequired, and, as the case may be, supply specimens of his handwriting and signature."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Punishment. (1) Whoever contravenes any order made under clause (d) or clause (e) of",
      "content": "sub-section (1) of section 14, shall be punished with imprisonment of either description which may\nextend to two years, or with fine, or with both.\n(2) Whoever contravenes any order made or disobeys any direction given under this Ordinance\nshall be punished with imprisonment of either description which may extend to one year or with fine\nor with both.\n(3) Whoever contravenes any order made or disobeys any direction given under this Ordinance\nmay be punished with whipping in addition to any other punishment to which he may be liable under\nthis section.\n1\n[21-A. Enhanced punishment in some cases. Notwithstanding anything contained in the\nPakistan Penal Code, the Whipping Act, 1909, or any other law for the time being in force, when a\ngoonda is convicted under an enactment mentioned in the First Schedule to this Ordinance, for an\noffence punishable under any of the sections of that enactment mentioned against it in the second\ncolumn of the said Schedule, the maximum punishment that may be awarded to him on such conviction\nshall be that appearing in the corresponding entry in the third column thereof.]"
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Effect of laws and enactment. The provisions of this Ordinance, and any order made or",
      "content": "action taken under this Ordinance, shall have effect notwithstanding anything inconsistent therewith\ncontained in any enactment, other than this Ordinance, for the time being in force, and in any\ninstrument having effect by virtue of any such enactment other than this Ordinance."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Bar on civil or criminal proceedings. No proceedings taken or orders passed under this",
      "content": "Ordinance, shall be called in question otherwise than as provided hereunder, and no civil or criminal\nproceedings shall be instituted against any person for anything done or intended to be done under this\nOrdinance, or against any person for any loss or damage caused to, or in respect of, any property as a\nresult of an act done or intended to be done under this Ordinance.\n1\n[25. *            *                    *                  *     *             *              * ]"
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Custody of records. The record of the proceedings held by a Tribunal shall, after disposal",
      "content": "of the case, be kept in such custody as Government may prescribe."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Transfer of cases. (1) Government may by an order in writing transfer a case from one",
      "content": "Tribunal to another in the Province.\n(2) The Commissioner may by order in writing transfer a case from one Tribunal to another\nwithin a division.\n2\n[27-A. Withdrawal from proceedings. A Public Prosecutor may, with the consent of the\nTribunal, withdraw from any proceedings pending before the Tribunal against any person, and upon\nsuch withdrawal, such person, if in custody only for the purposes of such proceedings, shall be\nreleased, or if such person is not in custody, shall be discharged.]"
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Rule. (1) Government may make rules4, not inconsistent with the provisions of this",
      "content": "Ordinance, for carrying out the purposes of this Ordinance.\n(2) Without prejudice to the generality of the power conferred by sub- section (1) such rules\nmay provide for__\n(a)      the lists to be maintained in which the names of goondas are to be registered,\nand the manner of such registration;\n(b)      the manner in which the names of persons who are declared to be goondas\nshould be publicly notified; and\n1\nAdded and omitted by West Pakistan Ordinance No. XI of 1968, s. 8-9.\n2\nAdded by West Pakistan Ordinance No. XXIII of 1962, s. 2.\n(c)        the manner in which an order under clause (d) of sub-section (1) of section 14\nshall operate."
    },
    {
      "provision_ref": "sec1961",
      "section": "1961",
      "title": "Section 1961. offence",
      "content": "(see section 29)\nYear        No.                  Short title                      Extent of repeal\n1          2                        3                                  4\n1951    XIV        The Punjab Control of Goondas Act, 1951. The whole.\n1952    XXVIII     The Sind Control of Goondas Act, 1952.    The whole.\n1952    XXIX       The Karachi Control of Disorderly Persons The whole.\nAct, 1952.\n1959    IV         The Sind Acts Extension to Khairpur Entry 8 of the first Schedule.]\nDistrict Ordinance, 1959.\nRGN. Dated.09-10-2025"
    }
  ],
  "definitions": []
}
