{
  "id": "pk-west-pakistan-departmental-inquiries-powers-act-1958",
  "type": "statute",
  "title": "West Pakistan Departmental Inquiries (Powers) Act, 1958",
  "title_en": "West Pakistan Departmental Inquiries (Powers) Act, 1958",
  "short_name": "WPDIA",
  "status": "in_force",
  "issued_date": "1958-09-19",
  "in_force_date": "1958-09-19",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tmaw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Departmental Inquiries (Powers) Act, 1958 (XLV of 1958) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent. (1) This Act may be called the West Pakistan Departmental Inquiries",
      "content": "(Powers) Act, 1958.\n1\n[(2) It extends to the whole of the Province of West Pakistan, except the Tribal Areas.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Power to summon witnesses and to compel production of documents. An officer",
      "content": "conducting a departmental inquiry against a Government servant under any rules for the time being in\nforce, may exercise the same powers for compelling the attendance of witnesses 2[,] production of\ndocuments 2[and issuing commissions for the examination of witnesses] as are exercisable by a civil\ncourt under the Code of Civil Procedure, 1908 (V of 1908):\nProvided that the process issued by the officer conducting the departmental inquiry shall be\nserved and executed by the civil court having jurisdiction in the place where the witness or the person\nin possession of the document, as the case may be, resides."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Penalties. Any person disobeying a process issued by an officer in exercise of the powers",
      "content": "conferred by section 2 shall be liable to the same penalties to which he would have been liable if he\nhad disobeyed a process issued by the civil court."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Repeal. The West Pakistan Departmental Inquiries (Powers) Ordinance, 1958 (West",
      "content": "Pakistan Ordinance No. XV of 1958), is hereby repealed.\nRGN Date: 22-08-2025\n1\nSubs. by the West Pakistan Laws (Extension to Karachi) Ordinance, 1964 (VII of 1964), s. 2 and Sch.\n2\nReplaced and Ins. by Ordinance No. XI of 1961, s. 2."
    }
  ],
  "definitions": []
}
