{
  "id": "pk-west-pakistan-epidemic-diseases-act-1958",
  "type": "statute",
  "title": "West Pakistan Epidemic Diseases Act, 1958",
  "title_en": "West Pakistan Epidemic Diseases Act, 1958",
  "short_name": "WPEDA",
  "status": "in_force",
  "issued_date": "1958-04-29",
  "in_force_date": "1958-04-29",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tiaw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Epidemic Diseases Act, 1958 (XXXVI of 1958) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Act may be called the West Pakistan Epidemic",
      "content": "Diseases Act, 1958.\n1\n[(2) It extends to the whole of the 2[Pakistan].].\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Power to take special measures and prescribed regulations as to dangerous epidemic",
      "content": "disease. (1) When at any time the Provincial Government is satisfied that the Province or any part thereof\nis visited by, or threatened with, an outbreak of any dangerous epidemic disease, the Provincial\nGovernment, if it thinks that the ordinary provisions of the law for the time being in force are insufficient\nfor the purpose, may take, or require or empower any person to take, such measures and, by public notice,\nprescribe such temporary regulations to be observed by the public or by any person or class of persons as\nit shall deem necessary to prevent the outbreak of such disease or the spread thereof, and may determine\nin what manner and by whom any expenses incurred (including compensation, if any) shall be defrayed.\n(2) In particular and without prejudice to the generality of the foregoing provisions, the Provincial\nGovernment may take measures and prescribe regulations for the inspection of persons travelling by\nrailway or otherwise, and the segregation, in hospital, temporary accommodation or otherwise, of persons\nsuspected by the inspecting officer of being infected with any such disease.\n(3) The Provincial Government may, by general or special order, empower a Deputy\nCommissioner to exercise in relation to the district all the powers under this section exercisable by the\n1\nSubs. by the West Pakistan Laws (Extension to Karachi) Ordinance, 1964 (Ordinance No. VII of 1964), s. 2, Schedule.\n2\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. 4 of 1975), see Article 2 and Schedule.\nProvincial Government in relation to the Province, other than the power to determine in what manner and\nby whom any expenses incurred (including compensation, if any) shall be defrayed.\n(4) The exercise of powers delegated by the Provincial Government shall be subject to such\nrestrictions, limitations and conditions, if any, as may be specified by the Provincial Government and to\nthe control of, and to revision by the Provincial Government."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Penalty. Any person disobeying any regulation or order made under this Act shall be deemed",
      "content": "to have committed an offence punishable under section 188 of the Pakistan Penal Code."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Protection to persons acting under act. No suit or other legal proceeding shall lie against any",
      "content": "person for anything done or in good faith intended to be done under this Act."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Repeal. The following enactments are hereby repealed",
      "content": "(a)     the Epidemic Diseases Act, 1897 (III of 1897) ;\n(b)     the Khairpur State Epidemic Diseases Act, 1941 (Khairpur Act of 1941) ; and\n(c)     the Epidemic Diseases (Punjab Amendment) Act, 1944 (Punjab Act III of 1944).\n________\n3587                                                                       RGN Date: 03-04-2025"
    }
  ],
  "definitions": []
}
