{
  "id": "pk-west-pakistan-essential-services-maintenance-act-1958",
  "type": "statute",
  "title": "West Pakistan Essential Services (Maintenance) Act, 1958",
  "title_en": "West Pakistan Essential Services (Maintenance) Act, 1958",
  "short_name": "WPESA",
  "status": "in_force",
  "issued_date": "1958-04-24",
  "in_force_date": "1958-04-24",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5prbQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Essential Services (Maintenance) Act, 1958 (XXXIV of 1958) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Act may be called the West Pakistan",
      "content": "Essential Services (Maintenance) Act, 1958.\n1\n[(2) It extends to the whole of the Province of West Pakistan, except the Tribal Areas.]\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context",
      "content": "(i) \"employment\" means any service for which remuneration is received;\n(ii) \"essential service\" means a service to the employment of which this Act applies;\n(iii) \"Government\" means the Government of West Pakistan."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Employment to which this Act applies. This Act shall apply to all employment under the",
      "content": "Government or any agency set up by it or a local authority or any service relating to transport or civil\ndefence."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to order persons engaged in certain employments to remain in specified areas",
      "content": "(1) The Government or an officer authorised in this behalf by the Government may, 2[if the public\ninterest so requires,] by general or special order, direct that any person or persons engaged in any\nemployment or class of employment to which this Act applies shall not depart out of such area or areas\nand for such period not exceeding three months as may be specified in such order.\n(2) An order made under sub-section (1) shall be published in such manner as the Government,\nor the officer making the order, considers best calculated, to bring it to the notice of the persons affected\nby the order."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Offences. Any person engaged in any employment or class of employment to which this Act",
      "content": "applies who —\n1\nSubs. by the West Pakistan Laws (Extension to Karachi) Ordinance, 1964 (Ordinance No. VII of 1964), s. 2 read with Schedule, Serial No.10.\n2\nIns. by the West Pakistan Laws (Amendment) Ordinance, 1965 (Ordinance No. XXXIV of 1965), s. 3 read with Second Schedule, Serial No. 13.\n(a)     disobeys any lawful order given in the course of such employment, or attempts\nto persuade any person to disobey any such order, or\n(b)     without reasonable excuse abandons such employment or absents himself from\nwork, or\n(c)     departs from any area specified in an order under sub-section (1) of section 4\nwithout the consent of the Government or the authority making that order,\nand any employer of a person engaged in an employment or class of employment to which this Act\napplies, who without reasonable excuse—\n(1) discontinues the employment of such person, or\n(2) by closing an establishment in which such person is engaged, causes the discontinuance of\nhis employment, or\n(3) discontinues or causes the discontinuance of an essential service,\nis guilty of an offence under this Act.\nExplanation 1— The fact that a person apprehends that by continuing in his employment he\nwill be exposed to increased physical danger is not reasonable excuse within the meaning of clause\n(b).\nExplanation 2.— A person abandons his employment within the meaning of clause (b) who,\nnotwithstanding that it is an express or implied term of his contract of employment that he may\nterminate his employment on giving notice to his employer of his intention to do so, so terminates his\nemployment without the previous consent of his employer."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Regulation of wages and conditions of service. (1) The Government may make rules",
      "content": "regulating or empowering specified authorities to regulate the wages and other conditions of service\nof persons or of any class of persons engaged in any employment or class of employment to which this\nAct applies.\n(2) When any such rules have been made, or when any directions regulating wages or\nconditions of service have been given by the authority empowered by such rules to give them, any\nperson failing to comply therewith is guilty of an offence under this Act."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Penalties and procedure. (1) Any person found guilty of an offence under this Act, shall",
      "content": "be punishable with imprisonment for a term which may extend to one year and shall also be liable to\na fine.\n(2) Where the person accused of an offence under this Act is a company or other body\ncorporate, every director, manager, secretary or other officer thereof shall, unless he proves that the\noffence was committed without his knowledge or that he exercised due diligence to prevent the\ncommission of the offence, be liable to the punishment provided for the offence.\n(3) No court shall take cognizance of an offence under this Act except upon complaint in\nwriting made by an officer empowered by the Government in this behalf."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Bar of legal proceedings. No suit, prosecution or other legal proceeding shall lie against",
      "content": "any person for anything which is, in good faith, done or intended to be done under this Act or the rules\nmade thereunder."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Saving of effect of laws imposing liability to national service. Nothing contained in this",
      "content": "Act or in any declaration or order made thereunder, shall have effect in derogation of any provision of\nlaw which is or may be for the time being in force, imposing upon a person engaged in an employment\nor class of employment to which this Act applies any liability to be called up for national service or to\nundertake employment in the national service."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Repeal. The North",
      "content": "West Frontier Province Essential Services (Maintenance) Act, 1946,\nand the West Pakistan Essential Services (Maintenance) Ordinance, 1957 (VII of 1957), are hereby\nrepealed.\n_______\nRGN Dated: 10-03-2025"
    }
  ],
  "definitions": [
    {
      "term": "employment",
      "definition": "any service for which remuneration is received;",
      "source_provision": "sec2"
    },
    {
      "term": "essential service",
      "definition": "a service to the employment of which this Act applies;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Government of West Pakistan.",
      "source_provision": "sec2"
    }
  ]
}
