{
  "id": "pk-west-pakistan-fisheries-ordinance-1961",
  "type": "statute",
  "title": "West Pakistan Fisheries Ordinance, 1961",
  "title_en": "West Pakistan Fisheries Ordinance, 1961",
  "short_name": "WPFO",
  "status": "in_force",
  "issued_date": "1961-12-12",
  "in_force_date": "1961-12-12",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tiZg%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Fisheries Ordinance, 1961 (XXX of 1961) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Repeal and savings",
      "content": "ORDINANCE NO. XXX OF 1961\n[13th December, 1961]\nAN\nto amend and consolidate the law relating to fisheries in the Province of West Pakistan.\nPreamble. WHEREAS, it is expedient to amend and consolidate the law relating to fisheries\nin the Province of West Pakistan;\nNOW, THEREFORE, in pursuance of the Presidential Proclamation of the seventh day of\nOctober, 1958, and having received the previous instructions of the President, the Governor of West\nPakistan, is pleased in exercise of all powers enabling him in that behalf, to make and promulgate the\nfollowing Ordinance__"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent. (1) This Ordinance may be called the West Pakistan Fisheries",
      "content": "Ordinance, 1961.\n(2) It extends to the whole of the Province of West Pakistan, except 1[the Tribal Areas]."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless the context otherwise requires, the following",
      "content": "expressions shall have the meanings hereby respectively assigned to them, that is to say—\n(a)         “Director of Fisheries” means the Director of Fisheries West Pakistan, and\nincludes any person appointed by Government to discharge the functions of the\nDirector of Fisheries under this Ordinance;\n(b)         “fish” includes shell-fish;\n(c)         “fixed engine” means any net, cage, trap, or other contrivance for taking fish,\nfixed in the soil or made stationery in any other way;\n(d)         “Government” means the Government of the West Pakistan;\n(e)         “licence”, \"permit\", “special licence” and \"special permit\" mean, respectively,\na licence, permit, special licence and special permit, issued under this Ordinance\nor any rule made thereunder;\n(f)         “prescribed” means prescribed by rules made under this Ordinance;\n(g)         “private water” means water which is the exclusive property of any person, or\nin which any person has for the time being an exclusive right of fishery, whether\nas owner, lessee or in any other capacity,\n1\nSubs. by the West Pakistan Laws (Adaptation) Order, 1964, Article 2 (1) read with Schedule, Serial No. 27, (w. e. f. 8.6.1962).\nExplanation— Water shall not cease to be “private water” within the meaning of this\ndefinition by reason only that other persons may have by custom a right of\nfishery therein;\n(h)     “water” includes the sea within a distance of one marine league of the sea coast."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Appointment of Inspectors of Fisheries. (1) Government may, by notification, appoint",
      "content": "such person as it thinks fit to be Inspectors of Fisheries for the purposes of this Ordinance within such\nlocal limits as may be specified.\n(2) Inspectors of Fisheries shall be deemed to be public servants within the meaning of section\n21 of the Pakistan Penal Code (XLV of 1860)."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers of the Director to lease out any water other than private water. (1) The Director",
      "content": "of Fisheries, or such other officer as he may empower in this behalf by general or special order in\nwriting, may, for a period not exceeding three years, lease put, on such conditions as may be\nprescribed, the right to catch fish in any water other than private water.\n(2) Any amount due to Government under the provisions of sub-section (l),and remaining\nunpaid one month after it has become so due, may be recovered as arrears of land revenue."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power of the lessee to issue. (1) The person in whose favour a lease under section 4 is",
      "content": "granted, may issue permits in such form, subject to such conditions and on payment of such fees, as\nmay be prescribed, for the taking of fish in the water the right of fish wherein has been leased to him.\n(2) A permit issued under sub-section (I) shall cease to be valid upon the termination or\ncancellation of the lease in favour of the person issuing the permit."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Destruction of fish by explosive. No person shall use 1[any dynamite, electric shock or",
      "content": "other explosive subs tance] in any water with intent there by to catch or destroy any of the fish that\nmay be therein."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Destruction of fish by poisoning water. No person shall put any poison, lime or noxious",
      "content": "material into any water with intent thereby to catch or destroy any fish that may be therein."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Fish that shall not be taken. No person shall kill, capture, or possess any species of fish",
      "content": "specified in the second column of the First Schedule, of a size less than that specified in the third\ncolumn of the said Schedule against such species."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Net, fixed engine trap, etc, shall not be employed without a permit or licence. (1)No",
      "content": "person shall use or employ for the capture of any species of fish specified in the First Schedule, in any\nwater other than private water, any net, cage, trap or other contrivance for taking fish, or fixed engine,\nexcept during the period permitted in respect of such species under the fourth columns of the said\nSchedule and under a licence or permit issued under this Ordinance.\n(2) Licences under sub-section (1) shall be issued by such authorities, on payment of such fees\nand on such conditions as may be prescribed."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Duty to produce licence or permit on demand made by employees of Fisheries",
      "content": "Department. Every person in possession of any fishing licence or permit shall produce his licfence or\npermit, as the case may be, on a demand made by the Inspector of Fisheries or any other person\nauthorised in this behalf by the Director of Fisheries."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Power to declare any water to be a sanctuary for fish. (1) Notwithstanding anything",
      "content": "contained in this Ordinance, Government may, by notification, declare any water to be sanctuary for\nfish mentioned in the First Schedule for a period which may be specified, and during such period no\nperson shall kill, capture or possess such fish without a special permit issued under this Ordinance by\nthe Director of Fisheries.\n(2) The water in respect of which a notification under this section is made shall be demarcated\nin such manner as may be prescribed."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Duty of Lambardar Village Watchmen etc. Every Lambardar, Village Watchman, Canal",
      "content": "Patwari, P. W D. Darogha, Zilladar, Revenue Patwari, Tapedar, Supervising Tapedar and Qanungo\nshall be bound in the absence of reasonable excuse to give to an Inspector of Fisheries or any other\nperson authorised in this behalf by the Director of Fisheries, information in respect of any un-\nauthorised netting, killing or other offence under this Ordinance committed within the limits of his\nvillage or circle, as the case may be, as soon as the commission of such offence comes to his\nknowledge."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Power of Magistrate to issue search warrant. If a Magistrate has reasons to believe that",
      "content": "an offence under this Ordinance has been, is being, or is likely to be committed, he may issue a warrant\nfor the search of any place in which any fish, net, trap, cage or other contrivance for taking fish, or\nfixed engine is kept or concealed."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Power to search without warrant. An Inspector of Fisheries may, without a warrant from",
      "content": "Magistrate, search any person, vessel, rack, vehicle, ship, boat, raft package, receptacle or covering so\nas to satisfy himself as to whether or not an offence under this Ordinance has been committed."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Arrest without warrant for offences under this Ordinance. (1) An Inspector of Fisheries",
      "content": "may without a warrant arrest any person committing in his view any offence under section 6, 7, 8, 9 or\n11—\n(a)     if the name and address of such person are un-known to him; and\n(b)     if such person declines to give his name and address, or there is reason to doubt\nthe accuracy of the name and address given.\n(2) A person arrested under this section may be detained until his name and address have been\ncorrectly ascertained:\nProvided that no person so arrested shall be detained longer than may be necessary for bringing\nhim before a Magistrate, except under the order of a Magistrate."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Power of seizure. An Inspector of Fisheries, or any person authorized in this behalf by the",
      "content": "Director of Fisheries, may take possession of any net, trap, cage or other contrivance for taking fish,\nor fixed engine used or suspected to have been used in the commission of an offence under this\nOrdinance."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Penalties. Whoever",
      "content": "(a)    contravenes the provisions of section 6, 7 or 11 shall be punished with\nimprisonment of either description which may extend to three months or with\nfine which may extend to five hundred rupees or with both;\n(b)    contravenes the provisions of section 8, 9, 10 or 12 shall be punished with fine\nwhich may extend to one hundred rupees."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Police assistance. Every police officer shall upon request made by a person employed under",
      "content": "this Ordinance assist him in the due discharge of his duties under this Ordinance."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Persons who may lodge complaints. No Court shall take cognizance of any offence under",
      "content": "this Ordinance except on the complaint in writing of an Inspector of Fisheries."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Confiscation of any net trap, cage etc. The Court may order the confiscation of any",
      "content": "net, trap, cage or other contrivance for taking fish, or fixed engine employed in the commission\nof an offence under this Ordinance."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Jurisdiction as respects offences within one marine league of sea coast. If an offence",
      "content": "in respect of this Ordinance is committed within a distance of one marine league of the sea coast then\nsuch offence may be tried, punished and in all respects dealt with as if it had been committed on the\nland abutting such coast."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Protection taken under this Ordinance. No suit, prosecution or other legal proceeding",
      "content": "shall lie against any person for anything which is in good faith done or intended to be done in\npursuance of any provisions of this Ordinance or the rules made thereunder."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Power of Government to add or exclude from First Schedule. Government may, by",
      "content": "notification, —\n(i) add to or exclude from the First Schedule any species of fish subject to such\nconditions as it may impose in each case;\n(ii) alter the period during which any fish specified in the First Schedule may be killed\nor captured."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Power to compound certain offences. (1) Government may, by notification, empower an",
      "content": "Inspector of Fisheries__\n(a) to accept from any person concerning whom evidence exists which if unrebutted\nwould prove that he has committed any offence as described in the first column\nof the Second Schedule a sum of money by way of composition for the offence\nwith regard to which such evidence exists, and on the payment of such sum to\nsuch officer, such person if in custody shall be discharged and no further\nproceedings shall be taken against him;\n(b) when any property has been seized as liable to confiscation, to release the same\nwithout further payment, or on payment of the value thereof as estimated by such\nofficer and on the payment of such value, such property shall be released and no\nfurther proceedings shall be taken in respect thereof.\n(2) The sum of money which may be accepted by way of composition under clause (a) of sub-\nsection (1) for any offence shall in no case exceed the amount mentioned against such offence in the\nsecond column of the Second Schedule."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Delegation of Powers. Government may, by notification, delegate all or any of the",
      "content": "powers conferred upon it under the provisions of this Ordinance to any officer subordinate to it."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Power to make rules. (1) Government may make rules for the purpose of carrying into",
      "content": "effect the provisions of this Ordinance.\n(2) In particular and without prejudice to the generality of the foregoing powers, such\nrules may prescribe__\n(a)     the form in which, and the terms and conditions on which, a licence or a permit\nor a special licence or a special permit may be granted;\n(b)     the authority by which licences under this Ordinance may begranted;\n(c)     the fees to be charged for any licence or permit or special licence or special\npermit.;\n(d)     the conditions subject to which the Director of Fisheries may lease the right\nto catch fish under this Ordinance;\n(e)     in the case of any species of fish, the number and sex that may be killed under\na licence;\n(f)     the rewards to persons who render help in detection of , offences under this\nOrdinance;\n(g)     the utilization of receipts recovered under this Ordinance;\n(h)     prohibit or regulate all or any of the following matters__\n(i)     the erection and use of fixed engines;\n(ii)    the construction of weirs; and\n(iii)   the dimension and kind of nets, cages, traps or other contrivances for\ntaking fish to be used and the modes of using them.\n(3) Such rules may provide that a breach thereof shall be punished with a fine not exceeding\nfifty rupees."
    }
  ],
  "definitions": [
    {
      "term": "Director of Fisheries",
      "definition": "the Director of Fisheries West Pakistan, and includes any person appointed by Government to discharge the functions of the Director of Fisheries under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "fish",
      "definition": "shell-fish;",
      "source_provision": "sec2"
    },
    {
      "term": "fixed engine",
      "definition": "any net, cage, trap, or other contrivance for taking fish, fixed in the soil or made stationery in any other way;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Government of the West Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "private water",
      "definition": "water which is the exclusive property of any person, or in which any person has for the time being an exclusive right of fishery, whether as owner, lessee or in any other capacity, 1 Subs. by the West Pakistan Laws (Adaptation) Order, 1964, Article 2 (1) read with Schedule, Serial No. 27, (w. e. f. 8.6.1962). Explanation— Water shall not cease to be “private water” within the meaning of this definition by reason only that other persons may have by custom a right of fishery therein;",
      "source_provision": "sec2"
    },
    {
      "term": "water",
      "definition": "the sea within a distance of one marine league of the sea coast.",
      "source_provision": "sec2"
    }
  ]
}
