{
  "id": "pk-west-pakistan-foodstuffs-control-act-1958",
  "type": "statute",
  "title": "West Pakistan Foodstuffs (Control) Act, 1958",
  "title_en": "West Pakistan Foodstuffs (Control) Act, 1958",
  "short_name": "WPFA",
  "status": "in_force",
  "issued_date": "1958-04-16",
  "in_force_date": "1958-04-16",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tmag%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Foodstuffs (Control) Act, 1958 (XX of 1958) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Act may be called the West Pakistan",
      "content": "Foodstuffs (Control) Act, 1958.\n1\n[(2) It extends to the whole of West Pakistan, except the Tribal Areas.]\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context",
      "content": "(a)        “foodstuff” means any of the following classes of commodities:__\n(i)        wheat, wheat atta, maida, rawa and suji;\n(ii)       rice and paddy;\n(iii)      sugar; and\n(iv)       such other commodity or class of commodities as may be declared and\nnotified by the Government to be foodstuffs for the purposes of this Act;\n(b)        “Government” means the Government o West Pakistan ; and\n(c)        “notified order” means an order notified in the Official Gazette."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Powers to control supply, distribution, etc., of foodstuffs. (1) The Government, so far as",
      "content": "it appears to it to be necessary or expedient for maintaining supplies of any foodstuffs or for securing\nits equitable distribution and availability at fair prices, may, by notified order, provide for regulating\nor prohibiting the keeping, storage, movement, transport, supply distribution, disposal, acquisition, use\nor consumption thereof and trade and commerce therein.\n1\nSubs. by West Pakistan Ordinance No. VIII of 1963, s. 2.\n(2) Without prejudice to the generality of the powers conferred by sub-section (1) an order\nmade thereunder may provide :__\n(a)     for regulating by licences, permits or otherwise the manufacture of any article\nof food from any foodstuffs;\n(b)     for controlling the prices at which any foodstuff may be bought or sold;\n(c)     for regulating by licences, permits or otherwise, the storage, transport,\ndistribution, disposal, acquisition, use or consumption of any foodstuff;\n(d)     for prohibiting the withholding from sale of any foodstuff ordinarily kept for\nsale;\n(e)     for requiring any person holding stock of any foodstuff to sell the whole or a\nspecified part of the stock to such persons or class of persons or in such\ncircumstances as may be specified in the order;\n(f)     for regulating or prohibiting any class of commercial or financial transactions\nrelating to any foodstuff which, in the opinion of the authority making the order\nis, or is likely to be, detrimental to public interest;\n(g)     for collecting any information or statistics with a view to regulating or\nprohibiting any of the aforesaid matters;\n(h)     for requiring persons engaged in the supply or distribution of, or trade or\ncommerce in, any foodstuff, to maintain and produce for inspection such books,\naccounts and records relating to their business and to furnish such information\nrelating thereto as may be specified in the order; and\n(i)     for any incidental and supplementary matters including, in particular, the\nentering and search of premises, vehicles, vessels and aircraft, the seizure by a\nperson authorised to make such search of any articles in respect of which such\nperson has reason to believe that a contravention of the order has been, is being,\nor is about to be committed, or any records connected therewith, the grant or\nissue of licences, permits or other documents, and the charging of fees therefor."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Delegation of powers. The Government may, by notified order, direct that the power to",
      "content": "make orders under section 3 shall, in relation to such matters and subject to such conditions, if any, as\nmay be specified in the direction, be exercisable also by an officer or authority subordinate to the\nGovernment."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Effect of orders inconsistent with other enactment. Any order made under section 3 shall",
      "content": "have effect notwithstanding anything inconsistent therewith contained in any enactment, other than\nthis Act, or any instrument having effect by virtue of any enactment, other than this Act."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Penalties. (1) If any person contravenes any order made under section 3, he shall be punished",
      "content": "with imprisonment for a term which may extend to three years, or with fine, or with both and, if the\norder so provides, any Court trying such contravention shall direct that any property in respect of which\nthe Court is satisfied that the order has been contravened shall be forfeited to the Government, unless\nfor reasons to be recorded in writing, it is of the opinion that the direction should not be made in respect\nof the whole, or as the case may be, a part of the property.\n(2) The owner of any vessel, conveyance or animal carrying any property in respect of which\nan order under section 3 is contravened, shall, if the carrying is part of the transaction involving the\ncontravention and if he knew or had reason to believe that the contravention was being committed, be\ndeemed to have contravened the order, and, in addition to the punishment to which he is liable under\nsub-section (1), the vessel, conveyance, or animal shall when the order provides for forfeiture of the\nproperty in respect of which the order is contravened, be forfeited to the Government.\n(3) If any person to whom a direction is given under sub-section (3) of section 3 fails to comply\nwith the direction, he shall be punished with imprisonment for a term which may extend to three years,\nor with fine, or with both."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Attempts and abetments. Any person who attempts to contravene, or abets the",
      "content": "contravention of any order made under section 3 shall be deemed to have contravened that order."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Offences by Corporation. If the person contravening an order made under section 3 is a",
      "content": "company or other body corporate, every director, manager, secretary or other officer or agent thereof\nshall, unless he proves that the contravention took place without his knowledge or that he exercised all\ndue diligence to prevent such contravention, be deemed to be guilty of such contravention."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. False statements. If any person",
      "content": "(i)     when required by an order made under section 3 to make any statement or\nfurnish any information, makes any statement or furnishes any information\nwhich is false in any material particular and which he knows or has reasonable\ncause to believe to be false, or does not believe to be true, or\n(ii)    makes any such statement as aforesaid in any book account, record, declaration,\nreturn or other document which he is required by any such order to maintain or\nfurnish,\nhe shall be punished with imprisonment for a term which may extend to three years or with fine or\nwith both."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Cognizance of offences. No Court shall take cognizance of any offence punishable under",
      "content": "this Act except on a report in writing of the facts constituting such offence made by a person who is a\npublic servant as defined in section 21 of the Pakistan Penal Code, 1860 (XLV of 1860)."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Presumption as to orders. (1) No order made in exercise of any power conferred by or",
      "content": "under this Act shall be called in question in any Court.\n(2) Where an order purports to have been made and signed by an authority in exercise of any\npower conferred by or under this Act, a Court shall presume within the meaning of the Evidence Act,\n1872 (I of 1872), that such order was so made by that authority."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Burden of proof in certain cases. Where any person is prosecuted for contravening any",
      "content": "order made under section 3 which prohibits him from doing an act or being in possession of a thing\nwithout lawful authority or without a permit, licence or other document, the burden of proving that he\nhas such authority, permit, licence or other document, shall be on him."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Protection of action taken under the Act. (1) No suit, prosecution or other legal",
      "content": "proceeding shall lie against any person for anything which is, in good faith, done or intended to be\ndone in pursuance of any order made under section 3.\n(2) No suit or other legal proceeding shall lie against the Government for any damage caused\nor likely to be caused by anything which is, in good faith, done or intended to be done in pursuance of\nany order made under section 3."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Repeal. The following enactments are hereby repealed, namely",
      "content": "(1)     The Bahawalpur Foodgrains Control Act, 1947.\n(2)     The Bahawalpur Control of Essential Supplies Commodities Act, 1948 (Bahawalpur\nIII of 1948).\n(3)     The West Pakistan Foodstuffs (Control) Ordinance, 1957 (W.P.Ord. XI of 1957).\n_______\nRGN Date: 18-08-2025"
    }
  ],
  "definitions": [
    {
      "term": "foodstuff",
      "definition": "any of the following classes of commodities:__ (i) wheat, wheat atta, maida, rawa and suji; (ii) rice and paddy; (iii) sugar; and (iv) such other commodity or class of commodities as may be declared and notified by the Government to be foodstuffs for the purposes of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Government o West Pakistan ; and",
      "source_provision": "sec2"
    },
    {
      "term": "notified order",
      "definition": "an order notified in the Official Gazette.",
      "source_provision": "sec2"
    }
  ]
}
