{
  "id": "pk-west-pakistan-goats-restriction-ordinance-1959",
  "type": "statute",
  "title": "West Pakistan Goats (Restriction) Ordinance, 1959",
  "title_en": "West Pakistan Goats (Restriction) Ordinance, 1959",
  "short_name": "WPGO",
  "status": "in_force",
  "issued_date": "1959-07-17",
  "in_force_date": "1959-07-17",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tnaA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Goats (Restriction) Ordinance, 1959 (XLII of 1959) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to make rules",
      "content": "WEST PAKISTAN ORDINANCE No. OF 1959.\n[18th July, 1959]\nAN\nto restrict the number of goats in West Pakistan.\nPreamble. WHEREAS it is expedient in the public interest to restrict the number of goats in\nthe Province of West Pakistan;\nNOW, THEREFORE, in pursuance of the Presidential Proclamation of the seventh day of\nOctober, 1958, and in exercise of all powers enabling him in that behalf, the Governor of West Pakistan\nis pleased to make and promulgate the following Ordinance:__"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent. (1) This Ordinance may be called the West Pakistan Goats",
      "content": "(Restriction) Ordinance, 1959.\n(2) It extends to the whole of the Province of West Pakistan, except 1[* * *] 2[the Tribal Areas]."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless the context otherwise requires, the following",
      "content": "expressions shall have the meanings hereby respectively assigned to them, that is to say__\n(i)        “Government” means the Government of West Pakistan;\n(ii)       “prescribed” means prescribed by rules made under this Ordinance;\n(iii)      “slaughter-house” means any building, premises or place used in connection\nwith the business of killing or slaughtering animals intended for human\nconsumption, and shall include a public slaughter-house maintained by a local\nauthority and a private slaughter-house duly licensed for that purpose under any\nlaw for the time being in force."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Restriction on grazing, etc. of goats. Government may, by notification, declare that in any",
      "content": "specified area, hereinafter referred to as local area, it shall be unlawful__\n(a)        after twelve months of the publication of the notification, to graze or pasture\ngoats on any land; and\n(b)        after eighteen months of the publication of the notification, to keep goats:\n1\nDeleted by the West Pakistan Ordinance No. XXVII of 1961, s. 2.\n2\nSubs. by the West Pakistan Laws (Adaptation) Order, 1964 (w. e. f. 8.6.1962).\nProvided that Government may in any area permit the keeping of goats subject to such\nconditions as may be prescribed."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to regulate movement of goats. Government may in such manner as may be",
      "content": "prescribed regulate the leading, driving, conducting or conveying of goats in any local area."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power to regulate slaughter of goats. Government may in such manner as may be",
      "content": "prescribed regulate the slaughter of goats including the proportion of the goats to the sheep that may\nbe slaughtered in a slaughter-house on any day."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Penalty. Any person who contravenes the provisions of section 3, section 4 or section 5 or",
      "content": "such of the rules made under this Ordinance as may be specified shall be punished with imprisonment\nwhich may extend to six months, or with fine which may extend to five hundred rupees, or with both,\nand in addition thereto the goat concerned in the offence shall be forfeited to Government."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Offence to be cognizable and bailable. Notwithstanding anything contained in the Code of",
      "content": "Criminal Procedure, 1898 (V of 1898), an offence punishable under this Ordinance shall be cognizable\nand bailable within the meanings of the said Code."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Powers of certain officers to arrest the offender. (1) Any officer specially empowered by",
      "content": "Government in this behalf may, without order from a Magistrate and without a warrant, arrest any\nperson committing an offence under this Ordinance or the rules made thereunder and may seize the\ngoat concerned in the offence.\n(2) The officer making an arrest under sub-section (1) shall, without unnecessary delay and\nsubject to the provisions of this Ordinance as to release on bond, take or send the person arrested and\nsuch goat to the nearest police station."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Person arrested and goat seized to be released on bond. (1) Any officer making an arrest",
      "content": "under sub-section (1) of section 8 shall release such person on his executing a bond to appear, when\nso required, before the officer in charge of the nearest police station.\n(2) Where any officer, as aforesaid, has seized any goat, he shall release it to the person from\nwhose possession it was seized or to the owner thereof on his executing a bond for producing it before\nthe officer in charge of the nearest police station."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Power to try the offence summarily. An offence under this Ordinance shall be summarily",
      "content": "triable and in such proceedings the provisions for summary trial prescribed in the Code of Criminal\nProcedure, 1898 (V of 1898), shall apply."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Protection of action taken under the Ordinance. No suit shall lie against any officer for",
      "content": "anything done by him in good faith under this Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "Government",
      "definition": "the Government of West Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "slaughter-house",
      "definition": "any building, premises or place used in connection with the business of killing or slaughtering animals intended for human consumption, and shall include a public slaughter-house maintained by a local authority and a private slaughter-house duly licensed for that purpose under any law for the time being in force.",
      "source_provision": "sec2"
    }
  ]
}
