{
  "id": "pk-west-pakistan-government-dues-recovery-ordinance-1962",
  "type": "statute",
  "title": "West Pakistan Government Dues Recovery Ordinance, 1962",
  "title_en": "West Pakistan Government Dues Recovery Ordinance, 1962",
  "short_name": "WPGDR",
  "status": "in_force",
  "issued_date": "1962-05-24",
  "in_force_date": "1962-05-24",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5prbg%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Government Dues Recovery Ordinance, 1962 (XXII of 1962) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extend and commencement",
      "content": "2.\n3.\n4.\nORDINANCE, 1962\nWEST PAKISTAN ORDINANCE NO. XXII OF 1962\n[25th May, 1962]\nAN\nto provide for the recovery of Government dues as arrears of land revenue in the Province of West\nPakistan.\nPreamble. WHEREAS, it is expedient to provide for the recovery of Government dues as\narrears of land revenue in the Province of West Pakistan in the manner hereinafter appearing;\nNOW, THEREFORE, in pursuance of the Presidential Proclamation of the seventh day of\nOctober, 1958, and in exercise of all powers enabling him in that behalf, the Governor of West Pakistan\nis pleased to make and promulgate the following Ordinance:__"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. In this Ordinance, unless the context otherwise requires, the following expressions shall",
      "content": "have the meanings hereby respectively assigned to them, that is to say__\n(a)        “defaulter” means a person from whom any dues are recoverable by\nGovernment, and includes a person who is responsible as surety for the payment\nof any such dues; and\n(b) “Government” means the Government of the Province of West Pakistan."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. (1) Government may, by notification, declare that any dues or class of dues recoverable by",
      "content": "Government shall be recoverable from the defaulters as if such dues were arrears of land revenue.\n(2) On the publication of a notification under sub-section (1) any such dues shall be\nrecoverable under the Revenue Recoveries Act, 1890 (Act I of 1890) as arrears of land revenue."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Government may make rules for the purpose of giving effect to the provisions of this",
      "content": "Ordinance.\n2342                                                                                                             RGN Date: 20-03-2025\n1\nSubs. by the West Pakistan Laws (Adaptation) Order, 1964, Article 2 (1), read with Schedule, Serial No. 35. (w. e. f. 8.6.1962)."
    }
  ],
  "definitions": []
}
