{
  "id": "pk-west-pakistan-government-servants-benevolent-fund-ordinance-1960",
  "type": "statute",
  "title": "West Pakistan Government Servants Benevolent Fund Ordinance, 1960",
  "title_en": "West Pakistan Government Servants Benevolent Fund Ordinance, 1960",
  "short_name": "WPGSB",
  "status": "in_force",
  "issued_date": "1960-04-22",
  "in_force_date": "1960-04-22",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5toZw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Government Servants Benevolent Fund Ordinance, 1960 (XIV of 1960) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Constitution and powers of the Boards of Management",
      "content": "6-A.   Power to recover rents and lease-moneys as arrears of land revenue\n6-B.   Protection of action taken under this Ordinance"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power to make rules",
      "content": "ORDINANCE, 1960\nWEST PAKISTAN ORDINANCE No. XIV OF 1960\n[23rd April, 1960]\nAN\nto constitute a Benevolent Fund for relief of Government servants and their families.\nPreamble. WHEREAS it is expedient to constitute a Benevolent Fund for relief of Government\nservants and their families in the manner hereinafter appearing;\nNOW, THEREFORE, in pursuance of the Presidential Proclamation of the seventh day of\nOctober, 1958, and in exercise of all powers enabling him in that behalf, the Governor of West Pakistan\nis pleased to make and promulgate the following Ordinance:__"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Ordinance may be called the West Pakistan",
      "content": "Government Servants Benevolent Fund Ordinance, 1960.\n(2) It shall apply to all Government servants, as hereinafter defined; provided that Government\nmay, by notification, except any class of Government servants from the operation of this Ordinance.\n(3) It shall come into force on such date as Government may, by notification, appoint."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. this Ordinance, unless the context otherwise requires, the following expressions",
      "content": "shall have the meanings hereby respectively assigned to them, that is to say__\n(a)     “family” in relation to a Government servant means his or her__\n(i)     wife or wives or husband, as the case may be;\n(ii)    legitimate children and step children less than twelve years old;\n(iii)   legitimate children and step children not less than twelve years old, if\nresiding with and wholly dependent upon him or her;\n(iv)    parents, sisters and minor brothers, if residing with and wholly\ndependent upon him or her;\n(b)     “Fund” means the fund constituted under this Ordinance;\n(c)     “gazetted Government servant” means a Government servant holding a post\ndeclared to be a gazetted post by Government or any authority empowered by\nGovernment in this behalf;\n(d)     “Government” means the Government of West Pakistan;\n1\n[(e)   ‘Government Servant’ means:__\n(i)        a person who is a member of a civil service of the Province; or\n(ii)       a person who holds any civil post in connection with the affairs of the\nProvince, including a member of the Civil Service of Pakistan who has\nopted for the Fund, but excluding any other servant of Pakistan.];\n(f)        “non-gazetted Government servant” means a Government servant other than a\ngazetted Government servant;\n(g)        “prescribed” means prescribed by rules made under this Ordinance."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Fund. (1) As soon as may be, Government shall constitute a fund to be known as the West",
      "content": "Pakistan Government Servants Benevolent Fund.\n(2) The Fund shall be divided into two parts; part I, for gazetted Government servants and part\nII, for non-gazetted Government servants.\n(3) Each part of the Fund shall consist of__\n1\n(a)         [compulsory contributions recovered from] the Government servants at such\nrates as Government may, from time to time, prescribe;\n(b)        such grants as may, from time to time, be made by Government;\n(c)        other contributions and donations;\n(d)        income from investments made under this Ordinance.\n(4) The money credited to the Fund shall be held in such custody as may be prescribed."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Utilization of the Fund. The Fund shall be utilized for",
      "content": "(a)        the relief of Government servants and their families by__\n(i)        giving financial assistance to the families of deceased Government\nservants;\n(ii)       giving financial assistance to Government servants invalided out of\nservice;\n(iii)      making special grants to Government servants in exceptional cases;\n(b)        defraying expenditure incurred in respect of management of the Fund.\nExplanation.__ The benefits admissible under this section will be in addition to the pensions,\nfamily pension or gratuities awarded under the rules regulating the conditions of service of\nGovernment servants.\n1\nSubs. by West Pakistan Ordinance No. XIII of 1962, ss. 2-3."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Accounts and Audit. (1) All contributions 1[recovered] under clause (a) of sub",
      "content": "section (3)\nof section 3 shall be deducted at the source from the salaries of the Government servants concerned.\n(2) The Accountant-General, West Pakisatn, and the Comptrollers, Northern and Southern\nAreas, shall be responsible for keeping the accounts of the Fund. Audit of the assets of and expenditure\nfrom the Fund will be conducted by such authority as may be prescribed."
    }
  ],
  "definitions": [
    {
      "term": "Fund",
      "definition": "the fund constituted under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "gazetted Government servant",
      "definition": "a Government servant holding a post declared to be a gazetted post by Government or any authority empowered by Government in this behalf;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Government of West Pakistan; 1 [(e) ‘Government Servant’ means:__ (i) a person who is a member of a civil service of the Province; or (ii) a person who holds any civil post in connection with the affairs of the Province, including a member of the Civil Service of Pakistan who has opted for the Fund, but excluding any other servant of Pakistan.];",
      "source_provision": "sec2"
    },
    {
      "term": "non-gazetted Government servant",
      "definition": "a Government servant other than a gazetted Government servant;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Ordinance.",
      "source_provision": "sec2"
    }
  ]
}
