{
  "id": "pk-west-pakistan-graveyards-preservation-and-maintenance-act-1958",
  "type": "statute",
  "title": "West Pakistan Graveyards (Preservation and Maintenance) Act, 1958",
  "title_en": "West Pakistan Graveyards (Preservation and Maintenance) Act, 1958",
  "short_name": "WPGAM",
  "status": "in_force",
  "issued_date": "1958-04-18",
  "in_force_date": "1958-04-18",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tmZw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Graveyards (Preservation and Maintenance) Act, 1958 (XXV of 1958) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Act may be called the West Pakistan",
      "content": "Graveyards (Preservation and Maintenance) Act, 1958.\n(2) It extends to the graveyard known as the Miani Sahib Graveyard, Lahore, and the\nGovernment may, by notification, extend all or any of the provisions of this Act, to any other graveyard\nin West Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(1)     “building” includes a building as defined in the City of Lahore Corporation Act,\n1941 (Punjab XV of 1941), and in the Punjab Municipal Act, 1911 (Punjab III\nof 1911);\n(2)     “Committee” means a Committee constituted under section 3 of this Act;\n(3)     “Government” means the Government of West Pakistan;\n(4)     “graveyard” means a graveyard to which all or any of the provisions of this Act,\nhave been extended;\n(5)     “High Court” means the High Court of West Pakistan;\n(6)     “land” includes land defined in the Land Acquisition Act, 1894 (I of 1894);\n(7)     “prescribed” means prescribed by rules made by the Government under this Act;\nand\n(8)     “Tribunal” means a Tribunal constituted under section 7 of this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Constitution of a Committee. (1) As soon as may be, after the enforcement of this Act, or",
      "content": "for one or more of such graveyards a Committee which shall consist of a Chairman, and such number\nof other official and non-official members as may from time to time be specified by the Government.\n(2) Each such Committee shall be a body corporate, and shall have perpetual succession and a\ncommon seal, with power to acquire and hold property, and to contract and do all things necessary for\ncarrying out the purposes of this Act, and may sue and be sued in its corporate name."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Committee to investigate and report. Within such period as may be fixed by the",
      "content": "Government in this behalf, the Committee shall investigate and report regarding__\n(1)     the area of the graveyard according to the various settlement records;\n(2)     the area of the encroachments;\n(3)     the nature and extent of the encroachment made by each person and the probable\ntime of the commencement of the encroachment;\n(4)     the rights possessed by the encroachers with regard to the land encroached upon\nby them;\n(5)     the amount of compensation likely to be paid for the removal of the\nencroachments;\n(6)     the area which shall be declared to be the area of the graveyard; and\n(7)     any other matter which the Government may specify."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Preliminary notification. When a report under section 4 has been received the Government",
      "content": "shall issue a preliminary notification defining the limits of the area proposed to be declared as the area\nof the graveyard specifying the encroachments and requiring, within a time to be specified, the removal\nof all encroachments from that area."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Application for exclusion of land from the area of graveyard. Any person who claims to",
      "content": "have acquired any title to any land or property included within the limits defined in the notification\nissued under section 5, may within three months of the date of such notification, apply to the\nGovernment for the exclusion of such land or property from the area of the graveyard."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Appointment of a Tribunal. The Government shall appoint a Tribunal consisting of a",
      "content": "person who is, has been or is qualified to be appointed a District and Sessions Judge to dispose of the\napplications presented under section 6 in accordance with the provisions of sections 8 and 9."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Nature of orders on establishment of title. (1) If the Tribunal is satisfied that the title of",
      "content": "any person, who has applied under section 6, to any land or property included within the limits defined\nin the notification issued under section 5, has been established, it shall pass an order excluding such\nland or property from the area of the graveyard.\n(2) The Government may, within one year from the date of an order under sub-section (1),\ndeclare by notification in the Official Gazette, that the land or property or any part thereof excluded\nfrom the area of the graveyard under sub-section (1) is required for the purpose of graveyard and after\nmaking such declaration, acquire the land or the property, as far as may be, in accordance with the\nprovisions of the Land Acquisition Act, 1894 (I of 1894)."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Nature of order when title not established. If the Tribunal is satisfied that the title of any",
      "content": "person, who has applied under section 6, to any land or property included in the area defined in the\nnotification issued under section 5 has not been established, it shall pass an order rejecting the\napplication and directing such person to hand over possession of the land or property to the Committee\nwithin such period as may be specified in the order:\nProvided that if the property includes a building the Tribunal shall fix a period, not exceeding\nnine months within which such person shall remove the building materials."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Steps taken on non",
      "content": "compliance of order under section 9. If an order made under section\n9 is not complied with, within the period specified in the order, the Tribunal may require the District\nMagistrate of the district to take such steps, including the forcible removal from such land or property\nof all the occupiers thereof, as may be necessary to put the Committee in possession of the land or\nproperty, and the District Magistrate shall act accordingly. Any expenses incurred on such forcible\nremoval shall be recoverable from such occupiers as arrears of land revenue."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Appeal. Any person aggrieved by a final order passed by the Tribunal in proceedings under",
      "content": "sub-section (1) of section 8 or section 9 or 10 may appeal to the High Court within one month of the\ndate of the order and any order passed by the High Court in appeal shall be final."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Final notification of defining limits of graveyard. When all applications presented under",
      "content": "section 6 have been disposed of by the Tribunal the Government shall issue a final notification defining\nthe limits of the area of the graveyard."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Graveyard to be a trust. The possession of the entire land and property comprising the",
      "content": "graveyard as defined in the notification issued under section 12 shall vest in the Committee and shall\nbe held by it in trust for use as a graveyard and for such other ancillary purposes as may, in the opinion\nof the Government, be necessary for the proper maintenance of the graveyard."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Functions of the Committee. The Committee shall, subject to the control and",
      "content": "superintendence of the Government__\n(1)     protect the graveyard from encroachments;\n(2)     maintain the graveyard in a fit and proper condition and take steps to improve\nit;\n(3)     employ and pay such staff as may be necessary; and\n(4)     do all such acts and things as may be necessary for the preservation and proper\nmaintenance of the graveyard."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Committee to prepare scheme for graveyard. (1) The Committee shall draw up for the",
      "content": "graveyard a scheme which may, among other things, provide for the following matters, namely:__\n(a)     the specification of areas to be used as burial grounds;\n(b)     the laying out of streets and open spaces and the provision of other amenities;\n(c)     the regulation of the design and structure of graves;\n(d)     the use to which the land not immediately required for the purpose of a burial\nground may be put; and\n(e)    any other matter which may be necessary for the preservation and proper\nmaintenance of the graveyard.\n(2) The Government may reject the scheme drawn up by the Committee, may return it for\nfurther consideration or may sanction it with such modifications or additions as it may think fit.\n(3) Nothing in this section shall preclude the Government from cancelling or modifying any\nscheme sanctioned under sub-section (2) or the Committee from drawing up a fresh or modified\nscheme."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Committee and the Tribunal to exercise powers under the Civil Procedure Code, 1908",
      "content": "(1) In relation to proceedings under this Act, the Committee and the Tribunal shall have the same\npowers which are vested in a Court under the Code of Civil Procedure, 1908 (V of 1908), for the\nfollowing matters:__\n(a)    discovery and inspection;\n(b)    enforcing the attendance of witnesses and requiring the deposit of their\nexpenses;\n(c)    compelling the production of documents;\n(d)    examining witnesses on oath and receiving other evidence;\n(e)    granting adjournments;\n(f)    reception of evidence taken on affidavit; and\n(g)    issuing commissions for the examination of witnesses.\n(2) The Committee, or the Tribunal, may summon and examine, of its own accord, any person\nwhose evidence appears to be material in any proceedings and it shall be deemed to be a Civil Court\nwithin the meaning of sections 480 and 482 of the Code of Criminal Procedure, 1898 (V of 1898).\n(3) The provisions of the Evidence Act, 1872 (I of 1872), shall be deemed to apply, so far as\nmay be, to all proceedings before the Committee and the Tribunal."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Government to provide funds for compensation. The Government shall place at the",
      "content": "disposal of the Committee such funds as may be necessary for the payment of compensation under\nsection 8 and for the proper management of the graveyard."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Contribution by local bodies. The Government may require any local authority to pay",
      "content": "such annual contributions to the Committee, for the maintenance of the graveyard, as may be fixed\nfrom time to time."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Rules. (1) The Government may make rules for the purposes of carrying into effect the",
      "content": "provisions of this Act.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules may\nprovide for all or any of the following matters, namely:__\n(a)    the regulation of the procedure and conduct of business by the Committee and\nthe Tribunal;\n(b)    the constitution of the Committee, its powers and functions, the term of office\nof members and the resignation and removal of members and the appointment\nof the Chairman and Vice-Chairman of the Committee;\n(c)    the employment of staff by the Committee and their conditions of service;\n(d)    the manner in which the funds required by the Committee shall be raised and\nspent;\n(e)    the maintenance of accounts by the Committee and an audit thereof;\n(f)    the manner in which schemes under section 15 shall be framed; and\n(g)    the manner in which the Government shall control and supervise the activities\nof the Committee."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Penalties. Any person who, after the extension of all or any of the provisions of this Act,",
      "content": "to a graveyard:__\n(a)    makes an encroachment or erects any building in an unauthorised manner in any\npart of the area of the graveyard;\n(b)    puts any land or property within the limits of the graveyard to any use not in\nconformity with this Act, or any rules or a scheme thereunder;\n(c)    damages any land or property included in the area of the graveyard; or\n(d)    commits a breach of any of the provisions of this Act, or the rules or a scheme\nframed thereunder;\nshall, on conviction by a Magistrate, be punished with imprisonment of either description for a term\nwhich may extend to three months, or with fine which may extend to one thousand rupees, or with\nboth."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Cognizance of offences under the Act. No court shall take cognizance of an offence under",
      "content": "this Act, except on the complaint of a person authorised by the Government in this behalf."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Dissolution of Committee. The Government may, at any time, dissolve the Committee,",
      "content": "and transfer its assets and liabilities and entrust its functions and powers to a local authority.\nRGN Dated: 13-08-2025"
    }
  ],
  "definitions": []
}
