{
  "id": "pk-west-pakistan-historical-mosques-and-shrines-fund-cess-ordinance-1960",
  "type": "statute",
  "title": "West Pakistan Historical Mosques and Shrines Fund Cess Ordinance, 1960",
  "title_en": "West Pakistan Historical Mosques and Shrines Fund Cess Ordinance, 1960",
  "short_name": "WPHMA",
  "status": "in_force",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5praw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Historical Mosques and Shrines Fund Cess Ordinance, 1960 (V of 1960) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Rules",
      "content": "CESS ORDINANCE, 1960\nORDINANCE NO. V OF 1960\nAN\nto provide for the raising of funds for the repair, maintenance and endowment of mosques 1[and\nshrines] of historical importance in West Pakistan.\nPreamble. WHEREAS, it is expedient to provide the raising of funds for the repair,\nmaintenance and endowment of mosques 2[and shrines] of historical importance in West Pakistan in\nthe manner hereinafter appearing;\nNOW, THEREFORE, in pursuance of the Presidential Proclamation of the seventh day of\nOctober, 1958, and in exercise of all powers enabling him in that behalf, the Governor of West Pakistan\nis pleased to make and promulgate the following Ordinance."
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent. (1) This Ordinance may be called the West Pakistan Historical",
      "content": "Mosques 3[and Shrines] Fund Cess Ordinance, 1960.\n4\n[(2) It extends to the whole of the Province of West Pakistan, expect the Tribal Areas.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless the context otherwise requires, the following",
      "content": "expressions shall have the meanings hereby respectively assigned to them, that is to say : —\n(a)        “cess” means the cess imposed by this Ordinance;\n(b)        “Government” means the Government of West Pakistan;\n(c)        “historical mosque” means a mosque which, on account of its ancient and\nhistorical features, is notified as such by Government;\n5\n[(cc) “historical shrine” means a shrine which on account of its ancient and historical\nfeatures, is notified as such by Government;]\n(d)        “land revenue” means the land revenue assessed under the provisions of any\nlaw, regulating the assessment of land revenue for the time being in force.\n(e)        “prescribed”means prescribed by rules made under this Ordinance;\n(f)        “urban immovable property tax” means the tax levied under the West Pakistan\nUrban Immovable Property Tax Act, 1958.\n1\nInserted by Ordinance No. IV of 1966, s. 2.\n2\nInserted by Ordinance No. IV of 1966, s. 2.\n3\nInserted by Ordinance No. IV of 1966, s. 3.\n4\nSubstituted by Ordinance No VII of 1964, s. 2, read with Schedule.\n5\nInserted by Ordinance No. IV of 1966, s. 4."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Cess. (1) A cess shall, subject to the provisions of this section, be levied upon land",
      "content": "revenue or urban immovable property tax, or both, payable by a Muslim.\n(2) The cess shall be payable by the person liable to pay the land revenue or the urban\nimmovable property tax, as the case may be.\n(3) The cess shall be levied at the rate of two paisa on each rupee or part of a rupee of the land\nrevenue or the urban immovable property tax.\n(4) The cess shall be leviable for 1[eleven] years commencing on and from—\n(i)         Rabi, 1960, in the case of land revenue, and\n(ii)        the 1st October, 1959, in the case of urban immovable property tax."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Method of collection and recovery of cess. The cess shall be collected and recovered in the",
      "content": "manner prescribed from time to time for the collection and recovery of the land revenue or the urban\nimmovable property tax, as the case may be."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Historical Mosques Fund. (1) There shall be a fund to be known as the Historical Mosques",
      "content": "2\n[and Shrines] Fund (hereinafter called the “Fund”).\n(2) The Fund shall consist of —\n(i)         the proceeds of the cess, after deduction of such expenses of collection and\nrecovery, as may be directed by Government to be deducted;\n(ii)        grants, if any, made by Government; and\n(iii)       any donations made to the Fund.\n(3) The Fund shall be under the control of, and operated upon by such authority and shall be\nkept in such custody as may be prescribed.\n(4) The Fund shall be applied to meet—\n(i)         payment of salaries and other remuneration of officers and servants employed\nunder this Ordinance;\n(ii)        the expenditure on repair, maintenance and endowment of historical mosques\n3\n[and shrines]; and\n(iii)       any other expenditure of the purpose of this Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "cess",
      "definition": "the cess imposed by this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Government of West Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "historical mosque",
      "definition": "a mosque which, on account of its ancient and historical features, is notified as such by Government; 5 [(cc) “historical shrine” means a shrine which on account of its ancient and historical features, is notified as such by Government;]",
      "source_provision": "sec2"
    },
    {
      "term": "land revenue",
      "definition": "the land revenue assessed under the provisions of any law, regulating the assessment of land revenue for the time being in force.",
      "source_provision": "sec2"
    },
    {
      "term": "urban immovable property tax",
      "definition": "the tax levied under the West Pakistan Urban Immovable Property Tax Act, 1958. 1 Inserted by Ordinance No. IV of 1966, s. 2. 2 Inserted by Ordinance No. IV of 1966, s. 2. 3 Inserted by Ordinance No. IV of 1966, s. 3. 4 Substituted by Ordinance No VII of 1964, s. 2, read with Schedule. 5 Inserted by Ordinance No. IV of 1966, s. 4.",
      "source_provision": "sec2"
    }
  ]
}
