{
  "id": "pk-west-pakistan-horse-race-betting-tax-act-1958",
  "type": "statute",
  "title": "West Pakistan Horse-race Betting Tax Act, 1958",
  "title_en": "West Pakistan Horse-race Betting Tax Act, 1958",
  "short_name": "WPHBT",
  "status": "in_force",
  "issued_date": "1958-04-07",
  "in_force_date": "1958-04-07",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tmbQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Horse-race Betting Tax Act, 1958 (IV of 1958) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Act may be called the West Pakistan",
      "content": "Horse-race Betting Tax Act, 1958.\n1\n[(2) It extends to the whole of the Province of West Pakistan, except the Tribal Areas.]\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act unless there is anything repugnant in the subject or context",
      "content": "(a)        “backer” means any person who bets at a totalizator or with a book-maker;\n(b)        “bet” or “betting” means a contract by a person to pay a certain sum of money\nto another in the event of the winning or the placing of a horse in a horse-race\nin consideration of certain payment or promise of payment by that other, and\nincludes payment of money by any person to another on the happening of that\nevent in consideration of that other paying to him on the event not happening;\n(c)        “book-maker” means a person who carries on the business of making bets with\nthe public in general;\n2\n[(d) ‘Director, Excise and Taxation’ means any officer appointed as such by\nGovernment, and shall include any officer appointed by Government as\nAdditional Director, Excise and Taxation;]\n(e)        “Government” means Government of West Pakistan;\n(f)        “manager” means a person (whether an individual, a corporate body or an\nassociation) primarily responsible for the holding of a race-meeting or his\nnominee approved by the 3[Commissioner], for the purpose of this Act;\n1\nSubs. by West Pakistan Ordinance No.VI of 1964, s. 2.\n2\nSubs. by West Pakistan Ordinance No. X of 1964, s. 2.\n3\nSubs. by the West Pakistan (Adaptation of Laws) Ordinance, 1962 (W. P. Ord. No. XXV of 1962), s. 3.\n(g)        “prescribed” means prescribed by rules made under this Act;\n(h)        “race-meeting” means an assembly of persons at a horse-race to which the\npublic have access whether on payment or otherwise;\n(i)        “totalizator” means the system of betting in horse-races which enables persons\nto make bets with one another on the principle of a common pool and includes\nany machine, instrument or contrivance used for the purpose."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Levy of totalizator tax. (1) Government may, by notification, from time to time, direct that",
      "content": "a tax not exceeding 20 per cent (hereinafter referred to as the “totalizator tax”) shall be levied on\nbackers in respect of all moneys paid by them into any totalizator by way of bets.\n(2) Every notification issued under sub-section (1) shall specify the local area in which, the rate\nat which, and the date from which totalizator tax shall be levied.\n(3) Such portion of the moneys paid into the totalizator as is equivalent to the amount of the\ntotalizator tax calculated at the rate specified in the aforesaid notification shall be deemed to have been\npaid by the backers on account of the totalizator tax, and to have been received by the manager on\nbehalf of the Government."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Levy of betting tax. 1[(1) Government may, by notification from time to time, direct that a",
      "content": "tax not exceeding twenty per centum (hereinafter referred to as the “betting tax”) shall be levied and\npaid out of all moneys paid or agreed to be paid to the book-makers by backers in respect of bets made\nin a place within the race enclosure which the manager has set apart for the purposes of such betting.]\n(2) Every notification issued under sub-section (1) shall specify the local area in which, the rate\nat which, and the date from which, the betting tax shall be levied.\n1\n[(3) Such portion of the moneys referred to in sub-section (1) as is equivalent to the amount\nof the betting tax calculated at the rate specified in the aforesaid notification, shall be deemed to have\nbeen paid by each backer concerned on account of the betting tax and to have been received by the\nbook-maker concerned on behalf of the Government.]\n1\n[(4) The moneys received by the book-makers on account of the betting tax shall be made over\nto the manager for payment to Government.]\n2\n[4-A. Power to Government to issue directions. Government may, by notification in the\nOfficial Gazette, direct that__\n(a)        no bets shall be made or settled with a book-maker except at a specified time\nand place;\n(b)        payment by a book-maker to a backer in consequence of a bet made and won\nby the latter on credit shall be made by means of a cheque;\n(c)        a list of all bets referred to in clause (b) be supplied by the book-maker to the\nprescribed authority in the prescribed manner.]\n1\nSubs. and added by West Pakistan Ordinance No. X of 1964, s. 3.\n2\nIns. by West Pakistan Ordinance No. XXV of 1960, s. 3.\n1\n[4-B. Payment to Manager for collection of taxes, etc. Government may pay to any manager,\non such terms and conditions as may be specified by the Government, such sum of money or such\npercentage of the betting tax or the totalizator tax as it may fix, for collecting and depositing the betting\ntax and the totalizator tax.]"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Assessment, collection and payment of tax. The betting tax or the totalizator tax shall be",
      "content": "assessed, collected and paid in such manner as may be prescribed by the Government."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Duties of the management. The manager of every race",
      "content": "meeting at which betting takes place\n__\nshall\n1\n[(a)   cause accounts to be kept in the prescribed manner of all sums paid into every\ntotalizator, and of all sums paid or agreed to be paid to the book-makers by\nbackers in respect of bets made by the latter;\n(b)        forward at the time, in the manner, and to the officer, prescribed in this behalf,\na return showing the total amount of the sums paid into every totalizator and of\nall sums paid or agreed to be paid to the book-makers by backers in consequence\nof the bets made by the latter;]\n(c)        deposit or make over the totalizator tax and the betting tax due, collected or\nreceived, in the prescribed manner; and\n(d)        furnish such other information and returns as may be prescribed:\nProvided that where the manager satisfies the 1[Director, Excise and Taxation] that a\nparticular amount of betting tax has remained undeposited for reasons beyond\nhis control and that the book-maker concerned is responsible for not making it\nover to him, the 1[Director, Excise and Taxation], may pass an order to the effect\nthat the liability to deposit that amount is that of the book-maker."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Tax in lieu of taxes under sections 3 and 4. The manager of every race",
      "content": "meeting in any\nlocal area in respect of which a notification has not been issued under section 3 or section 4 shall pay\nto the Government by way of tax, in respect of such meeting, such amount not exceeding five hundred\nrupees as may be prescribed."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Appointment of Inspectors. (1) The Director, Excise and Taxation, may appoint Inspectors",
      "content": "for any local area to inspect race-meetings and the accounts of betting.\n(2) Every person appointed under sub-section (1) shall be deemed to be a public servant within\nthe meaning of section 21 of the Pakistan Penal Code (XLV of 1860), and shall be given free access\nto every race-meeting held in the local areas for which he has been appointed and to every place where\nbetting is conducted at such race-meeting and to all books of account relating to such betting, whether\nsuch books belong to the manager or to any book-maker.\n1\nAdded and subs. by West Pakistan Ordinance No. X of 1964, ss. 4 and 5."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Exemptions. The Government may, by notification showing reasons for such exemption",
      "content": "exempt any race-meeting from__\n(a)        the totalizator tax leviable under section 3; or\n(b)        the betting tax leviable under section 4; or\n(c)        the tax leviable under section 7."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Punishment and procedure. (1) (a) If payment of any tax due under this Act is evaded or",
      "content": "the tax is not deposited within the prescribed time, the 1[Director, Excise and Taxation], may determine\nthe person or persons liable in this respect and may impose a penalty not exceeding five times the\namount of tax or rupees one thousand whichever is greater, in addition to the tax evaded or unpaid 2[:]\n2\n[Provided that no order shall be made under this clause making any person or persons liable\nfor the payment of a tax or imposing on any such person or persons a penalty without giving such\nperson or persons an opportunity of being heard and showing cause against the proposed order.]\n(b) Any person who contravenes the provisions of this Act or the rules made thereunder or fails\nto comply with any direction given under this Act or the rules made thereunder, shall be punished with\nfine which may extend to five hundred rupees.\n(c) If any sum due on account of any tax or penalty under this Act is not paid within the time\nallowed for its payment and the person from whom it is due does not show cause to the satisfaction of\nthe 1[Director, Excise and Taxation], or any officer authorised by him, why he should not pay the same,\nsuch sum (inclusive of the cost of recovery) may be recovered under a warrant in the prescribed form,\nor in a form to like effect, signed by the 1[Director, Excise and Taxation], by the distress and sale of\nany movable property belonging to such person. The warrant may be addressed to any officer of the\nExcise and Taxation Department for execution and in executing it he may obtain such assistance from\nother servants of the department as he may consider necessary.\n(d) Any sum due on account of any tax or penalty under this Act shall be recoverable as arrears\nof land revenue. A certificate issued by the Director, Excise and Taxation, showing that any amount is\ndue as tax or penalty, shall be conclusive proof thereof.\n(2) Any person aggrieved by an order passed by the 1[Director, Excise and Taxation], under\nclause (a) of sub-section (1) may appeal to the Director Excise and Taxation, within thirty days of the\norder, exclusive of the time required to get a copy thereof, in such manner as may be prescribed.\n(3) The order of the 1[Director, Excise and Taxation], and in case of appeal, the order of the\nDirector, Excise and Taxation, shall be final.\n(4) The Government may call for and examine the records of any proceedings under sub-section\n(2) for the purpose of satisfying themselves as to the legality or propriety of any order passed by the\nDirector, Excise and Taxation. If in any case it shall appear to the Government that any order should\nbe modified, annulled or reversed, the Government may pass such order thereon as may be deemed fit:\n1\nSubs. by West Pakistan Ordinance No. X of 1964, s. 6.\n2\nSubs. by the West Pakistan Laws (Amendment) Ordinance, 1965 (W. P. Ordinance No. XXXIV of 1965), s. 3.\nProvided that the Government shall not under this sub-section pass an order revising or\nmodifying any order affecting any person without giving such person an opportunity of being heard."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Rules. (1) The Government may, by notification, make rules",
      "content": "(a)        with reference to all matters expressly required or allowed by this Act to be\nprescribed; and\n(b)        to carry out all or any of the purposes of this Act.\n(2) In particular and without prejudice to the generality of the foregoing powers the\nGovernment shall have power to make rules regarding the manner in which any tax payable under this\nAct may be recovered as also the form of the accounts to be maintained and the returns to be submitted\nby book-makers."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Repeal and Savings. (1) The following enactments are hereby repealed",
      "content": "(a)        The Sind Betting Tax Act, 1938 (Sind XV of 1938).\n(b)        The Punjab Horse-Race Betting Tax Act, 1950 (Punjab XXX of 1950).\n1\n[(c)   The Sind Betting Tax Act, 1938 (Sind Act XV of 1938), as applicable to Karachi\nDistrict.]\n(2) Notwithstanding the repeal of the Acts mentioned in sub-section (1) everything done, action\ntaken, obligation, liability, penalty or punishment incurred, inquiry or proceeding commenced, officer\nappointed or person authorised, jurisdiction or power conferred, rule made and order or notification\nissued under any of the provisions of the said Acts, shall, if not inconsistent with the provisions of this\nAct, be continued, and so far as may be, be deemed to have been respectively done, taken, incurred,\ncommenced, appointed, authorised, conferred, made or issued under this Act.\nRGN Date: 25-08-2025\n1\nAdded by West Pakistan Ordinance No. VI of 1964, s. 3."
    }
  ],
  "definitions": [
    {
      "term": "backer",
      "definition": "any person who bets at a totalizator or with a book-maker;",
      "source_provision": "sec2"
    },
    {
      "term": "book-maker",
      "definition": "a person who carries on the business of making bets with the public in general; 2 [(d) ‘Director, Excise and Taxation’ means any officer appointed as such by Government, and shall include any officer appointed by Government as Additional Director, Excise and Taxation;]",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "Government of West Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "manager",
      "definition": "a person (whether an individual, a corporate body or an association) primarily responsible for the holding of a race-meeting or his nominee approved by the 3[Commissioner], for the purpose of this Act; 1 Subs. by West Pakistan Ordinance No.VI of 1964, s. 2. 2 Subs. by West Pakistan Ordinance No. X of 1964, s. 2. 3 Subs. by the West Pakistan (Adaptation of Laws) Ordinance, 1962 (W. P. Ord. No. XXV of 1962), s. 3.",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "race-meeting",
      "definition": "an assembly of persons at a horse-race to which the public have access whether on payment or otherwise;",
      "source_provision": "sec2"
    },
    {
      "term": "totalizator",
      "definition": "the system of betting in horse-races which enables persons to make bets with one another on the principle of a common pool and includes any machine, instrument or contrivance used for the purpose.",
      "source_provision": "sec2"
    }
  ]
}
