{
  "id": "pk-west-pakistan-land-revenue-act-1967",
  "type": "statute",
  "title": "West Pakistan Land-Revenue Act, 1967",
  "title_en": "West Pakistan Land-Revenue Act, 1967",
  "short_name": "WPLA",
  "status": "in_force",
  "issued_date": "1967-11-28",
  "in_force_date": "1967-11-28",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tkaA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Land-Revenue Act, 1967 (XVII of 1967) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Act may be called the West Pakistan",
      "content": "Land-revenue Act, 1967.\n(2) It extends to the whole of the Province of West Pakistan, except the Tribal Areas.\n(3) It or any specified provision thereof shall come into operation in such area or areas and\non such date or dates as Government may, by notification, appoint in this behalf."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Power to except any area from provisions unsuited thereto. (1) Should the",
      "content": "circumstances of any area in which this Act, or any specified provision thereof, has been brought\ninto force be such that, in the opinion of Government, that provision, or any other provision of the\nAct, is unsuited thereto, Government may, by notification, except that area from the operation of\nsuch provisions, and thereupon those provisions shall not apply to such area until the notification is\nrescinded.\n(2) While such exception as aforesaid remains in force, Government may frame rules for the\nregulation of the matters so excepted. So far as may be, the rules shall be consistent with the provisions\nof this Act and shall specify the period for which such exception shall remain in force."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Exclusion of certain land from operation of this Act. (1) Except so far as may be",
      "content": "necessary for the record, recovery and administration of village-cess, or for purposes of survey,\nnothing in this Act applies to land which is occupied as the site of a town or village, and is\nnot assessed to land-revenue.\n(2) It shall be lawful for the Collector acting under the general or special orders of the Board\nof Revenue, to determine, for the purposes of this Act, what lands are included within the site of a\ntown or village, and to fix and from time to time to vary the limits of the same, regard being had to\nall the subsisting right of the land-owners."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(1) “agricultural year” means the year commencing on the first day of July, or on such other\ndate as the Board of Revenue, with the previous approval of Government, may by notification,\nappoint for any specified area;\n(2) “arrears of land-revenue” means land-revenue which remains unpaid after the date on\nwhich it becomes payable;\n(3) “assessment circle” means a group of estates which, in the opinion of the Board of\nRevenue, to be recorded in an order in writing, are sufficiently homogeneous to admit of a common\nset of rates being used as a general guide in calculating the land-revenue to be assessed upon them;\n(4) “Board of Revenue” means the Board of Revenue established under the West Pakistan\nBoard of Revenue Act, 1957 (West Pakistan Act XI of 1957);\n(5) “boundary mark” means any erection, whether of earth, stone, or other material, any\nhedge, unploughed ridge, or strip of ground, or other object or mark, whether natural or artificial, set\nup, employed or specified by a Revenue Officer having authority in that behalf in order to designate\nthe boundary of any division of land;\n(6) “commencement” shall mean the day on which this Act or any provision thereof, as the\ncase may be, comes into operation;\n(7) “defaulter” means a person liable for an arrear of land-revenue, and includes a person\nwho is responsible as surety for payment of the arrear;\n(8) “encumbrance” means a charge upon or claim against land arising out of a private grant\nor contract;\n(9) “estate” means any area—\n(i)     for which a separate record-of-rights has been made; or\n(ii)    which has been separately assessed to land-revenue; or\n(iii)   which the Board of Revenue may, by general rule or special order, declare to\nbe an estate;\n(10) “holding” means a share or portion of an estate held by one land-owner or jointly by\ntwo or more land-owners;\n(11) “Kanungo” shall be deemed to include a supervising Tapedar;\n(12) “land-lord” means a person under whom a tenant holds land, and to whom the tenant\nis, or but for a special contract, would be liable to pay rent for that land, and shall include a lessee\nof such person, and the predecessors and successor-in-interest of such person;\n(13) “land-owner” includes a person to whom a holding has been transferred, or an estate or\nholding has been let in farm, under this Act, for the recovery of an arrear of land-revenue or of a sum\nrecoverable as such an arrear, and any other person who is in possession of an estate or any share or\nportion thereof, or in the enjoyment of any part of the profits of an estate, but does not include a\ntenant;\n(14) “land-revenue” means land-revenue assessed or assessable under this Act, or under\nany other law for the time being in force relating to land-revenue, and includes any rates imposed\non account of increase in the value of land due to irrigation;\n(15) “legal practitioner” means any legal practitioner within the meaning of the Legal\nPractitioners Act, 1879 (Act XVIII of 1879), except a Mukhtar;\n(16) “net assets” of an estate or group of estates means the estimated average annual surplus\nproduce of such estate or group of estates remaining after deduction of the ordinary expenses of\ncultivation as ascertained or estimated.\nExplanation— Ordinary expenses of cultivation include payments, if any, which the land-owner\ncustomarily bears, whether in kind or in cash, and whether in whole or in part in respect of—\n(a)     water rates,\n(b)     maintenance of means of irrigation,\n(c)     maintenance of embankments,\n(d)     supply of seed,\n(e)     supply of manure,\n(f)     improved implements of husbandry,\n(g)     concessions with regard to fodder,\n(h)     special abatements made for fallow or bad harvests,\n(i)     cost of collection of rent,\n(j)     allowance for shortage in collection of rent,\n(k)     interest charges payable in respect of advances made in cash, free of interest,\nto tenants for the purpose of cultivation,\n(l)     wages or customary dues paid to village auxiliaries whose products or labour\nare utilized for the purposes of cultivation and harvesting;\nand the share that would be retainable by a tenant if the land were let to a tenant paying rent, whether\nin cash or in kind, at the normal rate actually prevalent in the estate or group of estates;\n(17) “Patwari” shall be deemed to include a Tapedar and a Special or Additional Tapedar;\n(18) “pay” with its grammatical variations and cognate expressions, includes, when used with\nreference to rent, “deliver” and “render”, with their grammatical variations and cognate expressions;\n(19) “prescribed” mean prescribed by rules made under this Act;\n(20) “rates and cesses” means rates and cesses which are primarily payable by land-owners,\nand include—\n(a) the local rate, if any, payable under any law for the time being in force, and any\nfee similarly leviable from land-owners for the use of, or benefits derived from,\nembankments and works for supply or storage of water for agricultural purposes\nand for the preservation and reclamation of soil and drainage and reclamation of\nswamps;\n(b) any annual rate chargeable on owners of land under any law for the time being in\nforce for the benefits derived from drainage works carried on for the public health,\nor for the improvement of land or for the proper cultivation or irrigation thereof,\nor for the protection from floods or other accumulations of water, or from erosion\nby a river:\n(c) village officers cess ; and\n(d) any sum payable on account of village expenses ;\n(21) “rent” means whatever is payable to a land-lord in money or kind by a tenant on account\nof the use or occupation of land held by him, but shall not include any cess, or other contribution or\ndue or any free personal service;\n(22) “Revenue Court” means a Court constituted as such under the law relating to tenancy as\nin force for the time being;\n(23) “Revenue Officer” means a Revenue Officer having authority under this Act to discharge\nthe functions of a Revenue Officer;\n(24) “survey mark” means any mark set up by the Department of Survey of Pakistan;\n(25) “survey number” or “Khasra number” means a portion of land of which the area is\nseparately entered under an indicative number in the record-of-rights;\n(26) “tenant” means a person who holds land under another person, and is, or but for a special\ncontract would be, liable to pay rent for that land to that other person, and includes the predecessors\nand successors-in-interest of such person, but does not include—\n(a) a mortgagee of the rights of a land-owner; or\n(b) a person to whom a holding has been transferred, or an estate or holding has been let\nin farm, under the provisions of this Act, for the recovery of an arrear of land-revenue\nor of a sum recoverable as such an arrear; or\n(c) a person who takes from Government a lease of unoccupied land for the purpose of\nsub-letting it;\n(27) “tenancy” means a parcel of land held by a tenant under one lease or one set of conditions;\n(28) “Village Officer” means any person appointed under this Act whose duty it is to collect,\nor to supervise the collection of, the revenue of an estate, and includes Kanungos, Patwaries, Zabits,\nkotars or Tapedars, Peons, Arbabs, Rais and Headmen (Lambardars)."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Province to be divided into Divisions. There shall be as many Divisions in the Province,",
      "content": "with such limits and such areas, as Government may, by notification, direct."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Divisions to be divided into Districts and Districts into Sub",
      "content": "Divisions, etc. (1) Each\nDivision shall be divided into such Districts, and each District may be divided into Sub-Divisions or\nTahsils (which also include Talukas), as Government may, by notification, specify; and each Sub-\nDivision may consist of such Tahsils, and having such limits, as Government may, by notification,\ndirect.\n(2) Government may, by notification, vary the number and limits of Divisions, Districts, Sub-\nDivision or Tahsils in the Province.\nAppointment"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Classes of Revenue officers. (1) There shall be the following classes of Revenue Officers,",
      "content": "namely :—\n(a)   the Board of Revenue ;\n(b)   the Commissioner ;\n(c)   the Collector ;\n(d)   the Assistant Collector of the first grade ;\n(e)   the Assistant Collector of the second grade.\n(2) The Deputy Commissioner of the District or the officer performing for the time being\nfunctions as such, shall be the Collector thereof."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Appointment of Commissioners and Collectors. For each Division there shall be a",
      "content": "commissioner and in each District there shall be a Collector, who shall be appointed by Government,\nand who shall exercise throughout the Division or District, as the case may be, all the powers, and\ndischarge all the duties, of the Commissioner or Collector, as the case ay be, under this Act."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Additional Commissioners and Additional Collectors. Government may appoint in any",
      "content": "Division an Additional Commissioner or in any District an Additional Collector, who shall exercise\nthroughout the Division or District concerned all or any of the powers and discharge all or any of the\nduties conferred or imposed on a Commissioner or Collector, as the case may be, by or under this\nAct, subject to the general supervision and control of the Commissioner of the Division in the case of\nAdditional Commissioner, and the Collector of the District in the case of Additional Collector."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Assistant collectors. (1) Government may appoint to each District as many Assistant",
      "content": "Collectors of the first and second grade as it may deem expedient.\n(2) Government may place the revenue administration of a Sub-Division in a District in the\ncharge of any Assistant Collector of the first grade appointed to that District and confer all or any\nof the powers of the Collector on such officer under sub-section (1) of section 16.\n(3) If any of the powers of Collector, under this Act are conferred on an Assistant Collector\nthey shall be exercised by him subject to the control of the Collector."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Tahsildars, etc. The chief officer entrusted with the local revenue administration of a",
      "content": "Tahsil shall be called the Tahsildar (which also includes a Mukhtiarkar), who shall exercise such\npowers and discharge such duties of an Assistant Collector as may be expressly conferred or imposed\non him by or under this Act."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Certain appointments to be notified. The appointment of all officers under this Chapter",
      "content": "shall be by notification.\nAdministrative Control"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Superintendence and control of Revenue officers. (1) The Board of Revenue shall be",
      "content": "subject to the control of Government.\n(2) The general superintendence and control over all other Revenue Officers shall be vested in,\nand all such Officers shall be subordinate to, the Board of Revenue.\n(3) Subject to the general control of the Board of Revenue, a Commissioner shall control all\nother Revenue Officers in his Division.\n(4) Subject as aforesaid and to the control of the Commissioner, a Collector shall control all\nother Revenue Officers in his District."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Power to distribute business and withdraw and transfer cases. (1) The Board of",
      "content": "Revenue may, by written order distribute, in such manner as may be deemed fit, any business\ncognizable by any Revenue Officer under its control, and, by like order, withdraw any case pending\nbefore any such Officer.\n(2) The powers exercisable by the Board of Revenue under sub-section may, by like order and\nin like manner, be exercised by a Commissioner or Collector in respect of any business cognizable by,\nor any case pending before, other Revenue Officers under their respective control.\n(3) Where a case is withdrawn by the Board of Revenue under sub- section (1), the Board may\ndispose of it itself, or, by written order, refer it for disposal to any Revenue Officer; and where a case\nis withdrawn by a Commissioner or Collector under sub-section (2), the Commissioner or Collector,\nas the case may be, may dispose of it himself, or by like order, refer it to any other Revenue Officer\nunder his control.\n(4) No order under this section shall empower any Revenue Officer to exercise any powers or\ndeal with any business which he would not be competent to exercise or deal with within the local limits\nof his own jurisdiction."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Combination of Offices. It shall be lawful for Government to appoint one and the same",
      "content": "person, being otherwise competent according to law, to any two or more of the offices provided for in\nthis Chapter.\nPowers"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Conferment of powers of Revenue Officers. (1) Government may, by notification, confer",
      "content": "on any person all or any of the powers of a Commissioner or Collector under this Act, and may, in like\nmanner, withdraw, such powers.\n(2) The Board of Revenue may, by notification, confer on any person all or any of the powers\nof an Assistant Collector under this Act, and may, in like manner, withdraw such powers.\n(3) A person on whom powers are conferred under this section shall exercise those powers\nwithin such local limits and in such classes of cases as Government or the Board of Revenue, as the\ncase may be, may direct and, except as otherwise so directed, such person shall, for all purposes\nconnected with the exercise thereof, be deemed to be the Commissioner, Collector or Assistant\nCollector, as the case may be."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Functions of Revenue Officers. Except where the class of Revenue Officers by whom any",
      "content": "function is to be performed is specified in this Act, the Board of Revenue may, by notification,\ndetermine the functions to be performed under this Act by any class of Revenue Officers."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Retention of powers by Revenue Officers on transfer. When a Revenue Officer of any",
      "content": "class who has, under the provisions of this Act, any powers to be exercised in any local area, is\ntransferred from that local area to another as a Revenue Officer of the same or a higher class, he shall\ncontinue to exercise those powers in that other local area unless Government or the Board of Revenue,\nas the case may be, otherwise directs or has directed."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Subordination of Revenue Officers. In all official acts and proceedings, a Revenue",
      "content": "Officer shall, in the absence of any express provision of law to the contrary, be subject as to the place,\ntime and manner of performing his functions, to the direction and control of the officer to whom he is\nsubordinate."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Powers to make rules as to procedure. (1) The Board of Revenue may, with the previous",
      "content": "approval of Government; make rules, not inconsistent with this Act, for regulating the procedure of\nRevenue Officers in cases in which a procedure has not been provided for by this Act.\n(2) The rules may provide, among other matters, for the mode of enforcing orders of ejectment\nunder this Act from, and delivery of possession of, immovable property, and rules providing for those\nmatters may confer on any Revenue Officer all or any of the powers in regard to contempts, resistance,\nand the like, which a Civil Court may exercise in the execution of a decree whereby it has adjudged\nejectment from, or delivery of possession of, such property.\n(3) Subject to the rules made under this section, a Revenue Officer may refer any case which\nhe is empowered to dispose of under this Act to another Revenue Officer subordinate to him for\ninvestigation and report, and may decide the case upon such report after giving the parties concerned\nan opportunity of being heard."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Persons by whom appearance and applications may be made before and to Revenue",
      "content": "Officers. (1) Appearance before a Revenue Officer, and applications to, and acts to be done before\nhim, under this Act may be made or done—\n(a) by the parties themselves; or\n(b) by their authorised agents or legal practitioners;\nProvided that the employment of an authorised agent or legal practitioner shall not\nexcuse the personal attendance of a party to any case in which personal attendance\nis specially required by an order of the Revenue Officer.\n(2) The fees of a legal practitioner shall not be allowed as costs in any proceedings before a\nRevenue Officer under this Act unless that Officer considers, for reasons to be recorded by him in\nwriting, that the fees should be allowed."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Powers of Revenue Officers to summon persons to give evidence and produce",
      "content": "documents. (1) A Revenue Officer may summon any person whose attendance he considers necessary\nfor the purpose of any business before him as a Revenue Officer.\n(2) A person so summoned shall be bound to appear at the time and place mentioned in the\nsummons in person or, if the summons so allows, by his authorised agent or a legal practitioner:\nProvided that the exemptions under sections 132 and 133 of the Code of Civil Procedure, 1908\n(Act V of 1908), shall be applicable to requisitions for attendance under this section.\n(3) The person attending in obedience to the summons shall be bound to state the truth upon\nany matter respecting which he is examined or makes statements, and to produce such documents and\nother things relating to any such matter as the Revenue Officer may require."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Summons to be in writing, signed and sealed. Every summons shall be in writing, in",
      "content": "duplicate and shall state the purpose for which it is issued, and shall be signed by the Revenue Officer\nissuing it, and if he has a seal, shall also bear his seal."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Mode of service of summons. (1) A summons issued by a Revenue Officer shall if",
      "content": "practicable, be served (a) personally on the person to whom it is addressed or, failing him, (b) on his\nauthorised agent or (c) an adult male member of his family usually residing with him.\n(2) If service cannot be effected in the manner provided in sub-section (1) or if acceptance of\nservice is refused, the summons may be served by affixing a copy thereof at the usual or last known\nplace of residence of the person to whom it is addressed, or, if that person does not reside in the District\nin which the Revenue Officer is employed and the case to which the summons relates has reference to\nland in that District, the summons may be served by—\n(a)     sending it by post to the Collector of the District in which that person has his usual\nresidence who shall cause it to be served in accordance with the provisions contained\nin sub-section (1); and\n(b)     affixing a copy of the summons on some conspicuous place in or near the estate wherein\nthe land is situate.\n(3) If the summons relates to a case in which persons having the same interest are so numerous that\npersonal service on all of them is not reasonably practicable, it may, if the Revenue Officer so directs,\nbe served by delivery of a copy thereof to such of those persons as the Revenue Officer nominates in\nthis behalf, and by proclamation of the contents thereof for the information of the other person\ninterested.\n(4) A summons may, if the Revenue Officer so directs be served on the person named therein,\neither in addition to, or in substitution for, any other mode of service by forwarding the summons by\nregistered post to the person concerned.\n(5) When a summons is forwarded as aforesaid, the Revenue Officer may presume that the\nsummons was served at the time when the letter would be delievered in the ordinary course of post."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Mode of service of notice, order or proclamation, or copy thereof. (1) A notice, order",
      "content": "or proclamation, or a copy of any such document, issued by a Revenue Officer for service on any\nperson, shall be served in the manner provided in section 24 for the service of a summons.\n(2) No such notice, order or proclamation or copy thereof, shall be deemed void on account of\nany error in the name or designation of any person referred to therein, unless such error has occasioned\nsubstantial injustice."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Mode of making proclamation. When a proclamation is issued by a Revenue Officer, it",
      "content": "shall, in addition to any other mode of publication which may be prescribed by or under this Act, be\nmade by beat of drum or other customary method and by affixing a copy thereof on a conspicuous\nplace in or near the land to which it relates."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Inquiries under the Act to be deemed judicial proceedings. (1) Every inquiry under this",
      "content": "Act shall be deemed to be a “judicial proceeding” within the meaning of sections 193,219 and 228 of\nbe deemed to be a Court for the purposes of such inquiry.\n(2) Every hearing and decision in such inquiry shall be in public, and the parties or their\nauthorised agents shall have due notice to attend."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Arrest of defaulter to be made upon warrant. Whenever it is provided by this Act that a",
      "content": "defaulter may be arrested, such arrest shall be made upon a warrant issued by the Revenue Officer\ncompetent to direct such person’s arrest."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Power of Revenue Offices to enter upon any lands or premises for purpose of",
      "content": "measurements etc. It shall be lawful for any Revenue Officer, and any person acting, under the orders\nof a Revenue Officer, at any time to enter, when necessary for the purpose of measurement,\ndemarcation, fixation or inspection of boundaries or boundary marks, classification of soil, or\nassessment, or for any other purpose connected with the lawful exercise of his office under the\nprovisions of this Act, or any other law for the time being in force relating to land-revenue, upon any\nlands or premises, whether belonging to Government or to private individuals;\nProvided that no premises used as human dwelling shall be entered upon except with the\nconsent of the occupier thereof, or without serving on the occupier a notice of not less than seven days\nin the prescribed form:\nProvided further that due regard shall always be paid to the social and religious prejudices of\nthe occupiers."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Place of sittings. (1) A Revenue Officer, other than an Assistant Collector of the first grade,",
      "content": "may exercise his powers under this Act at any place within the limits of his jurisdiction.\n(2) An Assistant Collector of the first grade may exercise his powers at any place within the\nDistrict in which he is employed."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Proceedings held on holidays. Any proceedings held before a Revenue Officer under this",
      "content": "Act on a day notified as a holiday, shall not be invalid by reason of such proceedings having been held\non that day."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Seals. Government may from time to time by notification, prescribe what Revenue Officers",
      "content": "shall use a seal, and what size and description of seal shall be used by each of such Officers."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Costs. A Revenue Officer may give and apportion the costs of any proceedings under this",
      "content": "Act in any manner he thinks fit:\nProvided that if he orders that the cost of any such proceedings shall not follow the event, he\nshall record his reasons for the order."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Penalty. If a person required by summons, notice, order or proclamation proceeding from",
      "content": "a Revenue Officer to attend at a certain time and place within the limits of the estate in which he\nordinarily resides or in which he holds or cultivates land, fails to comply with the requisition, he shall\nbe liable at the discretion of the Revenue Officer to a fine which may extend to fifty rupees."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Rules regulating appointments etc., of Village Officers. The Board of Revenue may,",
      "content": "with the previous approval of Government, make rules to regulate the appointment, duties,\nemoluments, punishment, suspension and removal of Village Officers."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Village Officers’ cess. (1) Government may, by notification, impose on all or any of the",
      "content": "estates in the Province, a cess to be called the Village Officers’ cess, at such rate or rates, not exceeding\nfive per centum of the land-revenue, as it may think fit, for remunerating Village Officers, other than\nthose who are Government servants.\n(2) The Board of Revenue may, with the previous approval of Government, make rules for the\ncollection, control and distribution of the Village Officers’ cess."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Restrictions on attachment or assignment of remuneration of village Officers. (1) The",
      "content": "remuneration of a Village Officer mentioned under sub-section (1) of section 37 shall not be liable to\nattachment in execution of a decree or order of a Civil or Revenue Court.\n(2) An assignment of, or charge on, or an agreement to assign or charge, any such remuneration\nshall be void unless it is authorised by rules made by the Board of Revenue in this behalf.\nRecords-of-Rights and Periodical Records."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Record",
      "content": "of-rights and documents included therein. (1) Save as otherwise provided by\nthis Chapter, there shall be a record- of-rights for each estate.\n(2) The record-of-rights for an estate shall include the following documents, namely:—\n(a)     statements showing, so for as may be practicable,—\n(i)     the persons who are land-owners, tenants or who are entitled to receive\nany of the rents, profits or produce of the estate or to occupy land therein;\n(ii)    the nature and extent of the interests of those persons, and the conditions\nand liabilities attaching thereto; and\n(iii)   the rent, land-revenue, rates, cesses or other payments, due from and to\neach of those persons and to Government;\n(b)     a statement of customs respecting rights and liabilities in the estate;\n(c)     a map of the estate; and\n(d)     such other documents as the Board of Revenue may, with the previous approval\nof Government, prescribe."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Making of special revision of record",
      "content": "of-rights. (1) When it appears to the Board of\nRevenue that a record-of-rights for an estate does not exist, or that the existing record-of-rights for an\nestate requires special revision, the Board of Revenue may, by notification, direct that a record-of-\nrights be made, or that the record-of-rights be specially revised, as the case may be.\n(2) A notification under sub-section (1) may direct that record-of-rights shall be made or\nspecially revised for all or any of the estates in any local area.\n(3) A record-of-rights made or specially revised for an estate under this section shall be deemed\nto be the record-of-rights for that estate, but shall not affect any presumption in favour of Government\nwhich has already arisen from any previous record-of-rights."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Periodical records. (1) The Collector shall cause to be prepared by the Patwari of each",
      "content": "estate periodically, as the Board of Revenue may direct, an edition of any record-of-rights amended in\naccordance with the provisions of this Chapter.\n(2) Such edition of the record-of-rights shall be called the periodical record for the estate, and\nshall comprise the statements mentioned in clause (a) of sub-section (2) of section 39, and such other\ndocuments, if any, as may be prescribed.\n(3) For the preparation of periodical records, the Collector shall cause to be maintained by the\nPatwari of each estate a register of mutations in the prescribed form, and other prescribed registers, if\nany.\nProcedure for Making Records."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Making of that part of periodical records which relates to land owners. (1) Any person",
      "content": "acquiring by inheritance, purchase, mortgage, gift, or otherwise, any right in an estate as a land-owner,\nor a tenant for a fixed term exceeding one year, shall, within three months from the date of such\nacquisition, report his acquisition of right to the Patwari of the estate, who shall –\n(a)     record such report in the Roznamcha to be maintained in the prescribed manner;\n(b)     Furnish a copy of the report so recorded, free of cost, to the person making the\nreport; and\n(c)     send a copy of the report, within a week of its receipt by him, to the Union\nCommittee, Town Committee or Union Council within which the estate is\nsituated.\n(2) If the person acquiring the right is a minor, or is otherwise unable to report, his guardian or\nother person having charge of his property shall make the report to the Patwari.\n(3) The Patwari shall enter in his register of mutations every report made to him under sub-\nsection (1) or sub section (2), and shall also make an entry in the Roznamcha and in the register of\nmutations respecting the acquisition of any such right as aforesaid which he has reason to believe to\nhave taken place and of which report should have been made to him under either of those sub-sections\nand has not been so made.\n(4) The report made to the Patwari under sub-section (1) or sub-section (2) or recorded by him\nunder sub-section (3) shall be displayed in such manner as may be prescribed.\n(5) If the Patwari fails to record or to display a report made to him under sub-section (l) or sub-\nsection (2), the person making the report may make the report, in writing, to the Revenue Officer\nconcerned and the Chairman of the Union Committee, Town Committee or Union Council in which\nthe estate is situated, by registered post acknowledgement due and the Revenue Officer shall there-\nupon cause such report to be entered in the register of mutations.\n(6) A Revenue Officer shall, from time to time, inquire into the correctness of all entries in the\nregister of mutations and into all such acquisitions as aforesaid coming to his knowledge of which,\nunder the foregoing sub-sections, report should have been made to the Patwari and entries made in\nthat register, and shall in each case make such order as he thinks fit with respect to any entry in the\nperiodical record of the right acquired.\n(7) Except in cases of inheritance or where the acquisition of the right is by a registered deed\nor by or under an order or decree of a Court, the Revenue Officer shall make the order under sub-\nsection (6) in the presence of the person whose right has been acquired, after such person has been\nidentified by two respectable persons, perferably from Lambardars or members of the Union\nCommittee, Town Committee or Union Council concerned, whose signatures or thumb-impressions\nshall be obtained by the Revenue Officer on the register of mutations.\n(8) An inquiry or an order under sub-section (6) shall be made in the common assembly in the\nestate to which the mutation, which is the subject matter of the inquiry, relates.\n(9) Where a Revenue Officer makes an order under sub-section (6) in regard to the acquisition\nof any right, an entry shall be made in the periodical record by the insertion therein of a description of\nthe right acquired and by the omission from such record of any entry in any record previously prepared,\nwhich, by reason of the acquisition, has ceased to be correct.\n(10) If within three months of the making of a report of the acquisition of a right under sub-\nsection (1) or sub-section (2), or the recording by the Patwari of an entry in the Roznamcha under sub-\nsection (3) respecting the acquisition of any right, no order is made by the Revenue Officer under sub-\nsection (6), he shall report the cause of delay to the Collector in the prescribed manner.\n(11) The Revenue Officer shall, in the prescribed manner, send or cause to be sent, the gist of\nan order made by him under sub-section (6), to the person whose right is acquired, and also to the\nUnion Committee, Town Committee or Union Council in which the estate is situated."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Making of that part of periodical record which relates to other persons. The acquisition",
      "content": "of any interest in land other than a right referred to in sub-section (1) of section 42 shall—\n(a)    if it is undisputed, be recorded by the Patwari in the prescribed manner ; and\n(b)    if it is disputed, be entered by the Patwari in the register of mutations and dealt\nwith in the manner provided for in sub-sections (6) to (11) of that section."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Determination of disputes. (1) If during the making, revision or preparation of any record,",
      "content": "or in the course of any inquiry under this Chapter, a dispute arises as to any matter of which an entry\nis to be made in a record or in a register of mutations, a Revenue Officer may of his own motion, or\non the application of any party interested, but subject to the provisions of section 45, and after such\ninquiry as he thinks fit, determine the entry to be made as to that matter and record his reasons therefor.\n(2) If in any such dispute, the Revenue Officer is unable to satisfy himself as to which of the\nparties thereto is in possession of any property to which the dispute relates, he shall—\n(a)     if he be not below the rank of Assistant Collector of the first grade, ascertain,\nafter an inquiry in which an opportunity shall be given to all the parties, to the\ndispute of being heard and adducing evidence in support of their claims, who is\nthe person best entitled to the property, and shall by written order direct that the\nperson be put in possession thereof, and that entry in accordance with that order\nbe made in the record or register; and\n(b)     if he be below the rank of Assistant Collector of the first grade, report the matter\nto the Assistant Collector of the first grade, who shall thereupon proceed in the\nmanner provided in clause (a).\n(2) A direction under sub-section (3) shall be subject to any decree or order which may be\nsubsequently passed by any Court of competent jurisdiction."
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Section 45. Restriction in variations of entries in records. Entries in a record",
      "content": "of-rights or in a\nperiodical record, except entries made in periodical records by Patwaris under clause (a) of section 43\nwith respect to undisputed acquisitions of interest referred to in that section, shall not be varied in\nsubsequent records otherwise than by—\n(a)     making entries in accordance with facts proved or admitted to have occurred;\n(b)     making such entries as are agreed by all the parties interested therein or are\nsupported by a decree or order binding on those parties; and\n(c)     making new maps where it is necessary to make them."
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Section 46. Mutation fees. (1) The Board of Revenue may fix a scale of fees for all or any classes of",
      "content": "entries in any record or register under this Chapter and for copies of any such entries.\n(2) A fee in respect of any entry shall be payable by the person in whose favour the entry is\nmade."
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Section 47. Obligation to furnish information necessary for the preparation of records. (1) Any",
      "content": "person whose rights, interests or liabilities are required to be, or have been, entered in any record or\nregister under this Chapter, shall be bound, on the requisition of any Revenue Officer or Patwari\nengaged in compiling or revising the record or register, to furnish or produce for his inspection, all\nsuch information or documents needed for the correct compilation or revision thereof as may be within\nhis knowledge or in his possession or power.\n(2) The Revenue Officer or Patwari to whom any information is furnished or before whom any\ndocument is produced in accordance with a requisition under sub-section (1) shall give a written\nacknowledgement thereof to the person furnishing or producing the same, and shall endorse on any\nsuch document a note over his signature, stating the fact of its production and the date thereof."
    },
    {
      "provision_ref": "sec48",
      "section": "48",
      "title": "Section 48. Penalty. A person neglecting to make, within three months from the date of his acquisition",
      "content": "of a right referred to in section 42, the report required to be made under that section or who fails to\nfurnish the information or produce the documents required by section 47, shall be liable, at the\ndiscretion of Collector, to a fine not exceeding twenty-five rupees.\nRights of Government and presumptions with respect thereto and to other matters."
    },
    {
      "provision_ref": "sec49",
      "section": "49",
      "title": "Section 49. Rights of Government in mines and minerals. Notwithstanding anything to the contrary",
      "content": "in any other law, or in any order or decree of Court or other authority, or in any rule of custom or\nusage, or in any contract, instrument, deed or other document, all mines and minerals shall be and shall\nalways be deemed to have been the property of Government, and Government shall have all powers\nnecessary for the proper enjoyment of its rights thereto.\nExplanation—For the purposes of this section, “Government”, in relation to nuclear energy,\nmineral oil and natural gas, shall mean the 1[Federal Government], and in relation to other mines and\nminerals, the Government of West Pakistan."
    },
    {
      "provision_ref": "sec50",
      "section": "50",
      "title": "Section 50. Presumption as to ownership of forests, quarries and waste",
      "content": "lands. (1) When in any\nrecord-of-rights completed on or before the eighteenth day of November, 1871, in territories where the\nPunjab Land Revenue Act, 1887 (Punjab Act XVII of 1887), was, with or without modifications, in\nforce immediately before the commencement of this Act, or completed on or before the seventeenth\nday of July, 1879, in territories where the Bombay Land Revenue Code, 1879 (Bombay Act\nV of 1879), or the Sind Land Revenue Code, 1879 (Sind Act V of 1879), was so in force, it is not\nexpressly provide that any forest or quarry, or any unclaimed, unoccupied, deserted or waste-land, or\nany spontaneous produce or other accessory interest in land belongs to the land-owners, it shall be\npresumed to belong to Government.\n(2) When in any record-of-rights completed after eighteenth day of November, 1871, or the\nseventeenth day of July, 1879, as the case may be, it is not expressly provided that any forest or quarry,\nor any such land, produce or interest as aforesaid, belongs to Government, it shall be presumed to\nbelong to the land-owners concerned.\n(3) The presumption created by sub-section (1) may be rebutted by showing—\n(a)      from the record or report made by the assessing officer at the time of assessment,\nor\n(b)      if the record or report is silent, then from a comparison between the assessment of\nvillages in which there existed, and the assessment of villages of similar character\nin which there did not exist, any forest or quarry, or any such land, product or\ninterest,\nthat the forest, quarry, land, produce or interest was taken into account in the assessment of the land-\nrevenue.\n(4) Until the presumption is so rebutted, the forest, quarry, land, produce, or interest shall be\nheld to belong to Government.\n1\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table."
    },
    {
      "provision_ref": "sec51",
      "section": "51",
      "title": "Section 51. Compensation for infringement of rights of third parties in exercise of a right of",
      "content": "Government. (1) Whenever, in the exercise of any right of Government referred to in sections 49 and\n50, the rights of any person are infringed by the occupation or disturbance of the surface of any land,\nGovernment shall pay, or cause to be paid, to that person compensation for the infringement.\n(2) The compensation shall be determined, as nearly as may be, in accordance with the\nprovisions of the Land Acquisition Act, 1894 (Act I of 1894)."
    },
    {
      "provision_ref": "sec52",
      "section": "52",
      "title": "Section 52. Presumption in favour of entries in records",
      "content": "of-rights and periodical records. An entry\nmade in a record-of-rights in accordance with the law for the time being in force, or in a periodical\nrecord in accordance with the provisions of this Chapter and the rules made thereunder, shall be\npresumed to be true until the contrary is proved or a new entry is lawfully substituted therefore."
    },
    {
      "provision_ref": "sec53",
      "section": "53",
      "title": "Section 53. Suit for declaratory decrees by persons aggrieved by an entry in a record. If any person",
      "content": "considers himself aggrieved by an entry in a record-of-rights or in a periodical record as to any right\nof which he is in possession, he may institute a suit for a declaration of his right under Chapter VI of\nSupplemental Provisions"
    },
    {
      "provision_ref": "sec54",
      "section": "54",
      "title": "Section 54. Record",
      "content": "of-rights and periodical records for groups of estates. The Board of Revenue\nmay, by notification, direct that a record-of-rights shall be made for any group of neighbouring estates\ninstead of separately for each of such estates, and thereupon the provisions of this Chapter with respect\nto a record-of-rights and a periodical record for an estate shall, so far as they can be made applicable,\napply to the record-of-rights and the periodical record for such group of estates as if the group were an\nestate."
    },
    {
      "provision_ref": "sec55",
      "section": "55",
      "title": "Section 55. Powers to make rules respecting records and other matters connected therewith. The",
      "content": "Board of Revenue may, with the previous approval of Government, make rules—\n(a)     prescribing the language in which records and registers under this Chapter are\nto be made;\n(b)     prescribing the form of those records and registers, and the manner in which\nthey are to be prepared, signed and attested;\n(c)     for the survey of land so far as may be necessary for the preparation and\ncorrection of those records and registers;\n(d)     for the conduct of inquiries by Revenue Officers under this Chapter; and\n(e)     generally for the guidance of Revenue Officers and Village Officers in matters\npertaining to records and registers mentioned or referred to in this Chapter."
    },
    {
      "provision_ref": "sec56",
      "section": "56",
      "title": "Section 56. Assessment of land",
      "content": "revenue. (1) All land, to whatever purpose applied and wherever\nsituate, is liable to the payment of land-revenue to Government, except—\n(a)     such land as has been wholly exempted from that liability by special contract\nwith Government, or by the provisions of any law for the time being in force;\n(b)     such land as is included in village site;\n(c)     such land as is included in Cantonment limits;\n(d)     land on which property tax under the West Pakistan Urban Immovable Property\nTax Act, 1958 (W. P. Act V of 1958), is payable;\n(e)     waste and barren land not under cultivation for a continuous period of not less\nthan six year immediately before the date of notification or general assessment\nor re-assessment under section 59; provided that where any waste and barren\nland is brought under cultivation at any time after the date of such notification,\nsuch land shall not be liable to the payment of land-revenue for a period of six\nyears from the date it is so brought under cultivation.\n(2) Land-revenue shall be assessed in cash.\n(3) Land-revenue may be assessed —\n(a)     as a fixed annual charge, payable in lump sum or by installments; or\n(b)     in the form of prescribed rates, per acre or other unit of area applicable to the\narea recorded as sown, matured or cultivated during any harvest or during any\nyear :\nProvided that land-revenue shall not be assessed in the form of sliding scales varying annually\naccording to the market price of any agricultural produce prevailing during a specified period of the\nyear."
    },
    {
      "provision_ref": "sec57",
      "section": "57",
      "title": "Section 57. Basis of assessment. (1) The assessment of land",
      "content": "revenue shall be based on an estimate of\nthe average money-value of the gross produce of an estate or a group of estates, in which the land\nconcerned is situated.\n(2) Such estimate shall be made in the prescribed manner."
    },
    {
      "provision_ref": "sec58",
      "section": "58",
      "title": "Section 58. Limit of assessment. If the land",
      "content": "revenue is assessed as a fixed annual charge, the amount\nthereof, and if it is assessed in the form of prescribed rate, the average amount which, according to an\nestimate in writing approved by Government or the Board of Revenue, as the case may be, will be\nleviable annually, shall not, in the case of an assessment circle, exceed one-fourth of the estimated\nmoney-value of the net assets of such assessment circle.\nGeneral Assessments"
    },
    {
      "provision_ref": "sec59",
      "section": "59",
      "title": "Section 59. Notification of intended re",
      "content": "assessment and instructions as to principles of assessment.\n(1) Assessments of land-revenue may be general or special.\n(2) A general assessment or re-assessment of the land-revenue of any area shall not be\nundertaken without the previous sanction of Government and notification of that sanction.\n(3) In granting such sanction Government may give such instructions consistent with the\nprovisions of this Act and the rules made thereunder as it may deem fit."
    },
    {
      "provision_ref": "sec60",
      "section": "60",
      "title": "Section 60. Mode of determining assessment. (1) A general assessment shall be made by a Revenue",
      "content": "Officer.\n(2) Before making such assessment the Revenue Officer shall report through the Commissioner\nfor the sanction of the Board of Revenue his proposals with regard thereto."
    },
    {
      "provision_ref": "sec61",
      "section": "61",
      "title": "Section 61. Announcement of assessment. (1) After consideration of the proposals submitted by the",
      "content": "Revenue Officer under the provisions of section 60, the Board of Revenue shall pass such orders as it\nmay deem fit, subject to the provisions of sub-sections (3) and (4), and on the receipt of such orders\nthe Revenue Officer shall make an order determining the assessment proper for each estate concerned\nand shall announce it in such manner as Government may by rule prescribe.\n(2) At the time of announcing the assessment the Revenue Officer shall also declare the date\nfrom which it is to take effect, and, subject to the other provisions of this Act, it shall take effect\naccordingly.\n(3) Subject to the provisions of sub-section (4), the average rate of assessment imposed under\nthe provisions of sub-section (1) on any assessment circle forming part of any area in respect of which\na notification has been issued under sub-section (2) of section 59 shall not exceed the rate of assessment\nimposed at the last previous assessment by more than one-fourth; provided that the rate of assessment\nimposed on any estate shall not exceed the rate of assessment of the last previous assessment on the\nestate by more than one-half.\n(4) The provisions of sub-section (3) shall not be applicable in the case of land which has not\nbeen previously assessed to land-revenue or in which canal irrigation has been introduced after the\ndate of the orders passed under the provisions of sub-section (l) at the last previous assessment, or in\nthe case of an area which has been notified by Government to be an urban assessment circle, and for\nthe purpose of calculating the increase in the incidence of the land-revenue for the purpose of sub-\nsection (3), all such land shall be excluded from calculation:\nProvided that in the case of lands in which canal irrigation has been introduced after the date\nspecified in this sub-section, the average rate of assessment shall not, so far as may be, exceed the\naverage rate of assessment of lands of similar kind imposed under sub-section (3)."
    },
    {
      "provision_ref": "sec62",
      "section": "62",
      "title": "Section 62. Application for reconsideration of assessment. (1) Any land",
      "content": "owner may, within thirty\ndays from the date of the announcement of the assessment, present a petition to the Revenue Officer\nfor a reconsideration of the amount, form or conditions of the assessment.\n(2) The order passed by the Revenue Officer on the petition shall set forth his reasons for\ngranting or refusing it."
    },
    {
      "provision_ref": "sec63",
      "section": "63",
      "title": "Section 63. Confirmation and duration of assessment. (1) An assessment, the undertaking of which",
      "content": "has been sanctioned under the provisions of section 59, shall not be considered final until it has been\nconfirmed by the Board of Revenue.\n(2) At any time before an assessment is so confirmed, the Commissioner or Board of Revenue\nmay, subject to the provisions of sub-section (3), modify the assessment of any estate.\n(3) Before an enhancement is ordered under the provisions of sub-section (2), the\nCommissioner or the Board of Revenue, as the case may be, shall cause reasonable notice to be given\nto the land-owners by proclamation published in the manner described in section 26, to show cause in\na petition addressed to the Revenue Officer why the proposed enhancement should not be ordered, and\nthe Revenue Officer shall enquire into any objections raised by any land-owner and submit such\npetition received by him with his report thereon to the Commissioner or the Board of Revenue, who\nshall consider the petition and the report and shall also hear the petitioner if the petitioner so desires."
    },
    {
      "provision_ref": "sec64",
      "section": "64",
      "title": "Section 64. Duration of assessment. (1) The Board of Revenue shall, when confirming an assessment",
      "content": "under sub-section (1) of section 63, fix a period of time for which the assessment shall remain in force.\n(2) The period fixed under sub-section (1) shall be twenty-five years:\nProvided that a period not exceeding twenty-five years and not shorter than ten years may be\nfixed for any area, specified by the Board of Revenue, in which canal irrigation has been introduced\nafter the date of the orders passed under the provisions of sub-section (1) of section 61 at the last\nprevious assessment or in which it has been proposed to introduce such irrigation during the period\nfixed."
    },
    {
      "provision_ref": "sec65",
      "section": "65",
      "title": "Section 65. Assessment to remain in force till new assessment takes effect. Notwithstanding the",
      "content": "expiration of the period fixed for the continuance of an assessment under the last foregoing section,\nthe assessment shall remain in force till a new assessment takes effect."
    },
    {
      "provision_ref": "sec66",
      "section": "66",
      "title": "Section 66. Refusal to be liable for assessment and consequences thereof. (1) At any time within",
      "content": "ninety days from the date of the announcement of an assessment, the land-owner or, where there are\nmore land-owners than one, any of them who would be individually or collectively liabel for more\nthan half the sum assessed, may give notice to the Revenue Officer of refusal to be liable for the\nassessment.\n(2) When the Revenue Officer receives a notice under sub-section (1), the Collector may take\npossession of the estate and deal with it, as nearly as may be, as if the annulment of the assessment\nthereof had been ordered as a process for the recovery of an arrear of land-revenue due thereon.\n(3) While the estate is in the possession of the Collector the land-owner or land-owners shall\nbe entitled to receive from Government an allowance, to be fixed by the Board of Revenue, which\nshall not be less than fifty or more than seventy-five per cent of the net income realised by Government\nfrom the estate."
    },
    {
      "provision_ref": "sec67",
      "section": "67",
      "title": "Section 67. Distribution of the assessment of an estate over the holdings comprised therein. (1) If",
      "content": "the assessment announced under section 61 is in whole or in part a fixed assessment of an estate for a\nterm of years, the Revenue Officer shall, before the date on which the first instalment thereof becomes\npayable, make an order distributing it over the several holdings comprised in the estate and make and\npublish a record of the distribution.\n(2) The Collector may for sufficient reason make an order revising that record at any time while\nthe assessment continues to be in force, and publish the record so revised.\n(3) If the assessment announced under section 61 is in the form of rates chargeable according\nto the results of each year or harvest, a Revenue Officer shall from year to year or from harvest to\nharvest, as the conditions of the assessment may require, make and publish, not later than one month\nbefore the first instalment of the land-revenue falls due, a record of the amount payable in respect of\neach holding.\n(4) Notwithstanding anything contained in this section, arid land (whether cultivated or not) in\nwhich well or tube-well irrigation facilities are provided by or on behalf of the land-owner or the tenant\nshall, for a period not less than four years from the date such irrigation facilities are first provided in\nsuch land, not be liable to pay land-revenue at a higher rate than was payable thereon before such\nirrigation facilities were provided.\nExplanation— For the purposes of this sub-section, only such land shall be deemed to be ‘arid\nland’ in which canal irrigation has not been introduced."
    },
    {
      "provision_ref": "sec68",
      "section": "68",
      "title": "Section 68. Application for amendment of the distribution of an assessment. (1) Any person",
      "content": "affected by a record under sub-section (1) or sub-section (3) of the last foregoing section or by the\nrevision of a record under sub-section (2) of that section, may, within thirty days from the date of the\npublication of the record, present a petition to the Revenue Officer for a re-consideration of the record\nso far as it affects him.\n(2) The order passed by the Revenue Officer on the petition shall set forth his reasons for\ngranting or refusing it."
    },
    {
      "provision_ref": "sec69",
      "section": "69",
      "title": "Section 69. Appeals from orders under section 62 and 68. An appeal from an order under the last",
      "content": "foregoing section or section 62 shall lie to the Commissioner and from the appellate order of the\nCommissioner, to the Board of Revenue.\nSpecial Assessments"
    },
    {
      "provision_ref": "sec70",
      "section": "70",
      "title": "Section 70. Special assessments. (1) Notwithstanding the provisions of sections 64 and 65, special",
      "content": "assessment may be made by Revenue Officers in the following cases, namely:—\n(a)     when it is proposed to change the form of assessment;\n(b)     when lands are sold, leased or granted by Government;\n(c)     when the assessment of any land has been annulled or the land-owner has\nrefused to be liable therefor, and the term for which the land was to be managed\nby the Collector or his agent or let in farm has expired;\n(d)     when assessments of land-revenue require revision in consequence of the action\nof water or sand or of calamity of season or from any other cause;\n(e)     when revenue due to the Government on account of pasture or other natural\nproducts of land, or on account of mills, fisheries or natural products of water,\nor on account of other rights described in section 49 or section 50, has not been\nincluded in an assessment made under the foregoing provisions of this Chapter;\n(f)     when waste and barren land becomes liable to the payment of land-revenue.\n(2) The Board of Revenue may confirm any assessment made under this section.\n(3) The foregoing provisions of this Chapter with respect to general assessment shall, subject\nto such modifications thereof as the Board of Revenue may prescribe by executive instructions issued\nunder the provisions of section 73, regulate the procedure of Revenue Officers making special\nassessments."
    },
    {
      "provision_ref": "sec71",
      "section": "71",
      "title": "Section 71. power to make rules. Government shall, subject to the provisions of section 72, from time",
      "content": "to time, make rules prescribing—\n(a)     the method by which the estimate of the money-value of the net assets of an\nestate or group of estates shall be made;\n(b)     the method by which assessment to land-revenue shall be made;\n(c)     the principles on which exemption from assessment shall be allowed for\nimprovements;\n(e)     the manner in which assessment shall be announced;\n(f)     the manner in which the rate of assessment is to be calculated for the purpose\nof sub-section (3) of section 61."
    },
    {
      "provision_ref": "sec72",
      "section": "72",
      "title": "Section 72. Procedure to be followed in making Rules. Before making any rule under the provisions",
      "content": "of section 71, Government shall, in addition to observing the procedure laid down in section 22 of the\nWest Pakistan General Clauses Act, 1956 (W.P. Act VI of 1956), publish by notification a draft of the\nproposed rule for the information of persons likely to be affected thereby."
    },
    {
      "provision_ref": "sec73",
      "section": "73",
      "title": "Section 73. Power to issue instructions. Government or the Board of Revenue with the approval of",
      "content": "Government may, for the guidance of Revenue Officers, from time to time, issue executive instructions\nrelating to all matters to which the provisions of this Chapter apply; provided that such instruction\nshall be consistent with the provisions of this Act and the rules made thereunder."
    },
    {
      "provision_ref": "sec74",
      "section": "74",
      "title": "Section 74. Liability for payment of land",
      "content": "revenue. In the case of any holding, the holding and its\nland-owner shall be liable for the payment of land-revenue thereon, and if there be joint land-owners\nof a holding, the holding and all the land-owners jointly and severally shall be liable for the payment\nof the land-revenue."
    },
    {
      "provision_ref": "sec75",
      "section": "75",
      "title": "Section 75. Security for Payment of land",
      "content": "revenue. (1) The land-revenue for the time being assessed\nand payable in respect of a holding shall be the first charge upon the rents, profits and produce thereof.\n(2) Save with the previous consent of the Collector, the rents, profits and produce of a holding\nshall not be liable to be taken in execution of a decree or order of any Court until the land-revenue\nchargeable against the rents, profits or produce or any arrear of land-revenue due in respect of the\nholding, have been paid."
    },
    {
      "provision_ref": "sec76",
      "section": "76",
      "title": "Section 76. Orders to regulate payment of land",
      "content": "revenue. (1) Notwithstanding anything in any\nrecord-of-rights, the Board of Revenue may fix the number and amount of the instalments, and the\ntimes, places and manner, by, at and in which the land-revenue is to be paid.\n(2) Until the Board of Revenue otherwise directs, land-revenue shall be payable by the\ninstallments at the times and places and in the manner, by, at and in which it is payable immediately\nbefore the commencement of this Act."
    },
    {
      "provision_ref": "sec77",
      "section": "77",
      "title": "Section 77. Rules to regulate collection, remission and suspension of land",
      "content": "revenue. The Board of\nRevenue may, with the previous approval of Government, make rules not inconsistent with this Act to\nregulate the collection, remission and suspension of land-revenue."
    },
    {
      "provision_ref": "sec78",
      "section": "78",
      "title": "Section 78. Costs recoverable as part of arrear. The costs of any process issued under this Chapter",
      "content": "shall be recoverable as part of the arrear of land-revenue in respect of which the process was issued."
    },
    {
      "provision_ref": "sec79",
      "section": "79",
      "title": "Section 79. Certified account to be evidence as to arrear. A statement of account certified by a",
      "content": "Revenue Officer shall be conclusive proof of the existence of an arrear of land-revenue, of its amount\nand of the person who is the defaulter."
    },
    {
      "provision_ref": "sec80",
      "section": "80",
      "title": "Section 80. Processes for recovery of arrears. Subject to the other provisions of this Act, an arrear of",
      "content": "land-revenue may be recovered by any one or more of the following processes, namely:—\n(a)     by service of a notice of demand on the defaulter under section 81;\n(b)     by arrest and detention of his person under section 82;\n(c)     by districts and sale of his movable property and uncut or ungathered crops\nunder section 83;\n(d)     by transfer, under section 84, of the holding in respect of which the arrear is\ndue;\n(e)     by attachment, under section 85, of the holding in respect of which the arrear is\ndue;\n(f)     by annulment, under section 86, of the assessment of that holding;\n(g)     by sale of that holding under section 88;\n(h)     by proceedings against other immovable property of the defaulter under section"
    },
    {
      "provision_ref": "sec90",
      "section": "90",
      "title": "Section 90. 81. Notice of demand. (l) A notice of demand may be issued by Revenue Officer on or after",
      "content": "the day following that on which an arrear of land-revenue accrues."
    },
    {
      "provision_ref": "sec82",
      "section": "82",
      "title": "Section 82. Arrest and detention of defaulter. (1) If after lapse of fifteen days of the service of notice",
      "content": "of demand under section 81 on a defaulter, the arrears of land-revenue due from him, or any part\nthereof, remain unpaid, a Revenue Officer may issue a further notice to the defaulter requiring him to\npay such amount, and if after laps of thirty days of the service of such further notice, such amount or\nany part thereof still remains unpaid, the Revenue Officer may issue a warrant directing an officer\nnamed therein to arrest the defaulter and bring him before the Revenue Officer.\n(2) The further notice referred to in sub-section (1) shall be served in the manner provided in\nsub-sections (1), (2) and (3) of section 24, and a copy thereof shall, wherever practicable, be also\nforwarded by registered post to the defaulter.\n(3) When the defaulter is brought before the Revenue Officer, the Revenue Officer may cause\nhim to be taken before the Collector, or make keep him under personal restraint for a period not\nexceeding ten days, and then, if the arrear is still unpaid, cause him to be taken before the Collector.\n(4) Where the Revenue Officer keeping a defaulter under personal restraint is an Assistant\nCollector of the second grade, he shall without delay report his action to the Collector, if the period of\nsuch restraint exceed twenty-four hours.\n(5) When the defaulter is brought before the Collector, the Collector may issue an order to the\nofficer-in-charge of the Civil Jail of the District, directing him to confine the defaulter in jail for such\nperiod, not exceeding one month from the date of the order, as the Collector thinks fit.\n(6) The process of arrest and detention shall not be executed against a defaulter who is a female,\na minor, a lunatic or an idiot.\n(7) A warrant of arrest issued against a defaulter under sub-section (1) shall not be executed, if\nthe arrears due from him are paid or the defaulter furnishes security in the manner provided in clause\n(b) of sub-section (8).\n(8) Any defaulter, who, under sub-section (3) is being kept under personal restraint, or under\nsub-section (5) is being confined in the Civil Jail, shall forthwith be set at liberty—\n(a)     on the arrears due from such defaulter being paid; or\n(b)     on the defaulter furnishing to the Revenue Officer ordering his arrest or the\nCollector, security to the satisfaction of the Revenue Officer or the Collector, as\nthe case may be, for the payment of the arrears due from him."
    },
    {
      "provision_ref": "sec83",
      "section": "83",
      "title": "Section 83. Distress and sale of movable property and crops. (1) At any time after an arrear of land",
      "content": "revenue has accrued, the immovable property and uncut or ungathered crops of the defaulter, may be\ndistrained and sold by order of a Revenue Officer.\n(2) The distress and sale shall be conducted, as nearly as may be, in accordance with the law\nfor the time being in force for the attachment and sale of movable property under the decree of a\nRevenue Court:\nProvided that, in addition to the particulars exempted by any law for the time being in force\nfrom liability to sale, so much of the produce of the land of the defaulter as the Collector thinks\nnecessary for seed-grain and for the subsistence, until the harvest next following, of the defaulter and\nhis family, and of any cattle exempted by that law, shall be exempted from sale under this section."
    },
    {
      "provision_ref": "sec84",
      "section": "84",
      "title": "Section 84. Transfer of holding. (1) At any time after an arrear of land",
      "content": "revenue has accrued on a\nholding, the Collector may transfer the holding to any person being a land-owner of the estate in which\nsuch holding is situated and not being a defaulter in respect of his own holding, on condition of his\npaying the arrear before being put in possession of the holding, and on such further conditions as the\ncollector may deem fit to impose:\nProvided that no order shall be passed under this sub-section for the transfer of a holding unless\nthe processes specified in clauses (b) and (c) of section 80 have first been taken against the land-owner.\n(2) The transfer may, as the Collector thinks fit, be either till the end of the agricultural year in\nwhich the defaulter pays to the transferee the amount of the arrear which the transferee paid before\nbeing put in possession of the holding, or for a term not exceeding fifteen years from the\ncommencement of the agricultural year next following the date of the transfer.\n(3) The Collector shall report to the Commissioner any transfer made by him under this section,\nand the Commissioner may set aside the transfer or alter the conditions thereof, or pass such other\norder as he thinks fit.\n(4) In respect of all rights and liabilities arising under this Act, the person to whom the holding\nis transferred shall, subject to the conditions of the transfer, stand in the same position as that in which\nthe defaulter would have stood if the holding had not been transferred.\n(5) When the transfer is for a term, the holding shall, on the expiration of the term, be restored\nby the Collector to the defaulter free of any claim on the part of Government or the transferee for any\narrear of land-revenue or rates and cesses due in respect thereof."
    },
    {
      "provision_ref": "sec85",
      "section": "85",
      "title": "Section 85. Attachment of holding. (1) The Collector may, instead of transferring under section 84 a",
      "content": "holding in respect of which an arrear of land-revenue had accrued, cause such holding to be attached\nand taken under his own management or that of an agent appointed by him for that purpose.\n(2) The Collector or the agent shall be bound by all the engagements which existed between\nthe defaulter and his tenants, if any, and shall be entitled to manage the land and to receive all rents\nand profits accruing therefrom to the exclusion of the defaulter until the arrear has been satisfied, or\nuntil the Collector restores the land to the defaulter.\n(3) All surplus profits of the land attached beyond the cost of attachment and management and\nthe amount necessary to meet the current demand for land-revenue and rates and cesses shall be applied\nin discharge of the arrear.\n(4) Land shall not be attached for the same arrear for a longer term than five years from the\ncommencement of the agricultural year next following the date of the attachment, but if the arrear is\nsooner discharged, the land shall be released and the surplus receipts, if any, made over to the land-\nowner."
    },
    {
      "provision_ref": "sec86",
      "section": "86",
      "title": "Section 86. Annulment of assessment of holding. (1) When an arrear of land",
      "content": "revenue has been due\nfor a longer period than one year, and the foregoing processes are not deemed sufficient for the\nrecovery thereof, the Board of Revenue may, in addition to or instead of all or any of these processes,\norder the existing assessment of the holding in respect of which the arrear is due to be annulled.\n(2) The provisions of this section shall not be put in force for the recovery of an arrear of land-\nrevenue which has accrued on land—\n(a) while under attachment under section 85, or\n(b) while under the charge of the Court of Wards.\n(3) When the assessment of any land has been annulled under sub-section (1), the Collector\nmay, with the previous sanction of the Board of Revenue, manage the land either himself or through\nan agent, or let it in farm to any person willing to accept the farm for such term and on such conditions\nas may be sanctioned by the Board of Revenue:\nProvided that the term for which land may be so managed or farmed shall not be longer than\nten years from the commencement of the agricultural year next following the date of the annulment.\n(4) Some time before the expiration of the aforesaid term, the Collector shall determine the\nassessment in respect of the holding for the remainder of the term of the current assessment of the\nDistrict or Tahsil, and, when that assessment has been sanctioned by the Board of Revenue, shall\nannounce it to the land-owner.\n(5) The land-owner may gave notice to the Collector of refusal to be liable for the assessment\nwithin thirty days from the date on which the assessment was announced to him.\n(6) If notice is so given, the Collector may, with the previous sanction of the Board of Revenue,\ntake the holding under direct management or farm it for the remainder of the term of the current\nassessment of the District or Tahsil, or for any period within that term which the Board of Revenue\nmay fix.\n(7) The Board of Revenue may direct that any contract made by the defaulter, or by any person\nthrough whom the defaulter claims with respect to any land comprised in a holding of which the\nassessment has been annulled, shall not be binding on the Collector or his agent or farmer during the\nperiod the holding remains under the management of the Collector or his agent or is let in farm."
    },
    {
      "provision_ref": "sec87",
      "section": "87",
      "title": "Section 87. Proclamation of attachment or annulment of assessment and consequences of",
      "content": "proclamation. (l) When any land is attached under section 85, or when the assessment of any land has\nbeen annulled under section 86, the Collector shall make proclamation thereof.\n(2) No payment made by any person to the defaulter before the making of the proclamation on\naccount of rent or any other asset in anticipation of the usual time for the payment shall, without the\nprevious sanction of the Collector, be credited to that person or relieve him from liability to make the\npayment to the Collector or his agent or farmer.\n(3) No payment made after the making of the proclamation on account of rent or any other\nasset of the holding to any person other than the Collector or his agent or farmer shall be credited to\nthe person making the payment or relieve him from liability to make the payment to the Collector or\nhis agent or farmer."
    },
    {
      "provision_ref": "sec88",
      "section": "88",
      "title": "Section 88. Sale of holding. When an arrear of land",
      "content": "revenue has accrued and the foregoing processes\nare not deemed sufficient for the recovery thereof, the Collector, with the previous sanction of the\nBoard of Revenue may, in addition to, or instead of, all or any of those processes, and subject to the\nprovisions hereinafter contained, sell the holding in respect of which the arrear is due:\nProvided that land shall not be sold for the recovery of—\n(a) any arrear which has accrued while the land was under the charge of the Court of\nWards or was so circumstanced that the Court of Wards might, under the law for the\ntime being in force, have exercised jurisdiction over it; or\n(b) any arrear which has accrued while the land was under attachment under section 85;\nor\n(c) any arrear which has accrued while the land was held under direct management by\nthe Collector or in farm by any other person, under section 86, after either an\nannulment of assessment or a refusal to be liable therefor."
    },
    {
      "provision_ref": "sec89",
      "section": "89",
      "title": "Section 89. Effect of sale on encumbrances. (1) Land sold under the provisions of section 88 shall be",
      "content": "sold free of all encumbrances; and all grants and contracts previously made by any person other than\nthe purchaser in respect of the land shall become void as against the purchaser at the sale.\n(2) Nothing in sub-section (1) shall affect—\n(a)     any lease at a fair rent, temporary or perpetual, for the erection of a dwelling-\nhouse or manufactory or for a mine, garden, tank, canal, place of worship or\nburial ground, so long as the land continue to be used for the purpose specified\nin the lease; or\n(b)     any encumbrance, grant or contract in respect of which the Commissioner is\nsatisfied was entered into in good faith, and is proclaimed as hereinafter\nprovided."
    },
    {
      "provision_ref": "sec91",
      "section": "91",
      "title": "Section 91. Remedies open to person denying his liability for an arrear. (1) Notwithstanding",
      "content": "anything in section 79, when proceedings are taken under this Act for the recovery of an arrear, the\nperson against whom the proceedings are taken may, if he denies his liability for the arrear or any part\nthereof and pays the same under protest made in writing at the time of payment and signed by him or\nhis agent, institute a suit in Civil Court for the recovery of the amount so paid.\n(2) A suit under sub-section (l) must be instituted in a Court having jurisdiction in the place\nwhere the office of the Collector of the District in which the arrear or some part thereof accrued is\nsituate.\nProcedure in Sales"
    },
    {
      "provision_ref": "sec92",
      "section": "92",
      "title": "Section 92. Proclamation of sale. (1) On the receipt of the sanction of the Board of Revenue to the",
      "content": "sale of any immovable property, the Collector shall issue a proclamation of the intended sale,\nspecifying—\n(a)     the date, time and place of the sale;\n(b)     the property to be sold, and if it is a holding, the land-revenue assessed thereon\nor payable in respect thereof;\n(c)     if the property is to be sold for the recovery of an arrear due in respect thereof,\nCommissioner under clause (b) of sub-section (2) of section 89;\n(d)     if the property is to be sold otherwise than for the recovery of an arrear due in\nrespect thereof, any encumbrance, grant or contract to which the property is\nknown to be liable; and\n(e)     the amount for the recovery of which the sale is ordered.\n(2) The place of sale specified under clause (a) of sub-section (1), shall be either the office of\nthe Collector or some other place appointed by the Collector in this behalf and situate in or near the\nproperty to be sold."
    },
    {
      "provision_ref": "sec93",
      "section": "93",
      "title": "Section 93. Indemnity to Revenue Officer with respect to contents of proclamation. A Revenue",
      "content": "Officer shall not be answerable for any error, mis-statement or omission in any proclamation under\nsection 92 unless the same has been committed or made dishonestly."
    },
    {
      "provision_ref": "sec94",
      "section": "94",
      "title": "Section 94. Publication of proclamation. A copy of the proclamation shall be served on the defaulter",
      "content": "and be affixed in a conspicuous part of the office of the Tahsildar of the Tahsil in which the property\nto be sold is situate and shall also be posted in the office of the Collector.\n(2) The proclamation shall further be published in the manner prescribed in section 26, and in\nsuch other manner as the Collector thinks expedient.\n(3) A Copy of the proclamation may also be posted in the office of the Union Committee, Town\nCommittee or Union Council within the area of which property to be sold is situate."
    },
    {
      "provision_ref": "sec95",
      "section": "95",
      "title": "Section 95. Time and conduct of sale. (1) The sale shall not take place on a Sunday or other holiday,",
      "content": "or till after the expiration of at least thirty days from the date on which the copy of the proclamation\nwas posted in the office of the Collector.\n(2) The sale shall be by publication and shall be conducted either by the Collector in person or\nby a Revenue Officer specially appointed by him in this behalf."
    },
    {
      "provision_ref": "sec97",
      "section": "97",
      "title": "Section 97. Stay of sale. If at any time before the bidding at an auction is completed, the defaulter or",
      "content": "any other person having interest in the land or in immovable property pays the arrear in respect of\nwhich the property has been proclaimed for sale, together with the costs incurred for the recovery\nthereof, to the officer conducting the sale, or proves to the satisfaction of that officer that he has already\npaid the same either at the place and in the manner prescribed under section 76 or into Government\ntreasury, the sale shall be stayed."
    },
    {
      "provision_ref": "sec98",
      "section": "98",
      "title": "Section 98. Deposit by purchaser in case of sale of immovable property. When the highest bid at an",
      "content": "auction has been ascertained, the person who made that bid shall, on the requisition of the officer\nconducting the sale, pay to that officer a deposit of twenty-five per centum on the amount of his bid\nand shall, on payment thereof, be declared to be the purchaser, subject to the exercise of any right of\npre-emption under the law in force for the time being."
    },
    {
      "provision_ref": "sec99",
      "section": "99",
      "title": "Section 99. Consequences of failure to pay deposit. If the person who made the highest bid fails to",
      "content": "pay the deposit as required by section 98, the property shall forthwith be put to auction again and sold,\nand all expenses attending the first sale, and the deficiency of price, if any, which may happen on the\nre-sale may be recovered from him by the Collector as if the same were an arrear of land-revenue."
    },
    {
      "provision_ref": "sec100",
      "section": "100",
      "title": "Section 100. Time for payment in full. The full amount of the purchase money shall be paid by the",
      "content": "purchaser before the close of the thirtieth day from that on which he was declared to be the purchaser."
    },
    {
      "provision_ref": "sec101",
      "section": "101",
      "title": "Section 101. Procedure in default of payment. In default of payment of the full amount of the",
      "content": "purchase money within the period mentioned in section 100, the deposit referred to in section 98,\nshall, after defraying the expenses of the sale, be forfeited to Government and may, if the Collector,\nwith the previous sanction of the Commissioner so directs, be applied in reduction of the arrear, and\nthe property shall be re-sold, and the defaulting purchaser shall have no claim to the property or to\nany part of the sum for which it may subsequently be sold."
    },
    {
      "provision_ref": "sec102",
      "section": "102",
      "title": "Section 102. Report of sale to Commissioner. Every sale of immovable property under this Chapter",
      "content": "shall be reported by the Collector to the Commissioner."
    },
    {
      "provision_ref": "sec103",
      "section": "103",
      "title": "Section 103. Application to set aside sale. (1) At any time within thirty days from the date of the sale,",
      "content": "application may be made to the Commissioner to set aside the sale on the ground of some material\nirregularity or mistake in publishing or conducting it.\n(2) A sale shall not be set aside on any of the grounds specified in sub-section (1) unless the\napplicant proves to the satisfaction of the Commissioner that he has sustained substantial injury by\nreason of the irregularity or mistake."
    },
    {
      "provision_ref": "sec104",
      "section": "104",
      "title": "Section 104. Order confirming or setting aside sale. (1) After the expiration of thirty days from the",
      "content": "date of the sale, if such application as is mentioned in section 103 has not been made, or if such\napplication has been made and rejected, the Commissioner shall make an order confirming the sale,\nand if such application has been made and allowed, the commissioner shall make an order setting aside\nthe sale.\n(2) If at any time within thirty days from the date of the sale, the defaulter pays the arrear in\nrespect of which the property has been sold, together with the costs incurred for the recovery of such\narrear, the Commissioner shall make an order setting aside the sale."
    },
    {
      "provision_ref": "sec105",
      "section": "105",
      "title": "Section 105. Refund or deposit of purchase",
      "content": "money when sale set aside. Whenever the sale of any\nproperty is not confirmed or is set aside, the purchaser shall be entitled to receive back his deposit or\nhis purchase money, as the case may be."
    },
    {
      "provision_ref": "sec106",
      "section": "106",
      "title": "Section 106. Proclamation after postponement or on re",
      "content": "sale. A sale made after a postponement\nunder section 96, and a re-sale consequent on a purchaser’s default under section 101 or on the setting\naside of a sale under section 104, shall be made after the issue of a fresh proclamation in the manner\nprovided for in section 94."
    },
    {
      "provision_ref": "sec107",
      "section": "107",
      "title": "Section 107. On confirmation of sale possession and certificate to be granted to purchaser. (1)",
      "content": "After a sale has been confirmed in the manner aforesaid, the Collector shall put the person declared to\nbe the purchaser into possession of the property sold, and shall grant him a certificate to the effect that\nhe has purchased that property.\n(2) The certificate shall state whether or not the property was sold for the recovery of an arrear\ndue in respect thereof, and, if it was so sold, shall set forth the encumbrances, grants and contracts, if\nany, specified in the proclamation of the sale as saved by order of the Commissioner under clause (b)\nof sub-section (2) of section 89.\n(3) The certificate shall be deemed to be a valid transfer of the property but need not be\nregistered as a conveyance.\n(4) Any suit brought in any Court against the certified purchaser on the ground that the purchase\nwas made on behalf of a person other than the certified purchaser shall not be maintainable.\n(5) The certified purchaser of any immovable property shall be entitled to all rents and profits\nfalling due in respect of the property after the date of the confirmation of the sale and be liable for all\ninstalments of land-revenue and rates and cesses falling due in respect thereof after that date."
    },
    {
      "provision_ref": "sec108",
      "section": "108",
      "title": "Section 108. Sale of movable property and perishable articles. (1) The provisions of sections 92, 93,",
      "content": "94, 95, 96, 97, 103, 104, 105 and l06 shall apply, so far as they can be made applicable, to sale of\nmovable property, other than perishable articles, and as if—\n(a)     reference to the Commissioner in section 103 and 104 were a reference to the\nCollector; and\n(b)     in the case of sale of animals, the period of thirty days prescribed in section\n95, were a period of ten days.\n(2) Perishable articles shall be sold by auction with the least possible delay in accordance with\nsuch order as may from time to time be made by the Collector, either generally or specially in that\nbehalf, and the sale of such articles shall be finally concluded on the spot by the officer conducting\nsuch sale and shall not require confirmation."
    },
    {
      "provision_ref": "sec109",
      "section": "109",
      "title": "Section 109. Mode of payment for movable property when sale is concluded on the spot. (1) When",
      "content": "the sale of any perishable article is finally concluded by the officer conducting the same, the price of\nevery lot shall be paid for at the time of sale, or as soon thereafter as the said officer may fix, and in\ndefault of such payment the property shall forthwith be again put to auction and sold.\n(2) On payment of the purchase-money, the officer conducting the sale shall grant a receipt for\nthe same and the sale shall become absolute as against all persons whomsover."
    },
    {
      "provision_ref": "sec110",
      "section": "110",
      "title": "Section 110. Mode of payment for movable property when sale is subject to confirmation. (1) In",
      "content": "case of sale of movable property, other than perishable articles, the party who is declared to be the\npurchaser shall be required to deposit immediately twenty-five per centum on the amount of his bid,\nand in default of such deposit the property shall forthwith be again put to auction and sold.\n(2) The full amount of purchase-money shall be paid by the purchaser before the close of the\nseventh day after he is informed of the sale having been confirmed, or, if the said day be a Sunday or\nother holiday, then before the close of the first working day after such day.\n(3) On receipt of the full amount of the purchase-money, the purchaser shall be granted a receipt\nfor the sale, and the sale shall become absolute as against all persons whomsover."
    },
    {
      "provision_ref": "sec111",
      "section": "111",
      "title": "Section 111. Proceeds of sale. (1) When any sale of movable property under this Chapter has become",
      "content": "absolute, or when sale of immovable property has been confirmed, the proceeds of the sale shall be\napplied in the first place to the payment of any arrears, including costs incurred for the recovery thereof,\ndue to Government from the defaulter at the date of the confirmation of the sale, whether the arrears\nare of land-revenue or of sums recoverable as arrears of land-revenue, and the surplus, if any, shall be\npaid to the person whose property has been sold, or, if the property sold was owned by more than one\nperson, then to the owners either collectively or according to the amount of their recorded interests, as\nthe Collector thinks fit.\n(2) The surplus shall not, except under the orders of a Court, be paid to any creditor of the\nperson whose property has been sold.\n(3) If the proceeds of the sale fall short of such arrears as are referred to in sub-section (1), the\nbalance remaining due from the defaulter may be recovered from him by further proceedings under\nthis Chapter or by any other means authorised by law."
    },
    {
      "provision_ref": "sec112",
      "section": "112",
      "title": "Section 112. Claims to attached movable or immovable property how to be disposed of. (1) If any",
      "content": "claim shall be set up by a third person to movable or immoveable property attached under the\nprovisions of this Chapter, the Collector shall admit or reject his claim on an inquiry as provided in\nsection 27.\n(2) If the claim be admitted, wholly or partly, the property shall be dealt with accordingly and\nexcept in so far as it is admitted, the property shall be sold and the title of the purchaser shall be good\nfor all purposes, and the proceeds shall be disposed of in accordance with the provisions of section\n111."
    },
    {
      "provision_ref": "sec113",
      "section": "113",
      "title": "Section 113. Recovery of certain arrears through Revenue Officers instead of by suit. When a",
      "content": "Village Officer required by rules under section 36 to collect any land-revenue or sum recoverable as\nan arrear of land-revenue—\n(a)     satisfies a Revenue Officer that the revenue or the sum has fallen due and has\nnot been paid to him, or\n(b)     has collected such revenue or sum, but has not credited the same to Government\nin the manner provided in the rules,\nthe Revenue Officer may, subject to rules which the Board of Revenue may make in this behalf, recover\nsuch revenue or sum, from the person from whom it is due, or the Village Officer by whom it was\ncollected, as the case may be, as arrears of land-revenue."
    },
    {
      "provision_ref": "sec114",
      "section": "114",
      "title": "Section 114. Other sum recoverable as arrears of land",
      "content": "revenue. In addition to any sums recoverable\nas arrears of land-revenue under this Act or any other enactment for the time being in force, the\nfollowing sums may be so recovered, namely:—\n(a)     fees, fines, costs and other charges, including the Village Officers’ cess payable\nunder this Act;\n(b)        revenue due to the Government on account of pasture or other natural products\nof land, or on account of mills, fisheries or natural products of water, or on\naccount of other rights described in section 49 or section 50 in cases in which\nthe revenue so due has not been included in the assessment of an estate;\n(c)        fees payable under the law for the time being in force for the use or benefit\nderived from the construction and repair of embankments, and works for supply,\nstorage and control of water for agricultural purposes, and for the preservation\nand reclamation of soil and drainage and reclamation of swamps;\n(d)        sums leviable by or under the authority of Government as water-rates, or on\naccount of the maintenance or management of canals, embankments or other\nirrigation works, not being sums recoverable as arrears of land-revenue under\nany enactment for the time being in force; and\n(e)        sums payable to Government by a person who is surety for the payment of any\nof the foregoing sums or of any other sum recoverable as an arrear of land-\nrevenue."
    },
    {
      "provision_ref": "sec115",
      "section": "115",
      "title": "Section 115. Application of chapter VIII to sums recoverable under this chapter. (1) The",
      "content": "provisions of Chapter VIII shall, with respect to any sum mentioned or referred to in this Chapter,\napply, so far as they can be made applicable, as if the sum were an arrear of land-revenue, and the\nperson from whom, either as principal or as surety, it is due were a defaulter in respect of such an\narrear.\n(2) Unless any such sums is declared by any enactment for the time being in force to be\nrecoverable as if it were an arrear of land-revenue due in respect of the land charged therewith, the\nprovisions of section 90 shall apply under sub-suction (1) to the recovery thereof.\n1\n[115-A. Charges for recovery of dues, other than Provincial dues, as arrears of land-\nrevenue. Where any sum, other than a sum which is to be credited into and to form a part of the\nProvincial Consolidated Fund of West Pakistan, is collected as an arrear of land-revenue under the\nprovisions of this chapter, a commission at the rate of two per cent of the sum collected shall be\ndeducted therefrom as recovery charges, and the amount of such commission shall be credited into the\nProvincial Consolidated Fund of West Pakistan.]"
    },
    {
      "provision_ref": "sec116",
      "section": "116",
      "title": "Section 116. Revenue survey may be introduced by Board of Revenue in any part of Province. (1)",
      "content": "It shall be lawful for the Board of Revenue, whenever it may deem expedient, to direct by notification,\nthe survey of any land in any part of the Province with a view to the settlement of land-revenue, the\npreparation of records-of-rights and preservation thereof, or for any other similar purpose, and such\nsurvey shall be called a revenue survey.\n(2) A revenue survey may extend to the lands of any village, town, or city generally, or to such\nland only as may be specified in the notification.\n(3) Subject to the orders of the Board of Revenue, it shall be lawful for the officers conducting\nany such survey to except any land to which it may not seem expedient that such survey should extend.\n1\nInserted by West Pakistan Ordinance No. X of 1970, s. 2."
    },
    {
      "provision_ref": "sec117",
      "section": "117",
      "title": "Section 117. Power of Revenue Officers to define boundaries. (1) A Revenue Officer may, for the",
      "content": "purpose of framing any record or making any assessment under this Act, or on the application of any\nperson interested, define the limits of any estate, or of any holding, field or other portion of an estate,\nand may, for the purpose of indicating those limits, require boundary marks to be erected or repaired.\n(2) In defining the limits of any land under sub-section (1), the Revenue Officer may cause\nboundary marks to be erected on any boundary already determined by, or by order of, any Court or\nRevenue Officer or any Forest Settlement Officer appointed under the Forest Act, 1927 (Act XVI of\n1927), or restore and boundary mark already set up by, or by order of, any court or any such Officer."
    },
    {
      "provision_ref": "sec118",
      "section": "118",
      "title": "Section 118. Surveys for purpose of preparation of records. (1) When any land is being surveyed in",
      "content": "pursuance of rules under clause (c) of section 55 or under section 116, any Revenue Officer directing\nthe survey may, by notice or proclamation, require all persons having rights or interests in the land to\nattend personally or through authorised agent, and indicate, within a specified time, by temporary\nmarks of a kind to be described in the notice or proclamation, the limits of those rights or interests.\n(2) If a person to whom the notice or proclamation is addressed fails to comply with the\nrequisition, he shall be liable, at the discretion of the Revenue Officer, to a fine which may extend to\nfifty rupees."
    },
    {
      "provision_ref": "sec119",
      "section": "119",
      "title": "Section 119. Assistance to be given by holders and others in the measurement or classification of",
      "content": "lands. (1) It shall be lawful for the Revenue Officer to call upon all owners of land and other persons\ninterested therein to assist in the measurement or classification of the lands to which the survey extends\nby providing flag-holders and chainmen, and such owners shall be bound to provide suitable persons\nto act as flag-holders and chainmen.\n(2) If the owners of land fail to provide suitable persons to act as flag-holders and chainmen,\nor do not provide them in sufficient number, and it becomes necessary to employ hired labour for the\nobject aforesaid, or other similar object incidental to survey operations, it shall be lawful to assess the\ncost thereof with all contingent expenses, on the lands surveyed, for collection as an arrear of land-\nrevenue from such owners."
    },
    {
      "provision_ref": "sec120",
      "section": "120",
      "title": "Section 120. Professional surveys. (1) If it is found necessary to make a survey by an agency other",
      "content": "than that of Revenue Officer and Village Officer, the Board of Revenue may publish a notification\nstating—\n(a)   the local area to be surveyed and the nature of the survey;\n(b)     the names or official designation of the officer by whom the survey is to be\nmade; and\n(c)     the kind of boundary marks to be erected by those officers.\n(2) From the date of the notification, the officers specified therein, and the persons acting under\ntheir orders, shall have, for the purposes of the survey, the powers conferred on Revenue Officers by\nsection 30."
    },
    {
      "provision_ref": "sec121",
      "section": "121",
      "title": "Section 121. Power of Board of Revenue to make rules for demarcation of boundaries and",
      "content": "erection of boundary marks. (1) The Board of Revenue may make rules as to the manner in which\nthe boundaries of all or any of the estates in any local area are to be demarcated and as to the boundary\nmarks to be erected within those estates.\n(2) Rules under this section may prescribe, among other matters, the form of boundary marks\nand the material to be used in their construction."
    },
    {
      "provision_ref": "sec122",
      "section": "122",
      "title": "Section 122. Effect of the settlement of boundary. (1) The settlement of a boundary under any of the",
      "content": "foregoing provisions of this Chapter shall, subject to the provisions of Chapter XIII, be\ndeterminative—\n(a)     of the proper position of the boundary line or boundary marks, and\n(b)     of the rights of the land-owners on either side of the boundary fixed in respect of the\nland adjudged to appertain, or not to appertain, to their respective holdings.\n(2) Where a boundary has been so fixed, the Collector may, under rules to be framed in this\nbehalf be the Board of Revenue with the previous approval of Government, evict any land-owner who\nis wrongfully in possession of any land which has been adjudged in the settlement of a boundary not\nto appertain to his holding or to the holding of any person through or under whom he claims."
    },
    {
      "provision_ref": "sec123",
      "section": "123",
      "title": "Section 123. Power to fix boundary between riverain estates. (1) When any two or more estates are",
      "content": "subject to river action and the limits of any such estates are, by any law, rule of custom or usage, or\norder or decree of any Court or other authority, applicable thereto, liable to vary according as variation\nmay from time to time occur in the course or action of such river, the Board of Revenue may order a\npermanent boundary line to be fixed between any such estates or such portions thereof as are liable to\nriver action.\n(2) Upon an order being made under sub-section (1), the Collector shall fix a boundary line\nbetween such estates or portions of such estates accordingly, and shall demarcate the same, in\naccordance with the provisions of section 117, and of the rules, if any, made under section 121.\n(3) Every such boundary line shall be fixed with due regard the history of the estates and the\ninterests of the persons respectively owning them or possessing rights therein, in such manner as may\nbe just and equitable in the circumstances of each case.\n(4) No such boundary line shall be deemed to have been permanently fixed until it has been\napproved by the Commissioner.\nExplanation—In this section, and in this sections 124, 125 and 126, “Collector” shall be\ndeemed to include any Revenue Officer appointed by Government to perform the\nfunctions of Collector under all or any of the provisions thereof."
    },
    {
      "provision_ref": "sec124",
      "section": "124",
      "title": "Section 124. Effect of fixing a boundary between riverain estates. (1) Every boundary line fixed in",
      "content": "accordance with the provisions of section 123 shall, notwithstanding anything to the contrary in any\nlaw, rule of custom or usage, or order or decree of any Court or other authority, be fixed and constant\nboundary between the estates affected thereby, and the proprietary and all other rights in every holding,\nfield or other portion of an estate situate on each side of the boundary line so fixed, shall, subject to\nthe other provisions of this section, vest in the land owners of the estate which lies on that side of the\nboundary line on which such holding, field or other portion of an estate situate.\n(2) If, by the operation of sub-section (1), the proprietary or any other rights in any land which\nat the time a boundary line is fixed is under cultivation, or reasonably fit for cultivation, or yields any\nproduce of substantial value, be transferred from the land-owners and other right-holders of any one\nestate, to the land-owner of any other estate, the Collector shall, by written order, direct that the rights\nin such land shall not, subject to the provisions of section 125, 126 and 127, be so transferred unless\nand until the land in respect of which any such order is made ceases to be reasonably fit for cultivation,\nor to yield any produce of substantial value, and upon any such order being made, the transfer of the\nrights in such land shall be suspended accordingly.\n(3) When any portion of the land specified in any order made under sub-section (2), ceases to\nbe reasonably fit for cultivation to yield any produce of substantial value, the order shall, when the\nCollector, in writing, so directs, cease to operate to that portion.\n(4) The decision of the Collector as to whether, for the purposes of sub-section (2), any land is\nor is not reasonably fit for cultivation or does or does not yield any produce of substantial value, shall\nbe final."
    },
    {
      "provision_ref": "sec125",
      "section": "125",
      "title": "Section 125. Application for immediate transfer of rights. When any order has been made under",
      "content": "sub-section (2) of section 124, the land-owners, or any of them, in whom, but for such order, the rights\nin the land specified therein would vest, may apply in writing to the Collector to forthwith transfer the\nrights the transfer of which has been suspended by such order, upon payment of compensation for the\nsame."
    },
    {
      "provision_ref": "sec126",
      "section": "126",
      "title": "Section 126. Award of cumpensation and extinguishment of rights thereby. (1) When an",
      "content": "application under section 125 is made, the Collector shall—\n(a)     fix a day for the hearing of the application;\n(b)     cause notice of the application, and of the day fixed for the hearing thereof, to be served\non, or proclaimed for the information of, all persons recorded as having rights in the\nland specified in the order made under sub-section (2) of section 124, and all other\npersons interested or claiming to be interested therein;\n(c)     Upon the day so fixed for hearing, or any day to which the hearing may be adjourned,\ninquire into the rights in the land and award compensation in respect of all rights found\nestablished therein to the persons severally entitled thereto;\n(d)     inform the applicant of the aggregate amount of compensation so awarded and require\nhim to deposit the amount with the Collector on or before a day to be fixed by him in\nthat behalf;\nProvided that, notwithstanding anything contained in this sub-section, it shall be lawful for the\nCollector, in his discretion and at any time before an award of compensation thereon has been made,\nto reject such application.\n(2) In awarding compensation under sub-section (1), the Collector shall be guided by the\nprovisions of section 23 and section 24 of the Land Acquisition Act, 1894 (Act I of 1894), so far as\nthe same may be applicable to the circumstances of the case.\n(3) On the fifteenth day of May next after the whole amount of compensation so awarded has\nbeen deposited with the Collector, the order made under sub-section (2) of section 124 shall cease to\noperate, and the rights specified therein shall be transferred and vest in the manner provided for in sub-\nsection (1) of that section, and the Collector shall proceed to tender the compensation to the persons\nseverally entitled to receive the same under his award.\n(4) If any such person as aforesaid refuses to accept the sum so awarded and tendered to him,\nit shall be placed to his credit in Government treasury.\n(5) When any order made under sub-section (2) of section 124 ceases, under the provisions of\nsub-section (3) of the said section, to operate, all rights reserved to any person by such order shall be\nextinguished."
    },
    {
      "provision_ref": "sec127",
      "section": "127",
      "title": "Section 127. Voluntary transfers not affected. Notwithstanding the provisions of sections 124, 125",
      "content": "and 126, when any person possessing any rights in any land, in regard to the rights in which an order\nhas been made under sub-section (2) of section 124, voluntarily transfers such rights to any land-\nowners of the estate, in the land-owner of which but for such order such rights would vest under the\noperation of sub-section (1) of that section, the rights so transferred shall forthwith cease to be subject\nto such order and vest in the land-owners to whom they have been so transferred."
    },
    {
      "provision_ref": "sec128",
      "section": "128",
      "title": "Section 128. Rights transferred to be liable to all the incidents of tenure of the estate to which the",
      "content": "transfer is made. In every case in which, under the provisions of section 124, or sections 125 and 126,\nor section 127, proprietary or other rights in land are transferred from the land-owners, and other right-\nholders of any one estate to the land-owners of any other estate, such rights shall be subject to all the\nincidents of tenure and liabilities which, under any law or custom for the time being in force, apply to\nthe rights of the land-owners of the estate to which such rights are so transferred."
    },
    {
      "provision_ref": "sec129",
      "section": "129",
      "title": "Section 129. Cost of erection and repair of boundary and survey marks. (1) Subject to any rules",
      "content": "which the Board of Revenue may, with the previous approval of Government, make in this behalf,\nboundary and survey marks shall be erected and kept in repair by or at the cost of the persons interested\nin the land for the indication of the limits of which they are required :\nProvided that Government may in any case direct that the cost of erection shall be borne by\nGovernment or be paid out of the proceeds of the Village Officers’ cess.\n(2) It shall be the duty of the Village Officers to prevent the destruction or unauthorized\nalteration of the village boundary and survey marks."
    },
    {
      "provision_ref": "sec130",
      "section": "130",
      "title": "Section 130. Recovery of cost incurred by Government. (1) If the persons interested in the land fail",
      "content": "to erect or repair a boundary or survey mark within thirty days from the date of their being required by\na Revenue Officer to do so, the Revenue Officer may cause it to be erected or repaired.\n(2) Where the Revenue Officer causes a boundary or survey mark to be erected or repaired he\nshall, subject to any rules or direction under section 129, apportion the cost among the person interested\nin the land in such manner as he deems just, and certify, the same to the Collector.\n(3) The Collector may recover the cost form such persons as if it were an arrear of land-revenue."
    },
    {
      "provision_ref": "sec131",
      "section": "131",
      "title": "Section 131. Responsibility for the maintenance of boundary and survey marks. Every land",
      "content": "owner\nshall be responsible for the maintenance and good repair of the boundary and survey marks of his\nholding, and for any charges reasonably incurred on account of the same by the Revenue Officers in\ncases of alteration, removal or disrepair."
    },
    {
      "provision_ref": "sec132",
      "section": "132",
      "title": "Section 132. Report of destruction or removal of or injury to boundary or survey marks. Every",
      "content": "Village Officer of an estate shall be bound to furnish a Revenue Officer with information respecting\nthe destruction or removal of, or any injury done to, any boundary or survey mark lawfully erected in\nthe estate."
    },
    {
      "provision_ref": "sec133",
      "section": "133",
      "title": "Section 133. Land measurement or survey to be based on a square system or rectangulation. (1)",
      "content": "Save as may specifically be otherwise provided for in the rules made in this behalf by the Board of\nRevenue, with the previous approval of Government, land measurement or survey shall be based on\nsquare system or rectangulation, and no survey or khasra number shall be made less than one acre in\narea.\n(2) The rules made under sub-section (1) may also lay down conditions for and restrictions\nupon sub-division of survey or khasra numbers."
    },
    {
      "provision_ref": "sec134",
      "section": "134",
      "title": "Section 134. Penalty. (1) If any person wilfully destroys or injures or without lawful authority removes",
      "content": "a boundary or survey mark lawfully erected, he may be ordered by a Revenue Officer to pay such fine\nnot exceeding fifty rupees for each mark so destroyed, injured or removed as may, in the opinion of\nthe Revenue Officer, be necessary to defray the expenses of restoring the same and of rewarding the\nperson, if any, who gave information of the destruction, injury or removal.\n(2) The imposition of a fine under this section shall not bar a prosecution under section 434 of"
    },
    {
      "provision_ref": "sec135",
      "section": "135",
      "title": "Section 135. Application for partition. Any joint owner of land may apply to a Revenue Officer for",
      "content": "partition of his share in the land if—\n(a)    at the date of the application the share is recorded under Chapter VI as belonging to\nhim; or\n(b)    his right to the share has been established by a decree which is still subsisting at that\ndate; or\n(c)    a written acknowledgment of that right has been executed by all persons interested in\nthe admission or denial thereof."
    },
    {
      "provision_ref": "sec136",
      "section": "136",
      "title": "Section 136. Restrictions and limitations on partition. Notwithstanding the provisions of section",
      "content": "135—\n(a)    places of worship and burial grounds held in common before partition shall continue\nto be so held after partition; and\n(b)    partition of any of the following properties, namely :—\n(i)     any embankment, water-course, well or tank and any land on which the\nsupply of water to any such work may depend;\n(ii)    any grazing ground; and\n(iii)   any land which is occupied as the site of a town or village, may be\nrefused if, in the opinion of the Revenue Officer, the partition of such\nproperty is likely to cause inconvenience to the co-sharers or other\npersons directly or indirectly interested therein, or to diminish the utility\nthereof to those persons."
    },
    {
      "provision_ref": "sec137",
      "section": "137",
      "title": "Section 137. Notice of application for partition. The Revenue Officer, on receiving the application",
      "content": "under section 135 shall, if it is in order, and not against the provisions of the West Pakistan Land\nReforms Regulation, 1959 (Martial Law Regulation No. 64), and not open to objection on the face of\nit, fix a day for the hearing thereof, and—\n(a)     cause notice of the application and of the day so fixed to be served on such of\nthe recorded co-sharers as have not joined in the application; and\n(b)     if he thinks fit, cause notice to be served on or proclaimed for the information\nof any other persons whom he may deem to be directly or indirectly interested\nin the application."
    },
    {
      "provision_ref": "sec138",
      "section": "138",
      "title": "Section 138. Addition of parties to application. On the day fixed under section 137 for the hearing of",
      "content": "the application, or on any other day to which the hearing may be adjourned, the Revenue Officer shall\nascertain whether any of the other co-sharers desire the partition of their shares also, and if any of them\nso desires, he shall add him as an applicant for partition."
    },
    {
      "provision_ref": "sec139",
      "section": "139",
      "title": "Section 139. Disallowance of partition. After examining such of the co",
      "content": "sharers and other persons may\nbe present on that day, the Revenue Officer may, if he is of opinion that there is good and sufficient\ncause for partition to be disallowed, reject the application, recording the grounds for such rejection."
    },
    {
      "provision_ref": "sec140",
      "section": "140",
      "title": "Section 140. Procedure on admission of application. If the Revenue Officer does not reject the",
      "content": "application under section 139, he shall ascertain the questions, if any, in dispute between any of the\npersons interested, distinguishing between—\n(a)    questions as to title in the property of which partition is sought; and\n(b)    questions as to the property to be divided or the mode of making the partition."
    },
    {
      "provision_ref": "sec141",
      "section": "141",
      "title": "Section 141. Disposal of questions as to title in the property to be divided. (1) When there is a",
      "content": "question as to title in any property of which partition is sought, the Revenue Officer may decline to\ngrant the application for partition until the question has been determined by a competent Court, or he\nmay himself proceed to determine the question as though he were such a Court.\n(2) Where the Revenue Officer does not himself proceed to determine the question of title as a\nCivil Court, he may, for reasons to be recorded by him in this behalf, require a party specified by him\nto file a suit in a Civil Court, within such period not exceeding ninety days from the date of his order\nas he may fix, for obtaining a decision regarding the question.\n(3) On the filing of a civil suit by the party required so to do within the specified period, the\nRevenue Officer shall suspend further action on the application for partition till the said civil suit is\ndecided by the Court and a copy of the Court’s order is produced before him.\n(4) In case the party so required fails to file a suit within the specified period, the Revenue\nOfficer may proceed with the partition and decide the question of title himself.\n(5) Where the Revenue Officer himself proceeds to determine the question, the following rules\nshall apply, namely:—\n(a)     If the question is one over which a Revenue Court has jurisdiction, the Revenue\nOfficer shall proceed as a Revenue Court under the law for the time being in\nforce.\n(b)     If the question is one over which a Civil Court has jurisdiction, the procedure\nof the Revenue Officer shall be that applicable to the trial of an original suit by\na Civil Court, and he shall record a judgment and a decree containing the\nparticulars required by the Code of Civil procedure, 1908 (Act V of 1908), to\nbe specified therein.\n(c)     An appeal shall lie from the decree of the Revenue Officer under clause (b) as\nthough that decree were a decree of a Civil Judge in an original suit.\n(d)     Upon such an appeal being made, the District Court or the High Court, as the\ncase may be, may issue an injuction to the Revenue Officer requiring him to\nstay proceedings pending the disposal of the appeal.\n(e)     From the appellate decree of a District Court upon such an appeal, a further\nappeal shall lie to the High Court, if such further appeal is allowed by the law\nfor the time being in force."
    },
    {
      "provision_ref": "sec142",
      "section": "142",
      "title": "Section 142. Disposal of other questions. (1) When there is a question as to the property to be divided,",
      "content": "or the mode of making a partition, the Revenue Officer shall, after such inquiry as he deems necessary,\nrecord an order stating his decision on the question and his reasons for the decision.\n(2) An appeal may be preferred from an order under sub-section (1) within thirty days from the\ndate thereof, and, when such an appeal is preferred and the institution thereof has been certified to the\nRevenue Officer by the authority to whom the appeal has been preferred, the Revenue Officer shall\nstay further proceedings pending the disposal of the appeal.\n(3) If an applicant for partition is dissatisfied with an original or appellate order under this\nsection, and applies for permission to withdraw from the proceedings in so far as they relate to the\npartition of his share, he shall be permitted to withdraw therefrom on such terms as the Revenue Officer\nthinks fit.\n(4) When an applicant withdraws under the provisions of sub-section (3), the Revenue Officer\nmay, where the other applicants, if any, desire the continuance of the proceedings continue them in so\nfar as they relate to the partition of the shares of those other applicants."
    },
    {
      "provision_ref": "sec143",
      "section": "143",
      "title": "Section 143. Administration of property excluded from partition. When any such property as is",
      "content": "referred to in clause (b) of section 136 is excluded from partition, the Revenue Officer may determine\nthe extent to and the manner in which the co-sharers and other persons interested therein may make\nuse thereof, and the proportion in which expenditure incurred thereon and profits derived therefrom\nare, respectively, to be borne by and divided among those persons or any of them."
    },
    {
      "provision_ref": "sec144",
      "section": "144",
      "title": "Section 144. Distribution of revenue and rent after partition. (1) The amount of revenue to be paid",
      "content": "in respect of each of the holdings in to which land has been divided on a partition shall be determined\nby the Revenue Officer making the partition.\n(2) The decision of the Revenue Officer under sub-section (1) as to the revenue to be paid in\nrespect of each holding shall, where the estate in which the holding is situate is subject to a fixed\nassessment, be deemed to be an order under sub-section (1) of section 67.\n(3) Where new estates have been created at a partition and the land-revenue has been\nfraudulently or erroneously distributed among them, the Board of Revenue may, within twelve years\nfrom the time of discovery of the fraud or error, order a new distribution of the land-revenue among\nthe several estates, on an estimate of the assets of each estate at the time of the partition to be made\nconformably to the best evidence and information procurable respecting the same."
    },
    {
      "provision_ref": "sec145",
      "section": "145",
      "title": "Section 145. Instrument of partition. When a partition is completed, the Revenue Officer shall cause",
      "content": "an instrument of partition to be prepared and the date on which the partition is to take effect to be\nrecorded therein."
    },
    {
      "provision_ref": "sec146",
      "section": "146",
      "title": "Section 146. Delivery of possession of property allotted on partition. An owner to whom any land",
      "content": "is allotted in proceedings for partition shall be entitled to possession thereof as against the other parties\nto the proceedings and their legal representatives, and a Revenue Officer shall, on application made to\nhim for the purpose by any such owner at any time within three years from the date recorded in the\ninstrument of partition under section 145, give effect to that instrument so far as it concerns the\napplicant as if it were a decree for immovable property."
    },
    {
      "provision_ref": "sec147",
      "section": "147",
      "title": "Section 147. Affirmation of partition privately effected. (l) In any case in which a partition has been",
      "content": "made without the intervention of a Revenue Officer, any party thereto may apply to a Revenue Officer\nfor an order affirming the partition.\n(2) On receiving the application, the Revenue Officer shall enquire, into the case, and if he\nfinds that the partition has in fact been made, he may make an order affirming it and proceed under\nsections 143, 144, 145 and 146, or any of those sections, as circumstances may require, in the same\nmanner as if the partition had been made on an application to himself under this Chapter."
    },
    {
      "provision_ref": "sec148",
      "section": "148",
      "title": "Section 148. Power to make rules as to cost of partition. The Board of Revenue may, with the",
      "content": "previous approval of Government, make rules for determining the costs of partitions under this Chapter\nand the mode in which such costs are to be apportioned."
    },
    {
      "provision_ref": "sec149",
      "section": "149",
      "title": "Section 149. Re",
      "content": "distribution of land according to custom. When by established custom, any land in\nan estate is subject to periodical re-distribution, a Revenue Officer may, on the application of any of\nthe land-owners, enforce the re-distribution according to the custom, and for this purpose may exercise\nall or any of the powers of a Revenue Officer in proceedings of partition."
    },
    {
      "provision_ref": "sec150",
      "section": "150",
      "title": "Section 150. Officers who may be empowered to act under this chapter. The Revenue Officer by",
      "content": "whom proceedings may be taken under this Chapter shall be a Revenue Officer not below an Assistant\nCollector of the First Grade."
    },
    {
      "provision_ref": "sec151",
      "section": "151",
      "title": "Section 151. Power to refer to arbitration. (1) Any Revenue Officer may, with the consent of the",
      "content": "parties, refer to arbitration any dispute arising before him in any matter under this Act.\n(2) A Collector, or any Assistant Collector of the First Grade may, without the consent of the\nparties, refer to arbitration any dispute before him with respect to—\n(a)     any matter of which an entry is to be made in any record or register under Chapter\nVI;\n(b)     any matter relating to the distribution of an assessment under section 67;\n(c)     the limits of any estate or of any holding, field, or other portion of an estate; or\n(d)     the property to be divided at a partition or the mode of making partition."
    },
    {
      "provision_ref": "sec152",
      "section": "152",
      "title": "Section 152. Order of reference and contents thereof. (1) In referring a dispute to arbitration, a",
      "content": "Revenue Officer shall make an order of reference and specify therein the precise matter submitted to\narbitration, the number of arbitrators which each party to the dispute is to nominate, the period within\nwhich arbitrators are to be nominated, and the period within which the award is to be delivered.\n(2) The number of arbitrators which each party may nominate must be the same and must not\nexceed two.\n(3) If from any cause arbitrators are not nominated or an award is not delivered, within the\nperiod fixed for in the order of reference, the Revenue Officer may, from time to time, extend that\nperiod, or may cancel the order of reference."
    },
    {
      "provision_ref": "sec153",
      "section": "153",
      "title": "Section 153. Nomination of arbitrators. (1) When an order of reference has been made each party",
      "content": "may nominate the number of arbitrators specified in the order, and the Revenue Officer shall nominate\none other arbitrator.\n(2) The Revenue Officer may, for reasons to be recorded by him, make an order disallowing\nany nomination made by either party and requiring the party to make another nomination within a time\nto be specified in the order.\n(3) An order under sub-section (2) shall be final."
    },
    {
      "provision_ref": "sec154",
      "section": "154",
      "title": "Section 154. Substitution of arbitrators by parties. If an arbitrator nominated by a party dies, desires",
      "content": "to be discharged, or refuses or becomes incapable to act, the party may nominate another person in his\nstead."
    },
    {
      "provision_ref": "sec155",
      "section": "155",
      "title": "Section 155. Nomination and substitution of arbitrators by Revenue Officers. In any of the",
      "content": "following cases, namely:—\n(a)     if either of the parties fails to nominate an arbitrator under sub-section (1) of\nsection 153 within the period fixed in the order of reference; or\n(b)     if the nomination of an arbitrator has been disallowed under sub-section (2) of\nsection 153 and another arbitrator is not nominated within the time specified in\nthe order under that sub-section, or having been so nominated, his nomination\nis also disallowed ; or\n(c)     if a party entitled to nominate an arbitrator in place of another arbitrator under\nsection 154 fails to nominate him within one week from the date of the\ncommunication to him of a notice requiring him to make the nomination; or\n(d)     if an arbitrator nominated by the Revenue Officer dies, desires to be discharged,\nor refuses or becomes in capable to act,\nthe Revenue Officer may nominate a person as arbitrator."
    },
    {
      "provision_ref": "sec156",
      "section": "156",
      "title": "Section 156. Process for appearance before arbitrators. (1) The Revenue Officer shall, on the",
      "content": "application of the arbitrators, issue the same processes to the parties and witnesses whom the arbitrators\ndesire to examine as he may issue in any proceedings under this Act before himself.\n(2) Any such party or witness shall be bound to appear before the arbitrators in obedience to a\nprocess issued under sub-section (1), either in person or by agent, as the arbitrators may require.\n(3) The person attending in obedience to the process shall be bound to state the truth upon any\nmatter respecting which he is examined or makes statements, and to produce such documents and other\nthings relating to any such matter as may be specified in the process."
    },
    {
      "provision_ref": "sec157",
      "section": "157",
      "title": "Section 157. Award of arbitrators and presentation thereof. (1) The arbitrators shall make an award",
      "content": "in writing under their hands concerning the matters referred to them for arbitration, and state therein\ntheir reasons therefor, and any arbitrator dissenting from the award made by a majority of the\narbitrators shall state the grounds of his dissent.\n(2) The arbitrators shall present the award to the Revenue Officer in person or by agent, or send\nthe same to him by registered post."
    },
    {
      "provision_ref": "sec158",
      "section": "158",
      "title": "Section 158. Procedure on presentation of award. (1) When the award has been received, the",
      "content": "Revenue Officer shall fix a date for the consideration of the award.\n(2) On the date fixed under sub-section (1) or on any subsequent date to which an adjournment\nmay be made, the Revenue Officer shall hear any objections which the parties may have to make to\nthe award."
    },
    {
      "provision_ref": "sec159",
      "section": "159",
      "title": "Section 159. Effect of award. (1) The Revenue Officer may accept, modify or reject the award,",
      "content": "recording his reasons for doing so in his decision respecting the dispute which was referred to\narbitration.\n(2) An appeal shall lie from the decision of the Revenue Officer made under sub-section (1) as\nif arbitrators had not been appoint."
    },
    {
      "provision_ref": "sec160",
      "section": "160",
      "title": "Section 160. Arbitration Act not to apply to arbitration under this Chapter. Nothing in the",
      "content": "Arbitration Act, 1940 (Act X of 1940), shall apply to any arbitration under this Chapter.\nAPPEAL, REVIEW AND REVISION"
    },
    {
      "provision_ref": "sec161",
      "section": "161",
      "title": "Section 161. Appeals. (1) Save as otherwise provided by this Act, an appeal shall lie from an original",
      "content": "or appellate order of a Revenue Officer as follows, namely—\n(a)     to the Collector, when the order is made by an Assistant Collector, of either grade;\n(b)     to the Commissioner, when the order is made by a Collector;\n(c)     to the Board of Revenue only on a point of law, when the order is made by a\nCommissioner:\nProvided that—\n(i)     when an original order is confirmed on first appeal, a further appeal shall not lie;\n(ii)    when any such order is modified or reversed on appeal by the Collector, the order made by\nthe Commissioner on further appeal, if any, to him shall be final.\nExplanation—(1) An order passed in review, modifying or reversing a previous order, shall be\ndeemed to be an original order for the purposes of this section.\n(2) An order, shall not be confirmed, modified or reversed in appeal unless reasonable notice\nhas been given to the parties affected thereby to appear and be heard in support of or against the order\nappealed from."
    },
    {
      "provision_ref": "sec162",
      "section": "162",
      "title": "Section 162. Limitation for appeals. Save as otherwise provided by this Act, the period of limitation",
      "content": "for an appeal under section 161 shall run from the date of the order appealed against and shall be—\n(a)     thirty days, where the appeal lies to the Collector;\n(b)     sixty days, where the appeal lies to the Commissioner;\n(c)     ninety days, where the appeal lies to the Board of Revenue."
    },
    {
      "provision_ref": "sec163",
      "section": "163",
      "title": "Section 163. Review. (1) A Commissioner, Collector or an Assistant Collector, may, at any time, on",
      "content": "his own motion, review any order passed by himself or any of his predecessors-in-office, and on so\nreviewing modify, reverse or confirm the same.\n(2) Any person considering himself aggrieved by an order passed by a Commissioner, Collector\nor an Assistant Collector, and who, from the discovery of new and important matter or evidence which,\nafter the exercise of due diligence was not within his knowledge or could not be produced by him at\nthe time when the order was passed, or on account of some mistake or error apparent on the face of the\nrecord or for any other sufficient reason, desires to obtain a review of the order passed against him,\nmay apply for a review of the order to the Commissioner, Collector or Assistant Collector, as the case\nmay be, and such officer may modify, reverse or confirm any order passed by himself or by any of his\npredecessors-in-office:\nProvided that—\n(a)     an order passed by his predecessor-in-office shall not be reviewed under sub-\nsection (1) or sub-section (2) by the—\n(i)      Commissioner, without first obtaining the sanction of the Board of\nRevenue;\n(ii)     Collector, without first obtaining the sanction of the Commissioner,\nand no order shall be reviewed by any other Revenue Officer, without\nfirst obtaining the sanction of the Revenue Officer to whose control\nhe is immediately subject;\n(b)     an application for review of an order shall not be entertained unless it is made\nwithin ninety days from the passing of the order, or unless the applicant\nsatisfies the Revenue Officer that he had sufficient cause for not making the\napplication within that period;\n(c)     an order shall not be modified or reversed unless reasonable notice has been\ngiven to the parties affected thereby to appear and be heard in support of the\norder;\n(d)     an order against which an appeal has been preferred shall not be reviewed.\n(3) For the purposes of this section, the Collector shall be deemed to be successor-in-office of\nany Revenue Officer of a lower class who has left the district or has ceased to exercise powers as a\nRevenue Officer, and to whom there is no successor-in-office.\n(4) An appeal shall not lie from an order refusing to review or confirming on review a previous\norder."
    },
    {
      "provision_ref": "sec164",
      "section": "164",
      "title": "Section 164. Revision. (1) The Board of Revenue, may, at any time, on its own motion, or on an",
      "content": "application made to it within ninety days of the passing of any order, call for the record of any case\npending before, or disposed of by, any Revenue Officer subordinate to it.\n(2) A Commissioner or Collector may, at any time, of his own motion or on an application\nmade to him within ninety days of the passing of any order, call for the record of any case pending\nbefore, or disposed of by, any Revenue Officer under his control.\n(3) If in any case in which a Collector has called for a record he is of opinion that proceedings\ntaken or order made should be modified or reversed, he shall report the case with his opinion\nthereon for the orders of the Commissioner.\n(4) The Board of Revenue may, in any case called for under sub-section (1) and a\nCommissioner may in any case called for under sub-section (2) or reported to him under sub-section\n(3) pass such orders as it or he thinks fit:\nProvided that no order shall be passed under this section reversing or modifying any\nproceedings or order of a subordinate Revenue Officer affecting any person without giving such person\nan opportunity of being heard."
    },
    {
      "provision_ref": "sec165",
      "section": "165",
      "title": "Section 165. Stay of proceedings and execution of orders and decrees. (1) An appeal or revision",
      "content": "shall not operate as a stay of proceedings under the order or decree appealed from or under revision,\nexcept so far as the appellate or revisional authority may order, nor shall execution of any order or\ndecree be stayed by reason only of an appeal or application for revision having been made, but the\nappellate or revisional authority may, for sufficient cause, order stay of execution of any such order or\ndecree.\n(2) No order for stay of execution shall be made under sub-section (1), unless the authority\nmaking it is satisfied that—\n(a)     substantial loss may result to the party applying for stay of execution unless the\norder is made;\n(b)     the application has been made without unreasonable delay; and\n(c)     where necessary, security has been given by the applicant for the due\nperformance of such order or decree as may ultimately be binding upon him."
    },
    {
      "provision_ref": "sec166",
      "section": "166",
      "title": "Section 166. Clerical mistakes, etc. Clerical or arithmetical mistakes in any decree or order made by",
      "content": "any Revenue Officer, or errors therein from any accidental slip or omission may, at any time, be\ncorrected by such officer.\nExplanation—In this section, “Officer” includes the successor-in-office of the officer."
    },
    {
      "provision_ref": "sec167",
      "section": "167",
      "title": "Section 167. Computation of period limited under this Chapter. In the computation of the period",
      "content": "for an appeal from, or an application for the review or revision of, an order under this Act, the limitation\ntherefor shall be governed by the provisions of the limitation Act, 1908 (Act IX of 1908).\nRevenue Deposits"
    },
    {
      "provision_ref": "sec168",
      "section": "168",
      "title": "Section 168. Power to deposit certain sums other than rent. (1) In either of the following cases,",
      "content": "namely—\n(a)   when a headman or other land-owner to whom any sum other than rent is\npayable on account of liability under this Act, refuses to receive the sum from,\nor to grant a receipt therefor to, the person by whom it is payable, or\n(b)     when the person by whom any such sum is payable is in doubt as to the headman\nor other land-owner entitled to receive it,\nthat person may apply to a Revenue Officer for leave to deposit the sum in his office, and the Revenue\nOfficer shall receive the deposit if, after examining the applicant, he is satisfied that there is sufficient\nground for the application, and if the applicant pays the fee, if any, which may be chargeable on any\nnotice to be issued of the receipt thereof.\n(2) When a deposit has been so received, the liability of the depositor to the headman or other\nland-owner, for the amount thereof shall be discharged."
    },
    {
      "provision_ref": "sec169",
      "section": "169",
      "title": "Section 169. Procedure in case of deposits. (1) If the deposit purports to be made on account of any",
      "content": "payment due to Government, it may be credited accordingly.\n(2) A Revenue Officer receiving a deposit purporting to be made on any other account shall\ngive notice of the receipt thereof to every person who, he has reason to believe, claims or is entitled to\nthe deposit, and may pay the amount thereof to any person appearing to him to be entitled to the same,\nor may, if he thinks fit, retain the deposit pending the decision of a Civil Court as to the person so\nentitled.\n(3) No suit or other proceedings shall be instituted against Government or the Board of\nRevenue, or against any servant of the State, in respect of any thing done in good faith by a Revenue\nOfficer under this section, but nothing herein shall prevent any person entitled to receive the amount\nof any such deposit from recovering it from a person to whom it has been paid by Revenue Officer.\nOrders of Civil and Criminal Courts"
    },
    {
      "provision_ref": "sec170",
      "section": "170",
      "title": "Section 170. Orders of Civil and Criminal Courts for execution of processes against land, etc",
      "content": "Orders issued by any Civil or Criminal Courts for the attachment, sale or delivery of any land, or for\nthe attachment or sale of the produce of any land, shall be addressed to the Collector or such Revenue\nOfficer as the Collector may appoint in this behalf, and be executed by the Collector or that officer in\naccordance with the provisions of the law applicable to the Court issuing the orders, and with any rules\nnot inconsistent therewith made by the Board of Revenue with the concurrence of the High Court and\nthe previous approval of Government."
    },
    {
      "provision_ref": "sec171",
      "section": "171",
      "title": "Section 171. Preservation of attached produce. (1) The attachment of the produce of any land in",
      "content": "pursuance of an order of any Court or other authority shall not prevent the person to whom the produce\nbelongs from reaping, gathering or storing it or doing any other act necessary for its preservation.\n(2) The attaching officer shall do or cause to be done all acts necessary for the preservation of\nthe produce if the person to whom it belongs fails to do so.\n(3) When sale of produce follows on its attachment, the purchaser shall be entitled, by himself\nor by any person appointed by him in this behalf, to enter upon the place where the produce is, and do\nall that is necessary for the purpose of preserving and removing it.\nExclusion of Jurisdiction of Civil Courts"
    },
    {
      "provision_ref": "sec172",
      "section": "172",
      "title": "Section 172. Exclusion of jurisdiction of Civil Courts in matters within the jurisdiction of Revenue",
      "content": "Officers. (1) Except as otherwise provided by this Act, no Civil Court shall have jurisdiction in any\nmatter which Government, the Board of Revenue, or any Revenue Officer, is empowered by this Act\nto dispose of, or take cognizance of the manner in which Government, the Board of Revenue, or any\nRevenue Officer exercises any powers vested in it or him by or under this Act.\n(2) Without prejudice to the generality of the provisions of sub-section (1), a Civil Court shall\nnot exercise jurisdiction over any of the following matters, namely: —\n(i)      any question as to the limits of any land which has been defined by a Revenue\nOfficer as land to which this Act does or does not apply ;\n(ii)     any claim to compel the discharge of any duties imposed by this Act or any\nother enactment for the time being in force on any Revenue Officer as such;\n(iii)    any claim to the office of a Village Officer, or in respect of any injury caused\nby exclusion from such office, or to compel the discharge of the duties or a\ndivision of the emoluments thereof ;\n(iv)     any notification directing the making or revision of a record-of-rights ;\n(v)      the farming of a record-of-rights or periodical record, or the preparation, signing\nor attestation of any of the documents included in such a record;\n(vi)     the correction of any entry in a record-of-rights, periodical record or register of\nmutations ;\n(vii)    any notification of the undertaking of the general re-assessment of a District or\nTehsil having been sanctioned by Government ;\n(viii)   any objection to the amount or rate of any assessment of land-revenue or the\nperiod thereof authorised by Government ;\n(ix)     the claim of any person to be liable for an assessment of land-revenue or of any\nother revenue as assessed under this Act ;\n(x)      the amount of land-revenue to be assessed on any estate or to be paid in respect\nof any holding under this Act ;\n(xi)     the amount of, or the liability of any person to pay, any other revenue to be\nassessed under this Act, or any cess, charge or rate to be assessed on an estate\nor holding under this Act or any other enactment for the time being in force ;\n(xii)    any claim relating to the allowance to be received by a land-owner who has\ngiven notice of his refusal to be liable for an assessment, or any claim connected\nwith, or arising out of, any proceedings taken in consequence of the refusal of\nany person to be liable for an assessment under this Act ;\n(xiii)   the formation of an estate or determination of its boundaries ;\n(xiv)    any claim to hold free of revenue any land, mills, fisheries or natural products\nof land or water ;\n(xv)     any claim connected with, or arising out of, the collection by Government, or\nthe enforcement by Government of any process for the recovery of, land-\nrevenue or any sum recoverable as an arrear of land-revenue ;\n(xvi)    any claim to set aside, on any ground other than fraud, a sale for the recovery of\nan arrear of land-revenue or any sum recoverable as an arrear of land-revenue ;\n(xvii) the amount of, or the liability of any person to pay, any cess, fees, fines, costs\nor other charge imposed under this Act;\n(xviii) any claim for partition of an estate or holding, or any question connected with\nor arising out of, proceedings for partition, not being a question as to title in any\nof the property of which partition is sought;\n(xix)    any question as to the allotment of land on the partition of an estate or holding,\nor as to the distribution of land subject by established custom to periodical re-\ndistribution or as to the distribution of land-revenue on the partition of an estate\nor holding or on a periodical re-distribution of land;\n(xx)     any question connected with or arising out of or relating to any proceedings for\nprovisions of this Act;\n(xxi)    any claim regarding boundaries fixed under any of the enactments hereby\nrepealed or any other law for the time being in force, or to set aside any order\npassed by a competent officer under any such law with regard to boundary\nmarks."
    },
    {
      "provision_ref": "sec173",
      "section": "173",
      "title": "Section 173. Powers to invest officers making records",
      "content": "of-rights or general re-assessments with\npowers of Civil Courts. (1) The Board of Revenue may, by notification, invest any Revenue Officer\nmaking or specially revising records-of-rights in any local area in pursuance of a notification under\nsection 40, or making a general re-assessment of land-revenue in any local area in pursuance of a\nnotification under section 59, or any Revenue Officer in a Colony as defined in the Colonization of\nGovernment Lands (Punjab) Act, 1912 (Punjab Act V of 1912), or any Revenue Officer to whose\ncontrol that Officer is subject with all or any of the powers of any Court, constituted under the West\nPakistan Civil Courts Ordinance, 1962 (West Pakistan Ordinance II of 1962), for the purpose of trying\nall or any specified class of suits or appeals relating to land arising in the local area.\n(2) The Board of Revenue may cancel an order notified under sub-section (l) wholly or in part.\n(3) While an order or any part of an order under sub-section (1) continues in force, the powers\nconferred thereby shall be exercised by the officer invested therewith and not otherwise.\n(4) Any case pending before an officer under the order or subsisting part of the order at the\ntime of cancellation thereof may be disposed of by him as if the order or that part of it continued in\nforce, unless the Board of Revenue directs, as it is hereby empowored to do, that those cases shall be\ntransferred for disposal to the Courts by which they would have been disposed of if the order had not\nbeen notified."
    },
    {
      "provision_ref": "sec174",
      "section": "174",
      "title": "Section 174. Control over such officer and appeals from and revision of their decrees and orders",
      "content": "(1) The Board of Revenue may by notification direct that the provisions of this Act with respect to the\nsuperintendence and control over Revenue Officers shall apply to any Revenue Officer who has been\ninvested with the powers of a Civil Court of any of the classes specified in the West Pakistan Civil\nCourts Ordinance, 1962 (West Pakistan Ordinance II of 1962), and that appeal shall lie from his\ndecrees and orders to, and his decrees and orders be subject to revision by, a Revenue Officer invested\nunder section 173 with the powers of a Court which would be competent under that Ordinance to hear\nappeals from or revise such decrees and orders if they had been made by a Court with the powers of\nwhich the Revenue Officer who made them has been invested.\n(2) In the absence of any such notification, a Revenue Officer invested under section 173 with\nthe powers of any such Civil Court as aforesaid shall, with respect to the exercise of those powers, be\ndeemed to be such a Civil Court for the purposes of the aforesaid Ordinance.\nGeneral"
    },
    {
      "provision_ref": "sec175",
      "section": "175",
      "title": "Section 175. Prevention of encroachment upon common lands. 1[(l) Where land which has been",
      "content": "reserved for the common purposes of the persons residing in the estate in which such land is situate\nhas been encroached upon by any person, and the land has been shown in the last three periodical\nrecords made before such encroachment as so reserved, a Revenue Officer may, on the application of\na land-owner in the estate, and after giving an opportunity to the person alleged to have encroached\nupon it to appear before him and show cause against the proposed action—\n(a)        eject from the land the person who has encroached thereupon; and\n(b)        by order proclaimed in the manner provided in section 26, forbid repetition of\nthe encroachment.\nExplanation—An edition of the record-of-rights made before the coming into force of this Act,\nunder the provisions of section 33 of the Punjab Land Revenue Act, 1887, or\nunder the provisions of any other law repealed by this Act, shall be deemed to\nbe a periodical report for the purposes of this section.]\n(2) The proceedings of the Revenue Officer under sub-section (1) shall be subject to any decree\nor order which may be subsequently passed by any Court of competent jurisdiction."
    },
    {
      "provision_ref": "sec176",
      "section": "176",
      "title": "Section 176. Papers kept by Village Officers to be deemed public documents. (1) Any record or",
      "content": "paper which a Village Officer is required by law, or by any rule made under this Act, to prepare or\nkeep shall be deemed to be the property of Government.\n(2) A Village Officer shall, with respect to any record or paper in his custody be deemed, for\npublic document which any person has a right to inspect."
    },
    {
      "provision_ref": "sec177",
      "section": "177",
      "title": "Section 177. Maps and land record open to inspection, etc. Subject to such rules and the payment of",
      "content": "such fees as the Board of Revenue may from time to time prescribe in this behalf, all maps and land-\nrecords prepared or required to be made under this Act shall be open to the inspection of the public at\n1\nSubs. by West Pakistan Ordinance No. X of 1970, s. 3.\nreasonable hours, and certified extracts from the same or certified copies thereof shall be given to all\npersons applying for the same."
    },
    {
      "provision_ref": "sec178",
      "section": "178",
      "title": "Section 178. Restriction on Revenue Officers bidding at auctions or engaging in trade. (1) A",
      "content": "Revenue Officer, or a person employed in a Revenue Office, shall not—\n(a)     purchase or bid for, either in person or by agent, in his own name or in that of\nanother or jointly or in shares with others, any property which any Revenue\nOfficer or Revenue Court in the District in which he is employed has ordered to\nbe sold, or\n(b)    in contravention of any rule made by Government in this behalf, engage in trade\nin that District.\n(2) Nothing in sub-section (1) shall be deemed to preclude any person from becoming a share-\nholder in a company incorporated under the Companies Act, 1913 (Act VII of 1913), or under any\nother law for the time being in force relating to a body or bodies corporate.\n_____"
    },
    {
      "provision_ref": "sec179",
      "section": "179",
      "title": "Section 179. Effect of finality of orders. Wherever in this Act it is provided that a decision or order",
      "content": "shall be final, it shall be deemed to mean that no appeal lies from decision or order ; but nothing herein\nshall be construed as precluding the Board of Revenue from modifying, reversing or setting aside any\nsuch decision or order under the provisions of section 164."
    },
    {
      "provision_ref": "sec180",
      "section": "180",
      "title": "Section 180. Restriction on appointment of lambardars. Notwithstanding anything contained in this",
      "content": "Act, headman (Lambardars) shall not be appointed in, nor shall rules for their appointment be enforced\nin or made applicable to, any area or part of the Province where the law in force immediately before"
    },
    {
      "provision_ref": "sec181",
      "section": "181",
      "title": "Section 181. Bar on legal proceedings against Revenue officer. No suit, prosecution or other legal",
      "content": "proceeding shall lie against a Revenue Officer for anything done or ordered to be done in good faith\nby him as such in pursuance of the provisions of this Act, or of any other law for the time being in\nforce."
    },
    {
      "provision_ref": "sec182",
      "section": "182",
      "title": "Section 182. Power to make rules. The Board of Revenue, with the previous approval of Government,",
      "content": "may, in addition to the other rules which may be made by it under this Act, make rules not inconsistent\nwith this Act,—\n(a)     fixing the number and amount of the installments and the times and places and\nthe manner, by, at and in which any sum other than rent or land-revenue which\nis payable under this Act or of which a record has been made thereunder is to\nbe paid ;\n(b)     fixing the dates on which profits are to be divisible by headman or other persons\nby whom they are realized on behalf of co-sharers ;\n(c)     prescribing the fees to be charged for the service and execution of processes\nissued by Revenue Officers and Revenue Courts, the mode in which those fees\nare to be collected, the number of persons to be employed in the service and\nexecution of those processes, and the remuneration and duties of those persons ;\n(d)     regulating the procedure in case where persons are entitled to inspect records of\nRevenue Officers or records or papers in the custody of Village Officers, or to\nobtain copies of the same, and prescribing the fees payable for searches and\ncopies ;\n(e)     prescribing forms for such books, entries, statistics and accounts as the Board\nof Revenue thinks necessary to be kept, made or compiled in Revenue Offices\nor submitted to any authority ; and\n(f)     generally for carrying out the purpose of this Act."
    },
    {
      "provision_ref": "sec183",
      "section": "183",
      "title": "Section 183. Rules to be made after previous publication. The power to make any rules under this",
      "content": "Act is subject to the condition of the rules being made after previous publication."
    },
    {
      "provision_ref": "sec184",
      "section": "184",
      "title": "Section 184. Repeals and Savings. (1) The enactments mentioned in Part One of the Schedule are",
      "content": "hereby repealed.\n(2) On the commencement of this Act in any area the enactments mentioned in Part Two of the\nSchedule shall, if and, in so far as applicable to that area, stand repealed; and in the event of specified\nprovisions of this Act being applied to any area, only the corresponding provisions in such enactments\nshall stand repealed.\n(3) Notwithstanding the repeal of the enactments mentioned in sub-section (2) —\n(a)     all rules, appointments and transfers made, notifications and proclamations\nissued, authorities and powers conferred, farms and leases granted, records-of-\nrights and other records framed, revised or confirmed, rights acquired, liabilities\nincurred, times and places appointed, and other things done, under any such\nenactment shall, if not inconsistent with the provisions of this Act, be continued\nand, so far as may be, be deemed to have been respectively made, issued,\nconferred, granted, incurred, appointed and done under this Act ; and\n(a)     all assessments of land-revenue duly made, approved or confirmed under any\nsuch enactment and in force immediately before such repeal shall continue, and\nsubject to the provisions of this Act, remain in force until assessments made,\napproved or confirmed under those provisions take effect.\n(4) Notwithstanding anything to the contrary contained elsewhere in this Act, or in any other\nlaw, or in any order or decree of a Court or other authority, or in any rule of custom or usage, or in any\ncontract, instrument, deed or other document, any person who, immediately before the commencement\nof this Act, was the holder of any land under the provisions of the Bombay Land Revenue Code, 1879\n(Bom. Act V of 1879), or the Sind Land Revenue Code, 1879 (Sind Act V of 1879), as the case may\nbe (hereinafter in this sub-section referred to as the Code), shall—\n(a)     if such land (whether alienated or unalienated) was shown on the thirty-first day\nof December, 1927, in the Record-of-Rights prepared under the provisions of\nthe Code to have been in the possession of an occupant, other than a lessee or a\nmortgagee-in-possession, or if any person was shown to have proprietary rights\ntherein, be deemed to be the owner of such land for the purposes of this Act;\n(b)    if such land was granted by Government to any person on or after the first day\nof January, 1928, otherwise than on lease—\n(i)     be deemed, if he has paid the full price on which the land was granted\nto him, the owner of such land, and be subject to all the rights and\nliabilities of a proprietor under the Colonization of Government Lands\n(Punjab) Act, 1912 (Punjab Act V of 1912); and\n(ii)    be deemed, if he has not paid the full price on which the land was granted\nto him, a tenant of Government under the Colonization of Government\nLands (Punjab) Act, 1912 (Punjab Act V of 1912), on the conditions on\nwhich the grant was made; provided that on such person paying the full\nprice on which the land was granted to him in accordance with the\nconditions of, and within the period provided in the grant, the provisions\nof sub-clause (i) shall apply.\nExplanation—For the purposes of this sub-section the terms “occupant” and “holder of land”\nshall have the meaning respectively assigned to them in the Code, and shall include their predecessors\nand successors-in-interest.\n(5) Government may make rules for giving effect to the provisions of sub-section (4).\n(See section 184)"
    }
  ],
  "definitions": []
}
