{
  "id": "pk-west-pakistan-maintenance-of-public-order-ordinance-1960",
  "type": "statute",
  "title": "West Pakistan Maintenance of Public Order Ordinance, 1960",
  "title_en": "West Pakistan Maintenance of Public Order Ordinance, 1960",
  "short_name": "WPMOP",
  "status": "in_force",
  "issued_date": "1960-12-01",
  "in_force_date": "1960-12-01",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5prZw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Maintenance of Public Order Ordinance, 1960 (XXXI of 1960) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Powers of photographing, etc., of suspected persons. (1) Government or other authority",
      "content": "making an arrest or directing the arrest of a person under section 3 may by order direct that the arrested\nperson shall—\n(a) let himself be photographed ;\n(b) allow his finger and thumb-impressions to be taken ; and\n(c) furnish specimens of his handwriting and signature.\n(2) If any person contravenes any order made under this section, he shall be punished with\nimprisonment for a term which may extend to six months or with fine or with both."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power to control suspected persons. (1) Government or the District Magistrate, if satisfied",
      "content": "with respect to any particular person that with a view to preventing him from acting in any manner\nprejudicial to public safety 1[, or public interest] or the maintenance of public order, it is necessary so\nto do, may by order in writing, give any one or more of the following directions, namely, that such\nperson—\n(a)       shall not enter, reside or remain in any area that may be specified in the order ;\n(b)       shall reside or remain in any area that may be specified in the order ;\n(c)       shall remove himself from, and shall not return to, any area that may be specified\nin the order ;\n1\n[(d) shall conduct himself in such manner or abstain from such acts, as may be\nspecified in the order ; and]\n(e)     shall enter into a bond, with or without sureties for the due observance of the\ndirections specified in the order.\n(2) An order under sub-section (1) made by the District Magistrate shall not, unless\nGovernment by special order otherwise directs, remain in force for more than three months from the\nmaking thereof.\n(3) Government may at any time cancel or vary any order made by the District Magistrate under\nsub-section (1).\n1\nIns., and subs by the West Pakistan Ordinance No. XVIII of 1964, s. 4.\n(4) An order under clause (a) of sub-section (1) made by Government may specify as the area to\nwhich the order relates, the whole Province or any part thereof, and an order made by the District\nMagistrate may specify as such area the whole district or any part thereof :\nProvided that no such order made by Government shall direct the exclusion or removal from the\nProvince of any person ordinarily resident in the Province and no such order made by the District\nMagistrate shall direct the exclusion or removal from the district of any person ordinarily resident in\nthat district.\n(5) Where an order has been made under sub-section (1), the authority making the order shall, as\nsoon as may be 1[* * * * * * *] communicate to such person the grounds on which the order has been\nmade, inform him that he is at liberty to make a representation to Government against the order and\nafford him the earliest opportunity of doing so :\nProvided that the authority making any such order may refuse to disclose facts which such\nauthority considers it to be against public interest to disclose.\n1\n[(5)-a) Where a representation is made to Government against an order passed under sub-section\n(1), Government may, on consideration of the representation and after giving the person affected an\nopportunity of being heard, modify, confirm or rescind the order.\n(5-b) No order under clause (b) of sub-section (1) shall have effect for a period exceeding three\nmonths unless the Board constituted under sub-section (5) of section 3 has reported, before the\nexpiration of the said period, that there is, in its opinion, sufficient cause for the making of such order;\nand the provisions of sub-sections (5-b), (5-c), (5-d), (5-e) and (5-f) of section 3 shall, mutatis\nmutandis, apply to the reference made to the Board in regard to any such order.]\n(6) An order made under sub-section (1) shall remain inforce for such period not exceeding two\nyears as may be specified in the order."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to control publications. (1) Government or any authority authorized by it in this",
      "content": "behalf, if satisfied that such action is necessary for the purpose of preventing or combating any activity\nprejudicial to the maintenance of public order, may, by order in writing addressed to a printer, publisher\nor editor—\n(a)         prohibit the printing or publication in any document or class of documents of\nany matter relating to a particular subject or class of subjects for a specified\nperiod, or in a particular issue or issues of a newspaper or periodical ;\n(b)         require that any matter be published in any particular issue or issues of a\nnewspaper or periodical, and may while doing so specify the period during\nwhich and the manner in which such publication shall take place ;\n(c)       require that any matter relating to a particular subject or class of subjects shall\nbefore publication be submitted for scrutiny ;\n1\nOmitted and ins. by West Pakistan Ordinance No. XVIII of 1964, s. 4.\n(d)           prohibit for a specified period the publication of any newspaper, periodical,\nleaflet, or other publication, or the use of any press ;\n(e)          require that the name and address of any person concerned in the supply or\ncommunication of any news, report or information be furnished to such\nauthority as may be specified in the order ;\n(f)         require that any document connected with the news, report or information\nreferred to in clause (e) be delivered to such authority as may be specified in\nthe order :\nProvided that when an order is made under clause (a), (c) or (d)—\n(i)       no such order shall remain in force for more than two months from the making\nthereof;\n1\n(ii)        [* * * * * * *]\n(2) Where an order has been made under sub-section (1), the authority making the order shall,\nas soon as may be, communicate to such person the grounds on which the order has been made, inform\nhim that he is at liberty to make a representation against the order to Government and afford him the\nearliest opportunity of doing so:\nProvided that the authority making any such order may refuse to disclose facts which such\nauthority considers it to be against public interest to disclose.\n1\n[(2-a) Where a representation is made to Government against an order passed under sub-section\n(1), Government may on consideration of the representation and giving the person affected an\nopportunity of being heard, modify, confirm or rescind the order.]\n(3) In the event of disobedience of an order under this section Government or the authority\nissuing the order may, without prejudice to any other penalty to which the person guilty of the\ndisobedience is liable, order the seizure of all copies of any publication concerned and of any printing\npress or other instrument or apparatus used in the production of the publication 1[:]\n1\n[Provided that no such order of seizure shall be passed without giving the printer, publisher or\neditor affected an opportunity of showing cause against the proposed order.]"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power to prohibit entry into West Pakistan of newspapers, etc. (1) Government or any",
      "content": "authority authorized by it in this behalf, if satisfied that such action is necessary for the purpose of\npreventing or combating any activity pre-judicial to the maintenance of public order, may, by\nnotification, prohibit for a specified period the bringing into West Pakistan or any part thereof of any\nnewspaper, periodical, leaflet or other publication :\n1\nOmitted, ins, replaced and added by the West Pakistan Ordinance No. XVIII of 1964, s. 5.\nProvided that no such order shall remain in force for more than two months from the making\nthereof:\nProvided further that the person against whom an order has been made may within ten days of\nthe passing of the order make a representation to Government or the authority aforesaid which may on\nconsideration thereof modify, confirm or rescind the order.\n(2) In the event of disobedience of an order under this section, Government or the authority\nissuing the order may, without prejudice to any other penalty to which the person guilty of the\ndisobedience is liable, order the seizure of all copies of any newspaper, periodical, leaflet or other\npublication concerned 1[:]\n1\n[Provided that no such order of seizure shall be passed without giving the person affected an\nopportunity of showing cause against the order.]"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Power to secure reports of public meetings. (1) The District Magistrate may, by order in",
      "content": "writing depute one or more Police Officers not below the rank of head constable, or other persons to\nattend any public meeting for the purpose of causing a report to be made of the proceedings.\n(2) Any such order shall operate as a direction to the persons responsible for the convening or the\nconduct of the meeting to admit free of charge the persons so deputed.\nExplanation—For the purpose of this section a public meeting is any meeting which is open to\nthe public or to any class or portion of the public, and a meeting may be a public meeting\nnotwithstanding that it is held in a private place and notwithstanding that admission thereto is restricted\nby ticket or otherwise."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Service of orders in writing. (1) Where under the provisions of this Ordinance any power is",
      "content": "to be exercised or any order or direction given by order in writing, then that order in writing—\n(a)        if it is an order addressed to any servant of Government or authorising any\nservant of Government to take any action, shall be given in original or by a copy\nto the servant of Government concerned and shall be his authority for the doing\nof all things which he is required or enabled to do under the order ;\n(b)        if it is an order made in respect of or addressed to any person not being a servant\nof Pakistan, may be served in original or by a copy of the order on the person in\nrespect of whom it is made or to whom it is addressed in the manner provided\nin the Code for the service of a summons ;\n(c)        if it is an order addressed to the public generally, may be served by publication\nin such manner as the authority making the order considers best adapted for\ninforming the persons concerned.\n1\nReplaced and added by the West Pakistan Ordinance No. XVIII of 1964, s. 6.\n(2) Any person on whom an order is served as provided in clause (b) or clause (c) of sub-section\n(1) shall be deemed to have had notice of such order, and where the person to be served is a corporation,\ncompany, bank or association of persons the order may be served on any secretary, director or other\nofficer or person concerned with the management thereof, or by leaving it at, or sending it addressed\nto the corporation, company, bank or association by post to, its registered office, or where there is no\nregistered office, at or to the place where it carries on business.\n(3) Where a provision of this Ordinance empowers an authority, officer or person to take action\nby notified order, the provisions of sub-sections (1) and (2) shall not apply in relation to such order,\nand all persons whom the order concerns shall, upon its notification, be deemed to have been duly\ninformed of it."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Power to issue search warrants. The power to issue search warrants conferred by section",
      "content": "98 of the Code shall be deemed to include the power to issue warrants for—\n(a)     the search of any place in which any magistrate mentioned in that section has\nreason to believe that any offence under this Ordinance or any act prejudicial to\npublic safety or the maintenance of public order has been, is being or is about\nto be committed, or that preparation for the commission of any such offence or\nact is being made ;\n(b)     the seizure in or on any place searched under clause (a) of anything which the\nofficer executing the warrant has reason to believe is being used or is intended\nto be used for any purpose mentioned in that clause ;\nand the provisions of the Code shall, so far as may be, apply to searches, made under the authority of\nany warrant issued and to the disposal of any property seized under this section."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. General power of search. Any authority on which any power is conferred by or under this",
      "content": "Ordinance may by general or special order authorise any person to enter and search any place the\nsearch of which such authority has reason to believe to be necessary for the purpose of—\n(a)   ascertaining whether it is necessary or expedient to exercise such power ; or\n(b)   ascertaining whether any order given, direction made, or condition prescribed in\nthe exercise of such power has been duly complied with ; or\n(c)   generally giving effect to such power or securing compliance with or giving effect\nto any order given, direction made or conditions prescribed in the exercise of such\npower."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to give effect to orders, etc. (1) Any authority, officer or person who is empowered",
      "content": "by or in pursuance of this Ordinance to make any order, or to exercise any other power may, in addition\nto any other action prescribed by or under this Ordinance, take, or cause to be taken, such steps and\nuse, or cause to be used, such force as may, in the opinion of such authority, officer or person, be\nreasonably necessary for securing compliance with, or for preventing or rectifying any contravention\nof, such order, or for the effective exercise of such power.\n(2) Where in respect of any of the provisions of this Ordinance there is no authority, officer or\nperson empowered, to take action prescribed by or under this Ordinance, Government may take or\ncause to be taken such steps and use, or cause to be used, such force as may in the opinion of\nGovernment be reasonably necessary for securing compliance with or for preventing or rectifying any\nbreach of such provision.\n(3) The power to take steps under sub-section (1) or sub-section (2) includes the power to enter\nupon any land or other property whatsoever."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Penalty. Whoever contravenes any provision of this Ordinance or disobeys or neglects to",
      "content": "comply with any order made or direction given in accordance with its provisions shall, where no\nexpress provision is made by this Ordinance for the punishment of such contravention, disobedience,\nor negligence, be punished with imprisonment which may extend to three years, or with fine, or with\nboth."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Abetment of offences. Whoever abets the commission of an offence punishable under this",
      "content": "Ordinance shall, whether the act abetted is or is not committed in consequence of the abetment, be\npunished with the punishment provided for the offence."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Offence committed by corporation or association. Where the person committing an offence",
      "content": "punishable under this Ordinance is a corporation, company, bank or association of persons, any\nsecretary, director or other officer or person concerned with the management thereof shall be punished\nwith the punishment provided for the offence unless he proves that the offence was committed without\nhis knowledge or consent."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Dissemination of rumours, etc. Whoever",
      "content": "(a)   makes any speech, or\n(b)   by words whether spoken or written or by signs or by visible or audible\nrepresentations or otherwise publishes any statement, rumour or report,\nShall be punished with imprisonment which may extend to three years, or with fine, or with both if such\nspeech, statement, rumour, or report—\n(i)   causes or is likely to cause fear or alarm to the public or to any section of the\npublic ;\n(ii)   furthers or is likely to further any activity prejudicial to public safety or the\nmaintenance of public order."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Possession or conveyance of prescribed or prohibited documents. (1) Whoever, without",
      "content": "lawful authority—\n(a)   has in his possession, or on premises in his occupation or under his control, or\n(b)   carries for delivery to another person otherwise than through the post,\nany document in respect of which a notification under section 7 is in force, or of which the importation\nhas been prohibited under the Sea Customs Act, 1878 (VIII of 1878), or in respect of which an order\nof forfeiture has been made under any law for the time being in force or any document prejudicial to\npublic safety or the maintenance of public order shall, unless he proves that he was unaware of the\nnature of the document, be punished with imprisonment which may extend to one year, or with fine,\nor with both.\n(2) Whoever allows his name or address to be used to facilitate transmission through the post or\notherwise to any person other than the person for whom it purports to be intended of any document of\nthe nature referred to in sub-section (1) shall be punished with imprisonment which may extend to one\nyear, or with fine, or with both."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Wearing or display of uniforms or emblems. Whoever makes or has in his possession or",
      "content": "wears, carries or displays any uniform, flag, banner or emblem signifying, or which has been declared\nby Government by notification to signify association with a movement prejudicial to public safety or\nthe maintenance of public order shall be punished with imprisonment which may extend to one year,\nor with fine, or with both, and any such uniform, flag, banner or emblem wherever found shall be\nforfeited to Government."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Tampering with public servants. Whoever induces or attempts to induce any public servant",
      "content": "or any servant of local authority to disregard or fail in his duties as such servant shall be punished with\nimprisonment which may extend to one year, or with fine, or with both."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Sabotage. (1) No person shall do any act with intent to impair the efficiency or impede the",
      "content": "working of or to cause damage to—\n(a)    any building, vehicle, machinery, apparatus or other property used, or intended\nto be used, for the purposes of Government or any local authority ;\n(b)    any railway (as defined in the Railways Act, 1890 (Act X of 1890), tramway,\nroad, canal, bridge, culvert, causeway, aerodrome or any telegraph, telegraph line\nor post (as defined in the Telegraph Act, 1885 (Act XIII of 1885) ;\n(c) any rolling-stock of a railway or tramway, or any aircraft ;\n(d)    any building or other property used in connection with the production, distribution\nor supply of any essential commodity, any sewage works, mine or factory.\n(2) The provisions of sub-section (1) shall apply in relation to any omission on the part of a person\nto do anything which he is under a duty, either to Government or to any public authority or to any\nperson, to do, as they apply to the doing of any act by a person.\n(3) If any person approaches or is in the neighbourhood of any such building, place or property as\nis mentioned in sub-section (1) in circumstances which afford reason to believe that he intends to\ncontravene that sub-section, he shall be deemed to have attempted a contravention thereof.\n(4) If any person contravenes or attempts to contravene any of the provisions of this section, he\nshall be punished with imprisonment for a term which may extend to three years, or with fine, or with\nboth.\n1\n[20-A. Representation against certain orders. (1) Where a representation is received under\nsub-section (5) of section 5 against an order under clause (a), clause (c), clause (d) or clause (e) of sub-\nsection (1) of section 5, Government shall, if the order represented against is not rescinded or cancelled\nand the order is to have effect for a period exceeding three months, forward the case, including the\nrepresentation, to the Board constituted under sub-section (5) of section 3.\n(2) Where a representation is made to Government under the provisions of sub-section (3) of\nsection 6 or sub-section (2) of section 7, Government shall, be as soon as may be, forward the case,\nincluding the representation, to the Board constituted under sub-section (5) of section 3.\n(3) The Board shall, after considering the representation and such further information or material\nas may be placed before it by Government or the person making the representation, and giving such\nperson an opportunity of being heard, submit its report together with its recommendations to\nGovernment.\n(4) If the Board reports that the order against which the representation is made is unjustified, the\nGovernment shall vacate the order.]"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Procedure for trial of offences. (1) In any area, the Government may by notification direct",
      "content": "that all the offences under this Ordinance, shall, notwithstanding anything in the Code, be tried in\naccordance with the procedure prescribed for the trial of summons cases by Chapter XX of the Code,\nsubject in the case of summary trials to the provisions of sections 263 to 265 of the Code.\n(2) The provisions of sub-section (1) shall apply to the trial of offences mentioned therein\ncommitted before the notification aforesaid."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Offence under Ordinance to be cognizable and non",
      "content": "bailable. Notwithstanding anything\ncontained in the Code every offence punishable under this Ordinance shall be cognizable and non-\nbailable."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Jurisdiction barred. Except as provided in this Ordinance no proceeding or order taken or",
      "content": "made under this Ordinance shall be called in question in any court and no civil or criminal proceeding\nshall be instituted against any person for anything in good faith done or intended to be done under this\nOrdinance."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Effect of orders, etc., inconsistent with other enactments. Any order made, and any other",
      "content": "action taken, under this Ordinance shall have effect notwithstanding anything inconsistent therewith\ncontained in any enactment other than this Ordinance or in any instrument having effect by virtue of\nany enactment other than this Ordinance."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Operation of other penal laws not barred. Nothing contained in this Ordinance shall be",
      "content": "deemed to prevent any person from being prosecuted under any other law for any act or omission\nwhich constitutes an offence punishable under this Ordinance."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Delegation of power to Deputy Commissioners. Government may, by order in writing, direct",
      "content": "that the power under sub-section (1) of section 3 shall, subject to such restrictions as may be specified,\nbe exercisable by any District Magistrate within his jurisdiction.\nI\nIns. by the West Pakistan Ordinance No. XVIII of 1964, s. 7."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Power to make rules. Government may make rules not inconsistent with the provisions of",
      "content": "this Ordinance, to carry into effect the purpose thereof."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Repeal and saving. (1) (a) Sections 3, 4, 6, 7, 12, 17, 21, 22, 28, 29, and 30 of the Baluchistan",
      "content": "Public Safety Regulation, 1947, and sections 3, 4, 6, 7, 12, 17, 21, 22, 28, 29 and 30 of the Baluchistan\nStates Union Public Safety Regulation are hereby repealed.\n(b) The following Acts are hereby repealed :—\n(i)     the Bahawalpur State Public Security Act, 1944,\n(ii)       the North-West Frontier Province Public Safety Act, 1948 (N. W. F. P.\nIII of 1948),\n(iii)      the Punjab Public Safety Act, 1949 (Punjab XVIII of 1949), 1[*]\n(iv)       the Khairpur Pubic Order and Detention Khairpur Act, 1954 (Khairpur\nXI of 1954) 1[,and]\n1\n[(v)    the Sind State Prisoners Regulation, 1827 (Sind Regulation XXV of\n1827).]\n(2) All such orders (whether notified or not) made and directions issued under the enactments\nrepealed under sub-section (1) as were in force immediately before the commencement of this\nOrdinance shall, so far as they are not inconsistent with the provisions of this Ordinance continue in\nforce and shall be deemed to have been made and issued under this Ordinance.\n________\n156022                                                                                           Date: 08-01-2025\n1\nOmitted, replaced and added by the West Pakistan Ordinance No. IX of 1963, s. 2."
    }
  ],
  "definitions": []
}
