{
  "id": "pk-west-pakistan-motor-vehicles-taxation-act-1958",
  "type": "statute",
  "title": "West Pakistan Motor Vehicles Taxation Act, 1958",
  "title_en": "West Pakistan Motor Vehicles Taxation Act, 1958",
  "short_name": "WPMVT",
  "status": "in_force",
  "issued_date": "1958-04-18",
  "in_force_date": "1958-04-18",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tlaQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Motor Vehicles Taxation Act, 1958 (XXXII of 1958) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent commencement. (l) This Act may be called the West Pakistan Motor",
      "content": "Vehicles Taxation Act, 1958.\n1\n[(2) It extends to the whole of the Province of West Pakistan except the Tribal Areas.]\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context",
      "content": "(a)        “Government” means the Government of West Pakistan;\n(b)        “Licensing officer” means an officer appointed by the Government to perform\nthe duties and exercise the powers imposed or conferred upon a licensing officer\nunder this Act;\n(c)        “motor vehicle” includes a vehicle, carriage or other means of conveyance\npropelled, or which may be propelled, on a road by electrical or mechanical\npower either entirely or partially;\n(d)        “prescribed” means prescribed by rules made under this Act;\n(e)        “tax” means the tax imposed under this Act;\n(f)        “token” means a ticket to be displayed on a motor vehicle as an indication that\nthe tax leviable thereon has been duly paid or that no tax is payable;\n(g)        “Director” means the officer appointed by the Government as the head of the\nTaxation Department; and\n(h)        “Deputy Director” means an officer appointed by the Government as Deputy\nDirector of the Taxation Department, and includes an officer appointed by the\nGovernment to perform the duties of Deputy Director under this Act.\n1\nSubs. by West Pakistan Act No. XX of 1964, s. 6."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Imposition of tax. (l) A tax shall be leviable on every motor vehicle, in equal instalments",
      "content": "for quarterly periods, commencing on the first day of 1[July], the first day of 1[October], the first day\nof 1[January] and the first day of 1[April], at the rate specified in the Schedule to this Act:\n2\n[Provided that for reasons specified therein the Government may, by notification, in respect\nof any class of motor vehicles or motor vehicles plying in any specified area or along any specified\nroute, prescribe a rate lower than the rate mentioned in the Schedule.]\nProvided further that any broken period in such quarterly periods shall, for the purpose of\nlevying the tax be considered as full period.\n(2) The tax shall be paid upon a licence to be taken out and paid for under the provisions of\nthis Act by the person who keeps the motor vehicle for use."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Obligation of persons keeping motor vehicles to make declaration and to pay tax. (1)",
      "content": "Every person who keeps a motor vehicle for use shall fill up and sign a declaration in the prescribed\nform, stating the prescribed particulars, and shall deliver the declaration as filled up and signed by\nhim to the licensing officer before the expiry of twenty-one days from the day of his commencing to\nkeep the motor vehicle for use. Any such or similar declaration filled up, signed and delivered under\nany of the enactments mentioned in sub-section (1) of section 17 of this Act, shall be deemed to have\nbeen filled up, signed and delivered under this section.\n1\n[(2) The tax to which he appears by such declaration to be liable shall be paid by the person\nkeeping the motor vehicle, if for the first quarterly period, before the 31st day of July if for the second\nquarterly period, before the 31st day of October, if for the third quarterly period, before the 31st day\nof January and if for the fourth quarterly period, before the 30th day of April:]\nProvided that if such person commences to keep the motor vehicle for use after the\ncommencement of this Act he shall pay the first instalment due before the expiration of twenty-one\ndays from the day of his commencing to keep the motor vehicle for use.\n(3) Every person who owns any motor vehicle which is left for hire, shall, for the purposes of\nthis Act, be the person who keeps the motor vehicle for use."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Obligation to make additional declaration and to pay further tax. Whenever any person,",
      "content": "who has delivered a declaration under the preceding section becomes liable to an additional tax by\nreason of his keeping a greater number of motor vehicles for use than he has stated in the declaration,\nor by reason of any change in the character of any motor vehicle kept by him for use, he shall fill up\nand sign an additional declaration specifying with reference to such liability the particulars required\nby the preceding section. Such person shall deliver the additional declaration so filled up and signed\nand pay such additional tax as by the last mentioned declaration appears to be payable by him to the\nlicensing officer before the expiration of twenty-one days from the day of his becoming so liable as\naforesaid:\nProvided that when payment is made of additional tax by reason of any change in the character\nof any motor vehicle, an allowance shall be made for the tax already paid.\n1\nSubs. by West Pakistan Ordinance No. VI of 1961, ss. 2-3.\n2\nSubs. by West Pakistan Ordinance No. LVII of 1959, s. 2."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Service of special notice to make declaration and to pay tax. The licensing officer may",
      "content": "direct a special notice to be served upon any person requiring such person to fill up, sign and deliver\nto the officer named in such notice, a form of declaration, to be left with such notice, stating whether\nsuch person is or is not liable to the payment of any tax and to pay the tax to which he appears by such\ndeclaration to be liable to the person named therein before the expiration of fourteen days from the\ndate of the service of such special notice."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Grants of license Every licensing officer shall grant and deliver to every person who pays",
      "content": "to him the first instalment of tax due, a licence in which shall be specified the particulars of the tax\npaid, with any other particulars that may be prescribed. The licence shall be dated on the day of\ngranting the same and shall expire on the 1[30th day of June] next following."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Penalty for omission to comply with the provisions of section 4. (l) If a person",
      "content": "(a)        fails to deliver a declaration in accordance with the provisions of this Act; or\n(b)        delivers a declaration wherein the particulars prescribed to be therein set forth\nare not fully and truly stated,\nthe licensing officer may, after making such enquiry as he deems fit and after hearing the person if he\ndesires to be heard, impose on such person any tax or additional tax for such quarterly period or periods\nas the licensing officer may find that such person is liable to pay under the provisions of this Act, and\nmay also impose a penalty which may extend to twice the amount of the tax to which he is found liable.\n(2) The tax or additional tax imposed shall be payable before the expiry of fourteen days from\nthe date of order of the licensing officer."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Penalty for keeping a motor vehicle without a license or failure to pay tax. Whoever",
      "content": "(a)        keeps a motor vehicle for use without having a proper licence; or\n(b)        neglects or refuses to pay any amount of tax to which he is liable within the\nperiod fixed for such payment,\nshall be liable to pay, in addition to any arrear of tax that may be due from him, a penalty which may\nextend to an amount 2[equal to twice the amount of the tax] to which he is liable."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Recovery of a tax or additional tax imposed under section 8 or section 9. Any tax or",
      "content": "additional tax or penalty imposed under the provisions of section 8 or section 9 may be recovered in\nthe manner provided in section 11 for the recovery of an arrear of tax."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Recovery of arrear of tax. (1) If any tax payable under this Act is not paid within the fixed",
      "content": "period, and the defaulter does not show cause to the satisfaction of the Deputy Director or any officer\nauthorised by him in this behalf, for his failing to do so, such tax (including the cost of recovery\nthereof) may be recovered under a warrant in the prescribed form signed by the Deputy Director, by\ndistress and sale of movable property belonging to such person. The warrant may be addressed to an\nofficer of the Excise and Taxation Department for execution, who may obtain such assistance from\nother Government servants of the said Department as he may consider necessary for the execution\nthereof.\n1\nSubs. by West Pakistan Ordinance No. VI of 1961, s. 4.\n2\nSubs. by West Pakistan Ordinance No. XIX of 1966, s. 2.\n(2) Notwithstanding anything in sub-section (1), any tax, additional tax or penalty under this\nAct remaining unpaid may be recovered as arrears of land revenue."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Appeals. (1) Any person aggrieved by an order relating to the assessment, imposition or",
      "content": "recovery of tax or penalty may, within a period of thirty days from the date of such order, appeal from\nsuch order to the Deputy Director.\n(2) The Director may either of his own accord or on receiving a petition from the aggrieved\nparty, at any time revise an appellate order passed by the Deputy Director under sub-section (1) 1[:]\n1\n[Provided that no order shall be made by the Director under this sub-section without giving\nthe aggrieved party an opportunity of being heard.]\n(3) Subject to the order, if any, passed on revision by the Director under sub-section (2) the\norder of the Deputy Director passed under sub-section (1) or that of the licensing officer, if not appealed\nagainst, shall be final and shall not be called in question in any proceedings whatsoever."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Exemptions and deductions. (1) The Government may by rule, or order, exempt a person",
      "content": "or class of persons from liability to pay the whole or part of the tax in respect of any motor vehicle, or\nclass of motor vehicles, and may, in like manner, exclude any motor vehicle, or class of motor vehicles,\nfrom the operation of this Act.\n(2) Whoever becomes liable to pay a quarterly instalment of tax, but proves to the satisfaction\nof the licensing officer that he has not used or permitted the use of the motor vehicle throughout the\nquarterly period preceding shall be entitled to receive an order in writing from the licensing officer\nexempting him from liability to pay such first mentioned quarterly installment and the licensing officer\nshall make an endorsement to that effect upon the license.\n(3) Whoever becomes liable to pay a quarterly instalment of tax in respect of a motor vehicle,\nbut prove to the satisfaction of the licensing officer that he has paid a tax imposed by a municipality,\nor a cantonment authority, in respect of the same motor vehicle, and for the whole or part of the quarter\nfor which the installment of tax is due, then the amount of the municipal tax paid for the said period\nshall be deducted from the quarterly instalment of tax and the licensing officer shall make an\nendorsement to that effect upon the licence.\n2\n[(4) Nothing in this Act shall apply to a tractor or a trailer attached to a tractor used for the\npurpose of the agriculture.\nExplanation__ A tractor and a trailor used together for transporting agricultural produce of the\nowner shall, for the purpose of this section, be deemed to be used for the purpose agriculture.]"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Bar to Jurisdiction of civil and criminal courts in matters of taxation. The liability of",
      "content": "a person to pay the tax or penalty shall not be determined or questioned in any other manner or by any\nother authority than is provided in this Act, or in rules made thereunder, and no prosecution, suit or\nother proceeding shall lie against any Government officer for anything in good faith done, intended to\nbe done, under this Act.\n1\nSubs. and added by the West Pakistan Laws (Amendment) Ordinance, 1965 (W. P. Ord. No. XXXIV of 1965), s. 3.\n2\nSubs.by West Pakistan Ordinance No. LVII of 1959, s. 3."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Power of Government to make rules. (1) The Government may, after previous public",
      "content": "cation, make rules for the purpose of carrying into effect the provisions of this Act.\n(2) In particular and without prejudice to the generality of the foregoing power, the Government\nmay make rules on all or any of the following matters, namely:—\n(a)     to prescribe the form of any declaration, licence certificate or special notice and\nthe particulars to be stated therein;\n(b)     to prescribe the officers by whom any duties are to be performed and the area\nin which they shall exercise their authority;\n(c)     to provide for the total or partial exemption for a limited period from liability to\ntaxation, in respect of any motor vehicle brought into the territory to which this\nAct extends by persons making only a temporary stay there;\n(d)     to regulate the method of assessing and recovering the tax;\n(e)     to regulate the manner in which special notices may be served;\n(f)     to regulate the extent to which licences may be transferred;\n(g)     to regulate the manner in which exemptions or refunds may be claimed and\ngranted;\n(h)     to regulate the manner in which appeals may be instituted and heard;\n(i)     to require that no motor vehicle shall be used in the Province unless a token is\ndisplayed thereon indicating that the tax has been duly paid or that the owner of\nthe vehicle is entitled to exemption;\n(j)     to prescribe the form of tokens and the manner in which they shall be displayed;\n(k)     to provide for the issue of token and its duplicate; and\n(l)     to prescribe the limit of density of traffic and limit of income for the purposes\nof sub-section (1) of section 3."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Punishment. (1) In making any rule under the preceding section, the Government may",
      "content": "direct that any person contravening the rule shall be punished with fine which may extend to twenty\nrupees and in the event of any subsequent conviction for the same offence, with a fine which may\nextend to one hundred rupees.\n(2) No court inferior to that of a Magistrate of the Second Class shall try any offence punishable\nunder this Act."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Repeal. (1) The following enactments are hereby repealed",
      "content": "(a)     the Punjab Motor Vehicles Taxation Act, 1924 (Punjab IV of 1924);\n(b)     the North-West Frontier Province Motor Vehicles Taxation Act, 1936\n(N.W.F.P. I of 1937);\n(c)    the Sind Motor Vehicles Tax Act, 1939 (Sind XV of 1939);\n(d)        the Punjab Motor Vehicles Taxation Act, 1924 (Punjab IV of 1924), as\napplicable to the area which, before the establishment of the Province of West\nPakistan, formed part of the State of Bahawalpur; 1[*]\n(e)        the Sind Motor Vehicles Tax Act, 1939 (Sind XV of 1939), as applicable to the\narea which, before the establishment of the Province of West Pakistan, formed\npart of the State of Khairpur 1[; and]\n1\n[(f)   the Sind Motor Vehicles Tax Act, 1939, as applicable to Karachi]\n(2) Notwithstanding the repeal of enactments mentioned in sub-section (1) (hereinafter called\nthe said Acts)—\n(a)    the validity of anything done under the said Acts shall not be affected;\n(b)        all appointments made, notifications and notices issued and legal proceedings\ninstituted under any of the said Acts shall, so for as they are not inconsistent\nwith the provisions of this Act and the rules made thereunder, continue in force\nand be deemed to have been made, issued and instituted under this Act; and\n(c)        any exemption from liability to taxation granted under any of the said Acts shall\ncontinue in force and be deemed to have been granted under this Act.\n1\nOmitted, replaced and added by West Pakistan Act No. XX of 1964, s.3.\n(vide SECTION 3)\nDescription of motor vehicles                                                              Annual rate\nof tax\nRs."
    }
  ],
  "definitions": [
    {
      "term": "Government",
      "definition": "the Government of West Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "Licensing officer",
      "definition": "an officer appointed by the Government to perform the duties and exercise the powers imposed or conferred upon a licensing officer under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "motor vehicle",
      "definition": "a vehicle, carriage or other means of conveyance propelled, or which may be propelled, on a road by electrical or mechanical power either entirely or partially;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "tax",
      "definition": "the tax imposed under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "token",
      "definition": "a ticket to be displayed on a motor vehicle as an indication that the tax leviable thereon has been duly paid or that no tax is payable;",
      "source_provision": "sec2"
    },
    {
      "term": "Director",
      "definition": "the officer appointed by the Government as the head of the Taxation Department; and",
      "source_provision": "sec2"
    },
    {
      "term": "Deputy Director",
      "definition": "an officer appointed by the Government as Deputy Director of the Taxation Department, and includes an officer appointed by the Government to perform the duties of Deputy Director under this Act. 1 Subs. by West Pakistan Act No. XX of 1964, s. 6.",
      "source_provision": "sec2"
    }
  ]
}
