{
  "id": "pk-west-pakistan-muslim-personal-law-shariat-application-act-1962",
  "type": "statute",
  "title": "West Pakistan Muslim Personal Law (Shariat) Application Act, 1962",
  "title_en": "West Pakistan Muslim Personal Law (Shariat) Application Act, 1962",
  "short_name": "WPMPL",
  "status": "in_force",
  "issued_date": "1962-12-30",
  "in_force_date": "1962-12-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tiZw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Muslim Personal Law (Shariat) Application Act, 1962 (V of 1962) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent. (1) This Act may be called the West Pakistan Muslim Personal Law",
      "content": "(Shariat) Application Act, 1962.\n(2) It extends to the whole of the 1[Pakistan]."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Application of the Muslim Personal Law. Notwithstanding any custom or usage, in all",
      "content": "questions regarding succession (whether testate or intestate), special property of females, betrothal,\nmarriage, divorce, dower, adoption, guardianship, minority, legitimacy or bastardy, family relations, wills,\nlegacies, gifts, religious usages or institutions, including waqfs, trusts and trust properties, the rule of\ndecision, subject to the provisions of any enactment for the time being in force, shall be the Muslim\nPersonal Law (Shariat) in cases where the parties are Muslims.\n2\n[3. Termination of limited estates under customary law. The limited estates in respect of\nimmovable property held by Muslim females under the Customary Law are hereby terminated:\nProvided that nothing herein contained shall apply to any such estate saved by any enactment,\nrepealed by this Act, and the estates so excepted shall continue to be governed by that enactment, not\nwithstanding its repeal by this Act.]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Further operation of certain wills shall cease on the death of legatee",
      "content": "in-enjoyment. Where\na will providing for more than one legatee succeeding to the testator's property one after the other is.\nOperative at the commencement of this Act, its further operation shall cease upon the death of the legatee-\nin-enjoyment.\n1\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Article 2 and Schedule.\n2\nSubs. by the West Pakistan Ordinance No. XXXIX of 1963, (w. e. f. 31.12.1962). s. 2."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Devolution of property on the termination of life estate and certain wills. The life estate",
      "content": "terminated under section 3 or the property in respect of which the further operation of a will has ceased\nunder section 4 shall devolve upon such persons as would have been entitled to succeed under the Muslim\nPersonal Law (Shariat) upon the death of the last full owner or the testator as though he had died intestate;\nand if any such heir has died in the meantime, his share shall devolve in accordance with Shariat on such\npersons as would have succeeded him if he had died immediately after the termination of the life estate or\nthe death of the said legatee:\nProvided that the share to which a Muslim female holding limited estate under customary law\nwould have been entitled under the Muslim Personal Law (Shariat) upon the death of the last full owner\nshall devolve on her."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Section 3, 4 and 5 only to be retrospective. Save as expressly provided by the provisions of",
      "content": "sections 3, 4 and 5, this Act shall have no retrospective operation."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Repeal and Savings. (1) The following enactments are hereby repealed",
      "content": "(a)        The Punjab Limitation (Custom) Act, 1920 (Punjab I of 1920);\n(b)        The Punjab Custom (Power to Contest) Act, 1920 (Punjab II of 1920);\n(c)        The Muslim Personal Law (Shariat) Application Act, 1937 (Central XXVI of\n1937), in its application to West Pakistan;\n(d)        The North-West Frontier Province Muslim Personal Law (Shariat) Application Act,\n1935 (N.W.F.P. VI of 1935);\n(e)        The Punjab Muslim Personal Law (Shariat) Application Act, 1948 (Punjab IX of\n1948);\n(f)        The Muslim Personal Law (Shariat) Application (Sind Amendment) Act, 1950\n(Sind XXII of 1950);\n(g)        The Bahawalpur State Shariat (Muslim Personal Law) Application Act, 1951\n(Bahawalpur I of 1950);\n(h)        The Khairpur State Muslim Female Inheritance (Removal of Customs) Act, 1952\n(Khairpur I of 1952).\n1\n[(2)   *          *         *          *     *        *        *]\n________                      RGN Date: 24-03-2025\n1\nOmitted by West Pakistan Act No. XXVIII of 1964, s. 2."
    }
  ],
  "definitions": []
}
