{
  "id": "pk-trade-secrets-competition",
  "type": "statute",
  "title": "Trade Secrets Protection under Contract Act 1872 and Competition Act 2010",
  "title_en": "Pakistan Trade Secrets and Unfair Competition Framework (Contract Act 1872 + Competition Act 2010)",
  "short_name": "PK-TSUC",
  "status": "in_force",
  "issued_date": "2010-10-13",
  "in_force_date": "2010-10-13",
  "url": "https://www.cc.gov.pk/images/Downloads/cc_act.pdf",
  "description": "Pakistan's framework for the protection of trade secrets and confidential business information draws primarily from the Contract Act 1872 (which provides the basis for enforceable confidentiality obligations) and the Competition Act 2010 (which prohibits unfair competitive practices including the misappropriation of trade secrets). Together, these instruments provide civil and administrative remedies for the unauthorized disclosure or use of confidential commercial information.",
  "provisions": [
    {
      "provision_ref": "ca-sec2",
      "section": "Contract Act - Section 2",
      "title": "Contract Act 1872 — Section 2: Definitions Relevant to Confidentiality",
      "content": "Under the Contract Act 1872, a contract is an agreement enforceable by law. An agreement is formed when one person makes a proposal to another person and that other person signifies his assent thereto. Every promise and every set of promises forming the consideration for each other is an agreement. Agreements relating to confidentiality and non-disclosure of business information, trade secrets, proprietary processes, customer lists, and other commercially sensitive information are valid and enforceable contracts under the Contract Act 1872, provided they meet the requirements of a valid contract — namely, offer, acceptance, consideration, and the capacity of the parties to contract. A confidentiality agreement does not require a specific form and may be oral, written, or implied from the circumstances of the parties' relationship. Courts will imply an obligation of confidentiality where a party has received information that a reasonable person would recognize as confidential."
    },
    {
      "provision_ref": "ca-sec27",
      "section": "Contract Act - Section 27",
      "title": "Contract Act 1872 — Section 27: Agreements in Restraint of Trade",
      "content": "Every agreement by which anyone is restrained from exercising a lawful profession, trade or business of any kind is, to that extent, void. Exception 1: Saving of agreement not to carry on business of which goodwill is sold. One who sells the goodwill of a business may agree with the buyer to refrain from carrying on a similar business, within specified local limits, so long as the buyer, or any person deriving title to the goodwill from him, carries on a like business therein, provided that such limits appear to the Court reasonable, regard being had to the nature of the business. Post-employment non-compete clauses that extend beyond the scope of protecting legitimate trade secrets and confidential business information are likely to be unenforceable as restraints of trade. Courts will uphold restrictions on the use of specific trade secrets or confidential customer relationships for a reasonable period post-employment."
    },
    {
      "provision_ref": "ca-sec73",
      "section": "Contract Act - Section 73",
      "title": "Contract Act 1872 — Section 73: Compensation for Breach",
      "content": "When a contract has been broken, the party who suffers by such breach is entitled to receive, from the party who has broken it, compensation for any loss or damage caused to him thereby, which naturally arose in the usual course of things from such breach, or which the parties knew, when they made the contract, to be likely to result from the breach of it. Compensation is not to be given for any remote and indirect loss or damage sustained by reason of the breach. In cases involving breach of confidentiality obligations and misappropriation of trade secrets, damages recoverable include: the profits made by the defendant from the unauthorized use of the confidential information; the losses suffered by the plaintiff due to the breach; and in appropriate cases, punitive damages where the breach was deliberate or dishonest. Courts in Pakistan have jurisdiction to grant injunctive relief to prevent the continuing use or disclosure of trade secrets in breach of confidentiality obligations."
    },
    {
      "provision_ref": "comp-sec3",
      "section": "Competition Act - Section 3",
      "title": "Competition Act 2010 — Section 3: Prohibition of Anti-Competitive Agreements",
      "content": "Every agreement between undertakings, decisions by associations of undertakings and concerted practices that have as their object or effect the prevention, restriction, or significant distortion of competition within Pakistan shall be prohibited, subject to the exceptions specified in this Act. Without prejudice to the generality of this, an agreement between or among undertakings shall be deemed prohibited if it involves price fixing, bid rigging, market division, and other forms of collusion among competitors. The misappropriation of trade secrets and confidential business information may constitute an anti-competitive practice where it distorts competition between undertakings. The Competition Commission of Pakistan (CCP) has jurisdiction to investigate and remedy anti-competitive agreements and practices, including those involving the unlawful use of a competitor's confidential information."
    },
    {
      "provision_ref": "comp-sec4",
      "section": "Competition Act - Section 4",
      "title": "Competition Act 2010 — Section 4: Prohibition of Abuse of Dominant Position",
      "content": "Any abuse by one or more undertakings of a dominant position within the relevant market shall be prohibited. Abuse may, in particular, consist of: limiting production, markets or technical development to the prejudice of consumers; applying dissimilar conditions to equivalent transactions with other trading parties, thereby placing them at a competitive disadvantage; making the conclusion of contracts subject to acceptance of supplementary obligations which have no connection with the subject of such contracts. The use of market power to compel competitors or suppliers to disclose confidential business information under threat of exclusion from the market constitutes an abuse of dominant position. Dominant undertakings that acquire confidential information about competitors through the abuse of their market power may be subject to remedies including fines, remedial orders, and compensation to aggrieved parties."
    },
    {
      "provision_ref": "comp-sec10",
      "section": "Competition Act - Section 10",
      "title": "Competition Act 2010 — Section 10: Deceptive Market Practices",
      "content": "No undertaking shall engage in deceptive marketing practices. Such practices include: distributing false or misleading information that may harm the business interests of another undertaking; using false or misleading descriptions in the marketing of goods or services; making false or misleading representations about the standard, quality, or composition of goods or services. The use of trade secrets or confidential information misappropriated from a competitor to gain an unfair competitive advantage constitutes a deceptive market practice under this section. Enterprises that engage in systematic industrial espionage or the recruitment of employees for the primary purpose of obtaining their former employer's trade secrets shall be subject to investigation and remedies by the Competition Commission. The Competition Commission may order the cessation of deceptive practices, the publication of corrective notices, and the payment of compensation to aggrieved undertakings."
    },
    {
      "provision_ref": "comp-sec30",
      "section": "Competition Act - Section 30",
      "title": "Competition Act 2010 — Section 30: Powers of the Commission",
      "content": "The Competition Commission of Pakistan has the following powers relevant to trade secret protection: (a) to investigate any suspected violation of the Act upon complaint or on its own motion; (b) to issue notices to undertakings requiring the production of documents and information relevant to an investigation; (c) to enter and inspect premises under a warrant; (d) to impose fines on undertakings that violate the Act; (e) to order undertakings to cease and desist from anti-competitive or deceptive practices; (f) to refer matters for criminal prosecution where the violation involves serious anti-competitive conduct. Investigations relating to trade secrets shall be conducted with appropriate safeguards to prevent the confidential information from being disclosed beyond what is necessary for the investigation. The Commission shall maintain the confidentiality of commercially sensitive information obtained during investigations to the fullest extent possible."
    },
    {
      "provision_ref": "comp-sec31",
      "section": "Competition Act - Section 31",
      "title": "Competition Act 2010 — Section 31: Penalties",
      "content": "Any undertaking that violates the provisions of this Act shall be liable to a penalty not exceeding seventy-five million Pakistan Rupees or ten percent of annual turnover, whichever is higher. For repeated violations, the penalty may be doubled. In cases involving the abuse of market power to facilitate the misappropriation of trade secrets, the Commission may also order: structural remedies including the compulsory licensing of intellectual property; divestiture of improperly acquired assets; and compensation to competitors harmed by the anti-competitive conduct. Individuals who authorize or direct anti-competitive conduct involving the misappropriation of trade secrets may be personally liable for a fine not exceeding one million Pakistan Rupees. Appeals against Commission decisions lie before the Competition Appellate Tribunal and subsequently before the High Court. The Commission shall publish an annual report on enforcement activities."
    },
    {
      "provision_ref": "ip-framework",
      "section": "IP Framework",
      "title": "Trade Secrets within Pakistan's IP Framework",
      "content": "Pakistan's trade secrets protection framework operates within the broader context of intellectual property law. While Pakistan does not have a dedicated Trade Secrets Act, trade secrets are protected through the combined application of: the Contract Act 1872 for contractual confidentiality obligations; the Competition Act 2010 for protection against misappropriation as an unfair competitive practice; the Prevention of Electronic Crimes Act 2016 for cybercrime-based misappropriation through unauthorized computer access; and general principles of equity including breach of confidence. Pakistan's obligations under the TRIPS Agreement require it to provide effective protection against the unauthorized use and disclosure of undisclosed information (trade secrets) in commercial dealings. Pakistan is in the process of developing a standalone Undisclosed Information Protection Act to meet its international obligations more comprehensively. Courts have recognized the doctrine of breach of confidence as an equitable remedy available against persons who misuse confidential information."
    },
    {
      "provision_ref": "remedies",
      "section": "Remedies",
      "title": "Civil and Criminal Remedies for Trade Secret Misappropriation",
      "content": "Owners of trade secrets whose information has been misappropriated may seek the following remedies: Civil Remedies: (a) Injunctive relief to prevent the ongoing or threatened disclosure or use of the trade secret; (b) Compensatory damages for actual losses suffered as a result of the misappropriation; (c) Account of profits — requiring the defendant to account for and disgorge profits made from the unauthorized use of the trade secret; (d) Delivery up or destruction of materials containing or embodying the trade secret. Criminal Remedies: Where the misappropriation of trade secrets involves unauthorized access to computer systems, the victim may pursue criminal prosecution under PECA 2016. Where the misappropriation constitutes theft, criminal prosecution may be available under the Pakistan Penal Code. Employees who misappropriate trade secrets may face both civil and criminal liability, as well as disciplinary consequences under their employment contracts. Ex parte injunctions are available where immediate disclosure would render the remedy ineffective."
    },
    {
      "provision_ref": "employees",
      "section": "Employee Obligations",
      "title": "Employee Confidentiality and Non-Disclosure Obligations",
      "content": "Employees in Pakistan are subject to the following obligations regarding trade secrets and confidential information: During Employment: employees are bound by implied and express duties not to disclose or misuse their employer's confidential information and trade secrets. The implied duty of good faith and fidelity requires employees to act honestly and loyally in their employer's interests, including protecting confidential information. After Employment: former employees have a continuing obligation not to disclose or misuse trade secrets obtained during their employment. The protection of genuine trade secrets survives the end of employment. However, former employees have a right to use their general skills and knowledge, and employers cannot prevent them from using skills and knowledge they have acquired in the course of their careers. Post-employment restraints on the use of specific confidential information must be reasonable in scope and duration to be enforceable. Courts will not enforce post-employment restrictions that are designed to prevent competition generally rather than to protect specific trade secrets."
    }
  ],
  "definitions": [
    {
      "term": "trade secret",
      "definition": "Information that is not generally known, has commercial value by reason of its secrecy, and has been the subject of reasonable steps to maintain its secrecy, including formulae, processes, methods, compilations, programs, designs, and customer information.",
      "source_provision": "ip-framework"
    },
    {
      "term": "misappropriation",
      "definition": "The acquisition of a trade secret by improper means, including theft, bribery, misrepresentation, breach of duty to maintain secrecy, or espionage through electronic or other means; or the disclosure or use of a trade secret without consent of the owner.",
      "source_provision": "ip-framework"
    },
    {
      "term": "dominant position",
      "definition": "A position of economic strength enjoyed by an undertaking which enables it to prevent effective competition being maintained in the relevant market by giving it the power to act to an appreciable extent independently of its competitors, customers, and consumers.",
      "source_provision": "comp-sec4"
    }
  ]
}
