{
  "id": "pk-west-pakistan-national-calamities-prevention-and-relief-act-1958",
  "type": "statute",
  "title": "West Pakistan National Calamities (Prevention and Relief) Act, 1958",
  "title_en": "West Pakistan National Calamities (Prevention and Relief) Act, 1958",
  "short_name": "WPNCA",
  "status": "in_force",
  "issued_date": "1958-04-23",
  "in_force_date": "1958-04-23",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tmaA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan National Calamities (Prevention and Relief) Act, 1958 (XXXIII of 1958) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Act may be called the West Pakistan",
      "content": "National Calamities (Prevention and Relief) Act, 1958.\n1\n[(2) It extends to the whole of the Province of West Pakistan, except the Tribal Areas.]\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act unless there is anything repugnant in the subject or context",
      "content": "1\n[(a)   ‘Relief Commissioner’ means the person appointed as such under section 3-A;]\n(b)        “Government” means the Government of the West Pakistan ; and\n(c)        “Prescribed” means prescribed by rules made under this Act.\n1\n[3. Declaration of calamity affected area. Whenever the Province or any part thereof is\naffected or threatened by flood, famine, locust or any other pest, hailstorm, fire, epidemic or any other\ncalamity which, in the opinion of Government, warrants action under this Act, Government may, by\nnotification, declare the whole or any part of the Province, as the case may be, as calamity-affected\narea.]\n1\n[3-A. Appointment of Relief Commissioner. (1) Government may, by notification, appoint\na Relief Commissioner for the Province.\n(2) Government may confer on the Relief Commissioner for the whole or part of the Province__\n(i)        the powers of a Magistrate of the First Class under section 144 of the Code of\nCriminal Procedure, 1898; and\n1\nSubs. and Ins. by W. P. Act No. X of 1964, ss. 2-5.\n(ii)       powers under such other laws as Government may consider necessary for\ncarrying out the purpose of this Act.]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Preventions and relief. (1) Subject to the other provisions of this Act and of the rules made",
      "content": "thereunder, the Relief Commissioner shall, with respect to the calamity-affected area, take such steps\nas he may deem necessary in order to maintain order, prevent, check or control the calamity or reduce\nthe extent and severity thereof, or to provide immediate relief to the victims of the calamity in the\ncalamity-affected area.\n(2) In particular and without prejudice to the generality of the powers conferred by the\npreceding sub-section the Relief Commissioner shall have power 1[* * *]:__\n(a)        to evacuate or segregate population ;\n(b)        to requisition buldozers, tractors, motor vehicles, carts, carriages, boats and\nother means of transport by air, land or water, and beasts of burden ;\n(c)        to require the residents to declare surplus stocks of food, fodder, fire-wood,\nclothing and beddings and to requisition all or any of these articles;\n(d)        to requisition building materials ;\n(e)        to requisition any building or land ;\n(f)        to demolish any building or other structure ;\n(g)        to conscript labour ;\n(h)        to direct any person to abstain from a certain act or to take certain order with\nregard to certain property in his possession or under his management ;\nand after approval of the Government–\n(i)        to acquire any land ; or\n(j)        to remit in whole or part any Government dues payable by any person or in\nrespect of any property affected by the calamity :\nProvided that with respect to the powers conferred by clauses (b), (c), (d), (e), (f), (g), (h) and\n(i) of this sub-section the person owning the article, beasts of burden, building or land which is\nrequisitioned or acquired, or the building or other structure which is demolished, or the person directed\nto abstain from any act or to take any order with regard to any property, and the persons conscripted\nto work as labourers shall be entitled to reasonable compensation as may be claimable under any law\nfor the time being in force, or if no such law exists as is applicable to the case, then as prescribed by\nrules under this Act, and such compensation shall be paid within one year from the day it falls due 1[:]\n1\n[Provided further that the powers conferred by clauses (a), (f), (g) and (h) of this sub-section\nshall be exercised by the Relief Commissioner only within the area or areas declared as calamity-\naffected under section 3.]\n1\nOmitted, replaced. and added by W. P. Act No. X of 1964, s. 6.\n(3) Subject to the right of the owner to claim compensation, the property with regard to which\nan order for requisition or acquisition has been passed by the Relief Commissioner shall forthwith vest\nin the Relief Commissioner, who may deal with it in such manner as he deems proper in order to\ndischarge his duties under this Act :\nProvided that when the purpose for which the property was requisitioned has been served it\nmay, at his request be returned to the owner after the compensation paid to him has been refunded by\nhim less the depreciation charges.\n(4) The Relief Commissioner may, in addition to any other action prescribed by or under this\nAct, use or cause to be used such force as may, in his opinion, be reasonably necessary for securing\ncompliance with or giving effect to or preventing any contravention of an order passed or for the\neffective exercise of a power exercisable under this Act."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Requisition of services of Government officials. The Relief Commissioner may, for the",
      "content": "purposes of this Act, directly requisition the services of any employee of the Government within the\ncalamity-affected area, after consultation with the official superior of his Department, as far as\npracticable, and the person to whom the requisition is addressed shall comply with it as if it were an\norder passed by the Government or, as the case may be, by his official superiors."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Punishment and procedure. (1) Any person who fails to comply with an order passed by",
      "content": "thereunder shall be deemed to have disobeyed a direction so as to be liable for punishment under\nsection 188 of the Pakistan Penal Code, 1860 (XLV of 1860).\n(2) Nothing in sub-section (1) shall debar a competent authority from taking disciplinary action\nagainst an employee of the Government who has failed to obey a lawful order passed under this Act\nor the rules thereunder.\n(3) Every offence punishable under this Act shall, within the meaning of the Code of Criminal\nProcedure, 1898 (V of 1898), be cognizable and may be tried in accordance with the procedure\nprescribed by that Code for summary trials."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Delegation of powers. 1[(1) The Relief Commissioner may in areas declared as calamity",
      "content": "affected under section 3, by an order in writing, direct that all or any of his powers under this Act, shall\nin relation to such matters, and subject to such conditions, if any, as may be specified in the order, also\nbe exercised by such officer, not below the rank of a Gazetted Officer, as may be specified in the\norder.]\n(2) The Relief Commissioner and the officers to whom all or any of his powers have been\ndelegated under sub-section (1) shall be public servants within the meaning of section 21 of the\nPakistan Penal Code, 1860 (XLV of 1860)."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Revision. (1) Any order passed under this Act by the Relief Commissioner, shall be subject",
      "content": "to revision by the Government, and the Relief Commissioner shall give effect to the orders of the\nGovernment made in revision.\n(2) The Government shall, by rules, prescribe the class of cases and the manner in which and\n1\nSubs. by W. P. Act No. X of 1964, s. 7."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Power to give effect to order. If in any case it is not possible to serve an order under this",
      "content": "Act on any person without defeating the object of the order or if the person to whom the order is\naddressed fails to comply with it, the Relief Commissioner may, after recording the reason for doing\nso, give effect to the order and for that purpose may take such steps or pass such order with regard to\nany property as he considers necessary."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Bar to action. No order made under this Act shall be called in question in any court and",
      "content": "no civil or criminal proceeding shall be instituted against any person for anything done or purported\nto have been done, or intended to be done in good faith under this Act or against any person for any\nloss or damage caused to, or in respect of any property whereof possession has been taken or which\nhas otherwise been dealt with under this Act."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Rules. (1) The Government shall, as soon as may be, make rules for the purpose of carrying",
      "content": "into effect the provisions of this Act.\n(2) In particular and without prejudice to the generality of the power conferred by sub-section\n(1), the Government may, by rules, provide for all or any of the following matters, namely:__\n(a)        the procedure to be adopted in giving alarm of an impending calamity;\n(b)        the method of securing information with regard to flood or any other impending\ncalamity;\n(c)        the measures and precautions to be taken to avert any such calamity;\n(d)        the procedure to be followed for survey of places of safety and the entry into\nany such place for the purpose of such survey after a proper notice;\n(e)        the method of assessment and payment of compensation on account of\nrequisition and acquisition of property under this Act; and\n(f)        the procedure with regard to revisions against an order passed under this Act\nand the period during which such revisions can be presented.\n(3) The rules made under this Act shall be laid on the table of the Provincial Assembly during\nthe session of the Assembly next following and may be rescinded or modified by a resolution of the\nAssembly."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Repeal. The Punjab National Calamities (Prevention and Relief) Act, 1951 (Punjab III of",
      "content": "1\n1952) [the Khairpur National Calamities (Prevention and Relief) Act, 1954] and the West Pakistan\nNational Calamities (Prevention and Relief) Ordinance, 1956 (W.P. Ordinance XI of 1956), are hereby\nrepealed.\nRGN Date: 13-08-2025\n1\nAdded by W. P. Ordinance No. XLVII of 1959, s. 2 (shall always be deemed to have been added)."
    }
  ],
  "definitions": [
    {
      "term": "Government",
      "definition": "the Government of the West Pakistan ; and",
      "source_provision": "sec2"
    },
    {
      "term": "Prescribed",
      "definition": "prescribed by rules made under this Act. 1 [3. Declaration of calamity affected area. Whenever the Province or any part thereof is affected or threatened by flood, famine, locust or any other pest, hailstorm, fire, epidemic or any other calamity which, in the opinion of Government, warrants action under this Act, Government may, by notification, declare the whole or any part of the Province, as the case may be, as calamity-affected area.] 1 [3-A. Appointment of Relief Commissioner. (1) Government may, by notification, appoint a Relief Commissioner for the Province. (2) Government may confer on the Relief Commissioner for the whole or part of the Province__ (i) the powers of a Magistrate of the First Class under section 144 of the Code of Criminal Procedure, 1898; and 1 Subs. and Ins. by W. P. Act No. X of 1964, ss. 2-5. (ii) powers under such other laws as Government may consider necessary for carrying out the purpose of this Act.]",
      "source_provision": "sec2"
    }
  ]
}
