{
  "id": "pk-west-pakistan-private-colleges-management-and-control-ordinance-1970",
  "type": "statute",
  "title": "West Pakistan Private Colleges (Management and Control) Ordinance, 1970",
  "title_en": "West Pakistan Private Colleges (Management and Control) Ordinance, 1970",
  "short_name": "WPPCA",
  "status": "in_force",
  "issued_date": "1970-06-24",
  "in_force_date": "1970-06-24",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tjaA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Private Colleges (Management and Control) Ordinance, 1970 (XX of 1970) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Power to make regulation",
      "content": "THE WEST PAKISTAN PRIVATE COLLEGES (MANAGEMENT\nAND CONTROL) ORDINANCE, 1970\nWEST PAKISTAN ORDINANCE NO. XX OF 1970\n[25th June, 1970]\nAN\nto provide for control over and management of private colleges in West Pakistan.\nPreamble.__ WHEREAS it is expedient to make provisions to enable the private colleges in\nWest Pakistan to maximise their academic efficiency, to stream-line their administration and to\nregulate conditions of service of teachers employed therein;\nNOW, THEREFORE, in pursuance of the Martial Law Proclamation of 25th March, 1969, read\nwith the Provisional Constitution Order and in exercise of all powers enabling him in that behalf, the\nGovernor of West Pakistan is pleased to make and promulgate the following Ordinance:__"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, commencement and application",
      "content": "(1) This Ordinance may be called\n(2) It shall extend to the whole of the Province of West Pakistan, except the Tribal Areas.\n(3) It shall come into force at once.\n(4) It shall apply to all private colleges except as otherwise provided in this Ordinance."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Ordinance, unless there is anything repugnant in the subject or context__\n(a)     “affiliated to a University” means a college affiliated to a University and\nincludes a college admitted to privileges of a University;\n(b)     “Board” means the Board of Intermediate and Secondary Education, within the\nterritorial jurisdiction of which a college is located;\n(c)     “Chairman” means Chairman of the Governing Body;\n(d)     “competent authority” means the Director of Education of the Region in which\na college is situated;\n(e)     “Governing Body” means the Governing Body of the college;\n(f)     “Government” means the Government of the West Pakistan;\n(g)     “Private college or college” means a college or an institution recognized by a\nBoard for the purpose of education at the Intermediate level or affiliated to a\nUniversity for the purpose of higher education but does not include any college\nmanaged by__\n(i)     Government;\n(ii)    Local Body, a Cantonment Board or a University; or\n(iii)   a Governing Body appointed by Government under the provisions of the\nWest Pakistan Educational and Training Institutions Ordinance, 1960 or\nany other law in force immediately before the commencement of this\nOrdinance;\n(h)     “Member” means a Member of the Governing Body;\n(i)     “prescribed” means prescribed by rules or regulations made under this\nOrdinance;\n(j)     “Parent Body” means the person who, or the association of persons which\nfounded, established or maintained and managed the college prior to the\nestablishment of the Governing Body;\n(k)     “Principal” means the principal officer-in-charge of the college;\n(l)     “registered benefactor” means a person who after the commencement of this\nOrdinance donates in lump sum an amount not less than Rs. 15,000.00 to the\ncollege fund and whose name shall be entered in a register maintained by the\nPrincipal for the purpose;\n(m)     “Teacher” means a Professor, Associate Professor, Assistant Professor, Reader,\nLecturer or any employee of the college imparting instructions and includes the\nPrincipal, the Demonstrator, the Director of Physical Education and the Physical\nInstructor."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of Governing Body",
      "content": "For the efficient management and control of a college,\nthere shall be established by the competent authority a Governing Body."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Constitution of Governing Body.__ (1) Subject to the provisions of sub",
      "content": "section (3) of\nsection 10, the Governing Body shall consist of__\n(i)     the Principal of the college;\n(ii)    three teachers to be elected by the Teachers’ Association of the college from\namongst its members;\n(iii)   three members to be nominated by the Parent Body;\n(iv)    one nominee of the registered benefactors of the college;\n(v)     two nominees of the competent authority, one of whom shall be the parent or\nthe guardian of a student studying in the college;\n(vi)    one nominee of the Sydicate of the University in the case of a college affiliated\nto the University; and\n(vii)   one nominee of the Board in the case of a college recognized by the Board for\nthe purpose of education at the Intermediate level.\n(2) There shall be elected in the prescribed manner a Chairman from amongst the members\nwho are not the employees of the college.\n(3) The Principal shall be the member/secretary of the Governing Body.\n(4) Except the Principal, the members shall hold office for a period of three years and shall be\neligible for re-nomination and re-election as the case may be."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Removal and resignation of member and Chairman",
      "content": "(1) The Chairman or a member\nmay resign his office by tendering his resignation to the competent authority, and the seat of the\nChairman and of such member shall become vacant when the resignation is accepted by the competent\nauthority.\n(2) The competent authority may at any time remove from the Governing Body the Chairman\nor a member if he__\n(a)     refuses or fails to discharge or becomes, in the opinion of the competent\nauthority incapable to perform his duties under this Ordinance;\n(b)     has, in the opinion of the competent authority abused his position as Chairman\nor member;\n(c)     has, absented himself without leave from three consecutive meetings of the\nGoverning Body:\nProvided that the Chairman or member shall not be removed under the provisions of\nthis sub-section without first giving an opportunity of showing cause against his\nremoval.\n(3) A person appointed as a member by virtue of his holding a particular office shall cease to\nbe the member on his ceasing to hold that office."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Filling of casual vacancies",
      "content": "If a vacancy in the office of the Chairman or a member occurs\nduring the prescribed term, by death, resignation, disability or otherwise, the vacancy shall be filled in\naccordance with the provisions of section 4 and the Chairman or the member so elected or nominated\nto fill the vacancy shall hold office for the unexpired term."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Meeting of Governing Body",
      "content": "The meetings of the Governing Body shall be held at such\ntimes and at such places and in accordance with such procedure as may be prescribed."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Powers, and duties of Governing Body",
      "content": "(1) Subject to the provisions of this Ordinance,\nthe Governing Body shall exercise general supervision and control over the affairs of the college and\nwithout prejudice to the generality of the above powers it shall__\n(a)     control and administer the property of the college notwithstanding the\nownership of such property being that of the Parent Body;\n(b)     manage and regulate the funds, finances, assets and investments of the college;\n(c)     pass the budget; and\n(d)     appoint teachers and other employees of the college and take disciplinary action\nagainst them.\n(2) It shall be duty of the Governing Body to ensure__\n(a)     that the conditions on which the college has been recognized by a Board or\naffiliated to a University and all rules and orders issued by such Board,\nUniversity, or other competent educational authorities from time to time\nregarding the admission of students, curriculum, syllabus, medium of\ninstructions, examinations other cognate matters as applicable to the college are\nobserved;\n(b)     that the provisions of this Ordinance and the rules made thereunder are strictly\nenforced;\n(c)     that the views expressed by the students on the working of the college in so far\nas it affects their interests are given due consideration;\n(d)     that the accounts of the college are maintained in the form and audited in the\nmanner approved by the competent authority;"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Powers and duties of the Principal",
      "content": "Subject to the provisions of this Ordinance and the\nrules made thereunder, the Principal shall be competent to regulate all matters connected with the\ninternal administration of the college including admissions, class promotions, teachers’ time-table,\nmaintenance of discipline, grant of fee concessions and scholarships, incurring of the expenditure\nprovided for in the budget, maintenance of the register of the registered benefactors and making\ntemporary or officiating appointments of not more than three months’ duration."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Submission of statement.– (1) The Parent Body shall furnish to the competent authority a",
      "content": "statement in the form appended to this Ordinance within two months of__\n(a)     the commencement of this Ordinance, if the college was in existence at the time\nof such commencement; or\n(b)     the date on which, the college is recognized by a Board, or affiliated to a\nUniversity.\n(2) The Parent Body shall disclose in the statement its contribution to the annual expenditure\ninvolved in running the college.\n(3) If the contribution made by the Parent Body is less than twenty-five percentum of the annual\nexpenditure of the college, the competent authority may reduce the number of nominees of the Parent\nBody on the Governing Body to such number as it may deem fit.\nExplanation.__ For the purposes of sub-section (3) the amount of contribution made by the Parent Body\nshall be deemed to include the income from the property and assets of the college and\nthe rental value, assessed by the competent authority, of the property used by the college\nand owned by or vesting in the Parent Body."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. College Fund",
      "content": "The college shall have a fund to which shall be credited__\n(a)     income from fees, donations, trusts, bequests, endowments, grants, and lump\nsum contributions by the registered benefactors;\n(b)     income from the property of the college;\n(c)     contribution made by the Parent Body;\n(d)     contributions or grants-in-aid given by Government; and\n(e)     income from all other sources."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Bar to derive financial benefits",
      "content": "No member of the Governing Body shall derive any\nfinancial benefit from the college; provided that nothing in this section shall debar a person possessing\nthe prescribed qualifications from being appointed and receiving emoluments and enjoying other\nbenefits as a teacher in accordance with the rules made under this Ordinance."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Inspection",
      "content": "(1) The competent authority may inspect the college or cause it to be\ninspected from time to time by one or more persons authorised by it in this behalf.\n(2) The competent authority may call upon any college so inspected to take, within a specified\nperiod, such actions as may appear to it to be necessary in respect of any of the matters provided for\nin this Ordinance and the rules and regulations made thereunder."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Staff Council",
      "content": "There shall be a Staff Council in the college consisting of the Principal as\nChairman and four other senior-most teachers as members, to advise on the day-to-day affairs of the\ncollege and on other matters mentioned in section 9."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Teachers’ Association",
      "content": "There shall be a Teachers’ Association in the college consisting\nof all teachers of the college."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Student",
      "content": "Teacher Council.__ (1) There shall be a Student-Teacher Council in the college\nconsisting of__\n(i)     the Principal;\n(ii)    two teachers to be elected in the prescribed manner by the Teachers’\nAssociation from amongst its members, other than those elected on the\nGoverning Body; and\n(iii)   the President and the Secretary of the Students’ Union.\n(2) The Council shall consider matters relating to the welfare of the students and make\nrecommendations to the Governing Body in this behalf."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Dissolution of Parent Body or Governing Body and taking over of college",
      "content": "If the\ncollege ceases to maintain efficiency and discipline in accordance with or fails to satisfy the\nrequirements of the provisions of this Ordinance and the rules and regulations made thereunder or it is\nconducted in a manner which is prejudicial to the interest of education, Government may after giving\nthe Parent Body or the Governing Body, as the case may be, an opportunity to show cause against the\nproposed action__\n(a)     dissolve the Governing Body and appoint a Board of Governors under the\nprovisions of the West Pakistan Government Educational and Training\nInstitutions Ordinance, 1960;\n(b)     take over the college permanently; or\n(c)     take such other action as it may deem to be expedient."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Appointment of foreign nationals",
      "content": "Notwithstanding anything contained in sections 4, 8,\n9 and 19 and the rules made under this Ordinance, no person who is a foreign national shall be\nappointed to the teaching or administrative staff or elected or nominated to the Governing Body of a\ncollege without the prior approval of Government."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Protection of rights secured by agreement, custom or usage",
      "content": "(1) The provisions of this\nOrdinance shall have effect notwithstanding anything to the contrary contained in any other law for\n(2) Save as provided in section 18 nothing in this Ordinance shall affect any agreement, custom\nor usage in force immediately before the commencement of this Ordinance in so far as such agreement,\ncustom or usage ensures conditions of employment more favourable to the teachers of the college than\nthose prescribed by the rules made under this Ordinance."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Indemnity",
      "content": "(1) No suit or legal proceedings shall lie against Government in respect of\nanything which is, in good faith, done or intended to be done under this Ordinance.\n(2) No suit, prosecution or other proceedings shall lie against any person in respect of anything\nwhich is, in good faith, done or intended to be done under this Ordinance."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Exemption",
      "content": "(1) Government may by notification in the official Gazette, on the\nrecommendation of the Tribunal to be constituted for the purpose, exempt any college from the\noperation of all or any of the provisions of this Ordinance for a period which shall not be less than\nthree and not more than five years at a time.\n(2) The constitution, term of office and the procedure of the Tribunal referred to in sub-section\n(1) shall be such as may be prescribed."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Power to make rules.– (1) Government may, by notification in the official Gazette, make",
      "content": "rules for carrying out the purposes of this Ordinance.\n(2) In particular and without prejudice to the generality of the foregoing powers such rules\nmay provide for__\n(a)     appointment, confirmation, promotion and security of service of the teachers;\n(b)     pay scales and allowances payable to teachers;\n(c)     grant of leave, medical assistance and other amenities to teachers;\n(d)     contributory provident fund benefits for the teachers;\n(e)     provision of facilities to students, fixation of fees and funds to be realized from\nstudents;\n(f)     grant of fee concessions and scholarships to students;\n(g)    establishment and functioning of Teachers’ Association and Student-Teacher\nCouncil;\n(h)    constitution, terms of office and the procedure of the Tribunal;\n(i)    election of the Chairman; and\n(j)    any other matter which has to be or may be prescribed."
    }
  ],
  "definitions": [
    {
      "term": "affiliated to a University",
      "definition": "a college affiliated to a University and includes a college admitted to privileges of a University;",
      "source_provision": "sec2"
    },
    {
      "term": "Board",
      "definition": "the Board of Intermediate and Secondary Education, within the territorial jurisdiction of which a college is located;",
      "source_provision": "sec2"
    },
    {
      "term": "Chairman",
      "definition": "Chairman of the Governing Body;",
      "source_provision": "sec2"
    },
    {
      "term": "competent authority",
      "definition": "the Director of Education of the Region in which a college is situated;",
      "source_provision": "sec2"
    },
    {
      "term": "Governing Body",
      "definition": "the Governing Body of the college;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Government of the West Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "Private college or college",
      "definition": "a college or an institution recognized by a Board for the purpose of education at the Intermediate level or affiliated to a University for the purpose of higher education but does not include any college managed by__ (i) Government; (ii) Local Body, a Cantonment Board or a University; or (iii) a Governing Body appointed by Government under the provisions of the West Pakistan Educational and Training Institutions Ordinance, 1960 or any other law in force immediately before the commencement of this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "Member",
      "definition": "a Member of the Governing Body;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules or regulations made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "Parent Body",
      "definition": "the person who, or the association of persons which founded, established or maintained and managed the college prior to the establishment of the Governing Body;",
      "source_provision": "sec2"
    },
    {
      "term": "Principal",
      "definition": "the principal officer-in-charge of the college;",
      "source_provision": "sec2"
    },
    {
      "term": "registered benefactor",
      "definition": "a person who after the commencement of this Ordinance donates in lump sum an amount not less than Rs. 15,000.00 to the college fund and whose name shall be entered in a register maintained by the Principal for the purpose;",
      "source_provision": "sec2"
    },
    {
      "term": "Teacher",
      "definition": "a Professor, Associate Professor, Assistant Professor, Reader, Lecturer or any employee of the college imparting instructions and includes the Principal, the Demonstrator, the Director of Physical Education and the Physical Instructor.",
      "source_provision": "sec2"
    }
  ]
}
