{
  "id": "pk-west-pakistan-prohibition-of-opium-smoking-ordinance-1960",
  "type": "statute",
  "title": "West Pakistan Prohibition of Opium Smoking Ordinance, 1960",
  "title_en": "West Pakistan Prohibition of Opium Smoking Ordinance, 1960",
  "short_name": "WPPOO",
  "status": "in_force",
  "issued_date": "1960-01-19",
  "in_force_date": "1960-01-19",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tnZw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Prohibition of Opium Smoking Ordinance, 1960 (II of 1960) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Repeal",
      "content": "ORDINANCE, 1960\nWEST PAKISTAN ORDINANCE No. II OF 1960.\n[20th January, 1960]\nAN\nto amend and consolidate the law relating to the prohibition of opium smoking in the Province of\nWest Pakistan.\nPreamble. Whereas it is expedient to amend and consolidate the law relating to the prohibition\nof opium smoking in the Province of West Pakistan;\nNow, therefore, in pursuance of the Presidential Proclamation of the seventh day of October,\n1958, and having received the previous instructions of the President, the Governor of West Pakistan is\npleased, in exercise of all powers enabling him in that behalf, to make and promulgate the following\nOrdinance:__"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent.(1) This Ordinance may be called the West Pakistan Prohibition of",
      "content": "Opium Smoking Ordinance, 1960.\n1\n[(2) It extends to the whole of the Province of West Pakistan, except the tribal Areas.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless the context otherwise requires, the following",
      "content": "expressions shall have the meanings hereby respectively assigned to them, that is to say__\n(a)        “Collector” means any officer appointed by Government to discharge\nthroughout any specified local area the functions of a Collector under this\nOrdinance;\n(b)        “excise officer” means an officer of the Excise Department not below the rank\nof a Sub-Inspector;\n(c)        “Government” means the Government of West Pakistan;\n(d)        “opium” means any product of opium obtained by any series of operations\ndesigned to transform opium into an extract suitable for smoking, and the dross\nor other residue remaining after opium is smoked, and includes Chandu,\nMadhak and every other preparation or admixture of opium which may be used\nfor smoking; and\n(e)        “place” includes a building, house, shop, booth, chhaper, tent, vessel, raft and\nvehicle or any part thereof.\n1\nSubs. by the West Pakistan Laws (Extension to Karachi) Ordinance, 1964 (West Pakistan Ordinance No. VII of 1964), s.2 and Schedule."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Prohibition of opium smoking. No person shall manufacture, possess or smoke opium, or",
      "content": "possess any implement or apparatus used, or capable of being used, exclusively for the manufacture\nof opium, or any pipe or utensil for smoking opium."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Offences and punishments. Whoever contravenes the provisions of section 3 of this",
      "content": "Ordinance, shall be punished with simple or rigorous imprisonment for a term which may extend to\ntwo years or with fine which may extend to two thousand rupees or with both."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Penalty when owner fails to give notice of use of place for opium. Whoever, being an",
      "content": "occupier or owner of, or having any concern in, the management of any place, permits such place to\nbe used, or knowing or having reason to believe that such place is being or is about to be used for the\npurposes of opium smoking or manufacture of opium in contravention of the provisions of this\nOrdinance, fails either himself or through his agent or manager to give the earliest possible notice of\nsuch knowledge or belief to the Collector or to an excise officer or to the officer in charge of the nearest\npolice-station, shall be punished with fine which may extend to five hundred rupees."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Penalty for keeping or using a place used for opium smoking. Whoever keeps or uses",
      "content": "any place or permits any place to be kept or used for the purposes of opium smoking or manufacture\nor possession of opium or has in his care or management, or in any way assists in conducting the\nbusiness of, any place used or kept for the aforesaid purposes, shall be punished with simple or rigorous\nimprisonment for a term which may extend to one year, or with fine which may extend to one thousand\nrupees, or with both."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Penalty for offences not otherwise provided for. Whoever is guilty of any act or intentional",
      "content": "omission in contravention of any of the provisions of this Ordinance and not otherwise provided for\nherein shall be punished for every such act or omission with a fine which may extend to two hundred\nrupees."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Presumption raised by presence of opium smoking appliances. Whenever any person is",
      "content": "found in possession of any pipes or utensils ordinarily used for opium smoking or of any apparatus\nused in the manufacture of opium, it shall be presumed, unless the contrary is proved, that he has\nmanufactured or smoked opium."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Search warrants and powers to search. If a Collector, a District Magistrate, a Sub",
      "content": "Divisional Magistrate or a Magistrate of the first class, upon information received and after such\ninquiry, if any, as he considers necessary, has reason to believe that any place is being or is likely to\nbe used for the commission of an offence punishable under section 4,5 or 6 he may issue a warrant to\nan excise officer authorising him__\n(a)     to enter and search such place by day or night, accompanied by any person\nwhose assistance such officer may consider necessary for the discovery of any\nopium or any appliance for the preparation of opium or for opium smoking in\nsuch place;\n(b)     to arrest and search all or any such persons as may be found in such place and\nreasonably believed by the excise officer to be guilty of an offence punishable\nunder this Ordinance, whether they are actually engaged in opium smoking or\nnot; and\n(c)     to seize all appliances for opium smoking or for the manufacture of opium\nwhich may be found in such place."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Powers of excise officers to search without warrant. (1) Whenever an excise officer has",
      "content": "reason to believe that an offence punishable under section 4,5 or 6 has been, is being or is about to be\ncommitted in any place and that a search warrant under section 9 cannot be obtained without affording\nthe offender an opportunity of escape or of concealing evidence of the offence, he may, at any time,\nafter recording his reasons, take such action as he could have taken if a warrant in respect of the said\noffence had been issued to him under section 9.\n(2) The excise officer taking any action under sub-section (1) shall, as soon as possible, intimate\nin writing the action taken and the grounds of his belief to the Magistrate having jurisdiction in the\nplace."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Procedure for arrest, etc. The provisions of the Code of Criminal Procedure, 1898 (V of",
      "content": "1898), relating to arrest, detention in custody, execution of warrants and searches shall be applicable\nto all actions taken in these respects by an excise officer under this Ordinance."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Special powers of excise officer. (1) Government may, by notification, invest any excise",
      "content": "officer, by virtue of his appointment, with power to investigate any offence punishable under this\nOrdinance committed within the limits of the area in which such officer exercises jurisdiction.\n(2) Every excise officer empowered under sub-section (1) may, within the said limits, exercise,\nas far as may be, the same powers in respect of such investigation as an officerincharge of a police\nstation may exercise in a cognizable case under the provisions of Chapter XIV of the Code of Criminal\nProcedure, 1898 (V of 1898)."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Bail and security. When any person arrested under this Ordinance is prepared to furnish",
      "content": "bail, he shall be released on bail or, at the discretion of the officer making the arrest, on his own bond."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Aid to excise officer. Every officer of the Police and Revenue Department shall be bound",
      "content": "upon request made in that behalf to render lawful aid to any excise officer while acting under the\nprovisions of this Ordinance."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Confiscation and destruction of opium and things seized. Any implement or apparatus",
      "content": "used or capable of being used exclusively for the manufacture of opium and any pipe or utensil for\nsmoking opium, wherever found, shall be confiscated and destroyed under the orders of a Magistrate\nhaving jurisdiction in the area where such implement, apparatus, pipe or utensil is found."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Offences to be triable by first class Magistrate only. No Magistrate other than a",
      "content": "Magistrate of the first class shall try any offence punishable under this Ordinance."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Bar of suits and proceedings. No suit or proceedings shall lie in any civil or criminal court",
      "content": "for any act in good faith done or ordered to be done in pursuance of this Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "Collector",
      "definition": "any officer appointed by Government to discharge throughout any specified local area the functions of a Collector under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "excise officer",
      "definition": "an officer of the Excise Department not below the rank of a Sub-Inspector;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Government of West Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "opium",
      "definition": "any product of opium obtained by any series of operations designed to transform opium into an extract suitable for smoking, and the dross or other residue remaining after opium is smoked, and includes Chandu, Madhak and every other preparation or admixture of opium which may be used for smoking; and",
      "source_provision": "sec2"
    },
    {
      "term": "place",
      "definition": "a building, house, shop, booth, chhaper, tent, vessel, raft and vehicle or any part thereof. 1 Subs. by the West Pakistan Laws (Extension to Karachi) Ordinance, 1964 (West Pakistan Ordinance No. VII of 1964), s.2 and Schedule.",
      "source_provision": "sec2"
    }
  ]
}
