{
  "id": "pk-west-pakistan-redemption-and-restitution-of-mortgaged-lands-act-1964",
  "type": "statute",
  "title": "West Pakistan Redemption and Restitution of Mortgaged Lands Act, 1964",
  "title_en": "West Pakistan Redemption and Restitution of Mortgaged Lands Act, 1964",
  "short_name": "WPRAR",
  "status": "in_force",
  "issued_date": "1964-04-03",
  "in_force_date": "1964-04-03",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tkag%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Redemption and Restitution of Mortgaged Lands Act, 1964 (XIX of 1964) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Act may be called the West Pakistan",
      "content": "Redemption and Restitution of Mortgaged Lands Act, 1964.\n(2) It extends to the whole of the Province of West Pakistan, except the Tribal Areas.\n(3) It shall come into force in such areas and from such dates as Government may, by\nnotification in the official Gazette, direct."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless the context otherwise requires, the following expressions",
      "content": "shall have the meaning hereby respectively assigned to them, that is to say__\n(a)    “Board of Revenue” means the Board of Revenue established under the West\nPakistan Board of Revenue Act, 1957;\n(b)    “Collector” means the Collector of the District in which the mortgaged land or\nany part thereof is situated, and shall include any Revenue Officer specially\nempowered by the Board of Revenue to perform the duties of a Collector for\nthe purposes of this Act;\n(c)    “Commissioner” means the Commissioner of the Division in which the\nmortgaged land or any part thereof is situated, and shall include any Officer\nspecially empowered by the Board of Revenue to perform the duties of a\nCommissioner for the purposes of this Act;\n(d)    “Government” means the Government of West Pakistan;\n(e)    “land” means land which is not occupied as the site of any building in a town or\nvillage and is occupied or let for agricultural purposes or for purposes\nsubservient to agriculture or for pasture, and includes: __\n(i)     the sites of buildings and other structures on such land;\n(ii)    a share in the profits of an estate or holding;\n(iii)   a right to receive rent;\n(iv)    any right to water enjoyed by the owner or occupier of land as such; and\n(v)     all trees standing on such land;\n(f)    “mortgagor” or “mortgagee” includes the assignee and the representative-in\ninterest of such “mortgagor” or “mortgagee” as the case may be;\n(g)    “prescribed” means prescribed by rules made under this Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Petition for redemption. After the principal money becomes due and before a suit for",
      "content": "redemption is barred, a mortgagor of land not exceeding fifty acres in area or of land the principal\nmoney secured by which does not exceed five thousand rupees, may apply to the Collector for an order\ndirecting that the mortgage be redeemed and that he be put in possession.\nExplanation I__ The area of any share in the common land of the village or of a sub-division\nappertaining thereto and mortgaged with the land, shall not be taken into consideration while\ndetermining the area of the land mortgaged.\nExplanation II__ This section shall not apply to usufructuary mortgage effected for a specific\nnumber of years and intended to terminate without the repayment of any part of its consideration."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Deposit of amount due under mortgage. The mortgagor shall in his application declare",
      "content": "what sum is to the best of his knowledge due under the mortgage and deposit such sum with the\nCollector at the time of making the application."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Powers of Collector to order ejectment. Where the Collector, after hearing the mortgagee",
      "content": "and holding such enquiry as may be prescribed, is satisfied that the mortgagor has a right to redeem\nand has deposited or is prepared to pay the sum which the Collector finds due under the mortgage, he\nshall make an order directing that the mortgage be redeemed."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Directions that the Collector shall make when ordering ejectment. (1) Where the",
      "content": "Collector makes an order for the redemption of a mortgage, and the whole of the mortgage amount\nfound due has been deposited with him, the order shall direct that such amount be paid to the mortgagee\nand the excess amount, if any, deposited by the mortgagor be refunded to him.\n(2) Where the whole of the mortgage amount found due has not been deposited, the order for\nthe redemption of the mortgage shall direct__\n(a)       that a sum which together with the sum already deposited will equal the\nmortgage amount found due be deposited with the Collector by the mortgagor\nwithin thirty days or within such further period as may be specified by the\nCollector in this behalf;\n(b)       that on deposit of such amount together with costs, if any, the mortgage shall be\nextinguished and the mortgagee shall deliver possession of the mortgaged land\nto the mortgagor, whose title thereto shall be deemed to have accrued from the\ndate of such deposit; and\n(c)       that the mortgage amount found due by the Collector and deposited by the\nmortgagor, together with costs, if any, be paid to the mortgagee.\n(3) If the mortgage amount and the costs (if any) are not deposited within the period specified\nin sub-section (1), the petition shall be dismissed with costs."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Saving of suits to establish rights. Any party aggrieved by an order of the Collector passed",
      "content": "under section 5 or 6, may institute a suit to establish his rights in respect of the mortgage; but, subject\nto the result of such suit, if any, the order shall be conclusive.\n1\n[Provided that notwithstanding the provisions of Article 14 of Schedule I of the Limitation Act\nof 1908, a mortgagor may file a suit for the redemption of his mortgaged land within the unexpired\nperiod of limitation fixed by law for the redemption of the mortgaged lands.]"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. No second petition. The dismissal of a petition under this Chapter shall bar any further",
      "content": "petition under this Chapter by the same petitioner or his representative in interest in respect of the same\nmortgage."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Cessation of interest. When the petitioner has deposited with the Collector the sum declared",
      "content": "by the Collector to be due on the mortgage, and such sum is accepted by the mortgagee, or is found by\ndeposit."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Petition for restitution. The mortgagor of any subsisting usufructuary mortgage not less",
      "content": "than twenty years old, or of any usufructuary mortgage the period whereof has expired, may present a\npetition to the Collector for the restitution of possession of the mortgaged land.\nExplanation. A mortgage shall be deemed to subsist for the purposes of this Chapter\nnotwithstanding a decree or order for its redemption having been passed; provided that redemption has\nnot taken place before the presentation of a petition under this section.\n1\nAdded by West Pakistan Act No. VII of 1967."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Petition when to be dismissed. Where the Collector is satisfied that a petition is not in",
      "content": "respect of a subsisting usufructuary mortgage not less than twenty years old, or a usufructuary\nmortgage the period whereof has expired, he shall dismiss the petition, recording his reasons for such\norder."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power of Collector to declare and enforce orders in favour of mortgagor. If the",
      "content": "Collector finds that the application is in respect of mortgaged land the possession whereof has\nremained with the mortgagee for a period of not less than twenty years, or is in respect of mortgaged\nland the term of the mortgage whereof has expired, he shall notwithstanding anything contained in any\nother enactment for the time being in force or any contract or decree or order of any Court, __\n(a)     order that the mortgage shall be extinguished without payment of the mortgage\nmoney or any part thereof;\n(b)     in case of an express contract to the effect that the mortgagee shall be entitled\nto compensation for improvements made by him in the mortgaged land\ndetermine the amount of such compensation; and\n(c)     where the mortgagee is in possession, direct that the mortgagor be put into\npossession of the mortgaged land as against the mortgagee and that the title\ndeeds, if any, of such land in the possession of the mortgagee be restored to the\nmortgagor."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Effect of order of restitution when compensation is payable. If the Collector finds that",
      "content": "any sum is due to the mortgagee by way of compensation under clause (b) of section 12, he shall\nrequire the mortgagor to deposit the amount in such manner as may be prescribed; and on deposit of\nthe amount he shall declare the rights of the mortgagee extinguished and require the mortgagee to\ndeliver possession of the land to the mortgagor together with all documents of title relating to the land:\nProvided that if a petitioner fails to deposit the amount within six months, his petition may be\ndismissed."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Appeals. (1) Save as otherwise provided by this Act, an appeal shall lie from an original",
      "content": "order of the Collector to the Commissioner.\n(2) Save as otherwise provided by this Act, an appeal shall lie to the Board of Revenue from\nevery order passed in appeal by the Commissioner, on any one of the following grounds, namely: __\n(a)     the decision being contrary to law or to some usage having the force of law;\n(b)     the decision having failed to determine some material issue of law or usage\nhaving the force of law;\n(c)     a substantial error or defect in the procedure provided by this Act or by any\nother law for the time being in force, which possibly have produced an error or\ndefect in the decision of the case."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Revision. (1) The Board of Revenue may at any time call for the record of any case pending",
      "content": "before, or disposed of by, any Revenue Officer subordinate to it.\n(2) A Commissioner may call for the record of any case pending before, or disposed of by, any\nRevenue Officer under his control.\n(3) The Board of Revenue may in any case called for under sub-section (1) and a Commissioner\nmay in any case called for under sub-section (2) pass such order as it or he thinks fit:\nProvided that no order shall be passed under this section reversing or modifying any\nproceedings or order of a subordinate Revenue Officer and affecting any question of right between\nprivate persons without giving those persons an opportunity of being heard."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Limitation for appeals. (1) The period of limitation for an appeal under section 14 shall",
      "content": "run from the date of the order appealed against, and shall be__\n(i)     sixty days, when the appeal lies to the Commissioner;\n(ii)    ninety days, when the appeal lies to the Board of Revenue.\n(2) In computing the period of limitation for an appeal under this section, the period requisite\nfor obtaining copies of the order appealed against shall be excluded.\n(3) The provisions of section 5 of the Limitation Act, 1908, shall apply to appeals under this\nChapter."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Jurisdiction of Civil Court barred. No Civil Court shall have jurisdiction to entertain any",
      "content": "claim or enforce any right under a mortgage declared extinguished under this Chapter or to question\nthe validity of any proceedings under this Chapter."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Collector’s powers to deliver possession. (1) On redemption or extinguishment of a",
      "content": "mortgage under this Act the Collector shall eject the mortgagee and deliver possession of the\nmortgaged land to the mortgagor.\n(2) In case of resistance, the Collector may exercise all the powers conferred on a Civil Court\nby rules 97 and 98 of Order XXI of the Code of Civil Procedure, 1908 (V of 1908)."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Collector to have certain powers of Civil Courts. (1) For the purpose of any proceeding",
      "content": "under this Act the Collector shall have the same powers as are vested by the Code of Civil Procedure,\n1908 (V of 1908), in a court trying a civil suit and in particular powers in respect of__\n(a)     discovery and inspection;\n(b)     enforcing the attendance of witnesses and requiring the deposit of their\nexpenses;\n(c)     compelling the production of documents;\n(d)     examining witnesses on oath;\n(e)     granting adjournments;\n(f)     receiving evidence taken on affidavit;\n(g)     issuing commissions for the examination of witnesses; and\n(h)     summoning and examining suo motto any person whose evidence appears to\nbe material."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Application of Civil Procedure Code in certain matters. (1) Save as in this Act otherwise",
      "content": "expressly provided the provisions of the Code of Civil Procedure, 1908, relating to recognised agents\nand pleaders, issue and service of summons, verification of plaints, costs and appearance of parties and\nconsequences of non-appearance, shall apply to all proceedings under this Act.\n(2) Notwithstanding anything contained in the last preceding sub-section, the Collector may\ndirect that a summons or proclamation may be sent by registered post and on proof of the fact that a\nsummons or proclamation has been forwarded in a letter properly addressed and duly posted and\nregistered, he may presume that the summons or proclamation was served at the time when the letter\nwould be delivered in the ordinary course of post."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Return of deposit. If the Collector dismisses a petition under this Act, he shall order that",
      "content": "the sum deposited by the petitioner be returned to him."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Deposit not to be attached. No sum deposited with the Collector by a petitioner under the",
      "content": "provisions of this Act shall be attached by any Court or Revenue Officer."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Power to make rules. (1) The Board of Revenue may, with the approval of Government",
      "content": "and after previous publication make rules for the purpose of giving effect to the provisions of this Act.\n(2) In particular and without prejudice to the generality of the foregoing power, the Board of\nRevenue may make rules regulating or determining the following matters, namely: __\n(a)     the presentation of petitions;\n(b)     the procedure before the Collector;\n(c)     the manner in which the Collector shall assess compensation;\n(d)     the principles on which the Collector shall assess the amount due under the\nmortgage;\n(e)     the procedure for making deposit; and\n(f)     the procedure for ejecting the mortgagee and delivering possession of the\nmortgaged property to the mortgagor."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Repeal and savings. (1) The following enactments are hereby repealed:",
      "content": "(a)    The Redemption of Mortgages (Punjab) Act, 1913 (Punjab II of 1913);\n(b)    The Redemption of Mortgages (Punjab) Act, 1913 (Punjab II of 1913), as\napplicable to the former State of Bahawalpur;\n(c)    The North-West Frontier Province Redemption of Mortgages Act, 1935\n(N.W.F.P III of 1935);\n(d)    The Punjab Restitution of Mortgaged Lands Act, 1938 (Punjab IV of 1938);\n(e)    The Punjab Restitution of Mortgaged Lands Act, 1938 (Punjab IV of 1938), as\napplicable to the former State of Bahawalpur; and\n(f)    The North-West Frontier Province Restitution of Mortgaged Lands Act, 1950\n(N.W.F.P XXXII of 1950).\n(2) Notwithstanding the repeal of the enactments mentioned in sub-section (1), all proceedings\ncommenced, rules framed, orders made and other acts done under any of the repealed enactments,\nshall, if not inconsistent with the provisions of this Act, so far as may be, be deemed to have been\nrespectively commenced, framed, made and done under this Act.\n_______\nRGN Date: 26-05-2025"
    }
  ],
  "definitions": [
    {
      "term": "Board of Revenue",
      "definition": "the Board of Revenue established under the West Pakistan Board of Revenue Act, 1957;",
      "source_provision": "sec2"
    },
    {
      "term": "Collector",
      "definition": "the Collector of the District in which the mortgaged land or any part thereof is situated, and shall include any Revenue Officer specially empowered by the Board of Revenue to perform the duties of a Collector for the purposes of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Commissioner",
      "definition": "the Commissioner of the Division in which the mortgaged land or any part thereof is situated, and shall include any Officer specially empowered by the Board of Revenue to perform the duties of a Commissioner for the purposes of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Government of West Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "land",
      "definition": "land which is not occupied as the site of any building in a town or village and is occupied or let for agricultural purposes or for purposes subservient to agriculture or for pasture, and includes: __ (i) the sites of buildings and other structures on such land; (ii) a share in the profits of an estate or holding; (iii) a right to receive rent; (iv) any right to water enjoyed by the owner or occupier of land as such; and (v) all trees standing on such land;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act.",
      "source_provision": "sec2"
    }
  ]
}
