{
  "id": "pk-west-pakistan-relief-of-indebtedness-ordinance-1960",
  "type": "statute",
  "title": "West Pakistan Relief of Indebtedness Ordinance, 1960",
  "title_en": "West Pakistan Relief of Indebtedness Ordinance, 1960",
  "short_name": "WPROI",
  "status": "in_force",
  "issued_date": "1960-04-26",
  "in_force_date": "1960-04-26",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tjaQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Relief of Indebtedness Ordinance, 1960 (XV of 1960) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Repeal",
      "content": "WEST PAKISTAN ORDINANCE No. of 1960\n[27th April, 1960]\nAN\nto amend and consolidate the law relating to the relief of indebtedness in the Province of West\nPakistan.\nPreamble. WHEREAS it is expedient to amend and consolidate the law relating to the relief\nof indebtedness in the Province of West Pakistan;\nNOW, THEREFORE, in pursuance of the Presidential Proclamation of the seventh day of\nOctober, 1958, and having received the previous instructions of the President, the Governor of West\nPakistan is pleased, in exercise of all powers enabling him in that behalf, to make and promulgate the\nfollowing Ordinance:__"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent. (1) This Ordinance may be called the West Pakistan Relief of",
      "content": "Indebtedness Ordinance, 1960.\n1\n[(2) It extends to the whole of the Province of West Pakistan, except the Tribal Areas.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless the context otherwise requires, the following",
      "content": "expressions shall have the meanings hereby respectively assigned to them, that is to say__\n(a)        “Court” or “Civil Court” includes a Court of insolvency, a receiver appointed\nunder the Provincial Insolvency Act, 1920 (V of 1920), and an arbitrator\nappointed with the consent of the parties or by an order of a Court;\n(b)        “debt” includes all liabilities of a debtor in cash or in kind, secured or unsecured,\npayable under a decree or order of a Civil Court or otherwise, whether mature\nor not, but shall not include debts incurred for the purposes of trade, arrears of\nwages, land-revenue or anything recoverable as arrears of land-revenue, or taxes\nor rates payable to Government or any local authority, or any debt which is\nbarred by the law of limitation or a debt due to a co-operative bank, co-operative\nsociety or any banking company registered under the Companies Act, 1913(VII\nof 1913), or any bank which is a “scheduled bank” as defined in the State Bank\nof Pakistan Act, 1956(XXXIII of 1956);\n(c)        “debtor” means a person who owes a debt; and__\n(i)       who both earns his livelihood mainly by agriculture and is either a land-\nowner or tenant of agricultural land; or\n(ii)      who earns his livelihood as a village artisan paid in cash or kind for work\nconnected with agriculture; or\n1\nSubs. by the West Pakistan Laws (Extension to Karachi) Ordinance, 1964 (W. P. Ord. No. VII of 1964), s. 2.\n(iii)   whose total assets do not exceed five thousand rupees;\nExplanation.__ A debtor shall not lose his status as such;\n(i)     through involuntary unemployment or on account of incapacity,\ntemporary or permanent, by bodily infirmity, or, if he is or has been in\nthe Armed Forces of Pakistan, only on account of his pay and allowances\nor pension exceeding his income from agricultural sources;\n(ii)    by reason of the fact that he derives income by using his plough cattle\nfor purposes of transport;\n(iii)   only because he does not cultivate with his own hands;\n(d)     “interest” means rate of interest and includes the return to be made over and\nabove what was actually lent whether the same is charged or sought to be\nrecovered specifically by way of interest or otherwise."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Powers of the Court to limit interest recoverable in certain cases. Notwithstanding",
      "content": "anything contained in any agreement or any law for the time being in force, no Court shall pass or\nexecute a decree or give effect to an award in respect of a debt for a larger sum than twice the amount\nof the sum found by the Court to have been actually advanced less any amount already received by the\ncreditor."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Deposit in Court. (1) Any person who owes money may at any time deposit in Court a sum",
      "content": "of money in full or part payment to his creditor.\n(2) The Court, on receipt of such deposit, shall give notice thereof to the creditor and shall, on\nhis application, pay the sum to him.\n(3) From the date of such deposit, interest shall cease to run on the sum so deposited."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Immunity from arrest. No debtor shall be arrested or imprisoned in execution of a decree",
      "content": "for money, whether passed before or after the commencement of this Ordinance."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Exemption from the provisions of Order XXI, Rule 2(3) of the Civil Procedure Code",
      "content": "Nothing in Order XXI, Rule 2, sub-rule (3) of the Code of Civil Procedure, 1908(V of 1908), shall\napply to an adjustment or payment made by a debtor."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Exemption of houses, etc., from attachment or sale. Notwithstanding anything contained",
      "content": "in the Code of Civil Procedure, 1908(V of 1908), the houses and other buildings (with the materials\nand the sites thereof and the land immediately appurtenant thereto and necessary for their enjoyment)\nbelonging to a debtor, shall not be liable to attachment or sale in execution of any decree, if such houses\nand other buildings are not proved by the decree holder to have been let out on rent or lent to persons\nother than the debtor’s father, mother, wife, son, daughter, daughter-in-law, brother, sister or other\ndependent or left vacant for a period of a year or more:\nProvided that the protection afforded by this section shall not extend to any property\nspecifically charged with the debt sought to be recovered."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Exemption of milch animals, etc., from attachment or sale. Notwithstanding anything",
      "content": "contained in the Code of Civil Procedure, 1908(V of 1908), milch animals, whether in milk or in calf,\nkids, calves, animals used for the purpose of transport or draught, carts and open spaces or enclosures\nrequired by the debtor in case of need for tying cattle, parking carts or stacking fodder or manure shall\nnot, if they belong to a debtor, be liable to attachment or sale in execution of any decree."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Agreement for waiving exemption void. Notwithstanding any other law for the time being",
      "content": "in force any agreement by which a debtor agrees to waive any benefit of any exemption under section\n7 or 8 shall be void."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Powers of Court to order payment of amount due on mortgage by instalments",
      "content": "Notwithstanding anything contained in any law for the time being in force or in any contract, a Court\nmay, at the time of passing a decree in any suit relating to a mortgage by which any loan is secured,\norder that payment of any amount decreed in such suit shall be made in such number of instalments\nand on such dates and subject to such conditions as, having regard to the circumstances of the debtor\nand the amount of the decree, it considers fit."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Powers of Court to direct payment of amount decreed by instalments. Notwithstanding",
      "content": "anything contained in any law for the time being in force or in any contract, a Court may, at any time,\non the application of a judgment debtor, after notice to the decree holder, direct that the amount of any\ndecree, whether passed before or after the commencement of this Ordinance, in respect of a debt,\nincluding any decree in a suit relating to a mortgage by which any loan is secured, shall be paid in such\nnumber of instalments and on such dates and subject to such conditions as, having regard to the\ncircumstances of the judgment debtor and the amount of the decree, it considers fit."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Interest after the commencement of this Ordinance. Government may, by notification",
      "content": "in the Official Gazette, direct that in any specified area no debtor shall be charged interest on any debt\nincurred by him after the date of the notification at a rate higher than that specified in the notification."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Power to make rules. (1) Government may, after previous publication, make rules for",
      "content": "carrying into effect the provisions of this Ordinance.\n(2) In particular and without prejudice to the generality of the foregoing powers such rules may\nprovide__\n(a)     for determining the Court into which moneys may be deposited under the\nprovisions of section 4;\n(b)     for the procedure for keeping accounts of such deposits and the manner in which\nnotices are to be served on creditors and payments made to them."
    }
  ],
  "definitions": [
    {
      "term": "debt",
      "definition": "all liabilities of a debtor in cash or in kind, secured or unsecured, payable under a decree or order of a Civil Court or otherwise, whether mature or not, but shall not include debts incurred for the purposes of trade, arrears of wages, land-revenue or anything recoverable as arrears of land-revenue, or taxes or rates payable to Government or any local authority, or any debt which is barred by the law of limitation or a debt due to a co-operative bank, co-operative society or any banking company registered under the Companies Act, 1913(VII of 1913), or any bank which is a “scheduled bank” as defined in the State Bank of Pakistan Act, 1956(XXXIII of 1956);",
      "source_provision": "sec2"
    },
    {
      "term": "debtor",
      "definition": "a person who owes a debt; and__ (i) who both earns his livelihood mainly by agriculture and is either a land- owner or tenant of agricultural land; or (ii) who earns his livelihood as a village artisan paid in cash or kind for work connected with agriculture; or 1 Subs. by the West Pakistan Laws (Extension to Karachi) Ordinance, 1964 (W. P. Ord. No. VII of 1964), s. 2. (iii) whose total assets do not exceed five thousand rupees; Explanation.__ A debtor shall not lose his status as such; (i) through involuntary unemployment or on account of incapacity, temporary or permanent, by bodily infirmity, or, if he is or has been in the Armed Forces of Pakistan, only on account of his pay and allowances or pension exceeding his income from agricultural sources; (ii) by reason of the fact that he derives income by using his plough cattle for purposes of transport; (iii) only because he does not cultivate with his own hands;",
      "source_provision": "sec2"
    },
    {
      "term": "interest",
      "definition": "rate of interest and includes the return to be made over and above what was actually lent whether the same is charged or sought to be recovered specifically by way of interest or otherwise.",
      "source_provision": "sec2"
    }
  ]
}
