{
  "id": "pk-west-pakistan-requisitioning-of-stage-carriages-temporary-ordinance-1970",
  "type": "statute",
  "title": "West Pakistan Requisitioning of Stage Carriages (Temporary) Ordinance, 1970",
  "title_en": "West Pakistan Requisitioning of Stage Carriages (Temporary) Ordinance, 1970",
  "short_name": "WPROS",
  "status": "in_force",
  "issued_date": "1970-04-29",
  "in_force_date": "1970-04-29",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tkbQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Requisitioning of Stage Carriages (Temporary) Ordinance, 1970 (XIII of 1970) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Power to make rules",
      "content": "CARRIAGES (TEMPORARY POWERS) ORDINANCE, 1970.\nWEST PAKISTAN ORDINANCE No. XIII of 1970\n[30th April, 1970]\nAN\nto provide for requisitioning of stage carriages.\nPreamble. WHEREAS it is expedient to make provision for temporary requisitioning of stage\ncarriages;\nNOW, THEREFORE, in pursuance of the Martial Law Proclamation of 25th March, 1969,\nread with the Provisional Constitution Order, and in exercise of all powers enabling him in that behalf,\nthe Governor of West Pakistan is pleased to make and promulgate the following Ordinance:__"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Ordinance may be called the West Pakistan",
      "content": "Requisitioning of Stage Carriages (Temporary Powers) Ordinance, 1970.\n(2) It shall extend to the whole of West Pakistan, except the Tribunal Areas.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. The words and expressions used in this Ordinance shall have the same meaning",
      "content": "as is assigned to them in the West Pakistan Motor Vehicles Ordinance, 1965 (West Pakistan Ordinance\nXIX of 1965)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Requisitioning of motor vehicles. (1) If in the opinion of the District Magistrate it is",
      "content": "necessary or expedient for maintenance of passenger transport service, to requisition any motor vehicle\nwhich was used or is being used as a stage carriage, he may by order in writing, requisition such motor\nvehicle maintained or kept within his jurisdiction, after giving the owner thereof an opportunity of\nbeing heard and showing cause against the proposed action.\nExplanation:____Where the owner of a motor vehicle to whom opportunity to show cause as\nrequired under sub-section (1) is to be given, cannot be found and has no agent\nor other person to accept service on his behalf, the District Magistrate shall\ncause notice to be affixed on the motor vehicle itself or on some conspicuous\npart of his place of business or residence.\n(2) Where the District Magistrate has requisitioned any motor vehicle under sub-section (1),\nthe same may be maintained and used as stage carriage in such manner as may appear to him to be\nexpedient."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Appeal. (1) The owner aggrieved by an order of the District Magistrate under sub",
      "content": "section\n(1) of section 3, may within seven days of the order, appeal to the Commissioner.\n(2) The order of the Commissioner on appeal shall be final."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Power to give effect to orders. The District Magistrate may take or cause to be taken such",
      "content": "steps and use or cause to be used such force as may in his opinion be reasonable and necessary for\nsecuring compliance of any order made by him under this Ordinance."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to search and seize. The District Magistrate may enter and search or authorize any",
      "content": "person to enter and search any premises and seize or authorize any person to seize any motor vehicle\nin respect of which he has reason to believe that a contravention of the provisions of this Ordinance\nhas been or is likely to be committed."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Permit not necessary. Notwithstanding anything contained in the West Pakistan Motor",
      "content": "Vehicles Ordinance, 1965 (West Pakistan Ordinance XIX of 1965), or any other law for the time being\nin force, no permit for running a motor vehicle requisitioned under section 3 shall be required."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Payment of repair charges, taxes, etc. The District Magistrate may in respect of any motor",
      "content": "vehicle requisitioned under sub-section (1) of section 3, incur expenses for maintenance and repairs\nand pay fees, taxes and insurance premiums payable under any law for the time being in force."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Compensation. Where any motor vehicle is requisitioned under sub",
      "content": "section (1) of section 3,\nthere shall be paid to the owner compensation for its use at the rate of rupees fifty per diem,\nnotwithstanding any expenditure incurred by the District Magistrate under the provisions of section 8."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Sabotage. (1) No person shall do any act with intent to impair the efficiency or impede the",
      "content": "working of, or to cause damage to, any motor vehicle liable to requisition under section 3.\n(2) Without prejudice to the generality of the provisions of sub-section (1), no person shall__\n(a)     remove a vehicle or cause or allow it to be removed from the locality in which\nit is being kept except in accordance with an order in writing of the District\nMagistrate;\n(b)     remove from the vehicle any part, accessory, tyre or tube, except for the purpose\nof repairing it, or of replacing it by another not less serviceable, or of repairing\nthe vehicle or in accordance with an odrer in writing of the District Magistrate."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Penalty. Whoever contravenes the provisions of this Ordinance he shall be punished with",
      "content": "imprisonment of either description for a term which may extend to one year or with fine or with both."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Release from requisition. (1) Where any motor vehicle requisitioned under section 3 is to",
      "content": "be released from requisition, the District Magistrate shall arrange the restoration of the possession of\nthe vehicle to its owner.\n(2) Where the owner of the motor vehicle to whom possession is to be given cannot be found\nand has no agent or other person empowered to accept delivery of possession on his behalf the District\nMagistrate shall cause a notice declaring that the motor vehicle is released from requisition to be\naffixed on some conspicuous part of his place of business or residence.\n(3) When a notice referred to under sub-section (2) is served in the manner indicated, the motor\nvehicle specified in the notice shall cease to be subject to requisition on and from the date of such\nservice and shall be deemed to have been delivered to the owner and the District Magistrate shall not\nbe liable for any compensation or other claim in respect of the same for any period after the said date."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Jurisdiction of courts barred. (1) No injunction or an order for delivery of possession or",
      "content": "appointment of a receiver in respect of any motor vehicle which has been requisitioned under this\nOrdinance shall be granted or be made by any court or by any other authority.\n(2) No order made in exercise of any power conferred by or under this Ordinance shall be called\nin question in any court.\n(3) Where an order purports to have been made and signed by the authority in exercise of any\npower conferred by or under this Ordinance it shall be presumed that such an order was so made by\nthat authority."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Protection of actions under this Ordinance. (1) No suit, prosecution or other legal",
      "content": "proceeding shall lie against any person for anything which is, in good faith, done or intended to be\ndone in pursuance of this Ordinance or any order made thereunder.\n(2) Save as other expressly provided under this Ordinance no suit or other legal proceedings\nshall lie against the District Magistrate for any damage caused or likely to be caused by anything, in\ngood faith, done or intended to be done in pursuance of this Ordinance or any order made thereunder."
    }
  ],
  "definitions": []
}
