{
  "id": "pk-west-pakistan-requistioned-land-continuance-act-1958",
  "type": "statute",
  "title": "West Pakistan Requistioned Land (Continuance) Act, 1958",
  "title_en": "West Pakistan Requistioned Land (Continuance) Act, 1958",
  "short_name": "WPRLA",
  "status": "in_force",
  "issued_date": "1958-04-18",
  "in_force_date": "1958-04-18",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tmbw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Requistioned Land (Continuance) Act, 1958 (XXX of 1958) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Act may be called the West Pakistan",
      "content": "Requisitioned Land (Continuance) Act, 1958.\n(2) It extends to the whole of West Pakistan, except 1[* * *] 2[the Tribal Areas].\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context",
      "content": "(i)        “Government” means the Government of West Pakistan ;\n(ii)       “Requisitioned land” means immovable property requisitioned under the rules\nmade under the Defence of India Act, 1939, which immediately before the\ncommencement of this Act continues to be under requisition; and\n(iii)      “State” means the 2[Federal] or the Provincial Government, as the case may be,\nfor whom any land has been requisitioned or is acquired."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Continuance of requisitions. Notwithstanding the expiration of the Defence of India Act,",
      "content": "1939 (XXXV of 1939), and the rules made thereunder, the repeal of the Requisitioned Land\n(Continuance of Powers) Ordinance, 1946 (XIX of 1946), the repeal of the Requisitioned Land\n(Continuance of Powers) Act, 1947 (XVII of 1947), the expiration of the Requisitioned Land\n(Continuance of Powers) Ordinance, 1955 (XI of 1955), and the expiry of the West Pakistan\nRequisitioned Land (Continuance of Powers) Act, 1957 (West Pakistan Act II of 1957), all\nrequisitioned lands shall continue to be subject to requisition and the Provincial Government may use\nor deal with any requisitioned land in such manner as may appear to it to be expedient:\nProvided that the Provincial Government may at any time release from requisition any\nrequisitioned land.\n1\nOmitted by W.P. Ordinance No. XXXI of 1962, s. 2.\n2\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Release from requisition. (1) Where any requisitioned land is to be released from",
      "content": "requisition, the Government may, after making such inquiry, if any, as it considers necessary, specify\nby order in writing the person to whom possession of the land shall be given.\n(2) The delivery of possession of the requisitioned land to the person specified in an order made\nunder sub-section (1) shall be a full discharge of the State from all liability in respect of such delivery,\nbut shall not prejudice any rights in respect of the land which any other person may be entitled by due\nprocess of law to enforce against the person to whom possession of the land is so delivered.\n(3) When the person to whom possession of any requisitioned land is to be given cannot be\nfound and has no agent or other person empowered to accept delivery on his behalf, the Government\nshall cause a notice declaring that the land is released from requisition to be affixed on some\nconspicuous part of land and publish the notice in the Official Gazette.\n(4) When a notice referred to in sub-section (3) is published in the Official Gazette, the land\nspecified in such notice shall cease to be subject to requisition on and from the date of such publication\nand be deemed to have been delivered to the person entitled to possession thereof; and the State shall\nnot be liable for any compensation or other claim in respect of the land for any period after the said\ndate."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Powers to acquire requisitioned land. (1) Subject to the provision of sub",
      "content": "section (3), the\nGovernment may, 1[* * * *], at any time when any requisitioned land continues to be subject to\nrequisition under section 3, acquire such land by publishing in the Official Gazette a notice to this\neffect.\n(2) When a notice as aforesaid is published in the Official Gazette, the requisitioned land, shall\non and from the beginning of the day on which the notice is so published, vest absolutely free from all\nencumbrances in the 1[* * *] Government, as the case may be, and the period of requisition of such\nland shall end.\n(3) No requisitioned land shall be acquired under this section except in the following\ncircumstances, namely__\n(a)        where any works have, during the period of requisition, been constructed on, in\nor over the land wholly or partly at the expense of the State and it is considered\nnecessary by the State that the value of, or the right to use, such works should\nbe reserved or secured for the purposes of the State; or\n(b)        where the cost of restoring the land to its condition at the time of its requisition\nwould, in the determination of the State, be excessive having regard to the value\nof the land at that time and the owner declines to accept the release from\nrequisition of the land without payment of compensation.\nExplanation__ “Works” includes buildings, structures and improvements of every description.\n(4) Any decision or determination of the State under sub-section (3) shall be final and shall not\nbe called in question in any Court.\n1\nOmitted by the West Pakistan Laws (Adaptation) Order, 1964, Art. 2 and Sch. (w. e. f. 08-06-1962)."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Payment of compensation. (1) In respect of the continued subjection of requisitioned land",
      "content": "to requisition under this Act, compensation shall be determined and paid in accordance with the\nprovisions of section 19 of the Defence of India Act, 1939 (XXXV of 1939), and of the rules made\nthereunder :\nProvided that for the words 1[Federal Government] wherever occurring in the said section and\nthe rules the words “Provincial Government” shall be deemed to have been substituted for the purpose\nof this section :\nProvided further that all agreements and awards under the said section in respect of the payment\nof compensation for the period of requisition before the expiry of the said Act shall continue to be in\nforce and shall apply to the payment of compensation for the period of requisition after such expiry.\n2\n[(2) In respect of any acquisition of requisitioned land under this Act, the amount of\ncompensation payable shall be determined in accordance with the provisions of the Land Acquisition\nAct, 1894.]\n(3) For the purposes of sub-section (1) all the provisions of the aforesaid section 19 and of the\nrules made thereunder, as amended by this section, shall be deemed to be continuing in force."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power to obtain information. (1) The Government may, with a view to carrying out the",
      "content": "purposes of sections 3 to 6, by order require any person to furnish to such authority as may be specified\nin the order such information in his possession relating to any requisitioned land as may be specified.\n(2) Every person required to furnish such information as is referred to in sub-section (1) shall\nbe deemed to be legally bound to do so within the meaning of sections 176 and 177 of the Pakistan\nPenal Code, 1860 (XLV of 1860)."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Delegation of functions. The Government may, by order notified in the Official Gazette,",
      "content": "direct that any power conferred or any duty imposed on it by this Act shall, in such circumstances and\nunder such conditions, if any, as may be specified in the order, be exercised or discharged by such\nofficers as may be so specified."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Protection of action taken under the Act. (1) No suit, prosecution or other legal proceeding",
      "content": "shall lie against any person for anything which is, in good faith, done or intended to be done in\npursuance of this Act or order made thereunder.\n(2) No suit or other legal proceeding shall lie against the State for any damage caused or likely\nto be caused by anything, in good faith, done or intended to be done in pursuance of this Act or any\norder made thereunder."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Repeal and Saving. (1) The West Pakistan Requisitioned Land (Continuance) Ordinance,",
      "content": "1958, is hereby repealed.\n(2) Notwithstanding the expiry of the West Pakistan Requisitioned Land (Continuance of\nPowers) Act, 1957, everything done, action taken, obligation, liability or penalty incurred, power\nconferred or exercised, orders issued under the said Act and everything deemed to have been done in\nexercise of the powers conferred by or under the said Act, shall be continued and be deemed to have\nbeen respectively done, taken, incurred, conferred, exercised or issued under this Act.\nRGN Date: 12-09-2025\n1\nSubs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table.\n2\nSubs. by W.P. Ordinance No. XXXI of 1962, s. 3."
    }
  ],
  "definitions": [
    {
      "term": "Government",
      "definition": "the Government of West Pakistan ;",
      "source_provision": "sec2"
    },
    {
      "term": "Requisitioned land",
      "definition": "immovable property requisitioned under the rules made under the Defence of India Act, 1939, which immediately before the commencement of this Act continues to be under requisition; and",
      "source_provision": "sec2"
    },
    {
      "term": "State",
      "definition": "the 2[Federal] or the Provincial Government, as the case may be, for whom any land has been requisitioned or is acquired.",
      "source_provision": "sec2"
    }
  ]
}
