{
  "id": "pk-west-pakistan-rice-restrictions-on-cultivation-ordinance-1959",
  "type": "statute",
  "title": "West Pakistan Rice (Restrictions on Cultivation) Ordinance, 1959",
  "title_en": "West Pakistan Rice (Restrictions on Cultivation) Ordinance, 1959",
  "short_name": "WPROC",
  "status": "in_force",
  "issued_date": "1959-12-16",
  "in_force_date": "1959-12-16",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tmbA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Rice (Restrictions on Cultivation) Ordinance, 1959 (LVIII of 1959) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Powers to regulate cultivation of rice. 2[(1)] The Board of Revenue may, by notification,",
      "content": "prohibit or impose such restrictions on the cultivation of rice in such area as may be specified in the\nnotification:\nProvided that a cultivator shall be entitled to gather the standing crop raised by him before the\nissue of such notification.\n2\n[(2) The Board of Revenue or any Officer authorised by it in this behalf may, in the interest\nof operations for reclamation of land, relax, in respect of any specified area, estate or holding, the\nprohibition or all or any of the restrictions imposed on cultivation of rice under sub-section (1), for a\nperiod not exceeding three years.\n1\nSubs. by the West Pakistan Laws (Extension to Karachi) Ordinance, 1964 (West Pakistan Ordinance No. VII of 1964), s. 2 and Schedule.\n2\nOmitted, re-numbered and added by West Pakistan Ordinance No. X of 1969, ss. 2 and 3.\nExplanation.__ For the purposes of this section the expressions “estate” and “holding” shall\nhave the meaning respectively assigned to them in the West Pakistan Land Revenue Act, 1967.]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Penalty. Whoever contravenes the provisions of this Ordinance or the rules made or",
      "content": "directions issued thereunder shall, on a complaint made in writing by any Revenue Officer, be punished\nwith fine which may extend to ten times the land revenue assessment chargeable for the crop or simple\nimprisonment not exceeding six months or both."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Jurisdiction of civil court. No civil court shall have jurisdiction to entertain any claim, suit,",
      "content": "prosecution or any other legal proceedings for anything done, or intended to be done in good faith\nunder the provisions of this Ordinance, or the rules made and directions issued thereunder."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to make rules. For the purposes of carrying into effect the provisions of this",
      "content": "Ordinance, the Board of Revenue may frame rules and issue such directions in the form of Standing\nOrders as it may deem fit.\nRGN-Dated. 20-08-2025"
    }
  ],
  "definitions": []
}
