{
  "id": "pk-west-pakistan-shops-and-establishments-ordinance-1969",
  "type": "statute",
  "title": "West Pakistan Shops and Establishments Ordinance, 1969",
  "title_en": "West Pakistan Shops and Establishments Ordinance, 1969",
  "short_name": "WPSAE",
  "status": "in_force",
  "issued_date": "1969-11-30",
  "in_force_date": "1969-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5pkZw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Shops and Establishments Ordinance, 1969 published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Repeal and saving",
      "content": "1969\nWEST PAKISTAN ORDINANCE No. VIII of 1969\n[3rd June, 1969]\nAN\nto amend and consolidate the law relating to the hours and other conditions of work and employment\nof persons employed in shops and commercial, industrial and other establishments in West Pakistan\nand matters connected therewith.\nPreamble. WHEREAS it is expedient to amend and consolidate the law relating to the hours\nand other conditions of work and employment of persons employed in shops and commercial,\nindustrial and other establishments in West Pakistan and matters connected therewith;\nNOW, THEREFORE, in pursuance of the Martial Law Proclamation of 25th March, 1969,\nread with the Provisional Constitution Order, the Administrator of Martial Law, Zone A, in exercise\nof the powers of the Governor of West Pakistan conferred on him by the Chief Martial Law\nAdministrator, is pleased to make and promulgate the following Ordinance:__"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent, commencement and application",
      "content": "(1) This Ordinance may be called\n(2) It extends to the whole of 1[Pakistan].\n(3) It shall come into force at once in such areas, and its provisions shall automatically apply\nto such establishments or classes thereof, to which any law on the subject was applicable immediately\nbefore the coming into force of this Ordinance.\n(4) Government may, by notification in the official Gazette, extend the operation of this\nOrdinance or any provisions thereof to any other area or establishment, or exclude any area or\nestablishment to which it extends, from its operation."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless the context otherwise requires",
      "content": "(a)        “adult” means a person who has completed his seventeenth year of age;\n(b)        “apprentice” means a person who is employed, whether on payment of wages\nor not, for the purposes of being trained in any trade, craft or employment in\nany establishment;\n(c)        “child” means a person who has not completed his twelfth year of age;\n(d)        “closed” means not open for the service of any customer or to any business\nconnected with the establishment;\n1\nSubs. by the Federal Adaptation of Laws Order, 1975 (P.O. No. 4 of 1975), Article 2 and Schedule.\n(e)   “commercial establishment” means an establishment which carries on any\nbusiness, trade or profession or any work in connection with, or incidental or\nancillary to, any business, trade or profession, and includes__\n(i)     a society registered under the Societies Registration Act, 1860 (XXI of\n1860), and a charitable or other trust, whether registered or not, which\ncarries on, whether for purposes of gain or not, any business, trade or\nprofession, or any work in connection with or incidental or ancillary\nthereto;\n(ii)    an establishment wherein there is conducted the business of advertising,\ncommission, forwarding or a commercial agency;\n(iii)   a clerical department of a factory or of any industrial or commercial\nundertaking;\n(iv)    an insurance company, joint stock company, bank, brokers’ offices or\nexchange and office-of lawyers, income-tax practitioners, registered\naccountants, contractors and engineers.\n(v)     such other professional establishment or class thereof as Government\nmay, by notification in the official Gazette, declare to be commercial\nestablishments for the purposes of this Ordinance;\nbut does not include a factory, shop, residential hotel, restaurant, eating\nhouse, theatre or other place of public amusement or entertainment;\n(f)   “day” means the period of twenty-four hours beginning at mid-night, provided\nthat in the case of an employee, whose hours of work extend beyond mid-night,\nday means the period of twenty four hours beginning when such employment\ncommences, irrespective of mid-night;\n(g)   “employee” means any person employed whether directly or otherwise, about\nthe business of an establishment for the owner or occupier thereof, even though\nhe receives no reward or remuneration for his labour, but does not include a\nmember of the employer’s family;\n(h)   “employer” means a person owning or having charge of the business of an\nestablishment, and includes an agent or manager or any other person acting on\nbehalf of such person in the general management or control of such\nestablishment;\n(i)   “employer’s family” means the employer’s husband or wife, as the case may\nbe, sons, daughters, father, mother, and brothers and sisters living with and\ndependent on the employer;\n(j)   “establishment” means a shop, commercial establishment, industrial\nestablishment, private dispensary, maternity home, residential hotel, restaurant\neating house, café, cinema, theatre, circus, or other place of public amusement\nor entertainment, and such other establishments or class thereof as Government\nmay, by notification in the official Gazette, declare to be establishments for the\npurposes of this Ordinance;\n(k)        “factory” means a factory as defined in clause (j) of section 2 of the Factories\nAct, 1934 (XXV of 1934);\n(l)        “form” means a form specified in the Schedule;\n(m)        “Government” means 1[Provincial Government];\n(n)        “hours of work” or “working hours” with reference to an establishment means\nthe time during which the employees in the establishment are at the disposal of\nthe employer, exclusive of any interval allowed for rest and meals;\n(o)        “industrial establishment” means a workshop or other establishment in which\nthe work of making, altering, repairing, ornamenting, finishing or packing or\notherwise treating any article or substance with a view to its use, sale, transport,\ndelivery, or disposal is carried on, or where any such service is rendered to a\ncustomer, and includes such other class or classes of establishments as\nGovernment may, by notification in the official Gazette, declare to be industrial\nestablishments for the purposes of this Ordinance, but does not include a\nfactory;\n(p)        “permanent employee” means an employee who has been engaged on a\npermanent basis, and includes an employee who has completed nine months\ncontinuous service in one or different occupations in the same establishment,\nincluding breaks due to sickness, accident, leave, illegal lock outs, legal strikes\nor involuntary closure of the establishment, and has satisfactorily completed a\nprobationary period of three months;\n(q)        “prescribed” means prescribed by rules made under this Ordinance;\n(r)        “residential hotel” means any premises in which a bona fide business is carried\non for the supply of dwelling accommodation and meals on payment of a sum\nof money by a traveller or any other member of the public or class of the public\nand includes a club;\n(s)        “restaurant” and “eating house” mean any premises in which is carried on\nwholly or principally the business of the supply of meals or refreshments to the\npublic or a class of the public for consumption on the premises;\n(t)        “retail trade” includes the business of a barber or hair-dresser, the sale of\nrefreshments or intoxicating liquors, and sales by auctions;\n(u)        “shop” means any premises used wholly or in part for the whole-sale or retail\nsale of commodities or articles, either for cash or on credit, or where services\nare rendered to customers, and includes an office, a store room, godown,\nwarehouse or place of work, whether in the same premises or otherwise, mainly\nused in connection with such trade or business;\n1\nSubs. by the Federal Adaptation of Laws Order, 1975 (P.O. No. 4 of 1975), Article 2 and Schedule.\n(v)        “temporary employee” means an employee who has been engaged for work\nwhich is of an essentially temporary nature likely to be finished within a period\nnot exceeding nine months;\n(w)        “wages” means wages as defined in the Payment of Wages Act, 1936 (IV of\n1936);\n(x)        “week” means a period of seven days beginning at mid-night on Saturday night;\n(y)        “young person” means a person who is not a child and has not completed his\nseventeenth year of age."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. References to time of day",
      "content": "References to time of day in this Ordinance are references to\n1\n[Pakistan] Standard time."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to grant exemptions",
      "content": "Government may, by notification in the official Gazette,\nexempt from the operation of all or any of the provisions of this Ordinance any establishment or any\nclass thereof or any employer or employee or class of employers or employees on such conditions as\nit may think fit."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Ordinance not applicable to certain establishments and persons",
      "content": "(1) Nothing in this\nOrdinance shall apply to–\n(i)        offices of or under the 1[Federal] or Provincial Government;\n(ii)       offices of or under the Pakistan 1[*] Railway Board, including railway stations;\n(iii)      offices of or under any local authority, a trust, a corporation or any other public\nstatutory body, which is not run for profit or gain or in the course of its business\ndoes not make any profit or gain;\n(iv)       shops or stalls in any public exhibition or show, in so far as such shops or stalls\ndeal in retail trade which is solely subsidiary or ancillary to the main purpose of\nsuch exhibition or show;\n(v)        shops or stalls in any public fair or bazar held for religious or charitable\npurposes;\n(vi)       clubs, hostels, and messes not maintained for profit or gain;\n(vii)      establishments for the treatment or care of the sick, infirm, destitute or mentally\nunfit persons;\n(viii)     stalls and refreshment rooms at railway stations, streamer and launch stations,\ndocks, wharves and air ports, and on trains, steamers or air crafts, so far as the\nsale of commodities is concerned;\n(ix)       any person employed as manager, travelling agent, canvasser, messenger,\nwatchman, caretaker or conservancy staff or any person employed exclusively\n1\nSubs. and omitted by the Federal Adaptation of Laws Order, 1975 (P.O. No. 4 of 1975), Article 2 and Schedule.\nin connection with the collection, despatch, delivery, and conveyance of, or\ncustom formalities on, goods;\n(x)        any person employed for the business of any shop or commercial establishment\nmentioned in clauses (i) to (viii).\n(2) Nothing in clause (a) of sub-section (1) of section 6 and in section 7 shall apply to__\n(i)        clubs, hostels and messes maintained for profit or gain, so far as service and\nattendance upon customers is concerned;\n(ii)       shops dealing solely in any vegetables, meat, fish, dairy products, bread,\npastries, sweet-meats and flowers, so far as the sale of these articles is\nconcerned;\n(iii)      shops dealing mainly in medicines, surgical appliances, bandages or other\nmedical requisites, so far as the sale of these articles is concerned;\n(iv)       shops dealing in articles required for funerals, burials or cremations, so far as\nthe sale of these articles is concerned;\n(v)        shops dealing mainly in tobacco, cigars, cigarettes, biries, pan, liquid\nrefreshments sold retail for consumption on the premises, ice, newspapers or\nperiodicals, so far as the sale of these articles is concerned;\n(vi)       automobile service stations (not being repair shops) and petrol pumps for the\nretail sale of petrol;\n(vii)      barbers and hair-dressers’ shops, so far as service to customers is concerned;\n(viii)     cinemas, theatres and other places of public entertainment.\n(3) Notwithstanding anything contained in sub-section (2), Government may, by general or\nspecial order, fix the opening and closing hours for all or any of the classes of establishments specified\ntherein.\n(4) Notwithstanding anything contained in sub-sections (1) and (2), Government may, by\nnotification in the official Gazette, direct that any of the establishments or persons specified therein\nshall not be exempted from the operation of such provisions of this Ordinance as are specified in such\nnotification, and thereupon the provisions of this Ordinance specified in such notification shall apply\nto such establishments or persons."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Weekly holiday in establishments",
      "content": "1[(1) Except as otherwise provided in this Ordinance\nevery person employed in any establishment shall, in addition to the leave and holidays as may be\nadmissible to him under section 14, 15 and 16 be allowed as holiday, one day in each week.]\n(2) No deduction on account of any holiday allowed under sub-section (1) shall be made from\nthe wages of any employee of any establishment.\n(3) If an employee is employed on daily wages, he shall none-the-less be paid his daily wages\n1\nSubs. by the Finance Act, 2006 (III of 2006), s. 9.\nfor the holiday, and where an employee is paid on piece-rate, he shall receive for the holiday the\naverage of the wages received during the week.\n1\n(4)        [*        *            *           *        *      *     *]\n(5) The choice of a closed day shall rest with the employer, who shall intimate such choice to\nthe prescribed authority__\n(a)      in the case of an establishment existing at the time this Ordinance comes into\nforce, within two months thereof; and\n(b)      in the case of an establishment set up after the coming into force of this\nOrdinance, or to which the provisions of this Ordinance are subsequently\napplied, within two months of the setting up of the establishment or the\napplication of the provisions of this section thereto, as the case may be.\n(6) An employer who has intimated his choice of a closed day under the provisions of sub-\nsection (5), shall not change the closed day for the establishment without the prior approval in writing\nof the prescribed authority.\n2\n[7. (1) No establishment shall on any day remain open after 8:00 p. m:\nProvided that any customer who was being or was waiting in the establishment to be served at\nsuch hour, may be served during the period of thirty minutes immediately following such hour:\nProvided further that Government may, by notification in the official Gazette, fix any other\nhour after which establishments generally or any class of establishment shall not remain open.\n(2) Every employer shall display, at a prominent place in the establishment, a board specifying\nthe hours during which the establishment will remain open.\n(3) No employee shall be required or permitted to work continuously in any establishment for\nmore than six hours in the case of an adult and for more than three and half hours in the case of a young\nperson, unless he has been allowed an interval for rest or meal of not less than one hour.\n(4) Except with the permission of Government, no woman or young person shall be employed\nin any establishment otherwise than between the hours of 9:00 a.m. to 7:00 p.m.]"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Daily, weekly hours and over",
      "content": "time.__ (1) Save as otherwise expressly provided in this\nOrdinance, no adult employee shall be required or permitted to work in any establishment in excess of\nnine hours a day and forty-eight hours a week, and no young person in excess of seven hours a day\nand forty-two hours a week:\nProvided that in any day or in any week, in which there occurs stock-taking, making up of\naccounts, settlement or such other business operation, and during such other business operation, and\nduring such other periods as may be prescribed, an adult employee of an establishment may be required\nor permitted to work over-time in such establishment for more than nine hours in such day\n1\nOmitted by the Finance Act, 2006 (III of 2006), s. 9\n2\nSubs. by the West Pakistan Ordinance No. XVII of 1969, s. 2.\nand for more than forty-eight hours in such week, and a young person for more than seven hours in\nsuch day and for more than forty-two hours in such week, but so that the total number of hours so\nworked by an adult does not exceed 1[six hundred and twenty four] hours and by a young person 1[four\nhundred and sixty-eight] hours in any one year."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Over",
      "content": "time wages.__ When any employee is required to work over-time in any establishment,\nas provided in the proviso to section 8, the wages payable to such employee in respect of such over-\ntime work shall be calculated at double the ordinary rate of wages payable to him 1[:]\n1\n[Provided that no overtime shall be payable to the contract worker employed on piece rate\nbasis.]\n1\n[10. Spread-over.__ The period of work of an adult and young person shall be so arranged that\ninclusive of the interval for rest or meals under section 7, it shall not spread-over more than twelve\nhours in the case of adult and nine hours in the case of young person:\nProvided that the total period of work so worked out, in case of an adult worker, shall not\nexceed sixty hour and by a young person fifty-four hours in a weak.]"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Time and conditions of payment of wages",
      "content": "(1) Every employer or his agent or the\nmanager of an establishment shall fix the period in respect of which wages to employees shall be\npayable and shall be responsible for the payment to persons employed by him of all wages required to\nbe paid under this Ordinance.\n(2) No wage period, so fixed, shall exceed one month.\n(3) The wages of every employee in any establishment shall be paid on a working day before\nthe expiry of the seventh day of the last day of the wage period in respect of which the wages are\npayable.\n(4) All wages shall be paid in legal tender.\n(5) Where the employment of any person is terminated by or on behalf of the employer, the\nwages and other dues earned by such person shall be paid before the expiry of the second working day\nafter the day on which his employment is terminated."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Claims arising out of delay in payment of wages and penalty for malicious or vexatious",
      "content": "__\nclaims. (1) Government may, by notification in the official Gazette, appoint any person to be the\nAuthority to hear and decide for any specified area all claims arising out of delay in the payment or\nnon-payment of the wages of employees in that area.\n(2) When contrary to the provisions of this Ordinance, wages of any employee have been\ndelayed or withheld, such employee himself or through any other person, whom he may authorise in\nthis behalf, may within four months from the day on which such payment was to be made, apply to the\nAuthority appointed under sub-section (1):\nProvided that an application may be admitted after the said period of four months but not later\nthan six months, if the applicant satisfies the Authority that he had sufficient cause for not making the\napplication within such period.\n1\nSubs. and Added by the Finance Act, 2006 (III of 2006), s. 9.\n(3) When any application under sub-section (2) is entertained, the Authority shall hear the\napplicant and the employer or other person responsible for the payment of wages or give them an\nopportunity of being heard and, after such further inquiry, if any, as may be necessary, may without\nprejudice to any other penalty to which such employer or other person is liable under this Ordinance,\ndirect that payment be made to the applicant of delayed wages together with the payment of such\npenalty, not exceeding fifty rupees, as the Authority may fix:\nProvided that no direction for the payment of penalty shall be made in the case of delayed\nwages if the Authority is satisfied that the delay was due to__\n(a)     a bona fide error or bona fide dispute as to the amount payable to the employee;\nor\n(b)     the occurrence of an emergency, or the existence of such exceptional\ncircumstances that the person responsible for the payment of the wages was\nunable to make prompt payment; or\n(c)     the fault of the employee.\n(4) If the Authority hearing any application under this section is satisfied that it was either\nmalicious or vexatious, the Authority may direct that a penalty not exceeding fifty rupees be paid to\nthe employer or other person responsible for the payment of wages by the person presenting the\napplication.\n(5) Any amount directed to be paid under this section may be recovered__\n(a)     if the Authority is a Magistrate, by the Authority as if it were a fine imposed by\nhim as Magistrate; and\n(b)     if the Authority is not a Magistrate, by the any Magistrate to whom the Authority\nmakes application in this behalf as if it was a fine imposed by such Magistrate.\n(6) An appeal against a direction made by the Authority under sub-section (3) or sub-section\n(4) may be preferred to the District Court within thirty days of the date on which the direction was\nmade__\n(a)     by the employer or other person responsible for the payment of wages under\nsection 11 if the total sum directed to be paid by way of wages and penalty\nexceeds one hundred rupees; or\n(b)     by an employee, if the total amount of wages claimed to have been withheld\nfrom him or from the unpaid group to which he belonged, exceeds fifty rupees;\nor\n(c)     by any person directed to pay a penalty under sub-section (4).\n(7) If there is no appeal, the direction of the Authority made under sub-section (3) or sub-\nsection (4) shall be final, and where there is an appeal as provided in sub-section (6), the decision in\nappeal shall be final.\n(8) An Authority appointed under sub-section (1) shall, for the purposes of determining any\nmatter referred to in sub-section (3) or sub-section (4)__\n(a)     have all the powers as are vested in a Civil Court under the Code of Civil\nProcedure, 1908 (V of 1908), for enforcing the attendance of witnesses,\ncompelling the production of documents, and taking of evidence; and\n(b)     be deemed to be a Civil Court for all the purposes of section 195 and Chapter\nXXXV of the Code of Criminal Procedure, 1898 (V of 1898)."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Bar of suits",
      "content": "No Court shall entertain any suit for the recovery of wages in so far as the\nsum so claimed__\n(a)     forms the subject of an application made under sub-section (2) of section 12,\nwhich is pending before the Authority appointed under sub-section (1) of that\nsection or of an appeal under sub-section (6) of the said section;\n(b)     has formed the subject of a direction made under sub-section (3) of section 12;\n(c)     has been adjudged in any proceedings under section 12 not to be owed to an\nemployee; or\n(d)     could have been recovered by an application under section 12."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Annual leave",
      "content": "(1) Every employee shall be allowed leave with full wages for a period of\nfourteen days after continuous employment in an establishment, whether in the same or different\ncapacities, for a period of twelve months.\n(2) If an employee does not in any period of twelve months avail of the whole or any part of\nthe leave allowed to him under sub-section (1)__\n(a)     any leave not availed of by him shall be added to the leave to be allowed to him\nunder that sub-section in the succeeding period of twelve months; provided that\nwhen the total leave due to an employee under this section amounts to thirty\ndays, no further accumulation of or addition to such leave will be permissible;\n(b)     he may, at his request, in lieu of the leave not availed of by him, be paid by the\nemployer full wages for such leave.\n(3) For the purposes of computing the period during which an employee has been in continuous\nemployment within the meaning of sub-section (1), the period during which he was on leave under this\nsection, or sections 15 and 16, shall be included."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Casual and sick leave",
      "content": "(1) Every employee shall be entitled to casual leave with full\nwages for ten days in a calendar year. Such leave shall not ordinarily be granted for more than three\ndays at a time and shall not be accumulated.\n(2) Every employee shall be entitled to sick leave with full wages for a total period of eight\ndays in every year. Such leave, if not availed of by any employee during a calendar year, may be\ncarried forward, but the total accumulation of such leave shall not exceed sixteen days at any one time."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Festival holidays",
      "content": "Every employee shall be allowed ten days festival holidays with full\nwages in a year. The days and dates for such festival holidays shall be notified to the employees by the\nemployer in the beginning of the calendar year."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Wages during leave or holiday period",
      "content": "(1) For each day of the leave or holidays allowed\nto an employee under sections 14, 15 and 16, he shall be paid at the rate equivalent to the daily average\namount, which, during the three months preceding the leave or holidays, was being earned by the\nemployee.\n(2) An employee, who has been allowed leave under section 14 for any period not less than\nfour days in the case of an adult and five days in the case of a young person, shall before the leave\nbegins, be paid his wages for the period of the leave allowed."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Sections 14, 15, 16 and 17 not to apply to certain establishments",
      "content": "The provisions of\nsections 14, 15, 16 and 17 shall not apply in relation to employees employed in commercial\nestablishments as defined in clause (b) of section 2 of the West Pakistan Industrial and Commercial\nEmployment (Standing Orders) Ordinance, 1968 (West Pakistan Ordinance VI of 1968)."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Termination of employment.– (1) For terminating employment of a permanent employee,",
      "content": "one month’s notice in writing shall be given either by the employer or by the employee and in lieu of\nnotice, one month’s wages calculated on the basis of average of wages earned during the preceding\nthree months shall be paid.\n(2) No temporary employee, whether monthly rated, weekly rated or daily rated, and no\napprentice shall be entitled to any notice or pay in lieu thereof if his services are terminated, but the\nservices of a temporary employee shall not be terminated as a punishment unless he has been given an\nopportunity of explaining the charges levelled against him."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Prohibition of employment of children",
      "content": "No child shall be required or allowed to work\nin any establishment."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Contracting out",
      "content": "Any contract or agreement, whether made before or after the\ncommencement of this Ordinance, whereby an employee relinquished any right conferred by this\nOrdinance shall be null and void in so far as it purports to deprive him of such right."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Guarding of machinery",
      "content": "In every industrial establishment, all mechanically or\nelectrically propelled machinery shall be guarded in the prescribed manner."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Maintenance of records and registers",
      "content": "Every employer shall, for the purpose of this\nOrdinance, maintain such records and registers and furnish such information as may be prescribed."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Registration of establishment and fee for registration",
      "content": "(1) Every establishment, other\nthan a one man shop, as hereinafter defined, and factories employing clerical staff within the factory\npremises, shall be registered with the Deputy Chief Inspector for the area within which such\nestablishment is situated.\n(2) An application for registration of an establishment shall be made by the employer in form\n‘A’ and shall be accompanied by a Treasury Challan under Head “47__Misc. Deptts-B(i) __ Labour”\nfor an amount of__\nRs. 2.00 in the case of an establishment employing 1 to 5 workers.\nRs. 3.00 in the case of an establishment employing 6 to 10 workers.\nRs. 5.00 in the case of an establishment employing 11 to 20 workers.\nRs. 10.00 in the case of an establishment employing more than 20 workers.\nExplanation.__ For the purposes of this section, “one man shop” means a shop run by an\nemployer or by any member of his family without engaging an employee.\n(3) An application for registration of an establishment shall be made–\n(a)     in the case of an establishment existing at the time this Ordinance comes into\nforce, within three months thereof; and\n(b)     in the case of an establishment set up after the coming into force of this\nOrdinance or to which the provisions of this Ordinance are subsequently\napplied, within two months of the setting up of the establishment or the\napplication of this Ordinance thereto, as the case may be.\n(4) On receipt of the application and the fees specified in sub-section (2), the Deputy Chief\nInspector shall, on being satisfied about the correctness of the application, register the establishment\nin the Register of Establishments to be maintained in form ‘B’ and shall issue a registration certificate\nto the employer in form ‘C’.\n(5) The registration certificate shall be prominently displayed by the employer at the\nestablishment and shall be renewed after every two years on depositing fee as prescribed in sub-section\n(2)."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Appointment of Chief Inspector, Deputy Chief Inspectors and Inspectors.– (1)",
      "content": "Government may, by notification in the official Gazette, appoint__\n(a)     a Chief Inspector of Shops for the whole of the Province;\n(b)     Deputy Chief Inspectors of Shops for such areas as may be notified; and\n(c)     such persons or class of persons as it thinks fit to be Inspectors for the purposes\nof this Ordinance within such local limits as may be specified by the Chief\nInspector of Shops.\n(2) The Chief Inspector of Shops and the Deputy Chief Inspectors of Shops__\n(a)     shall supervise the work of Inspectors appointed under clause (c) of sub-section\n(1) in such manner as may be prescribed; and\n(b)     may exercise all or any of the powers of an Inspector.\n(3) The Chief Inspector of Shops, Deputy Chief Inspectors of Shops and Inspectors appointed\nunder sub-section (1) shall be deemed to be public servants within the meaning of section 21 of the\nPakistan Penal Code (XLV of 1860)."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Powers of Inspectors",
      "content": "An Inspector appointed under section 25 may, for the purposes of\nthis Ordinance and within the local limits for which he is appointed, at all reasonable times enter into\nany place which is, or which he has reason to believe is, an establishment, with such assistants, if any,\nbeing persons in the service of Government, and make such examination of that place or of any\nprescribed record, register, or other documents maintained therein, and may require such explanation\nof any prescribed record, register or other documents and do all such things as he considers necessary\nfor the purpose of this Ordinance."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Penalties",
      "content": "(1) If any employer, with intent to deceive, makes or causes or allows to be\nmade, in any register, record or notice required to be maintained under the provisions of this Ordinance\nor the rules made thereunder, any entry, or wilfully omits or causes or allows to be omitted from any\nsuch register, record or notice, any entry which is required to be made thereunder, or maintains or\ncauses or allows to be maintained more than one set of any such register, record or notice except the\noffice copy of such notice, or sends or causes or allows to be sent to an Inspector any statement,\ninformation or notice required to be sent under the provisions of this Ordinance or the rules made\nthereunder, which to his knowledge is false in any material particulars, he shall, on conviction, be\npunished with fine which shall not be less than fifty rupees and which may extend to two hundred\nrupees.\n(2) Whoever contravenes any of the provisions of section 6, 7, 19 or 20 shall, on conviction,\nbe punishable with fine which for the first offence may extend to rupees two hundred and fifty, and\nfor a second or subsequent offence with fine which may extend to rupees five hundred or with simple\nimprisonment which may extend to three months, or with both.\n(3) Whoever contravenes any other provisions of this Ordinance shall, on conviction, be\npunishable with fine which for the first offence may extend to rupees one hundred and fifty, and for a\nsecond or any subsequent offence, to rupees two hundred and fifty or with simple imprisonment which\nmay extend to three months, or with both."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Procedure",
      "content": "(1) No prosecution under this Ordinance or any rules made thereunder shall\nbe instituted except by or with the previous sanction of an Inspector, or other officer or authority\nspecially empowered by Government in this behalf.\n(2) No Court inferior to that of a Magistrate of the first class shall try an offence punishable\nunder this Ordinance or any rule made thereunder."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Limitation of prosecutions",
      "content": "No Court shall take cognizance of any offence punishable\nunder this Ordinance or any rule made thereunder unless complaint thereof is made within three\nmonths from the date on which the alleged commission of the offence comes to the knowledge of an\nInspector."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Indemnity",
      "content": "No suit, prosecution or legal proceedings shall lie against any person in\nrespect of anything done in good faith under this Ordinance or the rules thereunder."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Delegation of powers",
      "content": "Government may, by notification in the official Gazette, delegate\nall or any of its powers under this Ordinance or the rules thereunder to any subordinate authority or\nagency as may be considered expedient by it."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Power to make rules",
      "content": "(1) Government may, by notification in the official Gazette, make\nrules for carrying out the purposes of this Ordinance.\n(2) In making rules under this section, Government may direct that any person committing\nbreach thereof shall, on conviction, be punishable with fine which may extend to fifty rupees, and\nwhere the breach is a continuing one, with a further fine which may extend to ten rupees for every day,\nafter the first, during which the breach continues."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Saving of certain rights and privileges",
      "content": "Nothing in this Ordinance shall affect any right\nor privilege to which an employee is entitled on the date of the commencement of this Ordinance under\nany law for the time being in force or under any award, agreement, settlement, contract, custom or\nusage which is in force on that date, if such right or privilege is more favourable to him than any right\nor privilege conferred upon him by this Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "adult",
      "definition": "a person who has completed his seventeenth year of age;",
      "source_provision": "sec2"
    },
    {
      "term": "apprentice",
      "definition": "a person who is employed, whether on payment of wages or not, for the purposes of being trained in any trade, craft or employment in any establishment;",
      "source_provision": "sec2"
    },
    {
      "term": "child",
      "definition": "a person who has not completed his twelfth year of age;",
      "source_provision": "sec2"
    },
    {
      "term": "closed",
      "definition": "not open for the service of any customer or to any business connected with the establishment; 1 Subs. by the Federal Adaptation of Laws Order, 1975 (P.O. No. 4 of 1975), Article 2 and Schedule.",
      "source_provision": "sec2"
    },
    {
      "term": "commercial establishment",
      "definition": "an establishment which carries on any business, trade or profession or any work in connection with, or incidental or ancillary to, any business, trade or profession, and includes__ (i) a society registered under the Societies Registration Act, 1860 (XXI of 1860), and a charitable or other trust, whether registered or not, which carries on, whether for purposes of gain or not, any business, trade or profession, or any work in connection with or incidental or ancillary thereto; (ii) an establishment wherein there is conducted the business of advertising, commission, forwarding or a commercial agency; (iii) a clerical department of a factory or of any industrial or commercial undertaking; (iv) an insurance company, joint stock company, bank, brokers’ offices or exchange and office-of lawyers, income-tax practitioners, registered accountants, contractors and engineers. (v) such other professional establishment or class thereof as Government may, by notification in the official Gazette, declare to be commercial establishments for the purposes of this Ordinance; but does not include a factory, shop, residential hotel, restaurant, eating house, theatre or other place of public amusement or entertainment;",
      "source_provision": "sec2"
    },
    {
      "term": "day",
      "definition": "the period of twenty-four hours beginning at mid-night, provided that in the case of an employee, whose hours of work extend beyond mid-night, day means the period of twenty four hours beginning when such employment commences, irrespective of mid-night;",
      "source_provision": "sec2"
    },
    {
      "term": "employee",
      "definition": "any person employed whether directly or otherwise, about the business of an establishment for the owner or occupier thereof, even though he receives no reward or remuneration for his labour, but does not include a member of the employer’s family;",
      "source_provision": "sec2"
    },
    {
      "term": "employer",
      "definition": "a person owning or having charge of the business of an establishment, and includes an agent or manager or any other person acting on behalf of such person in the general management or control of such establishment;",
      "source_provision": "sec2"
    },
    {
      "term": "employer’s family",
      "definition": "the employer’s husband or wife, as the case may be, sons, daughters, father, mother, and brothers and sisters living with and dependent on the employer;",
      "source_provision": "sec2"
    },
    {
      "term": "establishment",
      "definition": "a shop, commercial establishment, industrial establishment, private dispensary, maternity home, residential hotel, restaurant eating house, café, cinema, theatre, circus, or other place of public amusement or entertainment, and such other establishments or class thereof as Government may, by notification in the official Gazette, declare to be establishments for the purposes of this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "factory",
      "definition": "a factory as defined in clause (j) of section 2 of the Factories Act, 1934 (XXV of 1934);",
      "source_provision": "sec2"
    },
    {
      "term": "form",
      "definition": "a form specified in the Schedule;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "1[Provincial Government];",
      "source_provision": "sec2"
    },
    {
      "term": "industrial establishment",
      "definition": "a workshop or other establishment in which the work of making, altering, repairing, ornamenting, finishing or packing or otherwise treating any article or substance with a view to its use, sale, transport, delivery, or disposal is carried on, or where any such service is rendered to a customer, and includes such other class or classes of establishments as Government may, by notification in the official Gazette, declare to be industrial establishments for the purposes of this Ordinance, but does not include a factory;",
      "source_provision": "sec2"
    },
    {
      "term": "permanent employee",
      "definition": "an employee who has been engaged on a permanent basis, and includes an employee who has completed nine months continuous service in one or different occupations in the same establishment, including breaks due to sickness, accident, leave, illegal lock outs, legal strikes or involuntary closure of the establishment, and has satisfactorily completed a probationary period of three months;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Ordinance;",
      "source_provision": "sec2"
    },
    {
      "term": "residential hotel",
      "definition": "any premises in which a bona fide business is carried on for the supply of dwelling accommodation and meals on payment of a sum of money by a traveller or any other member of the public or class of the public and includes a club;",
      "source_provision": "sec2"
    },
    {
      "term": "retail trade",
      "definition": "the business of a barber or hair-dresser, the sale of refreshments or intoxicating liquors, and sales by auctions;",
      "source_provision": "sec2"
    },
    {
      "term": "shop",
      "definition": "any premises used wholly or in part for the whole-sale or retail sale of commodities or articles, either for cash or on credit, or where services are rendered to customers, and includes an office, a store room, godown, warehouse or place of work, whether in the same premises or otherwise, mainly used in connection with such trade or business; 1 Subs. by the Federal Adaptation of Laws Order, 1975 (P.O. No. 4 of 1975), Article 2 and Schedule.",
      "source_provision": "sec2"
    },
    {
      "term": "temporary employee",
      "definition": "an employee who has been engaged for work which is of an essentially temporary nature likely to be finished within a period not exceeding nine months;",
      "source_provision": "sec2"
    },
    {
      "term": "wages",
      "definition": "wages as defined in the Payment of Wages Act, 1936 (IV of 1936);",
      "source_provision": "sec2"
    },
    {
      "term": "week",
      "definition": "a period of seven days beginning at mid-night on Saturday night;",
      "source_provision": "sec2"
    },
    {
      "term": "young person",
      "definition": "a person who is not a child and has not completed his seventeenth year of age.",
      "source_provision": "sec2"
    }
  ]
}
