{
  "id": "pk-west-pakistan-small-industries-corporation-dissolution-act-1972",
  "type": "statute",
  "title": "West Pakistan Small Industries Corporation (Dissolution) Act, 1972",
  "title_en": "West Pakistan Small Industries Corporation (Dissolution) Act, 1972",
  "short_name": "WPSIC",
  "status": "in_force",
  "issued_date": "1972-09-03",
  "in_force_date": "1972-09-03",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2FuaJo%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Small Industries Corporation (Dissolution) Act, 1972 (III of 1972) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and commencement",
      "content": "(1) This Act may be called the West Pakistan Small\nIndustries Corporation (Dissolution) Act, 1972.\n(2) It shall come into force at once and shall be deemed to have taken effect on the 27th\nday of June, 1972."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions.― In this Act, unless there is anything repugnant in the subject or",
      "content": "context,―\n(a)         “appointed day” means the 30th day of June, 1972, or such earlier date as the\nPresident may, by notification in the official Gazette, specify to be the\nappointed day for the purposes of this Act;\n(b)         “Corporation” means the West Pakistan Small Industries Corporation\nestablished under the West Pakistan Small Industries Corporation Ordinance,\n1965 (W.P. Ord. XXX of 1965);\n(c)“Projects, undertaking and properties” includes assets, rights, authorities,\npowers privileges, properties, both movable and immovable, including lands,\nmines, leases, leaseholds, shares, book-debts, and all rights, interests and\nbenefits in assignable contracts and chose in action; and\n(d)     “Provinces” means the Provinces constituted under the Province of West\nPakistan (Dissolution) Order, 1970 (P.O. No. 1 of 1970)."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Dissolution of Corporation.― On the appointed day,",
      "content": "(a)         the corporation shall stand dissolved; and\n(b)        the West Pakistan Small Industries Corporation Ordinance, 1965 (W.P. Ord.\nXXX of 1965) and the Province of West Pakistan (Dissolution) Order, 1970\n(P.O. No. 1 of 1970), in so far as it relates to, or makes provision for the\nCorporation, shall stand repealed."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Transfer of projects, etc. of the Corporation.― (1) Notwithstanding anything",
      "content": "contained in the West Pakistan small Industries Corporation Ordinance, 1965 (W.P. Ord. XXX of\n1965), or in any law, agreement or contract for the time being in force, the President may at any\ntime before the appointed day, by order direct that any business, project, undertaking or property of\nthe Corporation shall be transferred to such one of the Provinces, on such date, in such manner\nand to such extent as may be specified in the order; and the business and project, undertaking and\nproperty so transferred shall be carried on by, and vest in, the Province.\n1 For Statement of Objects and Reasons, see Gaz. of P., 1972, Ext., Pt. III, p. 345.\n(2) Consistent with the order made under sub-section(1), the President may, by order,\nmake such provision as may appear to him to be expedient or necessary to provide for succession to,\nand transfer of, all the rights, properties, assets and liabilities of the Corporation, and the\napportionment and adjustment of such rights, properties, assets and liabilities among the Provinces.\n(3) For the purpose of determining financial adjustment to be made amongst the Provinces,\nthe Assets and Liabilities Committee set up under Article 4 of the Dissolution of West Pakistan\nProvince (Rights, Properties, Assets and Liabilities) Order, 1971 (P.O. No. 2 of 1971), shall take\ninto account any order made by the President under sub-section (1) or sub- section (2)."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Transfer of employees of Corporation.― Persons who were in the whole time",
      "content": "employment of the corporation immediately before the commencement of this Act shall be\ntransferred to, and appointed by, the Provinces in accordance with the rules made by the President\nin this behalf:\nProvided that the persons so transferred shall be appointed on such terms and conditions as\nthe President may by order determine."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Supplemental powers.― Without prejudice to the provisions of this Act, the President",
      "content": "may, in such manner as he may consider necessary or expedient, provide for the removal of\ndifficulties arising out of, or in connection with, the dissolution of the Corporation or for\neffectively carrying out the purposes of this Act."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Repeal of Ordinance XXIV of 1972.― The West Pakistan Small Industries Corporation",
      "content": "(Dissolution) Ordinance, 1972 (XXIV of 1972), is hereby repealed.\n__________"
    }
  ],
  "definitions": [
    {
      "term": "appointed day",
      "definition": "the 30th day of June, 1972, or such earlier date as the President may, by notification in the official Gazette, specify to be the appointed day for the purposes of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Corporation",
      "definition": "the West Pakistan Small Industries Corporation established under the West Pakistan Small Industries Corporation Ordinance, 1965 (W.P. Ord. XXX of 1965);",
      "source_provision": "sec2"
    },
    {
      "term": "Projects, undertaking and properties",
      "definition": "assets, rights, authorities, powers privileges, properties, both movable and immovable, including lands, mines, leases, leaseholds, shares, book-debts, and all rights, interests and benefits in assignable contracts and chose in action; and",
      "source_provision": "sec2"
    },
    {
      "term": "Provinces",
      "definition": "the Provinces constituted under the Province of West Pakistan (Dissolution) Order, 1970 (P.O. No. 1 of 1970).",
      "source_provision": "sec2"
    }
  ]
}
