{
  "id": "pk-west-pakistan-survey-and-rectangulation-of-lands-ordinance-1959",
  "type": "statute",
  "title": "West Pakistan Survey and Rectangulation of Lands Ordinance, 1959",
  "title_en": "West Pakistan Survey and Rectangulation of Lands Ordinance, 1959",
  "short_name": "WPSAR",
  "status": "in_force",
  "issued_date": "1959-05-31",
  "in_force_date": "1959-05-31",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tmbg%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Survey and Rectangulation of Lands Ordinance, 1959 (XXXIV of 1959) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power to make rules",
      "content": "LANDS ORDINANCE, 1959\nWEST PAKISTAN ORDINANCE No. OF 1959\n[1st June, 1959]\nAN\nto provide for the survey and rectangulation of lands.\nPreamble. WHEREAS it is expedient to make provision for carrying out the survey and\nrectangulation of land in any area in the Province of West Pakistan;\nNOW, THEREFORE, in pursuance of the Presidential Proclamation of the seventh day of\nOctober, 1958, and in exercise of all powers enabling him in that behalf, the Governor of West Pakistan\nis pleased to make and promulgate the following Ordinance:__"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Ordinance may be called the West",
      "content": "Pakistan Survey and Rectangulation of Lands Ordinance, 1959.\n1\n[(2) It extends to the whole of the Province of West Pakistan, except the Tribal Areas.]\n(3) It shall come into force in such area and on such date as the Board of Revenue, West\nPakistan, may by notification direct."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Power to direct survey and rectangulation. Notwithstanding anything contained in any",
      "content": "other law for the time being in force, the Board of Revenue, West Pakistan, may, by notification, direct\nthat survey and rectangulation of land in any area be carried out; provided that, as far as possible, the\narea of an owner’s holding shall not, as a result of such operations, be reduced."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Assessment and recovery of costs. The cost of the survey, and rectangulation operations",
      "content": "shall be assessed and recovered from the persons whose holdings are affected in such manner as may\nbe prescribed by rules made under this Ordinance:\nProvided that the Provincial Government may remit, in whole or in part, the cost of such\noperations."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Penalty. Whoever obstructs or prevents any operations under this Ordinance, or fails to",
      "content": "comply with any provisions of the rules made thereunder, shall, on a complaint made in writing by any\nRevenue Officer, be punished with imprisonment which may extend to six months, or with fine which\nmay extend to one thousand rupees or with both."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Indemnity. No suit or other legal proceedings shall be maintainable in respect of the exercise",
      "content": "of any powers or discretion conferred by this Ordinance or rules made thereunder, or against any public\n1\nSubs. by the West Pakistan Laws (Extension to Karachi) Ordinance, 1964 (West Pakistan Ordinance No. VII of 1964), s. 2 and Sch.\nservant or person duly appointed or authorised under this Ordinance or the rules, in respect of anything\nin good faith done, or purporting to be done under this Ordinance or the rules."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Bar to jurisdiction of Civil Courts. No Civil Court shall have jurisdiction to entertain any",
      "content": "claim, suit or other legal proceedings in respect of any act done in pursuance of the provisions of this\nOrdinance."
    }
  ],
  "definitions": []
}
