{
  "id": "pk-west-pakistan-tobacco-vend-act-1958",
  "type": "statute",
  "title": "West Pakistan Tobacco Vend Act, 1958",
  "title_en": "West Pakistan Tobacco Vend Act, 1958",
  "short_name": "WPTVA",
  "status": "in_force",
  "issued_date": "1958-04-29",
  "in_force_date": "1958-04-29",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tiag%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Tobacco Vend Act, 1958 (XXXVIII of 1958) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Act may be called the West Pakistan",
      "content": "Tobacco Vend Act, 1958.\n1[(2) It extends to the whole of the Province of West Pakistan, except the Tribal Areas.]\n(3) It shall be deemed to have come into force from the first of April, 1958."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context",
      "content": "(a)       “Collector” means any officer appointed by Government to discharge\nthroughout any specified local area the functions of a Collector under this Act;\n(b)       “Commissioner” means the Head of the Excise and Taxation Department in\nWest Pakistan and includes any other officer appointed by Government to\nexercise the functions and perform the duties of Commissioner under this Act;\n(c)       “dealer’s licence” means a licence authorising a person to whom it is granted to\nsell or keep for sale by retail manufactured tobacco;\n(d)       “Government” means Government of West Pakistan;\n(e)       “manufactured tobacco” means tobacco in any shape or form intended for the\npurpose of smoking, chewing or for use as snuff, or any preparation or\nadmixture of tobacco intended for the said purpose or use, and includes bidis,\ncigarettes or cigars;\n(f)       “prescribed” means prescribed by rules made under this Act;\n(g)       “tobacco” includes the leaves, stalks and stem of the tobacco plant (nicotiana\nrustica and nicotiana tobacum); and\n1\nSubs. by the West Pakistan Act No. XV of 1964, s. 2.\n(h)       “urban area” means any area within the limits of a municipality, 1[town\ncommittee], cantonment or railway station."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Prohibition against dealing in manufactured tobacco without dealer’s licence. No",
      "content": "person who does not grow tobacco himself or with the aid of the members of his family or by tenants\nor hired labour shall keep for retail sale or sell by retail manufactured tobacco in any urban area without\na dealer’s licence."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Grant of dealer’s licence. (1) The Collector 2[or any person authorised by him in this behalf]",
      "content": "may issue a dealer’s licence.\n(2) Every such licence shall be granted__\n(a)       on payment of such fees and for such period as may be prescribed by\nGovernment; and\n(b)       subject to such conditions and in such form and containing such particulars as\nmay be prescribed by the Commissioner."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Penalty for offences under section 3 and for breach of conditions of licence. (1) Whoever,",
      "content": "in contravention of the provisions of section 3, keeps for sale or sells by retail manufactured tobacco,\nor being the holder of a dealer’s licence commits a breach of any of the conditions subject to which\nthe licence has been granted shall be punishable with fine which may extend to one hundred rupees.\n(2) When any person is convicted under sub-section (1) of a breach of any of the conditions\nof his licence, the Collector may suspend or cancel his licence."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Powers of Magistrate to direct payment of licence fees in addition to fine. When any",
      "content": "person who does not hold a dealer’s licence is convicted of an offence under sub-section (1) of section\n5, the Magistrate may direct that such person shall pay, in addition to the fine imposed on him, the fees\npayable for a dealer’s licence."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Composition of offences. The Collector or any Magistrate authorised by him may accept",
      "content": "from any person against whom a reasonable suspicion exists that he has committed an offence under\nthis Act, a sum of money not exceeding one hundred rupees by way of composition for such offence\nor alleged offence."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Officer of the Excise and Taxation Department to have powers of investigation. Every",
      "content": "officer of the Excise and Taxation Department not below such rank as Government may prescribe shall\nhave the powers of a police officer in charge of a police station and may investigate offences under\nthis Act without the order of a Magistrate and exercise the same powers in respect of the investigation\n(except the power to arrest without warrant) as an officer in charge of a police station may exercise in\na cognizable case."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Penalty for vexatious search or arrest. Any officer of the Excise and Taxation Department",
      "content": "who without reasonable ground or suspicion enters or searches or causes to be searched any building\nor vexatiously and unnecessarily detains, searches or arrests any person, shall be liable to be punished\n1\nSubs. by the West Pakistan Ordinance No. XXXV of 1965, s. 2.\n2\nIns. by the West Pakistan Ordinance No. IX of 1959, s. 2.\nwith imprisonment for a term which may extend to three months or with fine which may extend to five\nhundred rupees or with both."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Cognizance of offences. No magistrate shall take cognizance of any offence punishable",
      "content": "under this Act except on the complaint of the Collector or an officer authorised by him in this behalf,\nwithin six months of the date on which the offence is alleged to have been committed."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Powers to enter and inspect. Any officer of the Excise and Taxation Department not below",
      "content": "such rank as Government may prescribe may__\n(a)    enter and inspect at any time within the hours during which sale is permitted or\nat any other time during which the same may be open, any place in which\nmanufactured tobacco is kept for sale by any person holding a licence under this\nAct; and\n(b)    examine accounts maintained in such place."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Powers to make rules. (1) Government may make rules for carrying out the purposes of",
      "content": "this Act.\n(2) In particular, and without prejudice to the generality of the foregoing powers, Government\nmay make rules for all or any of the following matters, namely: __\n(a)    prescribing the fees on payment of which and the period for which a licence\nunder this Act may be granted;\n(b)    prescribing the rank of officers of the Excise and Taxation Department for the\npurposes of sections 8 and 11;\n(c)    regulating the procedure to be followed by officers in the exercise of their\npowers and performance of their duties under this Act and prescribing the\nrestrictions subject to which such powers shall be exercised.\n(3) The Commissioner may make rules for all or any of the following matters, namely: __\n(a)    prescribing the conditions subject to which a licence under this Act may be\ngranted;\n(b)    prescribing the particulars to be contained in, and the form of, such licence;\n(c)    prescribing the manner in which payment shall be made for such licence fees\nand the manner in which such licences shall be issued.\n(4) The rules made under this section shall be published in the Official Gazette.\n(5) The rules made under this section shall be laid upon the table of the West Pakistan\nProvincial Assembly at the session of the said Assembly next following and shall be liable to be\nmodified or rescinded by a resolution of the said Assembly."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Repeal and Savings. (1) The following enactments are hereby repealed",
      "content": "(a)        The Bombay (District) Tobacco Act, 1933 (Bombay II of 1933.), in its\napplication to the former Province of Sind;\n1[(aa)     The Bombay (District) Tobacco Act, 1933, in its application to the District of\nKarachi.]\n(b)        The Punjab Tobacco Vend Fees Act, 1934 (Punjab V of 1934.) ;\n(c)        The North-West Frontier Province Tobacco Vend Fees Act, 1938 (N. W. F. P.\nII of 1938.) ;\n(d)        The Punjab Tobacco Vend Fees Act, 1934 (Punjab V of 1934.) as applicable to\nthe former State of Bahawalpur; and\n(e)        The Baluchistan Tobacco Vend Fees Regulation, 1942 (Reg: II of 1942).\n(2) Notwithstanding the repeal of the enactments mentioned in sub-section (1) everything done,\naction taken, obligation, liability, penalty or punishment incurred, inquiry or proceeding commenced,\nofficer appointed or person authorised, jurisdiction or power conferred, order or notification issued\nunder any of the provisions of the said enactments, shall, if not inconsistent with the provisions of this\nAct, continue in force, and be deemed to have been respectively done, taken, incurred, commenced,\nappointed, authorised, conferred or issued under this Act.\n(3) Until rules are made under this Act the rules made under the PunjabTobacco Vend Fees\nAct, 1934 (Punjab V of 1934.), in so far as they are consistent with the provision of this Act, shall be\ndeemed to be rules made under this Act.\n_______\nP5w1585\nRGN Date: 27-03-2025\n1\nIns. by the West Pakistan Act No. XV of 1964, s. 3."
    }
  ],
  "definitions": [
    {
      "term": "Collector",
      "definition": "any officer appointed by Government to discharge throughout any specified local area the functions of a Collector under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Commissioner",
      "definition": "the Head of the Excise and Taxation Department in West Pakistan and includes any other officer appointed by Government to exercise the functions and perform the duties of Commissioner under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "dealer’s licence",
      "definition": "a licence authorising a person to whom it is granted to sell or keep for sale by retail manufactured tobacco;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "Government of West Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "manufactured tobacco",
      "definition": "tobacco in any shape or form intended for the purpose of smoking, chewing or for use as snuff, or any preparation or admixture of tobacco intended for the said purpose or use, and includes bidis, cigarettes or cigars;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "tobacco",
      "definition": "the leaves, stalks and stem of the tobacco plant (nicotiana rustica and nicotiana tobacum); and 1 Subs. by the West Pakistan Act No. XV of 1964, s. 2.",
      "source_provision": "sec2"
    },
    {
      "term": "urban area",
      "definition": "any area within the limits of a municipality, 1[town committee], cantonment or railway station.",
      "source_provision": "sec2"
    }
  ]
}
