{
  "id": "pk-west-pakistan-tolls-on-roads-and-bridges-ordinance-1962",
  "type": "statute",
  "title": "West Pakistan Tolls on Roads and Bridges Ordinance, 1962",
  "title_en": "West Pakistan Tolls on Roads and Bridges Ordinance, 1962",
  "short_name": "WPTOR",
  "status": "in_force",
  "issued_date": "1962-04-11",
  "in_force_date": "1962-04-11",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tkaw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Tolls on Roads and Bridges Ordinance, 1962 (VIII of 1962) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to Government to set up toll gates and stations",
      "content": "5     Table of tolls to be affixed to or near toll gates, etc."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Repeal and savings",
      "content": "1962\nWEST PAKISTAN ORDINANCE NO. VIII OF 1962\n[12th April, 1962]\nAN\nto amend and consolidate the law relating to the levy of tolls on public roads and bridges in\nthe Province of West Pakistan.\nPreamble.__ WHEARAS it is expedient to amend and consolidate the law relating to the levy\nof tolls on public roads and bridges in the Province of the West Pakistan;\nNOW, THEREFORE, in pursuance of the Presidential Proclamation of the seventh day of\nOctober, 1958, and having received the previous instructions of the President the Governor of West\nPakistan, in exercise of all powers enabling him in that behalf, is pleased to make and promulgate the\nfollowing Ordinance:__"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent",
      "content": "(1) This Ordinance may be called the West Pakistan Tolls on Roads\nand Bridges Ordinance, 1962.\n(2) It extends to the whole of the Province of the West Pakistan, except 1[the Tribal Areas]."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Ordinance, unless the context otherwise requires, the following\nexpressions shall have the meanings hereby respectively assigned to them, that is to say:__\n(a)        “Government” means the Government of the West Pakistan.\n(b)        “toll” means a charge levied under this Ordinance for the use of a road or bridge."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Government may levy tolls",
      "content": "Government may cause tolls to be levied on all persons,\nanimals, vehicles or other things using, crossing or passing over any road or bridge vesting in it or\nwhich may hereafter vest in it at such rates as it may notify in the Official Gazette:\nProvided that Government may declare any person or any class or classes of persons, animals,\nvehicles or other things to be exempt from the payment of such tolls."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Table of tools to be affixed to or near tool gates, etc.",
      "content": "A table of the tools authorised to\nbe taken at any tool-gate or station set up under section 4, legibly written or printed, shall be affixed\nto some conspicuous place in or near such toll-gate or station.\n1\nSubstituted by the West Pakistan Laws (Adaptation) Order, 1964 (w. e. f. 8.6.1964)."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Collection of tolls",
      "content": "Government may place the collection of tolls leviable under this\nOrdinance under the management of such person as may appear to it proper."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Tolls may be leased",
      "content": "(1) Government may, from time to time, lease out the tolls of a bridge\nor road, by public auction or private contract for any period not exceeding five years, on such terms\nand conditions, as Government may consider desirable.\n(2) When the tolls are put up to auction, the Officer conducting the auction may, for reasons to\nbe recorded in writing, refuse to accept the offer of the highest bidder, and may accept any other bid,\nor may withdraw the tolls from the auction.\n(3) The acceptance of any bid at an auction conducted under the provisions of sub-section (2)\nby the officer conducting the auction shall be subject to confirmation by Government.\n(4) All arrears due from the lessee on account of the lease of the tolls may be recovered from\nhim or from his surety, if any, as if they were arrears of land-revenue."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Power to Government to cancel a lease",
      "content": "(1) Government may cancel the lease of the tolls\non any bridge or road on the expiration of the three months’ notice in writing to the lessee of its\nintention to do so.\n(2) When any lease is cancelled under sub-section (1), Government shall pay to the lessee such\ncompensation for the unexpired period of the lease as the Collector may award.\n(3) Any party dissatisfied with the award of the Collector given under sub-section (2) may,\nwithin thirty days of the date of such award, appeal to the Commissioner, whose decision shall be final."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Lease may surrender lease",
      "content": "The lessee of the tolls of any bridge or road may surrender his\nlease on the expiration of one month’s notice in writing to Government of his intention to do so, on\npayment of such compensation as Government may direct."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Tolls may be compounded",
      "content": "Any person entrusted with the management of the collection\nof tolls under this Ordinance may, for a period not exceeding one year, or where the tolls on any bridge\nor road have been let under section 7, the lessee of such tolls may, for the period of the lease or any\nshorter period, compound for the tolls payable for passage over such bridge or road."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Liabilities of persons employed in the management of tolls",
      "content": "Every person employed in\nwould lie on him if employed in the collection of land-revenue."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Lessee and his agents deemed to be persons appointed to collect tolls.",
      "content": "When the tolls\non any bridge or road have been duly leased under section 7, the lessee, and every person employed\nby the lessee as his agent for collecting the tolls, shall be deemed to be persons appointed to collect\ntolls under this Ordinance, and shall exercise all powers and be subject to all responsibilities attaching\nto persons appointed to collect tolls under this Ordinance."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Penalty for refusal to pay tolls, etc",
      "content": "Whoever__\n(a)     while crossing or passing over any bridge or road on which tolls are levied,\nrefuses to pay the proper toll; or\n(b)     with intent to avoid payment of such toll, fraudulently or forcibly crosses such\nbridge or passes over such road without paying the toll; or\n(c)     obstructs any toll-collector or lessee or any of his assistants or agents in any\nway in the execution of their duty under this Ordinance;\nshall be punished with fine which may extend to two hundred rupees."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Penalty for unlawful levy of tolls or doing unlawful acts under colour of the",
      "content": "Ordinance.__ Whoever__\n(i)     not being appointed to collect tolls under this Ordinance, levies or demands any\ntoll on any public road or bridge; or\n(ii)    unlawfully and extortionately demands or takes any other or higher toll than the\nlawful toll; or\n(iii)   under colour of this Ordinance, seizes or sells any property, knowing such\nseizure or sale to be unlawful; or\n(iv)    in any manner unlawfully extorts money or any valuable thing from any person\nunder colour of this Ordinance;\nshall be liable, on conviction before a Magistrate, to imprisonment for a term not exceeding six\nmonths, or to a fine not exceeding five hundred rupees, or both."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Power to toll collector to seize vehicles, animals, etc., for non",
      "content": "payment of tolls.__\nWithout prejudice to any other penalty that may be imposed under this Ordinance, in case of non-\npayment of any toll on demand, the officer appointed to collect the same may seize any of the vehicle\nor animals on which it is chargeable, or any part of their burden of sufficient value to defray the toll,\nand, if any toll, together with the cost arising from such seizure, remains undischarged for twenty-four\nhours, the case shall be brought before the officer appointed to superintendent the collection of the\ntolls, who shall thereupon issue a notice that on the afternoon of the next day, exclusive of Sunday and\nany closed holiday, he shall sell such property by auction and at the time specified in such notice he\nmay sell the property seized for the discharge of the toll, and all expenses occasioned by such non-\npayment, seizure and sale:\nProvided that if at any time before the sale has actually begun the person whose property has\nbeen seized tenders the amount of all expenses incurred, and double the toll payable by him, the\nproperty seized shall forth-with be released."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Police officers to assist toll",
      "content": "collectors.__ Every police officer shall be bound to assist a toll-\ncollector, when required, in the discharge of his duties under this Ordinance, and for that purpose shall\nhave the same powers as he possesses in the exercise of his ordinary police duties."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Jurisdiction of Courts barred",
      "content": "No proceeding shall lie in any Court in respect of the\namount of compensation payable under section 8 or 9 or the abatement of any rent or lease-money\npayable under this Ordinance."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Power of Government to delegate its powers",
      "content": "Government may delegate any of its\npowers and functions under this Ordinance to any local authority or officer subordinate to it."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Power to make rules",
      "content": "Government may, after previous publication, make rules for the\npurpose of carrying into effect the provisions of this Ordinance."
    }
  ],
  "definitions": [
    {
      "term": "Government",
      "definition": "the Government of the West Pakistan.",
      "source_provision": "sec2"
    },
    {
      "term": "toll",
      "definition": "a charge levied under this Ordinance for the use of a road or bridge.",
      "source_provision": "sec2"
    }
  ]
}
