{
  "id": "pk-west-pakistan-undesirable-companies-ordinance-1959",
  "type": "statute",
  "title": "West Pakistan Undesirable Companies Ordinance, 1959",
  "title_en": "West Pakistan Undesirable Companies Ordinance, 1959",
  "short_name": "WPUCO",
  "status": "in_force",
  "issued_date": "1959-04-21",
  "in_force_date": "1959-04-21",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tkaQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Undesirable Companies Ordinance, 1959 (XXII of 1959) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Power to make rules",
      "content": "ORDINANCE, 1959.\nWEST PAKISTAN ORDINANCE No. XXII OF 1959.\n[22nd April, 1959]\nAN\nto prohibit the registration of companies for carrying on business for certain undesirable purposes\nand to provide for the winding up and dissolution of such companies.\nPreamble WHEREAS it is expedient to prohibit the registration of companies for carrying on\nbusiness for certain undesirable purposes and to provide for the winding up and dissolution of such\ncompanies;\nNOW, THEREFORE, in pursuance of the Presidential Proclamation of the seventh day of\nOctober, 1958, and in exercise of all powers enabling him in that behalf, the Governor of West Pakistan\nis pleased to make and promulgate the following Ordinance:__"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short Title, and extent. (1) This Ordinance may be called the West Pakistan Undesirable",
      "content": "Companies Ordinance, 1959.\n1\n[(2) It extends to the whole of the Province of Wes Pakistan, except the Tribal Areas.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. (1) In this Ordinance, unless the context otherwise requires, the following",
      "content": "expressions shall have the meanings hereby respectively assigned to them, that is to say__\n(a)        “registrar” means__\n(i)         in the case of a company, the registrar appointed under section 248 of\nthe Companies Act, 1913 (VII of 1913); and\n(ii)       in any other case, an officer appointed as such for purposes of this\nOrdinance;\n(b)       “specified purpose” means the promotion or the carrying on of any scheme or\nbusiness except the business authorised and carried on under the provisions of\nreturn for a deposit or contribution, whether periodically or otherwise, of a sum\nof money in cash or by means of coupons, certificates, tickets or other\ndocuments, payment, at future date or dates of money or grant of property, right\nor benefit, directly or indirectly, and whether with or without any other right or\nbenefit, determined by chance or lottery or any other like manner, is assured or\npromised;\n1\nSubs. by the West Pakistan Laws (Extension to Karachi) Ordinance, 1964 (W. P. Ord. No. VII of 1964), s. 2 and Sch.\n(c)     “undesirable company” means a company, which, with objects and business\nconfined to the Province of West Pakistan, is registered under the Companies\nAct, 1913 (VII of 1913), and carries on business for a specified purpose or for\npurposes which, among others, include a specified purpose and includes a\ncompany, association or other body of individuals which carries on business for\na specified purpose or for purposes which, among others, include a specified\npurpose.\n(2) Any expression used but not defined in this Ordinance and defined in the Companies Act,\n1913 (VII of 1913), shall have the meanings assigned to it in that Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Registration of undesirable companies prohibited. (1) Notwithstanding anything in the",
      "content": "Companies Act, 1913 (VII of 1913), or in any other law for the time being in force, no association or\nother body of individuals which, with objects and business confined to the Province of West Pakistan,\ncarries or intends to carry on business for a specified purpose or for purposes which, among others,\ninclude a specified purpose, shall on and after the commencement of this Ordinance, be registered\nunder the Companies Act, 1913 (VII of 1913).\n(2) Registration in contravention of sub-section (1) shall be void.\n(3) Notwithstanding anything contained in any other law for the time being in force, no\ncompany, association or other body of individuals, with objects and business confined to the Province\nof West Pakistan, shall carry on, or shall be formed to carry on, business for a specified purpose or for\npurposes which, among others, include a specified purpose.\n(4) Any person who forms or associates himself in the formation of, a company, association or\nother body of individuals in contravention of sub-section (3) and every officer or agent of a company,\nassociation or other body of individuals which carries on business in contravention of the said sub-\nsection shall be punished with imprisonment for a term which may extend to three years or with fine\nor with both."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Existing undesirable Companies to cease functioning. (1) Every undesirable company",
      "content": "existing immediately before the commencement of this Ordinance shall, on such commencement,\ncease to function and, notwithstanding anything in the Companies Act, 1913 (VII of 1913) or in any\nother law for the time being in force, shall be wound up and dissolved in the manner provided in this\nOrdinance.\n(2) Any transaction with an undesirable company or with any officer or agent acting for or on\nbehalf of such company shall be void.\n(3) Any officer or agent acting for or on behalf of any such company who, on or after the\ncommencement of this Ordinance, carries on or attempts to carry on the business of the company shall\nbe punished with imprisonment for a term which may extend to three years or with fine or with both."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Deposit of cash and preservation of assets, etc. (1) Any officer or agent acting for or on",
      "content": "behalf of an undesirable company who has in his possession or under his control any cash belonging\nto the company shall, immediately after the commencement of this Ordinance, deposit or cause to be\ndeposited such cash with the company’s bankers.\n(2) Until such time as the official liquidator appointed under section 7 takes into his custody or\nunder his control all the books, documents and assets of the company, including actionable claims to\nwhich the company is or appears to be entitled, every officer and agent acting for or on behalf of the\ncompany shall preserve all such books, documents, assets, property, effects and claims and shall be\njointly and severally liable for any loss or damage.\n(3) Any person who, with intent to evade the provisions of this Ordinance, conceals, destroys,\nmutilates or defaces any books, documents, assets, property, effects or claims or knowingly allows\nsuch concealment, destruction, mutilation or defacement to be caused, shall, without prejudice to any\nliability to which he may be subject under sub-section (2), be punished with imprisonment for a term\nwhich may extend to three years or with fine or with both."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Statement of assets, etc., to be submitted to registrar. (1) Within three days of the",
      "content": "commencement of this Ordinance, or within such period as the registrar may allow, the manager of an\nundesirable company shall submit to the registrar a statement showing the assets and liabilities of the\ncompany.\n(2) Any one who contravenes the provisions of sub-section (1) shall be punished with\nimprisonment for a term which may extend to one year or with fine or with both."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Winding up undesirable companies. (1) As soon as may be after receipt of the statement",
      "content": "submitted under sub-section (1) of section 6, the registrar shall make a petition to the court for winding\nup the company, and thereupon the court shall make an order for the winding up of the company and\nshall appoint an official liquidator for such winding up.\n(2) After the official liquidator has been appointed under this section, the provisions of the\nCompanies Act, 1913 (VII of 1913), relating to the winding up by court of a registered company shall\nmutatis mutandis apply in relation to the winding up of the company in respect of which the petition\nhas been made under sub-section (1)."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Dissolution of undesirable companies. When the affairs of an undesirable company have",
      "content": "been completely wound up, the company shall be deemed to have been dissolved under sub-section\n(1) of section 194 of the Companies Act, 1913 (VII of 1913)."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Power to call for certain information, etc. (1) Where the registrar has reason to believe",
      "content": "that a company is an undesirable company or that an undesiredable company is carrying on business\nin contravention of section 4, he or any gazetted officer authorised by him in this behalf, may__\n(a)     direct any person to give such information in his possession with respect to any\nbusiness carried on by that company as he may demand;\n(b)     inspect or cause to be inspected any book or other document belonging to or\nunder the control of the company or any officer thereof;\n(c)     enter and search any premises and seize or authorise any person to seize any\nbook or other document belonging to or under the control of the company or\nany officer thereof.\n(2) If the registrar is satisfied that a company is an undesirable company or that an undesirable\ncompany is carrying on business in contravention of section 4, he shall by order in writing, direct the\nmanager of the company to hand over the management of the company to a person to be appointed by\nthe registrar for the purpose, and the manager shall forthwith hand over the management of the\ncompany to such person.\n(3) The person to whom management is handed over in pursuance of sub-section (2) shall be\ndeemed to be the manager of the company, and the other provisions of this Ordinance shall apply\naccordingly.\n(4) Whoever fails to comply with any direction given under sub-section (1) or sub-section (2)\nshall be punished with imprisonment for a term which may extend to six months or with fine or with\nboth."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Offence to be cognizable. Notwithstanding anything contained in the Code of Criminal",
      "content": "Procedure, 1898 (V of 1898), any offence under this Ordinance shall be cognizable."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Cognizance by court with the consent of registrar. No court shall take cognizance of any",
      "content": "offence under this Ordinance except with the previous consent in writing of the registrar."
    }
  ],
  "definitions": [
    {
      "term": "specified purpose",
      "definition": "the promotion or the carrying on of any scheme or business except the business authorised and carried on under the provisions of return for a deposit or contribution, whether periodically or otherwise, of a sum of money in cash or by means of coupons, certificates, tickets or other documents, payment, at future date or dates of money or grant of property, right or benefit, directly or indirectly, and whether with or without any other right or benefit, determined by chance or lottery or any other like manner, is assured or promised; 1 Subs. by the West Pakistan Laws (Extension to Karachi) Ordinance, 1964 (W. P. Ord. No. VII of 1964), s. 2 and Sch.",
      "source_provision": "sec2"
    },
    {
      "term": "undesirable company",
      "definition": "a company, which, with objects and business confined to the Province of West Pakistan, is registered under the Companies Act, 1913 (VII of 1913), and carries on business for a specified purpose or for purposes which, among others, include a specified purpose and includes a company, association or other body of individuals which carries on business for a specified purpose or for purposes which, among others, include a specified purpose. (2) Any expression used but not defined in this Ordinance and defined in the Companies Act, 1913 (VII of 1913), shall have the meanings assigned to it in that Act.",
      "source_provision": "sec2"
    }
  ]
}
