{
  "id": "pk-west-pakistan-urban-immovable-property-tax-act-1958",
  "type": "statute",
  "title": "West Pakistan Urban Immovable Property Tax Act, 1958",
  "title_en": "West Pakistan Urban Immovable Property Tax Act, 1958",
  "short_name": "WPUIP",
  "status": "in_force",
  "issued_date": "1958-04-07",
  "in_force_date": "1958-04-07",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tkbA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Urban Immovable Property Tax Act, 1958 (V of 1958) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short tile and extend. (1) This Act may be called the West Pakistan Urban Immovable Property",
      "content": "Tax Act, 1958.\n1\n[(2) It extends to the whole of West Pakistan, except the Tribal Areas.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Act unless the context otherwise requires, the following expressions shall\nhave the meanings hereby respectively assigned to them, that is to saу—\n(a)        “assessing authority” means the assessing authority constituted under this Act;\n(b)        “Collector” means an officer appointed by Government by name, or by virtue of\nhis office, to discharge the functions and to perform the duties of a Collector under\nthis Act in any specified area ;\n(c)        “Commissioner” means an officer appointed by Government by name, or by virtue\nof his office, to discharge the functions and to perform the duties of a Commissioner\nunder this Act in any specified area;\n(d)        “Government” means Government of West Pakistan ;\n2\n[(dd) “member of the family of the owner” means his—\n(i) wife or husband, as the case may be ;\n(ii)    sons and daughters ; and\n(iii) father and mother ;]\n1\nSubs. by West Pakistan Ordinance No. I of 1963, s. 2.\n2\nIns. by West Pakistan Ordinance No. XXVIII of 1963, s. 2.\n3\n[(e)    “owner” includes a mortgagee with possession, a lessee in perpetuity, a trustee\nhaving possession of a trust property and a person to whom an evacuee property\nhas been transferred provisionally or permanently under the Displaced Persons\n(Rehabilitation and Compensation) Act, 1958 (Act No. XXVIII of 1958) ;]\n(f)         “prescribed” means prescribed by rules made under this Act ;\n(g)         “rating area” means urban area where tax is levied under the provisions of this Act;\n(h)         “tax” means the tax leviable under the provisions of section 3; and\n(i)         “urban area” means an area within the boundaries of a Municipal Corporation,\nMunicipal Committee, Cantonment Board, Small Town Committee, or other\nauthority (not being a District Board) legally entitled to, or entrusted ted by\nGovernment with the control or management of a municipal or a local fund."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Levy of Tex",
      "content": "(1) Government may by notification specify urban areas where tax shall be levied\nunder this Act :\nProvided that one urban area may be divided into two or more rating areas or several urban areas\nmay be grouped as one rating area.\n4\n[(2) There shall be charged, levied and paid a tax on the annual value of buildings and lands in a\nrating area at the rate of ten per cent of such annual value :\nProvided that where a building is occupied by the owner, the tax shall be levied at the said rate on\none-half of the annual value of such building, if the owner or any member of his family does not own any\nother property in that rating area] :\nProvided 5[further] that Government may, by notifications remit for reasons to be recorded in\nwhole or in part, the payment of the tax by any class of persons in respect of any category of property.\nExplanation:—The annual value for the purposes of this section shall be the aggregate annual\nvalue of all buildings and lands owned by the same person in a rating area.\n6\n[(3) The tax shall be due from the owner of buildings and lands.]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Exemptions",
      "content": "The tax shall not be leviable in respect of the following properties, namely:—\n7\n[(a)    buildings and lands, other than those leased in perpetuity, vesting in the Federal\nGovernment;]\n8\n[(b)    buildings and lands other than those leased in perpetuity]—\n3\nSubs. by West Pakistan Ordinance No. XXVIII of 1963, s. 2.\n4\nSubs. by West Pakistan Ordinance No. XXVIII of 1963, s. 3.\n5\nIns. by West Pakistan Ordinance No. XXVIII of 1963, s. 3.\n6\nAdded by West Pakistan Ordinance No. X of 1959, s. 3.\n7\nSubs. by West Pakistan Ordinance No. X of 1959, s. 4.\n8\nSubs. by West Pakistan Ordinance No. X of 1959, s. 4.\n(i)       vesting in Government of West Pakistan and not administered by a local\nauthority ;\n(ii)      owned or administered by a local authority when used exclusively for public\npurposes and not used or intended to be used for purposes of profit ;\n9\n[(c)   (i)       buildings and lands the annual value of which does not exceed two hundred\nand sixteen rupees ; or\n(ii)      one building occupied by an owner for his residence, the annual value of\nwhich—\n(1)        does not exceed four hundred and eighty-six rupees in the rating\nareas of a municipality of the first class ; or\n(2)        does not exceed three hundred and seventy-eight rupees in other\nrating areas,\nSubject to the condition that the owner or any member of his family\ndoes not own any other property in that rating area and such other\nconditions as may be prescribed :]\nProvided that if such building or land is in the ownership of a person who owns any other\nbuilding or land in the same rating area, the annual value of such building or land shall, for the purposes\nof this clause, be deemed to be the aggregate annual value of all buildings or lands owned by him in that\narea :\n(d)        buildings and lands or portions thereof used exclusively for educational purposes\nincluding schools, boarding houses, hostels and Libraries ;\n(e)        public parks and playgrounds ;\n(f)        buildings and lands or portions thereof used exclusively for public worship or\npublic charity including mosques, temples, churches, dharamsalas, gurdwaras,\nhospitals, dispensaries, orphanages, alms houses, drinking water fountains,\ninfirmaries for the treatment and care of animals and public burial or burning\ngrounds or other places for the disposal of the dead:\nProvided that the following buildings and lands or portions thereof shall not be deemed to be used\nexclusively for public worship or for public charity within the meaning of this section, namely :—\n(i)       buildings in or land on which any trade or business is carried on unless the\nrent derived from such buildings or lands is applied exclusively to religious\npurposes or such public charitable institutions as may be prescribed;\n9\nSubs. by West Pakistan Ordinance No. XXVIII of 1963, s. 4.\n(ii)         buildings or lands in respect of which rent is derived, and such rent is not\napplied exclusively to religious purposes or to public charitable institutions;\nand\n(g)          buildings and lands the annual value of which does not exceed one thousand\nrupees, belonging to widows and minor orphans."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Ascertainment of annual value. The annual value of any land or building shall be ascertained",
      "content": "by estimating the gross annual rent at which such land or building together with its appurtenances and any\nfurniture that may be let for use or enjoyment with such building might reasonably be expected to be let\nfrom year to year, less—\n(a)        any allowance not exceeding twenty per centum of the gross annual rent as the\nassessing authority in each particular case may consider reasonable rent for the\nfurniture let with any such building ;\n(b)        an allowance of ten per centum for the cost of repairs and for all other expenses\nnecessary to maintain such building in a state to command such gross annual rent.\nSuch deduction shall be calculated on the balance of the gross annual rent after the\ndeduction, if any, under clause (a); and\n(c)        any land revenue actually paid in respect of such building or land :\nProvided that in calonlating the annual value of any building or land under this section the value\nof any machinery in such building or on such land shall be excluded."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Assessing Authority. (1) There shall be an assessing authority for every rating area",
      "content": "(2) The assessing authority shall exercise such powers and perform such duties as are conferred\non it by this Act or the rules made thereunder."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Making and operation of valuation lists. (1) A valuation list shall be made by the prescribed",
      "content": "authority in accordance with the rules framed under this Act for every rating area so as to come into force\neither on the first day of 10[July] or the first day of 11[January], and thereafter a new valuation list shall be\nmade from time to time so that the interval between the dates on which one valuation list and the next\nsucceeding valuation list respectively come into force shall be a period of five years :\nProvided that Government may by order—\n(a)        reduce by a period not exceeding one year or extend by a period not exceeding three\nyears the interval which would otherwise elapse between the coming into force of\nany two successive valuation lists for any rating area, or, where a valuation list has\nbeen lost or destroyed by operation of circumstances beyond control, cancel the list,\ndirect the preparation of a new list and order recovery of pending tax to be made on\n10\nSubs. by Ordinance No. VII of 1961, s. 2.\n11\nSubs. by Ordinance No. VII of 1961, s. 2.\nthe basis either of the last preceding valuation list or of the new list prepared under\nthis proviso; and\n(b)        divide any rating area into parts for the purposes of a new valuation list and\ndetermine the years in which the next following valuation list for each of such parts\nrespectively shall be made and come into force.\n(2) Subject to the provisions of any such order as aforesaid, every valuation list shall come into\nforce on the first day of 12[July] or the first day of 13[January], as the case may be, next following the date\non which it is finally approved by the assessing authority and shall, subject to the provisions of this Act\nand the rules made thereunder (including the provisions with respect to the alteration of and the making\nof additions to the valuation list) remain in force until it is superseded by a new valuation list."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Draft valuation list",
      "content": "(1) Where the assessing authority for any area has issued notices\nrequiring returns in connection with the making of a new valuation list, the said authority shall, as soon\nas may be after the expiration of the period allowed for the delivery of the returns, cause a draft valuation\nlist to be prepared for the area and published in such manner as may be prescribed.\n(2) Any person aggrieved by any entry in the draft valuation list, or by the insertion therein or\nomission therefrom of any matter, or otherwise with respect to the list, may, in accordance with the rules\nmade under this Act lodge an objection with the assessing authority at any time before the expiration of\nthirty days from the date on which the draft valuation list is published 14[:]\n15\n[Provided that in special circumstances the Commissioner may, by notification, extend the period\nto a maximum of sixty days.]"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Amendment of current valuation list",
      "content": "Subject to such rules, if any, as the Government may\nthink fit to make in this behalf, the assessing authority may at any time make such amendments in a\nvaluation list as appear to it to be necessary in order to bring the list into accord with existing circumstances\nand in particular may—\n(a)        correct any clerical or arithmetical error in the list ;\n(b)        correct any erroneous insertion or omission or any misdescription ;\n(c)        make such additions to or corrections in the list as appear to the authority to be\nnecessary by reason of—\n(i)        a new building being erected after the completion of the valuation list ;\n(ii)       a building included in the valuation list being destroyed or substantially\ndamaged or altered since its value was last previously determined.\n(iii)      any change in the ownership or use of any building or land :\n12\nSubs. by West Pakistan Ordinance No. VII of 1961, s. 2.\n13\nSubs. by West Pakistan Ordinance No. VII of 1961, s. 2.\n14\nReplaced by West Pakistan Ordinance No. XXVIII of 1963, s. 5.\n15\nAdded by West Pakistan Ordinance No. XXVIII of 1963, s. 5.\nProvided that not less than fourteen days before making any such amendment in the valuation\nlist for the time being in force, other than the correction of a clerical or arithmetical error, or the correction\nof an erroneous insertion, omission or misdescription, the assessing authority shall send notice of the\nproposed amendment to the owner of the building or land and shall also consider any objection thereto\nwhich may be made by him."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Appeal and revision. (1) Any person aggrieved by an order of the appropriate authority upon",
      "content": "an objection made before that authority under section 8, 9 16[, 14] or 15 may appeal against such order, at\nany time before the expiration of thirty days from the date of such order, to the Collector of the district in\nwhich the building or land to which the objection related is situate, or to such other officer as the\nGovernment may, by notification, appoint in this behalf.\n17\n[(1A) Any person aggrieved by any entry in the valuation list prepared under section 7, or by the\ninsertion therein or omission therefrom of any matter, or otherwise with respect to the list, may, within\nsixty days of the dato on which the list is to come into force; prefer an appeal in respect of such entry or\nmatter, to the Collector or to such other officer as the Government may, by notification, appoint in this\nbehalf.]\n(2) The Commissioner or such other officer as may be appointed by the Government by\nnotification in this behalf, may of his own motion at any time, or on application made within a period of\none year from the date of the taking of any proceedings or passing of any order by an authority subordinate\nto the Commissioner call for and examine the record of the proceedings or the order for the purpose of\nsatisfying himself as to the legality or propriety of the same and may pass such order in reference thereto\nas he may consider fit."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Tax to be levied notwithstanding appeal. The tax shall be levied in accordance with the",
      "content": "valuation list in force for the time being, and shall be collected and be recoverable notwithstanding any\nappeal which may be pending with respect to that list."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Tax when payable. The tax shall be payable half",
      "content": "yearly by such dates as may be prescribed:\n18\n[Provided that Government may, by notification, direct that in any rating area—\n(i)        the tax shall be paid yearly ;\n(ii)       the tax for any specified period shall be paid separately.]"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Recovery of tax from tenants. Where the tax due from any person on account of any building",
      "content": "or land is in arrears, it shall be lawful for the prescribed authority to serve upon any person paying rent in\nrespect of that building or land, or any part thereof, to the person from whom the arrears are due, a notice\nstating the amount of such arrears of tax and requiring all future payments of rent (whether the same have\nalready accrued due or not) by the person paying the rent to be made direct to the prescribed authority\n16\nIns. by West Pakistan Ordinance No. XXVIII of 1963, s. 6.\n17\nAdded by West Pakistan (Adaptation of Laws) Ordinance, 1962 (W. P. Ord. No. XXV of 1962), s. 3.\n18\nSubs. by West Pakistan Ordinance No. XXVIII of 1963, s. 7.\nuntil such arrears shall have been duly paid, and such notice shall operate to transfer to the prescribed\nauthority the right to recover, receive and give a discharge for such rent. If the person paying rent wilfully\nfails or neglects to comply with the notice aforementioned, the prescribed authority may, after giving him\nan opportunity of being heard, proceed against him as it would have proceeded under the provisions of\nthis Act against the owner of the building or land in respect of which the tax is in arrears."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Penalty for default in payment. (1) If any person on being served with such notice as may",
      "content": "be prescribed fails to pay within the period specified in the notice any amount due from him on account\nof the tax, the prescribed authority may recover from him as penalty a sum not exceeding the amount of\nthe tax so unpaid, in addition to the amount of the tax payable by him.\n(2) No such penalty shall be imposed unless the prescribed authority is satisfied that the person\nliable to pay the tax has wilfully failed to pay the same."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Recovery of unpaid dues. (1) If any sum due on account of the tax levied under section 3 or",
      "content": "as a penalty imposed under this Act is not paid within the time allowed for its payment and the person\nfrom whom it is due does not show cause to the satisfaction of the Collector or any other person authorised\nby him why he should not pay the same, such sum (inclusive of all costs of recovery) may be recovered\nunder a warrant in the prescribed form or in a form to the like effect to be signed by the Collector—\n(i)     by distress or sale of the movable property belonging to such person; or\n(ii)    by attachment and sale of the immovable property belonging to him.\nThe warrant may be addressed to an officer of the Excise and Taxation Department for execution,\nand in executing it he may obtain such assistance from other servants of the Department as he may consider\nnecessary.\n(2) Notwithstanding anything contained in sub-section (1), any sum on account of the tax levied\nor penalty imposed under this Act remaining unrecovered shall be recoverable as arrears of land revenue.\n(3) Notwithstanding anything contained in any law and notwithstanding any rights arising out of\nany contract or otherwise whatsoever, any sum due on account of the tax levied under section 3 or as a\npenalty imposed under this Act in respect of any building or land, shall, subject to the prior payment of\nthe land revenue, if any, due to the Government thereon, be a first charge upon such building or land and\nupon the movable property, if any, found within or upon such building or land and belonging to the person\nliable for such tax or penalty."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Remuneration of local authority. When the tax is collected by any local authority such local",
      "content": "authority shall be entitled to such remuneration on account of the cost of collection as may be pre- scribed."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Powers of assessing authority to require returns for valuation list. (1) In every case where",
      "content": "a new valuation list is intended to be made for any rating area, the assessing authority shall give public\nnotice of such intention in such manner as may be prescribed, and may serve a notice on the owner,\noccupier or lessee of any building or land in the said area, or on any one of them, requiring him, or them,\nto make a return containing such particulars as may be prescribed.\n(2) Every person on whom a notice to make a return is served in pursuance of the provisions of\nthis section shall, within thirty days of the date of the service of the notice, make a return in such form as\nis required by the notice, and deliver it in the manner so required to the assessing authority.\n(3) If any person on whom such notice has been served fails within the required period to submit\nsuch return, the assessing authority may proceed to value such property in such manner as it deems fit."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Powers of assessing authority to require return any time",
      "content": "If the assessing authority at any\ntime desires any person, who is the owner, lessee or occupier of any building or land wholly or partly\nwithin the rating area, to make a return with respect to any of the matters regarding which a return may be\nprescribed, it may serve a notice on that person requiring the return, and that person shall, within thirty\ndays from the service of the notice send the required return to the assessing authority :\nProvided that the assessing authority may, in its discretion, extend the period for the delivery of\nany such return."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Valuation list not to be rendered invalid by certain failures or omissions",
      "content": "Any failure on\nthe part of the assessing authority to complete any proceedings with respect to the preparation of a\navaluation list within the time required by this Act or the rules made thereunder, or the omission from\nvaluation list of any matters required by the rules to be included therein shall not, of itself, render the list\ninvalid."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Assessing authorities, officers and servants to be deemed public servants",
      "content": "Every\nassessing authority, and every officer working under the orders of such authority for the purposes of this\nAct, shall be deemed to be a public servant within the meaning of section 21 of the Pakistan Penal Code\n(XLV of 1860)."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Exclusion of jurisdiction of civil courts. No civil court shall have jurisdiction in any matter",
      "content": "which the Government or an assessing authority or any officer or servant is empowered by this Act or the\nrules made thereunder to dispose of, or take cognizance of the manner in which the Government, or any\nassessing authority, officer or servant exercise any powers vested in it or him by or under this Act or the\nrules made thereunder."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Power to make rules. (1) The Government may make rules for carrying out the purposes of",
      "content": "this Act.\n(2) Without prejudice to the generality of the foregoing provisions such rules may provide for any\nor all of the following matters, namely—\n(a)     the appointment, powers and duties of assessing authorities and other provisions\nwith respect to such authorities;\n(b)     the placing of identification marks on, and entry into or upon, any building or land;\n(e)     the preparation and publication of valuation lists, including publication and\ninspection of draft valuation lists, notices of objections and hearing of objections,\nand other matters incidental thereto;\n(d)         the practice and procedure to be followed on and in connection with appeals,\nincluding—\n(i)        notices of appeals ;\n(ii)       prescription of scales of costs ;\n(iii)      prescription of fees to be charged in connection with appeals ;\n(e)         the prescription of the form of any notice, valuation list, statement, return, or other\ndocument whatsoever which is required or authorised to be used under or for the\npurposes of this Act ;\n(f)         the mode of service of any notice, order or document required or authorised to be\nserved ;\n(g)         the inspection and taking copies of and extracts from any draft valuation list,\nvaluation list, notice of objections, proposal for amendment to the\nvaluation list, notice of appeal, valuation made by valuer, and fees for such\ninspection or copies ;\n(h)         the appointment of valuers to advise or assist in connection with the valuation of\nbuildings or lands and their powers and duties ;\n(i)         the time at and the manner in which the amount of tax shall be paid to the\nGovernment ;\n(j)         the portion of the tax to be refunded or геmitted, and the manner in which and the\nconditions subject to which such refund or remission may be granted ;\n(k)         the prescription of fees to be charged in connection with any application made\nunder this Act or the rules made thereunder ;\n(l)         any matter which is required by this Act to be prescribed.\n(3) In making any rules under sub-sections (1) and (2) Government may direct that the prescribed\nauthority may impose a penalty not exceeding two hundred rupees on a person who is guilty of a breach\nof the provisions thereof.\n(4) Rules made under this section shall be laid before the Provincial Assembly of West Pakistan\nas soon as may be after they are made."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Repeal and Saving",
      "content": "(1) The Punjab Urban Immovable Property Tax Act, 1940 (Punjab XVII\nof 1940), the Sind Urban Immovable Property Tax Act, 1948 (Sind IX of 1948), 19[the Sind Urban\nImmovable Property Tax Act, 1948, as applicable to Karachi,] and the North-West Frontier Province\nUrban Immovable Property Tax Act, 1948 (N. W. F. P. XVIII of 1948), are hereby repealed.\n19\nIns. by West Pakistan Ordinance No. I of 1963, s. 3.\n(2) Notwithstanding the repeal of the Acts mentioned in sub-section (1), everything done, action\ntaken, obligation, liability, penalty or punishment incurred, inquiry or proceeding commenced, officer\nappointed or person authorised, jurisdiction or power conferred, rule made and order or notification issued\nunder any of the provisions of the said Acts, shall, if not inconsistent with the provisions of this Act, be\ncontinued, and so far as may be, be deemed to have been respectively done, taken, incurred, commenced,\nappointed authorised, conferred, made or issued under this Act.\n_____\nRGN Date: 27-05-2025"
    }
  ],
  "definitions": [
    {
      "term": "assessing authority",
      "definition": "the assessing authority constituted under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Collector",
      "definition": "an officer appointed by Government by name, or by virtue of his office, to discharge the functions and to perform the duties of a Collector under this Act in any specified area ;",
      "source_provision": "sec2"
    },
    {
      "term": "Commissioner",
      "definition": "an officer appointed by Government by name, or by virtue of his office, to discharge the functions and to perform the duties of a Commissioner under this Act in any specified area;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "Government of West Pakistan ; 2 [(dd) “member of the family of the owner” means his— (i) wife or husband, as the case may be ; (ii) sons and daughters ; and (iii) father and mother ;] 1 Subs. by West Pakistan Ordinance No. I of 1963, s. 2. 2 Ins. by West Pakistan Ordinance No. XXVIII of 1963, s. 2. 3 [(e) “owner” includes a mortgagee with possession, a lessee in perpetuity, a trustee having possession of a trust property and a person to whom an evacuee property has been transferred provisionally or permanently under the Displaced Persons (Rehabilitation and Compensation) Act, 1958 (Act No. XXVIII of 1958) ;]",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Act ;",
      "source_provision": "sec2"
    },
    {
      "term": "rating area",
      "definition": "urban area where tax is levied under the provisions of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "tax",
      "definition": "the tax leviable under the provisions of section 3; and",
      "source_provision": "sec2"
    },
    {
      "term": "urban area",
      "definition": "an area within the boundaries of a Municipal Corporation, Municipal Committee, Cantonment Board, Small Town Committee, or other authority (not being a District Board) legally entitled to, or entrusted ted by Government with the control or management of a municipal or a local fund.",
      "source_provision": "sec2"
    }
  ]
}
