{
  "id": "pk-west-pakistan-usurious-loans-ordinance-1959",
  "type": "statute",
  "title": "West Pakistan Usurious Loans Ordinance, 1959",
  "title_en": "West Pakistan Usurious Loans Ordinance, 1959",
  "short_name": "WPULO",
  "status": "in_force",
  "issued_date": "1959-03-31",
  "in_force_date": "1959-03-31",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tnZg%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Usurious Loans Ordinance, 1959 (XVIII of 1959) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Repeal",
      "content": "WEST PAKISTAN ORDINANCE No. XVIII of 1959\n[1st April, 1959]\nAN\nto consolidate the law relating to usurious loans in the Province of West Pakistan.\nWHEREAS it is expedient to consolidate the law relating to usurious loans in the Province of\nWest Pakistan.\nNOW, THEREFORE, in pursuance of the Presidential Proclamation of the 7th day of October,\n1958, and in exercise of all powers enabling him in that behalf, the Governor of West Pakistan is\npleased to make and promulgate the following Ordinance:__"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent. (1) This Ordinance may be called the West Pakistan Usurious Loans",
      "content": "Ordinance, 1959.\n1\n[(2) It extends to the whole of the Province of West Pakistan, except the Tribal Areas.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless the context otherwise requires, the following",
      "content": "expressions shall have the meanings hereby respectively assigned to them, that is to say__\n(1)        “interest” means rate of interest and includes the return to be made over and\nabove what was actually lent, whether the same is charged or sought to be\nrecovered specifically by way of interest or otherwise;\n(2)        “loan” means a loan whether of money or in kind and includes any transaction\nwhich is in the opinion of the Court, in substance a loan."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Application of the Ordinance. This Ordinance shall apply to all suits pending on or",
      "content": "instituted after its commencement, namely:__\n(a)        for the recovery of a loan made after the twenty-second day of March, Nineteen\nHundred and Eighteen;\n(b)        for the enforcement of any security taken or any agreement whether by way of\nsettlement of account or otherwise, made after the twenty-second day of March,\nNineteen Hundred and Eighteen, in respect of any loan made either before or\nafter the said date; and\n(c)        for the redemption of any security given after the twenty-second day of March,\nNineteen Hundred and Eighteen, in respect of any loan made whether before or\nafter the said date.\n1\nSubs. by the West Pakistan Laws (Extension to Karachi) Ordinance, 1964 (W. P. Ordinance No. VII of 1964), s. 2 and Sch."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Re",
      "content": "opening of transactions. (1) Notwithstanding anything in the Usury Laws Repeal Act,\n1855 (XXVIII of 1855), where, in any suit to which this Ordinance applies, whether heard ex parte or\notherwise, the Court has reason to believe,__\n(a)     that the interest is excessive; or\n(b)     that the transaction was, as between the parties thereto, substantially unfair,\nthe Court shall exercise all or any of the following powers:__\n(i)     re-open the transaction, take an account between the parties, and relieve the\ndebtor of all liability in respect of any excessive interest;\n(ii)    notwithstanding any agreement, purporting to close previous dealings and to\ncreate a new obligation, re-open any account already taken between them and\nrelieve the debtor of all liability in respect of any excessive interest, and if\nanything has been paid or allowed in the account in respect of such liability,\norder the creditor to repay any sum which it considers to be repayable in respect\nthereof;\n(iii)   set aside either wholly or in part or revise or alter any security given or\nagreement made in respect of any loan, and if the creditor has parted with the\nsecurity, order him to indemnify the debtor in such manner and to such extent\nas it may deem just;\nProvided that in the exercise of these powers, the Court shall not–\n(i)     re-open any agreement purporting to close previous dealings and to create a new\nobligation which has been entered into by the parties or any persons from whom\nthey claim at a date more than twelve years from the date of the transaction;\n(ii)    do anything which affects any decree of a Court.\nExplanation.__ In the case of a suit brought on a series of transactions the expression “the\ntransaction” means, for the purposes of proviso (i), the first of such transactions.\n(2) (a) In this section “excessive” means in excess of that which the Court deems to be\nreasonable having regard to the risk incurred as it appeared, or must be taken to have appeared, to the\ncreditor at the date of the loan.\n(b) In considering whether interest is excessive under this section, the Court shall take into\naccount any amounts charged or paid, whether in money or in kind, for expenses, inquiries, fines,\nbonuses, premia, renewals or any other charges, and if compound interest is charged, the periods at\nwhich it is calculated and the total advantage which may reasonably be taken to have been expected\nfrom the transactions.\n(c) In considering the question of risk, the Court shall take into account the presence or absence\nof security and the value thereof, the financial condition of the debtor and the result of any previous\ntransactions of the debtor, by way of loan, so far as the same were known, or must be taken to have\nbeen known, to the creditor.\n(d) In considering whether a transaction was substantially unfair, the Court shall take into\naccount all circumstances materially affecting the relations of the parties at the time of the loan or\ntending to show that the transaction was unfair, including the necessities or supposed necessities of the\ndebtor at the time of the loan so far as the same were known, or must be taken to have been known, to\nthe creditor.\nExplanation.__ Interest may of itself be sufficient evidence that the transaction was substantially\nunfair.\n(e) The Court shall deem interest to be excessive if it exceeds seven and a half per centum per\nannum simple interest or is more than two per centum over the bank rate, whichever is higher at the\ntime of taking the loan, in the case of secured loans, or twelve and a half per centum per annum simple\ninterest in the case of unsecured loans;\nProvided that the provisions of this clause shall not apply if the loan has been advanced by any\nbank which is a ‘scheduled bank’ as defined in the State Bank of Pakistan Act, 1956 (XXXIII of 1956),\nor any banking company registered under the Companies Act, 1913 (VII of 1913), 1[* * *] or any Co-\noperative Society duly registered under any law for the time being in force 1[,] 1[ or any credit\ninstitution to be notified by Government in this behalf.]\n(3) Whatever be the form of the suit this section shall apply if such suit is substantially one for\nthe recovery of a loan or for the enforcement of any agreement or security in respect of a loan or for\nthe redemption of any such security.\n(4) Nothing in this section shall affect the rights of any transferee for value who satisfies the\nCourt that the transfer to him was bona fide, and that he had at the time of such transfer no notice of\nany fact which would have entitled the debtor as against the lender to relief under this section.\nFor the purposes of this sub-section, the word “notice” shall have the same meaning as is\nascribed to it in section 4 of the Transfer of Property Act, 1882 (IV of 1882).\n(5) Nothing in this section shall be construed as derogating from the existing power or\njurisdiction of any Court."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Insolvency proceedings. On any application relating to the admission or amount of a proof",
      "content": "of a loan in any insolvency proceedings, the Court may exercise the like powers as may be exercised\nunder section 3 by a Court in a suit to which this Ordinance applies."
    }
  ],
  "definitions": []
}
