{
  "id": "pk-west-pakistan-vaccination-ordinance-1958",
  "type": "statute",
  "title": "West Pakistan Vaccination Ordinance, 1958",
  "title_en": "West Pakistan Vaccination Ordinance, 1958",
  "short_name": "WPVO",
  "status": "in_force",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5tkZw%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Vaccination Ordinance, 1958 (XXVII of 1958) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Re",
      "content": "vaccination in case of unsuccessful vaccination"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Certificate of insusceptibility",
      "content": "9-A.   Vaccination of unprotected persons\n9-B.   Periodic re-vaccination"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Repeal",
      "content": "WEST PAKISTAN ORDINANCE NO. XXVII OF 1958\nAN\nto consolidate and amend the law relating to vaccination in the Province of West Pakistan.\nPreamble.- WHEREAS it is expedient to consolidate and amend the law relating to\nvaccination in the Province of West Pakistan;\nNOW, THEREFORE, in pursuance of the Presidential Proclamation of the 7th day of October,\n1958, and in exercise of all powers enabling him in that behalf, the Governor of West Pakistan is\npleased to make and promulgate the following Ordinance:__"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent",
      "content": "(1) This Ordinance may be called the West Pakistan Vaccination\nOrdinance, 1958.\n1\n[(2) It extends to the whole of the Province of West Pakistan, except the Tribal Areas.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Ordinance, unless the context otherwise requires, the following\nexpressions shall have the meanings hereby respectively assigned to them, that is to say__\n2\n[(a)   ‘child’ means a person who has not completed the age of sixteen years;]\n3\n[(aa)] “Government” means the Government of West Pakistan;\n(b)        “guardian” includes any person who has accepted or assumed the care or\ncustody of any child;\n(c)        “parent” means the father or mother of a child;\n4\n[(d)   ‘prescribed’ means prescribed by rules made under this Ordinance;\n5\n[(dd) “Smallpox Eradication Officer” means an officer appointed by Government to\nperform the functions and duties of the Smallpox Eradication Officer under this\nOrdinance;]\n(e)       ‘Superintendent of Vaccination’ means a person appointed to perform the duties\nof Superintendent of Vaccination under this Ordinance;\n6 7\n[ [(f)] “unprotected child” and “unprotected person” mean respectively a child or a\nperson who has not been protected from smallpox by having had that disease,\nor by having not been successfully vaccinated, and who has not been certified\n1\nSubstituted by the West Pakistan Ordinance No. XVI of 1969, s.2(2).\n2\nInserted by the West Pakistan Ordinance No. XVI of 1969, s. 3(i).\n3\nRe-lettered by the Ordinance ibid.\n4\nAdded by the West Pakistan Ordinance No. XXXVIII of 1959, s. 2(i).\n5\nInserted by the West Pakistan Ordinance No. XVI of 1969, s. 3(ii).\n6\nRenumbered by the West Pakistan Ordinance No. XXXVIII of 1959, s. 2(ii).\n7\nSubstituted by the West Pakistan Ordinance No. XVI of 1969, s. 3(iii).\nunder this Ordinance to be insusceptible to vaccination;]\n1\n[(g)   ‘vaccination’ means the introduction of Vaccinia Virus (Lymph) into the skin\nin order to confer protection against smallpox; and\n(h) ‘vaccinator’ means any person appointed to perform the operation of\nvaccination.]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Duty of every local authority to carry out the provisions of this Ordinance",
      "content": "2[(1) It shall\nbe the duty of every local authority or Smallpox Eradication Officer to enforce the provisions of this\nOrdinance within their respective jurisdictions so that all unprotected children and persons are\nvaccinated.\n(2) If the Deputy Commissioner receives information from the District Health Officer or any\nSmallpox Eradication Officer that a local authority has failed to execute or enforce any of the\nprovisions of this Ordinance relating to the vaccination of unprotected children or persons, he may,\nafter making such enquiry from the local authority as he thinks fit, by order, empower any public\nservant to execute or enforce the said provisions or to procure the execution or enforcement thereof,\nand the order may fix a reasonable remuneration to be paid to such public servant, and such\nremuneration together with any expenses incurred by the said public servant in performing the duties\nof the local authority under this Ordinance shall be paid by the local authority.]\n(3) If the expenses and the remuneration are not so paid, the Deputy Commissioner may make\nan order directing any person who for the time being has custody of any moneys on behalf of the\nlocal authority, as its officer, treasurer, banker, or otherwise to pay such expenses and remuneration\nfrom such moneys as he may have in his hands or may from time to time receive, and such person\nshall be bound to obey such order.\n(4) When the Deputy Commissioner makes any order under this section, he shall forthwith\nforward to the Commissioner and to the local authority affected thereby a copy of the order with a\nstatement of reasons for making it, and it shall be in the discretion of the Commissioner to rescind the\norder or to direct that it may continue in force with or without modifications.\n(5) The Commissioner shall forthwith submit to Government a report of every case occurring\nunder this section, and Government may confirm, revise or modify the order, or make in respect thereof\nany other order which the Commissioner could have made:\nProvided that no order of the Deputy Commissioner or the Commissioner passed under this\nsection shall be confirmed, revised or modified by Government without giving the local authority a\nreasonable opportunity of showing cause against such order.\n3\n[4. (1) After an unprotected child has attained the age of six months and before the child is\none year of age, the parent or guardian of such child shall take it or cause it to be taken to a\nvaccinator or any other person authorised by Government in this behalf, to be vaccinated, or send for\na vaccinator, or other authorised person to vaccinate it.\n(2) Such vaccinator or other authorised person shall vaccinate the child and deliver to its parent\nor guardian a memorandum stating the date on which the vaccination has been performed and the date\non which the child is to be inspected in order to ascertain the result of the operation, or shall if he finds\n1\nSubstituted by the West Pakistan Ordinance No. XXXVIII of 1959, s. 2(iii).\n2\nSubstituted by the West Pakistan Ordinance No. XVI of 1969, s. 4.\n3\nSubs. by the West Pakistan Ordinance No. XVI of 1969), s.5.\nsuch child in a state unfit for vaccination, deliver to its parent or guardian a certificate under his hand\nto the effect that the child is in a state unfit for vaccination for the whole or part of the current\nvaccination season, and requiring its production for re-vaccination on the expiry of the said period.]\n1\n[5. The parent or guardian of every child which has been vaccinated under section 4 shall on\nthe date of inspection stated in the memorandum take the child or cause it to be taken to a vaccinator\nor any other person authorized in this behalf by Government for inspection or get it inspected at his\nown house by a vaccinator or such authorized person and such vaccinator or authorised person shall\nthen append to the memorandum a certificate showing the result of such inspection and stating that the\nchild has been inspected.]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Certificate of protection",
      "content": "When it is ascertained at the time of inspecting a child under\nsection 5 that the vaccination has been successful, a certificate shall be delivered by the vaccinator to\nthe parent or guardian of such child to that effect, and such child shall thereafter be deemed to be\nprotected."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Certificate of unfitness",
      "content": "A certificate granted under section 4 showing the unfitness of a\nchild for vaccination shall remain in force for the period stated therein and on the termination of that\nperiod, 2[* * * * * * *] the parent or guardian of such child shall take the child or cause it to be taken\nto a vaccinator to be vaccinated or procure its vaccination at his own house by a vaccinator:\nProvided that if the child is still found unfit for vaccination, the certificate granted under\nsection 4 shall be renewed."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Fees",
      "content": "No fee shall be charged by any vaccinator for vaccination:\n2\n[*     *          *          *          *          *       *]"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Enquiry by Superintendent of Vaccination",
      "content": "3[If the Superintendent of Vaccination or\nany other person authorised in this behalf by Government, after an on-the-spot enquiry, has reason to\nbelieve that an unprotected person or the parent or guardian of an unprotected child has contravened\nparent or guardian requiring him to comply with such provisions of the Ordinance as he may have\ncontravened.]"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Report to the sub",
      "content": "Divisional Magistrate and punishment.- 4[(1) If the notice delivered\nunder the last preceding section is not complied with, the Superintendent of Vaccination or other\nperson authorised under section 12 shall report the matter to a Magistrate of the first class who shall\nthereupon summon the person, parent or guardian to whom the notice was issued to comply with the\nnotice within a time to be fixed by the Magistrate.\n(2) If such person, parent or guardian fails to comply with the orders of the Magistrate passed\nunder sub-section (1), then the Magistrate may punish such person, parent or guardian with simple\nimprisonment for a term which may extend to three months or with fine which may extend to one\nhundred rupees, or with both.]"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Punishment",
      "content": "Whoever commits a breach of the provisions of this Ordinance and the rules\nmade thereunder shall be punished with simple imprisonment which may extend to three months, or\nwith fine which may extend to one hundred rupees, or with both."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Power of Government to make rules",
      "content": "(1) Government may frame rules for the purpose\nof carrying into effect the provisions of this Ordinance.\n(2) In particular and without prejudice to the generality of the foregoing powers, Government\nmay frame rules for all or any of the following purposes, namely:__\n(a) prescribing qualifications, conditions of service and uniform for vaccinators;\n5\n[(aa) prescribing the authorities by whom appointments under this Ordinance are to\n1\nSubstituted by the West Pakistan Ordinance No. XVI of 1969, s. 9.\n2\nOmitted by the West Pakistan Ordinance No. XVI of 1969, s. 10.\n3\nSubstituted by the West Pakistan Ordinance No. XVI of 1969, s. 11.\n4\nSubstituted by the West Pakistan Ordinance No. XVI of 1969, s.12.\n5\nInserted by the West Pakistan Ordinance No. XXXVIII of 1959, s.5.\nbe made;]\n(b) regulating the manner in which the Superintendent of Vaccination shall\nexercise his duties under this Ordinance;\n(c) prescribing the lymph that may be used for vaccination;\n1\n[(d) *            *          *           *      *      *    *]\n(e) prescribing registers to be maintained under this Ordinance; and\n(f) prescribing the forms for notices and certificates."
    }
  ],
  "definitions": [
    {
      "term": "guardian",
      "definition": "any person who has accepted or assumed the care or custody of any child;",
      "source_provision": "sec2"
    },
    {
      "term": "parent",
      "definition": "the father or mother of a child; 4 [(d) ‘prescribed’ means prescribed by rules made under this Ordinance; 5 [(dd) “Smallpox Eradication Officer” means an officer appointed by Government to perform the functions and duties of the Smallpox Eradication Officer under this Ordinance;] (e) ‘Superintendent of Vaccination’ means a person appointed to perform the duties of Superintendent of Vaccination under this Ordinance; 6 7 [ [(f)] “unprotected child” and “unprotected person” mean respectively a child or a person who has not been protected from smallpox by having had that disease, or by having not been successfully vaccinated, and who has not been certified 1 Substituted by the West Pakistan Ordinance No. XVI of 1969, s.2(2). 2 Inserted by the West Pakistan Ordinance No. XVI of 1969, s. 3(i). 3 Re-lettered by the Ordinance ibid. 4 Added by the West Pakistan Ordinance No. XXXVIII of 1959, s. 2(i). 5 Inserted by the West Pakistan Ordinance No. XVI of 1969, s. 3(ii). 6 Renumbered by the West Pakistan Ordinance No. XXXVIII of 1959, s. 2(ii). 7 Substituted by the West Pakistan Ordinance No. XVI of 1969, s. 3(iii). under this Ordinance to be insusceptible to vaccination;] 1 [(g) ‘vaccination’ means the introduction of Vaccinia Virus (Lymph) into the skin in order to confer protection against smallpox; and (h) ‘vaccinator’ means any person appointed to perform the operation of vaccination.]",
      "source_provision": "sec2"
    }
  ]
}
