{
  "id": "pk-west-pakistan-vagrancy-ordinance-1958",
  "type": "statute",
  "title": "West Pakistan Vagrancy Ordinance, 1958",
  "title_en": "West Pakistan Vagrancy Ordinance, 1958",
  "short_name": "WPVO",
  "status": "in_force",
  "issued_date": "1958-09-30",
  "in_force_date": "1958-09-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5prbA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of West Pakistan Vagrancy Ordinance, 1958 (XX of 1958) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Repeal",
      "content": "WEST PAKISTAN ORDINANCE No. XX OF 1958.\n[1st October, 1958]\nAN\nto amend and consolidate the law relating to vagrancy in the Province of West Pakistan.\nPreamble. WHEREAS it is expedient to amend and consolidate the law relating to vagrancy\nin the Province of West Pakistan in the manner hereinafter appearing;\nAND WHEREAS the Provincial Assembly of West Pakistan is not in session and the Governor\nof West Pakistan is satisfied that circumstances exist which render immediate action necessary;\nNOW, THEREFORE, in exercise of the powers conferred by Article 102 of the Constitution,\nthe Governor of West Pakistan is pleased to make and promulgate the following Ordinance:__"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement. (1) This Ordinance may be called the West",
      "content": "Pakistan Vagrancy Ordinance, 1958.\n1\n[(2) It extends to the whole of the Province of West Pakistan except the Tribal Areas.]\n(3) It shall come into force in such area or areas and on such date or dates as Government may,\nby notification, direct."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless the context otherwise requires, the following",
      "content": "expressions shall have the meanings hereby respectively assigned to them, that is to say__\n(a)        “child” means a person under the age of fourteen years;\n(b)        “Controller” means the Controller of Vagrancy, West Pakistan;\n(c)        “Government” means the Government of West Pakistan;\n(d)        “guardian” in relation to a child, includes any person who in the opinion of the\ncourt having cognizance of any case in which a child is concerned, has for the\ntime being the charge of or control over such child;\n(e)        “prescribed” means prescribed by rules made under this Ordinance;\n1\nSubs. by the West Pakistan Laws (Extension to Karachi) Ordinance, 1964 (Ordinance No. VII of 1964), published in the Gazette of West Pakistan\n(Extraordinary), dated May 25, 1964, pp. 1679-1688, s. 2 read with Schedule, Serial No. 15.\n(f)     “public place” includes any public park, garden, railway station, ground or\nvehicle to which the public for the time being have access, whether on payment\nor otherwise;\n(g)     “vagrant” means a person who__\n(i)     solicits or receives alms in a public place;\n(ii)    exposes or exhibits any sore, wound, injury, deformity or disease in a\npublic place for the purpose of soliciting or receiving alms;\n(iii)   allows himself to be used as an exhibit for the purpose of soliciting or\nreceiving alms;\n(iv)    enters on any private premises without the invitation of the occupier for\nthe purpose of soliciting or receiving alms;\nbut does not include a person who solicits or receives money, food or gift for a purpose\nauthorised by rules under a prescribed certificate;\n(h)     “welfare home” means an institution established and maintained by\nGovernment for the detention, training, employment and maintenance of\nvagrants and their dependents other than those who are lepers, lunatics or\nsuffering from contagious diseases and includes an institution notified by\nGovernment as such for the purposes of this Ordinance."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Welfare homes. (1) Government shall establish and maintain one or more welfare homes at",
      "content": "such place or places as it thinks fit for the custody and detention of vagrants.\n(2) Government may, by notification, declare any existing charitable or other institution with\nprevious consent of the controlling authority of such institution and on such conditions as may be\nmutually agreed upon between Government and the said authority, to be a welfare home for the\npurposes of this Ordinance."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Manager. Every welfare home shall be under the immediate charge of a manager appointed",
      "content": "by Government and such manager shall be assisted by such medical and educational staff as\nGovernment may appoint."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Duties of the manager. (1) The manager of a welfare home shall, as soon as may be, get",
      "content": "every vagrant medically examined and the report of the examination shall state, inter alia__\n(a)     the sex and the age of the vagrant;\n(b)     whether the vagrant is a leper ?\n(c)     whether he is suffering from any other contagious disease ?\n(d)     whether the vagrant is insane, or mentally deficient ?\n(e)     what is the general state of health and bodily condition of the vagrant and for\nwhich, if any, of the prescribed types of work such vagrant is fit ?\n(2) The manager of a welfare home shall keep the following classes of vagrants separately from\neach other__\n(a)     children;\n(b)     females;\n(c)     lepers or persons suffering from contagious diseases;\n(d)     lunatics;\n(e)     infirm, old or incapacitated;\n(f)     able bodied:\nProvided that children less than seven years of age or females may be allowed to take up\nresidence in the same apartment in which any male member of their family is confined.\n(3) The manager shall arrange__\n(a)     for the education of the children detained in the welfare home;\n(b)     for such instruction of the vagrants, as may rehabilitate them in useful trades\nand make them self-supporting."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Voluntary admission to welfare homes. Any old, infirm or disabled person or a child may",
      "content": "present himself before the District Magistrate for being admitted to a welfare home and if the District\nMagistrate is satisfied that such person has no source of livelihood, he may be detained in a welfare\nhome till such time as such person becomes possessed of means of livelihood or applies for his release\nfrom custody."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Powers of police officer to arrest and search vagrants and to seize things liable to",
      "content": "confiscation. (1) Any police officer may without an order from a Magistrate and without a warrant,\narrest and search any person who appears to him to be a vagrant and may seize anything found on or\nabout such person which he has reason to believe to be liable to confiscation under this Ordinance.\n(2) A person arrested under the last preceding sub-section, shall be released if he furnishes bail\nto the satisfaction of the police officer making arrest for his appearance before the Magistrate having\njurisdiction in the area where the arrest is made.\n(3) If the person arrested is not able to furnish bail to the satisfaction of the police officer\nmaking arrest, such person shall be detained in custody and shall be produced before the nearest\nMagistrate within a period of twenty-four hours of such arrest, excluding the time necessary for the\njourney from the place of arrest to the Court of the Magistrate and no such person shall, be detained in\ncustody beyond the said period without an authority of the Magistrate."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Trial. When the person arrested under the last preceding section appears or is brought before",
      "content": "the Magistrate, he shall be tried in accordance with the procedure prescribed for the trial of summons\ncases under Chapter XX of the Code of Criminal Procedure, 1898 (V of 1898):\nProvided that whenever any Magistrate, after having heard and recorded the whole or any part\nof the evidence in a trial, ceases to exercise jurisdiction therein, and is succeeded by another\nMagistrate, who has and who exercises such jurisdiction, the Magistrate so succeeding may act on the\nevidence so recorded by his predecessor or partly recorded by his predecessor and partly recorded by\nhimself; or he may resummon the witnesses and recommence the enquiry or trial."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Sentence for vagrancy. If the Magistrate finds that a person is a vagrant, such person shall",
      "content": "be punished with imprisonment of either description for a period not exceeding three years:\nProvided that in any case in which a person who has not been previously convicted of an\noffence under this Ordinance, is convicted of an offence under this Ordinance, the Magistrate may\ninstead of sentencing him to a term of imprisonment, release him after due admonition on his, or in\ncase such vagrant is a child, on his guardian entering into a bond with or without sureties to appear\nand receive the sentence when called upon during such period (not exceeding three years) as the\nMagistrate may direct and in the meantime to refrain from conducting himself as a vagrant."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Punishment for employing or causing persons to ask for alms. Whoever employs or",
      "content": "causes any person to solicit or receive alms or uses a person as an exhibit for the purpose of soliciting\nor receiving alms or being the guardian of a child connives at or encourages the employment or the\ncausing of the child to solicit or receive alms shall be punished with imprisonment of either description\nfor a term which may extend to one year or with fine or with both."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Presumption. If a person has no ostensible source of subsistence and wanders about or",
      "content": "remains in a public place in such condition or manner as raises a reasonable suspicion that he is there\nto solicit or receive alms, it shall be presumed, unless the contrary is proved that such person is a\nvagrant."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Detention of dependents. (1) If any vagrant sentenced under section 9 to a term of",
      "content": "imprisonment has a child below seven years of age or any other person wholly dependent upon him,\nthe Magistrate may, after making such inquiry as he thinks fit and after giving such person an\nopportunity of being heard, direct that such child or person shall be detained in the welfare home so\nlong as the vagrant remains in custody:\nProvided that a child of the vagrant who is below the age of seven years shall be detained along\nwith the vagrant until he attains the age of seven years.\n(2) Where the dependent is a child above seven years of age, or when the child detained under\nthe last preceding sub-section, attains the age of seven years, the Magistrate or any other officer\nempowered by Government in this behalf may direct that such child be detained in any other institution\napproved by Government."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Compulsory contribution by persons bound to maintain vagrants. (1) If the Magistrate",
      "content": "is satisfied that a vagrant or a person bound to maintain a vagrant has sufficient means, he shall make\nan order directing such vagrant or the person bound to maintain such vagrant, as the case may be, to\ncontribute in the prescribed manner towards the maintenance of such vagrant in a welfare home:\nProvided that no order under this sub-section shall be made without giving the person from\nwhom contribution is required the opportunity of being heard.\n(2) If any contribution directed by the Magistrate under the last preceding sub-section remains\nunpaid, the same may be recovered as arrears of land revenue."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Place of detention or imprisonment. A vagrant arrested under this Ordinance shall remain",
      "content": "in custody, or, if convicted serve his term of imprisonment in the prescribed manner, as the case may\nbe, in the nearest welfare home or such other place as Government may, by general or special order,\ndirect."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Transfer of vagrants from welfare homes. The Controller or any other officer specially",
      "content": "empowered by Government in this behalf may by an order in writing direct the transfer of a vagrant\nfrom one welfare home to another or to any other place appointed by Government in this behalf."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Release on probation or short leave. The Controller or any other officer specially",
      "content": "empowered by Government in this behalf may, subject to such conditions as may be prescribed,__\n(a)        release any vagrant on probation after he has served imprisonment for a period\nnot less than one year;\n(b)        release a vagrant detained in a welfare home by granting him a licence, and,\nafter the expiration of three months from the commencement of the release on\nlicence, recommend to Government the unconditional release of such vagrant if\nhe considers that there is probability of such vagrant’s abstaining from\nvagrancy;\n(c)        grant short leave of absence to any vagrant detained in a welfare home 1[and the\nDistrict of Karachi]:\nProvided that a vagrant contravening any condition relating to his release on\nlicence may be re-arrested under the orders of the Controller and sent to the welfare\nhome for completing the sentence awarded to him under section 9."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Powers of discharge of vagrants from welfare homes. The Controller or any other officer",
      "content": "specially empowered by Government in this behalf may discharge a vagrant from a welfare home__\n(a)        if he is satisfied that a vagrant has become possessed of an income sufficient to\nenable him to support himself without resorting to vagrancy;\n1\nSubs. by the West Pakistan Laws (Extension to Karachi) Ordinance, 1964 (Ordinance No. VII of 1964), published in the Gazette of West Pakistan\n(Extraordinary), dated May 25, 1964, pp. 1679-1688, s. 2 read with Schedule, Serial No. 15.\n(b)    if a relative of such vagrant, or a person interested in the welfare of the vagrant,\nenters into a bond with or without sureties to look after and maintain such\nvagrant and to prevent him from resorting to vagrancy;\n(c)    on the certificate of the manager of the welfare home that satisfactory\nemployment has been obtained for such vagrant;\n(d)    for any other good and sufficient reason to be recorded in writing."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Effect of other laws and enactments. The provisions of this Ordinance, and any order",
      "content": "made or action taken under this Ordinance, shall have effect notwithstanding anything inconsistent\ntherewith contained in any enactment other than this Ordinance, for the time being in force, and any\ninstrument having its effect by virtue of any such enactment other than this Ordinance."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Appeal. Any person aggrieved by an order of a Magistrate under this Ordinance may within",
      "content": "thirty days of such order appeal to the District Magistrate and if such order is made by the District\nMagistrate, to the Sessions Court."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Persons to be deemed to be public servants. All persons empowered to perform any",
      "content": "function under this Ordinance shall be deemed to be public servants within the meaning of section 21\nof the Pakistan Penal Code, 1860 (XLV of 1860)."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Indemnity. No suit, prosecution, or other legal proceeding shall lie against any person for",
      "content": "anything in good faith done or intended to be done under this Ordinance."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Power to make rules. (I) Government may make rules for carrying out the purposes of this",
      "content": "Ordinance.\n(2) In particular and without prejudice to the generality of the foregoing power, such rules may\nprovide for all or any of the following matters, namely:__\n(a)    the purposes for which a person may solicit or receive money or ask for food or\ngift referred to in clause (g) of section 2 and the form of the certificate;\n(b)    the manner in which Controller shall discharge his functions;\n(c)    the manner in which a medical officer may examine a vagrant;\n(d)    the types of works for which a vagrant may be reported fit;\n(e)    the types of the hard labour which is to form the punishment;\n(f)    the manner in which an imprisonment under this Ordinance may be served;\n(g)    the manner in which a vagrant may be transferred from one welfare home to\nanother or to any other place of detention;\n(h)    the manner in which the manager of a welfare home is to certify that satisfactory\nemployment has been obtained for a vagrant;\n(i)    the place or institutions where children detained under this Ordinance are to be\nconfined;\n(j)    the places or institutions where lepers, lunatics and persons suffering from\ncontagious diseases may be confined.\n(3) Every rule under this Ordinance shall be laid before the West Pakistan Assembly and may\nbe amended or repealed by a resolution of the said Assembly."
    }
  ],
  "definitions": [
    {
      "term": "child",
      "definition": "a person under the age of fourteen years;",
      "source_provision": "sec2"
    },
    {
      "term": "Controller",
      "definition": "the Controller of Vagrancy, West Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Government of West Pakistan;",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules made under this Ordinance; 1 Subs. by the West Pakistan Laws (Extension to Karachi) Ordinance, 1964 (Ordinance No. VII of 1964), published in the Gazette of West Pakistan (Extraordinary), dated May 25, 1964, pp. 1679-1688, s. 2 read with Schedule, Serial No. 15.",
      "source_provision": "sec2"
    },
    {
      "term": "public place",
      "definition": "any public park, garden, railway station, ground or vehicle to which the public for the time being have access, whether on payment or otherwise;",
      "source_provision": "sec2"
    },
    {
      "term": "vagrant",
      "definition": "a person who__ (i) solicits or receives alms in a public place; (ii) exposes or exhibits any sore, wound, injury, deformity or disease in a public place for the purpose of soliciting or receiving alms; (iii) allows himself to be used as an exhibit for the purpose of soliciting or receiving alms; (iv) enters on any private premises without the invitation of the occupier for the purpose of soliciting or receiving alms; but does not include a person who solicits or receives money, food or gift for a purpose authorised by rules under a prescribed certificate;",
      "source_provision": "sec2"
    },
    {
      "term": "welfare home",
      "definition": "an institution established and maintained by Government for the detention, training, employment and maintenance of vagrants and their dependents other than those who are lepers, lunatics or suffering from contagious diseases and includes an institution notified by Government as such for the purposes of this Ordinance.",
      "source_provision": "sec2"
    }
  ]
}
