{
  "id": "pk-wild-birds-and-animals-protection-act-1912",
  "type": "statute",
  "title": "Wild Birds and Animals Protection Act, 1912",
  "title_en": "Wild Birds and Animals Protection Act, 1912",
  "short_name": "WBAAP",
  "status": "in_force",
  "issued_date": "1912-09-17",
  "in_force_date": "1912-09-17",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apiV-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Wild Birds and Animals Protection Act, 1912 (VIII of 1912) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title and extent. (1) This Act may be called the Wild Birds and Animals Protection",
      "content": "Act, 1912 ; and\n2\n[(2) It extends to the whole of Pakistan.]"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Application of Act. (1) This Act applies, in the first instance, to the birds and animals",
      "content": "specified in the Schedule, when in their wild state.\n(2) The 3[Provincial Government] may, by notification in the 4[official Gazette], apply the\nprovisions of this Act to any kind of wild bird or animal, other than those specified in the Schedule,\nwhich, in its opinion, it is desirable to protect or preserve."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Close time. The 3[Provincial Government] may, by notification in the 4[official Gazette], declare",
      "content": "the whole year or any part thereof to be a close time throughout the whole or any part of its territories\nfor any kind of wild bird or animal to which this Act applies, or for female or immature wild birds or\nanimals of such kind ; and, subject to the provisions hereinafter contained, during such close time,\nand within the areas specified in such notification, it shall be unlawful—\n(a)        to capture any such bird or animal, or to kill any such bird or animal which has not\nbeen captured before the commencement of such close time ;\n(b)        to sell or buy, or offer to sell or buy, or to possess, any such bird or animal which has\nnot been captured or killed before the commencement of such close time, or the flesh\nthereof ;\n(c)        if any plumage has been taken from any such bird captured or killed during such close\ntime, to sell or buy, or to offer to sell or buy, or to possess, such plumage.\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1912, Pt. V, p. 2 ; for Report of Select Committee, see ibid., 1912, Pt. V, p. 173 ; and for\nProceedings in Council, see ibid., 1912, Pt. VI, pp. 57 and 691.\nThis Act has been extended to the Leased Areas of Baluchistan, see G. G. O. 3 of 1950 ; and applied in the Federated Areas of Baluchistan, see Gazette\nof India, 1937, Pt. I, p. 1499.\nThe Act has been amended in its application to Baluchistan by Regulation III of 1942.\nIt has been repealed in its application to the N.W.F.P. by the N.W.F.P. Wild Birds and Wild Animals Protection Act, 1950 (N.W.F.P. Act 13 of 1950).\ntemporarily enacted by the Punjab Act VI of 1973 and on the expiry of the Ordinance as so enacted, by Punjab Act II of 1974, s. 48.\nThis Act has been rep. to the extent of Islamabad Capital Territory, see, Ordinance No. XXVII of 1981, s. 4 and 3rd Sch.\n2\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch., (with effect from the 14th October, 1955), for the original\nsub-section (2) as amended by A. O., 1949, and the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 8.\n3\nSubs. by A. O., 1937, for \"L. G.\".\n4\nSubs. ibid., for \"local official Gazette\".\n4.Penalities. (1) Whoever does or attempts to do, any act in contravention of section 3, shall\nbe punishable with fine which may extend to fifty rupees.\n(2) Whoever, having already been convicted of an offence under this section, is again\nconvicted thereunder shall, on every subsequent conviction, be punishable with imprisonment for a\nterm which may extend to one month, or with fine which may extend to one hundred rupees, or with\nboth."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Confiscation. (1) When any person is convicted of an offence punishable under this Act,",
      "content": "the convicting Magistrate may direct that any bird or animal in respect of which such offence has\nbeen committed, or the flesh or any other part of such bird or animal, shall be confiscated.\n(2) Such confiscation may be in addition to the other punishment provided by section 4 for\nsuch offence."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Cognizance of offences. No Court inferior to that of 1* * * a Magistrate of the second",
      "content": "class shall try any offence against this Act."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Power to grant exemption. Where the 2[Provincial Government] is of opinion that, in the",
      "content": "interests of scientific research, such a course is desirable, it may grant to any person a license, subject\nto such restrictions and conditions as it may impose, entitling the holder thereof to do any act which\nis by section 3 declared to be unlawful."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Savings. Nothing in this Act shall be deemed to apply to the capture or killing of a wild",
      "content": "animal by any person in defence of himself or any other person, or to the capture or killing of any\nwild bird or animal in bona fide defence of property."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. [Repeal.] Rep. by the Second Repealing and Amending Act, 1914 (XVII of 1914), s. 3 and",
      "content": "Schedule II.\n____\n(i)        Bustards, ducks, floricans, jungle fowl, partridges, peafowl, pheasants, pigeons, quail,\nsand-grouse, painted snipe, spurfowl, wood-cock, herons, egrets, rollers, and\nking-fishers.\n(ii)       Antelopes, asses, bison, buffaloes, deer, gazelles, goats, hares, oxen, rhinoceroses and\nsheep.\n_________\nDate: 11-09-2024\n1\nThe original words \"a Presidency Magistrate or\" omitted by A. O., 1961, Art. 2 and Sch. (with effect from the 23rd March, 1956).\n2\nSubs. by A.O., 1937, for \"L. G.\"."
    }
  ],
  "definitions": []
}
