{
  "id": "pk-witness-protection-security-and-benefit-act-2017",
  "type": "statute",
  "title": "Witness Protection, Security and Benefit Act, 2017",
  "title_en": "Witness Protection, Security and Benefit Act, 2017",
  "short_name": "WPSAB",
  "status": "in_force",
  "issued_date": "2017-02-16",
  "in_force_date": "2017-02-16",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Npa5lraA%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Witness Protection, Security and Benefit Act, 2017 (XX of 2017) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Witness\nProtection, Security and Benefit Act, 2017.\n(2) lt extends to such areas in the Federation as are not included in any Province.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,",
      "content": "(a)     “Board” means the Witness Protection Advisory Board constituted under\nsection 5;\n(b)     “criminal proceedings” include any criminal trial or inquiry before a court or\ntribunal having criminal jurisdiction, an inquest or inquiry into death and a\npolice investigation under the Code of Criminal Procedure, 1898 (Act V of\n1898) and any investigation by any other authority under any law;\n(c)      “Government” means the Federal Government;\n(d)      “law enforcement agency” includes a body or agency responsible for the\nenforcement of laws relating to the prevention, detection and investigation of\nany offence.\n(e)      “prescribed” means prescribed by rules;\n(f)     “programme” means the witness protection programme established under this\nAct;\n(g)      “protected person” means any person who has been placed under protection for\nthe purposes of this Act;\n(h)     “related person” means any member of the family or household of the witness\nor any other person in a close relationship to, or association with, such witness;\n(i)     “rules” means the rules made under this Act;\n(j)     “Schedule” means the Schedule to this Act;\n(k)     “serious offence” means an offence as specified in the Schedule;\n(l)     “unit” means the witness protection unit established under this Act;\n(m)     “witness” means a person who—\n(i)     has made a statement or has given or agreed or may be required to give\nevidence in relation to the commission or possible commission of a\nserious offence;\n(ii)    because of his or her relationship to or association with a person, referred\nto in sub-clause (i), may require protection or other assistance under this\nAct; or\n(iii)   is a person in possession of or who is required to provide any important\ninformation, statement or assistance to a ·public officer and has agreed\nto share the information with law enforcement agency and has agreed to\ngive evidence on behalf of the State;\n(iv)    for any other reason, may require protection or other assistance under\nthis Act."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Application of the Act and over",
      "content": "riding effect. — (1) The provisions of this Act shall be\napplicable to the investigation, inquiry and trial of serious offences.\n(2) In case of any inconsistency, the provisions of this Act shall have effect notwithstanding\nanything inconsistent therewith contained in any provision of the Code of Criminal Procedure, 1898\n(Act V of 1898), or in any provision of any other law for the time being in force."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Witness Protection Programme",
      "content": "(1) As soon as after the commencement of this Act, the\nGovernment shall establish a Witness Protection Programme for protection and safety of a witness or\nany other related in respect of scheduled offences.\n(2) The actions in the Programme may include the following, namely:—\n(a)     making arrangements necessary—\n(i)     to allow the witness to establish a new identity;\n(ii)    to allow the witness to conceal his identity by wearing a mask, changing\nhis voice, appearance or any other form of segregation during the\ninvestigation or trial or examination under the law;\n(iii)   is a person in possession of or who is required to provide any important\ninformation, statement or assistance to a public officer and has agreed\nto share the information with law enforcement agency and has agreed to\ngive evidence on behalf of the State;\n(iv)    for any other reason, may require protection or other assistance under\nthis Act.\n(b)    relocating the witness;\n(c)    providing accommodation for the witness;\n(d)    providing reasonable financial assistance to the witness, whenever practicable,\nfor obtaining a means of livelihood;\n(e)    providing compensation to the legal heirs, if the protected person is killed due\nto his participation in the Programme, in case of death or permanent in capacity\nof the protected person during his protection, providing free education to his\ndependent minors; and"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Establishment of Witness Protection Advisory Board",
      "content": "(l) The Government shall\nconstitute a Board to be known as the Witness Protection Advisory Board, which shall consist of—\n(a)   Secretary of the administrative Ministry;                                   Chairperson\n(b)   Secretary, Ministry of Law and Justice;                                      Member\n(c)   Secretary, Ministry of Finance;                                              Member\n(d)   Attorney-General for Pakistan;                                               Member\n(e)   Inspector General of Police, Islamabad Capital Territory.                    Member\n(2) The Board shall advise the Unit generally on the exercise of its powers and performance of\nits functions under this Act and shall, in particular and without prejudice to the generality of the\nforegoing,—\n(a)    advise on the formulation of witness protection policies in accordance with the\ncurrent law and international best practices;\n(b)    oversight the administration of the Unit;\n(c)    approve budgetary estimates of the Unit; and\n(d)    exercise such other powers and perform such other functions as may be\nconferred by or under this Act or assigned to it by the Government."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Witness Protection Unit",
      "content": "(1) To facilitate and implement the Programme there shall be\nestablished in the administrative Ministry a Unit to be called the Witness Protection Unit.\n(2) The Government may, by notification in the official Gazette—\n(a)    establish a branch office of the Unit in any defined area for the purposes of the\nadministration of this Act; or\n(b)    abolish any branch office or incorporate it with any other such office and may\nfor this purpose make any administrative or other arrangements as deemed\nnecessary."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Functions of the Unit",
      "content": "The functions of the Unit shall be to—\n(a)     establish and maintain the Programme;\n(b)     determine the criteria for admission to and removal from the Programme;\n(c)     determine the type of protection measures to be applied;\n(d)      advise any Government department, agency, body or any other person on the\nadoption of strategies and measures on witness protection; and\n(e)     perform such other functions as may be necessary for carrying out the purposes\nof this Act or any other functions as may be assigned to it by the Government."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Memorandum of agreement with the person to be protected. Before a person is provided",
      "content": "protection under this Act, he shall first execute a memorandum of agreement which shall set forth his\nresponsibilities, including to—\n(a)     testify before and provide information to all appropriate law enforcement\nofficials concerning all appropriate proceedings in connection with or arising\nfrom the activities involved in the offence charged;\n(b)     avoid the commission of the crime;\n(c)     take all necessary precautions to avoid detection by others of the facts\nconcerning the protection provided to him under this Act;\n(d)     comply with legal obligations and civil judgments against him;\n(e)     cooperate with respect to all reasonable requests of officers and employees of\nthe Government who are providing protection under this Act; and\n(f)     regularly infonn the appropriate Programme official of his current activities\nand address."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Breach of the memorandum of agreement. Substantial breach of the memorandum of",
      "content": "agreement shall be a ground for the termination of the protection provided under this Act:\nProvided that before terminating such protection, the Unit shall send notice to the person\ninvolved of the termination of the protection provided under this Act, stating therein the reason for\nsuch termination."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Confidentiality of proceedings.All proceedings involving application for admission into",
      "content": "documents given or submitted in support thereof shall be released except upon written order of the\ndepartment or the court of appropriate jurisdiction."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Annual report",
      "content": "(1) The Government shall prepare an annual report relating to the\ngeneral operation, performance and effectiveness of the Programme which shall be laid before the\nParliament.\n(2) The Witness Protection Board or Unit, as the case may be, whenever considers it necessary\nto do so, present special report to the Government on any matter relating to the Programme which shall\nbe laid before the parliament."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Rules. The Government may make rules for carrying out the purposes of this Act",
      "content": "_________________\n[Section 2 (k)]\n(Offences in respect of which a witness or related person may be placed under protection)"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Any offence relating to exchange control, corruption, extortion, fraud, forgery, uttering or theft",
      "content": "(a)     involving amounts of more than five million Rupees; or\n(b)     involving amounts exceeding one million Rupees if it is alleged that the offence was\ncommitted by a person, group of persons, syndicate or any enterprise acting in the\nexecution or furtherance of a common purpose or conspiracy; or\n(c)     if it is alleged that the offence was committed by any law enforcement officer—\n(i)     involving amounts exceeding one million Rupees; or\n(ii)     as a member of a group of persons, syndicate or any enterprise acting in the\nexecution or furtherance of a common purpose or conspiracy."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Any other offence in respect of which it is alleged that the offence was committed by",
      "content": "(a)     a person, group of person, syndicate or any enterprise acting in the execution or\nfurtherance of a common purpose or conspiracy; or\n(b)     a law enforcement officer and in respect of which the chief witness protection\nofficer is of the opinion that the safety of a witness, who is or may be required\nto give evidence or who has given evidence in respect of such an offence in any\nproceedings or any related person, warrants protection."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the Witness Protection Advisory Board constituted under section 5;",
      "source_provision": "sec2"
    },
    {
      "term": "Government",
      "definition": "the Federal Government;",
      "source_provision": "sec2"
    },
    {
      "term": "law enforcement agency",
      "definition": "a body or agency responsible for the enforcement of laws relating to the prevention, detection and investigation of any offence.",
      "source_provision": "sec2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by rules;",
      "source_provision": "sec2"
    },
    {
      "term": "programme",
      "definition": "the witness protection programme established under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "protected person",
      "definition": "any person who has been placed under protection for the purposes of this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "related person",
      "definition": "any member of the family or household of the witness or any other person in a close relationship to, or association with, such witness;",
      "source_provision": "sec2"
    },
    {
      "term": "rules",
      "definition": "the rules made under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "Schedule",
      "definition": "the Schedule to this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "serious offence",
      "definition": "an offence as specified in the Schedule;",
      "source_provision": "sec2"
    },
    {
      "term": "unit",
      "definition": "the witness protection unit established under this Act;",
      "source_provision": "sec2"
    },
    {
      "term": "witness",
      "definition": "a person who— (i) has made a statement or has given or agreed or may be required to give evidence in relation to the commission or possible commission of a serious offence; (ii) because of his or her relationship to or association with a person, referred to in sub-clause (i), may require protection or other assistance under this Act; or (iii) is a person in possession of or who is required to provide any important information, statement or assistance to a ·public officer and has agreed to share the information with law enforcement agency and has agreed to give evidence on behalf of the State; (iv) for any other reason, may require protection or other assistance under this Act.",
      "source_provision": "sec2"
    }
  ]
}
