{
  "id": "pk-women-in-distress-and-detention-fund-act-1996-repealed-by-act-xvi-of-2020",
  "type": "statute",
  "title": "Women in Distress and Detention Fund Act, 1996 (Repealed by Act XVI of 2020)",
  "title_en": "Women in Distress and Detention Fund Act, 1996 (Repealed by Act XVI of 2020)",
  "short_name": "WIDAD",
  "status": "repealed",
  "issued_date": "1996-11-30",
  "in_force_date": "1996-11-30",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apqWaQ%3D%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Women in Distress and Detention Fund Act, 1996 (Repealed by Act XVI of 2020) (XV of 1996) published by The Pakistan Code (Criminal Laws).",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Act may be called the Women in\nDistress and Detention Fund Act, 1996.\n(2)       It extends to the whole of Pakistan.\n(3)       It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is anything repugnant in the subject or context",
      "content": "(a)       “Board means the Board Governors set up under section 6 ;\n(b)       “Fund” means the Fund for women in Distress and Detention established under\nsection 3; and\n(c)       “women in distress and detention” means a female or a class of females in need of\nfinancial assistance to alleviate her or their miseries due to detention, litigation or for\nsimilar connected matters."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Establishment of the Fund. The Federal Government shall establish the Fund for",
      "content": "Women in Distress and Detention to carry out the purposes of this Act."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Purpose of the Fund.The purpose of the Fund shall be to provide financial and legal",
      "content": "assistance to women in distress and detention."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Sources of Fund",
      "content": "(1) The Fund shall consist of the following sources, namely:—\n(a)       grants from the Federal Government and Provincial Governments;\n(b)       aid and assistance from local, national and international agencies;\n(c)       contributions from the statutory bodies,, corporations, private organizations and\nindividuals;1[*]\n1\nOmitted by Ord. 112 of 2002,s.2.\n(d)       income and earnings from the moveable and immovable properties acquired or leased\n1\nby the fund [;and]\n1\n[(e) any income from the investment of the amount credited to the Fund.]\n(2)       The amount credited to the Fund shall not lapse at the end of a financial year and shall\nbe available for utilization at any time.\n1\n[(3)   The capital of the Fund in full or a part thereof may be invested in any Government\nsavings scheme and the interest, profit or earnings thus obtained may be utilized for the purposes of\nthe Fund.]"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Board of Governors",
      "content": "(1) The management, overall control and supervision of the\naffairs of the Fund shall vest in a Board of Governors consisting of the following members,\nnamely: —\n2\n[(a)   Minister-in-charge of the Administrative Division;                Chairperson\n(b)        One-women member each of the National Assembly                     Members\nand the Senate to be nominated by the Speaker and the\nChairman respectively;\n(c)        Secretary of the administrative Division                            Member\n(d)        One women prominent social worker from each province                Members\nto be nominated by the Provincial government; and\n(e)        An officer in BS-20 or above of the administrative Division      Member-cum-\nSecretary]\n(2)      The members of the Board, other than ex-officio members, shall hold office for a term\nof three years and shall be eligible for re-appointment.\n(3)     No act or proceeding of the Board shall be invalid merely on the ground of existence\nof any vacancy or defect in the constitution of the Board.\n(4)         The Board may coopt any other persons for performance of its functions.\n1\nAdded by Ord. 112 of 2002,s.2.\n2\nSubs, by Act No. XIX of 2018, s.2.\n(5)        The Secretariat of the Board shall be at Islamabad.\n(6)     The Board may appoint an executive committee for carrying out its functions as may\nbe assigned to it by the Board.\n(7)     The meeting of the Board shall be presided over by the Chairman or, in his absence, by\nthe Secretary, Ministry of 1[Human Rights.]"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Functions and powers of the Board. The Board shall",
      "content": "(a)        sanction disbursement out of the fund amongst women in distress and detention;\n(b)        make appointment of the staff of the Board;\n(c)        acquire, sell and purchase property of the fund; and\n(d)        manage and control the fund."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Exemption from tax. Notwithstanding anything contained in the Income Tax",
      "content": "Ordinance, 1979 (XXXI of 1979), Wealth Tax Act, 1963 (XV of 1963), Zakat and Ushr\nOrdinance, 1980 (XVIII of 1980), all contributions and donations to be Fund shall be exempt\nfrom levy of these taxes and deduction of Zakat."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Accounts of the Fund, etc",
      "content": "(1) The accounts of the Fund shall be audited by the\nAuditor- General of Pakistan and shall be laid before the National Assembly.\n(2)     The Board shall, periodically, submit reports to the Federal Government relating to"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Delegation of Powers. The Board may delegate all or any its powers and functions to",
      "content": "the Chairman or a member of the Board, executive committee, Provincial Government or any other\nauthority as it may deem fit."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Rules",
      "content": "(1) The Board may make rules for carrying out the purposes of this Act.\n(2)     In particular and without prejudice to the generality of the foregoing provision, such\nrules may include—\n(a)        procedure for disbursement of the fund;\n(b)        resignation of non­official members ; and\n(c)        appointment of members on seats becoming vacant due to death or resignation of a\nnon- official member.\n1Subs. by Act I of 2012. s.2."
    }
  ],
  "definitions": [
    {
      "term": "Board means the Board Governors set up under section 6 ; (b) “Fund",
      "definition": "the Fund for women in Distress and Detention established under section 3; and",
      "source_provision": "sec2"
    },
    {
      "term": "women in distress and detention",
      "definition": "a female or a class of females in need of financial assistance to alleviate her or their miseries due to detention, litigation or for similar connected matters.",
      "source_provision": "sec2"
    }
  ]
}
