{
  "id": "pk-workers-children-education-ordinance-1972",
  "type": "statute",
  "title": "Workers' Children (Education) Ordinance, 1972",
  "title_en": "Workers' Children (Education) Ordinance, 1972",
  "short_name": "WCO",
  "status": "in_force",
  "issued_date": "1972-04-12",
  "in_force_date": "1972-04-12",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaUY2Fuapw%3D-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Workers' Children (Education) Ordinance, 1972 (XI of 1972) published by The Pakistan Code (General Laws).",
  "provisions": [
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Power to make rules",
      "content": "1\nORDINANCE NO. XI OF 1972\n[13th April, 1972]\nAn Ordinance to provide for the education of workers' children and matters ancillary\nthereto.\nWHEREAS it is expedient to provide for the education of workers' children and for matters\nancillary thereto;\nAND WHEREAS the national interest of Pakistan in relation to the economic and financial\nstability of Pakistan and the achievement of uniformity requires Central legislation in the matter;\nNOW, THEREFORE, in pursuance of the Proclamation of the 25th day of March, 1969, read\nwith the Proclamation of the 20th day of December, 1971, and the Provisional Constitution Order,\nand in exercise of all powers enabling him in that behalf, the President is pleased to make and\npromulgate the following Ordinance :—"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Short title, extent and commencement",
      "content": "(1) This Ordinance may be called the\nWorkers' Children (Education) Ordinance, 1972.\n(2) It extends to the whole of Pakistan.\n(3) It shall come into force at once."
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context,",
      "content": "(a)        “employer”, in relation to an establishment, means the person who has\nultimate control over the affairs of the establishment;\n2\n[(b)      “establishment” means any office, firm, industrial unit, undertaking, shop or\npremises in which workers are employed for the purpose of carrying on\nany business, trade, manufacture, calling, service, employment or\noccupation;]\n(c)        “worker” means any person employed, whether directly or through any other\nperson, in any establishment to do any skilled or unskilled, manual or clerical\nwork for hire or reward whose monthly wages do not exceed 3[4[three\nthousand] rupees] but does not include—\n(i)       Persons in the service of the State including members of the Armed\nForces, Police Force and Railway servants;\n(ii)      Persons employed in any undertaking under the control of any Defence\norganisation or Railway administration;\n1\nThe Ordinance has been applied to the Provincially Administered T ribal Areas or to the parts of those areas to which it does not already apply,\nsee Regulation No.1 of 1972, s.2 and Sch.,\n2\nSubs. by the Workers, Children (Education) (Amdt.) Act, 1973 (24 of 1973), s. 2, for clause (b).\n3\nSubs. and ins. by the Workers Children (Education) (Amdt.) Act, 1985 (16 of 1985). s.2and Sch.,\n4\nSubs. by the Labour Laws (Amdt.) Act 1994, (11 of 1994) s.. 7 and Sch., IV for “one thousand five hundred”.\n(iii)      Persons in the service of a local council, a municipal committee, a\ncantonment board or any other local authority 1[:]\n2\n[Provided that a worker shall not cease to be a worker for the reason that his monthly\nwages exceed three thousand rupees or the number of persons employed in the establishment, at any\ntime, is reduced to less than ten.]\n3[3. Levy of education cess.___(1) Every employer of an establishment in which the\nnumber of workers employed at any time during a year is 4[ten] or more shall pay to the Provincial\nGovernment an education cess at the rate of one hundred rupees per worker per annum.\n(2) Every employer shall, within every three months beginning from the first day of the\ncalendar month following the commencement of the Workers' Children (Amendment) Act, 1973,\nprepare and deliver, or cause to be prepared and delivered, in the form and to the officer\nprescribed by the Provincial Government, a return showing the number of workers employed in\nthe establishment during the preceding quarter and shall subscribe a declaration of the truth of the\nreturn at the foot thereof.\n(3) The levy of education cess shall be on the basis of the number of workers shown in the\nreturn referred to in sub-section (2)."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Education of Workers’ Children. The Provincial Government shall provide education",
      "content": "free of cost up to Matric 5[any level of education to two children] to one child of every worker\nemployed in an establishment referred to in section 3.\nExplanation.—Education free of cost' includes provision of text books free of cost and\nexemption from admission fee, tuition fee, examination fee and school fund."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Manner of levying cess. The cess described in section 3 shall be levied so far as may be,",
      "content": "in the same manner, and under the same provisions of law, as the land revenue 6[:]\n7\n[Provided that the amount of the cess shall be held in a separate account and shall be\nexpended only for the purposes of this Ordinance;]\n8\n[5A. Collection and administration of cess. The collection of cess referred to in section 3\nand its administration may be entrusted to the Social Security Institution or to such other agency as\nthe Provincial Government may nominate.]"
    }
  ],
  "definitions": [
    {
      "term": "establishment",
      "definition": "any office, firm, industrial unit, undertaking, shop or premises in which workers are employed for the purpose of carrying on any business, trade, manufacture, calling, service, employment or occupation;]",
      "source_provision": "sec2"
    },
    {
      "term": "worker",
      "definition": "any person employed, whether directly or through any other person, in any establishment to do any skilled or unskilled, manual or clerical work for hire or reward whose monthly wages do not exceed 3[4[three thousand] rupees] but does not include— (i) Persons in the service of the State including members of the Armed Forces, Police Force and Railway servants; (ii) Persons employed in any undertaking under the control of any Defence organisation or Railway administration; 1 The Ordinance has been applied to the Provincially Administered T ribal Areas or to the parts of those areas to which it does not already apply, see Regulation No.1 of 1972, s.2 and Sch., 2 Subs. by the Workers, Children (Education) (Amdt.) Act, 1973 (24 of 1973), s. 2, for clause (b). 3 Subs. and ins. by the Workers Children (Education) (Amdt.) Act, 1985 (16 of 1985). s.2and Sch., 4 Subs. by the Labour Laws (Amdt.) Act 1994, (11 of 1994) s.. 7 and Sch., IV for “one thousand five hundred”. (iii) Persons in the service of a local council, a municipal committee, a cantonment board or any other local authority 1[:] 2 [Provided that a worker shall not cease to be a worker for the reason that his monthly wages exceed three thousand rupees or the number of persons employed in the establishment, at any time, is reduced to less than ten.] 3[3. Levy of education cess.___(1) Every employer of an establishment in which the number of workers employed at any time during a year is 4[ten] or more shall pay to the Provincial Government an education cess at the rate of one hundred rupees per worker per annum. (2) Every employer shall, within every three months beginning from the first day of the calendar month following the commencement of the Workers' Children (Amendment) Act, 1973, prepare and deliver, or cause to be prepared and delivered, in the form and to the officer prescribed by the Provincial Government, a return showing the number of workers employed in the establishment during the preceding quarter and shall subscribe a declaration of the truth of the return at the foot thereof. (3) The levy of education cess shall be on the basis of the number of workers shown in the return referred to in sub-section (2).",
      "source_provision": "sec2"
    }
  ]
}
