{
  "id": "pk-works-of-defence-act-1903",
  "type": "statute",
  "title": "Works of Defence Act, 1903",
  "title_en": "Works of Defence Act, 1903",
  "short_name": "WODA",
  "status": "in_force",
  "issued_date": "1903-03-19",
  "in_force_date": "1903-03-19",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-apaU-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Works of Defence Act, 1903 (VII of 1903) published by The Pakistan Code (Military Laws).",
  "provisions": [
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions. In this Act, unless there is something repugnant in the subject or context,",
      "content": "(a)        the expression “land” includes benefits to arise out of land, and things attached\nto the earth or permanently fastened to anything attached to the earth:\n(b)        the expression “person interested” includes all persons claiming an interest in\ncompensation to be made on account of the imposition of restrictions upon the\nuse and enjoyment of land under this Act ; and a person shall be deemed to be\ninterested in land if he is interested in an easement affecting the land:\n[ (c) the expression “Division” means one of the Divisions or Groups into which\n4 5\nPakistan is, for military, naval or air force purposes for the time being divided ;\nit includes a Brigade area, a sub-Area which does not form part of any Division,\na naval station, port, dockyard, or establishment ; or an air force Headquarters\nwhich does not form part of any air force Group, and any area which the\n4\n[Federal Government] may, by notification in the official Gazette, declare to\nbe a Division for all or any of the purposes of this Act :]\n1\nFor Statement of Objects and Reasons, see Gazette of India, 1902, Pt. V, p. 84; for Report of the Select Committee, see ibid., 1903, p.105; for Proceedings\nin Council, see ibid., 1902, Pt. VI. p. 175; ibid., 1903, pp. 14 and 50.\nIt has been extended to the Baluchistan States Union by the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G. G. O. 4 of 1953) as\namended.\nIt has also been extended to the Khairpur State, see G. G. O. 5 of 1953, as amended by G. G. O. 24 of 1953.\nThe Act has also been extended to the State of Bahawalpur see G. G. O. 11 of 1953, as amended.\nIt has also been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950) ; and applied in the Federated\nAreas of Baluchitan, see Gazette of India, 1937, Pt. I, p. 1499.\nThe Act has been and shall be deemed to have been brought into force in Gwadur with effect from the 8th September, 1958 by the Gwadur (Application\nof Central Laws) Ordinance, 1960 (37 f 1960), s. 2.\n2\nThe word “Indian” omitted by A. O., 1949, Sch.\n3\nSubs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for sub-section\n(2) as amended by A. O., 1949, Sch., and the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 8.\n4\nSubs. by the Indian Works of Defence (Amdt.) Act, 1921 (11 of 1921) s. 2, for the original cls. (c) and (d).\n5\nSubs. by the Works of Defence (Amdt.) Ordinance, 1961 (34 of 1961), s. 2, for cl. (c) as amended by A. O., 1949, Sch., and A. O., 1937.\n6\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n1\n[(d)   the expression “General Officer Commanding the Division” means with\nreference to a work pertaining to the Army, the army officer for the time being\nin command of the forces in a Division, with reference to a work pertaining to\nthe Navy, the naval officer for the time being in command of the forces in a\nDivision and with reference to a work pertaining to the Air Force, the air force\nofficer for the time being in command of the forces in a Division]:]\n(e)        the expression “Commanding Officer” means the officer for the time being in\ncommand of a work of defence:\n(f)        the expression “Collector” includes any officer specially appointed by the\n2\n[Federal Government] to perform the functions of a Collector under this Act :\n(g)        the expression “Court” means a principal Civil Court of original jurisdiction,\nunless the 2[Federal Government] has appointed (as it is hereby empowered to\ndo) a special judicial officer within any specified local limits to perform the\nfunctions of the Court under this Act:\n(h)        “maintain”, with its grammatical variations and cognate expressions, does not,\nwhen used in relation to a house or other construction, include the doing of any\nact necessary for keeping such house or construction, until the making of the\naward referred to in section 12 or until the exercise, prior to the making of the\naward, of the powers of demolition conferred, in case of emergency, by section\n6, sub-sections (1) and (3), in the state in which it was at the time of the\npublication of the notice referred to in section 3, sub-section (2):\n(i)        the following persons shall be deemed “entitled to act” as and to the extent\nhereinafter provided, that is to say,___ trustees for other persons beneficially\ninterested shall be deemed the persons entitled to act with reference to any case,\nand that to the same extent as the persons beneficially interested could have\nacted if free from disability:\n3\n*       *         *           *         *          *           *\nthe guardians of minors and the committees or managers of lunatics or idiots shall be deemed\nrespectively the persons so entitled to act, to the same extent as the minors, lunatics or idiots\nthemselves, if free from disability, could have acted:\nProvided that___\n(i)        no person shall be deemed “entitled to act” whose interest in the subject-\nmatter is shown to the satisfaction of the Collector or Court to be adverse\nto the interest of the person interested for whom he would otherwise be\nentitled to act;\n1\nSubs. by Ordinance 34 of 1961, s. 2, for cl. (d)\n2\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”, which had been subs. by A. O., 1937, for “L.G.”.\n3\nCertain words were omitted by the Federal Laws (Revision and Declaration) Ordinance. 1981 (27 of 1981), s. 3 and Second Sch.\n(ii)      in every case the person interested may appear by a next friend or, in\ndefault of his appearance by a next friend, the Collector or Court, as the\ncase may be, shall appoint a guardian for the case to act on his behalf in\nthe conduct thereof ;\n(iii)     the provisions of 1[Order XXXII of the First Schedule to the, Code of\nCivil Procedure, 1908 (Act V of 1908),] shall, mutatis mutandis, apply\nin the case of persons interested appearing before a Collector or Court\nby a next friend, or by a guardian for the case, in proceedings under this\nAct ; and\n(iv)      no person “entitled to act” shall be competent to receive the\ncompensation-money payable to the person for whom he is entitled to\nact, unless he would have been competent to alienate the land upon the\nuse and enjoyment of which restrictions are to be imposed and receive\nand give a good discharge for the purchase-money on a voluntary sale\n2\n[;]\n3\n[(j)   the expression “work” or “work of defence” means any defence establishment\nand include a naval dockyard, an airfield, a runway, an emergency landing\nground or any area declared by the 4[Federal Government] to be a “work” or\n“work of defence” ;\n(k)        the expression “Clearance Area” means___\n(i)       an area 250 yards wide measured on either side and at right angle to the\ncentre line of a runway along its full length ;\n(ii)      an area 75 yards wide measured on either side and at right angle to the\ncentre line of a taxi way along its full length ;\n(iii)     an area 42 yards wide all round an apron or hard standing measured from\nthe outer edge ;\n(iv)      an area immediately adjacent to both ends of a runway 300 yards long\nmeasured along and symmetrical to extended centre line of a runway\nand 250 yards wide either side of the centre line ; and\n(v)       an area 500 yards wide flaring up to 707 yards beyond that mentioned\nin the preceding clause at each end of runway extending on the ground\nfor a distance of 1,000 yards along and symmetrical about the extended\ncentre line of a runway;\n1\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and Second Sch., for “Chapter XXXI of the Code of Civil\nProcedure”.\n2\nSubs. by the Works of Defence (Amdt.) Ordinance, 1961 (34 of 1961), s. 2, for the full-stop.\n3\nClauses (j), (k), (1), (m), (n), (o), (p) and (q), added ibid.\n4\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.\n(l)        “Funnel Area” means air space clearance at each end of a runway beginning at\nthe end of the area mentioned in clause (k) (v) at the elevation of the end of\nrunway and rising on a slope of 1 in 50 (for every 50 feet horizontal one foot\nvertical, known as glide angle) for a horizontal distance of 3,033 yards measured\nalong and symmetrical about the extended centre line of runway, the width of\nthe Funnel Area at the end of the distance mentioned in clause (k) (v) being 707\nyards flaring up to 1,333 yards at the end;\n(m)        “Area of Restricted Height” means air space clearance at each end of a runway\nbeginning at the end of Funnel Area above an elevation of 60 yards measured\nabove the elevation of the end of the runway and with a width of 1,333 yards\nand a length of 5,000 yards measured along and symmetrical about the extended\ncentre line of the runway;\n(n)        “Inner Horizontal Surface” means an air space clearance above an elevation of\n50 yards over and above the established airfield elevation, the extent of this\nsurface being limited to an area included within a radius of 4,333 yards\nmeasured from the geometrical centre of the runway known as reference point;\n(o)        “Inner Conical Surface” means air space clearance extended outward and\nupward from the periphery of the Inner Horizontal Surface for a distance of\n2,333 yards, the slope of Conical Surface being 20 horizontal to one vertical\nprotruding above ;\n(p)        “Outer Horizontal Surface” means air space clearance above an elevation of 166\nyards over and above the established airfield elevation, the extent of this surface\nbeing limited to an area included between the outer periphery of Inner Conical\nSurface and a circle having a radius of 16,667 yards measured from the\nreference point;\n(q)        “Transition Surface” means air space clearance joining two adjacent surfaces\nwith a slope of 7 horizontal to one vertical measured outward and upward and\nall along the sides of runway Clearance Area, Funnel Area and Area of\nRestricted Height, the slope being measured at right angle to the runway axis\nexcept, at the ends of the Area of Restricted Height where it will be measured\nparallel to it.]"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Declaration and notice that restrictions will be imposed",
      "content": "_ (1) Whenever it appears to the\n1\n[Federal Government] that it is necessary to impose restrictions upon the use and enjoyment of land\nin the vicinity of any work of defence or of any site intended to be used or to be acquired for any such\nwork, in order that such land may be kept free from buildings and other obstructions, a declaration\nshall be made to that effect under the signature of a Secretary to such Government or of some officer\nduly authorised to certify its orders.\n(2) The said declaration shall be published in the 2[official Gazette] and shall state the district\nor other territorial division in which the land is situate and the place where a sketch plan of the land,\nwhich shall be prepared on a scale not smaller than six inches to the mile and shall distinguish the\nboundaries referred to in section 7, may be inspected; and the Collector shall cause public notice of\nthe substance of the said declaration to be given at convenient places in the locality.\n1\nSubs. by F. A. Q., 1975, Art. 2 and Table for “Central Government”, which had been subs. by A. O., 1937, for “L.G.”.\n2\nSubs. by A. O., 1937, for “local official Gazette”.\n(3) The said declaration shall be conclusive proof that it is necessary to keep the land free from\nbuildings and other obstructions."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Power to do preliminary acts after publication of notice under section 3, sub",
      "content": "section\n(2). It shall be lawful for such officer as the 1[Federal Government] may, by general or special order,\nauthorise in this behalf, and for his servants and workmen, at any time after publication of the notice\nmentioned in section 3, sub-section (2), to enter upon and survey and take levels of any land in such\nlocality, to dig or bore into the sub-soil, to do all other acts necessary to ascertain whether any and, if\nso, what restrictions should be imposed on the use and enjoyment of the land, to set out the boundaries\nof the land upon the use and enjoyment of which restrictions are to be imposed, or of any part of such\nland, to mark such levels, boundaries and line by placing marks and cutting trenches, and, where\notherwise the survey cannot be completed and the levels taken and the boundaries and line marked, to\ncut down and clear away any part of any standing crop, fence or jungle:\nProvided that no person shall enter into any building or upon any enclosed court or garden\nattached to a dwelling -house (unless with the consent of the occupier thereof) without previously\ngiving such occupier at least seven days’ notice in writing of his intention to do so."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Payment for damage. The officer so authorised shall at the time of such entry pay or tender",
      "content": "payment for all necessary damage to be done as aforesaid, and, in case of dispute as to the sufficiency\nof the amount so paid or tendered, he shall at once refer the dispute to the decision of the Collector or\nother chief revenue-officer of the district, and such decision shall be final."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. Further powers exercisable after publication of notice under section 3, sub",
      "content": "section\n(2).___(1) Whenever a declaration has been made and public notice thereof has been given under section\n3, it shall, subject to the provisions of sub-sections (2) to (4), be lawful for such officer as the 1[Federal\nGovernment] may, by general or special order, authorise in this behalf, and for his servants and\nworkmen, to enter and demolish any buildings or other constructions on the surface, to cut down or\ngrub up all or any of the trees, to remove or alter all or any of the banks, fences, hedges and ditches,\nto make underground and other drains, to fill up all excavations, and demolish all buildings and other\nconstructions below the surface, and generally to level and clear the said land and do all such acts for,\nlevelling and clearing the same as he may deem necessary or proper, but in such manner nevertheless\nthat evidence of the boundaries of the lands held by different owners may be preserved.\n(2) The powers conferred by sub-section (1) shall not be exercised,___\n(a)        save as otherwise provided by sub-section (3),before the making of the award\nhereinafter referred to in section 12, nor\n(b)        save as otherwise provided by sub-section (4), after the expiration of six months\nfrom the making of the said award, or any shorter period on the expiration of\nwhich the officer exercising such powers gives notice to the Collector that there\nwill be no further exercise of them.\n1\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”, which had been subs. by A. O., 1937, for “L. G.”.\n(3) In case of emergency, the 1[Federal Government] 2* * * may, by notification in the 3[official\nGazette], declare that all or any powers conferred by sub-section (1) may be exercised at any time\nwithin six months after the publication of the notice referred to in section 3, sub-section (2), and such\npowers may be exercised accordingly, and the said notification shall be conclusive proof of emergency.\n(4) Nothing in sub-section (2) shall be deemed to preclude any such officer or his servants or\nworkmen from exercising at any time the said powers for the purpose of removing, wholly or in part,\nany building or other obstruction maintained, created, added to, altered, planted, stacked, stored or\notherwise accumulated in contravention of this Act or of any rule or order made thereunder or of any\ncondition prescribed in accordance therewith."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. Restrictions. From and after the publication of the notice mentioned in section 3, sub",
      "content": "section\n(2), such of the following restrictions as the 1[Federal Government] may in its discretion declare therein\nshall attach with reference to such land, namely:-\n(a)        Within an outer boundary which, except so far as is otherwise provided in\nsection 39, sub-section (4), may extend to a distance of two thousand yards from\nthe crest of the outer parapet of the work,—\n(i)        no variation shall be made in the ground- level, and no building, wall,\nbank or other construction above the ground shall be maintained,\nerected, added to or altered otherwise than with the written approval of\nthe 4[General Officer Commanding the Division], and on such\nconditions as he may prescribe ;\n(ii)       no wood, earth, stone, brick, gravel, sand or other material shall be\nstacked, stored or otherwise accumulated:\nProvided that, with the written approval of the 5[General Officer Commanding the Division]\nand on such conditions as he may prescribe, road-ballast, manure and agricultural produce may be\nexempted from the prohibition:\nProvided also that any person having control of the land as owner, lessee or occupier shall be\nbound forthwith to remove such road-ballast, manure or agricultural produce, without compensation,\non the requisition of the Commanding Officer;\n(iii)      no surveying operation shall be conducted otherwise than by or under\nthe personal supervision of a public servant duly authorised in this\nbehalf, in the case of land under the control of military authority, by the\nCommanding Officer and, in other cases, by the Collector with the\nconcurrence of the Commanding Officer ; and\n1\nSubs. by F.A.O. 1975, Art. 2 and Table, for “Central Government”, which had been subs. by A. O., 1937, for “L. G.”.\n2\nThe words “with the previous sanction of the G. G. in C.” rep., ibid.\n3\nSubs. ibid., for “local official Gazette”.\n4\nSubs. by the Works of Defence (Amdt.) Ordinance, 1961 (34 of 1961), s. 3, for “General Officer Commanding the District” which had been subs. by the\nIndian Works of Defence (Amdt.) Act, 1921 (11 of 1921), s. 3, for “General Officer Commanding the Division”.\n5\nSubs. by Ordinance 34 of 1961, s.3, for “General Officer Commanding the District” which had been subs. by Act 11 of 1921, s.3 for General Officer\nCommanding the Division, District or Brigade”.\n(iv)       where any building, wall, bank or other construction above the ground\nhas been permitted under clause (i) of this sub-section to be maintained,\nerected, added to or altered, repairs shall not, without the written\napproval of the 1[General Officer Commanding the Division], be made\nwith materials different in kind from those employed in the original\nbuilding, wall, bank or other construction.\n(b)        Within a second boundary which may extend to a distance of one thousand yards\nfrom the crest of the outer parapet of the work, the restrictions enumerated in\nclause (a) shall apply with the following additional limitations, namely:___\n2\n[(i)   no building, wall, bank or other construction of permanent materials\nabove the ground shall be maintained otherwise than with the written\napproval of the 3[General Officer Commanding the Division] and on\nsuch conditions as he may prescribe, and no such building, wall, bank\nor other construction shall be erected:]\nProvided that, with the written approval of the 1[General Officer Commanding the Division]\nand on such conditions as he may prescribe, huts, fences or other constructions of wood or other\nmaterials, easily destroyed or removed, may be maintained, erected, added to or altered:\nProvided, also, that any person having control of the land as owner, lessee or occupier shall be bound\nforthwith to destroy or remove such huts, fences or other constructions, without compensation, upon\nan order in writing signed by the 1[General Officer Commanding the Division] ; and\n(ii)       live hedges, rows or clumps of trees or orchards shall not be maintained,\nplanted, added to or altered otherwise than with the written approval of\nthe 4[General Officer Commanding the Division] and on such conditions\nas he may prescribe.\n(c)        Within a third boundary which may extend to a distance of five hundred yards\nfrom the crest of the outer parapet of the work, the restrictions enumerated in\nclauses (a) and (b) shall apply with the following additional limitation, namely:-\nno building or other construction on the surface, and no excavation, building or other\nconstruction below the surface, shall be maintained or erected:\nProvided that, with the written approval of the Commanding Officer and on such conditions as\nhe may prescribe, 5[a building or other construction on the surface may be maintained\nand] open railings and dry brush-wood fences may be exempted from this prohibition.\n1\nSubs. by the Works of Defence (Amdt.) Ordinance, 1961 (34 of 1961), s. 3, for “General Officer Commanding the District” which had been subs. by the\nIndian Works of Defence (Amdt.) Act, 1921 (11 of 1921), s. 3, for “General Officer Commanding the Division”.\n2\nSubs. by the Indian Works of Defence (Amdt.) Act, 1940 (28 of 1940), s. 2 (a), for the original cl. (i).\n3\nSubs. by Ordinance 34 of 1961, s. 3, for “General Officer Commanding the District”.\n4\nSubs. by the Works of Defence (Amdt.) Ordinance, 1961 (34 of 1961), s. 3, for “General Officer Commanding the District” which had been subs. by the\nIndian Works of Defence (Amdt.) Act, 1921 (2 of 1921), s. 3, for “General Officer Commanding the Division, District or Brigade”.\n5\nIns. by the Indian Works of Defence (Amdt.) Act, 1940 (28 of 1940), s. 2 (b).\n1\n[7A. Restrictions with reference to airfield. From and after the publication of the notice\nmentioned in section 3, sub-section (2), such of the following restrictions as the 2[Federal Government]\nmay in its discretion declare therein shall attach with reference to the land in the vicinity of an airfield,\nnamely:___\n(a)         No variation shall be made in the ground level, and no building, wall or other\nconstruction above the ground level and no obstruction or ditch shall be\npermitted in the Clearance Area.\n(b)         No building, wall, bank or other construction above the ground level shall be\nmaintained, erected, added to or altered in the Funnel Area, Area of Restricted\nHeight, Transition Surface, Inner Conical Surface and Outer Horizontal\nSurface, otherwise than with the written approval of the General Officer\nCommanding the Division, and on such conditions as he may prescribe.]"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. Land to be marked out, measured, registered and planned. As soon as may be after the",
      "content": "publication of the declaration aforesaid, the Collector shall cause the land to be marked out and\nmeasured, and shall also prepared a register and a detailed plan, which shall be on a scale not smaller\nthan six inches to the mile, showing accurately every building, tree and other obstruction."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Notice to persons interested.___ (1) At any time before the expiration of",
      "content": "(a)         the period of eighteen months from the publication of the declaration referred\nto in section 3, or\n(b)         such other period not exceeding three years from the said publication as the\n2\n[Federal Government] 3* * * may, by notification in the 4[official Gazette],\ndirect in this behalf, the Collector shall cause public notice to be given at\nconvenient places on or near the land, stating the effect of the said declaration\nand that claims to compensation for all interests in such land affected by\nanything done or ordered in pursuance of such declaration may be made to him:\nProvided that, where anything has been done in exercise of the powers conferred, in case of\nemergency, by section 6, sub-section (3), the notice prescribed by this section shall be given as soon\nas may be thereafter.\n(2) Such notice shall state the particulars of any damage ordered to be done or, in the case\nreferred to in section 6, sub-section (3), done in exercise of any of the powers conferred by the said\nsection, and the particulars of any restrictions attaching to the land under section 7, and shall require\nall persons interested in the land to appear personally or by agent before the Collector at a time and\nplace therein mentioned (such time not being earlier than fifteen days after the date of publication of\nthe notice), and to state the nature of their respective interests in the land and the amount and particulars\nof their claims to compensation for damage to such interests and their objections (if any) to the\nmeasurements made under section 8. The Collector may in any case require such statement to be made\nin writing and signed by the party or his agent.\n1\nS. 7A added by Ordinance 34 of 1961, s. 4.\n2\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”,\n3\nThe words “with the previous sanction of the G. G. in C.”, rep., by A. O., 1937.\n4\nSubs. ibid., for “local official Gazette”.\n(3) The Collector shall also serve notice to the same effect on the occupier (if any) of such land\nand on all such persons known or believed to be interested therein, or to be entitled to act for persons\nso interested, as reside or have agents authorised to receive service on their behalf, within the revenue-\ndistrict in which the land is situate.\n(4) In case any person so interested resides elsewhere, and has no such agent, the notice shall\nbe sent to him by post in a letter addressed to him at his last known residence, address or, place of\nbusiness."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Power to require and enforce the making of statements as to names and interests. The",
      "content": "Collector may also require any such person to make or deliver to him, at a time and place mentioned\n(such time not being earlier than fifteen days after the date of the requisition), a statement containing,\nso far as may be practicable, the name of every other person possessing any interest in the land or any\npart thereof as co-proprietor, sub-proprietor, mortgagee, tenant or otherwise, and of the nature of such\ninterest, and of the rents and profits (if any) received or receivable on account thereof for three years\nnext preceding the date of the statement."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Application of certain sections of the Pakistan Penal Code. Every person required to",
      "content": "make or deliver a statement under section 9 or section 10 shall be deemed to be legally bound to do so\nwithin the meaning of sections 175 and 176 of the Pakistan Penal Code (XLV of 1860)."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Inquiry and award by Collector. On the day fixed under section 9 or on any other day to",
      "content": "which the inquiry has been adjourned, the Collector shall proceed to inquire into the objections (if any)\nwhich any person interested has stated pursuant to a notice given under the said section to the\nmeasurements made under section 8, and into the decrease in the value of the land, and into the\nrespective interests of the persons claiming the compensation, and shall make an award under his hand\nof—\n(a)     the true area of the land and the nature of the obstructions from which the land\nis to be kept free ;\n(b)     the compensation which in his opinion should be allowed for any damage\ncaused or to be caused under section 6 and for any restrictions imposed under\nsection 7 ; and\n(c)     the apportionment of the said compensation among all the persons known or\nbelieved to be interested in the land, of whom or of whose claims he has\ninformation, whether they have respectively appeared before him or not."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Section 13. Award of Collector when to be final",
      "content": "_(1) Such award shall be filed in the Collector’s\noffice and shall, except as hereinafter provided, be final and conclusive evidence, as between the\nCollector and the persons interested, whether they have respectively appeared before the Collector or\nnot, of the true area of the land, the nature of the said obstructions from which the land is to be kept\nfree, the damage caused or to be caused under section 6, the value of the rights restricted under section\n7, and the apportionment of the compensation among the persons interested.\n(2) The Collector shall give immediate notice of his award to such of the persons interested as\nare not present personally or by their representatives when the award is made."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Section 14. Adjournment of inquiry. The Collector may, for any cause he thinks fit, from time to time",
      "content": "adjourn the inquiry to a day to be fixed by him."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Section 15. Power to summon and enforce attendance of witnesses and production of documents",
      "content": "For the purpose of inquiries under this Act the Collector shall have power to summon and enforce the\nattendance of witnesses, including the parties interested or any of them, and to compel the production\nof documents, by the same means, and (so far as may be) in the same manner, as is provided in the\ncase of a Civil Court under the 1[Code of Civil Procedure 1908 (Act V of 1908)]."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Section 16. Matters to be considered and neglected. In determining the amount of compensation, the",
      "content": "Collector shall be guided by the provisions contained in sections 23 and 24."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Section 17. Supplementary proceedings. Whenever the officer exercising powers conferred by",
      "content": "section 6 considers it necessary that anything in respect of which any person is or may be entitled to\ncompensation but of which no notice has been given or compensation awarded, under sections 9 and\n12, respectively, should be done in pursuance of the said powers, the Collector shall cause\nsupplementary notice to be given, as nearly as may be, in the manner prescribed by section 9 and\nsubject to the limit of time imposed by sub-section (1) of that section, and the provisions of sections\n10 to 16 shall, so far as they are applicable, be deemed to apply to any further inquiry and award which\nmay be held or made in consequence of such supplementary notice."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Section 18. Reference to Court",
      "content": "_(1) Any person interested who has not accepted the award may, by\nwritten application to the Collector, require that the matter be referred by the Collector for the\ndetermination of the Court, whether his objection be to the measurement of the land, the amount of the\ncompensation, the persons to whom it is payable, or the apportionment of the compensation among the\npersons interested:\nProvided that every such application shall be made,-\n(a)        if the person making it was present or represented before the Collector at the\ntime when he made his award, within six weeks from the date of the Collector’s\naward;\n(b)        in other cases, within six weeks of the receipt of the notice from the Collector\nunder section 13, sub-section (2), or within six months from the date of the\nCollector’s award, whichever period shall first expire.\n(2) The application shall state the grounds on which objection to the award is taken."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Section 19. Collector’s statement to the Court",
      "content": "_ (1) In making the reference the Collector shall state,\nfor the information of the Court, in writing under his hand,-\n(a)        the situation and extent of the land with particulars of any damage caused under\nsection 6 or of restrictions imposed under section 7;\n(b)        the names of the persons whom he has reason to think interested in such land ;\n1\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of I981),s. 3 and Second Sch., for “Code of Civil Procedure Act (XIV of\n1882).”\n(c)    the amount of compensation awarded under section 12 ; and,\n(d)     if the objection be to the amount of the compensation, the grounds on which the\namount of compensation was determined.\n(2) To the said statement shall be attached a schedule giving the particulars of the notices served\nupon, and of the statements in writing made or delivered by, the parties interested respectively."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Service of notice. The Court shall thereupon cause a notice specifying the day on which",
      "content": "the Court will proceed to determine the objection, and directing their appearance before the Court on\nthat day, to be served on the following persons, namely:___\n(a)     the applicant;\n(b)     all persons interested in the objection, except such (if any) of them as have\nconsented without protest to receive payment of the compensation awarded; and\n(c)     if the objection is in regard to the area of the land, the nature of the obstructions\nor the amount of the compensation, the Collector."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Restriction on scope of proceedings. The scope of the inquiry in every such proceeding",
      "content": "shall be restricted to a consideration of the interests of the persons affected by the objection."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Section 22. Proceedings to be in open Court. Every such proceeding shall take place in open Court,",
      "content": "and all persons entitled to practice in any Civil Court in the Province shall be entitled to appear, plead\nand act, as the case may be, in such proceeding."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Matters to be considered in determining compensation",
      "content": "_(1) In determining the amount\nof compensation to be awarded for damage caused, or to be caused, or for restrictions imposed under\nthis Act, the Court shall take into consideration___\n(a)     the actual decrease in market-value of the land owing to the publication of the\ndeclaration relating thereto under section 3 and any damage caused or to be\ncaused under section 6 ;\n(b)     the damage sustained by the person interested, by reason of the removal of any\nstanding crops in the exercise of any power conferred by section 6;\n(c)     the damage (if any) sustained by the person interested, by reason of ceasing to\nbe able to use such land conjointly with his other land;\n(d)     the damage (if any) sustained by the person interested by anything done or\nordered under sections 6 and 7 injuriously affecting his other property,\nmoveable or immoveable, in any other manner, or his earnings ; and,\n(e)     if, in consequence of the imposition of restrictions, the person interested is\ncompelled to change his residence or place of business, the reasonable expenses\n(if any) incidental to such change.\n(2) In addition to the amount representing the actual decrease in the market-value of the land\nas above provided, the Court shall in every case award a further sum of fifteen per centum on such\namount."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Matters not to be considered in determining compensation. In determining the amount",
      "content": "of compensation to be awarded for damage caused, or to be caused, or for restrictions imposed under\nthis Act, the Court shall not take into consideration-\n(a)    the degree of urgency which has led to the damage or the imposition of\nrestrictions;\n(b)    any disinclination of the person interested to submit to damage or restrictions;\n(c)    any damage sustained by him, which, if caused by a private person, would not\nrender such person liable to a suit ;\n(d)    any increase to the value of the other land of the person interested, accruing or\nlikely to accrue from anything done under this Act ; or\n(e)    any outlay or improvements on, or disposal of, the land commenced, made or\neffected without the sanction of the Collector after the date of the publication of\nthe declaration under section 3."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Rules as to amount of compensation",
      "content": "_(1) When the applicant has made a claim to\ncompensation, pursuant to any notice given under section 9, the amount awarded to him by the Court\nshall not exceed the amount so claimed or be less than the amount awarded by the Collector under\nsection 12.\n(2) When the applicant has refused to make such claim or has omitted without sufficient reason\n(to be allowed by the Judge) to make such claim, the amount awarded by the Court shall in no case\nexceed the amount awarded by the Collector.\n(3) When the applicant has omitted for a sufficient reason (to be allowed by the Judge) to make\nsuch claim, the amount awarded to him by the Court shall not be less than, and may exceed, the amount\nawarded by the Collector."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Section 26. Form of awards. Every award under this Part shall be in writing signed by the Judge, and",
      "content": "shall specify the amount awarded under section 23, sub-section (1), clause (a), and also the amounts\n(if any) respectively awarded under each of the other clauses of the same sub-section, together with\nthe grounds of awarding each of the said amounts."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Section 27. Costs",
      "content": "_(1) Every such award shall also state the amount of costs incurred in the\nproceedings under this Part, and by what persons and in what proportion they are to be paid.\n(2) When the award of the Collector is not upheld, the costs shall ordinarily be paid by the\nCollector, unless the Court is of opinion that the claim of the applicant was so extravagant or that he\nwas so negligent in putting his case before the Collector that some deduction from his costs should be\nmade or that he should pay a part of the Collector’s costs."
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Collector may be directed to pay interest on excess compensation. If the sum which, in",
      "content": "the opinion of the Court, the Collector ought to have awarded as compensation is in excess of the sum\nwhich the Collector did award as compensation, the Court may direct that the Collector shall pay\ninterest on such excess at the rate of six per centum per annum from the date of his award to the date\nof payment of such excess into Court."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Particulars of apportionment to be specified. Where there are several persons interested,",
      "content": "if such persons agree in the apportionment of the compensation, the particulars of such apportionment\nshall be specified in the award, and as between such persons the award shall be conclusive evidence\nof the correctness of the apportionment."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Dispute as to apportionment. When the amount of compensation has been settled under",
      "content": "section 12, if any dispute arises as to the apportionment of the same or any part thereof, or as to the\npersons to whom the same or any part thereof is payable, the Collector may refer such dispute to the\ndecision of the Court."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Section 31. Payment of compensation or deposit of same in Court",
      "content": "_(1) On making an award under\nsection 12, the Collector shall tender payment of the compensation awarded by him to the persons\ninterested entitled thereto according to the award, and shall pay it to them unless prevented by some\none or more of the contingencies mentioned in sub-section (2).\n(2) If they do not consent to receive it, or if there is no person competent to alienate the land,\nor if there is any dispute as to the title to receive the compensation or as to the apportionment of it, the\nCollector shall deposit the amount of the compensation in the Court to which a reference under section\n18 would be submitted:\nProvided, first, that any person admitted to be interested may receive such payment under\nprotest as to the sufficiency of the amount:\nProvided, secondly, that no person who has received the amount otherwise than under protest\nshall be entitled to make any application under section 18:\nProvided, thirdly, that nothing herein contained shall affect the liability of any person, who\nmay receive the whole or any part of any compensation awarded under this Act, to pay the same to the\nperson lawfully entitled thereto.\n(3) Notwithstanding anything in this section, the Collector may, with the sanction of the\nl\n[Federal Government], instead of awarding a money-compensation in respect of any land, make any\narrangement with a person having a limited interest in such land, either by the grant of other lands in\nexchange, or by the remission of land-revenue on the same or on other lands held under the same title,\nor in such other way as may be equitable having regard to the interests of the parties concerned.\n(4) Nothing in sub-section (3) shall be construed to interfere with or limit the power of the\nCollector to enter into any arrangement with any person interested in the land and competent to contract\nin respect thereof.\n1\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”, which had been subs. by A. O., 1937 for ‘L.G.’"
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Section 32. Investment of money deposited in respect of lands belonging to persons incompetent",
      "content": "to alienate.___(1) If any money is deposited in Court under section 31, sub-section (2), and it appears\nthat the land in respect of which the same was awarded belonged to any person who had no power to\nalienate the same, the Court shall order the money to be invested___\n(a)     in the purchase of other lands to be held under the like title and conditions of\nownership as the land in respect of which such money was deposited is held, or,\n(b)     if such purchase cannot be effected forthwith, then in such Government or other\napproved securities as it thinks fit; and shall direct the payment of the interest\nor other proceeds arising from such investment to the person or persons who\nwould for the time being have been entitled to the possession of the said land,\nand such moneys shall remain so deposited and invested until the same are\napplied___\n(i)     in the purchase of such other lands as aforesaid; or\n(ii)    in payment to any person or persons becoming absolutely entitled\nthereto.\n(2) In all cases of moneys deposited to which this section applies, the Court shall order the cost\nof the following matters, including therein all reasonable charges and expenses incident thereto, to be\npaid by the Collector, namely:___\n(a)     the costs of such investments as aforesaid;\n(b)     the costs of the orders for the payment of the interest or other proceeds of the\nsecurities in which such moneys are for the time being invested, and for the\npayment out of Court of the principal of such moneys and the costs of all\nproceedings relating thereto, except such as may be occasioned by litigation\nbetween adverse claimants."
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Section 33. Investment of money deposited in other cases. If any money is deposited in Court under",
      "content": "this Act for any cause other than that mentioned in section 32, the Court may, on the application of\nany party interested or claiming an interest in such money, order the same to be invested in such\nGovernment or other approved securities as it thinks fit, and may direct the interest or other proceeds\nof any such investment to be accumulated and paid in such manner as will, in its opinion, give the\nparties interested therein the same benefit therefrom as they might have had from the land in respect\nof which such money was deposited or as near thereto as may be."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Section 34. Payment of Interest. When the amount of any compensation awarded under this Act is not",
      "content": "paid or deposited within fifteen days of making the award, the Collector shall pay the amount awarded\nwith interest thereon at the rate of six per centum per annum from the date of the award until it is so\npaid or deposited."
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Section 35. Service of notices",
      "content": "(1) Service of any notice under this Act shall be made by delivering\nor tendering a copy thereof signed, in the case of a notice under section 3, sub-section (2), by the officer\ntherein mentioned, and, in the case of any other notice, by or by order of the Collector or the Judge.\n(2) Whenever it may be practicable, the service of the notice shall be made on the person therein\nnamed.\n(3) When such person cannot be found, the service may be made on any adult male member of\nhis family residing with him; and, if no such adult male member can be found, the notice may be served\nby fixing the copy on the outer door of the house in which the person therein named ordinarily dwells\nor curies on business, or by fixing a copy thereof in some conspicuous place in the office of the officer\naforesaid or of the Collector or in the court-house and also in some conspicuous part of the land upon\nwhich restrictions are to be imposed:\nProvided that, if the Collector or Judge so directs, a notice may be sent by post in a letter\naddressed to the person named therein at his last known residence, address or place of business and\nservice of it may be proved by the production of the addressee’s receipt."
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Section 36. Penalties. Whoever wilfully",
      "content": "(a)        obstructs any person in doing any of the acts authorized by section 4, section 6\nor section 8, or\n(b)        destroys, damages, alters or otherwise interferes with the ground-level or any\nwork done under section 6, or\n(c)        contravenes any of the provisions of section 7, l[section 7A] or any condition\nprescribed there under, shall be punishable with imprisonment for a term which\nmay extend to one month, or with fine which may extend to fifty rupees, or with\nboth, and, in the case of a continuing offence, with an additional fine which may\nextend to five rupees for every day after the first in regard to which he is\nconvicted of having persisted in the offence; and any expenses incurred in\nremoving the effects of his offence may be recovered from him in the manner\nprovided by the law for the time being in force for the recovery of fines."
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Section 37. Magistrate to enforce the terms of the Act. If the Collector or officer authorized under",
      "content": "section 6 is opposed or impeded in doing anything directed or permitted by this Act, he shall, if a\nMagistrate, enforce compliance, and, if not a Magistrate, he shall apply to a Magistrate 2* * * and such\nMagistrate 3* * * shall enforce compliance."
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Section 38. Completion of imposition of restrictions not compulsory, but compensation to be",
      "content": "awarded when not completed.___(1) The 4[Federal Government] shall be at liberty to withdraw from\nthe imposition of any declared restrictions before any of the measures authorized by section 6 have\nbeen taken.\n(2) Whenever the 4[Federal Government] withdraws the imposition of any declared restrictions,\nthe Collector shall determine the amount of compensation due for the damage suffered by the owner\nin consequence of the notice or of any proceedings thereunder, and shall pay such amount to the person\ninterested, together with all costs reasonably incurred by him in the prosecution of the proceedings\nunder this Act relating to the said restrictions.\n1\nIns. by the Works of Defence (Amdt.) Ordinance, 1961 (34 of 1961), s. 5.\n2\nThe words and brackets “or (within the towns of Calcutta, Madras and Bombay) to the Commissioner of Police” omitted by A. O., 1949, Sch. The words\n“and Bombay” had been subs. for “Bombay and Rangoon” by A. O., 1937.\n3\nThe words and brackets “or Commissioner (as the case may be)” omitted by A. O., 1949, Sch.\n4\nSubs. by F. A. O., 1975, Art. 2 and Table, for “Central Government’ which had been subs. by A. O.,1937, for “L. G.”,\n(3) The provisions of Part III shall apply, so far as may be, to the determination of the\ncompensation payable under this section."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Section 39. Demolition of part of house or building and imposition of restrictions on part of",
      "content": "land.___(1) The provisions of this Act shall not be put in force for the purpose of demolishing or\nacquiring the right to demolish a part only of any house, manufactory or other building, if the owner\ndesires that the whole of such house, manufactory or building shall be demolished or that the right to\ndemolish the whole of it shall be acquired:\nProvided that the owner may at any time before the Collector has made his award under section\n12, by notice in writing, withdraw or modify his expressed desire that the whole of such house,\nmanufactory or building shall be demolished, or that the right to demolish the whole of it shall be\nacquired:\nProvided, also, that, if any question shall arise as to whether any building or other construction\nproposed to be demolished under this Act does or does not form part of a house, manufactory or\nbuilding within the meaning of this section, the Collector shall refer the determination of such question\nto the Court, and such building or other construction shall not be demolished until after the question\nhas been determined.\nIn deciding on such a reference the Court shall have regard to the question whether the building\nor other construction proposed to be demolished is reasonably required for the full and unimpaired use\nof the house, manufactory or building.\n(2) If, in the case of any claim of the kind referred to in section 23, sub-section (1), clause (c),\nby a person interested, on account of ceasing to be able to use the land, upon the use and enjoyment of\nwhich restrictions are to be imposed, conjointly with his other land the 1[Federal Government] is of\nopinion that the claim is unreasonable or excessive, it may at any time before the Collector has made\nhis award, order the imposition of restrictions upon the whole of the land of which the land upon the\nuse and enjoyment of which it was first sought to impose restrictions forms a part.\n(3) In the case provided for by sub-section (2) no fresh declaration or other proceeding under\nsections 3 to 10 shall be necessary; but the Collector shall without delay furnish a copy of the order of\nthe l[Federal Government] to the person interested, and shall thereafter proceed to make his award\nunder section 12.\n(4) Notwithstanding anything contained in section 7, clause (a), any land, upon the use and\nenjoyment of which restrictions are imposed under this section, may be included in the outer boundary,\neven though its distance from the crest of the outer parapet of the work exceeds two thousand yards."
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Section 40. Exemption from stamp duty and fees. No award or agreement made under this Act shall",
      "content": "be chargeable with a stamp duty, and no person claming under any such award or agreement shall be\nliable to pay any fee for a copy of the same."
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Section 41. Notice in case of suits for anything done in pursuance of Act. No suit or other proceeding",
      "content": "shall be commenced or prosecuted against any person for anything done in pursuance of this Act,\nwithout giving to such person a month’s previous notice in writing of the intended proceeding, and of\nthe cause thereof, nor after tender of sufficient amends.\n1\nSubs. by F.A.O., 1975, Art. 2 and Table, for “Central Government \", which had been subs. by A. O., 1937, for “L. G.”."
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "Section 42. Code of Civil Procedure to apply to proceedings before Court. Save in so far as they",
      "content": "may be inconsistent with anything contained in this Act, the provisions of the 1[Code of Civil\nProcedure, 1908 (Act V of 1908)] shall apply to all proceedings before the Court under this Act."
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Section 43. Appeals in proceedings before Court. Subject to the provisions of the 1[Code of Civil",
      "content": "Procedure, 1908 (Act V of 1908)] applicable to appeals from original decrees, an appeal shall lie to\nthe High Court from the award or from any part of the award of the Court in any proceeding under this\nAct."
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Section 44. Power to make rules",
      "content": "_ (1) The 2[Federal Government] 3* * * may make rules for the\nguidance of officers in all matters connected with the enforcement of this Act.\n(2) The power to make rules under sub-section (1) shall be subject to the condition of the rules being\nmade after previous publication.\n(3) All rules made under sub-section (1) shall be published in the 4[official Gazette], and shall\nthereupon have effect as if enacted in this Act.\n____________\nDate: 11-09-2024\n1\nSubs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and Second Sch., for “Code of Civil Procedure (XIV of 1882)”.\n2\nSubs. by F.A. O., 1975, Art. 2 and Table, for “Central Government”, which had been subs. by A. O. 1937, for “G.G. in C”.\n3\nThe words “and the L.G., with the previous sanction of the G.G. in C” rep. by A. O., 1937.\n4\nSubs. ibid., for “local official Gazette”."
    }
  ],
  "definitions": [
    {
      "term": "Funnel Area",
      "definition": "air space clearance at each end of a runway beginning at the end of the area mentioned in clause (k) (v) at the elevation of the end of runway and rising on a slope of 1 in 50 (for every 50 feet horizontal one foot vertical, known as glide angle) for a horizontal distance of 3,033 yards measured along and symmetrical about the extended centre line of runway, the width of the Funnel Area at the end of the distance mentioned in clause (k) (v) being 707 yards flaring up to 1,333 yards at the end;",
      "source_provision": "sec2"
    },
    {
      "term": "Area of Restricted Height",
      "definition": "air space clearance at each end of a runway beginning at the end of Funnel Area above an elevation of 60 yards measured above the elevation of the end of the runway and with a width of 1,333 yards and a length of 5,000 yards measured along and symmetrical about the extended centre line of the runway;",
      "source_provision": "sec2"
    },
    {
      "term": "Inner Horizontal Surface",
      "definition": "an air space clearance above an elevation of 50 yards over and above the established airfield elevation, the extent of this surface being limited to an area included within a radius of 4,333 yards measured from the geometrical centre of the runway known as reference point;",
      "source_provision": "sec2"
    },
    {
      "term": "Inner Conical Surface",
      "definition": "air space clearance extended outward and upward from the periphery of the Inner Horizontal Surface for a distance of 2,333 yards, the slope of Conical Surface being 20 horizontal to one vertical protruding above ;",
      "source_provision": "sec2"
    },
    {
      "term": "Outer Horizontal Surface",
      "definition": "air space clearance above an elevation of 166 yards over and above the established airfield elevation, the extent of this surface being limited to an area included between the outer periphery of Inner Conical Surface and a circle having a radius of 16,667 yards measured from the reference point;",
      "source_provision": "sec2"
    },
    {
      "term": "Transition Surface",
      "definition": "air space clearance joining two adjacent surfaces with a slope of 7 horizontal to one vertical measured outward and upward and all along the sides of runway Clearance Area, Funnel Area and Area of Restricted Height, the slope being measured at right angle to the runway axis except, at the ends of the Area of Restricted Height where it will be measured parallel to it.]",
      "source_provision": "sec2"
    }
  ]
}
