{
  "id": "pk-zakat-and-ushr-ordinance-1980",
  "type": "statute",
  "title": "Zakat and Ushr Ordinance, 1980",
  "title_en": "Zakat and Ushr Ordinance, 1980",
  "short_name": "ZAUO",
  "status": "in_force",
  "issued_date": "1980-06-19",
  "in_force_date": "1980-06-19",
  "url": "https://pakistancode.gov.pk/english/UY2FqaJw1-apaUY2Fqa-cpuY-sg-jjjjjjjjjjjjj",
  "description": "Official consolidated text of Zakat and Ushr Ordinance, 1980 (XVIII of 1980) published by The Pakistan Code (Land/Property Laws).",
  "provisions": [
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Section 2. Definitions",
      "content": "In this Ordinance, unless there is anything repugnant in the subject or\ncontext,—\n(i)        ‘Administrator-General’ means the person appointed as such under section 13,\nand includes an officer authorised by him to exercise or perform any power or\nfunction of Administrator-General under this Ordinance;\n(ii)        ‘annuity’ means the sum payable periodically, according to the annuity policy\nconditions, to an annuitant during his life-time, or for a fixed number of years,\nas the case may be, and includes the scheme of postal annuities as notified by\nthe Government;\n(iii)       ‘assets’ means assets liable to Zakat as provided in this Ordinance;\n(iv)        ‘atiyyat’ means voluntary donations to the Zakat Funds, otherwise than on\naccount of Zakat or Ushr, and includes sadaqat-e-nafilah ;\n(v)         ‘Central Council’ means the Council established under section 12;\n(vi)        ‘Chief Administrator’ means a person appoint as such under section 15, and\nincludes an officer authorised by him to exercise or perform any power or\nfunction of Chief Administrator under this Ordinance;\n_________________________________________________________________________________\n1\nIns. by Ordinance No. LII of 1980, s. 2.\n(vii)       ‘company’ means a company as defined in Companies Act, 1913 (VII of\n1913) ;\n(viii) ‘Deducting Agency’ means a bank, post office or other institution referred to\nin the sixth column of the First Schedule ;\n(ix)        ‘Deduction Date’ means, in respect of the assets mentioned in the First\nSchedule, the date or dates on which Zakat is to be deducted at source and\nwhich is or are specified in the fifth column of that Schedule;\n(x)         ‘District Committee’ means a Committee constituted under section 16 1[or, in\nthe case of the Islamabad Capital Territory, the Islamabad Zakat and Ushr\nCommittee] ;\n2\n[(xa) ‘Division concerned’ means the Division to which the business of this\nOrdinance stands allocated;]\n(xi)        ‘Government security’ has the same meaning as in the Securities Act, 1920 (X\nof 1920) ;\n1\n[(xia) Institution” “means deeni madaris, educational, vocational and social welfare\ninstitutions, public hospitals, charitable institutions and other institutions\nproviding health-care;]\n(xii)       ‘insurer’ means the State Life Insurance Corporation of Pakistan or Postal\nLife Insurance ;\n(xiii) ‘Local Committee’ means a Committee constituted under section 18 ;\n(xiv)       ‘locality’ means the area within the jurisdiction of a Local Committee ;\n(xv)        ‘maturity value’ means the sum payable, according to stipulated conditions,\non survival of the life assured to the specified age or to the end of the term of\nthe policy ;\n3\n[(xva) ‘nisab’, in relation to assets liable to Zakat, except agricultural produce and\nanimals fed free in pastures, means 612.32 grams of silver, or cash or gold, or\ngoods for trade, or any assets liable to Zakat under Shariah, the aggregate\nvalue of which is equal to the value of 612.32 grams of silver, as notified by\nthe Administrator-General for each Zakat year or, in the case of a person\nwhose assets liable to Zakat consist only of gold, 87.48 grams of gold;]\n(xvi)       ‘prescribed’ means prescribed by rules ;\n(xvii) ‘produce’ means gross agricultural, horticultural or forest produce ;\n(xviii) ‘Provident Fund’ has the same meaning as in the Provident Funds Act, 1925\n(XIX of 1925) ;\n1\nAdded and ins., by the Finance Act, 1994 (Act No. XII of 1994), s. 8.\n2\nIns. by Act No. LV of 2023, s.2.\n3\nIns. by Ordinance No. LII of 1980. s.3.\n1\n[(xix) “Provincial Council” means a Council constituted under section 14;]\n(xx)       ‘recognised Provident Fund’ means a Provident Fund recognised as such, by the\ncompetent authority, under the Income Tax Ordinance, 1979 (XXXI of 1979) ;\n(xxi)      ‘return’ means income, howsoever described, accruing on an asset ;\n(xxii)     ‘rules’ means rules made under this Ordinance ;\n2\n[(xxiii) ‘sahib-e-nisab’ means a person who owns or possesses assets not less than nisab, but\ndoes not include—\n(a)         the Federal Government, a Provincial Government or a local authority;\n(b)         a statutory corporation, a company or other enterprise, owned wholly,\ndirectly or indirectly, by the Federal Government, a Provincial\nGovernment, a local authority or a corporation owned by the Federal\nGovernment or a Provincial Government, either singly or jointly with\none or more of the other three ;\n(c)         a subsidiary of a statutory corporation, a company or other enterprise\nreferred to in sub-clause (b) and wholly owned by it ;\n(d)         the National Investment (Unit) Trust ;\n(e)         an ICP Mutual Fund ;\n(f)         a recognised Provident Fund ;\n(g)         any Unit Fund maintained by the Defence Services, including the Civil\nArmed Forces ;\n(h)         a Zakat Fund ;\n(i)         an institution, fund, trust, endowment or society___\n(a)    registered as a charitable organisation under the Societies\nRegistration Act, 1860 (XXI of 1860), or as a company under\nsection 26 of the Companies Act, 1913 (VII of 1913), or\nregistered or approved as a charitable or social welfare\norganisation under any other law for the time being in force,\nand\n(b)    approved by the Central Board of Revenue for the purposes of\nsection 47 of the Income Tax Ordinance, 1979 (XXXI of\n1979);\n1\nAdded by Act No.X of 1997 s. 2.\n2\nSubs. by Ordinance No. LII of 1980, s. 3.\n(j)        a deeni madrasah registered as such by the Auqaf Department ;\n(k)        a mosque ;\n(l)        an orphanage registered as such under the law relating to orphanages ;\n(m)        a Workers Participation Fund established under the Companies Profits\n(Workers Participation) Act, 1968 (XII of 1968); or\n(n)        amount of a party to a suit or case kept with or under the orders of a\ncourt pending decision of the suit or case ;]\n(xxiv) ‘security’ means any stock, share, scrip, debenture, bond, pre-organisation\ncertificate, or instrument commonly known as security;\n(xxv) ‘share’ means a share in the share-capital of a company, or in any body\ncorporate established by or under a Federal law or a Provincial law, and\nincludes stock;\n1\n[(xxvi) ‘sub-division’ means a sub-division of a district as notified by the Provincial\nGovernment ;]\n(xxvii) ‘surrender value’ means the sum payable by an insurer on cancellation of a\nlife-insurance policy or annuity, according to stipulated terms and conditions,\nat any time before maturity benefits become available;\n(xxviii) ‘survival benefit’ means the amount payable according to life-insurance\npolicy conditions, during the currency of a policy, on survival of the life\nassured to the specified date as stipulated in the policy;\n2\n[(xxix) ‘Taluqa Committee’ or ‘Sub-divisional Committee’ 3[or Town Committee]\nmeans a committee constituted under section 17 ;\n(xxixa) “Tehsil Committee” means a Tehsil committee constituted under section 17\nor, in the case of the Islamabad Capital Territory, the Islamabad Zakat and\nUshr Committee;]\n4\n[(xxx) ‘Valuation Date’ means—\n(a)        in respect of assets liable to Zakat, the first day of the Zakat year ; and\n(b)        in respect of produce liable to Ushr, such date or dates as may be\nprescribed or as may be notified by the Administrator-General or by a\nChief Administrator within his jurisdiction ;\nfor the evaluation of the assets or the produce for the purpose of this Ordinance ;]\n1\nSubs by the Finance Act 1994, (Act No. XII of 1994) s. 8.\n2\nAdded by Act No. X of 1997,s. 2.\n3\nIns. by Ordinance No.XXXV of 2002, s.2.( It shall come into force at once except in Islamabad Capital Territory where it shall come into force on\nsuch date as the Federal Government may, by notification in the Official Gazette, specify).\n4\nSubs. by Ordinance No. LII of 1980, s. 3.\n(xxxi) ‘Zakat Fund’ means a Fund established under section 7 ; and\n(xxxii) ‘Zakat year’ means year according to the Hijra calendar for which Zakat is\nchargeable, commencing on the first day of Ramadhan-ul-Mubarak and\nending with the last day of the following Sha’ban-ul-Moazzam :\nProvided that the first Zakat year shall commence with the com-\nmencement of this Ordinance and end with the last day of Sha”ban-ul-\nMoazzam, 1401 A. H."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Section 3. Charge and collection of Zakat",
      "content": "(1) Subject to the other provisions of this Ordinance,\nZakat in respect of assets mentioned in the First Schedule shall be charged and collected, on\ncompulsory basis, for each Zakat year, at the rates and in the manner specified therein, and as may\nbe prescribed, from every person 1[who is on the Valuation Date, and has for the preceding Zakat\nyear been, sahib-e-nisab] :\nProvided that where an asset mentioned in the First Schedule has been assigned by the person\nowning or possessing it, in favour of another person, Zakat in respect of that asset shall be charged\nand collected on compulsory basis as if the asset had not been so assigned [:]1\n1\n[Provided further that, if an asset was owned or possessed by a person on the Valuation Date\nbut is owned or possessed by some other person on the Deduction Date, the Zakat on such asset shall\nbe charged and collected from such other person on behalf of the person owning or possessing it on\nthe Valuation Date :\nProvided further that, if a person proves in the prescribed manner to the satisfaction of the\nLocal Committee of the locality where he ordinarily resides that he was not a sahib-e-nisab on the\nValuation Date or was not in ownership or possession of assets of the value of nisab for the whole of\nthe preceding Zakat year, Zakat shall not be so charged and collected from him, or if collected shall\nbe refunded to him in the prescribed manner :\nProvided further that no Zakat shall be charged and collected from the assets of a person who\ndied on or before the Deduction Date] 2[:]\n2\n[Provided further that no Zakat shall be charged or collected on compulsory basis in respect\nof any of the assets mentioned in the First Schedule which—\n(a)        have been acquired against payment in foreign currency ; or\n________________________________________________________________________\n1\nSubs. and added Ordinance No. LII of 1980, s. 4.\n2\nSubs, and added by Ordinance No. XLVI of 1984, s. 2.\n(b)        are maintained in foreign currency and the return on which, and the value on\nencashment, redemption or withdrawal which is payable in foreign currency]\n1\n[:]\n1\n[Provided further that the Federal Government may, by notification in the official Gazette,\nexempt any class of bonds or certificates issued by the Federal Government or a statutory\ncorporation a company or other enterprise, owned, directly or indirectly by the Federal Government,\na Provincial government, a Local authority or a corporation owned by the Federal Government or a\nProvincial Government, either singly or jointly with one or more of the other three, from deduction\nof Zakat on compulsory basis.]\n(2) In determining the amount to be collected as Zakat on compulsory basis, the value of an\nasset on which Zakat is deductible at source may be reduced, to the extent and in the manner\nprescribed, only on account of debts which have been—\n(a)        primarily secured by that asset ;\n(b)        used for the creation of an asset on which Zakat is deductible at source ; and\n(c)  obtained from the Deducting Agency having custody of the asset securing the\ndebt 2[* * *] and of the asset created under clause (b).\n2\n[(3) Where a person from whom Zakat has been deducted at source—\n(a)        proves that—\n(i)        he is not a Muslim, or\n(ii)       he is not a citizen of Pakistan, or\n(iii)      the amount deducted from him is more than what is due under this\nOrdinance, either on account of an error apparent from the record, or\non account of reduction provided for in sub-section (2) not having\nbeen duly allowed to him, or\n(iv)       he falls under any of the exclusions given in sub-clauses (a) to (n) of\nclause (xxiii) of section 2, or\n(b)        proves, as laid down in the third proviso to sub-section (1), that he is not a\nsahib-e-nisab or was not in ownership or possession of nisab for the whole of\nthe preceding Zakat year, or\n(c)        files a declaration such as is referred to in the second proviso to sub-section\n(3) of section 1, which has not been challenged in the Federal Shariat Court\nunder-subsection (3A) of that section, and claims refund,\nthe amount so deducted or, as the case may be, the amount so deducted in excess shall be refunded\nto him in the prescribed manner.]\n(4) Where the recovery of Zakat deductible at source, in respect of any of the assets\nmentioned in the First Schedule, falls into arrears, the Administrator-General may forward to the\nCollector of the district concerned a duly signed certificate specifying the amount of arrears due and\nthe particulars of the person from whom due, and the Collector shall, on receipt of such certificate,\nproceed to recover the amount so specified, as if it were an arrears of land revenue.\n1\nSubs. and added by the Finance Act, 1987 (Act No. VI of 1987), s. 11.\n2\nOmitted and subs. by Ordinance No. LII of 1980, s. 4.\n(5) A sahib-e-nisab may pay either to a Zakat Fund or directly to those eligible under Shariah\nto receive Zakat so much of the Zakat due under Shariah as is not deductible at source under this\nOrdinance, for example, that due in respect of assets mentioned in the Second Schedule.\n1\n[(6) Any amount deducted at source by the Deducting Agency from any person shall be\ntreated as payment of Zakat on behalf of such person or, in the case of a person referred to in sub-\nsection (3) of section 1, as contribution to Zakat Fund or Sadaqah or khairat in the name of Allah, as\nthe case may be, on the part of that person.]"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Section 4. Secrecy of information",
      "content": "Any information furnished or collected in connection with the\ndeduction of Zakat at source under this Ordinance shall be treated as secret and shall not be used for\nany other purpose, including the assessment or collection of any tax.\nUSHR"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Section 5. Charge and collection of Ushr",
      "content": "(1) Subject to the other provisions of this Ordinance,\nthere shall be charged and collected, on compulsory basis, in such manner as is laid down in section\n6, and as may be prescribed, from every land-owner, grantee, allottee, lessee, lease-holder or land-\nholder (other than a person excluded from the definition of sahib-e-nisab) Ushr at the rate of five per\ncent of his share of the produce, as on the Valuation Date :\nProvided that if any plot of land is used principally for growing one crop and a small portion\nthereof, not exceeding one-fourth of an acre, is used for growing another crop, Ushr shall not be\ncharged in respect of the produce of such small portion.\nExplanation.— In this section and section 6, ‘land-owner’, ‘grantee’, allottee, ‘lessee’,\n‘lease-holder’ and ‘land-holder’ shall have the same meaning as in the laws relating to land\nadministration and ‘land-holder’ includes a person in possession of any plot of land who has grown a\ncrop on such plot.\n(2) An individual land-owner, grantee, allotee, lessee, lease-holder or landholder shall be\nexempt from the compulsory levy of Ushr if—\n(a)        he is eligible under Shariah to receive Zakat ; or\n(b)        the produce from his land is less than five wasqs (— 948 kilograms) of wheat,\nor its equivalent in value in the case of other crops liable to Ushr.\n(3) The currency equivalent of five wasqs of wheat in value shall be such as may be notified\nfor each Zakat year by the Administrator-General.\n(4) Ushr shall be the first charge on the produce.\n(5) Ushr shall be collected in cash :\n_________________________________________________________________________________\n1\nSubs. by Ordinance No. LII of 1980, s. 4.\nProvided that, where the produce consists of wheat or paddy, Ushr, at the option of the\n1\n[Provincial Council] may be collected in kind.\n(6) A Sahib-e-nisab may pay either to the Local Zakat Fund or directly to those eligible\nunder Shariah to receive Zakat, so much of the Ushr due under Shariah as is not compulsorily\nrealizable under this Ordinance, for example, in respect of item 9 of the Second Schedule.\n2\n[6. Mode of assessment and collection of ushr.—(1) The Provincial Revenue Department\nshall assess and collect Ushr in respect of a land-owner, guarantee, lessee, lease-holder or land\nholder in the prescribed manner, and maintain the record containing such information for a crop\nseason as may be required for the purposes of this Ordinance.\n(2) In the case of lease in force immediately before the commencement of this Ordinance, or,\nafter the commencement of the Finance Act, 1990, the liability of the lessor and lessee to pay Ushr\nshall be equitably apportioned between them by the Tehsildar or, as the case may be, Mukhtiarkar.\n(3) An assessee aggrieved by the assessment under subsection (1), or as the case may be, a\nlessor or lessee aggrieved by the apportionment under sub-section (2), may, within thirty days of the\nProvincial Revenue Department announcing the assessment, or, as the case may be, apportionment,\napply, in the prescribed form and manner to the 3[Deputy District Officer (Revenue)] for a revision\nof the assessment or apportionment:\nProvided that no such application shall be admitted unless the applicant has deposited into\nthe 4[District] Zakat Fund not less than fifty per cent of his liability as assessed or apportioned by the\nProvincial Revenue Department.\n(4) The 3[Deputy District Officer (Revenue)] may, at any time, either of his own motion or\non the application of an adult Muslim residing within his jurisdiction, make an order enhancing the\nliability assessed under sub-section (1) or apportioned under sub-section (2):\nProvided that no such order shall be made unless the person affected has been given an\nopportunity of showing cause against it and of being heard.\n(5) The 3[Deputy District Officer (Revenue)] to whom an application is made under sub-\nsection (3) or sub-section (4), or who takes up a matter under sub-section (4) of his own motion,\nshall give his decision within a period not exceeding one month counted from the date on which he\nreceives the application or, as the case may be, so takes up the matter; and such decision shall be\nfinal and shall not be questioned before any Court or other authority.\n(6) The demand as determined under sub-section (1) or, as the case may be, under sub-\nsection (4) or sub-section (5), shall be paid by the assessee and collected by the Provincial Revenue\nDepartment in such manner as may be prescribed and deposited into the 4[District] Zakat Fund.\n(7) Where the recovery of Ushr compulsorily realizable under this Ordinance falls into\narrears, the Tehsildar or, as the case may be, Mukhtiarkar shall proceed to recover the amount so\nspecified as if it were an arrear of land revenue.]\n1\nSubs. by Act No. X of 1997 s. 3.\n2\nSubs. by the Finance Act 1990. (Act No. VII of 1990) s. 8.\n3\nSubs. by Ordinance No.XXXV of 2002, s.3.( It shall come into force at once except in Islamabad Capital Territory where it shall come into force on\nsuch date as the Federal Government may, by notification in the Official Gazette, specify).\n4\nSubs. by the Finance Act, 1994 (Act No.XII of 1994) s. 8.\n[7. Establishment of Zakat Funds. —There shall be established the following Zakat Funds,\n1\nnamely, —\n(a)          a Central Zakat Fund to which shall be credited—\n(i)     the Zakat deducted at source;\n(ii)    the Zakat paid into it voluntarily including voluntary contribution\nmade by Pakistani citizens and other persons residing abroad;\n(iii)   the transfers, if any, from the Provincial Zakat Funds; and\n(iv)   the grants, atiyyat and any other receipts including voluntary\ncontributions made by Pakistani citizens and other persons residing\nabroad;\n(b)          a Provincial Zakat Fund for each Province to which shall be credited__\n(i)     the transfers to it from the Central Zakat fund ;\n(ii)    the Zakat paid into it voluntarily ;\n(iii)   the transfers, if any, from the District Zakat Fund ;\n(iv)    the transfers, if any, for the Local Zakat Fund ; and\n(v)     the grants, atiyyat and any other receipts; and\n(c)          a District Zakat Fund for each District to which shall be credited,—\n(i)     the transfers to it from the Provincial Fund ;\n(ii)    the proceeds of Ushr to be deposited in the personal ledger account of\nDistrict Zakat Fund ;\n(iii)   the Zakat paid into it voluntarily ;\n(iv)    the transfers, if any, from the Local Zakat Funds ; and\n(v)     the grant atiyyat and any other receipts ; and\n(d)          a Local Zakat Fund for each Local Committee to which shall be credited —\n(i)     the Zakat paid into it voluntarily ;\n(ii)    the transfers to it from the District Zakat Fund ;\n(iii)   the transfer to it from the Provincial Zakat Fund; and\n(iv)    the grants, atiyyat and any other receipts.]\n_________________________________________________________________________________\n1\nSubs. by Act No.X of 1997 s. 4.\n1\n[8. Utilization of Zakat Funds.—The moneys in a Zakat Fund shall be utilized for the\nfollowing purposes, namely:—\n(a)        assistance to the needy, the indigent and the poor particularly orphans and\nwidows, the handicapped and the disabled, eligible to receive Zakat under\nShariah for their subsistence or rehabilitation, either directly or indirectly\nthrough deeni madaris or educational, vocational or social institutions, public\nhospitals, charitable institutions and other institution providing health care :\nProvided that the lists of the individuals to be assisted directly and of\nthe institutions through which assistance is to be given from a Zakat Fund\nshall be prepared and maintained in such form and manner as may be\nprescribed ;\n(b)        assistance to the needy persons affected or rendered homeless due to natural\ncalamities like floods and earthquakes and for their rehabilitation ;\n(c)        expenditure on the collection, disbursement and administration of Zakat and\nUshr ;\nProvided that—\n(i)       the expenditure on the administrative Division and the Central Council\nshall be met by the Federal Government ;\n(ii)      the expenditure on the administrative organization of a Chief\nAdministrator, the Provincial Council, and a District Committee shall\nbe met by the Provincial Government 2[:]\n2\n[Provided that where expenditure on the administrative\norganization of a District Zakat Committee is not fully met by the\nProvincial Govertement due to paucity of funds during a financial\nyear, the Central Zakat Council may provide supplementary funds not\nexceeding two percent from within the limit specified in clause (iii)\nand]\n(iii)     the funds not exceeding ten per cent approved in the budget shall be\nretained in the Provincial Zakat Fund to meet such additional\nexpenditure of a Local Committee as may be approved by the Central\nZakat Council :\nProvided also that the banking services and the services\nconnected with the assessment, collection or disbursement of Zakat\nand Ushr realizable on compulsory basis under this Ordinance shall be\nrendered free of charge, except that the Administrator General, in\nregard to Ushr, may authorise payment of remuneration for any\nspecified services ;\n(d)        investment in any non-interest bearing instruments as it permitted under\nShariah ; and\n(e)        any other purpose permitted by Shariah.]\n1\nSubs. by Act No. X of 1997 s. 5.\n2\nSubs. and added by Ordinance No.XXXVIII of 2002, s.2.\n1\n[9. Disbursement from Zakat Funds.— (1) The Central Zakat Council shall prepare\nbudget for each financial year and may, from the Central Zakat Fund, make disbursements and\ntransfer funds to Provincial Zakat Fund in such form and manner as maybe prescribed and as would\nhelp in ensuring satisfaction of the needs of the needy and the poor throughout the country as far as\npossible, on a uniform basis.\n(2) A Provincial Council may from the Provincial Zakat Fund make disbursements and\ntransfer funds to 2[the Personal Ledger Account of the] District Zakat Fund on the basis of\npopulation in such form and manner as may be prescribed and as would help in ensuring satisfaction\nof the needs of the needy and the poor throughout its jurisdiction, as for as possible, on a uniform\nbasis :\nProvided that a Provincial Council may, in exceptional circumstances, transfer funds from\nthe Provincial Zakat Fund to the Central Zakat Fund.\n(3) A District Committee may make disbursements and transfer funds 2[through crossed\ncheques] from District Zakat Fund to a Local Zakat Fund or to an institution or incur other\nadministrative expenditure subject to such conditions as may be prescribed and may, whenever\ndirected by the Central Council, transfer any funds surplus to its needs to the Provincial Zakat Fund.\n(4) A Local Committee may disburse or incur expenditure from the Local Zakat Fund\n2\n[through crossed cheques] as may be prescribed :\nProvided that a Local Committee may, if so required by the Provincial Council or the District\nCommittee, transfer any funds surplus to its needs from the Local Zakat Fund to the Provincial Zakat\nFund or, as the case may be, District Zakat Fund surplus to its needs :\nProvided further that the Central Council or Provincial Council or a District Committee shall\ndisburse Zakat through a Bank or a Post Office or any other financial institution as may be\ndetermined by the Central Zakat Council in such form and manner as may be prescribed.]"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Section 10. Accounts",
      "content": "1[(1) The accounts of the Central Zakat Fund, a Provincial Zakat Fund, a\nDistrict Zakat Fund, and a Local Zakat Fund shall be maintained and operated, respectively, by the\nAdministrator-General, the Chief Administrator, the District Committee and the Local Committee, in\nsuch form and manner as may be prescribed.]\n(2) The records of the accounts of the Zakat Funds shall be preserved for such period, and\nshall be made available for audit or inspection to such persons or agencies, and in such manner, as\nmay be prescribed.\n1\n[11. Audit.— (1) To carry out audit of the Central Zakat Fund annually or at shorter\nintervals, the Central Council, and to carry out audit of a Provincial Zakat Fund annually or at\nshorter intervals, the Provincial Council, shall request the Auditor-General of Pakistan and Local\nfund audit to conduct the audit.\n(2) To carry out audit of a District Zakat Fund within a Province annually or at shorter\nintervals, the Provincial Council shall request the Auditor-General of Pakistan to conduct the audit.\n(3) To carry out audit of the Local Zakat Funds within a district annually or at shorter\nintervals, the District Committee shall request the Auditor-General of Pakistan to conduct audit of\nthe local fund.\n(4) The audit performed by Auditor-General under sub-sections (1), (2) and (3) shall include\npropriety audit.\n_________________________________________________________________________________\n1\nSubs. by Act No. X of 1997 ss. 6, 7 and 8.\n2\nIns. by Ordinance No. LIX of 2000,s.3.\n(5) The annual report of the Auditor-General on the Central Zakat Fund shall be laid before\nthe Majlis-e-Shoora (Parliament), that on a Provincial Zakat Fund before the Provincial Assembly\nconcerned, and that on a District Zakat Fund or a Local Zakat Fund before the 1[District Assembly]\nconcerned established under the law relating to local government.\n(6) Nothing in this section shall be deemed to prevent—\n(a)        the Central Council from getting audited any of the Provincial, District or\nLocal Zakat Funds ;\n(b)        the Provincial Council from getting audited any of the District or Local Zakat\nFunds within its jurisdiction ; or\n(c)        a Local Committee from getting its own Local Zakat Fund audited.\n(7) Notwithstanding anything contained in the preceding sub-sections, the Auditor General\nshall conduct annual audit of the Central Zakat Fund, the Provincial Zakat Fund, District Zakat\nFunds and Local Zakat Funds including the accounts of a Deducting Agency or an institution\nreceiving Zakat.]"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Section 12. Central Zakat Council",
      "content": "(1) The Federal Government shall, by notification in the\nofficial Gazette, establish a Central Zakat Council to provide policy guide-lines for, and to exercise\ngeneral superintendence and control over matters relating to Zakat and Ushr, particularly the Zakat\nFunds and maintenance of their accounts.\n2\n[(2). The Central Council shall consist of.—\n(a)        a Chairman;\n(b)        four persons to be nominated by the President, of whom three shall be Ulema\nnominated in consultation with the Council of Islamic Ideology ;\n(c)        one person from each Province, to be nominated by the President ;\n(d)        two women, who shall not be less than forty five years of age, to be\nnominated by the President;\n(e)        the Chief Administrators ;\n(f)        the Secretary to the Government of Pakistan in the Ministry of Finance ;\n1\nSubs. by Ordinance No.XXXV of 2002, s.4.( It shall come into force at once except in Islamabad Capital Territory where it shall come into force on\nsuch date as the Federal Government may, by notification in the Official Gazette, specify).\n2\nSubs. by Act No. X of 1997, s.9.\n(g)        the Secretary to the Government of Pakistan in the Ministry of Religious\nAffairs, Zakat, Ushar and Minorities Affairs;\n(h)        the Secretary to the Government of Pakistan in the Ministry of Health ;\n(i)        the Secretary to the Government of Pakistan in the Ministry of Education ;\nand\n(j)        the Administrator-General, who shall also be the Secretary General of the\nCouncil.\n(3) The Chairman of the Central Council shall be a person who is, or has been, a judge of the\nSupreme Court of Pakistan, to be nominated by the President in consultation with the Chief Justice\nof Pakistan.\n(4) The Chairman and members of the Central Council, other than ex-officio members, shall\nhold office during the pleasure of the President for a term of three years, and shall be eligible for\nreappointment for another term.]\n(5) The Chairman or a member, not being an ex-officio member, may, by writing under his\nhand addressed to the President resign his office :\nProvided that he shall continue to hold office until his resignation is accepted by the\nPresident.\n(6) Any vacancy in the office of Chairman or member, other than an ex-officio member,\nshall be filled by the nomination, in accordance with sub-section (2) or sub-section (3), as the case\nmay be, of a person qualified to hold the office.\n(7) The Chairman or the member nominated under sub-section (6) shall hold office for the\nunexpired term of his predecessor.\n1\n[13. Administrator-General.—(1) For carrying out the purpose of this Ordinance, the\nSecretary 2[of the Divison concerned], Government of Pakistan, shall perform the functions of the\nAdministrator-General under this Ordinance.\n(2) The Administrator-General shall be the Chief Executive in respect of matters relating to\nZakat and Ushr and shall act under the general superintendence and control of, and in accordance\nwith the policy guidelines given by, the Central Council.]\n1\n[14. Provincial Zakat Council.—(1) In each Province, the Provincial Government shall, by\nnotification in the official Gazette, establish a Provincial Zakat Council, to exercise general\nsuperintendence and control over matters relating to Zakat and Ushr, particularly the Zakat Funds in\nthe Province and the maintenance of their accounts, in accordance with the policy guidelines given\nby the Central Council.\n(2) The Provincial Council shall consist of—\n(a)        a Chairman ;\n1\nSubs. by Act No. X of 1997 s. 10 and 11.\n2\nSubs. by Act No. LV of 2023, s.3.\n(b)       five persons, of whom three shall be ulema, to be nominated by the Governor ;\n(c)        two women, who shall not be less than forty-five years of age, to be\nnominated by the Federal Government ;\n(d)        the Secretary to the Provincial Government in the Finance Department ;\n(e)        the Secretary to the Provincial Government in the Local Government\nDepartment ;\n(f)        the Secretary to the Provincial Government in the Social Welfare Department\n; and\n(g)        the Chief Administrator, who shall also be the Secretary of the Council.\n(3) The Chairman of the Provincial Council shall be a person who is, or has been, a Judge of\na High Court, to be nominated by the Governor in consultation with the Chief Justice of the High\nCourt.\n(4) The Chairman and members of the Provincial Council, not being an ex-officio member,\nshall hold office for a term of three years and shall be eligible for re-appointment.\n(5) The Chairman or a member, not being an ex-officio member, may, by writing under his\nhand addressed to the Governor resign his office.\n(6) Subject to sub-section (5) the Chairman or, as the case may be, a member shall continue\nto hold office until his resignation is accepted by the Governor.\n(7) Any vacancy in the office of Chairman or member, other than an ex-officio member, shall\nbe filled by the nomination, in accordance with sub-section (2) or sub-section (3) as the case may be,\nof a person qualified to hold the office.\n(8) The Chairman or the member nominated under sub-section (7) shall hold office for the\nunexpired term of his predecessor.\n(9) In the Islamabad Capital Territory, the functions of the Provincial Council shall be\nperformed by the Central Council].\n1\n[15. Chief Administrator.—(1) In each Province, for carrying out the purposes of this\nOrdinance, there shall be appointed by the Governor, in consultation with the Federal Government, a\nChief Administrator.\n(2) The Chief Administrator shall have the status and grade of, and be ex-officio, Member,\nBoard of Revenue and his tenure and other terms and conditions of service shall be such as may be\ndetermined by the Provincial Government.\n(3) The Chief Administrator shall act under the general superintendence and control of the\nProvincial Council and perform, as the Chief Executive of the Council, such functions as are\nassigned to him by or under this Ordinance.]\n1\nSubs.by Act No. X of 1997, s. 12.\n1\n[16. District Zakat and Ushr Committee.—2[(1) In each district, a District Zakat and Ushr\nCommittee, in the Islamabad Capital Territory, the Islamabad Zakat and Ushr Committee and in\nKarachi, Karachi City District Government Zakat and Ushr Committee shall be constituted by the\nProvincial Council concerned.]\n(2) The District Committee shall, subject to such guidelines as may be given by the Central\nCouncil or the Provincial Council, —\n(a)        Oversee, generally, the functioning of administrative organization of Zakat\nand, more particularly, the assessment of Ushr and atiyyat and the\ndisbursement and utilization of the moneys in the District Zakat Fund and the\nLocal Zakat Fund;\n(b)        for the purposes mentioned in clause (a), make plans for the district, in such\nform and manner as may be prescribed;\n(c)        prepare and maintain accounts of the District Zakat Fund in such form and\nmanner as may be prescribed ;\n(d)        compile accounts of the Local Zakat Funds, for the district, in such form and\nmanner as may be prescribed;\n(e)        arrange, in the prescribed manner, audit of the Local Zakat Funds in the\ndistrict; and\n(f)        tender to the provincial Council advice on any matter specified by it.\nExplanation.—In this sub-section and in the succeeding provisions of this Ordinance,\nreference to “District Committee” shall be deemed to include a reference to the Islamabad Zakat and\nUshr Committee.\n(3) The District Committee shall consist of.—\n(a)        a Chairman, who shall be non-official, the 2[District Officer (Revenue)] of the\ndistrict and two women from within the district who shall not be less than\nforty-five years of age and one non-official member from each tehsil, taluqa\nor sub-division in the district :\nProvided that where the number of tehsil, taluqas or sub-divisions in a\ndistrict is less than five, the number of members other than the Chairman and\nthe women members shall be raised to seven :\nProvided further that, in any district where there is a District Social\nWelfare Officer appointed by the Government, the District Committee may\nco-opt him as a member of the Committee, ex-officio.\n1\nSubs. by Act No. X of 1997, s.13.\n2\nSubs. by Ordinance No.XXXV of 2002, s.5.( It shall come into force at once except in Islamabad Capital Territory where it shall come into force on\nsuch date as the Federal Government may, by notification in the Official Gazette, specify).\n(b)        The District Zakat Officer, who shall also be the Secretary of the Committee ;\nExplanation.—Subject to sub-section (7), the District Committees\nexisting before the 5th November, 1996 shall cease to function and new\nDistrict Committees shall be constituted under this section.\n(4) The Chairman shall be nominated by the Provincial Council and the members shall be\nnominated by the Provincial council in consultation with the Chairman :\nProvided that the Chairman shall be an adult Muslim who ordinarily resides in the district\nand the member from a tehsil, taluqa or sub-division shall be an adult Muslim who ordinarily resides\nin that tehsil, taluqa or sub-division 1[:]\n1\n[Provided further that the Chairman and members of the District Committee shall be the\npersons who are of good moral character and are not commonly known as persons who violate\nIslamic Injunctions and are of financial integrity and do not engage in political activities.]\n(5) The District Committee so constituted shall be duly notified by the Provincial Council\nconcerned.\n(6) The Chairman and members of the District Committee, not being an ex-officio member,\nshall hold office for a term of three years and shall be eligible for re-appointment :\nProvided that in the event of delay in the constitution of the new Committee under sub-\nsection (3), the Provincial Council may ask a District Committee to continue to function for a period\nnot exceeding six months after the expiry of the term of its office.\n(7) The Chairman or a member, not being an ex-officio member, may, by writing under his\nhand addressed to the Provincial Council, resign his office.\n(8) Subject to sub-section (7) the Chairman or, as the case may be, a member shall continue\nto hold office until his resignation is accepted by the Provincial Council.\n(9) Any vacancy in the office of chairman or member, other than an ex-officio member, shall\nbe filled by the nomination, in accordance with sub section (4), of a person qualified to hold the\noffice.\n(10) The Chairman or member nominated under sub section (9) shall hold office for the\nunexpired term of his predecessor.\n(11) The District Committee shall hold meetings of the Committee at least once in every\nthree months.]\n2\n[17. Tehsil, Taluqa or Sub-divisional Zakat and Ushr Committee 3[or Town Zakat and\nUshr Committee].— (1) There shall be constituted.—\n(a)        a Tehsil or Taluqa Zakat and Ushr Committee in each tehsil or taluqa;\n________________________________________________________________________\n1\nSubs. and added by Ordinance No. LIX of 2000, s.4.\n2\nSubs. by Act No. X of 1997, s.14.\n3\nAdded by Ordinance No.XXXV of 2002, s.6.( It shall come into force at once except in Islamabad Capital Territory where it shall come into force on\nsuch date as the Federal Government may, by notification in the Official Gazette, specify).\nProvided that, if the Provincial Council so directs in respect of any\nsub-tehsil, a Tehsil Zakat and Ushr Committee may be constituted in the sub-\ntehsil; and, where a Committee is constituted in a sub-tehsil, such Committee\nand such sub-tehsil shall be deemed to be a Tehsil Zakat and Ushr Committee\nand a tehsil, respectively, for the purposes of this Ordinance; and\n(b)        a Sub-divisional Zakat and Ushr Committee in each sub-divisional of the\ndistrict of Lahore and 1[a Town Zakat and Ushr Committee in each town of\nKarachi City District Government, Karachi].\n(2) The Tehsil Committee, Taluqa Committee or sub-divisional Committee shall, subject to\nsuch guidelines as may be given by the central council, the Provincial Council or the District\nCommittee, —\n(a)        oversee assessment of Ushr and collection of Zakat, Ushr and attiyyat, and the\ndisbursement and utilization of the moneys in the Local Zakat Funds, by the\nLocal Committees in the tehsil, taluqa or sub-division;\n(b)        for the purposes mentioned in clause (a) make plans for the tehsil, taluqa or\nsub-division, as the case may be, in such form and manner as may be\nprescribed;\n(c)        compile accounts of the Local Zakat Funds for the tehsil, taluqa or\nsub-division, as the case may be, in such form and manner as may be\nprescribed; and\n(d)        tender to the District Committee advice on any matter connected with the\ncollection, disbursement or utilization of Zakat or Ushr.\n(3) The Tehsil Committee, Taluqa Committee or Sub divisional Committee shall consist of\nthe 1[Deputy District Officer (Revenue)], two women members and six members to be elected, in the\nprescribed manner, by the Chairmen of the Local Committees of the tehsil, taluqa or sub-division,\nfrom amongst themselves;\nProvided that, if there are more than two tehsil Committees or Taluqa Committee within the\njurisdiction of an 1[Deputy District Officer (Revenue)], he shall be a member of only such of the\nCommittees as the Provincial Council may specify and the Provincial Council may nominate the\nTehsildar or Mukhtiarkar of the tehsil or taluqa concerned, as the case may be, to be the member of\nany other of the said Tehsil Committees or Taluqa Committees:\nProvided further that the two women members shall be nominated by the District Committee\nin consultation with the Chairman of the Tehsil, Taluqa or Sub-divisional Committee concerned and\nshall not be less than forty-five years of age.\n(4) The members of the committee shall elect one of their member to be the Chairman of the\nCommittee; and, if two or more persons secure an equal number of votes, the result of the election\nshall be determined by drawing lots.\n________________________________________________________________________\n1\nSubs. by Ordinance No.XXXV of 2002, s.6.( It shall come into force at once except in Islamabad Capital Territory where it shall come into force on\nsuch date as the Federal Government may, by notification in the Official Gazette, specify).\n(5) The Tehsil, Taluqa or Sub-divisional Committee so constituted shall be duly notified by\nthe District Committee concerned.\n(6) The Chairman and members of a Tehsil Committee, Taluqa Committee or Sub-divisional\nCommittee, not being an ex officio member, shall hold office for a term of three years and shall be\neligible for re-election.\n(7) The Chairman or a member, not being an ex officio member, may by writing under his\nhand addressed to the Tehsil Committee or, as the case may be, Taluqa Committee or, as the case\nmay be, Taluqa Committee or Sub-divisional Committee, resign his office.\n(8) Subject to sub-section (7), the Chairman or a member shall continue to hold office until\nhis resignation is accepted by the Tehsil Committee or, as the case may be, Taluqa Committee or\nSub divisional Committee.\n(9) Any vacancy in the office of Chairman or member, other than an ex-officio member, shall\nbe filled by the election, in accordance with sub section (3), or, as the case may be, sub-section (4),\nof a person qualified to hold the office.\n(10) The Chairman or member elected under sub-section (9) shall hold office for the\nunexpired term of his predecessor.]\n[18. Local Zakat and Ushr Committee. — (1) A Local Zakat and Ushr Committee shall be\n1\nconstituted for,\n(a)        each revenue estate in settled rural area;\n(b)        each deh or village in non-settled rural area; and\n(c)        each ward in urban area :\nProvided that, if in the opinion of the Provincial Council the population of a\nrevenue estate, deh or village is too large, or too small, to have one local Zakat and\nUshr Committee, such revenue estate, deh or village may, if too large, be divided into\ntwo or more localities, or if too small, grouped with any other revenue estate, deh or\nvillage to form one locality, and where a revenue estate, deh or village is so divided\nor grouped after the constitution of a local Committee that it covers a population of\nten thousand persons the Provincial Council may make such consequential orders as\nmay be necessary for the purposes of this Ordinance.\nExplanation. — In this sub-section.—\n(a)        “urban area” means area within the local limits of a Municipal Corporation,\nMunicipal Committee, Cantonment Board or Town Committee;\n(b)        “rural area” means area other than urban area;\n(c)        “settled rural area” means rural area for which revenue settlement record\nexists;\n(d)        “non-settled rural area” means rural area other than settled rural area ; and\n1\nSubs. by Act No. X of 1997, s. 15.\n(e)    “ward” means a distinct and compact locality the population of which does\nnot exceed ten thousand persons approximately.\n(2) The Local Committee shall, subject to such guidelines as may be given by the Provincial\nCouncil and the District Committee or the Tehsil, Taluqa or sub-divisional Committee.\n(a)    determine istehqaq separately for—\n(i)     subsistence allowance;\n(ii)    rehabilitation, either directly or indirectly through deeni madris,\neducational, vocational and social welfare institutions;\n(iii)   treatment through public hospitals, charitable institutions and other\ninstitutions providing health care; and\n(iv)   any other purpose as may be permitted by Shariah;\n(b)    collect voluntarily Zakat, Ushr and attiyyat and deposit the moneys in the\nDistrict Zakat Fund;\n(c)    prepare and maintain accounts of the Local Zakat Fund in such form and\nmanner as may be prescribed; and\n(d)    tender to the Tehsil, District Committee advice on any matter connected with\ncollection, disbursement and utilization of Zakat, Ushr and attiyyat.\n(3) The Local Committee shall consist of nine members, of whom two shall be Muslim\nwomen who are not less than forty five years of age selected by the residents of the locality in the\nmanner specified in sub-section (4).\n(4) The District committee shall constitute a team of three or more persons including at least\none gazetted officer, one aalim-e-deen and one member of the District Committee to organize a\npublic gathering of the adult Muslims, teachers and ulema residents of a locality and call upon them\nto select, in the prescribed manner, seven adult Muslims residing in that locality who possess\nSecondary School Certificate and are known to be pious and who offer five times prayer daily, and\nhave sound moral and financial integrity and not engaged in political activity :\nProvided that a person who is a member of a team constituted for the selection of members of\na Local Committee shall not be eligible to be a member of such Local Committee and except in the\ncase of such Local Committees in the Islamabad Capital Territory as may be notified by the\nAdministrator-General, a person who is a salaried employee of Government or of a local authority\notherwise than as Pesh Imam of a local mosque or a teacher of a local school, or of a corporation set-\nup owned or controlled by Government shall not be eligible to be member of a Local Committee :\nProvided further that, where in a district the number of Local Committees is so large that the\nmembers of the District Committee cannot be put on all the teams constituted for the selection of\nmembers of Local Committees in the district, the District Committee, may, at its discretion,\nnominate any other non-official person of the district to represent it on the said team:\nProvided further that the team constituted by the District Committee shall organize a separate\ngathering of the adult Muslim female residents of the locality and call upon them to select, in the\nprescribed manner, two Muslim women residing in that locality who are known to be pious and who\nenjoy their trust to be members of the Local Committee.\n(5) The members of a Local Committee shall elect one of their members, being a person who\npossesses Secondary School Certificate and who offers prayer five times during a day regularly and\nobserves the fast throughout Ramadhan-ul-Mubarak according to the injunctions of Islam, to be the\nChairman of the Local Committee, and if two or more persons secure an equal number of votes, the\nresult of the election shall be determined by drawing lots.\n(6) The Local Committee so constituted shall be duly notified by the District Committee\nconcerned.\n(7) Any adult Muslim resident of a locality who is aggrieved by the conduct or the result of\nthe proceedings for the selection of the members, or the election of the Chairman, of the Local\nCommittee concerned may prefer an appeal to District Committee:\nProvided that the District Committee shall not grant any injunction or make any interim\norder, including a stay order, during the period an appeal is pending.\n(8) The District Committee to which an appeal under sub-section (9) is preferred shall decide\nthe appeal with in such time as may be prescribed; and the decision of the District Committee shall\nbe final and prescribed, and the decission of the District Committee shall be final and shall not be\ncalled in question before any court or other authority.\n(9) The Chairman and members of the Local Committee shall hold office for a term of three\nyears and shall be eligible for re-election or re-selection as the case may be :\nProvided further that the District Committee may, in consultation with the Federal\nGovernment, remove a Chairman or a member or the Local Committee from his office and nominate\nanother person as Chairman or, as the case may be, a member for the unexpired term of his\npredecessor :\nProvided also that a Chairman shall not be eligible to hold office for more than two\nconsecutive term of three years each :\nProvided further that the District Committee may, in the event of delay in the constitution of\nthe new Local Committee, ask a Local Committee to continue to function for a period not exceeding\nsix months after the expiry of term of its office.\n(10) The Chairman or a member may by writing under his hand addressed to the District\nCommittee, resign his office.\n(11) Subject to sub-section (1) the Chairman or, as the case may be, a member shall continue\nto hold office until his resignation is accepted by the District Committee.\n(12) Any vacancy in the office of Chairman or member shall be filled by election or selection\nof a person qualified to hold the office, in accordance with the provisions of sub-section (4) or, as the\ncase may be, sub-section (7).\n(13) The Chairman, or the member elected or selected, as the case may be, under sub-section\n(12), shall hold office for the unexpired term of his predecessor.\n(14) All Local Committees existing before the 5th November, 1996, shall cease to function\nfrom that date.]\n1\n[19. Vacancy etc., not to invalidate acts or proceedings.—Notwithstanding anything\ncontained in this Ordinance, no act or proceeding of a Council or committee established or con-\nstituted under this Ordinance shall be invalid by reason only of the existence of a vacancy in, or\ndefect in the constitution of, such Council or Committee]\n1\n[19A Members of Council and other Committees to be Muslims.—(1) All the members of\nthe Central Council, Provincial Council and other Committees shall be Muslim and where the holder\nof an office cannot become a member by reason of his not being a Muslim, the President in case of\nthe Central Council, the Governor in case of Provincial Council and Provincial Council in the case\nof District Committees shall nominate a Muslim official member in his place.\n(2) Except in the case of Islamabad Capital Territory, a person who is a salaried employee of\nGovernment or of a local authority, otherwise than a Pesh Imam of a local mosque or a teacher of a\nlocal school or of a corporation set-up, owned or controlled by the Government shall not be eligible\nto be a member of a Committee constituted under section 18.]"
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Section 20. Person to preside at meetings in the absence of Chairman",
      "content": "(1) If the office of\nChairman of a Council or Committee established or constituted under this Ordinance is for the time\nbeing vacant, or the Chairman is absent from a meeting of the Council or Committee, the meetings\nthereof or, as the case may be, the meeting from which the Chairman is absent, shall be presided\nat—\n(a)        in the case of the Central Council, by the Administrator-General ;\n1\n[(b)   in the case of the Provincial Council, by the Chief Administrator;]\n(c)        in the case of a District Committee, by the 2[District Officer (Revenue)] ;\n1\n[(d)   in the case of a Tehsil, Taluqa or Sub-divisional Committee, by the ex-officio\nmember, that is, 2[Deputy District Officer (Revenue)] or, if the ex-officio\nmember is himself the Chairman of the Committee, by the member elected by\nthe members present; and]\n(e)        in the case of a Local Committee, by the member elected by the members\npresent [:]3\n3\n[Provided that in case of temporary disability of the Chairman,\nDistrict Committee, the 2[District Officer (Revenue)] shall perform the\nfunctions of such Chairman.]\n1\nSubs. and added by Act No. X of 1997, ss. 16,17 and 18.\n2\nSubs. by Ordinance No.XXXV of 2002, s.7.(It shall come into force at once except in Islamabad Capital Territory where it shall come into force on\nsuch date as the Federal Government may, by notification in the Official Gazette, specify).\n3\nSubs. and added by the Finance Act, 1994 (Act No. XII of 1994), s. 8."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Section 21. Power of supersession and removal",
      "content": "1[(1) If the 2[Provincial] Council, in the case of a\nDistrict Committee, and the District Committee in the case of a Local Committee, is of the opinion\nthat a Committee constituted under this Ordinance—\n(a)         is unable to discharge or persistently fails in discharging its duties ; or\n(b)         is unable to administer its affairs ; or\n(c)         acts in a manner contrary to public interest ; or\n(d)         otherwise exceeds or abuses its powers ;\n(e)         has a majority of members who are not pious Muslims or who are engaged in\npolitical activity,\nThe 2[Provincial] Council or, as the case may be, the District Committee may, by a\nnotification, declare the concerned Committee to be superseded for such period not exceeding one\nyear as may be specified in the notification :\nProvided that the period of supersession may, if the 2[Provincial] Council or the District Committee\nconsiders it necessary to do so, be extended, beyond a period of one year.]\n(2) When a 2[declaration is made] under sub-section (1) in respect of a Committee,—\n(a)         the persons holding office as Chairman and members of the Committee to which the\nresolution relates, shall cease to hold office ;\n1\n[b)        all functions of the District Committee shall, during the period of supersession, be\nperformed by an Administrator appointed by the 2[Provincial] Council and in the case\nof a Local Committee such functions shall be performed by the Administrator\nappointed by the District Committee; and]\n(c)         before the expiry of the period of supersession, elections shall be held and selection\nor nominations made in accordance with the provisions of this Ordinance to\nreconstitute the Committee.\n(3) 2[Provincial] 1[Council, in the case of District Committee, and the District Committee, in the case\nof Local Committee,] is of the opinion that the Chairman or a member of a Committee constituted under this\nOrdinance—\n(a)         was at the time of his selection, election or nomination —\n(i)        not a 3[pious] Muslim ;\n(ii)       not an adult ;\n(iii)      not a resident of the area within the jurisdiction of the Committee ;\n(iv)       an undischarged insolvent ; or\n1\nSubs.by the Finance Act, 1994 (Act No. XII of 1994), s. 8.\n2\nSubs. by Act No. X of 1997 s. 19.\n3\nIns. by Ordinance No. VII of 1983, s. 5.\n(v)          not of sound mind ; 1[or]\n1\n[vi)      engaged in political activity]\n(b)        has been, during the period of three years preceding the date of his selection, election\nor nomination,\n(i)         ordered to execute a bond under section 108, 109 or 110 of the Code of\nCriminal Procedure, 1898 (Act V of 1898) ; or\n(ii)        convicted for an offence involving moral turpitude ; or\n(iii)       declared goonda under the law relating to the control of goondas ;\n(c)        has, after his selection, election or nomination, incurred any of the\ndisqualifications referred to in sub-clause (i), (iii), 1[(iv), (v) or (vi)] of clause\n(a), or sub-clauses (i), (ii) or (iii) of clause (b) ;\n(d)        has, without reasonable excuse, absented himself from three consecutive\nmeetings of the Committee;\n(e)        has been guilty of abuse of power or of misconduct in the discharge of his\nduties as Chairman or member, or been responsible for any loss 2[mis-\napplication, misappropriation or misuse] of any money or property of the\nCommittee ; or\n(f)        has become physically disabled from performing functions as Chairman or\nmember,\n2\n[the 3[Provincial] Council, in the case of a District Committee, and the District Committee,\nin the case of Local Committee, may, by a resolution, remove such Chairman or member from\noffice].\n2\n[*                *                      *                      *   *          *               *]\n2\n[(3A) If, after such inquiry as may be considered necessary, the 3[Provincial] Council, in the\ncase of a District Committee, or the District Committee in the case of a Local Committee, is of the\nopinion that the Chairman or a member of Committee or an employee assigned to work with a\nCommittee or an institution receiving Zakat Funds under this Ordinance, was guilty of misconduct in\nthe discharge of his duties, or is responsible for th loss, misapplication or misuse of Zakat Funds, the\n3\n[Provincial] Council or as the case may be, the District Committee shall initiate criminal\nproceedings against such Chairman, member, person or institution.\n1\nAdded and subs. by Ordinance No. VII of 1983, s. 5.\n2\nSubs. omitted and ins. by the Finance Act 1994 (Act No. XII of 1994) s. 8.\n3\nSubs. by Act No. X of 1997 s. 19.\nExplanation.__ For the purpose of clause (e) of sub-section (3) and sub-section (3A), the\nexpression “misconduct” means bribery, corruption, jobbery, favouritism, nepotism, wilful mal-\nadministration or wilful diversion of funds, and shall include an attempt or abetment of such\nmisconduct;]\n(4) When the Chairman or member of a Committee is removed from, or otherwise ceases to\nhold, office, the vacancy in the office of such Chairman or member shall be filled within such time\nas the 1[the 2[Provincial] Council, in the case of a District Committee, and the District Committee, in\nthe case of a Local Committee may] determine, by the election, selection or nomination, as the case\nmay be, in accordance with the provisions of this Ordinance, of a person qualified to hold the office.\n(5) The Chairman or member elected, selected or nominated under sub-section (4) shall hold\noffice for the unexpired term of his predecessor.\n1\n[(6) The 2[Provincial] Council may delegate to the Chief Administrator all or any of its\npowers and functions under the preceding provisions of this section in respect of a District\nCommittee or a Local Committee.]\n(7) The Chairman or a member of a Committee superseded under sub-section (1), or a\nChairman or member removed from office under sub-section (3), may, within such time, and in such\nform and manner, as may be prescribed, apply to the 2[Provincial] Council for a review of its\ndecision; and the decision of the 2[Provincial] Council in such review, given after giving to the\napplicant an opportunity of being heard, shall be final and shall not be called in question before any\nCourt or other authority.\n1\n[*                 *                     *                 *       *   *    *]\n3\n[21-A. 1[Vote of no confidence].—(1) Where in case of a 1[* * *] Local Committee, the\nDistrict Committee, after such enquiry as it may deem fit, is of the opinion that the members of that\nCommittee no longer have confidence in the Chairman, the District Committee may, in the\nprescribed manner, remove the Chairman from his office.\n4\n[(2) Where in the case of a member of a Local Committee, or of a Local Committee as a\nwhole, the District Committee, after such enquiry as it may deem fit, is of the opinion that the adult\nMuslim residents of the locality no longer have confidence in the member, or in the Committee as a\nwhole, the District Committee may, in the prescribed manner, remove the member from his office or\ndissolve the Committee as a whole.]\n(3) The vacancy in the office of Chairman or member 4[or members] so caused shall be\nnotified by the District Committee and shall be filled in accordance with the provisions of this\nOrdinance.]\n1\nSubs. omitted by the Finance Act, 1994 (Act No. XII of 1994), s. 8.\n2\nSubs. by Act No. X of 1997 s. 19.\n3\nIns. by Ordinance No.LII of 1980, s. 14.\n4\nsubs. and ins. by Ordinance No. VII of 1983, s. 6.\n1\n[22. Administrative organization.—(1) The administrative organization under this\nOrdinance shall be through 2[the Division concerned] and may include such organizations as are\nperforming social security and other complementary functions and that of a Chief Administrator, a\nDepartment or a part of a Department of the Provincial Government.\n(2) The Secretary of 2[the Division concerned] shall be the ex officio Administrator General\nZakat]."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Section 23. Certain persons to be public servants",
      "content": "Every person engaged in, or employed for, the\nadministration of this Ordinance shall be deemed to be a public servant within the meaning of\nsection 21 of the Pakistan Penal Code (Act XIV of 1860).\n3\n[Explanation.—For the purposes of this section, the Chairman and members of the District\nCommittee and Local Committee shall be the persons engaged in the administration of this\nOrdinance.]\n__________"
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Section 24. Exemption",
      "content": "The Federal Government may, in consultation with the Council of Islamic\nIdeology, exempt, by notification in the official Gazette, any specified class of cases or persons from\npayment of compulsory levy of Zakat or Ushr."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Section 25. Certain tax concessions",
      "content": "(1) Notwithstanding anything contained in any other law for\nthe time being in force, —\n(a)        in determining the tax liability of an assessee for an assessment year,—\n(i)        under the Income-tax Ordinance, 1979 (XXXI of 1979), his taxable\nincome shall be reduced by the amount paid by him to a Zakat Fund,\nduring the previous year relevant to that assessment year ; and\n(ii)       under the Wealth-tax Act, 1963 (XV of 1963), his assets in respect of\nwhich Zakat or contribution in lieu thereof, has been deducted at\nsource during the year relevant to that assessment year shall be\nexcluded from his taxable wealth ; and\n(b)        land-revenue and development cess shall not be levied on land on the produce\nof which Ushr or contribution in lieu thereof, has been charged on compulsory\nbasis.\n1\nSubs. by Act No. X of 1997, s. 20.\n2\nSubs. by Act No. LV of 2023, s.4.\n3\nAdded by the Finance Act, 1994, (Act No. XII of 1994), s.8.\n(2) Nothing in the preceding sub-section shall be deemed to affect the liability to pay\nincome-tax, wealth tax, land-revenue or development cess in respect of any period preceding the\nenforcement of the relevant provisions of this Ordinance.\n1\n[26. Power to make rules.—The Central Council may, notification in the official Gazette,\nmake rules for carrying out the purposes of this Ordinance;\nProvided that, if the Central Council so directs, the Provincial Council may, with the\napproval of the Central Council, make rules in respect of administrative matters.]\n1\n[27. Power to call for information and issue directions.—The Central Council, the\nAdministrator-General, a Provincial Council, a Chief Administrator, a District Committee, a Tehsil\nCommittee, a Taluqa Committee, a Sub-divisional Committee, or a Local Committee, may, within\nits or his jurisdiction, call for such information or record from, and issue such directions to the\nconcerned persons or agencies as may be necessary for the performance of its or his functions under\nthis Ordinance.]"
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Section 28. Indemnity and bar of jurisdiction",
      "content": "(1) No suit, prosecution or, other legal proceeding\nshall lie against any person for anything in good faith done or intended to be done under this\nOrdinance or any rule.\n(2) No Court shall call in question, or permit to be called in question, anything done or any\naction taken under this Ordinance or any rule.\n(3) No Court shall grant any injunction or make any order, nor shall any court entertain any\nproceedings, in relation to anything done or intended to be done or any action taken or intended to be\ntaken under this Ordinance or any rule.\n________________________________________________________________________________\n1\nSubs.by Act No. X of 1997, s. 21 and 22.\n(a) For the Zakat (Transfer and Disbursement) Rules, 1980, vide S.R.O. No. 758 (I)/80 dated the 12th July, 1980 see Gaz. of P., 1980 Ext.,\npp. 1387—1390.\n(b) For the Islamabad Capital Territory Local Committee (Constitution) Rules 1980 vide S.R.O. No. 1159(I)/80, dated the 23rd November,\n1980, see Gaz. of P., 1980 Ext. Pt. II., PP. 2225—2228.\n(c) For the Islamabad Capital Territory Local Committee and the Islamabad Zakat and Ushr Committee (Procedure) Rules, 1980, vide\nS.R.O. No. ll60(l)/80, dated the 23rd November, 1980, see Gaz. of P., 1980, Ext.. Pt. II. pp. 2229—2230.\n(d) For the Zakat (Deduction and Refund) Rules, 1981, vide No. CA 1155/CD 2(5), dated the 23rd April, 1981, see Gaz. of P., Ext., Pt. III.\npp. 197—222.\n(e) For the Islamabad Capital Territory Local Committee (Removal of Chairman and Members) Rules, 1982, vide S.R.O. III(I)/82, dated the\n3rd February, 1982, see Gaz. of P., 1982, Ext., Pt. II pp. 151—155.\n(f) For the Ushr (Assessment and Collection) Rules, 1983, vide S.R.O. No. 2l9(I)/83, dated the 2nd March, I983 see Gaz. of P., 1983 Ext.,\nPt. II, pp. 287—298.\n(g) For the Punjab Ushr (Assessment and Collection) Rules, 1983 vide S.R.O. No. 305(I)/83, dated the 27th March, 1983, see Gaz. of P.;\n1983, Ext., Pt. II pp. 433— 444.\n(h) For the Baluchistan Ushr (Assessment and Collection) Rules, 1983, vide S.R.O. No. 306 (l)/83, dated the 27th March, 1983, see Gaz. of\nP., 1983, Ext., Pt II pp. 445—456.\n(i) For the Sind Ushr (Assessment and Collection) Rules 1983, vide S.R.O. No. 334(I/83, dated the 30th March, I983f.see Gaz. of P., 1983.\nExt., Pt. II. pp. 491—503.\n(j) For the North-West Frontier Province Ushr (Assessment and (Collection) Rules, 1983, vide S.R.O. No. 335 (I)/83, dated the 2nd April,\n1983 see. Gaz of P., 1983 Ext., Pt.. II, pp. 505—517.\n(k) For the Superseded and Removed Chairman and Members of Zakat Committees (Application for Review) Rules, 1985, vide S.R.O. No.\nl47(I)/85, dated the 14th February, 1985, see Gaz., of P., 1985, Ext., Pt. II, pp. 197-198."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Section 29. Removal of difficulties",
      "content": "The Federal Government may make such provisions1 as may\nbe necessary to remove any difficulty in carrying out the purposes of this Ordinance.\n2\n[29A. Dissolution and reconstitution of Committees.—All existing District Zakat and Ushr\nCommittees, Tehsil Taluka and Sub-Divisional Zakat and Ushr Committees and Local Zakat and\nUshr Committees shall stand dissolved and cease to function with immediate effect and new\nCommittees shall be constituted under sections 16, 17 and 18 within a period of 3[six months] from\ncommencement of the Zakat and Ushr (Amendment) Ordinance, 2000.]"
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Section 30. Repeal",
      "content": "The Zakat and Ushr (Organisation) Ordinance, 1979 (XXIX of 1979), is\nhereby repealed.\n1\nThe Zakat and Ushr Ordinance, 1980 has been modified as shown below:\n(1) S.R.O. 646(I)/80,dated the 22nd June, 1980.\n(2) S.R.O. 104(I)/81, dated 5th February, 1981.\n(3) S.R.O. 739(I)/81-A, dated 8th July, 1981.\n(4) S.R.O. 1207(I)/81, dated 15th November, 1981.\n(5) S.R.O. 523(K)/82, dated 6th June, 1982.\n2\nIns. by Ordinance No. LIX of 2000, s.5.\n3\nSubs. by Ordinance No. XXI of 2001, s.2 and shall be deemed always to have been so subs.\n(See section 2 and 3)\n1\nS.No.    Assets                          [* * *]   Rate and basis for computing the     The Deduction           The Deducting\namount to be deducted as Zakat       Date                    Agency\n1\n1        2                               [*]       4                                    5                       6\n1"
    },
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Section 1. Savings Bank [* * *] 2.5% of the amount standing to As notified by the The bank,",
      "content": "Accounts and                              the credit of an account at the      Administrator-          Office, Centre,\nsimilar accounts                          commencement of the day on the       General for the         or institution, as\nby whatever                               Valuation Date. 1[No deduction       Zakat year.             the case may\nname described                            shall be made in case the amount                             be, keeping the\n2[\n* * *]- with the                        standing to the credit of an                                 account.\nbanks operating                           account does not exceed the\nin Pakistan post                          amount     notified     by   the\noffices, National                         Administrator-General].\nSavings Centres\nand financial\ninstitutions\nkeeping such\nAccounts.\n1                                                  1"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Section 6. I.C.P. Mutual Fund",
      "content": "1[         2.5% of the face       The date on which the\nCertificates.                     ***]\nvalue, or the          first return is paid in the   Investment\nmarket value based     Zakat year.                   Corporation of\non the closing rate                                  Pakistan.\nat the Karachi\nStock Exchange,\nwhichever be\nlower as on the\nValuation Date in\neach Zakat year.\n3\nGovernment             2 1[\n2.5% of the face       The date on which the         The bank, office or"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Section 7. ***] value of the institution as the case",
      "content": "securities (other than                                             first return is paid or the\nGovernment                                           may be, responsible\nprize bonds and                                                    date of                       for paying the return\ncertificates men-                           securities as on the   encashment/redemption,        or encashing/\ntioned at serial                            Valuation Date in      whichever be earlier in       redeeming the securi-\neach Zakat year.       the Zakat year.               ty.\nnumber 3 and 4) on\nwhich return is        3\nreceivable by the\nholder periodically.\nThe corporation,\nSecurities including                        If listed on the       The date on which the\ncompany or"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Section 8. shares and debentures 1[",
      "content": "***]      stock exchange,        first return is paid, or\ninstitution, as the\n1\nof [companies or                            2.5% of the paidup     the date of\ncase may be,\nstatutory                                   value, or the          encashment/redemption,\nresponsible for\nCorporations]                               market value based     whichever be earlier in\npaying the return or\non the closing rate    the Zakat year.\n(excluding those held                                                                            encashing/redeeming\nin the name of a                            at the Karachi                                       the security.\n1\n[company or a                             Stock Exchange,\nstatutory corporation]                      whichever be\nand those mentioned                         lower as on the\nat serial number 5, 6                       Valuation Date, in\nand 7), on which                            each Zakat year. If\nnot listed on the\nreturn is payable\nstock exchange\nperiodically or\n2.5% of the paid-\notherwise, and is\nup value on the\npaid.\nValuation Date, in\neach Zakat year.\n1Subs. and omitted by Ordinance No. LII of 1980, s. 15.\n1\n1            2                               [*]                          4                               5                     6\n1                              1"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Section 9. Annuities [* * *] [2.5% of the The date of 1[first] 2",
      "content": "[The insurer or the\naggregate amount               payment of the         bank keeping the\nof annuity benefit             annuity benefit, or    amount in the form\nin each Zakat year             of the surrender       of an annuity.]\nor 2.5% of the                 value, whichever be\nsurrender value on             earlier in the Zakat\nthe Valuation Date,            year.\nas the case may be.]\n1                              1"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Section 11. Provident Funds. [* * *] [In case of non",
      "content": "[The date of [The authority,\nrefundable advance,            payment of the         officer or institution\n2.5% of the amount             advance or of the      making payment of\ndrawn or, in case of           balance.]              the advance or of the\nfinal settlement,                                     balance.]\n2.5% of the balance\nstanding to the\ncredit of the\nsubscriber as on the\nValuation Date,\nexcluding in both\ncases the\nemployer’s\ncontribution and the\nreturn accrued\nthereon.]\n1\nOmitted, subs. and ins. by Ordinance No. LII of 1980, s.15.\n2\nSubs. by S.R.O. No. 739(1)/81—A32, dated 8th July, 1981, see Gazette of Pakistan, 1981, Part II, page 1729.\nNote.—1.                  Deduction at source exceeding two and one-half per cent of the value of an asset\nspecified in this Schedule, shall not be made in respect of that asset within the same\nZakat year.\n1\n[1A, No Zakat shall be charged on the amount paid as premium of a life insurance\npolicy of a person from his Provident Fund and, where the proceeds of a life\ninsurance policy of a person are credited to his Provident Fund during a Zakat year,\nno Zakat shall be charged on the amount received or drawn during that year as final\nsettlement of his account in the Provident Fund or as non-refundable advance, to the\nextent of the procedes so credited.]"
    }
  ],
  "definitions": [
    {
      "term": "Provincial Council",
      "definition": "a Council constituted under section 14;] (xx) ‘recognised Provident Fund’ means a Provident Fund recognised as such, by the competent authority, under the Income Tax Ordinance, 1979 (XXXI of 1979) ; (xxi) ‘return’ means income, howsoever described, accruing on an asset ; (xxii) ‘rules’ means rules made under this Ordinance ; 2 [(xxiii) ‘sahib-e-nisab’ means a person who owns or possesses assets not less than nisab, but does not include— (a) the Federal Government, a Provincial Government or a local authority; (b) a statutory corporation, a company or other enterprise, owned wholly, directly or indirectly, by the Federal Government, a Provincial Government, a local authority or a corporation owned by the Federal Government or a Provincial Government, either singly or jointly with one or more of the other three ; (c) a subsidiary of a statutory corporation, a company or other enterprise referred to in sub-clause (b) and wholly owned by it ; (d) the National Investment (Unit) Trust ; (e) an ICP Mutual Fund ; (f) a recognised Provident Fund ; (g) any Unit Fund maintained by the Defence Services, including the Civil Armed Forces ; (h) a Zakat Fund ; (i) an institution, fund, trust, endowment or society___ (a) registered as a charitable organisation under the Societies Registration Act, 1860 (XXI of 1860), or as a company under section 26 of the Companies Act, 1913 (VII of 1913), or registered or approved as a charitable or social welfare organisation under any other law for the time being in force, and (b) approved by the Central Board of Revenue for the purposes of section 47 of the Income Tax Ordinance, 1979 (XXXI of 1979); 1 Added by Act No.X of 1997 s. 2. 2 Subs. by Ordinance No. LII of 1980, s. 3. (j) a deeni madrasah registered as such by the Auqaf Department ; (k) a mosque ; (l) an orphanage registered as such under the law relating to orphanages ; (m) a Workers Participation Fund established under the Companies Profits (Workers Participation) Act, 1968 (XII of 1968); or (n) amount of a party to a suit or case kept with or under the orders of a court pending decision of the suit or case ;] (xxiv) ‘security’ means any stock, share, scrip, debenture, bond, pre-organisation certificate, or instrument commonly known as security; (xxv) ‘share’ means a share in the share-capital of a company, or in any body corporate established by or under a Federal law or a Provincial law, and includes stock; 1 [(xxvi) ‘sub-division’ means a sub-division of a district as notified by the Provincial Government ;] (xxvii) ‘surrender value’ means the sum payable by an insurer on cancellation of a life-insurance policy or annuity, according to stipulated terms and conditions, at any time before maturity benefits become available; (xxviii) ‘survival benefit’ means the amount payable according to life-insurance policy conditions, during the currency of a policy, on survival of the life assured to the specified date as stipulated in the policy; 2 [(xxix) ‘Taluqa Committee’ or ‘Sub-divisional Committee’ 3[or Town Committee] means a committee constituted under section 17 ; (xxixa) “Tehsil Committee” means a Tehsil committee constituted under section 17 or, in the case of the Islamabad Capital Territory, the Islamabad Zakat and Ushr Committee;] 4 [(xxx) ‘Valuation Date’ means— (a) in respect of assets liable to Zakat, the first day of the Zakat year ; and (b) in respect of produce liable to Ushr, such date or dates as may be prescribed or as may be notified by the Administrator-General or by a Chief Administrator within his jurisdiction ; for the evaluation of the assets or the produce for the purpose of this Ordinance ;] 1 Subs by the Finance Act 1994, (Act No. XII of 1994) s. 8. 2 Added by Act No. X of 1997,s. 2. 3 Ins. by Ordinance No.XXXV of 2002, s.2.( It shall come into force at once except in Islamabad Capital Territory where it shall come into force on such date as the Federal Government may, by notification in the Official Gazette, specify). 4 Subs. by Ordinance No. LII of 1980, s. 3. (xxxi) ‘Zakat Fund’ means a Fund established under section 7 ; and (xxxii) ‘Zakat year’ means year according to the Hijra calendar for which Zakat is chargeable, commencing on the first day of Ramadhan-ul-Mubarak and ending with the last day of the following Sha’ban-ul-Moazzam : Provided that the first Zakat year shall commence with the com- mencement of this Ordinance and end with the last day of Sha”ban-ul- Moazzam, 1401 A. H.",
      "source_provision": "sec2"
    }
  ]
}
